{
  "companyName": "3M",
  "companyTicker": "MMM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/3m-mmm-q3-2022-earnings-call-transcript/",
  "content": "3M (MMM -0.54%)\nQ3 2022 Earnings Call\nOct 25, 2022, 9:00 a.m. ET\n\nOperator\n\nWelcome to the 3M third quarter earnings conference call. [Operator instructions] As a reminder, this conference is being recorded, Tuesday, October 25, 2022. I would now like to turn the call over to Bruce Jermeland, senior vice president of investor relations at 3M.\n\nBruce Jermeland -- Senior Vice President, Investor Relations\n\nThank you, and good morning, everyone, and welcome to our third-quarter earnings conference call. With me today are Mike Roman, 3M's chairman and chief executive officer; and Monish Patolawala, our chief financial and transformation officer. Mike and Monish will make some formal comments, and then we'll take your questions. Please note that today's earnings release and slide presentation accompanying this call are posted on the homepage of our Investor Relations website at 3m.com.\n\nPlease turn to Slide 2. Please take a moment to read the forward-looking statement. During today's conference call, we'll be making certain predictive statements that reflect our current views about 3M's future performance and financial results. These statements are based on certain assumptions and expectations of future events that are subject to risks and uncertainties.\n\nItem 1A of our most recent Form 10-K lists some of the most important risk factors that could cause actual results to differ from our predictions. Please note throughout today's presentation, we'll be making references to certain non-GAAP financial measures. Reconciliations of the non-GAAP measures can be found in the appendix to these slides and in the attachments to today's press release. With that, please turn to Slide 3, and I'll now hand the call off to Mike.\n\nMike?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nThank you, Bruce. Good morning, everyone, and thank you for joining us. We continue to execute our strategies to deliver for our customers, position 3M for long-term growth, and manage legal matters. Our team posted organic growth of 2% or more than 3%, excluding the impact of the decline in disposable respirator sales along with adjusted margins of 21.5%, adjusted EPS of $2.69, and $1.4 billion of adjusted free cash flow.\n\nWhile the global economic outlook is softening, our businesses continue to innovate for customers and capitalize on opportunities. Transportation and electronics posted 3% organic growth with safety and industrial, consumer, and healthcare, each growing 2%. All business groups delivered margins above 21%, with notable margin expansion in safety and industrial and transportation and electronics. Looking geographically, organic growth was led by APAC up 3%, with China up 8%, benefiting from backlog recovery following the COVID-related lockdowns in the second quarter.\n\nThe Americas were up 2% with the U.S. flat against 6% growth in last year's Q3. Growth in EMEA was flat as we navigate the ongoing geopolitical unrest across Europe. At the same time, we drove operational improvements to address inflation and supply chain challenges.\n\nWe are delivering strong pricing, managing costs and reducing inventory backlogs while maintaining a relentless focus on serving customers. For example, we recently invested in a new shipping consolidation center in South Carolina, which is reducing average cycle times for exports to Asia by one to two weeks. Some of our actions have impacted near-term margins, but we will continue to do what is necessary to take care of customers. Going forward, we see a significant opportunity to reduce cost of goods sold and working capital as global supply chains improve, which includes leveraging data and data analytics to drive productivity in our plants.\n\nWith respect to guidance, today, we are updating full-year expectations to reflect our results through nine months, along with the continued strengthening of the U.S. dollar and ongoing macroeconomic and geopolitical uncertainty. For organic growth, we are lowering the high end of our range to 1.5% to 2% against the prior range of 1.5% to 3.5%. We anticipate adjusted EPS of $10.10 to $10.35 against the previous expectation of $10.30 to $10.80.\n\nWe are also updating our range for adjusted free cash flow conversion to 85% to 95% from 90% to 100% previously. To strengthen 3M for the future, we continue to invest in growth, productivity, and sustainability. For example, while we see near-term softness in consumer electronics, we are investing in electronic segments that are seeing strong growth including new solutions for automotive displays and virtual and augmented reality. We are rolling out new thermal management solutions to improve electric car batteries, one element of our work to advance more sustainable vehicle designs.\n\nAnd earlier this month, we introduced a new posted app for Microsoft Teams that helps people collaborate in hybrid environments as we execute our digital strategy and reimagine our products. We're also innovating to make our operation safer, more efficient, and more productive. At our plant in Alexandria, Minnesota we are leveraging 3M disruptive technologies to transform our abrasive belt converting process through end-to-end automation, improving labor productivity by 32%, eliminating 9 high-risk tasks, and saving nearly $1 million annually. Many more similar projects are on the way across our global operations, driving safety and savings.\n\nIn sustainability, we have installed a new state-of-the-art water filtration system in Cordoba, Illinois. We now have all 3 of our largest water-using sites in the U.S., utilizing industry-leading filtration technologies following through on the $1 billion sustainability commitment we made last year. At the same time, we are positioning 3M for long-term success by actively managing our portfolio complementing all we do to strengthen our enterprise organically. Last month, we completed the divestiture of our food safety business, which unlocks value and further strengthens our balance sheet.\n\nWe received approximately $1 billion and reduced our outstanding share count by $16 million. In addition, earlier this month, we divested two of our skincare brands in Southeast Asia enabling us to prioritize other parts of our consumer portfolio. We have also established a dedicated team to seamlessly execute our healthcare spin-off. We are confident in our plan to create two world-class public companies with greater focus and better able to drive growth and innovation.\n\nBefore turning the call to Monish, I would like to provide an update on litigation, which I know is top of mind. On Combat Arms, the Aearo Technologies Chapter 11 proceeding is active and progressing. And we believe it is the best path to resolving claims in an equitable, efficient, prompt, and permanent manner. That continues to be our goal, a resolution that is equitable and more certain for all parties.\n\nAearo is participating in a confidential mediation process focused on reaching a comprehensive settlement and 3M is supporting those efforts. Aearo has also appealed the bankruptcy court's decision in August not to extend the stay of litigation to 3M, and the Seventh Circuit has agreed to hear the appeal. In the MDL, the next trial is scheduled for February of next year. We also continue to actively manage PFAS litigation.\n\nEarlier this month, we reached a settlement with the city of Gadson, Alabama, related to carpet manufacturing. The first ALF MDL trial is now scheduled for June of 2023. In summary, we continue to deliver for customers in an uncertain environment. I thank our employees for their contributions and commitment, especially as we continue to lead through significant change and position 3M for the future.\n\nWe will stay focused on driving growth, improving operational execution, and delivering greater value for customers and shareholders. I will now turn it over to Monish for more details on the quarter. Monish?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nThank you, Mike, and I wish you all a very good morning. Please turn to Slide 4. Overall, the 3M team delivered third-quarter sales and operating margins that were very much in line with my comments at a conference in mid-September. With some puts and takes, as consumer and consumer electronics demand declined as the quarter progressed while industrial end markets demand remained steady.\n\nThird quarter total sales were $8.6 billion or down 3.6% year on year, which included headwinds off 5.1% of $450 million from foreign currency translation and 50 basis points of $50 million from the divestiture of food safety, along with the deconsolidation of Aearo Technologies. On an organic basis, third-quarter sales increased 2% versus last year. This result includes an anticipated falloff in disposable respirator demand, which negatively impacted organic sales by approximately $130 million or 1.4 percentage points. Excluding this decline, Q3 organic sales growth was 3.4%.\n\nOn an adjusted basis, third-quarter operating income was $1.9 billion with operating margins of 21.5%, which were up 40 basis points year on year and 50 basis points sequentially. Adjusted earnings for the quarter were $2.69 versus $2.58 last year. Turning to the components that impacted third-quarter operating margins and earnings year-on-year performance. As you may recall, during our Investor Day this past February, we laid out our operating framework and operating principles that included daily management, data democratization, transparency, and accountability.\n\nWe continue to make progress on the consistency of application of this framework. By embracing these principles, along with taking self-help actions, the team executed well in the quarter as we continue to navigate the fluid and uncertain macro and geopolitical environment. We continue to focus on serving our customers and drive additional actions, including recovering our sales backlog in China from the April and May COVID-related lockdowns, implementing appropriate selling price actions to address ongoing inflation, maintaining strong spending discipline, implementing targeted productivity actions to adjust businesses to end market demand trends while driving simplification and continuing to invest in growth productivity and sustainability to ensure we are all well positioned for long-term success. These actions helped to more than offset a number of headwinds in the quarter, including the decline in disposable respirator sales, which negatively impacted Q3 operating margins by 30 basis points and earnings by $0.07 a share.\n\nIncremental end market softness, particularly in consumer electronics, along with oral care and consumer retail in the U.S. as persistent inflationary pressures are slowing consumer spending. Ongoing global supply chain challenges and raw material constraints. And finally, geopolitical impacts, particularly Russia, which was a year-on-year headwind of $50 million to revenue and $0.03 to earnings per share.\n\nIn total, our operating framework and sell-up actions resulted in an overall net benefit to operating margins of 2.9 percentage points and $0.41 to earnings. Moving to raw material and logistics inflation. As I've noted over last several quarters, inflationary pressures remain persistent and are broad-based. Therefore, we continue to experience year-on-year headwinds with a Q3 cost increase of approximately $225 million or a negative impact of 2.6 percentage points to operating margins and $0.31 to earnings.\n\nOur full-year raw materials and logistics inflation estimate of $750 million to $850 million remains unchanged. And as we have said before, we continue to expect to offset this through pricing actions. The strength of the U.S. dollar continued to affect total revenue as foreign currency translation was a negative 5% impact.\n\nAs a result, we had a benefit of 10 basis points to margins, however, incurred a headwind of $0.12 to earnings per share. As Mike mentioned, we have been actively managing our portfolio. On September 1, we closed the food safety divestiture, resulting in approximately $1 billion in consideration received along with reducing outstanding share count by $16 million via an exchange offer. However, we lost 1 month of sales and income from food safety in the quarter.\n\nTherefore, the lost sales and income from food safety, along with the deconsolidation of Aearo Technologies, resulted in a year-on-year headwind of $0.02 to earnings per share in the quarter. Finally, other financial items increased earnings by net $0.15 per share year on year driven equally by benefits from a lower share count along with a lower-than-expected tax rate. The lower third-quarter adjusted tax rate was primarily the result of favorable outcomes from prior year audit settlements and geographic income mix. Looking at the full year, we now expect our adjusted tax rate in the range of 17.5% to 18.5% versus 18.5% to 19.5% previously.\n\nPlease turn to Slide 5. Third quarter adjusted free cash flow was $1.4 billion with conversion of 88%, an improvement from first half performance as we drive working capital intensity including improved inventory levels while also increasing capex for growth and sustainability investments. We remain focused on working capital improvement as we continue to navigate through a fluid supply chain environment. Even though the environment remains challenging, we are realizing benefits from our efforts as we leverage the use of data and data analytics to reduce inventory levels through better demand planning and optimized customer payment terms.\n\nWe expect to continue to realize benefits from our actions as we move forward. Capital expenditures were $435 million in the quarter and $1.2 billion year to date or up 19% year on year as we continue to invest in growth, productivity, and sustainability. Based upon the current status of supply chains and pace of projects, we now expect full-year capex investments in the range of $1.75 billion to $1.85 billion. During the quarter, we returned $1 billion to shareholders through the combination of cash dividends of $850 million and share repurchases of $155 million.\n\nOn a year-to-date basis, we returned $3.5 billion to shareholders including $2.6 billion in dividends and $900 million in share repurchases. In addition, we reduced our outstanding share count by 16 million via an exchange offer associated with the food safety divestiture. Both dividends and share repurchases remain important pillars of our capital allocation strategy. We continue to see the current value of the stock as a very attractive opportunity and have resumed share repurchase activity following the food safety divestiture.\n\nHaving a strong balance sheet and capital structure remains a priority for 3M because of the flexibility it provides us to continue to invest organically in the business, pursue strategic M&A opportunities and return cash to shareholders while navigating legal matters. Net debt at the end of Q3 stood at $12.1 billion, down 3% year on year and down over 30% since 2019. Please turn to Slide 7 for our business group performance for Q3. I will start with our Safety and Industrial business, which posted sales of $2.9 billion or up 1.7% organically compared to last year's third quarter.\n\nThis result included a year-on-year headwind of approximately $130 million due to the ongoing decline in demand for disposable respirators. Excluding disposable respirators, Safety and Industrial posted Q3 organic growth of over 6%, driven by broad-based performance along with the backlog recovery in China from the April and May COVID-related lockdowns. Our personal safety business declined low double digits organically, primarily due to the decline in COVID-related disposable respirator demand. Turning to the rest of safety and industrial.\n\nOrganic growth was led by low teen increases in both automotive aftermarket and roofing granules. Electrical markets and abrasives grew high single digits while closure and masking systems and industrial adhesives and tapes delivered mid-single-digit growth. Operationally, the Safety and Industrial team drove strong execution during the third quarter, delivering adjusted operating income of $673 million up 8% versus last year and up 7% sequentially versus Q2. Adjusted operating margins were 23.2%, up 2.5 percentage points as the team managed inflation with price actions drove yield and efficiency and exercise strong spending discipline.\n\nThe safety and industrial business group continues to focus on investing for the future, including in digital platforms such as repair stack for connected automotive body shops and sustainable platforms like thermal barriers for auto electrification. Moving to transportation and electronics, which posted sales of $2.2 billion or up 3% organically compared to last year. Overall growth was benefited by COVID-related backlog recovery in the Greater China region, which was partially offset by increased weakness in consumer electronics demand, along with the continued constraints in the semiconductor supply chain. Our electronics-related business declined mid-single digits organically with decreases across consumer electronics, particularly smartphones, tablets, and TVs.\n\nThese declines were partially offset by continued strong demand for our solutions in semiconductor, factory automation, and automotive end markets. Organic sales in our auto OEM business were up 21% year on year as compared to an estimated 27% increase in car and light truck builds. As you may recall, we outperformed last year's Q3 build rate by nearly 20 percentage points as we benefit from a channel inventory build, which was unwound in Q4 last year. Turning to the rest of transportation and electronics.\n\nCommercial solutions grew organically high single digits, while advanced materials grew mid-single digits and transportation safety was down low single digits. Despite the continued fluid end market environment, the transportation and electronics team delivered strong operating performance. Third quarter operating income increased 9% to $474 million with operating margins of 21.2%, up 2.5 percentage points year on year. Operating margins were benefited by price actions as we navigated inflationary pressures along with the strong spending discipline.\n\nThe transportation and electronics business group is investing to solve some of the toughest challenges in the market and executing for future growth. For example, in Q3, we opened a new battery component testing lab to support accelerating opportunities in automotive electrification. Looking at our healthcare business, which delivered Q3 sales of $2.1 billion with organic growth of 1.7% versus last year's strong 8% comparison. Our medical solutions, food safety, separation and purification and health information systems businesses all increased low single digits organically.\n\nWhile we did have organic growth in separation and purification year on year, biopharma was down in the U.S. due to last year's strong demand for COVID therapeutics. Third-quarter elective medical procedure volumes were approximately 90% of pre-COVID levels as we saw activity dip in July and ramp back up as we went through the quarter. Fourth-quarter procedure volumes are currently projected to be 90% to 95% of pre-COVID levels as labor shortages continue to impact the pace of recovery.\n\nOral care was down mid-single digits against low double-digit growth from a year ago. We are also seeing softening due to the ongoing inflationary pressures impacting consumer spending on discretionary oral care and orthodontic procedures. Healthcare's third-quarter operating income was $452 million, down 11% year on year. Operating margins were 21.8%, down 1.7 percentage points with adjusted EBITDA margins of over 29%.\n\nYear-on-year operating margins were impacted by increased raw materials and logistics costs along with manufacturing productivity headwinds. These impacts were partially offset by price actions and spending discipline. The healthcare business group is focused on delivering innovation, including investments in the launch of 3M filltech matrix, which creates a new and innovative approach for dental restorations, simplifying the procedure and enabling more natural tooth structure to remain. In addition, the team made capital investments to support manufacturing capacity expansions in the separation and purification and medical solutions business.\n\nLastly, our consumer business posted third-quarter sales of $1.4 billion or up 1.5% year on year on an organic basis versus last year's 8% comparison. Year-on-year growth in the third quarter was led by consumer health and safety, which was up mid-single digits organically and stationery and office and home care, which both grew low single digits. Home improvement growth was down low single digits organically versus last year's strong comparison, however, increased mid-teens sequentially. The back-to-school season was softer than expected as consumer spending continues to be impacted by ongoing inflationary pressures, along with retailers aggressively addressing elevated inventory levels.\n\nLooking ahead, we anticipate these impacts to continue throughout the upcoming holiday season. Consumer's third-quarter operating income was $299 million, down 3% compared to last year, with operating margins of 21.3%, down slightly year on year. Our consumer business operating margins benefited from selling price actions, spending discipline, and restructuring actions. These benefits were more than offset by increase in raw materials, logistics and outsourced hard good manufacturing costs and manufacturing productivity headwinds.\n\nThe consumer business group is executing for future growth including expanding our command platform to help consumers hang, organize and decorate in even more creative ways. Please turn to Slide 9 for a discussion on our 2022 outlook. The macro-environment remains uncertain with mixed trends and signals across geographies and end markets. While we are working through these challenges and taking actions, we are updating our full-year guidance, reflecting our year-to-date performance, increasing U.S.\n\ndollar strength, along with the continued fluid environment. Our updated 2022 full-year outlook includes organic growth in the range of 1.5% to 2% versus a prior range of 1.5% to 3.5%. Adjusted earnings in the range of $10.10 to $10.35 versus a prior range of $10.30 to $10.80, which includes an additional headwind of $0.15 per share from foreign currency exchange compared to just three months ago. And adjusted free cash flow conversion to be in the range of 85% to 95% versus a prior range of 90% to 100%.\n\nBefore I wrap up, let me make a few comments regarding the fourth quarter. First, from an end market perspective, GDP and IPI continued to moderate with current Q4 estimates of 1.4% and 2.2%, respectively. We are closely monitoring the geopolitical environment in Europe and the impact on energy inflation and end market demand. Auto build rates are currently estimated to be up 2% year on year while consumer electronics demand is expected to remain soft.\n\nHealthcare elective procedure and oral care volumes are expected to be in the range of 90% to 95% of pre-COVID levels. And lastly, we anticipate continued inflationary impacts on consumer spending, along with the inventory reduction actions at retailers. Therefore, looking at the fourth quarter, we expect total sales to be in the range of $7.9 billion to $8.2 billion. This includes organic growth in the range of 1% to 3%, which includes a 2% headwind of $150 million to $200 million from the continued decline in disposable respirator demand.\n\nAnd the exit of Russia, which will create a year-on-year headwind of approximately 80 basis points or approximately $70 million. Excluding the impact from these two items, Q4 organic growth is estimated to be nearly 4% to 6%. Increasing U.S. dollar strength is anticipated to be a year-on-year headwind of approximately 7% of sales or roughly $600 million.\n\nThe divestiture of food safety and deconsolidation of Aearo Technologies will result in a Q4 headwind of approximately $120 million to sales of 1.5%. Turning to raw materials and logistics costs. We anticipate a Q4 year-on-year headwind of approximately $100 million to $150 million, which we expect to able to navigate and offset the price actions. Operating margins are expected to be in the range of 20% to 21%.\n\nAnd finally, our outstanding share count is currently anticipated to be in the mid 550 million share range taking into account the 16 million share count reduction that I mentioned earlier. Looking ahead to 2023, while we are in the early stages of working through our plan, we see some items impacting us this year that will continue into next year while some challenges may ease. We expect the macroeconomic environment to continue to moderate while geopolitical uncertainties persist, impacting energy costs and end market demand, particularly in Europe. We are also monitoring the impact of the strong U.S.\n\ndollar along with evolving COVID-related impacts, including on government policy response, healthcare elective procedure volumes, and disposable respirator demand. Looking at end markets, we expect the pace of secular industry trends to accelerate, particularly in automotive, electronics, safety, digitization, and sustainability. Each of these markets have tremendous opportunities for long-term growth as we continue to innovate and invest in these areas. Raw material, logistics, and labor inflation are starting to show some signs of moderation, and we are starting to see some evidence of global supply chain stabilization.\n\nAs Mike mentioned, we believe manufacturing and supply chain operations are our greatest opportunity to reduce costs and increase productivity to drive improvement in operating margin performance. While significant uncertainty is expected to remain, we are focused on serving customers and executing our operating framework and operating principles. We are prepared and will adjust as warranted and take necessary self-help actions to deliver long-term value for all our stakeholders. And finally, we are also working on ensuring we execute well on our healthcare spin to create two leading world-class companies.\n\nAs always, there is more we can do and will do. To wrap up, I want to thank our customers and suppliers for their partnerships and the 3M employees for their hard work and dedication as they continue delivering for our customers. That concludes my remarks for the third quarter. With that, we will now take your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Scott Davis with Melius Research.\n\nScott Davis -- Melius Research -- Analyst\n\nYou guys were pretty clear about the end market outlook and stuff. Can you just take a step backwards and walk around the world just by region on where things are getting kind of better or worse or where things coming in a little bit better or worse than expectations? And I guess the onus of the question is that some of the results we've seen so far have been a little bit better in Europe and China than expected that you guys noted some cautious comments there. But I'll just stop there and let you guys give some color.\n\nMike Roman -- Chairman and Chief Executive Officer\n\nSure, Scott. Maybe I'll kind of walk around the regions to give you a little more color than my opening comments highlighted where we are growing in each region. Just start with the Americas. And as you look at it, we saw the strongest growth for us in automotive in areas like electrical markets and our electronics markets and material solutions.\n\nWe saw declines in personal safety. Monish highlighted the separation and purification coming off the comparison to the COVID demand in vaccines and therapeutics. And then we highlighted the softer consumer spending in oral care, both orthodontics and chairside dentistry. Looking at EMEA, we saw it up slightly this quarter.\n\nIt was slightly negative in Q2. So slightly up this quarter, strongest growth there in automotive, too. So you're seeing a trend, the strong Q3 for automotive globally. We saw declines in personal safety and oral care, coming off COVID for personal safety and some of the similar dynamics in oral care.\n\nAPAC growth, again, led by automotive. Personal safety was strong in APAC. We saw some strong strength in industrial portfolios more broadly. Something that we saw in the quarter in the safety and industrial business ex-personal safety had strong growth in the quarter, organic growth.\n\nSo the decline was in electronics and APAC. We also saw some impact from some of the declines in areas like transportation safety. And then in China, the big story was the recovery from the lockdowns in Q2 and then also the declines in display materials and broader electronics as you saw the declines in consumer electronics impacting that. We were -- we did see strength in personal safety.\n\nWe saw strength in automotive. We saw strength in broader industrial. So kind of a similar story across the areas, a little different growth dynamics, but similar story. And we -- I would say we finished the quarter with our industrial businesses showing some strength.\n\nWe saw continued strength in automotive, the softening in consumer electronics. Those are some of those trends that played out across the world. And then elective procedure is starting to see seeing the same trend improving, but not back to pre-COVID levels in terms of elective procedures. So again, trends that we're seeing across the different regions.\n\nScott Davis -- Melius Research -- Analyst\n\nOK. That's super helpful. And then just to be clear, Mike, is price where you want it to be right now, are we kind of at a fairly balanced level versus cost, and that's no longer a major issue?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nYes, Scott, we talked about that as we've gone through the year. We said at the beginning of the year that we were confident price would help us offset inflation as we came through the year, and that's been the case. Our pricing, as you know, it's one component of those our value in the marketplace. The other is managing the inflation that we've been seeing globally.\n\nAnd we have been, I think, managing that price against inflation well all year, and we're well positioned as we go into the end of the year.\n\nOperator\n\nOur next question comes from Andrew Obin with Bank of America.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nJust a question sort of longer-term question for you guys. How are you guys thinking about inflation into '23? And specifically, you guys no longer disclose pricing, but just trying to understand how are you thinking about the pricing mechanism of 3M. And how are you adapting to what's happening? And do you think we're going to get into a less inflationary environment? Or from what you're seeing inflation is pretty sticky into next year?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nAndrew, it's a great question. As I mentioned in my opening remarks, we're still early in looking at 2023. What we are seeing is a little moderation in inflation, but it's not been consistent and persistent. We are seeing -- inflation is pretty much still broad-based.\n\nIn areas that we are seeing is logistics has seen some slowdown in the pace of inflation. However, if you look at intermediate finished goods, they are still pretty high and so is specialty raw materials. So I would say if you just look at what inflation we had in the third quarter, it was $225 million. In the fourth quarter, we are seeing somewhere between $100 million to $150 million.\n\nSo there's a little moderation I think what time will tell is whether 2023, we are able to see sustained lower prices, and I think that would be good for all. So that's one. To answer your question on pricing, as Mike mentioned in his remarks and mine and even the prior question, we take a very thoughtful approach to pricing. Nearly 70% of our pricing is -- our products are pretty much spec in products.\n\nSo we take a very thoughtful approach. We look at it region by region. We look at it product by product. And I would say we'll have to follow -- we follow a very thoughtful approach.\n\nWe'll follow a very thoughtful approach in 2023 also because no one has seen this historic level of inflation in the recent past. So depending on where that goes, we'll play that self out in the market. But at the end of the day, as Mike mentioned, part of our pricing is not just driven by cost. It's also the value that we drive for our customers.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nAnd then just a follow-up question -- I'm sorry.\n\nMike Roman -- Chairman and Chief Executive Officer\n\nNo. Go ahead.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nJust a follow-up question. If you look at recent stimulus that has been passed in the U.S., a lot of investment in chipset, a lot of investment on semiconductors. A lot of talk about supply chain for semiconductors, particularly things like upstream like substrate, maybe moving closer to North America. Do you guys need to sort of redo your global electronics supply chain given what's happening out there on the regulatory front and stimulus front and just voluntary moves in capacity globally?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nYes, Andrew, and we're watching it closely. The Inflation Reduction Act, the chips factor they're providing the incentives for manufacturers and others to make investments in other parts of the world, the U.S. -- in the U.S. versus other parts of the world.\n\nAnd I would say we're assessing the impacts on our customers. You know our model. I mean we build capabilities and sufficient resources close to customers around the world. It's a regional model, and it gives us the ability to serve our customers in each region of the world that also helps us be in a position to adapt as supply chain moves.\n\nAnd that's been true for electronics as it's moved around Asia, in particular. And with these incentives, we expect there will be some changes. We don't see a significant impact to our business in the near term, but we do serve global customers in electronics and semiconductor and will adjust as they make changes.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nBut nothing sort of definitive at this point yet. You're still waiting?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nIt's early in the process. There are announcements. There are investments being made, and we'll stay close to those, and we'll and we'll make adjustments as we go. And if you look at the U.S.\n\nin particular, just as a reminder, we are a net exporter out of the U.S. We export $5 billion out of the U.S. So it is place where we've got a strong manufacturing position, and that puts us in a position to adjust as capacity gets invested here.\n\nOperator\n\nOur next question comes from Joe Ritchie with Goldman Sachs.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nSo I saw that you kept your inflation numbers impact for the year. I'm just curious, like are you starting to see any of your costs like start to subside at all? And then if you can maybe start to -- give us a little bit of color on what you're seeing from a manufacturing perspective and energy costs in Europe and how that's impacting your business?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nYes. So, Joe, I would tell you, we are seeing some moderation, as you saw inflation was $225 million in Q3, be accounting for $100 million to $150 million in Q4. The total at $750 to $850 million has not changed. We are seeing inflation, I would say, is still generally broad-based.\n\nWe are seeing higher inflation in specialty materials as well as intermediate finished goods. We are seeing a little bit of moderation in logistics. So that's where we are on inflation. And then on supply chain, I would say, we are also seeing some signs of stabilization, Joe.\n\nWe are seeing raw materials flowing a little better than it has flown in the prior quarters, and you can see that's why the team was also able to deliver decent productivity in Q3. We'll have to watch and see whether, one, is the moderation in pricing or raw materials sustained. And secondly, is the flow of material sustained into Q4, and that's going to determine where we go. And as Mike has said, too, once we see the stabilization of supply chains and moderation of raw materials, we believe that is the best opportunity.\n\nWe have other than volume to keep driving productivity in our factories and through that margin expansion.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nGot it. That's helpful, Monish. And then I guess my follow-on question would be obviously, a lot of uncertainty in the market right now as we're heading into 2023. Just maybe talk us through a little bit of your recession playbook, how you're preparing yourself for what could be a pretty uncertain year.\n\nJust any color around that would be helpful.\n\nMike Roman -- Chairman and Chief Executive Officer\n\nSure, Joe. And our operating model has been strong and shown resiliency in many economic cycles. And it's been clear throughout COVID and I would say, the concern -- the current uncertainty in the markets that we're facing. And so we'll continue to do what we do in those cycles that helps us react to them well and position our performance well, and that's focused on serving our customers, driving productivity, efficiency in our supply chains and our factories and delivering strong cash flow and it keeps us focused on the right actions.\n\nAnd we'll stay focused on our end markets, too, where as we've talked about, there's some different dynamics in each of the end markets, even as we look at the softening global outlook for macro. And so we're prepared to adjust and take actions. That's our model, and it will serve us well as we navigate the uncertainty ahead.\n\nOperator\n\nOur next question comes from Chris Snyder with UBS.\n\nChris Snyder -- UBS -- Analyst\n\nSo I wanted to first ask on the Q4 guide, which puts organic growth largely in line with Q3 levels at the midpoint or exactly at the midpoint despite a slightly larger respirator headwind. But can you just provide some incremental color at the -- for the puts and takes at the segment level as we look into Q4?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nYes. Sure, Chris. I'll just start with recapping again Q4. We'll just start by saying last year's fourth quarter was our easiest guide or easiest comparison.\n\nNo. 2 is, you're right. So disposable respirators is going to be down, and that creates a headwind of nearly 180 basis points. And then the exit of Russia is another $70 million, which gives another 80 basis points of pressure.\n\nSo if you exclude all of that, you would get to a 4% to 6% increase in organic growth on a year-over-year basis. If you look at where the macro is going to be, GDP and IPI is in that 2-ish range for the fourth quarter, auto is going to be up 2% sequentially or nearly 2.5% depending on IHS forecast, approximately 2% up on a year-over-year basis. Elective procedures, which were at 90% in July and moved itself up a little bit in August and September, we believe will move up a little bit to 90% to 95%, so you'll see that uplift. I would say consumer spending continues to be weak.\n\nEven in the month of October, we have seen lower consumer spending. I called that out as those trends where the inflation is impacting the consumer, I think, remains through the holiday season as well as how inventory levels are adjusted by retailers is something that we'll have to watch. Consumer electronics continues to be down on a year-over-year basis, a little moderation on improvement on a sequential basis. But again, there, we'll have to see where that plays itself out between consumer electronics as well as then you talk about semiconductor growth continues to be strong.\n\nWe are continuing to see that in our business on the other side of the electronics business. And then from an industrial perspective, we've already talked about disposable respirator but the rest of the end market remains pretty strong in SIBG.\n\nChris Snyder -- UBS -- Analyst\n\nReally helpful. And then the second one just on margins. If we kind of look from Q3, margins were up versus Q2 on slightly lower top line. Is it fair to assume that reflects improving price cost? Or was there some margin impacts from the portfolio changes during the quarter? And if it does reflect improving price cost, I mean, is the expectation that that should continue to improve from here, even if the cost relief might be a little bit down the road?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nYes. So, Chris, I would say it's all as we look at it, and the team has been doing a great job at driving margin expansion. And in Q3, you've seen -- as you said, we continue to see the price/cost equation. We have offset or managed our inflation through pricing actions.\n\nWe have had better yield and efficiency also compared to the second quarter as we saw some stabilization of supply chains. Third, as I called out, we have also, as a team, had a lot of strong spending discipline. We took a lot of self-help measures. We proactively adjusted where we saw end market change, etc.\n\nSo put all that together, we did see 50 basis points of margin expansion. When you think about Q4, if you know that in Q3, we did $8.6 billion. In Q4, we are saying $7.9 million to $8.2 million, which is the volume basically gives us the best leverage. So that's why you do see margin come down.\n\nAnd historically, if you look at 3M also Q3 to Q4, always shows a decline because it is a lower volume quarter for 3M. To answer your question on what happens in the long term, I would say, Chris, the same as I've said in my prepared remarks, which is there are headwinds that we see, whether it's macroeconomic environment, FX, the impact of energy cost on in -- especially in Europe and the geopolitical environment are all headwinds. Similarly, we'll have to watch what happens with COVID-related demand, whether it is government policy, whether it is elective procedures or whether it is our own disposable respirator demand. But there are a lot of tailwinds too.\n\nWe see secular trends that will continue to go up in areas that we add a lot of value to customers, whether it's auto electrification, sustainability, digitization, just to name a few. Also, when we -- as we see raw materials starting to stabilize or moderate and supply chain starting to stabilize or moderate, we should get a lot more opportunity to drive yield and efficiency, and that's what Mike said in his prepared remarks, too, that that's -- other than volume, that's one of our biggest opportunities to continue to drive margin. So hopefully, that answers your question, Chris.\n\nOperator\n\nOur next question comes from Andrew Kaplowitz with Citigroup.\n\nAndrew Kaplowitz -- Citi -- Analyst\n\nMaybe just a little more color into healthcare. I know you've talked about sales growth being a little lower in Q3, oral care turned down a little bit. It seems like elective procedures have been stuck a little bit, and you talked about them improving in Q4. But the issue just sort of staff in Georges and hospitals, what are you seeing in China over there? And how concerned are you about oral care given it does tend to be a little more sensitive to the economy?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nYes, Andy, you're right, there's some different dynamics going on than Q2. When you look at elective procedures and oral care versus surgical procedures or medical procedures. I think in general, it's on track with what we had said at the beginning of the year that it would get back to around 95% by the end of the year, 95% to 100%, maybe we're slightly below that now. And I think that's a reflection of what was part of your question.\n\nThat's the staffing levels right now. It's that's been a bigger impact than obviously, COVID hospitalizations have been in the current quarter and then outlook for the rest of the year. So I think that's holding it back maybe keeping it from being quite at the level that we thought it would be when we started the year. Oral care, we saw strong recovery in procedures there in 2021, and that's part of the comp that we're looking at year over year.\n\nThe impact this year appears to be consumer discretionary spending. And they are electing to spend less in some of those elective procedures in oral care. So that's had a softening impact. And we see those trends continue as we came out of Q3.\n\nSo a little bit different than maybe where we saw at the beginning of the year, but it's -- generally, we're looking for improvements as we go into Q4 in those medical elective procedures.\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nI would also just add that the other piece was Biopharma, which had a very strong quarter last year, and we are seeing on a year-on-year lower demand, just driven by the COVID therapeutics that we sold into last year.\n\nAndrew Kaplowitz -- Citi -- Analyst\n\nVery helpful, guys. And then Monish, maybe you can update us on your work on digitization. And I think you've talked in the past about data analytics really helping you in the second half of the year here and especially in '23. It seems like today, you're talking about having cost-out opportunity.\n\nI noticed your safety and industrial business margin was up nicely sequentially. So how much of an impact is that coming from digitization? Or is that just sort of general execution?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nSo I would just say the following, Andy, is as I said in February at our Investor Day, digital can be a multiplier for 3M. And it will take time. We have four pillars. One is digital customer.\n\nThe other one is digital product. The third one is digital operations. And then the last one is just digital enterprise or enterprise digital. I think the last one is ERP that helps us simplify our business.\n\nDigital operations is the place where you're talking about is from a factory perspective. The team has done a lot of work using data and data analytics to improve yield and efficiency in the factories. For example, we were able to create a digital twin for our respirator production during the pandemic, which the team is continuing to use and those models are being used for other parts of our production lines. There's a lot more we can do in this area in automation and digitization to drive yield and efficiency and especially as supply chains start normalizing.\n\nThis is an area where we should be able to dig faster into root cause and put into solutions. Similarly, data and data analytics helps us in inventory a lot too, Andy. And despite all the inefficiencies that exist currently in the supply chain, the teams have done a nice job of continuing to improve inventory. August to September saw a sequential decline in inventory.\n\nAnd so that's another sign that the teams are looking at data. It allows them actually to visually see where their inventories, so it allows better demand planning. And then if you actually go to digital product and digital customer, both of them, e-commerce continues to be an important area for us of growth. In the Safety and Industrial business, we bought the assets of a company called LeanTec that allows us to do software for auto body shops.\n\nSo parts management through software for auto body shops. So that's starting to take hold and Mike Vale and his team have done a nice job there. And Mike Roman mentioned in his opening remarks, the collaboration we have with Microsoft, where we announced the digital posted note in collaboration with Microsoft. So you're seeing digital play itself out in multiple places.\n\nI would say there's a lot more opportunity for us in the future in this area.\n\nOperator\n\nOur next question comes from Stephen Tusa with J.P. Morgan Securities.\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nCan you just give some degree of color on whether you were like -- you don't have to give details on the price, but like just with the spread positive, neutral, negative this quarter?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nPositive.\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nAnd how do you expect that in fourth quarter? It was positive this quarter?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nThat's right.\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nAnd did that accelerate from last quarter?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nTo the extent where we saw more in areas where we saw more inflation, we were able to offset that with more price. So overall, I would say mid-single digits is where we were, Steve, on pricing.\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nOK. Got it. That's great color. And then you guys kind of tweaked down the capex number a little bit.\n\nI know that number has been kind of growing over the last several years. Are you now kind of cresting on these major projects? And you mentioned digitization and automation in your -- with the prior question, but how do we think about that heading into '23, that capex number?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nYes. So as I said, we are still early planning '23. But in this case, the guide down, Steve, was just because of where we are with the length of supply chains. We have seen supply chain backlog or the cycle time of these go up anywhere from 12 weeks to 20 weeks depending on the capex equipment that we are buying.\n\nAnd so just based on where we are in the quarter, we thought it was prudent to take it down to $175 million to $185 million. But all good projects and the projects that are falling into next year will continue to get completed because they are great projects. I just wish we would have got them done this year, unfortunately, the supply chain just can't help us.\n\nOperator\n\nOur next question comes from Julian Mitchell with Barclays.\n\nJulian Mitchell -- Barclays -- Analyst\n\nMaybe just the first question around the inventories outlook. So you took down your cash flow conversion guide for the year even with the capex reduction you just discussed. I think also, Manish, you had mentioned inventory is down sort of month-on-month in September. So help us understand kind of where do you think customer inventories and distributed inventories sit right now versus normal? And how much kind of destocking lies ahead for your customers and for 3M itself? How quickly should we see that cash flow conversion get back to 100%? Is it sort of late next year or you think next year as a whole, you could be there already?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nYes. Julian, maybe I'll just touch on how we see inventory in the channel and with our customers. And it's maybe just a quick walk around the different business segments. Industrial channel inventories, they look like they're in pretty good shape.\n\nWe saw, as you saw, strong broad-based growth. And so well aligned with that. Consumer electronics, the OEMs are working through some inventories as the demand weakens. I think automotive inventories continue to be still relatively low with the demand that they're seeing.\n\nHealthcare overall, in line with the demand. We saw some softening, obviously, in oral care and the channels reacting there. So we're seeing some inventory pulled on. The big story at inventory probably is what you've heard from many other companies, the retailers working through their elevated inventory levels and navigating the kind of the shifts in consumer spending and the impact there.\n\nWe're seeing that as we come out of Q3. So that's kind of the external view. Maybe Monish can talk about kind of our -- how we map it internally.\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nYes, sure. So, Julian, it's back to the same comments we made that the global supply chain and raw material environment continues to remain fluid and dynamic. And I think that's what's driving the inventory level. Even though we did take it down August through September, that's the start.\n\nOne, we need to see the supply chain stabilize sustainably. And two is when you look at where we are at the end of Q3, we don't see those inventory levels coming down to the level we would have liked in a stable environment. And that's why we felt prudent to get it down to 85% to 95%. And the team is continuing to work inventory using data, data analytics, get a better demand planning.\n\nAt the same time, we also look at better coordination between our demand plans and our supply plans and that's what the teams are working on. And I think we'll continue doing that in the long run. I would say in the long run, there's no reason why we can't be at 100% free cash flow conversion. When you look at the cash flow that we generate and the opportunity that we have to continue to drive inventory down using data and data analytics.\n\nJulian Mitchell -- Barclays -- Analyst\n\nAnd then just my follow-up would be around, you mentioned earlier some self-help measures, digitization and better data tracking. Just wondered in terms of kind of overall operating margins. I think 3M as a whole has been about sort of 21%, 22% range for four or five years now. It's been a couple of years since the last big kind of restructuring announcement in December 2020.\n\nJust wondering what the appetite was for maybe another round of that kind of big fixed cost out, particularly as the macro is a little bit softer? Or are you feeling pretty confident about operating leverage next year?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nYes, Julian, as I talked about earlier, we are -- we have confidence in our ability to respond to the changes in the macro, and we're always adjusting our businesses to meet the markets. And whether it's near term or in the future. And so we're going to continue to focus on productivity. That's a big part of the self-help for us, leveraging some of the capabilities Monish talked about to drive that.\n\nAs supply chains improve and recover, we expect to be able to drive more self-help. And we'll continue to stay close to the end markets and the macro and take actions as is needed. We don't have a big plan to announce today, but we -- our model is to adjust the markets as we go.\n\nOperator\n\nOur next question comes from Nigel Coe with Wolfe Research.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nSo just going back to the exports, I think you mentioned, Monish, $5 billion, if I'm not mistaken. Just wondering do you do your exports from the U.S. over-indexed to a certain region? I think Latin America might be one, I think, maybe China as well. But any thoughts there in terms of concentrations of markets you are important to? And then in terms of the currency effects, the transactional effect of that.\n\nAre you able to kind of talk through to offset the FX impact?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nYes. Nigel, just to break down the exports a little bit. It's not exporting, it's really based on the capabilities that we've invested in the U.S. And it does serve all of those markets: Europe, Latin America, Asia, China.\n\nAnd so we're -- I wouldn't say we're over-indexed anywhere. It's really a strategy of portfolio and where we produce and while we're regionally capable for our businesses everywhere around the world, I mean a majority of what we sell in each region of the world, we produce in region. There are some parts of our portfolio that we don't need to have capacity in order to we have the demand for every region and so we'll export out of the U.S. And there's a balance around the world.\n\nYou'll see some over-indexing in the electronics manufacturing to Asia and China, of course. But more broadly, it's balanced across the regions of the world.\n\nNigel Coe -- Wolfe Research -- Analyst\n\nAnd the pricing, are you able to offset the price?\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nYes. So, Nigel, the way most of these work is they go into intermediate into the production of another factory that's locally manufacturing the product. So you will see that cost increase. The team takes all of that into account when they get their pricing.\n\nThey factor in the raw material, they factor in effects and then do what they can in that area to offset it. In total, as we've talked about, currently, we see effects of the strong dollar to continue to have a headwind on 2022 earnings, negative 4.5% on revenue, and it's nearly $0.50 on EPS for the year. So we do our best to try to manage it. At the end of the day, we can't eliminate such a strong dollar and we'll see how it plays out in 2023.\n\nOperator\n\nOur next question comes from Deane Dray with RBC Capital Markets.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nMike, I was hoping you could comment or expand your comments on what you've seen in October, especially on the consumer side, you said softer back-to-school setting up for softer holiday. I'd also be interested in hearing if you see changes in the consumer purchasing and the mix, like more focused on lower price point products and might you lose any share in this mix down?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nYes, Deane. As we exited Q3, as I touched on, we saw what others are seeing. The retailers are working through elevated inventories. That was a trend we saw impacting.\n\nWe saw the -- as Monish talked about, a softer back-to-school, which was maybe a separate market dynamic. There's been a shift in consumer spending from what we call hard lines. So where our products are in the categories that they're in, in retail markets and that into other areas like food, for example. And so you're seeing some shifting in consumer spending.\n\nThat's part of the trend that we saw it coming through Q3, and we see as we come out of the quarter into the rest of the year. And I would say the inflation continues to be driving some of those trends. So that's really at a high level, that's what we're watching closely. We're close with our retail partners and watching each of the categories in consumer spending as we see those trends evolve.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nAny share change?\n\nMike Roman -- Chairman and Chief Executive Officer\n\nNo. I think the dynamics that you're seeing in our organic growth in consumer is really about the consumer spending and the end markets. It's not about share change. We see our maintaining share and in some places, gaining share.\n\nWe see some of the positions that we -- where we've invested in coming out of the pandemic and in areas in consumer like our home improvement, even though it's -- we saw some softening demands in home improvement in the U.S. in the third quarter, we see we're well positioned to continue to have strong share in that part of the market.\n\nOperator\n\nThat concludes the question-and-answer portion of our conference call. I will now turn the call back over to Mike Roman for some closing comments.\n\nMike Roman -- Chairman and Chief Executive Officer\n\nTo wrap up, we continue to execute our strategies in a challenging environment while positioning 3M for the future through investments in growth, productivity, and sustainability, along with active portfolio management. We will stay focused on taking care of our customers, driving growth, and improving our operational performance. Thank you for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBruce Jermeland -- Senior Vice President, Investor Relations\n\nMike Roman -- Chairman and Chief Executive Officer\n\nMonish Patolawala -- Chief Financial and Transformation Officer\n\nScott Davis -- Melius Research -- Analyst\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nChris Snyder -- UBS -- Analyst\n\nAndrew Kaplowitz -- Citi -- Analyst\n\nStephen Tusa -- JPMorgan Chase and Company -- Analyst\n\nJulian Mitchell -- Barclays -- Analyst\n\nNigel Coe -- Wolfe Research -- Analyst\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nMore MMM analysis\n\nAll earnings call transcripts"
}