{
  "companyName": "JOANN Inc.",
  "companyTicker": "JOAN",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/02/joann-inc-joan-q2-2023-earnings-call-transcript/",
  "content": "JOANN Inc. (JOAN 10.04%)\nQ2 2023 Earnings Call\nSep 01, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to JOANN's second quarter fiscal 2023 earnings conference call. At this time, all participants are on a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] I would now like to hand the conference over to your speaker for today, Ajay Jain, head of investor relations. You may begin.\n\nAjay Jain -- Head of Investor Relations\n\nThank you, operator, and good afternoon. I'd like to remind everyone that comments made today may include forward-looking statements, which are subject to significant risks and uncertainties that could cause the company's actual results to differ materially from management's current expectations. These statements speak as of today, and the company undertakes no obligation to update or revise any forward-looking statements to reflect subsequent events, new information, or future circumstances. Please review the cautionary statements and risk factors contained in the company's earnings press release and the recent filings with the SEC.\n\nDuring the call today, management may refer to certain non-GAAP financial measures. A reconciliation between GAAP and non-GAAP financial measures can be found in the company's earnings press release, which was filed today with the SEC and posted on the Investor Relations section of JOANN's website at investors.joann.com. On the call today from JOANN are Wade Miquelon, president and chief executive officer; and Tom Dryer, controller and interim chief financial officer. During the question-and-answer portion of the call, we'll also be joined by Chris DiTullio, JOANN's executive vice president and chief customer officer.\n\nI will now turn the call over to Wade for his prepared comments.\n\nWade Miquelon -- President and Chief Executive Officer\n\nGood afternoon. Welcome to JOANN's second quarter fiscal 2023 earnings call. I'd like to begin my comments by acknowledging the recent passing of our chief financial officer, Matt Susz. Matt was a very talented leader who served in a variety of senior financial roles during his 26-year career at JOANN.\n\nWhile Matt's passing was devastating, we are very fortunate to have Tom Dryer, our controller and a 30-plus-year JOANN veteran, stepping on an interim basis as a CFO while we undertook the search for a permanent CFO. Thank you, Tom, for that. Following our announcement earlier today, I'm very pleased to welcome Scott Sekella to our incoming CFO effective -- role effective September 26. Scott comes to JOANN with a wealth of experience and increasing responsibilities in finance across many diverse organizations, including Ford Motor Company, Pfizer, Henkel products, and most recently, at Under Armour.\n\nPlease join me in welcoming Scott to JOANN team. We're very excited to have him on board with his exceptional talent. I also want to take the opportunity to welcome Mario Sampson to the JOANN leadership team. Mario will oversee the supply chain operations and has held senior roles in companies and logistics planning, distribution, and transportation at a variety of national retailers, including Amazon, Unique Industries, Macy's, Target, and most recently at Ollie's Bargain Outlet.\n\nWe're very excited to have Mario on board to help lead JOANN through increasingly complex supply chain environment. And we're confident that Mario will help restore our level of normalcy to our supply chain related to costs, as well as lead the supply chain transformation for JOANN into the future. Regarding men's trends, as you're aware, there are many cross trends impacting retailers during this earnings season. Geopolitical uncertainty, inflationary pressures, and supply chain challenges remain some of the defining issues impacting our customers in the current environment.\n\nThe recent data points on the economy offer further confirmation of my long-held view that we are in the midst of a recession. But to other discretionary and specialty retailers, however, we tend to get impacted earlier from the economic downturns, but we also tend to recover much faster. That has certainly been the case in previous cycles. I'm also pleased to report that as we enter into a more mature phase in the post-pandemic period, we continue to see strong engagement from both crafting and selling enthusiasts.\n\nOur overall comp trend is strengthening. And as of now, we believe at least that that should be the case for the balance of the fiscal year. Concurrently, our cost outlook is also beginning to show signs of improvement. This favorable revenue and cost dynamic will enable us to generate a high level of free cash flow and pay down debt during the back half.\n\nWhile I'm encouraged by the steady improvement in our operating performance in recent months, we still remain vigilant given the overall economic environment. The biggest opportunity for JOANN in the months ahead is in relation to our cost structure. And over time, we feel that the current economic headwinds will actually help to remedy the supply chain imbalances and generate significant cost savings for JOANN going forward. Our organization has absorbed in excess of $160 million of increased supply chain cost and product cost inflation on an annualized basis.\n\nWe continue also to absorb roughly $40 million of unmitigated Section 301 tariffs imposed on goods imported from China. Having said that, we feel that ocean freight cost pressures, as well as certain product costs, have peaked, and they should begin to improve as we head into fiscal 2024. As I said earlier in my comments, our operating performance has improved since we reported our first-quarter results. Recall that we reported our quarterly results in June.\n\nOur inter-quarter sales trend for Q2 has already shown some signs of improvement. Our gains continued to improve as we ended the quarter with four consecutive months of sequential improvement. During Q2, our revenue declined by 6.8% with total comparable sales decreasing by 6.2%. Our digital business was a significant bright spot, increasing by 2.2% during the quarter and accounting for 12% of our Q2 revenue.\n\nTrends for transactions and average ticket both improved on a sequential basis in Q2. Based on a three-year comparison relative to pre-pandemic level, our sales were slightly positive, improved by roughly 400 basis points on a sequential basis from last quarter. Also, encouragingly, while adjusted gross profit declined by 9% compared to last year, it increased by 7% compared to pre-pandemic levels in fiscal 2020. Among our merchandising divisions, our home seasonal business was particularly strong in Q2.\n\nWe finished the season with healthy sell-through of our spring and summer goods, along with encouraging results of early fall and Halloween sets. Additionally, a number of our important selling categories for back half of the year ended the quarter with good momentum. We also continue to see that increase in our average unit retail outpaced the increase in our cost of goods. This is a function of strategic pricing and promotional actions we discussed on our first-quarter earnings call.\n\nImportantly, the rollout of retail price increases has not come at the expense of incremental units or transactions. The quality of our inventory is extremely healthy, as clean as has been in our recent history. We managed our inventory build in Q2 strategically with an eye on getting in front of any further supply chain disruptions. During the quarter, we pulled forward receipts of fall and Halloween seasonal inventory in order to optimize the flow of product across the distribution network to better align with demand.\n\nWe are already seeing the benefit of that decision in sales. Meanwhile, we're also continuing to invest in basics and other critical categories for the back half of the year. These actions have better positioned JOANN for our crucial holiday selling season. Recall that on our last earnings call, we mentioned that we would continue to build inventory units in the second quarter while also taking actions to reduce inventory receipts in the back half of the year.\n\nWe are executing at a high level on these plans and have reduced our back-half merchandise receipts by $120 million. Given these and other actions, we expect to be significantly free cash flow generative through the end of the year. I'd also take the opportunity to remind investors that our business is highly seasonal, and the vast majority of our annualized earnings and cash flow takes shape after Labor Day. This seasonal dynamic is an important consideration to keep in mind with respect to our inventory position over the next two quarters.\n\nBy year-end, our inventory costs and inventory units should both decrease materially compared to the fourth quarter of fiscal 2022. Next, I'd like to discuss the opportunities that lie ahead in addressing our ongoing ocean freight challenges that I previously referenced. Ocean freight costs peaked during the fourth quarter of fiscal 2022. Since then, we've seen sequential improvement in each quarter, and we are seeing continued signs of stabilization in container freight rates.\n\nWe expect further sequential improvement with ocean freight costs in the back half of fiscal 2023. As Tom will lay out more detail, we're implementing a wide range of cost-reduction efforts and working capital initiatives and have a comprehensive action plan in place to capitalize on lower ocean freights as these headwinds transition to tailwinds later in the year. In the meantime, we're continuing to manage our cash position and balance sheet very carefully. Although we've seen improvement in our sales cadence, our assumptions remain that the macro environment will remain challenging at least through the end of the current fiscal year.\n\nThere's been no substantive change in our capital allocation strategy or in relation to our store refresh program since our last update in June. Our multi-purpose distribution center in West Jefferson, Ohio is set to go live in our coming months. This facility will help to improve our operating efficiency and significantly enhance our omnichannel growth capabilities. In the weeks and months ahead, I'll have more to share about our various growth initiatives as they go live.\n\nOur wholesale partnership with JDM Group is going well, and our sales are ramping nicely. Separately, we made a recent investment in Cupixel. Cupixel app combines cutting-edge augmented reality and artificial intelligence technologies with premium art content to allow users to create a very visual and stunning work of art. This product is now available online and in our stores with additional information on joann.com.\n\nWell, to conclude, I'm pleased we ended the quarter with momentum and on a more solid foundation than we began. As an organization, we're primed for a holiday selling season with exciting product assortments heading into the back half of the year. I'm thankful for the hard work of the team across the country and what they're doing to navigate through this tough environment, from those in our store support center in Hudson to our distribution center teams and our 20,000 team members in our stores, we remain focused on our customer in all we do and will be an even stronger company from this very hard work. With that, I'm going to turn the call over to Tom Dryer for a more detailed overview of our financial performance.\n\nTom?\n\nTom Dryer -- Controller and Interim Chief Financial Officer\n\nThank you, Wade, and good afternoon. As Wade mentioned, JOANN's operating performance improved during the latest quarter, and we have strengthened our financial position compared to three months ago when we reported our Q1 results. While the economic backdrop remains pressured, our sales trends have continued to improve. We also have taken concrete steps to lower inventory receipts during the back half of the year.\n\nThese actions will put us in a stronger position to pay down debt by year-end. Net sales for our second quarter totaled $463.3 million, a decline of 6.8% compared to last year with total comparable store sales decreasing by 6.2%. Relative to pre-pandemic levels in the second quarter of fiscal 2020, our sales were slightly positive with increased profitability over the same period across all divisions. Our cadence improved during Q2, and we finished the quarter ahead of our expectations.\n\nThe trends for transaction count increased on a sequential basis, and we also experienced a 3% increase in average ticket over last year, driven by our recent pricing actions. Our e-commerce business was particularly strong in Q2, growing by 2.2% over last year, with an acceleration in growth toward the end of the quarter. Our gross profit in Q2 was $214.9 million on a GAAP basis, reflecting a 20% decrease from last year. We incurred $27.1 million of excess ocean freight cost during Q2, which went below our internal forecast.\n\nNotably, we didn't incur any excess ocean freight cost over the corresponding period last year. After adjusting for these noncomparable expenses, our gross profit of $242 million declined by 9% compared to the same quarter last year and increased by 7% compared to pre-pandemic levels in fiscal 2020. Our gross margin rate on a GAAP basis was 46.4% in Q2, a decrease of 730 basis points from last year and reflecting a 580-basis-point impact from increased supply chain costs, of which the biggest contributor was excess import freight. After adjusting for excess import freight costs, our gross margin of 52.2% decreased by 150 basis points from last year.\n\nWe experienced increases in domestic freight expense due to rising carrier rates and fuel costs, as well as higher shrink costs related to the start-up of our new multipurpose distribution center located in West Jefferson, Ohio. These negative factors were partially offset by improved pricing efficiency, optimized promotional offers, and lower levels of overall clearance markdowns due to improved inventory quality. Selling, general, and administrative expenses increased by 4.7% compared to the second quarter of last year, driven by increased distribution costs from earlier arriving seasonal merchandise. We also incurred incremental costs associated with our new multipurpose distribution center in West Jefferson, Ohio.\n\nOur direct store expenses were slightly lower than the same period last year. And as mentioned previously, we are implementing targeted cost reductions to meaningfully improve our expense outlook for the back half. Our net loss in Q2 was $56.9 million, compared to net income of $5.2 million last year on a GAAP basis. Loss in adjusted EBITDA of $8.9 million, compared to income of $23.5 million in the same quarter last year.\n\nI want to emphasize the adjusted EBITDA performance in Q2 should be considered somewhat of an anomaly and it should not offer any direct read-through on our financial performance or profitability for the remainder of the year. Based on seasonality, Q2 normally represents our low watermark in relation to our annual sales and profitability. For historical context, we also reported slightly negative EBITDA on an adjusted basis in the second quarter of our pre-pandemic year. On June 24, we paid our quarterly dividend of $0.11 per share, and we've also declared our upcoming quarterly dividend to be paid on September 23 to shareholders of record on September 9.\n\nMoving on to our balance sheet. Our cash and cash equivalents were $21.5 million at the end of the second quarter. Our long-term net debt was slightly over $1 billion, reflecting a $240.9 million increase over last year. The biggest driver for this increase was the impact of excess ocean freight expenses, which was not affected over the same period last year.\n\nWe continue to believe that our long-term leverage target of two times adjusted EBITDA is achievable. Relative to the prior quarter, our payables-to-inventory ratio was at a more normalized level of 36% in Q2. We are still planning for $60 million to $70 million of capex spending this fiscal year. Our store refresh program remains on track, and we've completed 16 projects so far with another 18 planned for the remainder of the current fiscal year.\n\nAs an organization, we are taking a multipronged approach that will enable JOANN to be significantly cash flow generative over the balance of the year. A major priority was to lower our inventory receipts by $120 million, which we have executed upon. This will enable a reduction in net debt planned of a similar or even greater magnitude in the back half. To reiterate Wade's comments, the inventory build during Q2 was planned as we pulled forward receipts of selected seasonal inventory in order to optimize the forward products and throughput across our distribution network and to ensure our stores were in stock in time for the peak selling season.\n\nThese actions were consistent with our fiscal 2023 inventory planning process that we developed many months ago. As part of our receipt reduction, we've taken a very surgical approach to ensure we can still deliver on our internal sales expectations. These inventory actions should be much better reflected in our year-ending balance sheet. Please keep in mind that the nature of our inventory build during the first half of fiscal 2023 is fundamentally different from what you're currently hearing from many other retailers in relation to excess inventory challenges that, in many cases, were not planned for.\n\nIn addition to the seasonal inventory that was pulled forward in Q2, we still had a residual impact from excess import freight costs that originated late last year. These costs were embedded in the carrying amount of inventory reported for Q2, as well as in our prior quarter. In general, we are not challenged by excess inventory issues that would lead to increased or irrational promotional activity during the back half. While we will still see higher inventory levels over last year in our third quarter, this is due to late holiday receipts last year that we will land on time this year.\n\nWe have a very good handle on our seasonal inventory needs, and we've been deliberate not to overinvest in certain fashion and seasonal merchandise for our fall and holiday selling season. We also expect very little clearance inventory at year-end. Our inventory remains very clean, and clearance represents just 5% of our total inventory. For JOANN, this is a historically low level of clearance inventory.\n\nOur plan for clearance inventory is also 5% of total inventory at year-end. As it relates to our cost reduction plans, we are also taking steps to optimize our store labor hours later this year, in part driven by investments in technology, such as our new POS system and the shifting of some e-commerce orders to our new multipurpose distribution center. Consistent with the decision to better align our inventory needs with demand, we have the flexibility to adjust store hours across our store fleet and in our distribution network. This reduction in store labor, in addition to the optimization of our ad spend, will be major components of our cost reduction efforts during the back half of the year.\n\nThe final piece of our action plan to drive higher levels of free cash flow in the back half involves ocean freight. We have a number of supply chain tailwinds that are already taking shape, including the ongoing relief we're seeing in spot rates from ocean freight carriers. As Wade mentioned, we expect to see further sequential improvement in relation to excess ocean freight costs over the balance of the year. Excess ocean freight costs are again expected to decline slightly on a sequential basis in Q3.\n\nBased on year-over-year comparisons, we expect a modest increase in excess ocean freight costs in the third quarter versus last year. More importantly, we anticipate that year-over-year comparisons will improve very meaningfully in Q4 and that comparisons are set to improve further in fiscal 2024. On a cash basis, the improving outlook for ocean freight expenses will be even greater compared to the P&L impact during the back half. On a cash basis, we expect to spend $50 million to $60 million less in total ocean freight costs in the back half of fiscal 2023 compared to last year.\n\nBased on the cumulative level of cash generated by our improving operating performance, targeted cost savings, a less pressured supply chain outlook, and our inventory reduction plan, we intend to substantially delever our balance sheet by year-end relative to Q2 levels with the target range in the low to mid $800 million range for net debt. There are no significant changes in our capital allocation priorities. While we have adopted a very disciplined focus on generating positive free cash flow going forward, we have a sufficient level of liquidity with our balance sheet to continue to make appropriate investments, including in our store refresh program and with our blue ocean growth initiatives. While we do not provide formal sales or earnings guidance for fiscal 2023, overall, we are encouraged by the sequential improvement in our recent sales performance.\n\nWe do not anticipate we will generate positive comparable sales in Q3. However, we do anticipate further sequential sales improvements as we move throughout the balance of the year. Apart from working capital improvements, the biggest opportunity for JOANN in the months ahead is regards to our cost structure, both in relation to supply chain, as well as product input costs, given the retrenchment of oil and certain commodity prices and the current strength of the dollar relative to many geographies where we source product. With that, Wade, Chris, and I will be happy to take your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Laura Champine with Loop Capital. Your line is open.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nThanks for taking my question. I understand that the inventory build was planned, but I also understand you intend to burn through a lot in the back half. Do you expect promotional activity to be higher year on year this fiscal year versus last?\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nHi, Laura, it's Chris. No, I think at this point, we're planning pretty comparable activity. We're not seeing in the market, competitors do anything irrational, which is great. Some of this inventory that we talk about that seasonal is a smaller percentage of our total than maybe in at least one of our competitors and maybe some others in retail.\n\nSo, at this point, we're pretty confident with the cadence that we have laid out for the back half.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from Zack Fadem with Wells Fargo. Your line is open.\n\nDavid Lantz -- Wells Fargo Securities -- Analyst\n\nHey, guys, this is David Lantz on for Zach. Thanks for taking our questions. I guess first one for me, I was just curious if you could touch on how you expect the industry growth to shape up for the year and what that could look like for next year as well.\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah. I mean, obviously, things have been, you know, selling out. It's been a roller coaster the last few years of pandemic. But I think as we see things settle down, we feel pretty good.\n\nWe feel the engagement is pretty good, you know, on the selling side of the business. Business is strong, a lot of great signs of further strength. We're seeing seasonal very strong. You know, arts and crafts, you know, we can talk about that, maybe it's a little more mixed.\n\nBut in general, it's strong. There's a few pockets that are tighter than others. But I think we feel that this industry is more or less here to stay. And as we kind of round the horn on what's been, again, kind of a couple of pandemic cycles, I think we probably feel like we're moving into the new normalcy.\n\nChris?\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nYes. David, I can add on just a little bit more color, I guess. One of the things that this industry does experience over time is as trends ebb and flow, at JOANN, we feel very confident that because of our breadth of product categories that we offer -- but as things move that -- as the trend move out and into another, we can be there for the customer. So, right now, we're seeing really positive engagement in some of our more upscale selling categories, more advanced project types and which for us is obviously great to see.\n\nWade Miquelon -- President and Chief Executive Officer\n\nI'd also say -- I've always said one of our -- probably our biggest single competitor is things that consume leisure time. And as we move kind of into, you know, the Labor Day here and [Inaudible] back to school, we typically see that will engage a lot more in our activities because they have a lot more time. And we're early signs on all the things that we look at are pretty good. We don't see anything that doesn't give us confidence that the way it's certainly been is not how it will be in the future.\n\nDavid Lantz -- Wells Fargo Securities -- Analyst\n\nGot it. That's super helpful. And then just one follow-up. As the industry normalizes post-COVID, how should we think about a normalized algorithm for the business from a comp and margin perspective?\n\nWade Miquelon -- President and Chief Executive Officer\n\nYou know, I still believe that that algorithm we put in place is still kind of as things become normal, it's still very achievable, that kind of 2% to 4% growth with the opportunity to steadily improve margins over time. The margin, what you see is actually a bit, I'd say, again, because of the ocean freight, a lot of [Inaudible], our GAAP margin on gross margin was down 730. Our adjusted was 150, although almost half of that was a shrink adjustment, which is an anomaly with the OFC. But our POS margin, which is the kind of critical indicator in terms of how we're really ringing at the register versus the cost of the product was up 130 basis points year on year.\n\nSo again, I think that that sales algorithm we have between the growth in our initiatives is a very reasonable range. And I think that this is an industry, and we have a business that we think that should be able to stay and ideally build those gross margin points, you know, over time.\n\nDavid Lantz -- Wells Fargo Securities -- Analyst\n\nThanks so much.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Paul Kearney with Barclays. Your line is open.\n\nPaul Kearney -- Barclays -- Analyst\n\nHey, thanks for taking my question. First, I was wondering if you can talk about whether you're seeing freight costs begin to alleviate, and then coupled with that, can you talk about your expectations for cash flow for the year and kind of reconcile that with your expectation to significantly reduce debt by year-end?\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah. Well, I'll take the first part and segue maybe Tom for the second part. But I have -- so I felt that we've been for a while now in inflationary cycle and then the kind of recessionary cycle. I do feel now that I kind of put the flag in the ground that I think that we should see kind of a -- we've seen peak inflation.\n\nNow, the question is how fast can we benefit both on the supply chain side, as well as through some of the balance of costs, given commodities, at least commodities relevant to us. And again, I'm talking inflation relative to JOANN, maybe not in aggregate. So, I do think we're at the point now we're going to see that benefit that the issue might be some of the mismatch between the P&L and cash flow. We're still incurring costs for payments made as far back as Q4 of last year on some of the ocean freight and even some of the COGS.\n\nBut as we move forward from a cash perspective, I think we're basically going to be the benefactor of reducing costs in aggregate across the board, and that will ultimately flow through. On the debt reduction, I'll let Tom add on here. But that kind of circa $180 million, $200 million debt reduction we're talking about to get to that target, you can basically build it up from the receipts Tom talked of about $120 million net year-on-year benefit, 50 ocean freight, you've got another 20-ish between capex, SG&A, and all other. So, really, what you see there is just a lot of timing and a lot of mismatch from the P&L to cash flow, which is exacerbated, probably, again, due to receipt flow, ocean freight anomalies, and some of the other costs.\n\nTom Dryer -- Controller and Interim Chief Financial Officer\n\nYes, just to add on, like we've started over the last several months. We've been working on generating additional free cash flow in the back half of the year. And as Wade mentioned, we've talked about the receipt reduction plan we put in place of the $120-ish million, the import freight costs, and we were incurring quite a bit last year and the back half of this year based on current rates, we should be in the $50 million to $60 million savings range on a cash basis. And then another capex, SG&A, savings of the $10 million to $20 million, you're in that $180 million to $200 million of additional free cash flow based on the back half of the year.\n\nSo, I think we feel very confident in those numbers.\n\nWade Miquelon -- President and Chief Executive Officer\n\nYou know, I think if you look back historically, this business in the back half of the year from October on generates a net debt reduction of $200-plus million, right, Tom? And last year, it was more or less flattish, and that flattish was again because of just the massive amount of supply chain costs and cash basis that were paid in the back half of the year, as well as the later and elevated receipts. But again, I think we're in good stead this year that would be more of the historical pattern.\n\nPaul Kearney -- Barclays -- Analyst\n\nThank you. That's helpful. And just one additional unrelated question. I didn't -- and I apologize if I missed it.\n\nIs there any update on the 301 tariffs? Thanks.\n\nWade Miquelon -- President and Chief Executive Officer\n\nThere's been a lot of moving parts on that. I wouldn't want to speculate where it's going. As you know, there's kind of been a court case. There's been some talk between trade associations in the White House.\n\nBut at this point, we're just assuming that status quo is probably going to be in place and moving forward with that. But I don't know if we'll see any release there or not. But I think as far as we're looking at it, we're not banking on any.\n\nPaul Kearney -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Peter Keith with Piper Sandler. Your line is open.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nHi. Thanks for taking the question. I was wondering actually if you could address the status of your store refresh program. I know you've got -- I think you said maybe 18 more stores for the back half of this year.\n\nHow are you thinking about that program looking out to next year?\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah. You know, next year, we're probably looking, Chris, in the 20, 25 store range refresh. We still are bullish as ever on it. The returns that we've seen, the lifts are still as robust as ever.\n\nThe issue, I think, is more than anything is right now. It's really expensive, in some cases, to get contractors, a lot of expenses [Inaudible], there's delays. So, we're really -- we pare back to say let's take the ones that are really the absolute best and not overpay and we can put the pedal to the metal we have to down the road.\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nYeah, that's correct. I mean, we're pretty excited about the recent store openings -- grand openings that we've had one of our recent stores in Knoxville, Tennessee has been one of the best stores in the chain since we grand open, which is fantastic. The next wave that we have coming up are also some pretty high-volume locations in terms of our expectations. So, the 18 that we have coming up in front the back half of this year, hopefully, will provide a nice little headwind into fiscal '24.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nOK. Great. I know with the gross margin on a non-GAAP basis, there's some various puts and takes and you were down year on year in Q2. How should that gross margin on a non-GAAP basis trend in the back half of the year when we just think about the domestic freight and then you called out the shrink from the new DC?\n\nWade Miquelon -- President and Chief Executive Officer\n\nRight. And I'll just lay that again for people because I know I threw that kind of quick. Our GAAP basis, we were down 730. Our adjusted basis, we're down 150, negative.\n\nAnd again, shrink was, call it, almost half of that. And our POS margin basis was up 130. In the back-half part of what we have, again, is a mismatch of GAAP and cash because the back half is going to be paying for some of the ocean freight in the front half. On a cash basis, we're going to be much better adjusted and on a GAAP basis, Tom, I'll let you --\n\nTom Dryer -- Controller and Interim Chief Financial Officer\n\nOn a GAAP basis, our gross margin in the back half is expected to be up.\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah. Absolutely. I don't think we'll quantify exactly --\n\nPeter Keith -- Piper Sandler -- Analyst\n\nRight. So, that's on a GAAP basis. So, how should we think about it on a non-GAAP basis in the back half?\n\nWade Miquelon -- President and Chief Executive Officer\n\nOn non-GAAP basis, I think it's going to be probably relatively close to neutral. Again, the impact you have is just the timing of the ocean freight that we're already booking versus the rates that we're paying forward. But if you go back to that POS margin, the POS margin is going to be equally strong year on year versus last year.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nOK. That's helpful. And one last question, a little bit of a follow-up to what Laura asked at the beginning. It's on the competitive and promotional environment.\n\nThe arts and craft industry has been fairly promotional in the past. Are you seeing -- and I guess, it's been rational the last two years, but are you seeing any pickup in competitive promotions now with some of the challenges in the economy?\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nYeah. You know, certainly, we watch everything that's going on with competition pretty broadly. What we see is that when there's merchandise that maybe has an expiration date on it related to seasonal, individual retailers might be a little bit more aggressive there. But in the vast majority of basic categories, we're not seeing really aggressive behavior.\n\nAnd in our world and some of our competition, basics are a very high percentage of our total inventory.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nOK. Sounds great. Thanks so much.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Cristina Fernandez with Telsey Group. Your line is open.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nGreat. Thank you for taking my question. I wanted to ask about the SG&A savings you commented on for the back half of the year. Would you be able to quantify how much those would be, particularly the piece around labor costs, which seems to be the bigger part of it?\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah. I don't know that we're going to give an exact number on it today. I think we're going to bend the curve nicely versus where we were in the first half. But, Tom, if you want to say a few points on that, but I think we'll probably stay away from giving an exact target.\n\nTom Dryer -- Controller and Interim Chief Financial Officer\n\nYeah. We're not going to be significantly different than last year in the back half from an SG&A standpoint. So, I don't think we'll be as up as we were from the first half of the year.\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nI think we feel just related to sales expectations, we're going to be able to manage, whether it's store labor or some of the other cost lines accordingly.\n\nWade Miquelon -- President and Chief Executive Officer\n\nAnd one of the things we'll see is, as we bring up our OFC facility that's going to add some SG&A, but what it actually does is it reduces splits significantly. And then it also is going to increase our line fill rate significantly. So, it's sort of -- there's a lot of moving parts in it, I guess. And I just -- kind of apples-to-apples is a little bit different scenario.\n\nBut I think we'll compare favorably or at least very nice versus a year ago.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nAnd then on the improvement you saw through the quarter, and it seems so far in August, can you provide more color on category trends? And are you seeing that customer that is more cash flow that you saw in the early days of the pandemic start to -- have they been reengaging more with JOANN relative to the last couple of quarters?\n\nWade Miquelon -- President and Chief Executive Officer\n\nI guess I'd say it this way. If you look at kind of Labor Day on our mix of categories becomes different. There's a lot of categories that lean heavy such as seasonal, such as some of the warm categories, some selling categories that actually get larger through that period because this enthusiast comes back and has time to do it. By and large, those categories are all doing really well.\n\nSo, sort of the mathematics of mix, which gives us confidence, we move the back half of the year here that those strong categories and increasing mix effect will continue to give us benefit through our sales comp trend.\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nYeah. Cristina, I could add on a little bit more in the second quarter, that's typically our lowest volume quarter, right, which we've talked about before. And what we saw in the quarter was the enthusiasts really came in -- came out and showed up for some of those categories, which was great to see because some of those folks were kind of shocked earlier in the first quarter when we started to see the impacts of economic downturn. So, we saw those customers come back.\n\nAnd then as Wade said, as we've end of second quarter going into third quarter, we're seeing a broader customer range start to fill in.\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Please stand by for our next question. Our next question comes from the line of [Inaudible] Capital. Your line is open.\n\nUnknown speaker\n\nHi. Thanks for taking my questions. First, would you guys be able to provide more color on what types of inventory were in the $120 million that you guys canceled?\n\nWade Miquelon -- President and Chief Executive Officer\n\nWe didn't cancel anything really. We just managed our receipts in our orders. So, I guess what I would just say is we don't break it out in any more detail, but I think the team has been very viligant -- they're very vigilant, sorry, looking forward to make sure that what we call open-to-buy process, it's really lining up with realistic demand moving it forward to line up with realistic timings assuming that the port shutdown and the other rail delays and things are there. So, we feel we've done a very good job of making sure that we have the inventory we need no more for the categories and having it here on time or earlier, you know, this year than -- you know, since I can remember, since I've been here.\n\nAnd last year, even though we were in pretty good stock on a relative basis, a lot of our seasonal flow was as much as three weeks late, one of our major categories. It was probably two, two and a half months late for where we'd like to be. This year, I'd say we're, you know, about as good as we're able to get.\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nThe only other thing I would add on to what Wade says is that the team also didn't start this a month ago or two months ago. This is work that has been happening really since the beginning of the fiscal year when we very early on recognized what we expected to be pretty severe headwinds in the economy. So, the cuts as Wade indicated that weren't cuts of orders in place, but the -- our category management teams thoughtfully going through line by line on what's needed to deliver the sales versus what is in.\n\nUnknown speaker\n\nOK. Thanks. And then in terms of Q2's comp sales performance, it was like 6.2% overall. Are you guys able to provide any detail on how that varied across categories? Like how was selling versus arts and crafts? I think in the first quarter, you guys mentioned that like higher ticket technology was a headwind.\n\nWas that similarly a headwind in the second quarter? Any more color you could provide on the breakdown on sales would be helpful.\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah. I mean, the technology was certainly ahead in the second quarter, and that's in part because the base of that has been so humongous, you know, that most people are, you know, throwing in the towel. It really is just we had such a huge spike during COVID. Sequentially, we did see every period getting stronger than the period before.\n\nI think we said in the last call that we came out of the quarter in the high single-digit negatives, and we were starting to see a slow sequential improvement. And we did see that sequential improvement, you know, [Inaudible] in general, on the major segments for sure.\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nYeah. And as we progressed through the quarter, I mentioned that our enthusiasts were coming back. So, certainly, some of those selling categories that maybe were softer last year really started to light up for us. And then the customer respond -- the project types that they're engaging in are advanced.\n\nAnd so, we know it's that enthusiasts. We saw great movement in our seasonal product, which was also encouraging. We were able to deliver positive sell-throughs of spring and summer in such a time where we could get our fall and Halloween product on the floor earlier than we ever had before and started to see progression on that right away. And as Wade indicated, while we have some headwinds --\n\nOperator\n\nLadies and gentlemen, please stand by. Your conference call will resume momentarily. Please stand by. Again.\n\nLadies and gentlemen, thank you for your patience. This is your operator. I apologize. We're having a slight delay.\n\nPlease stand by. Apologize. We're having a slight delay. Please stand by.\n\nLadies and gentlemen, thank you for your patience. Please stand by. Ladies and gentlemen, thank you for your patience. Please remain on the line.\n\nYour conference call will resume momentarily. Thank you for your patience. Ladies and gentlemen, thank you for your patience. Please stand by.\n\nYour call would resume momentarily. Thank you for your patience.\n\nAjay Jain -- Head of Investor Relations\n\nThe whole audience listening, or can you just hear me? OK.\n\nOperator\n\nYou are live. I can hear you, Ajay, and we still have [Inaudible] in the queue.\n\nAjay Jain -- Head of Investor Relations\n\nHello. Good afternoon, audience. We apologize. We had some technical delays.\n\nWe just wanted to resume the Q&A if there are any additional questions.\n\nUnknown speaker\n\nI guess since I'm still in the queue, would you mind providing a little bit more information on comp sales across the product categories, i.e., given the description you guys gave, would it be fair to say that selling performed better than like a minus 6.2% comp?\n\nWade Miquelon -- President and Chief Executive Officer\n\nYeah. Well, this is Wade. I don't know if anybody can hear. We're very grateful for all of you that dialed in and we're ever more grateful for those of you had the patience to stick through it.\n\nI'm not sure why the service dropped and there's been a problem getting a new line in. But nevertheless, we will figure it out. If any of you would like to -- had further questions, for sure, reach out to us directly, and we'll be happy to answer those. Unless there's some more questions here, we can stay as long as it takes, but I sense that perhaps there's not.\n\nBut again, sorry for all the confusion.\n\nAjay Jain -- Head of Investor Relations\n\nThank you, and we are available for any follow-ups. So, thank you for your interest in JOANN, and that does conclude our second-quarter earnings call for fiscal 2023.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAjay Jain -- Head of Investor Relations\n\nWade Miquelon -- President and Chief Executive Officer\n\nTom Dryer -- Controller and Interim Chief Financial Officer\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nChris DiTullio -- Executive Vice President and Chief Customer Officer\n\nDavid Lantz -- Wells Fargo Securities -- Analyst\n\nPaul Kearney -- Barclays -- Analyst\n\nPeter Keith -- Piper Sandler -- Analyst\n\nCristina Fernandez -- Telsey Advisory Group -- Analyst\n\nUnknown speaker\n\nMore JOAN analysis\n\nAll earnings call transcripts"
}