{
  "companyName": "IMAX",
  "companyTicker": "IMAX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/imax-imax-q3-2022-earnings-call-transcript/",
  "content": "IMAX (IMAX 0.62%)\nQ3 2022 Earnings Call\nOct 31, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to IMAX third quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to Jennifer Horsley, IMAX senior vice president of investor relations.\n\nPlease go ahead.\n\nJennifer Horsley -- Senior Vice President, Investor Relations\n\nThank you for the introduction, and good afternoon, everybody. Thank you for joining us on today's third quarter earnings conference call. On the call today to review our Q3 results are Rich Gelfond, chief executive officer; and Natasha Fernandes, our chief financial officer. Megan Colligan, president, IMAX Entertainment; and Rob Lister, chief legal officer, are also joining us today.\n\nToday's conference call is being webcast in its entirety on our website. A replay of the webcast will be made available shortly after the call. In addition, our third quarter earnings press release and the slide presentation have been posted on the investor relations section of our website. At the conclusion of this call, our historical Excel model will be posted to the website as well.\n\nI would like to remind everyone of the following information regarding forward-looking statements. Today's call, as well as the accompanying slide deck may include statements that are forward-looking and that pertain to future results or outcomes. These forward-looking statements are subject to risks and uncertainties, and that could cause our actual future results to differ. Please refer to our SEC filings for a more detailed discussion of some of the factors that could affect our future results and outcomes.\n\nAny forward-looking statements that we make on this call are based on assumptions as of today, and we undertake no obligation to update these statements as a result of new information, future events or otherwise. During today's call, references may be made to certain non-GAAP financial measures. Discussion of management's use of these measures and the definition of these measures as well as the reconciliations to non-GAAP financial measures, including adjusted net loss, adjusted EPS and adjusted EBITDA as defined by our credit facility, are contained in this morning's press release and our earnings materials, which are available on the Investor Relations page of our website at imax.com. With that, let me now turn the call over to Mr.\n\nRichard Gelfond. Rich?\n\nRich Gelfond -- Chief Executive Officer\n\nThanks, Jennifer, and good afternoon, everyone. Thank you for joining us. As we enter the stretch run of the year, IMAX stands on the verge of a very promising period marked by significant potential tailwinds. The blockbuster slate is reigniting with two of the most highly anticipated releases in years.\n\nBlack Panther: Wakanda Forever and Avatar: The Way of Water leading into a strong blockbuster slate in 2023. IMAX System installations are ramping up in the fourth quarter, and we remain on track to deliver between 80 to 100 in 2022, up from 75 in 2021. We continue to drive momentum in technology, sales and licensing with recent agreements across key markets, including China and the Middle East. And we are accelerating the diversification of our global content portfolio, particularly with local language films, which comprise 30% of our global box office in the third quarter and buoyed in otherwise saw film slate.\n\nWe are targeting 30 to 40 local language releases worldwide in 2023. We are leveraging these trends to unlock significant value for IMAX and its shareholders. Even as we capitalize on near-term opportunities, we continue to advance our long-term IMAX 3.0 strategy to grow beyond blockbusters and deliver unique events and experiences globally. We took a big step forward in the quarter with our acquisition of streaming technology company, SSIMWAVE.\n\nThe move immediately strengthens our ability to deliver the best images on any screen, anytime, anywhere, while further diversifying our revenue and growth potential. Overall, IMAX continues to demonstrate its differentiation, the strength of our model and create opportunities for future growth in any environment. We drive results through our asset-light operating model and recurring technology, licensing and maintenance revenues, and we deliver a differentiated premium experience that is in high demand among our fans and filmmaking partners. This is evident in our Q3 results, which include double-digit year-over-year growth across revenue, gross margin and adjusted EBITDA, despite a temporary lull in the slate.\n\nToday, I'd like to discuss our near-term blockbuster film slate and momentum in our network growth, our strong positioning with the opening of Avatar: The Way of Water, how we're accelerating our local language strategy to strengthen and diversify our content portfolio and how we're expanding our technological capabilities and future growth opportunities with the acquisition of SSIMWAVE. And then I'll turn it over to Natasha to take you through our results for the third quarter. First, the blockbuster slate is starting off in the fourth quarter with a strong line up ahead in 2023. Black Adam: Prime the Pump, opening to nearly $11 million worldwide in IMAX, including 10% of the domestic box office.\n\nNext week is the long-awaited release of Black Panther: Wakanda Forever, a film for IMAX title tracking to one of the biggest global openings of the year and generating a tremendous amount of buzz. And the year concludes with Avatar: The Way of Water. More of that in a moment. The 2023 Hollywood blockbuster slate is very strong with multiple Marvel films, including Captain Marvel, Guardians of the Galaxy and Ant-Man, multiple DC films including Aquaman and the Flash, the highly anticipated new Mission Impossible, the latest, Fast and Furious event, and of course, Christopher Nolan's Oppenheimer, which makes groundbreaking use of IMAX film cameras.\n\nOn the network side, the fourth quarter is traditionally our strongest period for installations, and we're seeing momentum in network sales as well. Network growth, of course, strengthens our ability to maximize the strong slate ahead. We remain on target for between 80 to 100 system installations for the year. We've completed key agreements in recent months, including a nine-theater deal in China with Wanda and an additional deal for six new locations in Saudi Arabia.\n\nAnd we continue to install or upgrade marquee locations around the world, including our newly refurbished IMAX with Laser System in the iconic BFI in London, as well as our new location with AMC at the Grove in Los Angeles. We're dramatically increasing our footprint in L.A., a valuable commercial proposition and strategic one, given how these new marquee theaters will make us even more accessible to the Hollywood community. Our new locations at the Grove and Americana at Brand grow our roster of iconic L.A. locations alongside the TCL Chinese Theater and Universal CityWalk, also forthcoming IMAX dine-in theater with at Hollywood Park as well as a new location at the Galleria and Sherman Oaks.\n\nThe year culminates with the December release of Avatar: The Way of Water, the first of four new Avatar films planned through 2028. IMAX has been laying the groundwork for this release for years, and we have an incredibly strong foundation on which to build. The original Avatar remains the highest grossing IMAX film of all time, with more than $270 million in box office receipts to date. $250 million of that came from the initial 2009 release when the IMAX global network was only about 250 screens.\n\nIn China alone, we generated $24 million in box office on just 14 screens. Today, we have about 1,700 screens worldwide. Recent rereleases of the film have affirmed the strong brand connection between Avatar and IMAX. When the original was rereleased in China in March 2021, IMAX delivered 30% of the opening weekend box office, despite accounting for only about 1% of Chinese screens.\n\nIn a limited global rerelease just last month, IMAX delivered 20% of the worldwide opening weekend, including nearly 30% of the domestic debut. Our teams have been in lockstep with Disney on a coordinated marketing strategy. We've also worked closely with James Cameron's Lightstorm Entertainment to make sure our theaters are ready and that the IMAX versioning of the film will make the absolute best use of our technology. And we plan to commit the bulk of our network to 3D to help deliver on Jim Cameron's creative vision with the highest possible fidelity.\n\nAvatar: The Way of Water has the potential to be a cultural phenomenon in the same way as its predecessor was, and we are confident that IMAX will be part of center stage. And we believe we will enjoy the benefits of our strong collaboration with Jim Cameron Lightstorm and Disney as the franchise continues over the course of the coming decade. Beyond Hollywood, we continue to accelerate our local language film strategy around the world. We believe we've only scratched the surface of what local product can do for our results.\n\nIn vibrant and growing film markets like Japan, China, India and South Korea, the pandemic set a motion, a massive shift in how moviegoers perceive IMAX. Prior to COVID, audiences in these markets generally viewed IMAX as a platform for Hollywood films. But as Hollywood Studios held back their films and we partnered with local studios and filmmakers to pivot to local language and fortify our network, that perception changed. Around the world, IMAX is increasingly seen as the go-to destination for local language blockbusters.\n\nIn the third quarter, approximately 30% of our global box office was derived from local language films. Year-to-date, IMAX's program, the highest grossing films in China, India, Japan and South Korea. In Japan alone, our per screen average for the trailing 12 months is a staggering $1.9 million. Successful global releases for IMAX films, including India's RRR and Japan's Dragon Ball Super: Super Hero are demonstrating the increased exportability of local films.\n\nAnd as we look ahead to 2023, we expect a program between 30 and 40 local language films around the world. India is a great example of our progress with this strategy. In 2019, local language films accounted for only 2% of our box office in India. Year-to-date in 2022 is 35%.\n\nThis is important as 80% to 90% of India's box office is generated by local language. We're at more than $11 million in local language box office in India year-to-date, nearly three times our previous record year. Four of our top 10 highest grossing local language Indian films of all times have come this year. And even though many theaters in India were closed through March due to the Omicron surge, our box office there is well above what it was in 2019, a record year through three quarters.\n\nAs a result, we're seeing our momentum in installations in India with four new theater installations projected between now and January, a 20% increase in our current Indian footprint. This trajectory shows the upside potential of our local language strategy as international studios and filmmakers grow more advanced, more ambitious and more successful at exporting content around the world. Looking at China, we continue to take the long view while managing the business for the current environment. IMAX has been in China for nearly two decades.\n\nWe built a strong business and brand over that time, and we're part of the fabric of Chinese consumer entertainment. Our brand awareness in China is upwards of 90% across top-tier cities. We partnered with 84 Chinese exhibitors in 207 cities across 31 provinces in Mainland China. We have nearly 800 theaters open in China and another 200 in backlog.\n\nWe work with every major Chinese film studio. The best Chinese film makers are increasingly using our cameras to create megahits, including the biggest hits in China the past two years, with The Eight Hundred and The Battle of Late. Overall, the IMAX China network has featured eight of the top 10 highest grossing Chinese films of all time. Our rapid diversification to local language content gives us a strong content foundation in China regardless of the political environment.\n\nThat includes Wandering Earth 2 to sequel to our highest grossing local language film of all time and our second highest grossing film ever in China, which is tentatively slated for the lucrative Chinese New Year moviegoing period. Furthermore, thanks to our close relationships with Chinese studios. We're able to move quickly and drop local language films into our slate when anticipated Hollywood films do not secure release dates. That being said, we're encouraged by what we're hearing from industry sources about the likelihood that the Avatar sequel will get into China.\n\nThe original Avatar was screened in Shanghai for a special rerelease event just last month. We maintained our strong position in China, thanks to our proven ability to navigate changes in the market. And we will continue to be nimble in doing so while managing our costs closely for maximum flexibility. We also made solid progress with our IMAX Live initiative, driving further diversification of our global content portfolio.\n\nIn the quarter, we delivered our highest grossing events yet in our two biggest live content verticals, Live Music and Studio Interactive fan events. Brandi Carlile, Live in the Canyon Hays, delivered more than $450,000 in box office from a single Wednesday evening showing across nearly 100 IMAX locations in North America, good for our best overall box office and per screen average for a live event. And Harry Styles made our interactive event for Darling with Warner Bros., the fastest selling live event to date, selling out 21 locations in its first 24 hours on the way to nearly 40 sellouts nationwide. IMAX is an entertainment technology company, and investment in technology is enabling the expansion of our global content portfolio and driving long-term growth and diversification for the company.\n\nOur transformation to an all IMAX with laser product line is fueling continued growth in markets like China, Japan India and Saudi Arabia and around the world with advanced 4K projection and 12-channel sound. We continue to drive adoption of our film for IMAX camera program and expect to launch our first Japanese and Indian productions using IMAX-certified digital cameras soon. In response to high demand, we'll also roll out our next generation film cameras next year, fueling even greater opportunities for the best filmmakers to create for our platform. And we remain on target to connect more than 250 live theaters worldwide by year's end, which will scale and drive further opportunities for us in the live space.\n\nOur IMAX 3.0 strategic vision is about growing beyond blockbusters to include unique events and experiences globally by putting our technology in the hands of an expanding set of creative and live partners and becoming a destination for fandom of all kinds. We took a big step forward in that strategy with our acquisition last month of streaming technology company, SSIMWAVE. The company's AI-based automated tools for assessing and improving live streaming and broadcast video quality are better than anything we've seen on the market, which is why partners like Disney, Warner Bros., Discovery, Paramount and more are turning to SSIMWAVE. We view it as a low-risk acquisition given SSIMWAVE has a proven business and client base will generate incremental revenue for IMAX and be accretive in 2023 and make IMAX even more valuable to its most important content partners.\n\nBut we believe there is significant upside by putting together the power of IMAX's global brand behind SSIMWAVE's award-winning engineering team and product suite, IMAX is opening a new world of possibility for our image enhancement capabilities across not only streaming and theatrical but gaming, live sports, VR, AR and the metaverse. Indeed, SSIMWAVE is already testing and learning across several of these areas. We are making excellent progress on the integration. The teams are coming together and uncovering new potential synergies, including within our proprietary digital remastering process and SSIMWAVE's technologies.\n\nIn conclusion, we are focused on accelerating our momentum and driving value for our shareholders, a strong blockbuster slate, including the release of Avatar 2, further network growth, a diversifying global content portfolio and the integration of our SSIMWAVE acquisition, all represent strong potential growth opportunities for our business. And we remain as committed as ever to driving future growth by expanding our network, our content portfolio and what we can deliver for our fans in our theaters and in their homes. With that, I'll turn the call over to Natasha.\n\nNatasha Fernandes -- Chief Financial Officer\n\nThanks, Rich, and good afternoon, everyone. As Rich discussed, we made good progress in the quarter with results that showcase the strength of our differentiated business model. As a reminder, we are a global asset-light technology licensing business with a low cost base and high incremental margins. Third quarter 2022 revenues increased 21% to $69 million from $57 million in 2021, primarily driven by our technology network and technology sales businesses.\n\nAdjusted EBITDA of $16.5 million, was up 26% from the year ago period and adjusted EPS was a loss of $0.05 versus a loss of $0.08 in the year ago period. A few unique items to call out. First, the strengthening of the U.S. dollar had an approximate $11 million negative impact on gross box office, which resulted in an approximate $2 million or 8% impact on technology network revenue and gross margins.\n\nIn SG&A, we incurred $1 million in transaction costs associated with the SSIMWAVE acquisition. These costs have been added back in adjusted EBITDA and adjusted EPS. And lastly, a $4.3 million or $0.08 per share noncash tax reserve against our deferred tax assets. IMAX Technology Network revenue increased 27% to $32 million in the third quarter from $26 million in Q3 2021.\n\nTotal gross box office was $177 million, an increase of 25% over last year's third quarter box office of $142 million. These strong results in a light Hollywood box office period reflects our ability to curate the IMAX slate with local language films rereleases such as Avatar 1 and live events. Gross margins for this business were $18 million or 54%, up from $11 million or 43% in 2021. Contributing to this performance was higher box office that gave -- that given the licensing nature of this business and relatively flat cost structure resulted in profit incrementality.\n\nWe were able to hold costs flat despite 32 films featured in the IMAX Global Theater Network in Q3 compared to 21 titles in the prior year period. IMAX Technology Sales and Maintenance revenue for the third quarter increased to $33 million from $28 million in last year's third quarter, primarily driven by one additional system installation, the impact of amendments to existing theater arrangements and higher revenues from aftermarket sales. Revenue in the quarter was negatively impacted by $700,000 as the theaters in Russia, Ukraine and Belarus continue to be on nonaccrual status. Gross margins for this business increased to $15.4 million from $14.9 million.\n\nGross margin percent of 47%, was lower than the prior year margin of 54%, given the aforementioned nonaccrual status of theaters and the impact on margin and increased site maintenance visits in preparation for anticipated volume of 3D content. In terms of new systems, we installed nine new IMAX systems, seven of which were sales are STLs and two hybrids. This compares to eight new IMAX systems in the prior year period, of which six were sales are STLs and two hybrids. As Rich highlighted, we continue to expect to have between 80 and 100 IMAX system installations in 2022, which equates to 40 to 60 system installs in the fourth quarter.\n\nOur ability to hit the high end of that range continues to depend in part on how quickly the situation in China improves. We have now executed several live events, which are helping to crystallize our strategy and serve as strong references for attracting more events and building partnerships as we look to scale our live event activity in 2023. We've also made good progress in connecting our theaters for live events. 176 connected as of September 30 with a goal of approximately 250 by year-end.\n\nThe related infrastructure costs, depreciation expense and network connection fees to operate this connected theater network are $1 million in the period within film distribution. Moving on to operating expenses. SG&A, excluding stock-based compensation, was $28 million in the quarter, which was down sequentially, however, higher than 2021 levels of $23 million. As a reminder, the prior period Q3 2021 benefited from $1.5 million in COVID-19 government release benefits.\n\nFurthermore, the year-over-year increase in SG&A is primarily driven by increased staff costs as we return to normalized work schedules, a higher level of marketing expense as we increase our digital footprint and $1 million in transaction costs related to the SSIMWAVE acquisition. With respect to Greater China, box office improved sequentially from $26 million in Q2 to $39 million in Q3, an increase of 50%. While not at full potential, box office this quarter was in line with the $41 million experienced in Q3 2021, driven by the success of local language titles, including which is second in Greater China box office this year, only behind the Chinese New Year title Battle of Life Tianjin 2. With the roll in COVID-theater closures in Q3, the IMAX China network was open on average 82% during the quarter.\n\nWe are continuing cost reductions at IMAX China to bring greater flexibility to our model. At the end of September, we closed on the acquisition of SSIMWAVE for $21 million in cash and IMAX shares and a potential $4 million in future earnouts. As Rich described, SSIMWAVE diversifies our business with streaming optimization technology revenues expected to break even in Q4 2022 and accretive in 2023. It also brings us a team of 30 high-caliber software engineers, a short drive from our Toronto headquarters as well as an established client base of four of the 10 largest global streaming companies.\n\nDuring Q3 and through the nine months, we generated positive operating cash flow, respectively, which compares to a use of cash of $2.6 million and $20 million in Q3 and September year-to-date of 2021. Our cash flow generation is improving as revenue increases and as the broader industry recovers from the COVID pandemic. We ended the quarter with $87 million in cash and $238 million of debt, excluding deferred financing costs. $60 million of cash was held at IMAX China and $27 million at IMAX Corp.\n\nAs of September 30, our $300 million revolving credit facility remains undrawn. When combined with our cash on hand and the undrawn component of our IMAX China working capital facilities, we have approximately $437 million of available liquidity as of September 30. Capitalizing on what we view as an undervalued stock price, during the quarter, we repurchased approximately 418,000 IMAX shares at an average price per share of $14.62 for a total cost of $6.1 million. Subsequent to quarter end, we have purchased an additional 1.1 million shares through October 26, bringing our year-to-date repurchases to approximately 4.6 million IMAX shares at an average price per share of $15.37 for a total cost of $71 million.\n\nDuring the quarter, the board approved a $200 million increase to our share repurchase authorization. And our remaining available room under our program as of October 26 is $204 million. For the nine months ended September 30, IMAX China repurchased three million shares at an average price of approximately $1 per share for a total cost of $3 million. We intend to continue to be opportunistic in repurchasing shares when we view our stock price as disconnected from the underlying fundamentals of the business.\n\nWe view this as an efficient high ROI way to return capital to shareholders by increasing their ownership share in IMAX through acquiring ourselves at an attractive multiple. One measure of the impact of this capital deployment is looking at how much adjusted EBITDA per share we've added from share reduction. Q3 adjusted EBITDA grew 26% year over year while adjusted EBITDA per share of $0.29 grew 33%. That repurchases over the past year added seven percentage points of growth when looking at adjusted EBITDA on a per share basis.\n\nOur focus is on driving greater revenue, adjusted EBITDA, earnings and free cash flow per share and to do so at an attractive ROI. Overall, we believe our third quarter results showcased the strength of our curated content portfolio. Revenue, while not fully recovered globally post-pandemic, is driving positive adjusted EBITDA now at eight quarters in a row, supporting investments and creating a positive flywheel that will feed future earnings expansion through our high-margin asset-light technology-centric business model. Supporting our business is a strong balance sheet with substantial liquidity that enables both strategic investments like SSIMWAVE and our 3.0 strategy aimed at driving growth in addition to share repurchases.\n\nAnd finally, we look forward to the fourth quarter and 2023, which feature IMAX friendly titles, a content model that allows us to maximize theater utilization with local languages and live events and the growing tech portfolio that positions us to further diversify our revenue base over time. With that, I will turn the call over to the operator for Q&A.\n\nOperator\n\n[Operator instructions] I show our first question comes from the line of Eric Handler from MKM Partners. Please go ahead.\n\nEric Handler -- MKM Partners -- Analyst\n\nThank you and good afternoon. Rich, in times of the things you can control, you're doing a very good job. China a lot -- there's a lot of unknowns with what the government will or will not do. I'm just curious, are you getting any insights from your theater partners in terms of possibly intentions with lockdown or expectations for how long lockdowns may go on? Are movies actually getting approved right now and how you're viewing the rest of the year in China? And I've got a follow-up.\n\nRich Gelfond -- Chief Executive Officer\n\nSo Eric, I wouldn't say the insights are coming from other -- from our exhibition partners. But I think there are more coming from our team in China, which is obviously part of the expertise they have is understanding what's going on in the government. You and I know each other a long time. And you know one of my favorite things, it's never as good as it looks or as bad as it seems.\n\nAnd what we're hearing from the government is that the COVID restrictions are starting to up a bit. We heard that in mid- to late November, they're allowing some foreign dignitaries and groups into the country without quarantines. As you know, in Hong Kong, they've started to lift some of the quarantines now for three-day short-term kinds of visits. So I think one of the things going on as the Party Congress came out with a fairly strong affirmation of President Xi's policies.\n\nBut our own view, which I've talked to you about a lot, is that the life blood of the system depends on the economy ultimately and the economy hasn't done well under the current policy situation. So I think one reason we spoke in our script to what's going on in China is to the extent of our network and the extent of our business. We're embedded in the Chinese entertainment system in a way that no Western company is, and that's why we went through all the numbers. So I can't tell you in the fourth quarter is the number they're going to go here or is it going to be the first quarter.\n\nBut I can tell you that there have been breaks in the COVID seriousness for months and quarters at a time, and we performed extremely well. I think when those breaks occur, we'll perform extremely well again. I think the one thing to really watch is Avatar in the fourth quarter because I think if Avatar performs according to our expectations and also gets in as we think is more likely than not, very quickly, that will change the narrative around China and the narrative around the introduction of non-Chinese films into China. So it's a long way of saying is, I don't know exactly, but again, we've been there for over 20 years and we built a unique platform that I have no doubt will endure for a long time and be very profitable, but I can't narrow it down to a specific part of the quarter.\n\nEric Handler -- MKM Partners -- Analyst\n\nThat's helpful. And then with regards to buybacks, it's good to see you've been active in the market in the first several weeks of October. Were you blacked out at all in the third quarter with regards to buybacks? And as part of that, too, historically, for a number of years, you have been a bit debt averse. Are you -- given where your stock price is, are you willing to use some of your credit line to buy back stock?\n\nRich Gelfond -- Chief Executive Officer\n\nSo you made a good observation, Eric. We were blacked out for a large part of the third quarter, which is why we didn't buy any stock. And we did buy stock as soon as the blackout was lift and I'll go further was when SSIMWAVE was announced. That's when we started buying stock again.\n\nIt's a complicated question about using debt to buy back shares. I think you've got to look at how much below what you consider fair value it is. Now debt actually has a cost to it, which it used to be free, as you know, until this year. And I think our Board -- and we have a subcommittee of our Board that could act very quickly, we'll decide what to do based on the stock price and based on film slate and based on performance and make decisions.\n\nEric Handler -- MKM Partners -- Analyst\n\nAll right. And then one last thing along those lines. I mean, you do have a lot of your cash in China. What are the costs these days if you want to repatriate that cash?\n\nRich Gelfond -- Chief Executive Officer\n\nWell, I mean, the biggest cause, Eric, is that we have 30% non-IMAX shareholders, as you know. So if we distributed that cash, there'd be 30% leakage to not directly to IMAX. But that hasn't been an issue for us. We've gotten -- we paid dividends in China, as you know, of which we get 70% of them.\n\nAnd we have consistently high intercompany payables and receivables because we do all the manufacturing for China here. So getting money out of China has not really been an issue for us.\n\nEric Handler -- MKM Partners -- Analyst\n\nFair points. Thanks, Rich. Appreciate it.\n\nRich Gelfond -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd I show our next question comes from the line of Eric Wold from B. Riley Securities. Please go ahead.\n\nEric Wold -- B. Riley Financial -- Analyst\n\nThank you. Good afternoon. A question on the kind of the install guidance and backlog. You obviously maintained the 80 to 100 installed guidance.\n\nI know you mentioned that a lot of that getting to the high end is based on what's going on in China. And I assume with two months left, there's got to be a fair amount of visibility more than that wide of a range. So I guess, is it -- I guess, how many are really kind of -- would you consider more line that may leak out of this year? And if they do leak, is it -- would those be Q1 or first half installs? Or is there a chance these could get delayed to the back half of next year?\n\nRich Gelfond -- Chief Executive Officer\n\nI mean, Eric, we kept the guidance because that's where we think it is. We have a lot of visibility into it. But you probably saw today, Wuhan shut down. So I think we're comfortable with the range, but we don't know what we don't know.\n\nSo I mean we could tighten it, but we want to be right, we don't want to be wrong. So that's why we kept it at that parameters. But if you ask me, is there a way we could get to the high end of that range? Absolutely. If you ask me, could we fall below the low end to that range? I think that's highly unlikely.\n\nSo we take these calls and our guidance really seriously, and we do have status report where all this stands. So it's hard to do better when you don't have complete visibility and you don't have predict them ability of what's happening halfway around the world. And yes, I would think if they -- if some of them drift and by virtue of the range, and we have confidence in a lot of them, given where we are today. If some of them drift that I would expect, it would be into next year, the only part of next year.\n\nI mean, these are people who have confirmed that they're going to do installs. So we're not going out of our way to hedge it, but we just don't want it as a public company represent that we know everything there is going on in those markets. We don't. But that's a very educated guess.\n\nEric Wold -- B. Riley Financial -- Analyst\n\nNo, that's fair, Rich. I appreciate that. I guess the follow-up is, as you start thinking about next year and presumably as you get on the Q4 call or giving guidance for '23 installs, is China really the only variable in the drivers of that range? Or are there other things you think about in other parts of the world or economy or whatnot that could really impact that number? Is it really just China is the one you're really focused on is really drive the high end whatever next year's range maybe?\n\nRich Gelfond -- Chief Executive Officer\n\nSo I don't want to sound defensive, but our PSAs in Japan are $1.9 million a screen. We have lots of discussions going on now in Japan about signings and installs for next year in addition to whatever is in our backlog. So I think when we get to the fourth quarter of next year, we'll see how many of those we've signed and we'll see where they stand. And no, it's not all China.\n\nThere's a lot of other things going on in our company and in our backlog. And even for the rest of the year, a lot of the installs we have marked are outside of China. We know exactly where those stand and those aren't at risk by the same kind of factors that I discussed earlier. So I think we're in the process of doing our budget right now.\n\nAnd by the way, I really mentioned this on the call, but I'll add to it. The tone of our signings business seems stronger now than it did in the last quarter. There's a fair amount of activity going on, but we're not yet ready to quantify that since it's not signed. But I will say our business is feeling better now than it did a couple of months ago.\n\nSo when we get to this time next year, we'll give you our best guess.\n\nEric Wold -- B. Riley Financial -- Analyst\n\nThat's helpful. Thanks, Rich.\n\nRich Gelfond -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd our next question comes from the line of Steven Cahall from Wells Fargo. Please go ahead.\n\nSteve Cahall -- Wells Fargo Securities -- Analyst\n\nThank you. Maybe first, Natasha, I was wondering if you could help us unpack the gross margin performance in the third quarter. I think the sales and maintenance gross margins were down about 700 basis points. You mentioned there was -- I think I heard a $700,000 hit from the kind of Russian sphere theaters as well as some install prep.\n\nAnd so since you've got a lot of installs ahead and the Russia drag is still there, I was wondering how we should think about the sales and maintenance gross margins for the fourth quarter? And then we've got a follow-up.\n\nNatasha Fernandes -- Chief Financial Officer\n\nSure. So as you look to the fourth quarter, I mean, we generally have a 40% margin on our maintenance business. And I mean, our box office is all incremental as you look to Avatar and Black Panther. Gross margin percentage was at 47% this year versus 54% prior year.\n\nI mean, two factors impacted that. That was the last high-margin finance income and higher maintenance costs as we prepare for Avatar in 3D, which has been a long time since we've had 3D and particularly for Avatar, it's super important for us as we look for that. So the other part of it is your sale in STL and maintenance business. And I think we've given the guidance of that, that we will have the split of 40% STLs and 60% JVs for the remaining 40 to 60 installs in Q4.\n\nAnd that's sort of how I would look at Q4's gross margin.\n\nSteve Cahall -- Wells Fargo Securities -- Analyst\n\nGreat. And then just one on SSIMWAVE. I mean I think the history of the company has really been a supplier of technology to filmmakers and exhibitors. And I guess, audience kind of by design, it seems like you're really looking to expand the pool of businesses and technology that you want to provide.\n\nShould we think of SSIMWAVE as the beginning of kind of more to come in terms of technology that you own or acquire being used by a broader field of businesses or consumers, kind of a broadening of your technology portfolio? Or would you describe this as more opportunistic where you saw something that you thought fit nicely into some other things you're doing and that's why SSIMWAVE made sense?\n\nRich Gelfond -- Chief Executive Officer\n\nWe very much think of ourselves, Steve, as a technology platform. And as you know, we don't own virtually any theaters in the world and that virtually all of our income comes from licensing our technology and maintaining our technology and ancillary businesses. So we've always been looking around for ways to expand the kinds of technology we could do. And we're incredibly excited about SSIMWAVE.\n\nThat company has grown 25% compounded for a number of years. And by the way, they're not even outside the United States. and Canada, and we think we could do a lot there. But we think we could expand similarly in nonlinear ways because of the technology they have and the engineering team, they could help us solve much bigger problems in the entertainment industry.\n\nSo again, somebody like Disney decided to bet on a streaming service, which was a specific bet. We bet on the growth of streaming revenues because that's how we get paid. So virtually whatever streaming service it is, we plan on expanding the basket of services that we can provide from what SSIMWAVE does now, which was kind of optimize streaming technology, which in English, that means we could save a lot of money for the streamers by analyzing the kinds of content and the kind of devices and how to sort of blend that to help them save money, which is a very, very big deal. But we think there are products we can develop that we haven't talked about at all that could potentially be game-changing in a very material way.\n\nAnd whether they're in-house develop or other acquisitions, I think it's too soon to say. We're not going to bet the company on a big acquisition. We never have and we never going to do that. But I think we are super intrigued by what we've got here.\n\nAnd it's only been a little more than a month, but we've made a lot of progress in integrating the teams and the kinds of problems that they're looking at.\n\nSteve Cahall -- Wells Fargo Securities -- Analyst\n\nGreat. Thank you.\n\nRich Gelfond -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd I show our next question comes from the line of Mike Ng from Goldman Sachs. Please go ahead.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nHey, good afternoon. Thank you very much for the question. It is encouraging to hear the installation guidance reiterated for the year. I was just wondering if you could talk a little bit about whether or not you still see the same mix of sales type versus -- sorry, same mix versus of upgrades versus new installs and sales types versus And then separately, I was wondering if you could talk a little bit about the relocation product.\n\nWhen is that -- when does that usually happen and what's usually the business case for it? Thank you very much.\n\nRich Gelfond -- Chief Executive Officer\n\nWhat do you mean by the relocation project?\n\nMike Ng -- Goldman Sachs -- Analyst\n\nIt was mentioned in the press release that IMAX theater systems were relocated from original locations year-to-date. I just don't really understand what that was.\n\nRich Gelfond -- Chief Executive Officer\n\nWhat that means, Mike, is if for whatever reason, and there's a variety of reasons. One, it's not working at a specific location or -- meaning from a financial point of view. But the most common kind of thing is an exhibitor will stop -- will terminate its lease in a multiplex, which is based in one place, but they still owe us the revenue stream under that theater. So we'll accommodate them and try to move it somewhere else.\n\nSo it doesn't shrink the network. They put it in another theater. And Nasdaq, do you want to talk about the mix?\n\nNatasha Fernandes -- Chief Financial Officer\n\nSure. so Mike, our mix for new installs versus upgrades is 35% new installs and 65% upgrades for Q4. And so we're fairly in line historically on an annual basis, and our upgrades skew more to JVs. And in Q4, we expect approximately.\n\nAs I said, 55%. And that's just driven by the fact that we like to have a mix between the benefit of having a JV that has the recurring revenue stream and then you have the sales in STL types that have an uptrack revenue stream. And then overall, we commented in our deck that our mix is 40% for sales -- sales-type lease and 60% for JVs for Q4.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nExcellent. Thank you, Rich. Thank you, Tasha. Thank you.\n\nOperator\n\nAnd I show our next question comes from the line of Chad Beynon from Macquarie. Please go ahead.\n\nChad Beynon -- Macquarie Group -- Analyst\n\nHi, good afternoon. Thanks for taking my question. I wanted to ask about the local language initiatives and really just kind of the multiyear opportunities. You talked about the content for '23.\n\nAnd in your slide deck, you show the growth just in terms of local language titles. Can you just kind of help us understand the broader studio stability for these nonmajors that are producing these? Should we think about 2023 as potentially an anomaly? Or do they have the vision, the balance sheet and really the demand that can keep this product going and partnering with you guys beyond '23?\n\nRich Gelfond -- Chief Executive Officer\n\nNo, these are major studios in other countries in the world. So we've done between five and 10 movies in Japan with Toho, which is the largest studio in Japan. And actually, I was over there, I don't know, a couple of months ago. And those movies are doing really well.\n\nAnd they want to do a lot more of them. And they're also not only doing well in IMAX, but like in the U.S., where the studios have discovered that they create more positive conversation around the movie, they're helping the movie so back to Japan because on the top of my mind, but two of the movies Slayer and became two of the biggest movies of all time in Japan, and they were filmed in IMAX. And in India, I think, this year, four of the biggest 10 movies in India were IMAX-related movies. And our box office in India with IMAX movies is, I think, 33% of the total box office now.\n\nSo no, this is a real business, an exciting business. And again, it allows us to diversify away Hollywood not to belabor the point, the $1.9 million PSA in Japan I'm looking, so I don't misspeak. But I think a majority of that has been Japanese films or at least a very large portion of it. So there's been a migration from where consumers used to think of IMAX as a place to see Hollywood films on a global basis.\n\nNow I think people around the world take them as a place to see blockbuster films, whether they're local ones or Hollywood ones. So that's a real business that will stick around and if I had to speculate, grow.\n\nChad Beynon -- Macquarie Group -- Analyst\n\nOK. Thanks, Rich. And then my follow-up just in terms of -- any indication of kind of preorders for Black Panther probably a little far out for Avatar. But I guess when can we start getting a good sense of how demand is kind of ahead of some of these massive releases?\n\nRich Gelfond -- Chief Executive Officer\n\nWell, Avatar tickets still go on sale until November 21. So we have no idea about that. Although our exhibitors around the world are all extremely optimistic about it and have expressed this. Black Panther, I think it opens in about a week or two.\n\nDo we have any sense making about presales now?\n\nNatasha Fernandes -- Chief Financial Officer\n\nYes. Presales are very solid for Black Panther. It's a highly anticipated going to be as we were discussing earlier in the day, the premier just happened last week and the reviews for the movie are extremely solid with this much time before release. I think it bodes very well for both presales and the opening weekend.\n\nOperator\n\nAnd I show our next question comes from the line of David Karnovsky from J.P. Morgan. Please go ahead.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nHey, thank you. Just one for Rich. Just following up on China with the Party Congress behind us, I wanted to see if you have any update on the pipeline for Hollywood films into China. I know you mentioned some optimism around Avatar.\n\nNot sure if you see anything get around Black Adam. I think there was some different new stories around that. I just wanted to get your update to view.\n\nRich Gelfond -- Chief Executive Officer\n\nI heard a rumor today, I hesitate to repeat if it's someone from my Chinese office told me this morning that he thought out Black Adam was going to play in kind of mid-November. Again, I can't confirm that, but that's what I was told. Other than that, I think we're waiting to hear the official word on Avatar. And I mean, there are a couple of things going on in China.\n\nOne was the Party Congress and cut it out bureaucracy was at a standstill, waiting for certainty. So I think you'll start to see that break in the next month or two and announcements come out about it. I know there have been a number of films submitted, so there's a queue there. So again, I don't know when.\n\nBut I would expect over the next few months, we'll hear.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nOK. And then for Natasha, apologies if you entered this in your commentary around Q4 margins. But any outsized or unique marketing expense we should be aware of as it relates to Avatar in the quarter?\n\nRich Gelfond -- Chief Executive Officer\n\nYes, I would say yes, this is Rich. We think Avatar is going to be a very big movie. And we're going to spend some money to support it, and we think it has a very good ROI on it. And we wish we could find other opportunities to invest that we think are going to be as good as Avatar.\n\nDo you want to add anything, Natasha?\n\nNatasha Fernandes -- Chief Financial Officer\n\nAnd also, as you look to Black Panther as well, that's a film for IMAX movie. And so usually, those types of movies we put a little more behind it as well because of our unique DNA in it.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nWe have time for one last question. Our last question will come from the line of Michael Hickey from The Benchmark Company. Please go ahead.\n\nMichael Hickey -- The Benchmark Company -- Analyst\n\nEric Rich, Natasha. Happy Halloween, guys. Thanks for taking my questions. On the installations, I realize you still have a fairly wide range here for this year, which I expect.\n\nObviously, a lot we still don't know. I think probably most of your valuation consideration now though is on '23, which you haven't provided guidance on installations, Natasha, which I understand why. But when you think about sort of midpoint or low end of your range this year, are you comfortable qualitatively that you would think you could drive installation growth in '23? And I have a follow-up.\n\nRich Gelfond -- Chief Executive Officer\n\nSo the answer is we don't know. I answered that question a few times. There are territories like the Middle East and Japan and other places in Asia that are absolutely killing it. They're places like China that are still in COVID lockdown.\n\nYou answered the question for me about how that -- those can be dealt with. I could fill it in. But I said earlier, the pace of our business and inquiries is on a better trajectory than it was several months ago. So if that trajectory continues, given how difficult the last few years have been, I would hope that, that would turn into increases in the number of installations, but it's premature to predict that right now without having more data.\n\nMichael Hickey -- The Benchmark Company -- Analyst\n\nAll right. So now the last question, which, obviously, a lot of companies reported sort of consistent narrative to your economies impacting consumer or vice versa, but we're seeing broad areas of weakness. I'm curious when you look across all your geos, which obviously have their own economic profile, are you seeing consumer weakness that's impacting your ticket sales or the broader box office? And then when you think about where maybe we have a real recession, I guess, if not in one now, and I realize that the box office has been resistant historically to recessions. But obviously, we've never had OTT competition in home like we do now.\n\nWhat are sort of the pluses and minuses of growing in that environment to you?\n\nRich Gelfond -- Chief Executive Officer\n\nSo my 2008 was one of the best years we had '08 to '09 when it was broad-based recession. As you said, our business generally recession resistant. IMAX is an affordable luxury. You might cancel a vacation or a restaurant, but it's really a getaway experience.\n\nYou right in-home trends have changed, but we continue to pick up market share this year, early in the year. I mean, I know this seems like ancient history, but Top Gun and Jurassic were all that. Doctor Strange were only a few months ago and are indexing and our market share are really good. So I don't think that's going to be an issue.\n\nMichael Hickey -- The Benchmark Company -- Analyst\n\nThanks, Rich. Good luck.\n\nRich Gelfond -- Chief Executive Officer\n\nThanks a lot and happy Halloween.\n\nOperator\n\nThis concludes our Q&A session. At this time, I'd like to turn the conference back over to Rich Gelfond, CEO, for closing remarks.\n\nRich Gelfond -- Chief Executive Officer\n\nSo I have a unique advantage over some of you, not all of you. But I've been here for close to 30 years. And I've come to understand, as I said to Eric earlier, that it's never as good as it looks and bad as it seems. And when made a speech, I don't think it changes the long-term value of IMAX in China.\n\nWe're a huge consumer proposition, and we've done very well. On the other hand, I don't think when we have one movie, it changes the narrative in a material way with one possible exception, which is Avatar because that's not one movie, there's four of them coming. And second of all, I think when you look what that did to our business, not only when the movie came out, but over the rereleases in the last couple of years, and the preparation that we're doing and the coordination we have with Disney doing it. So I scratch my head.\n\nI know CEOs aren't supposed to talk about this stuff. But when I see where I stock has been going with the release of Black Panther 2 and Avatar, I really scratch my head because as you know, the theme of this call was of really turning it around in a super positive way. And I guess we'll find out, but from my point of view and listening to us about our buybacks recently, we certainly think we're headed in the right direction. So thank you all for your support.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJennifer Horsley -- Senior Vice President, Investor Relations\n\nRich Gelfond -- Chief Executive Officer\n\nNatasha Fernandes -- Chief Financial Officer\n\nEric Handler -- MKM Partners -- Analyst\n\nEric Wold -- B. Riley Financial -- Analyst\n\nSteve Cahall -- Wells Fargo Securities -- Analyst\n\nMike Ng -- Goldman Sachs -- Analyst\n\nChad Beynon -- Macquarie Group -- Analyst\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nMichael Hickey -- The Benchmark Company -- Analyst\n\nMore IMAX analysis\n\nAll earnings call transcripts"
}