{
  "companyName": "Academy Sports And Outdoors",
  "companyTicker": "ASO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/07/academy-sports-and-outdoors-aso-q3-2022-earnings-c/",
  "content": "Academy Sports And Outdoors (ASO 0.25%)\nQ3 2022 Earnings Call\nDec 07, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to the Academy Sports and Outdoors third quarter fiscal 2022 results conference call. [Operator instructions] I will now turn the call over to Matt Hodges, vice president of investor relations for Academy Sports and Outdoors. Matt, please go ahead.\n\nMatt Hodges -- Vice President, Investor Relations\n\nGood morning, everyone, and thank you for joining the Academy Sports and Outdoors third quarter 2022 financial results call. Participating on the call are Ken Hicks, chairman, president, and CEO; Michael Mullican, executive vice president and CFO; and Steve Lawrence, executive vice president and chief merchandising officer. As a reminder, statements in today's earnings release and the comments made by management during this call may be considered forward-looking statements. These statements are subject to risks and uncertainties that could cause our actual results to differ materially from our expectations and projections.\n\nThese risks and uncertainties include, but are not limited to, the factors identified in the earnings release and in our SEC filings. The company undertakes no obligation to revise any forward-looking statements. Today's remarks also refer to certain non-GAAP financial measures. Reconciliations to the most comparable GAAP measures are included in today's earnings release which is available at investors.academy.com.\n\nUnless otherwise noted, comparisons are to 2021, but 2019 comparisons also provided where appropriate to benchmark performance, given the impact of the pandemic in 2020 and 2021. I will now turn the call over to our CEO, Ken Hicks.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThank you, Matt. Good morning, and thank you, all, for joining us today. As we anniversary our second year as a public company, I'm proud of the operational and organizational initiatives we've undertaken that have transformed the company and helped drive our solid financial performance. Our talented team of retail leaders have improved every aspect of our company when compared to pre-IPO Academy, including improving our merchandise planning and allocation processes; building an outstanding assortment of good, better, best products for our customers while maintaining our focus on value; significantly enhancing our e-commerce capabilities; increasing customer loyalty through the launch of the Academy credit card; modernizing our marketing, along with our store experience; and meaningfully improving our financial stability.\n\nWe are in excellent financial health capable of self-funding all of our capital priorities, which include new store expansion, omnichannel growth, technology enhancements, increasing supply chain capacity, and rewarding shareholders through share repurchase and dividends. The third quarter was challenging, and our reported net sales of 1.49 billion, a negative 7.2% comparable sales, were below our expectations. We saw sales increases in footwear and apparel but experienced sales decline in outdoors and sports and recreation. Steve will discuss our sales results in more detail later in the call.\n\nWhen comparing third quarter sales to 2019, we maintained a 30% growth trend, which is in line with what we have seen year to date. We believe this is a strong indicator that our business is baselined at a much higher level post-pandemic, and there is ongoing durable consumer demand for the sports and outdoors category. Looking at our third quarter profitability, adjusted earnings per share were $1.69, which is below last year, but in line with our expectations. We maintained a 35% gross margin rate with an improved mix of products, increasing merchandise margin rates, and controlling cost.\n\nWe also held a double-digit EBIT margin and, for the second year in a row, expect to end the fiscal year with an annualized EBIT margin rate above 10%, which is one of our long-term financial goals. The freshness and in-stock position of our inventory across most of our categories is in very good shape. We believe we have the right amount of product from key partners like Nike, adidas, and Under Armour to offer customers what they are looking for this holiday. There will likely be more promotional activity in the marketplace this holiday season, but we are prepared to be competitive with our own planned promotions, as well as our everyday value positioning, which is in our plans.\n\nWhile we know that our customers have been under inflationary pressure and do not have the stimulus money they had last year, they are still focused on health and wellness, pursuing their hobbies, and winning their kids to participate in their sports and activities. Our good, better, best assortment of top national brands and strong private brands available at everyday value prices allows them to continue to do that at an affordable price. As a reminder, the majority of our customers are in the middle three quintiles ranging from $50,000 to $150,000 in annual household income. There's also an ongoing population migration to our base in the South and Southeastern United States.\n\nWe currently operate in some of the fastest growing markets in the country, such as Austin, Texas; Atlanta, Georgia; and Raleigh, North Carolina. We are uniquely positioned to benefit from this shift and intend to capitalize on it by executing our growth plan of opening 80 to 100 new stores between 2022 and the end of 2026. During Q3, we opened four stores in Richmond, Virginia; Atlanta, Georgia; Lexington, Kentucky; and Jeffersonville, Indiana. We have also opened three stores in Q4: one here in Houston; one in Tampa Bay, Florida; and one in a new state for us, Barboursville, West Virginia.\n\nThese store openings were a mix of locations in existing, adjacent, and new markets. We are measuring and analyzing the different market types and all aspects of the opening process, marketing, merchandising, localization, seasonality, and staffing, to gain a better understanding of our approach and optimize our process as we open even more stores in 2023 and beyond. I want to give a big thanks to all of the team members who helped execute through successful store openings. The Academy team remains focused on executing our priorities to achieve our vision to become the best sports and outdoors retailer in the country, while providing fun for all through assortment, value and by delivering a great experience for our customers and creating value for our stakeholders.\n\nI will now turn the call over to Michael to provide more detail on our third quarter financial results, new stores, and provide an update on our 2022 guidance. Michael?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nThanks, Ken. Good morning, everyone. Academy delivered another profitable quarter for shareholders despite ongoing macroeconomic headwinds by prudently managing inventory, expanding merchandise margins, and controlling expenses. Since going public more than two years ago, we have consistently demonstrated that we have achieved a material step-up of our earnings potential and free cash flow generation compared to years past.\n\nIn the third quarter, net sales were 1.49 billion, with comparable sales down 7.2% as we anniversaried a strong Q3 2021 comp of 17.9%. The sales decline was a result of lighter traffic and fewer transactions compared to last year. But overall, we have maintained the market share gained over the last two years in each of our merchandise divisions. We saw share gains this quarter in apparel and footwear, resulting in our sales mix team being more balanced between hard and soft goods compared to recent quarters.\n\nOur e-commerce sales increased 10.5%, marking the fifth consecutive quarter of double-digit growth and represented 9.5% of merchandise sales. When compared to Q3 2019, our e-commerce business has grown 173%, and the penetration rate has more than doubled. As we have stated before, we believe academy.com is a competitive differentiator for us in a very meaningful part of our future growth that we intend to invest in for the foreseeable future. As Ken said, we have completed all nine of our planned store openings for 2022.\n\nAcademy stores have the highest store productivity in our peer group, making our new stores an effective use of our capital with a high return on investment. During Q3, our existing store productivity was once again best in class. Trailing 12-month sales per square foot were $351 per foot and trailing 12-month operating income per store was $3.2 million. Gross margin dollars during the quarter were $522.5 million with a rate of 35%, only 20 basis points below last year's record third quarter of 35.2%.\n\nAs Steve will tell you more about in a minute, we increased our merchandise margins compared to last year despite various external pressures as our refined merchandise planning and allocation processes continue to generate margin opportunities. We also saw a shift in our sales mix toward soft goods. These margin gains were partially offset by an increase in e-commerce shipping costs and shrink during the quarter. Since the pandemic, we have over-indexed on the hard goods side of the business.\n\nAnd as our mix shifts back to soft goods, our gross margin rate should benefit. SG&A expenses were 23% of sales, a 140 basis-point increase compared to last year. The change was primarily a result of fixed cost deleverage from the decline in sales and additional pre-opening expenses associated with opening new stores. Operating income for the quarter was 179.5 million or 12% of sales.\n\nAcademy has now delivered double-digit operating margins for seven straight quarters. Through the first three quarters of this year, we have generated over 640 million of operating income, which is more than the company earned in all of fiscal 2019 and 2020 combined. This is a clear indicator that the operational and organizational improvements made over the past few years have structurally changed and enhanced the earnings power of Academy. Third quarter GAAP diluted earnings per share were $1.62 per share compared to $1.72 per share last year.\n\nAdjusted diluted earnings per share were $1.69 per share compared to $1.75 per share last year. Looking at the balance sheet. Academy ended the quarter with 318 million in cash and had no outstanding borrowings on our $1 billion credit facility. Our positive cash flow generation remained strong as we delivered $50.8 million in net cash from operating activities.\n\nDuring the third quarter, we executed on our capital allocation plan, in part by investing in the following: opening 4 new stores, repurchasing 2.2 million shares for approximately $100 million, paying out $6 million in dividends, investing in supply chain and technology enhancements; and lastly, maintaining a healthy cash balance. In addition, the board recently declared a dividend of $0.075 per share payable on January 13, 2023, to stockholders of record as of December 20, 2022. Looking at our inventory, our ending inventory balance was 1.5 billion, a 12.8% increase compared to Q3 2021. When compared to Q3 of 2019, inventory dollars were up 12.3%, while units declined by 10% on the 30% sales increase.\n\nThis demonstrates that we have effectively managed our inventory while experiencing significant sales growth. To illustrate, when comparing revenue versus inventory per square foot this quarter to Q3 2019, revenue per square foot has increased 28%, while inventory per square foot has only increased 10%. Lastly, based on our year-to-date results and current trends, we are narrowing our sales and earnings guidance and raising our full year 2022 earnings per share forecast as follows: comparable sales are expected to range from down 6% to down 5%; GAAP income before taxes is expected to range from $790 million to $810 million with an expected gross margin rate of 34% to 34.5%; GAAP net income of between $610 million and $620 million; GAAP diluted earnings per share of $7.25 per share to $7.40 per share. Adjusted diluted earnings per share, which excludes certain estimated expenses, such as stock compensation and store pre-opening expenses, are now expected to range from $7.50 per share to $7.65 per share.\n\nThe earnings per share estimates are calculated on an updated share count of 84 million diluted weighted average shares outstanding for the full year and do not include any potential repurchase activity using our remaining $400 million authorization. We remain confident that our business model, driven by our transformed retail capabilities and the everyday value of our products, positions us well to navigate this uncertain environment and to win this holiday season, but also to drive long-term sales and profits. With that, I will now turn the call over to Steve, who will give you more details around our merchandising and operations performance. Steve?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nThanks, Michael. As you heard earlier, our Q3 sales came in at $1.49 billion, which was a 7.2% comp decline versus 2021, but up 30% versus our 2019 baseline. This is a little lower than the first two quarters, which were up 36% versus '19, but we're pleased that we continue to hold on to the large majority of the gains from the past couple of years despite a more challenging macroeconomic environment. It was also good to see three of our four divisions showing an improvement in the trend versus last year during third quarter.\n\nFootwear was our best performing division in the quarter, with sales coming in at a 5.1% versus last year, and up 32% versus '19. We got off to a strong start during back-to-school and footwear and saw the momentum carried throughout the quarter. As you'd expect, a lot of the categories that spike during back-to-school, such as kids shoes and cleats, were some of the leading performers during the quarter. We also continue to see strong sales in key brands, such as Brooks, Crocs, and SKECHERS, along with a very successful launch of HEYDUDE across all of our stores.\n\nApparel sales also rebounded in Q3 with an increase of up 0.5% versus last year, which was a dramatic improvement versus our spring trend. Like footwear, we continue to run double-digit comps for 2019 baseline of up 24%. Back-to-school results were also strong in apparel, and the momentum that started early on carried forward into the remainder of the quarter. This momentum, coupled with an improved inventory position and top brands, such as Nike, Columbia, and Carhartt, versus last year helped spark selling in fall seasonal categories, such as fleece and outerwear.\n\nWhile our sports and direct business in Q3 was down 4% to last year, it was also an improvement versus our spring trend and was up 40% versus 2019. We continue to see solid gains in our sporting goods business with the strength across key categories such as football, baseball, and golf. The softest category in this area remains the home fitness business, which declined double digits versus last year but has stabilized at up over 25% versus our 2019 baseline. Our biggest challenge during Q3 was our outdoor business, which posted an 18.3% decline and was the only category where Q3 sales softened versus the first-half trend.\n\nIt's also important to note that we continue to hold on the majority of the gains we picked up over the past couple of years in outdoor with this business still running up 30% versus 2019. Softest category was hunting, where we struggled to anniversary high double-digit comps in ammunition from last year. We're up against the sales spike driven by large receipts that were helping us get back in stock during Q3 of 2021. Broadly speaking, the overall inventory level from ammunition have stabilized across the industry over the past year.\n\nWe started to see a lot of the stock-up surge activity by consumers drop off, which has resulted in slowing demand. While running negative comps versus last year, the ammunition business continues to run up triple digits year to date versus 2019, and we saw the declines versus 2021 start to lessen as we got deeper into the quarter. To sum it up, the miss in outdoor, largely driven by ammunition, comprised over 100% of our drop for the company, so stabilizing this business is a clear priority for us. Shifting to margins.\n\nAs planned, we held on to most of the gains we've made over the past couple of years. Gross margin rate for Q3 came in at 35%, which is a 20 basis-point decline versus '21, was up 340 basis points versus 2019. Similar to the last couple of quarters, beneath the surface, our merchandise margin was up 60 basis points versus last year and continues to run well ahead of 2019 levels. We attribute the continued strength in gross margin to a combination of the hard work the teams have done over the past couple of years around improved buying and planning and allocation disciplines, coupled with a favorable mix of sales in the higher-margin categories of apparel and footwear.\n\nAs we finish out the year, we built in a well-thought-out promotional calendar for this Q4. This cadence is more aggressive than the past two holiday seasons and is focused on driving traffic to our stores by providing our customers with outstanding deals on giftable items. These additional promotions are accounted for in the guidance Michael discussed earlier. And our expectation is that despite this uptick in discounting, we will continue to hold on to most of the margin gains from the past couple of years.\n\nWe also believe that our everyday value pricing, coupled with our thoughtful promotional strategy, will allow us to maintain our position as a value leader in our space and gain market share during Q4. In terms of inventory, our teams continue to do an outstanding job in managing through a challenging environment. We ended the third quarter with inventory up 13% versus last year, which is lower than the 17% increase we entered the quarter with. Our inventory levels and content are in the best position they've been in over the past couple of fourth quarters, putting us in a prime position to take advantage of the holiday traffic surge.\n\nAnother sales driver for us is continuing to lean into new initiatives and brands that resonate with our core target customers. Couple of funding ideas that we put in place for this holiday, including launching Christmas-themed Magellan Outdoors apparel, expanding into gas-powered ride-ons from Coleman, along with adding Ukiah and BioLite FirePit into our outdoor heating. All of these ideas should help reinforce Academy as the best destination for all things sports and outdoors. The team has worked hard to get back in stock and ensure that our inventory is much better balanced to the position, and the key brands and categories will drive customers into our stores for this holiday.\n\nOur everyday value pricing, coupled with a strong well-thought-out promotional cadence, will allow us to deliver a strong value proposition this holiday. When you combine that with our broad assortment of the most desirable brands and our strong in-store experience, we believe that we have a winning formula to continue to pick up market share. Finally, we also continue to lean into more digitally targeted advertising, while reducing our reliance on traditional broadcast and print. This shift helps improve our overall marketing reach and effectiveness while also allowing us to be much more nimble in reacting to pricing promotions.\n\nIn closing, we believe that we have the proper strategies in place and are well positioned to drive the business and continue to gain market share during the very important Q4 time frame and beyond. Now, I'd like to turn the call back over to Ken for some closing comments. Ken?\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThank you, Steve. Despite the challenging macro environment, we've delivered a solid operational and financial performance this year. We've made significant improvements over the past several years, resulting in our profitability being materially higher than just a few years ago. This is the result of our dedicated team working diligently toward our vision of becoming the best sports and outdoors retailer in the country.\n\nAcademy is well positioned to have a successful holiday season. This past Black Friday was the largest sales day in the history of the company, and we are maintaining the 30%-plus sales trend compared to 2019. That being said, we still have the biggest three weeks of the year ahead of us, but we are confident in our plan. Academy has enormous future potential growth opportunities from opening new stores, expanding omnichannel, improving existing stores, and from operational improvements.\n\nThere's a lot to be excited about, and we are prepared to execute to achieve our near- and long-term goals. I'd like to close by thanking all of the Academy sports and outdoors team members and wishing everyone a joyful holiday season. We'll now open up the call for your questions. Thank you.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of John Heinbockel with Guggenheim. Please proceed with your question.\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nHey, guys. I wanted to start with as you think about the fourth quarter, right, the implied comp right at the midpoint is down two. That's the sort of same trend line. So, not a multiyear improvement.\n\nBut how -- when you think about the four categories or the four divisions and you think about the prospect for improvement, right, sequentially in each of those four, where do you see the biggest opportunities, right, based on the merchandise content and the behavior of your customer?\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nHi, John. Thanks for the question. We obviously have seen good strength in our soft lines, apparel, and footwear categories, and they continue to provide an opportunity, as well as team sports, which has been a very good business with us. So, those are three of the businesses that I think we have, you know, good opportunities with.\n\nThat said, there's still challenges out there in some of the outdoor areas. But I'll let Steve provide a little more color.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nYeah. If you go back to a year ago, the supply chain was still pretty much in disarray. When you look at where we're sitting today in terms of our ownership and seasonal categories, cold weather goods, giftable items for Christmas, we're in a way better shape than we were a year ago. So, we feel pretty confident about our inventory composition there.\n\nWe feel like our inventory is under control and that it's well balanced across all the areas. The one category called out as being challenging for us was the outdoor category. And beneath that, it's ammo is really the biggest challenge there. The good news is, you know, we're starting to see the trend line versus [Inaudible] get a little better.\n\nIt's still negative, but it's less negative than it was early in the quarter, and we're starting to see that business stabilize. So, you know, that's going to probably be a challenge for us throughout the remainder of this year. But we do feel like we're seeing strength in the other categories, which is helping offset some of that.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nAnd, John, a couple of more points in addition to the categories. We expect to have a good finish to December. The guidance that we provided implies that we're going to be up 30% to 2019, which is consistent with recent trends. That's in line with our quarterly and monthly builds, which are usually a pretty reliable indicator of our performance.\n\nIn addition to being better in stock and key holiday programs, as Steve mentioned, we're looking at the consumer and how they are behaving. We have some planned traffic dropping promotions, and we were not in a position to do that last year because we didn't have the inventory. And if you recall, last year, there was a scarcity of goods in the market, which led to a lot of early purchasing. This year, there's an abundance of goods.\n\nAnd so, we think that, coupled with a favorable calendar, there's an extra Saturday this year before Christmas, we'll probably see some late shopping. The weather hasn't been terribly helpful to sales. It's been a pretty warm start to the holiday season. So, we think the last couple of weeks, we'll see a lot of sales coming late.\n\nAnd as a reminder, we've invested a lot in our buy online, pick up in-store business. Our customers are leaning into that. And we're going to be in a good spot to deliver for them down the stretch.\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nAnd then, maybe as a follow-up, right, on supply chain, you've had this distribution initiative for a little bit. Where do we sit on that? And when you think about capacity, I know you've got capacity for the time being. But as you look out capacity in the three DCs, and then, at some point, I guess you'll need a fourth DC, I guess, further north, how do you think about the network over the next three or four years?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYou're correct. At some point, we need a fourth DC, and then we'll need a fifth. And as we grow to reach the potential of the company, we'll probably need a sixth at some point. For the next several years, we're in good shape.\n\nWe've got plenty of capacity. It is -- we think about the next five years of the business, we will start to incur costs and, frankly, think about adding a fourth distribution facility. We'll be in a position to speak more about that later. But for the next several years, probably until 2025, 2026, we're in a good position.\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nOK. Thank you.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThanks, John.\n\nOperator\n\nOur next question comes from the line of Daniel Imbro with Stephens. Please proceed with your question.\n\nDan Imbro -- Stephens Inc. -- Analyst\n\nYup. Hey. Thanks for taking the question, guys. Good morning.\n\nCongrats. I want to start on the top line, maybe following up on the last line of questioning. So, you kind of implied, you know, continuation of 30% growth versus pre-COVID in the fourth quarter. I know it's early to think about 2023, but I guess maybe could you qualitatively talk about how you're thinking about next year? I mean, if you execute on your merchandising initiatives that, Steve, you laid out with the new brand, I mean, can you grow on this new base? Have we rebased to a point where growth is possible as we look out to next year?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nI think one of the things that we're pretty confident is that we have rebaselined at a higher level. You know, if you go back each quarter this year, it's been in that low to mid-30s in terms of the performance versus 2019. So, we do feel like we're going to be building off a higher base. But that being said, it's still too early for us, I think, to give guidance for 2023 at this point in time.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYes. As Steve said, not prepared to provide guidance for 2023 at this time. I will say, look, we have a few categories that, in this quarter, comprised 100% of the drop. And they're namely hunting categories, outdoor categories.\n\nThose categories are considerably stronger to 2019. And frankly, we expect most -- to maintain most of that gain in 2019 this year and beyond. We've got some categories that were really strong during COVID, and, you know, people call them COVID categories, COVID winners. Many of those actually haven't reverted to 2019.\n\nA great example is the outdoor cooking and outdoor furniture, which, collectively, in the quarter, were higher than they were last year. The rest of the business and the business as a whole is exceptionally healthy. We took share in soft goods this quarter, you know, despite being up against a lot of clearance in the market. Our inventory position is very healthy.\n\nWe haven't had to take drastic and dramatic measures to clear inventory like others, the retailers in the space have. We've got best-in-sector free cash flow generation. We continue to deliver best-in-sector store productivity. And our EBIT net income rates are higher than many in the sector.\n\nSo, I think we're in a good position to finish this year strong and the next year strong as we think about the plan for next year and beyond.\n\nDan Imbro -- Stephens Inc. -- Analyst\n\nReally helpful color. And then, I guess just a follow-up on that. You know, Mike, I know you guys were private during the Great Recession. But could you provide any color of just in case study of the kind of benefit you saw from the trade-down? It sounds like you guys are bullish that you'd see your everyday value offering maybe helped take share.\n\nCan you help quantify what you've seen during past downturns and the data you have on that?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nNo doubt. None of these economic cycles look exactly like the other, but you try to draw some parallels from it. 2008, 2009, and 2010 were collectively very strong comp years for the company, and those were some tough years. This is a little bit different cycle and that consumer balance sheets are still relatively healthy.\n\nThat won't last for a heck of a lot longer if inflation rates continue to rise and obviously go into recession. If that occurs, we are in a great position to pick up market share because we're the value player. I think what we've shown is our team, our customers, and our business are incredibly resilient through a variety of economic cycles.\n\nDan Imbro -- Stephens Inc. -- Analyst\n\nGreat. I appreciate all the color, and best of luck.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nThanks.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThanks, Dan.\n\nOperator\n\nOur next question comes from the line of Christopher Horvers with JPMorgan. Please proceed with your question.\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nIt's Megan Alexander on for Chris. Thanks for taking our question. You know, maybe I just wanted to follow up as well on an earlier question, you know, that three-year trend of 30% versus 2019. Has that at all improved throughout the quarter in November and into December? You mentioned weather not being helpful.\n\nIt's gotten a little bit colder, and then it does seem like there's a more normal cadence of holiday shopping this year. So, I'm just trying to understand, does that, you know, get any better especially as you move through Black Friday, which you mentioned was strong?\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYeah. The 30% trend has been pretty consistent, you know, in the low to mid-30s for the past -- actually all this year. So, we have not seen a big shift. The one thing I will say is this holiday calendar, having lived through it multiple times, is one that you need to have somewhat of a lead stomach for because we are shifting from -- as Michael said, where people last year shopped early because of scarcity, and they're moving back to a later purchase pattern.\n\nSo -- and we're in line with that purchase pattern right now with our trends so far this quarter. But, you know, I think that trend for this year probably should continue. The first part of next year, as Michael said, the economy is still in a lot of turmoil. You know, it will continue to be a challenging -- will be a challenging time.\n\nBut we should be able to perform well at the higher base, as Steve talked about, you know, and continued to develop the business so that we can start growth, you know, at some point in the near future.\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's really helpful. And then, maybe a follow-up for Michael. How are you thinking about working capital and free cash flow generation for the fourth quarter? You know, one would think, based on the seasonality, that cash should become a source of funds in the fourth quarter.\n\nSo, you know, how should we think about a minimum cash balance as we think more about the potential for additional share repo in fourth quarter?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nNo. Great question. I think I will have one little nitpick before I get going here. We've got a business that's been performing so well, you know, we should generate cash in every quarter.\n\nAnd that, you know, hasn't been the case, I think, for a lot of other retailers and certainly us historically. But, you know, in the third quarter, which is typically not a source of cash, it was for us, while we were able to invest in the business. Correct. Fourth quarter, we should improve on that and grow the cash balance, and then we'll have to make some decisions like we've been saying.\n\nThere's no change to our approach. We generated enough cash, we can fund our initiatives, and we can take a portfolio approach to capital allocation, either through repurchases or potentially been retiring some debt, if we thought that was the right thing to do given where interest rates are headed.\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nGreat. Really helpful. Best of luck.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Kate Fitzsimons with Wells Fargo. Please proceed with your question.\n\nKate Fitzsimons -- Wells Fargo Securities -- Analyst\n\nYes. Hi. Thank you for taking my question. I wanted to switch gears to margins.\n\nYou raised the full year gross margin outlook. Just as we're thinking about puts and takes on the gross margin into next year, how should we think about some of the drivers between mix, supply chain, promotions? And then, Michael, just any updated views on maybe the longer-term gross margin opportunity versus that 32.5% to 33% range you've spoken to previously, just given how well the business has held on to some of its margin gains? Thank you.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nI'll take the first part, and then I'm sure Mike will jump in on some later parts. But so far, we're pretty pleased with our gross margin performance and our ability to hold on to the higher margins we generated over the past couple of years. We attribute a lot of that to just being better planners and managers of the business. That being said, you know, we do expect the margin will decline a little bit versus last year in Q4, which is accounted for in our guidance.\n\nThat's based off what we think it's going to be a more promotional holiday. We're already seeing it in a more promotional holiday, so we baked that in. But just to be clear, we're still going to hold on to the vast majority of those gains. And we think those gains are coming from a couple of different places.\n\nWe already mentioned the planning and allocation disciplines that we put in place in terms of better management of how we flow goods and allocate goods. We don't have the inventory overhang that I think a lot of other people out there have. So, that certainly is not going to be, you know, a pressure for us or a headwind for us. You know, one of the things that's happened to us during the pandemic was the hard goods business, which has a lower margin profile had become a bigger percent of total.\n\nAnd as that mix starts to normalize more back to a 50-50 soft goods to hard goods, that's definitely a tailwind for us as well. So, those are all probably the tailwinds. Certainly, the supply chain is getting better, but there's still some disruption in that. And I think that's something that could be a headwind for us.\n\nI think, you know, as business seems to be moving back to more kind of the cadence or trend pre-pandemic, I think we're going to see more promotions creeping in the marketplace. So, those would certainly be a little bit of a headwind. But we feel really good about our ability to navigate through those, and then we're going to hold on the vast majority of the margin gains we've picked up over the past couple of years.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nOK. First, welcome back. Good to have you on the call again. I want to tell you that look, Steve answered that one pretty well.\n\nI don't have a lot to add. Merchandise margins have been the hero as we continue to harvest the fruit from the initiatives and the groundwork we laid many, many years ago, and continue to do that. One thing that I would say, shrink has been a little higher than planned. There has been a lot of organized crime in retail.\n\nWe're experiencing that along with everybody else. We're working with our law enforcement partners who are great partners in part because they really like the stuff that we sell, and they love to shop in our stores. So, we think that we have an opportunity to improve that going forward. As far as the long-term algorithm, I'd stick with what you have and largely because we want to preserve flexibility if we need to become more promotional.\n\nWe want to preserve that flexibility.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYeah. Two adds, Kate. One is we want to continue our value proposition, and so we do not want to forfeit growth for margins. So, we will work to maintain that value proposition that we've worked very hard to get and the customer views us within the market.\n\nThe other thing, I think, that is different when we talk about promotions, I think one, we talk about seeing more, but it is more rational and thoughtful for a couple of reasons. One, the people are in a better position and can afford to be more thoughtful about the promotions they had and had the ones back in that make the most sense to drive traffic. And two, the vendors -- what the vendors have done -- some of the key vendors have done over the past several years -- and it's not just in apparel, but it's in other places and how they've cut back on their distribution. And our positioning as a favored retailer for them have helped to maintain some of the sensibility in the market and also support some of the margin improvements that we've seen in addition to the operational and process improvements that we put in place.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nOne more thing to add, just as a reminder, we are just embarking on a multiyear initiative to improve the efficiency and the effectiveness of our supply chain. And that work is really getting underway. And so, I think from a market perspective, hopefully, the environment normalizes from a logistics and a supply chain perspective. But we have things to work on and our into that should provide a margin benefit in the out years.\n\nBut I think for now, you've got a good number to work with that we've provided in the past, and I think that's a good one to run with.\n\nKate Fitzsimons -- Wells Fargo Securities -- Analyst\n\nGreat. I'll let others kick it up in the queue, but happy holidays, guys.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYou, too.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nOK. Thanks. You too, Kate.\n\nOperator\n\nOur next question comes from the line of Robbie Ohmes with Bank of America. Please proceed with your question.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning. Just a couple of quick follow-ups. Just on the guidance, how are you thinking about transaction expectations in the fourth quarter? Kind of similar to the third quarter? And is, you know, some of the confidence as you just -- with hunting, not being less of a drag in the third quarter, you know, helps the visibility in the fourth quarter? And the kind of follow-up question, which you've somewhat answered, but just the -- you guys see promotions potentially coming back on and transactions have been down.\n\nYou know, how did that -- that, usually, is a hard environment to get gross margins, you know, up or flat versus all-time highs. You know, what's the risk of promotions come back on and you're not able to maintain the sort of gross margin expectations you guys have put out there?\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYeah, I'll start and then let Steve pick up on the second part. Our transactions have been off. And the part of it is what's happening in the consumer environment. But part of it is also -- and it's actually a significant part of actions that we took last year.\n\nAs we said, there were limitations on ammunition. And while we sold a lot, we had limits on how many people could buy, and we had a lot of customers coming in multiple times in a day and, you know, literally lining up coming in every day. And we aren't seeing that now because we've taken those limits off. And that makes the transaction number a little bit more difficult to read year to year because we had created some artificial high transaction levels because of those limits that we've put on, and we no longer have those.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nYeah. And to the point on promotions, you know, I think Ken was alluding to it. When you go back and you look at some of the promotions that we used to run pre the current management team being here, I mean, they were, in some cases, irrational promotions. And I think you've heard us talk about those over time where we'd be selling something like a big bulky item, like a trampoline close to cost, and then on top of that providing free shipping.\n\nAnd they just -- they didn't make a ton of sense. And so, I think one of the things that's happened over the past couple of years is -- not only for us but for the whole industry is the promotional landscape has kind of been benign. It's allowed us to kind of clear the decks, and it's really allowed us to be thoughtful about where and when and how we're layering in those promotions. You also have, you know, a lot of the vendors out there having much better control over their maps.\n\nSo, I think that kind of keeps them in check. So, I think it's the combination of us having rational promotions that we're not up against that we don't feel compelled to anniversary that drove top line but maybe not bottom line, coupled with a, you know, better controlled distribution out there. I think those two things allow us to know that we're going to see more promotions certainly this year than we did last year but that we're still going to be able to hold on a majority of the margin gains.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nAnd just a quick follow-up. In the average transaction size, are you seeing, you know, more items, you know, per basket? Or are you seeing, you know, bigger ticket purchases. And is there any -- have the vendors raised price on somewhat like items? So you're seeing, you know, inflation in certain categories like fleece or things like that that are supporting same-store sales?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nRobbie, I would just say that we generally don't give the basket detail. I'll give you a little bit of color. Last year, if you remember, we were up against a tremendous surge in demand for ammunition, and that drove a lot of units. And so, there's a little bit of noise kind of internally, but that will provide you a little color about our basket.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nAnd we are seeing some AUR increases just based on cost increases that we've seen out there.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Terrific. Thanks so much.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThanks, Robbie.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Anthony Chukumba with Loop Capital Markets. Please proceed with your question.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGood morning. Thank you so much for taking my question. I'm glad to hear my equipment is working. I try to get into an earlier call.\n\nThey didn't take my question. So, I thought maybe it was a problem on my end. Anyway, neither here nor there. Yeah, so, I had a question actually about your new store openings.\n\nI know it's fairly early, but these other first new stores you've opened in quite some time. And so just wanted to see if you -- you know, any early reads on how those stores are performing relative to your expectations? Thanks.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nFirst off, Anthony, if you couldn't ask a question on the last call, we'll let you ask us two. So, you can ask us two. We're happy to take it.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nThank you.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYeah, new stores. I would say this year was really about capability building in test and learn. And so, we have all nine stores opened this year. We tried different formats, different markets.\n\nWe did urban stores, we did takeover spaces. We did traditional build-to-suits, and we tested a lot, and we learned a lot, and we build the capability. All nine stores are open. We're happy with the performance as a whole overall.\n\nThere's always things when you're testing and learning that you want to do different and do better, and we'll apply those learnings next year. So, we opened four new stores in Q3, two more in Q4. We haven't announced our targets next year, but it will be more than we did this year.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nOne thing, Anthony, I think, that's important, as Michael said, we are pleased with the overall performance, and we have some really good winners. We have, you know, a store that we would like for it to be better, and it's a good learning store. But one of the things that's actually, you know, really pleasing for us is some of the new markets that we've entered, both that were adjacent or completely new markets, we've seen some very good results there. So, we're getting some -- we're pleased with our ability to enter places where people might not be as familiar with us.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nThe last store on the last two we just opened in Barboursville, West Virginia, not only a new market. It's a new state. And I got to tell you, a line around the block in the snow. I'm sure if you followed us a little bit on social media, you've seen some of that.\n\nThat is exciting and shows the potential of not only, you know, being able to ability to grow in that market. But in that region, where there's a lot of white space for Mid-Atlantic.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGot it. Very helpful. And then, once again, thanks for allowing me to ask a second question to make up for the fact that I wasn't able to ask any question on the earlier call. So, yeah, just a real quick one.\n\nYou know, you mentioned supply chain and some of the improvements you're going to be making there. Michael, if I recall correctly, when we had last spoken, you said that you thought that the warehouse management system would be installed in 2023. I just wanted to confirm if that was still the case or what your thought was there.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nThat's going to be a multiyear. But yes, I think toward the end of 2023, we'll start to bring that online.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nOK. Very helpful. Thanks, and keep up the good -- go ahead, sorry.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nAnd just to be clear, that's -- we will phase that in across all of our DCs. So, we're not doing anything all at once. So -- but we'll start at the end of '23 and then roll it out to other distribution facilities.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGot it. Thanks so much. Keep up the good work, guys.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThank you. Thank you, Anthony.\n\nOperator\n\nOur next question comes from the line of Brian Nagel with Oppenheimer. Please proceed with your question.\n\nAndrew Chasanoff -- Oppenheimer and Company -- Analyst\n\nHi. This is Andrew Chasanoff on for Brian Nagel. I just have two quick questions. One is shorter term in nature and the other one is longer.\n\nIn the near term, can you call out any specific trends in the Black Friday, Cyber Monday specifically, how you describe the brick-and-mortar traffic trends versus pre-COVID? And then, longer term in nature, as the pandemic dynamic is decided, has your thinking toward a longer-term growth algo of ASO changed at all? Thank you.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nI'll take the first part. I'll give the second part to Michael. You know, one of the things we've seen this Christmas, candidly, that started in early November and blend in the Black Friday week is kind of a return to pre-pandemic shopping patterns. So, what is -- what we mean by that is, if you go back, you know, pre-pandemic, customers really waited until Black Friday week to kick off.\n\nThe last two years, we've seen pull-forward of demand early in the month, particularly in some of the bigger ticket categories where there was scarcity of supply. And so, we've seen that kind of revert back this year. So, softer demand for big ticket early in the month. Then, when we got into Black Friday week, another thing we've seen is people, over the past couple of years, were really trying to avoid large crowds on Black Friday itself.\n\nThey tended to shop earlier in the week. And then, we saw a little bit softer trend over the weekend. And that's reverted back to where the weekend was much more important this year. And as Ken mentioned already, it was the largest day in our company's history from a sales perspective.\n\nSo, I would say the biggest thing we've seen is kind of reversion early on back to more of the soft goods business. We've seen it shift back to their shopping on the big days, more pre-pandemic than where they have been. But we also believe that that's going to drive the big ticket sales closer in, which we've seen pre-pandemic as well.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nOne of the other things we did see, though, was the customer was willing for the right item to buy the big ticket. So, we -- this is not -- it was not -- Black Friday was not just driven by apparel. We did very well in that. But we also saw a number of our big ticket items, some of the categories that Michael called out, like outdoor cooking, sports, and the like, also performed very well during the event.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nWhere we had great value.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nWhere we had good value.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nWith respect to the long-term growth algorithm, no changes there. I mean we're still planning low single-digit comp growth overall throughout the long-range plan. Total sales growth of high single digits, EBITDA growth at high single digits, and net income growth in the high teens. We will do that for the addition of 80 to 100 new stores investing in our dot-com business, which is out on a real growth run here, continuing to grow at double digits quarter over quarter and improving our existing operations.\n\nAndrew Chasanoff -- Oppenheimer and Company -- Analyst\n\nGreat. Thank you so much.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThanks, Andrew.\n\nOperator\n\nOur last question comes from the line of John Zolidis with Quo Vadis. Please proceed with your question.\n\nJohn Zolidis -- Quo Vadis -- Analyst\n\nHi, guys.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nHey, John.\n\nJohn Zolidis -- Quo Vadis -- Analyst\n\nThanks for taking my question. I have two questions, but I'll just stick with one here since it's the last one. You mentioned that you had --\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYou can ask two.\n\nJohn Zolidis -- Quo Vadis -- Analyst\n\nOK. Thank you. All right. So, here's my two questions then.\n\nFirst question is on average unit sales. So, for the full year, we're looking at just under, I believe, $25 million per average store. And that's down about from a little over $26 million in the previous year. And so, the first question is, for the new units that are coming on, what do you expect those to annualize in their first year?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nJohn, I'm sorry, I missed the last piece of your question.\n\nJohn Zolidis -- Quo Vadis -- Analyst\n\nSo, the newer stores that you're opening up. We've got nine open year to date, as you've mentioned. They haven't been open a full year yet. But as we think about the sales contribution from the new stores, what should they be annualizing at in their first year?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nWe underwrite them on average of around 16 million at year one sales -- end of year 1 sales. We do expect them to be EBITDA-accretive after year one. Again, some of these just opened, but the first four, collectively, as a whole, were more accretive to earnings, even, you know, just a few months into the year from their opening.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nThen, obviously, they ramp up on [Inaudible] basis.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYes. They ramp. Yup.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYes, significantly higher than a typical store.\n\nJohn Zolidis -- Quo Vadis -- Analyst\n\nOK. Thanks. We will monitor that. And then, the second question relates to something you talked about with pandemic winner categories.\n\nAnd you mentioned that a number of these, even though they might be down a little bit, are still dramatically higher than pre-COVID levels and in particular, for example, ammunition still up triple digits. So, I think a more cautious view might suggest, hey, these are still performing OK, but what we really just haven't seen the reversion or in the demand for these categories yet. And as we go into next year and potentially less favorable consumer environment, that's where you're going to see this kind of continued downward pressure. And so, obviously, we can't predict what's going to happen.\n\nBut my question is, how are you positioned -- how are you able to manage inventory if that were to occur?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nWell, I think we've demonstrated that over the past several years, to be honest with you. You know, we certainly build contingency plans into our buying process. We have trigger dates that we activate depending upon where we see demand happening. We have great partnerships with our vendor partners.\n\nAnd I think on both sides of it as inventory was scarce, and we had to chase it. I think we definitely outperformed a lot of our competitors in terms of getting supply of goods, which I think was reflected in sales trend that we drove in '20 and '21. And I think this year, as the supply chain has gotten a lot better, and actually, a lot of them just caught up, some people have been caught the other way with inventory ballooning for them. And I don't think we've seen that happen.\n\nSo, I think we've got a very nimble team, who's got good partnerships and relationships, a strong planning and allocation basis, strong open-to-buy management. And that's really allowed us to manage on both sides of it. So, I don't see that changing if we see a slowdown next year. But what I would say is, you know, one of the things that gives us confidence, and I think Michael hit on this, is, you know, these search categories, we track them.\n\nYou know, you mentioned several of them, we talked about animal being one, or fitness being another, you know, or cooking or things like that. You know, they're all stabilizing at these higher levels. In a lot of cases, higher than the 30% trend that the company performed at. And we're seeing the volumes stabilize at those levels.\n\nSo, that's another thing we're looking at, not just the trend versus last year, but the average weekly volume, the average monthly volume. And so that's giving us confidence that this is kind of the new baseline that we're building off of because they've been maintaining at those consistent levels for multiple quarters in a row.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nTwo other things that I think are very important about this category and the inventory. First, as Steve mentioned, I think we have absolutely demonstrated we can manage inventory as well, if not better than most anybody in the space. But the categories where, you know, if you take a bearish view, and you predict a demand drop-off, the inventory doesn't go bad. It's not seasonal in nature.\n\nIt doesn't become toxic like seasonal apparel inventory does. Secondly, in these categories, while if you believe they're going to be demand=challenged, they shouldn't be share-challenged because a lot of folks in this space have walked away for it, and they don't support it. Like, they used to. And so, we should continue to take share even if the category becomes demand-challenged.\n\nAnd again, the inventory will remain healthy because it doesn't -- it's not subject to fashion or seasonality or those types of things.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYes. My line is they're not bananas. But one of the key things here, John -- or two key things. One is what Steve mentioned that these -- the team has demonstrated the ability in multiple scenarios to manage the inventory, not put us in a position.\n\nWe haven't announced as other retailers have that we've got an inventory problem, and we're having to take excess markdowns. We are managing carefully where we are, both on the up and downside. And the second thing is we've also demonstrated that we are able to maintain at those higher levels. And one of the comments that Michael just made was about -- even some of those categories that are declining, our share continues to improve in many of those categories.\n\nSo, we're able to, while in a declining market or in a declining situation, pick up share and hold at that higher level, either because competition has pulled back or the value and assortment that we've offered. Our team has done an excellent job over the past couple of years, putting us in a good place with our good, better, best strong brand assortments in multiple categories. And so that is one of the things that gives us confidence as we go forward that, yes, we're in tough times; yes, you know, the first part of next year is going to be, you know, a challenging time for not just retail, but the entire economy. But we will be positioned for growth both with our existing stores and online, but also as we enter new markets.\n\nSo, we feel very confident about our position going forward, and we're excited about the future for Academy.\n\nJohn Zolidis -- Quo Vadis -- Analyst\n\nThanks very much, and happy holidays to everyone and your families.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThank you, John.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYou, too. Thank you.\n\nJohn Zolidis -- Quo Vadis -- Analyst\n\nThank you.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nOK. That was our last question. We're ending right on time, and I appreciate everybody's participation on the call. Thank you very much.\n\nAppreciate everybody's support of the company. I want to thank all of our team members, but also our investors and the people who are interested in Academy. We feel, as I said, we've got a great future. I want to wish everybody the happiest of holidays and a terrific, terrific new year.\n\nSo, happy holidays, and thank you. Goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Hodges -- Vice President, Investor Relations\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nJohn Heinbockel -- Guggenheim Securities -- Analyst\n\nDan Imbro -- Stephens Inc. -- Analyst\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nKate Fitzsimons -- Wells Fargo Securities -- Analyst\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nAndrew Chasanoff -- Oppenheimer and Company -- Analyst\n\nJohn Zolidis -- Quo Vadis -- Analyst\n\nMore ASO analysis\n\nAll earnings call transcripts"
}