{
  "companyName": "Autodesk",
  "companyTicker": "ADSK",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/23/autodesk-adsk-q3-2023-earnings-call-transcript/",
  "content": "Autodesk (ADSK -0.66%)\nQ3 2023 Earnings Call\nNov 22, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the Autodesk Q3 fiscal '23 earnings conference call. At this time all participants are in a listen-only mode. After the speakers' presentations, there will be a question-and-answer session. [Operator instructions] As a reminder, today's conference call is being recorded.\n\nI would now turn the conference over to your host Mr. Simon Mays-Smith, vice president of investor relations. Please go ahead.\n\nSimon Mays-Smith -- Vice President, Investor Relations\n\nThanks, operator, and good afternoon. Thank you for joining our conference call to discuss the third quarter results of our fiscal '23. On the line with me are Andrew Anagnost, our CEO; and Debbie Clifford, our CFO. Today's conference call is being broadcast live via webcast.\n\nIn addition, a replay of the call will be available at autodesk.com/investor. You can find the earnings press release, slide presentation, and transcript of today's opening commentary on our investor relations website following this call. During this call, we may make forward-looking statements about our outlook, future results and related assumptions, acquisitions, products, and product capabilities and strategies. These statements reflect our best judgment based on currently known factors.\n\nActual events or results could differ materially. Please refer to our SEC filings including our most recent Form 10-Q and the Form 8-K filed with today's press release for important risk factors and other factors that may cause our actual results to differ from those in our forward-looking statements. Forward-looking statements during the call are being made as of today. If this call is replayed or reviewed after today, the information presented during the call may not contain current or accurate information.\n\nAutodesk disclaims any obligation to update or revise any forward-looking statements. During the call, we will quote several numerical growth changes as we discuss our financial performance. Unless otherwise noted, each such reference represents a year-on-year comparison. All non-GAAP numbers referenced in today's call are reconciled in our press release, or Excel financials, and other supplemental materials available on our investor relations website.\n\nAnd now, I'll turn the call over to Andrew.\n\nAndrew Anagnost -- Chief Executive Officer\n\nThank you, Simon, and welcome, everyone, to the call. We again reported record third quarter revenue, non-GAAP operating margin, and free cash flow. Encouragingly, the business is performing as we'd expect given secular growth tailwinds and macroeconomic, geopolitical policy, and COVID-19-related headwinds. Subscription renewal rates remain resilient.\n\nOur competitive performance remains strong. Outside of Russia and China, new business growth slightly decelerated in the quarter, most notably in Europe, but overall growth remains good. And we see less demand for multiyear upfront and more demand for annual contracts than we expected. We're hopeful this is a positive signal for our transition next year to annual billings for multiyear contracts.\n\nOverall, our leading indicators are consistent with these trends. Channel partners remain optimistic, but with hints of caution. Usage rates continue to grow modestly in the U.S. and APAC, excluding China, but are flat in Europe, excluding Russia.\n\nAnd bid activity on BuildingConnected remains robust as the industry continues to work through its backlog. We are reinforcing the secular tailwinds to our business by accelerating the convergence of workflows within and between the industries we serve, creating broader and deeper partnerships with existing customers, and bringing new customers into our ecosystem. Our strategy is underpinned by disciplined and focused investments through the economic cycle, which enables Autodesk to remain well-invested to realize the significant benefits of its strategy while mitigating the risk of having to make expensive catch-up investments later. In September, we hosted more than 10,000 customers and partners at Autodesk University.\n\nThere was incredible energy, excitement, and optimism for being together in person for the first time in three years. There was also palpable momentum behind the digital transformation of the industries we serve. At AU, we announced Fusion, Forma, and Flow, our three industry clouds, which will connect data, teams, and workflows in the cloud on our trusted platform. By increasing our engineering velocity, moving data from files to the cloud, and expanding our third-party ecosystem, they will enable Autodesk to further increase customer value by delivering even greater efficiency and sustainability.\n\nI will now turn the call over to Debbie to take you through our third quarter financial performance and guidance for the fourth quarter and full fiscal year. I'll then come back to provide an update on our strategic growth initiatives. \n\nDebbie Clifford -- Chief Financial Officer\n\nThanks, Andrew. In a more challenging macroeconomic environment, Autodesk performed in line with our expectations in the third quarter, excluding the impact of in-quarter currency movements on revenue. Resilient subscription renewal rates, healthy new business growth, and a strong competitive performance were partly offset by geopolitical macroeconomic policy, and COVID-19-related headwinds, foreign exchange movements, and less demand for multiyear upfront and more demand for annual contracts than we expected. Total revenue grew 14% and 15% at constant exchange rates.\n\nBy product, AutoCAD and AutoCAD LT revenue grew 10%. AEC and manufacturing revenue both grew 13% and M&E revenue grew 24%, partly driven by upfront revenue growth. By region, revenue grew 17% in the Americas, 10% in EMEA, and 14% in APAC. At constant exchange rates, EMEA and APAC grew 12% and 18%, respectively.\n\nBy channel, direct revenue increased 14%, representing 35% of total revenue, while indirect revenue grew 13%. Our product subscription renewal rates remain strong, and our net revenue retention rate was comfortably within our 100% to 110% target range. Billings increased 16% to $1.4 billion, reflecting continued solid underlying demand, partly offset by foreign exchange movements and a shift in mix from multiyear upfront to annual contracts versus expectations. Total deferred revenue grew 13% to $3.8 billion.\n\nTotal RPO of $4.7 billion and current RPO of $3.1 billion grew 11% and 9%, respectively. At constant exchange rates, RPO and current RPO grew approximately 15% and 13%, respectively. Turning to the P&L. Non-GAAP gross margin remained broadly level at 93%, while non-GAAP operating margin increased by 4 percentage points to approximately 36%, reflecting strong revenue growth and ongoing cost discipline.\n\nGAAP operating margin increased by 3 percentage points to approximately 20%. We delivered robust third quarter free cash flow of $460 million, up 79% year over year reflecting strong revenue growth, margin improvement, and a larger multiyear upfront billing cohort. Turning to capital allocation. We continue to actively manage capital within our framework.\n\nAs Andrew said, our organic and inorganic investments will remain disciplined and focused through the economic cycle. We will continue to offset dilution from our stock-based compensation program and to accelerate repurchases opportunistically when it makes sense to do so. Year to date, we purchased 4.4 million shares for $873 million at an average price of approximately $200 per share, which compared to last year contributed to a reduction in our diluted weighted average shares outstanding by approximately 5 million to 217 million shares. We also announced today that the board has authorized a further $5 billion for share repurchases.\n\nAnd in December, we plan to retire a $350 million bond when it comes due. Recall that we effectively refinanced this bond last October at historically low rates when we issued our first sustainability bond. And related to that new sustainability bond, we published our first sustainability bond impact report about a month ago, which updates our progress. You can find the report on our investor relations website.\n\nNow let me finish with guidance. Andrew gave you a readout on the business and our markets at the beginning of the call. Our renewal business continues to be a highlight, reflecting the ongoing importance of our software in helping our customers achieve their goals. New business growth continues to be relatively stronger in North America with growth in EMEA and APAC outside of Russia and China, slightly decelerating, but overall growth remains good.\n\nAnd we've seen less demand for multiyear upfront and more demand for annual contracts than we expected. As we look ahead and as we've done in the past, our Q4 and fiscal '23 guidance assumes that market conditions remain consistent with what we saw as we exited Q3. The strengthening of the U.S. dollar during the quarter generated slight incremental FX headwinds, reducing full year billings and revenue by approximately $10 million and $5 million, respectively, for the remainder of fiscal '23.\n\nBringing these factors together, the overall headline is that our fiscal '23 revenue, margin, and earnings per share guidance remained close to the previous midpoint at constant exchange rates and comfortably within our previous guidance ranges. Our lower fiscal '23 billings and free cash flow guidance primarily reflects less demand for multiyear upfront and more demand for annual contracts than we expected. We're narrowing the fiscal '23 revenue range to be between $4.99 billion and $5.005 billion. We continue to expect non-GAAP operating margin to be approximately 36%.\n\nAnd we expect free cash flow to be between $1.9 billion and $1.98 billion. The slide deck and updated Excel financials on our website have more details on modeling assumptions for the full year of fiscal '23. The challenges our customers face continue to evolve that reinforce the need for digital transformation, which gives us confidence in our long-term growth potential. We continue to target double-digit revenue growth, non-GAAP operating margins in the 38% to 40% range, and double-digit free cash flow growth on a compound annual basis.\n\nThese metrics are intended to provide a floor to our long-term revenue growth ambitions and a ceiling to our spend growth expectations. Andrew, back to you.\n\nAndrew Anagnost -- Chief Executive Officer\n\nThank you, Debbie. Our strategy is to transform the industries we serve with end-to-end cloud-based solutions that drive efficiency and sustainability for our customers. Fusion, Forma, and Flow connect data, teams, and workflows in the cloud on our trusted platform, making Autodesk rapidly scalable and extensible into adjacent verticals from architectural and engineering to construction and operations, from product engineering to product data management and product manufacturing. Our platform is also scalable and extensible between verticals with industrialized construction and into new workflows like XR.\n\nBy accelerating the convergence of workflows within and between the industries we serve, we are also creating broader and deeper partnerships with existing customers and bringing new customers into our ecosystem. In AEC, our customers continue to digitally transform their workflows to win new business and become more efficient and sustainable. For example, to support the city of Chongqing smart city ambitions, the Chongqing Architectural Design Institute, which operates across architecture, municipal engineering, and city planning, is standardizing on AEC collections and developing features to Revit APIs, which automate modeling, drawings, and specification inspection. These will leverage the Design Institute's expertise in BIM and enable faster and higher quality design, reduce error, and waste during construction and build the digital twins for post-construction operation and maintenance.\n\nIn a challenging market environment, the design institute has been able to win new business and capture new market through digital transformation. In construction, we are seeking to eliminate waste at the source rather than simply automating the process around it. By seamlessly connecting construction data and workflows both upstream with preconstruction and design and downstream to hand over, operations and maintenance bases to our digital twin, we are enabling a more connected and sustainable way of building. For example, after a leading mechanical contractor in the United States purchased a competitor's construction management product a few years ago, communication and workflows between the design and field teams were disconnected, resulting in data fragmentation, less insight, more complicated reporting, and ultimately low adoption of the process.\n\nTo resolve these issues, it chose to consolidate all of its design to build workload on the integrated Autodesk platform, turning to Autodesk Build to streamline handoffs between detailing, the fab shop, and the field. Our momentum in construction continues to grow. Across construction, we added almost 1,000 new logos with Autodesk Build's monthly active users growing more than 60% quarter over quarter and becoming Autodesk's largest construction product. In infrastructure, we see greater appetite from owners to accelerate their digital transformation to connect workflows from design to make on the Autodesk platform.\n\nFor example, to transform the speed, efficiency, and sustainability of its network, one of the leading electricity network operators in Europe is accelerating its transformation from 2D to BIM and digital twins. In the third quarter, it signed its first EBA with Autodesk, adding Revit and Docs to enable it to upgrade the capacity of its substations and incorporate renewable power generation rapidly and safely. To accelerate maintenance workflows and reduce costs, the customer is in-sourcing the production of maintenance parts and using Fusion 360 as a platform for 3D printing. Turning to manufacturing.\n\nWe've sustained good momentum in our manufacturing portfolio this quarter as we connected more workflows from design through to the shop floor, developed more on-ramps to our manufacturing platform, and delivered new powerful tools and functionality to Fusion 360 extension. We continue to drive efficiency and sustainability for our customers and provide further resilience and competitiveness in uncertain times. For example, De Nora is an Italian multinational company specializing in electrochemistry and is a leader in sustainable technologies in the industrial green hydrogen production chain. It has been a longtime user of AutoCAD and Revit.\n\nOver the last few years, it accelerated its cloud strategy by replacing a competitor's on-premise PLM solution with an integrated Vault and Fusion 360-managed solutions and improve the security of its data, enables seamless collaboration between product design and manufacturing and more easily onboard and integrate acquisitions. In Q3, it took another step in its digital transformation by firstly transitioning to named users and adding premium for better usage reporting, insights, and single sign-on security. And secondly, by adding Flex to optimize consumption for its occasional users. Heineken is on a mission to become the best-connected brewer as part of its evergreen strategy and is undergoing a digital transformation to ensure is prepared for the unforeseen challenges in an ever-changing world.\n\nTo help, Autodesk has been supporting Heineken's 3D printing initiative with an expanded adoption of Fusion 360 across a number of breweries. By designing and manufacturing their own equipment parts in-house, Heineken has been able to see a reduction in the replacement times of a number of parts from over six weeks to just four hours, significantly reducing downtime and lessening the carbon impact of shipping new parts when necessary. Scanship AS, a Vow Group company is a great example of how our customers are using our Fusion platform to generate sustainable outcomes efficiently and transparently for customers. It has developed technology that processes waste and purified wastewater providing valuable, sustainable, and circular resources and clean energy to a wide range of customers.\n\nBy consolidating on Fusion 360 managed with Upchain, Scanship AS will be able to connect data and workflows in the cloud to manage processes and collaborate more easily and efficiently, while also gaining greater transparency on its supply chain to deliver decarbonized products to its customers. Fusion 360's commercial subscribers grew steadily, ending the quarter with 211,000 subscribers, with demand for extensions continuing to grow at an exceptional pace. Outside of commercial use, a rapidly growing ecosystem of students and hobbyists learning next-generation technology and workflows will take those skills with them into the workforce. We'd like to congratulate students from over 57 countries who recently competed in the finals of the WorldSkills competition, aptly referred to as the Olympics for vocational skills.\n\nStudents used the latest workflows and technologies from Fusion 360 and Autodesk Construction Cloud to compete in vocational disciplines such as mechanical engineering, additive manufacturing, and digital construction. Sit Shun Le from Singapore, who won the gold medal for additive manufacturing, used Fusion 360 to find the optimum structure and then minimize the amount of materials used through additive manufacturing. All participants were able to hone their skills using next-generation technology. I'm inspired by their ingenuity and optimistic about the innovation they will bring to the workforce of the future.\n\nAnd finally, we continue to work with customers to provide access to the most current and secure software through our license compliance initiatives. For example, we worked collaboratively with a large multinational manufacturing company seeking to adhere to the same software standards and ensure access to the latest and safest software for all its employees across the globe. We helped customers conduct a self-audit that identifies gaps in its operations in China and then crafted and optimized a bespoke subscription plan. As a result, we agreed to approximately 5 million contracts in Q3, our largest-ever license compliance agreement.\n\nDuring the quarter, we closed eight deals of $500,000 and four deals over $1 million. To close, subscription renewal rates and net revenue retention continue to compound. New business growth remains good, and our competitive performance remains strong. The business is performing as we'd expect given secular growth tailwinds and macroeconomic geopolitical policy and COVID-19 headwind.\n\nOur capital allocation will remain disciplined and focused through the cycle with organic investment and acquisitions accelerating our growth potential and competitive intensity and share buyback offsetting dilution. The breadth and depth of the market opportunity ahead of us is substantial, and our platform investments will expand that opportunity and realization of it. Operator, we would now like to open the call for questions. \n\nOperator\n\nThank you. [Operator instructions] One moment, please. Our first question comes from Saket Kalia of Barclays. Your line is open.\n\nSaket Kalia -- Barclays -- Analyst\n\nOK, great. Hey, Andrew. Hey, Debbie. Thanks for taking my questions here.\n\nDebbie, maybe we'll start with you. I don't want to put you on the spot here. But I guess just given the evolving macro and some of the other factors that we spoke about, is there anything that you want us to know high level on kind of how you're thinking about fiscal '24 as we maybe fine-tune our models looking out?\n\nDebbie Clifford -- Chief Financial Officer\n\nThanks, Saket. Hope you're doing great. So, we'll give formal guidance for fiscal '24 in February when we report on next quarter's results. But here are some things to think about.\n\nFirst, on revenue. At this point, we expect some exogenous headwinds out of the gate. We'll have about a 5-point-or-so incremental FX headwind. That's because of the continued strengthening of the U.S.\n\ndollar and then another point of incremental headwind from exiting Russia. That's going to make it tough for us to grow revenue beyond double digits. On margin, the revenue headwind creates margin growth headwinds, which likely means limited progress on reported margins in fiscal '24. Put another way, margins will look better at constant exchange rates.\n\nAnd then on free cash flow, FactSet consensus right now is a range of $1.2 billion to $1.7 billion. There's a couple of important things to consider. The first is the rate at which our customers transition to annual billings. And the second is the overall macroeconomic environment.\n\nWe continue to be focused on executing on that transition as fast as possible because while the change is good for us, and it's good for our customers, from a financial standpoint, we really want the noise behind us. So, remember, the faster that we move the multiyear-based annual billings, the greater the free cash flow headwind we'll see in fiscal '24. On macro, we will, as usual, give our fiscal '24 guidance based on the macro conditions that we see as we exit fiscal '23.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. Got it. That makes a lot of sense. Andrew, maybe for my follow-up for you, a lot of helpful commentary just on retention rates and sort of the pace of new business.\n\nI was wondering if you could just go one level deeper. And maybe we could just talk about how demand fared through the quarter? Most of the business, as I think we all know, is pretty high velocity. But I'm curious if you saw changing trends in pipeline or close rates or duration preferences toward the end of the quarter versus earlier. Any commentary there would be helpful.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. Look, Q3 was very much like Q2 and that the quarter was fairly consistent, right? What was different between Q3 and Q2 was the slowing down in Europe taking Russia out. And that was definitely something that was different about the quarters. But that was consistent across the entire quarter.\n\nThere was no acceleration or change of that as you proceeded across the quarter. Europe was weak throughout the quarter. As were -- some of the preferences with regards to multiyear billings, there was no kind of trend of more and more reluctance as you headed further and further down the quarter. So, it's a fairly consistent quarter with regards to all of those things and fairly consistent performance of the business across the quarter.\n\nSo, nothing that fundamentally changed in the quarter. Look, one of the things -- another thing that was different about Q3 over Q2 is that we had some currency fluctuations toward the end. And that really is probably the only thing that was different, and those currency fluctuations were responsible for the majority of the small revenue miss.\n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. Very helpful, guys. Thanks a lot for taking my questions here. \n\nOperator\n\nThank you. Our next question comes from the line of Phil Winslow of Credit Suisse. One moment, please. Our next question comes from the line of Jay Vleeschhouwer of Griffin Securities.\n\nYour line is open. \n\nJay Vleeschhouwer -- Griffin Securities -- Analyst\n\nThank you. Good evening. Andrew, for you, first, to follow up on some comments you made regarding your strategy at AU and then allow a follow-up for Debbie. So, at AU, you made some comments with regard to the various clouds that you've introduced, and you made an important distinction between the AEC cloud and the manufacturing cloud, namely that manufacturing cloud is more mature.\n\nIt's been out in the market perhaps longer. So, what is your expectation for the maturity or development of the AEC cloud to get it to where you think it needs to be so it'll be comparably mature or capable, the way the manufacturing cloud is, the way you described it at AU? And then for Debbie as a follow-up since the door was open to an FY '24 discussion, apart from everything else you're doing programmatically, could you talk about some of the things that you're going to be doing with regard to channel compensation in terms of margin structure, comping on annual versus multiyear and all those various things that you're planning to implement? And if those are going to have any effect on your margins and your cash flow?\n\nAndrew Anagnost -- Chief Executive Officer\n\nAll right, Jay. So, I'll start with regards to the Forma evolution. It's going to be kind of similar to what happened with Fusion, all right? And I'll kind of tell it this way. When we started Fusion, we actually anchored Fusion on two things.\n\nWe started Fusion upfront in the design process. You probably don't remember the early days of Fusion, Fusion was actually a conceptual design application. It was highly focused on consumer products design and upfront design processes. And we started just bolting onto it downstream processes close to the shop for manufacturing, and we started building cloud-based connections between those two and basically filling off the middle between those two bookends of manufacturing and conceptual design.\n\nThink of the evolution of format is very similar to that, right? The cloud -- the Forma cloud is going to start off focusing on the upfront conceptual phases of design, helping architects, planners, developers, all types of people that have to deal with early conceptual decisions about utilization, space utilization, aligning and distributing various aspects of development or an individual building and helping them make some better decisions far upfront in the design. But it's also going to work to integrate downstream to what we're doing in Construction Cloud. So, Construction Cloud will start getting very close to some of the early bits of what Forma does. And over time, what's going to happen is Forma and Construction Cloud, Construction Cloud representing the downstream example of manufacturing, all the bits in between are going to be filled out on the same platform, similar to the evolution that we walked through with Fusion.\n\nAnd that will basically bring the entire process to the cloud over time, but continuously adding value to what our customers are doing today throughout the entire development and evolution of that cloud.\n\nDebbie Clifford -- Chief Financial Officer\n\nAnd Jay, to your second question, channel compensation, the details, they're still in the works. But ultimately, how we think about engaging with our channel partners, engaging with our customers, how we think about the compensation programs, everything is about delivering value to our customers, driving adoption, driving customer satisfaction. So, examples of some of the things that you've seen us do historically are things like moving more front-end incentives to back-end incentives that mandate some kind of adoption metrics, things like that, again, all in service of trying to deliver value. And in terms of the impact on margins, well, we haven't guided to margins next year, we haven't guided specifically to anything next year other than some of the breadcrumbs that I just left you guys.\n\nBut I would say that as we've said before, we're committed to achieving our margin target in that 38% to 40% range in the fiscal '23 to '26 window.\n\nJay Vleeschhouwer -- Griffin Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Phil Winslow of Credit Suisse.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nHi. Thank you for taking my question. I'm not sure what happened earlier, But Andrew, a question for you, then a follow-up for Debbie. One of the questions I think is about the cyclicality of the AEC industry.\n\nAnd as you mentioned, the industry entered this year with a backlog from 2020 and frankly, even 2019. But as you pointed out, the macroeconomic environment has obviously deteriorated. So, my question is what are you seeing and hearing from this vertical, especially about sort of the go-forward pipeline, as you think about the software that Autodesk sells in the various spaces here, the design, plan, build and maintain? And then I'll just wait to ask the question to Debbie. Thanks.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. So, first off, one thing continues to pressure the industry more than the demand, and it is the labor shortages and the capacity to execute. Construction companies still have a backlog of business. They're still struggling to execute through the business that they have.\n\nI'm sure you saw that some of the leading indicators of architectural buildings have gone or entered into a shrinking territory, which means that architects are going to see some decline in some of their buildings moving forward, but they also still have a backlog of business. So, we're still seeing customers saying, look, you know what, I have a pretty big pipeline of business that I haven't executed on a queue of projects, and I still have capacity problems of getting through it. They're labor-related, they're material-related, they're execution related. So, we still have an overhang of backlog that's going to continue into next year for a lot of our customers, and that's what we're hearing from our customers.\n\nThat's not to say they're not seeing pressure, and that's not to say that they're not seeing some pressure in various segments. But they're still seeing a pretty good book of business for the next 12 to 18 months. Now as things continue, they'll start to see kind of downward pressure in some of that backlog. But right now, they're all much more concerned about their ability to execute than they are about the book of business that they're accumulating.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nAwesome. Thanks for that. And then Debbie, just a follow-up on billings. At the beginning of the year, you talked about long-term deferred revenue, I think, being in the high 20s as a percentage of toll as you exit this year.\n\nI wonder if you could give us an update on that. And then in terms of next fiscal year, as you move toward one-year billings, help us maybe quantify sort of the drawdown of long-term deferred revenue and the impact of that? Because obviously, you flagged the sell-side range right now of $1.2 billion to $1.7 billion, but obviously, that's pretty broad. So maybe some color on the impact of long-term deferred next year would be helpful, too. Thanks.\n\nDebbie Clifford -- Chief Financial Officer\n\nYeah. So, overall, our messaging in these two areas hasn't changed. So, we were talking about long-term deferred as a percent of total deferred in that 20s range, and it's going to continue to be there. The impact of our guidance adjustment for billings, a little over $100 million on a $5 billion number is not significant.\n\nAnd so, we're not anticipating that they will have a major impact on the metrics that you described. As we think about next year, I don't have anything additional to share on how to think about the decline or what have you, other than to reiterate what I said before, and that is to think about the fact that consensus that's out there right now, that range of $1.2 billion to $1.7 billion. And then to reiterate that it's really our goal to move as fast as possible because we really like to get this financial noise behind us.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nGreat. Thanks a lot.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Adam Borg of Stifel. Your line is open.\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nHey, guys, and thanks for taking the questions. First for Andrew, and then a follow-up for Debbie. So just given the macro, are you seeing any trends of customers either -- not necessarily upgrading to collections that otherwise or doing so earlier in the year? Or conversely, any trade downs from collections to point solutions or even LT? And then I have a follow-up.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. OK. Great. Adam.\n\nNo, actually, there's no change in those demand preferences with regards to collections and what people are buying. The mix of state essentially is same, the renewal rate of the states pretty steady. If anything, what we're seeing is softness in the low end of our business, which is what you would expect in a climate like this. LT growth has lowed, LT renewal rates have seen some pressure.\n\nThat's where we're seeing things. The collections percentages, the collections renewal rates, these have remained steady throughout the year and throughout the quarter.\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nAwesome. And maybe just for Debbie. So -- and I don't know if this is a harder question to answer, but if the multiyear mix came in line with your original expectations, how we think about the billings guide or even the billings results in the year, right? If it was the original mix that going into the quarter.\n\nDebbie Clifford -- Chief Financial Officer\n\nIf I understand your question correctly, if the proportion of our business that had been multiyear was in line with our expectations then we would have hit our original guide. And the fact that we're seeing some in that cohort choose to move to annual billings or annual contracts, that's making it so that we're reducing the billings and free cash flow guide. But maybe -- did I understand your question correctly?\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nSuper clear. Thanks again.\n\nDebbie Clifford -- Chief Financial Officer\n\nOK.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Stephen Tusa of J.P. Morgan.\n\nYour line is open.\n\nStephen Tusa -- J.P. Morgan -- Analyst\n\nHey, good evening, guys. How are you?\n\nAndrew Anagnost -- Chief Executive Officer\n\nGood.\n\nStephen Tusa -- J.P. Morgan -- Analyst\n\nThanks. So, I'm just -- maybe I'm an idiot, but just like reading between the lines, the faster you guys move in the transition, all else equal, the lower the free cash flow next year will be, correct? Or are there other things moving around?\n\nDebbie Clifford -- Chief Financial Officer\n\nThe faster the transition -- well, first, I want to continue to characterize that the impact of the numbers is relatively small, and it would have a minor follow-on implications to next year. But ultimately, what was built into our guidance was an expectation of a certain proportion of the business that was going to be multiyear upfront. A small portion of those customers have elected to be annual. So rather than it being a negative impact to next year, it would be a very slight positive impact to next year because we would have annual billings next year that weren't in the form of a multiyear upfront transaction this year.\n\nBut I want to continue to reiterate that the impact is relatively small. The impact to our billings guidance this year is relatively small. And if you think about the scale of the free cash flow number next year, I want to go back to that range that I was talking about that fact that consensus range of $1.2 billion to $1.7 billion. And our goal really is to move the totality of the multiyear base to annual billings as fast as possible.\n\nAnd the faster we go, the greater that headwind is going to be to free cash flow next year.\n\nStephen Tusa -- J.P. Morgan -- Analyst\n\nYeah, exactly. I was asking about '24. Basically, you're kind of telling us $1.2 billion to $1.7 billion and then you're reiterating that you're going to try and move as fast as possible. So, I will use it much more of a '24 question, which you just, I think, answered.\n\nDebbie Clifford -- Chief Financial Officer\n\nOK. Great. \n\nStephen Tusa -- J.P. Morgan -- Analyst\n\nRight. The faster you move, the more impact you have next year. \n\nDebbie Clifford -- Chief Financial Officer\n\nCorrect. Yeah. That's fair.\n\nStephen Tusa -- J.P. Morgan -- Analyst\n\nYeah. OK. That's super helpful. And any color on kind of the I guess, the drop-through on bookings -- or sorry, billings when I look at free cash flow, it's like 85% to free cash flow.\n\nThat's, I guess -- just it drops through with your gross margin. I would assume you don't really manage that on a quarterly basis. So, it makes some sense. I am I looking at that the right way? Or is there something on the cost line that moves around and mitigates that decline in billings?\n\nDebbie Clifford -- Chief Financial Officer\n\nNo. I think you're thinking about it in a directionally accurate way. The billings reduction then has a follow-on implication to the free cash flow reduction. There's nothing else going on there.\n\nStephen Tusa -- J.P. Morgan -- Analyst\n\nYeah. OK, great. Thanks a lot for the color. Really appreciate it. \n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Michael Funk of Bank of America. Your line is open.\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Thank you for the questions tonight. So, you mentioned a few times trying to incentivize the shift from multiyear to annual. So, first, what are you doing to incentivize that? I guess second, what drove the different customer behavior this quarter than expected with the shift? And I guess, third part, same question, is how quickly do you believe that you can transition your base over to annual as we think about trying to model out the free cash flow impact?\n\nDebbie Clifford -- Chief Financial Officer\n\nOK. So, let's -- taking detailed notes. So, in terms of the incentives, the incentives for both our channel partners -- well, for our channel partners are still in place. So that's part of the programmatic details that we're working through right now as we engage with our partners and we execute on the transition.\n\nRemember, a substantial majority of that transition is going to be next year in our fiscal '24, and that's why those details are still in flight. On the customer side, what they've historically had a discount of anywhere from 10% to 5% to have a multiyear contract that's invoiced and collected upfront, and that discount goes away. So, the incentive is not there necessarily in the future for those customers to be trying to pay for upfront. And we think based on the feedback that we've been getting from our customers that they want to have multiyear contracts with annual billings.\n\nIt's good for them in managing their cash flow just like it's good for us. It removes the volatility that we see. And as you can see from our guidance this quarter, the volatility that we see with those multiyear upfront contracts. In terms of what drove the behavior that we saw this past quarter, well, the end of the multiyear discount is coming at the start of next year.\n\nAnd so, we were anticipating more demand for multiyear upfront contracts. And in the end, we're seeing slightly less demand than we expected. In the current macroeconomic environment, that's not surprising. The trade-off of the discount versus the cash up front, it's not as enticing for some customers right now.\n\nWe've assumed that the behavior that we saw with respect to the materials in Q3 persists through Q4. And that's what's built into our guidance. It's consistent with our overall guidance philosophy. And we really think that it reinforces our strategy to move to annual billings.\n\nWe're hopeful that it's a positive sign for the transition next year. And then, finally, in terms of what we can do in order to drive the pace. Well, a lot of that's going to come down to our internal capabilities being available. I've mentioned before that we're investing in systems to set us up to manage all these contracts at scale, and we're on pace.\n\nWith those system changes, ultimately, it's going to come down to what's on our price list and how we work through these programmatic details with our partners. And these are all decisions that are very much under discussion right now, and that you'll hear more from us over the next couple of months.\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nOK, great. Thank you for the question.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Gal Munda of Wolfe Research. Your line is open.\n\nGal Munda -- Wolfe Research -- Analyst\n\nThanks for taking my questions. The first one is just around Fusion 360 and what you guys are seeing there. I know that when we visited Autodesk University with us, really, really good feedback. At the same time, the macro environment in manufacturing is kind of going a little bit slow.\n\nIs there anything particularly that makes you potentially see any sort of slowdown in that? Or do you think your Fusion 360 throughout the cycle is going to perform better than what you've seen in the past in your manufacturing portfolio? Thank you.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. So first off, Gal, manufacturing grew 13%, 14% on constant currency, that's still best-in-class for our space. So, we continue to believe that we're taking share in that respect. Look, you can't have a slowdown in Europe, where we're very strong, without seeing some slowdown in new user acquisition with regards to Fusion.\n\nHowever, we still continue to acquire more new users than any of our competitors in the space. So even in the face of some headwinds where we see some slowing, we're outpacing our competitors, which is kind of the important metric here in terms of the appetite and desire for Fusion. It continues to be the disruptive player, the disruptive price point, the disruptive capabilities. And our customers continue to embrace the solution even in the environment of headwinds.\n\nSo, we're not concerned because customers really need the efficiency of an end-to-end connected solution, and they really want what they get at the kind of price points that we deliver with Fusion. So, we continue to be the preferred solution. I continue that -- I expect that to continue, and I expect our relative performance to remain strong.\n\nGal Munda -- Wolfe Research -- Analyst\n\nThat's perfect. Thank you. And then just as a follow-up, thinking about the opportunity. I know when COVID happened and we talked about the noncompliant user opportunity, you kind of posed a little bit of everything, and you said we're going to come back when the environment, especially macro, is a little bit stronger.\n\nYou've done that over the last year. If I'm thinking about heading into another macro weakness, how much of an opportunity is coming from the noncompliant users? Or how much more lenient you might be maybe for a year or two until that plays out? Thank you.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. I think we've got a good rhythm in our compliance business right now. I mean I think COVID was a very unique situation where there was a sudden and precipitous impact on our customers. I think we're heading into kind of a different environment in many respect.\n\nOf course, manufacturers are seeing increased costs in terms of energy and material costs and things associated with that. So, the pressures are real. But I think the rate and pace that we're on right now with regards to license compliance makes sense. Like I've always said, this isn't something that we're going to slam the accelerator on and try to move faster.\n\nBut right now, I don't see us actually changing our pace or slowing down in any kind of way. I think we're at a nice clip right now, and I think we'll be able to maintain it through any kind of bumpiness that we might see as we head into the winter.\n\nGal Munda -- Wolfe Research -- Analyst\n\nThanks, Andrew. Appreciate that.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Matt Hedberg of RBC. Your line is open.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking my question, guys. Debbie, I wanted to come back to the cash flow breadcrumbs that you gave. Sort of -- you keep talking about the range of $1.2 billion to $1.7 billion and wanting to progress as fast as possible.\n\nI mean does that effectively imply that that low end of FactSet consensus is at play? Just sort of curious on why phrase it as a range like that. \n\nDebbie Clifford -- Chief Financial Officer\n\nYeah. Thanks, Matt. So, we're not guiding on the call today. We're trying to provide some insight into how to think about it.\n\nAnd that range is in the realm of possibility, and there are a couple of factors that we want to continue to emphasize that are going to impact that. And that is the rate at which our customers transition to annual billings and the overall macroeconomic environment. But as I said, we will provide specifics on the next earnings call.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGot it. Thanks. And maybe just one on the expense side. I appreciate the currency headwinds next year and sort of the reiteration of kind of the long-term margin framework.\n\nAre there things that you guys are doing right now from a spend perspective, whether it's hiring or just sort of like general cost consciousness as we get into more economic uncertainty?\n\nDebbie Clifford -- Chief Financial Officer\n\nYeah. Thanks. So first, I want to say that we've been focused on ensuring that we don't spend ahead of top-line growth. We've delivered considerable operating margin expansion over the last couple of years.\n\nWe've exhibited a spend discipline that we now benefit from as the market conditions continue to evolve. If we focus on the near term, we've delivered on our margin goals for the year-to-date. We're on track to do so through the end of the year. You can see that from no change in our operating margin guidance.\n\nOur hiring plans at the beginning of the year reflected really what is a solid balance between proactive investment and the discipline required to achieve our margin targets. As we look ahead to next year, we're in the planning process right now, but we're focused on ensuring that we continue this pattern of disciplined spend. We're looking to ensure that we can invest in the right areas to drive the strategy. So things like purposeful and strategic rather than broad-based investing in areas like our industry clouds and shared services, but all against a backdrop of delivering a healthy margin.\n\nI also want to say that we want to ensure that we're not too short term in our thinking. We have a strong balance sheet. We want to make sure that we strike that right balance as we navigate these macro waters. We want to capitalize on the downturn to continue to invest, but all while keeping that watchful eye on operating margin.\n\nAnd as we said before, we are committed to achieving a margin target in the 38% to 40% range in that fiscal '23 to '26 window.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThanks, Tim.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Tyler Radke of Citi. Your line is open.\n\nTyler Radke -- Citi -- Analyst\n\nThanks for taking my question. Andrew, so at AU, you obviously announced the product announcements on Forma and Flow. I'm curious how, if you could talk a little bit about the plans to accelerate the engineering velocity, specifically, is this is going to require more hiring? Or is it just kind of reprioritization of your engineers? And then just kind of comparing it to the timeline that you saw Fusion play out in that monetization cycle. Just help us understand how you're expecting kind of the product to roll out and the monetization trend over time.\n\nThanks.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. So first off, one of the things we did to just start Forma, as you might recall at the beginning of the pandemic, we acquired a Norwegian company called Spacemaker. And we've continued to invest in that team, and we'll continue to expand that team either by repurposing existing resources to work with that team or by adding additional resources to that team to make sure that we're on track. But one of the foundational investments that supports all of the things we're trying to do with our investment in data.\n\nAnd that's an ongoing investment in trying to break up Revit files and make them more accessible in the cloud as granular data. Forma and -- by nature is built net native on the cloud and it has granular data at its core. So, that's one of the kind of core vectors that we'll be doing. But we will be incrementally investing to ensure that we're heading on the right path with this solution, but we have done some of that already, and we've kind of absorbed some of those investments today.\n\nNow I think the question about the timeline is a really good one because this kind of transformations -- what we're doing with Forma is different, right? What we're doing with Revit to improve its performance and improve its capabilities based on what our customers are asking us to do is making their current tools better. But what Forma is doing, especially with the connection -- its native connections to downstream processes is different. It takes time for differences to penetrate the industry, just like differences took time with Fusion. It was -- we've been working on Fusion for over a decade, all right, roughly speaking a decade.\n\nSo, you can expect that it's going to take five years for Forma to mature and even longer for it to totally replace what our customers are doing. However, our goal is to incrementally add value to the process as time goes on, just like we did with Fusion. Fusion, we added incremental value with the connection to downstream manufacturing. In Forma, we're going to add incremental value with regards to the data platforms and the connection to the downstream construction processes.\n\nSo that's all connected, but it is going to take time similar to what we saw with Fusion.\n\nTyler Radke -- Citi -- Analyst\n\nThat's helpful. And Debbie, maybe a question for you. So just on the current RPO, it looked like that did pick up a bit quarter over quarter if you back out the currency. Can you just help us understand I guess, first, do you kind of view that as the best leading indicator given the headwinds in billings? And just remind us how you're thinking about the puts and takes on that just as you do -- renew these large EBA customers in the coming quarters.\n\nJust anything we should be mindful of there? Thank you. \n\nDebbie Clifford -- Chief Financial Officer\n\nYeah, sure. So yes, I mean, current RPO is a very important metric in monitoring our business performance. And you're right, particularly when you normalize for the currency impacts that growth was in a healthy zone. So, I want to just continue to stress that FX has been really volatile, and that's going to continue to impact the growth rate.\n\nSo, definitely look at the constant-currency growth rates over time. Also, the timing and volume of our EBAs impact the growth rate period to period. And so, sometimes what you see is that when we have large cohorts of our EBAs coming up for renewal, it tends to be back-end loaded in our fiscal years and most often in our Q4, we start to see growth impacts as the year progresses, in many cases, deceleration Q1 to Q3 that would tick back up as those cohorts for EBAs come back up for renewal. So, growth rate should tick back up over time, given consistent historical -- given patterns consistent with our historical patterns.\n\nBut again, remember the constant currency has just been a zinger that's going to impact growth rates for quite a while here. So -- but it is an important metric for us, and we monitor it closely.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Jason Celino of KeyBanc. Your line is open.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nHi. Thanks for squeezing me in. Just two quick ones. So, when we look at the fourth quarter guidance, it looks like you'll exit the year at 8% growth at the midpoint, pretty big decel from third quarter.\n\nI guess what is the FX headwind built into here? And are there any other factors that we should think about for Q4?\n\nDebbie Clifford -- Chief Financial Officer\n\nYeah. So, Jason, the biggest impact is currency. We've seen a growing currency headwind during the year, and that's gradually showing up in the growth rates as the year progresses. It's about a 3-point headwind in Q4.\n\nIt was a 1-point headwind in Q3 and was neutral in the tailwind at the beginning of the year. So, you can see that it's gradually having a significant impact on our growth rate. That's the biggest driver of the implied growth rate that you're talking about. Also, to a lesser extent -- but Andrew did mention that we saw a modest deceleration in our new business, particularly in Europe during Q3, that does have a slight follow-on impact to revenue in Q4.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nOK. Great. Thank you. And then the last multiyear appetite, it sounds like, to some extent, some of this is macro-related.\n\nI guess where do you see that dynamic most prevalent? Was it with your larger customers, your smaller customers, international versus domestic? Just trying to understand kind of the puts and takes.\n\nDebbie Clifford -- Chief Financial Officer\n\nYeah. It tends to be larger deal sizes, not surprisingly. I think that when our customers start to exhibit cash conservation behavior, that behavior does tend to be more prevalent with some of the larger deal sizes. And remember, they're still signing multiyear contracts, they're just signing multiyear contracts and asking for annual billings, which for those larger deals, we are going to accommodate while we continue to invest in the back-office infrastructure to be able to handle the totality of the multiyear base with annual billings at scale.\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nOK, perfect. Thank you.\n\nOperator\n\nThank you. One moment, please. Our next question comes from the line of Keith Weiss of Morgan Stanley. Your line is open.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nHi. Thank you so much. [Inaudible] the comments on the stable renewal rates, and I'd just like to dig into the expansion motion. And it's not like never tension stayed within the historical range.\n\nBut curious if you're seeing any changes on just the expansion behavior with the shift in macro? And should we expect a similar range into 2024? Is there any risk that we could fall outside of those ranges just given the broader macro headwinds? Thank you.\n\nAndrew Anagnost -- Chief Executive Officer\n\nSo, with regards to retention rates, look, retention rates continue to be strong and maintain steadiness. I think we're going to continue to see us steadiness in the next year. The one area where we expect to see softness with macro headwinds is at the low end of our market. So, the low end of the market is low ASPs, but high volume.\n\nSo, the retention rates can move around on a volume basis when there's headwinds like this. But generally speaking, broadly across our business, we see retention rates holding up. Our products are mission-critical to what our customers do. They need them.\n\nBut at the low end of our business, we'll probably see some headwinds there, but they won't be material to the larger business.\n\nDebbie Clifford -- Chief Financial Officer\n\nI would just add that our net revenue retention rate was comfortably within the target range of 100% to 110%. And in the short term, our expectation is that it will stay in that range. \n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nGreat. And then just following up on kind of the comments about the strong balance sheet and willing to invest. Wanted to see if you're seeing any change in behavior in the competitive landscape, especially from some companies that may not have as strong a balance sheet. So, any changes you're seeing in the behavior overall? Thank you.\n\nAndrew Anagnost -- Chief Executive Officer\n\nSo, with regard to -- I just want to give a clarification on that question. With regards to the competitive environment in what way in terms of how does it -- just give me a clarification on your question a little bit there. I didn't quite understand it.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nYeah, sure. So, you guys have a strong balance sheet kind of willing to invest in the current environment, just even though there may be some macro headwinds. But you likely have some peers out there that may not be as well funded or has strong balance sheets. So, curious if you're just seeing any sort of changes in behavior across the competitive landscape.\n\nAndrew Anagnost -- Chief Executive Officer\n\nYeah. OK. OK. Good.\n\nI just wanted to make sure that I [Inaudible] So we're in better shape than some of our competitors that are not profitable. In certain situations, people are going to be chasing, I think, long-term things that kind of boost revenue or pull revenue forward. They'll be doing customer unfriendly things to try to pull things forward. We're not in that position right now, especially in certain types of sectors.\n\nWe're maintaining customer-friendly practices, we're focusing on the long term. We're investing in the long term. And that will actually provide competitive advantage as we move out of the slowdown. It's always great to be in a position to invest during a slowdown and to not have to pull short-term levers to try to achieve profitability, maintain profitability, or get in the way of things.\n\nWe'll probably have more dry powder for inorganic activity than some of our competitors as we head through this. So, yeah, strong balance sheet actually helps us invest ahead of the curve while we go through these things. So, I'm pretty confident that we're ahead of the game in a lot of places.\n\nOperator\n\nThank you. That is all the time that we do have for question. So, I'd like to turn the call back over to Simon Mays-Smith for any closing remarks.\n\nSimon Mays-Smith -- Vice President, Investor Relations\n\nThanks, everyone, for joining us. I hope the call was useful. For those of you that celebrated happy Thanksgiving and happy holidays, and we'll look forward to catching up with you again at conferences and in the new year at our fourth quarter earnings. Thanks very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSimon Mays-Smith -- Vice President, Investor Relations\n\nAndrew Anagnost -- Chief Executive Officer\n\nDebbie Clifford -- Chief Financial Officer\n\nSaket Kalia -- Barclays -- Analyst\n\nJay Vleeschhouwer -- Griffin Securities -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nStephen Tusa -- J.P. Morgan -- Analyst\n\nMichael Funk -- Bank of America Merrill Lynch -- Analyst\n\nGal Munda -- Wolfe Research -- Analyst\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nTyler Radke -- Citi -- Analyst\n\nJason Celino -- KeyBanc Capital Markets -- Analyst\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nMore ADSK analysis\n\nAll earnings call transcripts"
}