{
  "companyName": "Six Flags",
  "companyTicker": "SIX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/10/six-flags-six-q3-2022-earnings-call-transcript/",
  "content": "Six Flags (SIX 0.74%)\nQ3 2022 Earnings Call\nNov 10, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the third quarter 2022 Six Flags Entertainment corporate earnings conference call. [Operator instructions] I would now like to turn the conference over to Stephen Purtell, senior vice president of investor relations. Please go ahead.\n\nSteve Purtell -- Senior Vice President, Investor Relations\n\nGood morning, and welcome to our third quarter 2022 call. With me is Selim Bassoul, president and CEO of Six Flags; and Gary Mick, our chief financial officer. We will begin the call with prepared comments and then open the call to your questions. Our comments will include forward-looking statements within the meaning of the federal securities laws.\n\nThese statements are subject to risks and uncertainties that could cause actual results to differ materially from those described in such statements, and the company undertakes no obligation to update or revise these statements. In addition, on the call, we will discuss non-GAAP financial measures. Investors can find both a detailed discussion of business risks and reconciliations of non-GAAP financial measures to GAAP financial measures in the company's annual reports, quarterly reports, and other forms filed or furnished with the SEC. At this time, I will turn the call over to Selim.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThank you, Steve. And thanks to all of you for joining us today. I want to begin by thanking the entire Six Flags team. The most important thing we have done since I took over as CEO a year ago is to develop an agile culture of excellence, urgency, and results.\n\nTaking risks, challenging outdated ways of thinking, and investing in people is how I have taken companies like Middleby to the next level. And in this challenging year of strategic transition, our team worked tirelessly to elevate the experience of every guest and to lay the groundwork for sustainable profit growth in the future. Their passion for our parks and serving our guests is inspiring, and I'm proud to be leading this exceptional team. We needed this cultural shift because we are making big bets as a company.\n\nOn today's call, I will discuss those bets, why we made them, and the lessons we have learned. Then Gary will discuss our financial results. Finally, before opening the call to questions, I will return to discuss how we have applied those lessons learned and why we are so optimistic about the future. So, what are the big bets we have made as a company? First, we bet that we could upgrade the park experience by investing in our infrastructure and employee friendliness and by lowering attendance to create an extraordinary value proposition that will allow us to grow revenue by raising prices in line with value we provide; second, that we could add meaningful new experiences beyond just rides, attracting new consumers and multi-generational families to create the best memories and earn the long-term loyalty of our guests; third, that we can deliver these improved experiences with a lower-cost structure by investing in technology to become more productive, flattening our organization, and developing a culture of empowerment and autonomy in our parks.\n\nThese big bets can have big payoffs. And while the third quarter was disappointing from an attendance standpoint, the sustained improvements we are seeing in guest satisfaction and spending per capita and our improved October results give me confidence we are moving in the right direction. Why have we made these bets? Six Flags has a solid foundation with a beloved brand that is recognized around the world and a strong affinity in the areas our parks are located. We have an incredible consumer following in the markets we serve, with the level of social media reach, second only to Disney, among all theme park companies in North America.\n\nOur assets are irreplaceable. We are a global leader in delivering thrills, home to 145 roller coasters and a diverse collection of themed experiences, family events, and nearly 1,000 rides curated across a network of regional parks that are located in the top 11 markets in the U.S., including some of the fastest growing markets in the country. Yet, our earnings have stagnated since 2018 for three key reasons. First, over the years, we over-emphasize attendance growth, causing us to pursue tactics, such as deep discounting and giving free tickets to guests who spend very little in our parks.\n\nIn the last two years alone, we spent more than $100 million marketing these discounts and conditioning our guests to expect them. We have now realized that focusing purely on attendance has historically resulted in low margins, overcrowding in our parks, declining guest satisfaction, and significant stress on our team members. So, while attendance is an important metric, it is only one of several different variables that impact our bottom line. Second, we centralized decision-making and built a large bureaucratic organization with many silos.\n\nThis had the effect of bloating our cost structure and pulling decision-making away from our team members who are closest to our guests. In addition, the overcrowding of our parks required us to increase our in-park labor costs to keep up with demand. Finally, we failed to evolve our park experience at the same pace our as our guests' expectations. Specifically, our guests expect a seamless experience that blends our thrill rides and attraction with special immersive events, upgraded food and beverage offerings, enhanced amenities, and modern technology.\n\nWhat lesson have we learned through this transformation? This year, we weren't afraid to be bold with the changes that we made to our business model. Some of these changes were well-received and effective, others were not. The transformation of Six Flags will take time, and our results will not be linear. The result in the third quarter reflects a quarter in which we also were faced with inclement weather, record inflation, and sky-high gas prices that negatively affected attendance.\n\nWe have historically underinvested in basic amenities and key areas important to our guests. Our No. 1 focus this year was to invest in areas that directly impact the guests experience, such as ride efficiency, employee friendliness, park cleanliness, food variety and quality, guest amenities, and guest-facing technology. These improvements require time to implement and continue to be a work in progress.\n\nAnd some parks have been more successful than others. I will talk about the tremendous progress we have made a little later in the call. Along with that, we knew the pricing approach that had been in place at Six Flags for more than decade didn't appropriately valued the experience our guests deserved. One of our biggest hurdles was adjusting our pricing and product architecture.\n\nAs we raised prices and scaled back benefits, we knew we made the difficult but necessary decision to permanently lose a segment of our guests, particularly those who came on free or heavily discounted tickets. Raising price is no easy task for a company that has conditioned its customers to expect discounts. And it's clear that a segment of our guests experienced sticker shock with our new pricing. The sticker shock was amplified by the time lag between our park improvement and our price increases.\n\nAdditionally, research has now shown us that Six Flags guests had a more pessimistic outlook about the economy at the time we were going into the peak summer season. There were other lessons along the way. Based on guest feedback, we realized that we lost attendance by letting go of our membership program and our all-season dining program. We also lost attendance by not selling heavily discounted season passes in the fall.\n\nThe elimination of deep discounts during the periodic sales will need to accommodate a new purchasing pattern for season passes within our marketing strategy. We had intentionally dialed back marketing this past year as we evaluated what mattered most to our target customers. But we realized we must be more vocal about the changes we are making to increase value at the parks. We also knew that we have underinvested in technology over the years but realized we were further behind than we thought.\n\nWith a highly competitive market and a digitally engaged younger demographic, these technology investments are more crucial than ever to ensure we are attracting guests of all ages. We are investing significantly to catch up in this area, adding to the team and our capabilities in a way that will allow frictionless guest experience online, as well as in the park. Finally, we learn how to develop a lean operating cost structure in line with our attendance levels. While we have made considerable progress on that front, we did not adjust our cost structure fast enough earlier in the year as we enter the peak summer season.\n\nWe have learned a lot this year, allowing us to further refine our approach as we build a model based on healthy attendance growth, sustainable per-cap gains, and an optimized cost structure, all of which build an attractive bridge to enhance guest experiences and shareholder value. I would now like to hand the call over to Gary, who will provide more details on our financial performance. Gary?\n\nGary Mick -- Chief Financial Officer\n\nThank you, Selim. And good morning, everyone. Starting with results for the third quarter, total attendance was 8 million guests, which represented a 33% decrease from third quarter 2021. The attendance trend in September was significantly down from July and August for several reasons.\n\nFirst, we experienced poor weather over Labor Day and the first weekend of Fright Fest, which occurred at the end of the third quarter due to Hurricane Ian. Second, the adverse impact of a lower active pass base, which historically represents a higher-than-average proportion of visitation during September. And third, in August of last year, we provided a renewal offer to existing pass holders for season passes as low as $40. This price is not reflective of the value we provide, and we decided not to hold the sale this year, resulting in fewer season passes sold in September.\n\nBecause guests tend to visit shortly after purchasing a pass, this negatively impacted September attendance. Revenue for the third quarter was $505 million, a decrease of $133 million, or 21%, compared to the third quarter of 2021, largely driven by lower attendance, offset by higher per capita spend. Total guest spending per capita of $61 represented an increase of $9, or 17%, versus third quarter 2021. Admissions spending per capita increased $6, or 22%.\n\nAnd in-park spending per capita increased $3, or 12%. The increase in admissions spending per capita compared to 2021 was driven primarily by higher realized ticket prices and a higher mix of single-day tickets, while the increase in in-park spending per capita compared to 2021 reflected our improved assortment of in-park offerings and pricing initiatives. On the cost side, cash operating and SG&A expenses versus 2021 decreased by $68 million, or 24%, driven primarily by full-time headcount reductions, fewer variable labor hours, partially offset by inflation in the form of higher wages, insurance, and utilities. Adjusted EBITDA for the quarter was $226 million compared to $279 million in the third quarter of 2021.\n\nMoving to our year-to-date results. Since park operations were impacted during the first half of 2021 by pandemic-related closures and capacity limitations at some of our parks, we believe it is more instructive to compare our year-to-date results to 2019, which had a similar operating calendar to 2022. Relative to 2019, revenue for the first nine months of 2022 decreased by $148 million, or 12%. This includes a $46 million reduction in sponsorship, international agreements, and accommodations revenue.\n\nAdjusting for this reduction, revenue for the first nine months was down $102 million, or 9%, versus the first nine months of 2019. Attendance declined 10.3 million or 39%, offset by an increase in total guest spending per capita of $21, or 48%. Adjusting for free tickets, attendance declined 35% versus 2019. On our last call, we noted approximately $90 million of inflationary headwinds for 2022 relative to 2019.\n\nDespite these inflationary pressures, our first nine months of cash operating expenses and SG&A decreased by $41 million, or 7%, versus 2019 due to our aggressive optimization of seasonal labor based on lower attendance levels, less dollars spent on advertising, as well as a leaner corporate overhead structure. In addition, on our last call, we highlighted an increase in the annual minimum distribution to noncontrolling interest of our partnership parks. The distribution increases via CPI. And in 2022, it increased by more than 7% to $45 million.\n\nCompared to 2019, this represents an increase of $4 million for the first nine months of 2022, which negatively impacts our adjusted EBITDA by the same amount. Adjusted EBITDA decreased by $89 million versus the first nine months of 2019. But the periods are not directly comparable because of the reduction in international agreements revenue from our terminated operations in China and Dubai. Adjusting for this impact, adjusted EBITDA for the first nine months of 2022 versus the same period in 2019 decreased by $59 million, or 14%.\n\nTurning to the active pass base and balance sheet metrics, I will make comparisons to 2021. Our active pass base as of October 2, 2022, was comprised of 4.3 million passholders, a 44% decline relative to last year. Selim will talk more about this later in the call. But our most recent season pass sales trends have improved significantly, and we expect continued improvement moving forward.\n\nDeferred revenue as of October 2, 2020 was $127 million, down $98 million, or 44%, compared to the third quarter 2021. The decrease was primarily due to lower unit sales of season passes and memberships compared to 2021. Total capital expenditures for the quarter, net of insurance recoveries, were $18 million. Year to date, total capex was $73 million, net of insurance recoveries.\n\nWe expect our full year 2022 capital spend to be slightly lower than 2021, with a balanced approach between several exciting new waterpark attractions and theme park roller coasters, with a continued emphasis on implementing guest-facing technology and amenities in our parks. Our liquidity position as of October 2, 2022, was $292 million. This included $219 million of available revolver capacity, net of $21 million letters of credit, and $73 million of cash. As of October 2, 2022, the outstanding balance on our revolver was 110 million, reflecting a 90 million paydown during the third quarter.\n\nOver the next 12 to 18 months, we plan to use our excess cash to pay down debt as we work toward our target net leverage ratio of three to four times net debt to adjusted EBITDA. Our next debt maturity is 2024, and we will seek to opportunistically refinance the remaining balance as market conditions allow. Although it is likely that the interest rate on a portion of our debt will increase, we expect our total interest expense to decrease over time as we continue to pay down debt. Now, I will turn the call back over to Selim.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThank you, Gary. I would now like to discuss how we are applying the lessons we have learned over the last year to our new strategy. Our team is applying these lessons in four main areas: first, making further investments to the parks, infrastructure, new rides, and the guest experience, including marketing and technology initiatives to reach new consumers that are likely to enjoy the theme park experience; second, fine tuning our product, architecture, and pricing; third, establishing a strong autonomous culture with an emphasis on cost discipline; and finally, amplifying our seasonal events. These initiatives will never be complete as we seek to continuously improve, but we are beginning to see green shoots that this is the right path forward.\n\nNow, let me tell you more about each and why we're excited about the future. The first way we are applying these lessons is by further investing in parks, infrastructure, and the guest experience, including marketing and technology initiatives. We are just beginning to reimagine our parks and to invest in innovative guest-facing technology as guests visit us next year, we will better leverage a digital ecosystem to pre-sell items in a new manner. Guests will encounter a park environment that is less crowded and more enjoyable, have access to better food options, enjoy improved merchandise offering, and be offered a variety of add-ons that will both enhance that experience and increase spending.\n\nOne thing I discovered in partnering with Domino's for so long at Middleby was that speed matters. And throughout the park, we're working on delivering better experiences at speed. And a lot of that relies on technology. Can you believe that our guests cannot use Apple Pay in our parks? By improving simple things like wait time logistics and checkout speeds, we'll be able to improve the offering of food and merchandise to a happier guest, enabling greater attachment.\n\nWe continue to enhance our guest amenities and park infrastructure, prioritizing the comfort of our guests. Improvements such as new front gates, additional benches and shaded areas, cleaner bathrooms, upgraded restrooms, additional water park cabanas, and overall beautification of the park with more flowers and greenery have helped increase guest satisfaction. These types of improvements are crucially important for us to attract multi-generational family visitation. While in-park amenities and events are our primary focus in 2023, we'll continue to add new record-breaking coasters to our parks over time, and we look forward to some exciting announcements on this front in the near future.\n\nWe'll be pushing a renewed focus on marketing and making use of the digital capacities we have built out this far. As we draft up our 2023 plans, that will include an optimized marketing budget to better highlight the improvements we have made in the parks and the value our passes deliver to guests. We have already increased our advertising spend sequentially in October. We have seen success adding QR codes in our parks.\n\nWe will be utilizing more of our digital capabilities with improvements to enhance the guest experience, such as digital passes, mobile POS systems, and increased mobile application ability, which should allow us to increase sales and decrease wait times for guests. We recently hired a new chief digital officer, and I have utmost confidence in his ability to scale at speed of our guests-facing technology initiatives, enhancing our guest-facing technology. And in particular, our mobile app is vital to ensuring an excellent park experience for our guests. Second way we are applying these lessons is by optimizing our product architecture and pricing.\n\nWe have heard from guests that our pricing structure has been complex and confusing. So, we restructured and simplified our season pass program, landing on an approach to pricing that we believe optimally balances attendance and revenue. We also reintroduced a dining plan that is of great value for our guests but still profitable for Six Flags. Our leadership team is hyper-focused on being in touch with the communities we serve, and we will continue to evolve our product architecture based on data analytics and guest feedback.\n\nWe are listening to our guests. Thirdly we're applying these lessons is by continuing to create a strong autonomous culture with an emphasis on cost discipline. Throughout the year, we have reduced layers of management and shifted decision-making to the parks, empowering, empowering regional management and decreasing full-time headcount of more than 25% relative to last year. We optimized our seasonal labor by adjusting our staffing models, optimizing park hours, and improving labor planning.\n\nYou can see this in our reduction in costs despite the impact of inflation. We will further eliminate inefficiencies by rationalizing restaurants and stores, optimizing seasonal labor, taking advantage of our purchasing power, stripping out costs that do not directly impact our guests, all while investing in areas that reward our guests. As we grow attendance, we expect to grow revenues ahead of costs. The final way we have applied these lessons is by amplifying our efforts around seasonal events.\n\nRecently, we brought to life a bigger and better Fright Fest, creating a more immersive experience with more scare zones and haunted houses. We introduced two new events with Kids Boo Fest and Octoberfest, which were very popular and gained momentum each week through word of mouth. Social media engagement was exceptional with a reach of more than 5 million people, highlighting the type of innovation and excitement we're delivering to consumers who have not recently visited our parks. We are also very excited to host our first ever Veterans Day weekend this week, honoring those who have served in our armed forces.\n\nAnd our digital marketing has been active in driving targeted awareness for weeks. Through our new culture, we have been able to deliver these events with speed and quality, executing in weeks what we have previously taken up to a year. Throughout 2023, we will be launching exciting new events and festivals, such as Mardi Gras, Viva La Fiesta, Brews & Bites, Kids Fest, and Thrill-A-Thon celebration, giving our guests reason to visit multiple times per season. I would encourage everyone on the call today to come to one of these new events.\n\nIt's where you will see the type of excitement and newness that we want guests to experience all the time, and is our best demonstration of what the new Six Flags is delivering. Please check out our 2023 calendar on our website. Now, let's turn to why we are so optimistic about the future. We implemented three significant changes to our business in October.\n\nOne, we upgraded our seasonal events I just talked about, which have received very positive reviews and attracted new guests to our park. Two, we restructured and simplified our season pass program, landing on a price point we feel good about and that we believe optimally balances attendance and revenue. Three, we increased our advertising spend sequentially in October. To put this into perspective, our paid media spend year to date through the third quarter was 47% of 2019.\n\nIn October, it was 17% higher than 2019. We are willing to invest in the right places. And when we see the opportunity, we will hit the gas. As a result of these changes, we have seen an improvement in the trajectory of our results thus far in the first quarter.\n\nFor example, our attendance relative to 2019 has improved from 61% for the third quarter to 85%. Our per capita spending trends continue to be robust. Year to date through September, our per capita spending has increased nearly 50% compared to 2019, and these trends have helped in the fourth quarter even as attendance improved. Our season pass sales trends have improved significantly.\n\nYear to date, through the end of the third quarter, our season pass unit sales indexed at 34% -- at 43% of 2019. Worst quarter to date, our season pass unit sales are running 89% to 2019. In light of these trends and our progress related to cost management, we are on track to deliver strong fourth quarter adjusted EBITDA. One month does not make a trend, but we are encouraged that the recent changes we've made to our business are having a positive impact on our financial results.\n\nChanging a business is never easy. It takes time. And sometimes, you have to take a step backward before taking two steps forward. But we remain confident in our approach to changing the culture here at Six Flags, optimizing attendance and per caps and overhauling our cost structure.\n\nAnd this year, we discover a lot about how to drive guest satisfaction and how to optimally price our tickets. We will continue to stay close to our guests and respond to their feedback during this transition. We are listening to our guests, and we have to transformed our business to quickly make changes that are important to them. I love visiting the parks.\n\nI love mingling with our guests. And I was there throughout October, visiting many of our parks during Fright Fest, Oktoberfest, Boo Fest. And I watched and observed our guests enjoying themselves and smiling. I watched as multi-generational families were there.\n\nI watched the strollers. I watched grandparents, parents bring their children to the park. I watched our teenagers enjoying the rides and having fun and mingling with their friends. It was beautiful to watch.\n\nWhen I took over as the CEO nearly a year ago, I saw the key challenges facing our company. To reinvigorate long-term earnings growth, we have adopted a transformative strategy. The journey requires flexibility, learning, and a relentless focus on our core values and culture. I want to close our prepared comments by once again thanking our team for their resiliency during this period of transition for our company.\n\nWe owe a huge amount of gratitude to our team members in the parks, who are the ambassadors to our guests, who are not satisfied with our third quarter financial results but recognize that laying the groundwork for long-term sustainable earnings growth often involves taking a step backwards. We believe that we are on the right path, and we are encouraged by the improvement in our recent performance. We have done much of the heavy lifting this year, and my commitment to the company is stronger than ever. I see significant potential and opportunities in the years ahead.\n\nOperator, at this point, could you please open the call for any questions?\n\nOperator\n\n[Operator instructions] The first question today comes from Ben Chaiken with Credit Suisse. Please go ahead.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey, good morning. Thanks for taking my question. Mike, my question is on per caps. So, your in-park spending per capita declined in 3Q sequentially versus 2Q.\n\nAnd the pace of growth relative to '19 also decelerated compared to your year-to-date pace. Selim, you mentioned several learnings in your prepared remarks, and then your attendance in October, I think, is down -- if I called it correctly, down 15% versus down 40% or so in experience in 3Q. Is it fair to assume that you're rethinking the strategy between volume and price? And then, where do you think the right level is versus '19? Thanks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nBen. Good morning. I am now celebrating a year on the job. And I remember you were the first analyst that I spoke to a year ago.\n\nAnd today, a year later, there had been a lot of lessons learned. The first lesson that I've learned is we have historically been priced well below our peers and other out-of-home entertainment options, concerts, ski resorts, sports venues. And we learned that we have much more room to grow our pricing to match our elevated experience. Also, this year, in an inflationary environment, it's created a unique opportunity to raise prices.\n\nAnd our objective is to make our parks much less crowded. Now, we have moved away from the practice of offering deep discounts on season passes, and specifically, in the fall, which significantly lowered our average season pass yield. Now, we have listened to our customers, recalibrated our pricing accordingly. I think we got it wrong at first and priced our season passes too high.\n\nAnd our pricing structure was confusing and complicated. We eliminated -- we froze memberships. We added annual passes. We had too many configuration that it confused our customers.\n\nSo, what did we do in October? We simplified our pricing architecture much, much simpler. And we basically reduced our season pass pricing to be much more in the mix for our guests that allow us to reach our goal attendance level and factor in our guest satisfaction to increase admission. However, will remain higher than 2019 and 2021, and will continue doing what I call dynamic pricing, which, I think, we will see in 2023. And we're very optimistic that we are now at a level where we feel comfortable with pricing.\n\nWe might have to tweak a little bit, but we're very comfortable.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nThat's very helpful. Thank you. And then, just thinking about costs here for a moment. Normally, you have a deceleration in costs in kind of the shoulder periods for Q1.\n\nDoes that trend still apply -- just for modeling purposes, does that trend still apply, given the lower top line that we have this year?\n\nGary Mick -- Chief Financial Officer\n\nHi, Ben. This is Gary. We are really very disciplined on our cost side and fully intend to drive the cost-saving initiatives that we implemented in Q3 into Q4, as well as continuing into Q1 in 2023 as much as is practical.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nThat's helpful. Thank you.\n\nGary Mick -- Chief Financial Officer\n\nOK.\n\nOperator\n\nThe next question comes from Paul Golding with Macquarie. Please go ahead.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nThanks so much for the question. I wanted to ask how you're thinking about extra-charge products in the context of this new attendance level and with front gate pricing. Have you seen any change in uptake there? Or maybe how your strategy has changed in terms of pricing those extra-charge products, Thanks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nPaul, I can address that. In general, the attendance is going down. We have basically seen our, like, flash passes has been down. It's been down.\n\nHowever, we've seen some other things that have gone up. People have been spending more time in our parks, and they are spending more on food. Retail is way up for us, and we feel very good. And, of course, the events.\n\nThe events have been an additional -- the new events we introduced of high quality that we introduced in October, like Octoberfest, Boo Fest, and now Veterans Day celebration coming up this weekend, have increased the spend and the time people are enjoying in our parks.\n\nGary Mick -- Chief Financial Officer\n\nI will add also, Paul, that we've been very successful with monetizing areas of our parks with cabanas, amenities, and other rentals that our guests really appreciate. That is added to our IPS revenue.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nGreat. Thanks. And then, on ad spend, you noted that you're investing incrementally here and sequentially in October in shoring up the ad spend relative to the consumer here. I was wondering if you could speak to how you might see scale in that cost line, especially in the context of your increased digitization and potential efficiencies in advertising through those channels? Thanks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nSo, I have to say, we did claw back marketing on purpose this year. We were still doing the beautification of our parks. We wanted to make sure that when we promote the brand, we will promote them in line of making sure that when people come up, they seek the experience. So, we had a lag between our marketing and advertising and when we started pushing advertising in the fall.\n\nAnd I have to say that in the previous years, we spent almost -- in 2019, 2021, we spent almost $100 million between the two years advertising discounts as low as 70%, as low as $29.99. Our approach to marketing, as we go forward, is all about branding. It's all about events and the quality of investment. It's all about reaching social media influencers to spread the message.\n\nIt's about reaching new guests and followers that have affinity to our parks. So, it's a completely different strategy, trying to target the Hispanic community through channels that are very targeted and focused on that Hispanic community, going to go up and focus on our neighborhood communities that are right there, more affluent communities to come to our parks. And most important, go on and have social media to target our teenagers. We want to stay connected with our teenagers and let them know about all our new rides.\n\nSo, it's all about branding versus message of discounting. And we will be increasing our marketing expense in 2023.\n\nGary Mick -- Chief Financial Officer\n\nI will follow up to that, too, as well, Selim, for you, Paul. We have -- we are -- I love the phrase you said \"We hit the gas.\" And as we have dialed in and noted what really works and this has worked also in October and we find an event, we find season pass, we find these things that we want to promote. We will not hesitate to spend on advertising and marketing.\n\nPaul Golding -- Macquarie Group -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nThe next question comes from Steve Wieczynski with Stifel. Please go ahead.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nHey, guys. Good morning. So, Selim, you've noted before that you thought the optimal attendance level over time would be, you know, let's call it 25 million to 27 million guests. And, you know, obviously, based on what your run rating today, I mean, you're really still pretty far off from that range.\n\nSo, I guess, you know, I'm wondering, how should we think about the -- well, first of all, is that range still fair? And then, second of all, you know, what kind of time should we think about in terms of how long it potentially could take you guys to get somewhere close to that range?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nI would say -- Steve, I will answer. One is we are still very comfortable with 25 million to 27 million guests per year. I think we will not go back to the 30 million that we've seen before -- or 33 million we saw in 2019. And the reason, literally, is we need to make sure that our parks are not overcrowded.\n\nAnd we've seen this this year. There is a true correlation between our customer being able to be not lining up in retail stores, lining up in restaurants, lining up everywhere, and their spend in the park. A very strong correlation. When they are comfortable in the park, they spend more.\n\nAnd we've seen that in our spend per guest in our -- in-park spend in our guests. Second, I truly believe that we have to target and invest with customers, potential customers, who have an affinity for parks. And we have identified those. They represent around 16 million people who have affinities to parks.\n\nAnd we are looking at them and making sure that a portion of those will come to our park by focusing and targeting them. Now, where do we stand on the timing of reaching the 25 million to 27 million guests per year? I think we always say that it's a three-year process. We feel that within the next three years, we'll reach that target.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. Just to be clear, that's three years from the start of when this process started, or three years from today. Just wanted to be clear there.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nI think that's -- looking at it, I think from today. Knowing we've learned a lesson, that is going to be from today.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. Gotcha. And then, second question, wondering, you know, maybe how we should think about capex spend for, you know, for next year. It's clear that, you know, probably a lot of your parks still aren't where you want them to be in order to attract this higher quality guests.\n\nSo, you know, should we expect a, you know, a material increase in capex spend next year? Or, you know, will capex be similar to what we're kind of seeing this year but allocated more toward, you know, those certain parks out there that maybe might need more help?\n\nGary Mick -- Chief Financial Officer\n\nSteve, this is Gary. We will be reverting essentially our beautification capex. We will be reverting it over to attractions and rides. And yes, we will be increasing capex in the next couple of years.\n\nWe are looking forward to make an announcement in the spring toward that effect. And we definitely will be investing in the attractions and rides that our customers really appreciate and have been asking for.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. Understood. Thanks, guys. Appreciate it.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Ian Zaffino with Oppenheimer. Please go ahead.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nHey, great. Thank you very much. Hey, Selim I just want to ask you on -- you mentioned gas prices. And I guess we never really heard that from Six Flags before about gas prices impacting attendance.\n\nCan you maybe give us a little bit more color there? And then, also, did you notice any kind of degradation in in-park spend because of that, just having less disposable income? And kind of how do you square that with the comments about, you know, an inflationary environment being beneficial to you guys? Thanks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nSo, I'll start about what you've seen. And we have a survey research that came up this summer that showed that our customers were affected by the financial tightening, or they felt that the financial tightening would affect them. And what happened is, literally, that happens with -- started seeing that in mid-June through July, and then on through the summer. I think, definitely, our guests started feeling the pinch on gasoline prices, on utility prices, on food in the grocery store.\n\nAnd I think it might impact us because somehow, some way, we have to research shows that our guests were sensitive to those -- to the inflation that they had on their disposable income. We have also seen that those guests -- some of those guests came back when gasoline prices went down in the fall. I assume there is somewhat of a correlation as they came back, and we saw the return to a little bit more normalized attendance in October and November.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nOK. Thank you. And then, you know, just building on October and November, can you maybe talk about some of the products that you've reintroduced, all-season dining, payment plans? You know, how is the take rate going there? And is that what's helping drive a lot of the improvement in attendance, or is it the marketing like you had talked about? If you could talk about, that'd be great. Thank you.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nI think it was many things that happened to make this again from the lessons we've learned. We've learned that quality events that are done, well implemented, executed well in our parks, have tremendous appeal to our guests, especially off season passes. We also learned that concerts and shows that are also high quality are an appeal to our season pass holder and single-day ticket, in that case. So, we invested in Boo Fest, which was new.\n\nWe invested in Octoberfest, which is new. And what is amazing about that, it's not like we did some -- they were all simultaneously -- it was an improved and much, much better prices. We elevated the Fright Fest. So, now, we have in the park, you come in, parents, adults who want to enjoy and not go to a haunted house could have their kids and teenagers and enjoy the haunted houses in the Fright Fest.\n\nAnd they will be enjoying our Octoberfest. Kids -- parents with small kids who don't want to go to Fright Fest with all those teenagers, we created the Boo Fest for them, where there was a trick or treat in the afternoon. And those were very successful. So, this is on the events.\n\nOn the shows, we had significant improvement in investment in characters that are tied to our IP. We had also parades, concerts, and unique shows that were implemented. Those were also part of the premiumization. Finally, I would say, our marketing was a lot more targeted.\n\nWe did a lot of online posting with content driven by those shows, by those events. So, we had something new and newness to share of why you need to come back to the park.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nOK. Thank you very much. That's very helpful.\n\nOperator\n\nThe next question comes from Jamie Hardiman with Citi. Please go ahead.\n\nJames Hardiman -- Citi -- Analyst\n\nHey, good morning. Thanks for taking my question. So, I just wanted to start off. And you've given us some breadcrumbs here, but just can you maybe walk us through the attendance trends over the course of the quarter and into October? I think what we were supposed to conclude coming off of the last call was that July was maybe down high-30s versus 2019.\n\nI don't know where August was, but it sounds like what you're saying is September was meaningfully worse than that run rate. And then, October maybe down 15 versus 19. So, maybe give us whatever quantification you could there.\n\nGary Mick -- Chief Financial Officer\n\nYeah. Good question, Jamie. And good morning. Our -- the months -- the first preceding months, right, we're looking in July and August, trended very similar in the range of what I mentioned, which is 35% down versus 2019.\n\nAnd September was the month that disappointed us the most. And it has to do with timing of season pass sales and a really big discounted effort we put forth in 2021. So, in and around the Labor Day weekend, we held a sale with very aggressive pricing, which we mentioned was about $40 average. And we sold between 500,000 and 600,000 passes at that sale.\n\nPeople tend to go to the park once they buy their pass. And, you know, that drove September's attendance up in '21, whereas we chose not to have such a discounted sale and have moved to our season pass efforts more toward the October Fright Fest time frames.\n\nJames Hardiman -- Citi -- Analyst\n\nThat's helpful. And then, maybe as we think about this October number, it seems like you think there's a pretty strong causal relationship between some of the efforts that you guys put in and the much better month of October. Obviously, we did see an improvement really across the industry in October, and maybe there are some sort of secular trends at play there, or maybe the consumer is just feeling better. I guess, ultimately, what I'm trying to figure out is, you know, you had a, you know, down 40-plus percent in the third quarter.\n\nYou had a down 15%, again, versus 2019 in October. How do we think about the go-forward rate? Clearly, you don't think that sort of the down 15 is sustainable, given the sort of attendance commentary. And how long it's going to take you to get back to that optimal level? But how do we digest that, you know, two such disparate data points between the third quarter and October?\n\nGary Mick -- Chief Financial Officer\n\nYeah. So, when you look at the deferred revenue being down 44%, you know, on the balance sheet, you know, you certainly understand and correlate that as well. And I'm looking at the same kind of commentary regarding September, Jamie, which, you know, the timing of the season pass sales will affect that effort. We're looking to have a strong fourth quarter.\n\nAnd that is the language, I believe, that Selim used as we go forth. Something to keep in mind is that HIP, Holiday in the Park, is an event that that happens beginning after Thanksgiving. And this year, we are not doing it in approximately five of our parks. So, it is not EBITDA-accretive in those parks.\n\nAnd so, we made the decision not to do it. But that will negatively affect the tenants in the latter part of the fourth quarter, but not EBITDA. So, I just want to make that clear.\n\nJames Hardiman -- Citi -- Analyst\n\nThat's helpful. Thank you.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThank you, James.\n\nOperator\n\nThe next question comes from David Katz with Jefferies. Please go ahead.\n\nDavid Katz -- Jefferies -- Analyst\n\nHi. Good morning, everyone. Thanks for taking my questions. And appreciate all the detail so far.\n\nI just want to go back to one detail from the very first question, where we're looking at cash opex in the third quarter, which, you know, was down if my math is correct, around $23 million or 10% versus '19. And that's been a progressively bigger reduction through the course of the year. How should we -- how specific can you be in helping us model that for 4Q and 1Q before we get into the high season next year? And then I have a couple of other details as well.\n\nGary Mick -- Chief Financial Officer\n\nYeah. Good morning, David. I think you can model the consistency of Q3's reduction into Q4 on a relative basis. I think that's reasonable.\n\nOur reductions are in corporate headcount. They're in full-time headcount at the parks. There are also in seasonal labor. And those are the costs that we've seen.\n\nSome of that is in SG&A. And on the opex side, we have a fair amount of reduction related to other expenses in our parks that we have been optimizing through our initiation cost reduction initiatives at the park level. And that should also continue through Q4.\n\nDavid Katz -- Jefferies -- Analyst\n\nExcellent. And just two other details. Number one, Selim, in your comment, you made some reference to, I believe, it was, you know, some positive qualifier for 1Q EBITDA. And I was hoping you could just go back and sort of repeat or quantify that a little bit and sort of what you mean by that.\n\nAnd then, second, you know, for, perhaps, both, I mean, we're seemingly very, very focused on attendance levels and what the ramp in those are. And I see that the per caps here, you know, in this quarter are starting to reach those of a competitor, right? You're in that low 60s all in level. Is it fair to assume that you expect to push those per caps considerably higher than where your peers are? And so, you know, while it may take three years to get to that aspirational attendance level, you know, the EBITDA can grow, you know, along the way to some of the aspirational levels that have been discussed in prior periods.\n\nGary Mick -- Chief Financial Officer\n\nGreat question, David. We have three really important metrics that we use: guest satisfaction, yield, and ultimately EBITDA. These are the three that we are using today. And of course, there's many more that go into those functions.\n\nAnd yield is a -- attendance, of course, is a part of the yield equation. And yes, we intend to grow in our aspirations or to grow per caps to those levels, as you mentioned. And we have these ambitious goals here. We are also -- although cognizant that we are going to take a more measured approach to our increases in our passes and in our single-day tickets and in all our ancillary events so that, you know, our customers that, I believe, experienced some sticker shock this year do not have that same feeling in subsequent years.\n\nDavid Katz -- Jefferies -- Analyst\n\nCan I sneak one more detail in there that may be instructive for everyone?\n\nGary Mick -- Chief Financial Officer\n\nAbsolutely. Sure.\n\nDavid Katz -- Jefferies -- Analyst\n\nGary, I think in your commentary, you talked about capex being slightly lower than 21. And then if I listen to all the commentary, including Selim's, there's kind of a lot to do digitally and experientially in terms of spending. Are you sure that that down slightly versus '21 is enough?\n\nGary Mick -- Chief Financial Officer\n\nDavid, I'm going to refer to '22 first and say, yes, it is enough regarding '22's capex spend. '23, we need to increase it and we plan to. We've mentioned previous calls approximately 130 million of capex spend on a go-forward basis. We intend to increase that for '23 and '24, pending some announcements that we plan to make in the spring.\n\nDavid Katz -- Jefferies -- Analyst\n\nIncrease versus 130.\n\nGary Mick -- Chief Financial Officer\n\nCorrect.\n\nDavid Katz -- Jefferies -- Analyst\n\nNoted. Thank you very much.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Mike Swartz with Truist. Please go ahead.\n\nMike Swartz -- Truist Securities -- Analyst\n\nHey, good morning, guys. Just maybe a clarification follow-up on one of James' questions earlier, just around the cadence of the fourth quarter. And I think you had mentioned that you'll have fewer operating days, probably November and December. Can you give us any kind of quantification or context on how to think about how many fewer operating days we will see over the balance of the quarter?\n\nGary Mick -- Chief Financial Officer\n\nWe are really focused on operating days because they are so different. You know, having a night event is so different from opening on a weekend. But there's about five of our parks that are not doing the holiday in the park. And they're open typically on weekends or Thanksgiving and Christmas.\n\nSo, it's not a big amount of attendance. I think it does affect the growth rate for that part of the quarter. But overall, they were not EBITDA-accretive. So, we feel like this move is going to help us with the quarter overall and our profitability.\n\nMike Swartz -- Truist Securities -- Analyst\n\nOK. Got you. And Selim, I mean, one of the goals of this kind of strategy that you have is improving the guest experience. I think you've mentioned a number of headcount reductions in the parks.\n\nSo, I guess how do you balance, you know, some of the cost you're removing from the parks with you're trying to maintain or actually improve the guest experience?\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThat's very good, Mike. I would have to tell you, this is a very balanced approach. This year was a year of totally building back our culture, building our new -- in a sense, what you want the amenities to be in the park, elevating the experience. So, from that perspective, there were three elements to that strategy.\n\nElement number one was stop the heavy discounting that has happened, which does not reflect truly the value that we provide. We were priced too low. And we have seen the stagnation of our EBITDA over the years, and that had to be changed. And second, we found that we had underinvested in our park when it comes to beautification, the landscaping, the flowers, the cleanliness, the benches, the amenities, the food.\n\nNumber three, we have also not made it easy for our customers from a technology standpoint. We want to be easier to do business with on boarding you in the park, be able to book tickets. So, you look at technology, you look at the in-park experience, and you look at the pricing point. I think those three elements most probably were done all at a certain time.\n\nWe most probably did a lot of them in a very difficult environment, which is very inflationary environment on our guests. But we did them. And in that reflection, we most probably, as Gary said, might have affected some of our guests' ability to come to our park this year. But as we look forward, we're seeing that the improvement we've done have been well recognized.\n\nI've been in the park every weekend, the past few weekend, mingling with our guests, mingling with our members, mingling with our teenagers, and they would stop me. I'm well recognized in the park. And they tell me that the experience have gotten much, much better, and it was worthwhile the wait. And in fact, I have several guests who told me it's not worthwhile the price increase that they're willing to pay for the experience.\n\nSo, that's the way we feel.\n\nMike Swartz -- Truist Securities -- Analyst\n\nOK, thanks. Maybe if I can just hit one more in, I think you had mentioned that there were some impact from Hurricane Ian at the end of the third quarter. I guess, I'm trying to figure -- understand which parks were actually impacted. Maybe how much attendance you lost due to that?\n\nGary Mick -- Chief Financial Officer\n\nGreat question, Mike. Hurricane Ian came up the East Coast at the end of our quarter and impacted nearly all of our parks on the East Coast. Total attendance lost approximately 150,000 and nearly $10 million in revenue.\n\nMike Swartz -- Truist Securities -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThe next question comes from Barton Crockett with Rosenblatt Securities. Please go ahead.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. Thank you. I wanted to see if I can understand a little bit better what you're saying about the change in October or I think you said that attendance was down 15% versus 2019. But I don't think I heard a commentary, maybe I missed it on revenues.\n\nGiven your per cap trend, that would suggest that maybe revenues were up a lot in October. And I was wondering, unless the per cap trend changed then -- and so I was wondering if you could address that to begin with.\n\nGary Mick -- Chief Financial Officer\n\nYes, Barton. Per caps are staying very consistent in October. And the attendance, of course, has been driven by all of our events that the team has put forth at our parks set up at this stage.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. So it's fair -- so you're not going to give us a revenue number, but it's not crazy to think you had some decent growth in October?\n\nGary Mick -- Chief Financial Officer\n\nYes, that's correct.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. All right. And then, you know, turning to the liquidity, 262 million, I think, you said. And the deferred revenue balance is less because of the season pass change.\n\nAnd we're coming into a capital consumptive period where commonly in the first quarter, you guys would, you know, use $100 million or so of cash. How should we think about the liquidity puts and takes from here? And in the past, you guys have had $150 million liquidity covenant. And I'm just wondering where the covenant kind of positioning sits at this point.\n\nSteve Purtell -- Senior Vice President, Investor Relations\n\nHey, Barton. This is Steve. We don't have any covenant around minimum liquidity any longer. We only have a secured leverage ratio, which we're comfortably within.\n\nAnd we have plenty of liquidity as you go into the off-season. Although, we are spending capital during that time and our parks are closed, we have an ample revolver capacity well above our historical needs and a lot of cushion. So, we feel really good about our liquidity.\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nOK. All right. I'll follow up more offline. Thank you.\n\nGary Mick -- Chief Financial Officer\n\nThank you, Barton.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Selim Bassoul for any closing remarks.\n\nSelim Bassoul -- President and Chief Executive Officer\n\nThank you very much. I would like to do a closing remarks, if possible. First, I want to thank every one of you for being on that call today with us. I would like to also talk a little bit about our improving the experience of our millions of loyal existing customers while also attracting first-time guests as our priority that is central to our plan to improve the company's financial performance over time.\n\nI'd like to take a minute to empathize with our shareholders and investors as we've made the turnaround that the value creation will happen over time, and we are very positive about the evidence that is showing up in October and November that the strategy is working, and progress has been made. Pursuing a strategy aimed at improving guest experience and delivering value is ongoing. In the meantime, our attendance and pass base has been lower and will be lower than 2021. This is a transitionary period for our company.\n\nWe are confident in our ability to transform Six Flags that has been underperforming relative to its peers. And the leadership team that is guiding this new chapter is very confident in our ability to become best in class. Higher per caps and guest satisfaction reflect improved product offerings and in-park revenue management. It is sticking.\n\nCreating fun through employee friendliness, lower crowds create a better experience for guests and employees, and as I said earlier, more spending in our parks. To this, I want to say kudos to our frontline and ambassadors in the parks for delivering an amazing experience. And it shows in our guest satisfaction, the interviews and surveys we've seen, where they are commending you for your courtesy, for your friendliness, the cleanliness of the park, and the ability to enjoy their time with you while they are visiting us. Empowering our parks, resulting in quicker execution and improving social media sentiment and guest satisfaction scores have been, as Gary said, a top objective of ours.\n\nWe have to invest directly in our guest experience, meaning our guest-facing technology. We want to have also ample ride capacity. And most important, our next capital collection priority is to reduce our debt. With our new strategy underway, we expect to see more investment and more capex in marketing, digital outreach and mobile application, as well as in rides.\n\nWe have taken our fixed costs, and we are scaling our variable cost for the new attendance levels. We have still more room to optimize further, and we are confident that we will be optimizing our inefficiencies in 2023. We are a great industry, and I salute our other peers because we have been resilient to inflation. And we are hard to replicate.\n\nOut-of-home, outdoor, safe, regional entertainment experience close to our guests, and in our case, close to 11 fast-growing markets that Six Flags serve. On this, I would like to thank you for your continued support, both as shareholders, as analysts, and as our guests. We hope to see you all at the park this weekend for our first-ever Veterans Day weekend celebration, celebrating those who serve and served our country, and in the coming weeks for our magical Holiday in the Park event as we kick off the holiday season. Please also -- as we say it in our earnings script, please check out all our 2023 fabulous events lineup.\n\nTake care. Have a great day, and happy holidays. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteve Purtell -- Senior Vice President, Investor Relations\n\nSelim Bassoul -- President and Chief Executive Officer\n\nGary Mick -- Chief Financial Officer\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nPaul Golding -- Macquarie Group -- Analyst\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nJames Hardiman -- Citi -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nMike Swartz -- Truist Securities -- Analyst\n\nBarton Crockett -- Rosenblatt Securities -- Analyst\n\nMore SIX analysis\n\nAll earnings call transcripts"
}