{
  "companyName": "Arco Platform Ltd",
  "companyTicker": "ARCE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/19/arco-platform-ltd-arce-q2-2022-earnings-call-trans/",
  "content": "Arco Platform Ltd (ARCE -1.46%)\nQ2 2022 Earnings Call\nAug 18, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, everyone. Thank you for standing by, and welcome to Arco Platform second quarter 2022 earnings call. This event is being recorded. [Operator instructions] This event is also being broadcast live via webcast and may be accessed through Arco's website at https://investor.arcoplatform.com/ where the presentation is also available.\n\nNow I'll turn the conference over to Carina Carreira, Arco's IR director. Carina, you may begin your presentation.\n\nCarina Carreira -- Director, Investor Relations\n\nThank you. I'm pleased to welcome you to Arco's second quarter 2022 conference call. With me on the call today, we have Arco's CEO, Ari de Sa Cavalcante Neto; and Arco's CFO, Roberto Otero. During today's presentation, our executives will make forward-looking statements.\n\nForward-looking statements generally relate to future events or future financial or operating performance and involve known and unknown risks, uncertainties and other factors that may cause our actual results to differ materially from those contemplated by these forward-looking statements. Forward-looking statements in this presentation include, but are not limited to, statements related to our business and financial performance, our expectations and guidance for future periods, our expectations regarding strategic product initiatives and their related benefits and our expectations regarding the market. These risks include those set forth in the documents that we issued earlier today, as well as those more fully described in our filings with the Securities and Exchange Commission. The forward-looking statements in this presentation are based on the information available to us as of the date hereof.\n\nYou should not rely on them as predictions of future events and we disclaim any obligation to update any forward-looking statements, except as required by law. In addition, management may reference non-IFRS financial measures in this call. The non-IFRS financial measures are not intended to be considered in isolation or as a substitute for results prepared in accordance with IFRS. We have provided a reconciliation of these non-IFRS financial measures to the most directly comparable IFRS financial measure in our press release.\n\nPlease note that except from revenue, gross margin, selling expense, G&A and cash flow from operations, all other financial measures we discuss here are non-IFRS. And growth rates are compared to the prior period comparable period, unless otherwise stated. We also note that year-over-year comparisons are affected by acquisitions that were not included in our 2021 financials. Let me now turn the call over to Ari, Arco's CEO.\n\nAri de Sa Cavalcante Neto -- Chief Executive Officer\n\nThank you, Carina. And thanks, everyone, for joining today's conference call. We hope that you and your families are all healthy and safe. I'd like to start with the highlights of the quarter on Slide 3.\n\nFirst, we had net revenues of BRL 412 million in the second quarter, 61% above the second quarter of 2021. Reflecting the high level of late orders placed by partner schools, which part of the delivery slipped to April. For the first six months of the year, we accumulated revenues of BRL 842 million, a 43% increase year over year or a 31% organic growth. As a result, we already had 83% of the 2022 ACV recognized cycle to date.\n\nThis quarter, we had important efficiency results arising from our integration agenda, which were crucial to offset nonrecurring increase in operating costs resulted from late orders. The adjusted EBITDA margin was 26.9% in second quarter versus 28.2% in second quarter of 2021, and 30.6% in the first six months versus 32.4% in the same period of 2021. When excluding the one-off impact from late orders in our operating cost, adjusted EBITDA margin for the first six months of 2022 was 33.2%, 80 basis points above six months 2021. We'd like to take this opportunity to reaffirm our adjusted EBITDA margin guidance range for 2022 full year of 36.5% and 38.5% at this time.\n\nSecond, this was an extremely positive quarter of cash generation perspective as we had a strong cash collection, reduced days sales outstanding, lower delinquency and reduced capex as a percentage of revenue, leading to an adjusted free cash flow generation of BRL 90 million in the quarter. In August, we concluded the issuance of debentures aiming to strengthen our cash position and extend our debt maturity profile. Finally, we are very excited about the promising commercial cycle for 2023 school year as we resume in-person interactions with schools. It is still early in the cycle as most of our ACV bookings happens between September and November, but schools' enthusiasm is already leading to encouraging preliminary results.\n\nI will now turn the call to Otero, who will continue the presentation. Otero, please go ahead.\n\nRoberto Otero -- Chief Financial Officer\n\nThank you, Ari, and good evening, everyone. Thank you for your time.Starting on Slide 5. Net revenues for the second quarter of 2022 were BRL 412 million, a strong 61% top line growth year over year and representing 26.4% revenue recognition of the 2022 ACV. As mentioned in our Q1 earnings call, the typical high level of late orders placed by partner schools in the beginning of the year led to part of such content being delivered in early April, therefore, explaining the strong revenue recognition in the quarter.\n\nOn a like-for-like basis, excluding the acquisitions concluded recently, organic top line growth was 47% in the quarter. As Ari mentioned in the beginning of this presentation, cycle to date, we have already recognized 83.2% of the 2022 ACV, and we are confident on the 100% recognition by the third quarter. Moving to Slide 6. We delivered important efficiency gains this quarter as we progress in our integration schedule.\n\nFor the first six months of 2022, they contributed to a 2.4 percentage points improvement in our cash gross margin, offsetting the nonrecurring increase in operating costs resulted from the late orders as we incurred in higher printing and freight emergency costs. On Slide 7, investments in selling remain a priority for us, especially in such upbeat in momentum for our partners' goals. Our investments in selling represented 36% of our top line in the quarter, and 34% in the first six months as we resumed our traveling and event plans. Those efforts already translate into promising results for our 2023 commercial cycle.\n\nMoving to Slide 8. G&A expenses continued to show the results of higher scale and a more integrated back office strategy, growing below top line at 28% year over year in the quarter. On an accumulated perspective, G&A dropped to 17% of revenues in the first six months of 2022 versus 20% in the first six months of 2021. Year-to-date, we have saved approximately BRL 30 million with the integration agenda, and these efforts continues going forward.\n\nOn Slide 9, adjusted EBITDA for the second quarter reached BRL 111 million, 53% above second quarter of 2021, with a margin of 26.9% or 31.4% when excluding the one-off impact of late orders, not considered in the guidance range. Looking at the six-month figures, adjusted EBITDA increased 35% year over year with a margin of 30.6% or 33.2% excluding one-off impact from the late orders. We presented an adjusted net loss of BRL 23 million in the quarter, reflecting higher financial costs and higher depreciation and amortization on top of continuous investments in our products and revamp of recently acquired businesses. On Slide 10, we summarize the year-over-year performance for the quarter, for the cumulative six months of 2022 and cycle to date, showing the clear evolution of our product cycle with a 52% increase in the adjusted EBITDA and a margin expansion of 100 bps versus 2021 cycle to date or 300 basis points when excluding the one-off impacts from the late orders.\n\nMoving to cash generation on Slide 12, we present a considerable improvement of our trade receivables profile as we collected BRL 519 million this quarter, 30% above the $400 million we estimated when we released the first quarter results with delinquency reducing to 5.6% versus 7.2% of revenues in the first quarter and 10% in the second quarter of 2021. As a result, the days of sales outstanding reduced to 141 days from 212 days in the first quarter. As for the capex, in the second quarter, we invested BRL 43 million, roughly 11% of our net revenue, adding to BRL 90 million in the first six months of 2022, or 11% of our net revenue, right at the middle of our guidance range of between 10% to 12% of revenues being invested in capex. This reduction reflects a higher level of integration across the business units, driving higher cooperation and lower redundancy in projects being executed.\n\nOn Slide 13, we presented resulting cash generation for the six months of the year. We had a relevant improvement in the working capital positive at 21% of EBITDA from 9% in the first six months of 2021 and an increase in adjusted EBITDA to cash from operations to 114% in from 106% in the first six months of 2021, both positively impacted by a better trade receivables profile as previously presented. We also had a slight improvement in the adjusted EBITDA to adjusted free cash flow metric to 33.2% from 32.5% in the first six months of 2021, impacted by a lower effective tax rate and lower capex as a percentage of revenues. A particularly positive result, especially considering the 870 bps year-over-year increase in the average interest rate in Brazil.\n\nFinally, on Slide 14, we're bringing our pro forma cash position and obligations of schedule already considering the issuance of debentures announced in August, amounting to BRL 1.2 billion, better interest at CDI plus 2.3% per annum and with maturity in 2027. The proceeds of this new issuance were used to prepay the debentures issued last August to strengthen our cash position and extend our debt maturity profile. This issuance added to the cash generation of the second half of the year are sufficient to meet our short-term obligations. I'll now turn the call back to Ari.\n\nAri, please go ahead.\n\nAri de Sa Cavalcante Neto -- Chief Executive Officer\n\nI'm happy to show the evolutions that we are making on several fronts. Our efficiency agenda is showing clear successful results, which are -- were crucial to offset the marginal cost pressure coming from the late orders from schools. We have started to operate in a more cooperative way. We had also hired a consulting firm to help us in this structural agenda to implement sustainable changes to our operating model so we can better capture the benefits from scale over time.\n\nOn the financial front, we committed earlier this year to improve our operating cash flow and reduce our capex as a percentage of revenues. As showing the results, we have delivered a significant improvement in working capital with days of receivable back to normalized levels, delinquency coming down and a sequentially lower effective cash tax rate. As we operate in a more integrated way, our capex reduces as a percentage of revenues and should converge to the midpoint of the guidance range provided in 2022, and all of that still investing in our growth. We are very optimistic with the early results of the commercial cycle for the 2023 school year.\n\nWith the resumption of the in-personal classes and the upbeat momentum for our clients and prospect schools, a portion of the students who dropped out over the last couple of years has started to return to schools, and we are resuming our in-person interaction, visiting schools and hosting in-personal events. I'd like to highlight how important it is to create in -- this trustworthy relationship with our clients to be inside the schools to make ourselves presence. We hosted in the first half of 2022, 163 in-personal events and 75 online events to partner and prospective schools across all brands. We also attended in May, after two years, the largest annual education and technology event in Latin America.\n\nWe were showcasing our solutions in 11 stands from three stands at last event in 2019, generating important leads and even signing contracts during the event. Moving to Slide 17. Despite still early in the cycle, schools' enthusiasm is leading to encouraging preliminary results. On the renewal process, we started to approach schools later than usual this year as our main priority was to deliver the books related to the late enrollments, but now renewals are in line with last year's pace year-to-date.\n\nNew school intake and upsell are also in line with last year's growth base at the same point in time, with supplemental solutions gaining more traction in recent months. Finally, as for our cross-sell initiatives, we have further adjusted incentives and training of our commercial teams this year leading to a relevant improvement in the number of cross-sell contracts originated by referral from Arco's commercial consultants. Cross-sell is a key piece of our strategy, as we have the potential to double our top line with our own base through the sale of additional solutions. We are very confident on our path to the future.\n\nWith that, we conclude our presentation. Operator, we can now open for questions.\n\nOperator\n\n[Operator instructions] First question comes from Lucca Marquezini, Itau BBA. Please go ahead.\n\nLucca Marquezini -- Itau BBA -- Analyst\n\nGood everyone. Thanks for taking our questions. Two questions on our side. The first one would be, can you please provide more color on the efficiency initiatives that allow G&A dilution in the quarter.\n\nWhen should these initiatives be concluded? And then secondly, we've seen a good cash collection in the quarter, which the company attributes to lower delinquency rates. Can you please comment on what has led to this improvement in delinquency? And what should we expect on this front going forward? Thank you.\n\nRoberto Otero -- Chief Financial Officer\n\nHi, Lucca, this is Otero speaking. Thanks for the questions. So starting with G&A. So as we got in the Arco Day last year, we started to operate the company in a much more integrated way, just to give you a few examples, we used to have a few smaller G&A structures distributed across the brands, so across the business units.\n\nSo now we pretty much centralized everything at the holding level to simplify the explanation. So by doing that, we pretty much reduced a lot of the redundancy of functions that was previously distributed across the brands, OK? So this was the first thing. The second thing I would say that we've been operating -- by doing that, we can reduce the level of third-party services. We can reduce corporate personnel.\n\nAnd as a consequence, those lines grow much lower than the top line growth, OK? So we're not doing any massive reduction in those lines, but at the end of the day, they can grow much slower than the overall top line growth. And as a consequence, we dilute the relevance of those lines in the P&L, OK? In terms of delinquency, I think it's a combination of improvement in internal processes and focus on those areas. And also -- schools also operating in a much better environment after COVID, OK? So I think it's a combination of the two factors. At this point, we are running with delinquency better than 2019 levels.\n\nSo that's why I'm saying, I don't think it's 100% attributed to the exit of COVID, but I think there's also an internal improvement in collection, OK? So across all the brands, we are seeing improvement in delinquency. And again, we are running at this point of better than 2019.\n\nLucca Marquezini -- Itau BBA -- Analyst\n\nThat's very clear. Thank you, Otero.\n\nOperator\n\nNext question comes from Marcelo Santos with J.P. Morgan. Please go ahead.\n\nMarcelo Santos -- JPMorgan Chase and Company -- Analyst\n\nHi. Good evening, Ari, Otero, Carina, the whole IR team. Thanks for taking my questions. I have two.\n\nThe first one is regarding, I think, the curves you show on Slide 14, where you showed that the renewals are on track, the pace of new sales are also quite well. I mean if this continues like this, does it mean that you're going to repeat the 32% organic growth in ACV? I mean is this the logical implication of this chart? Are you more positive now than what you were like a couple of months ago after you're seeing this beginning of this intake cycle? This is question number one. And question number two, it's more related to the margins for the next cycle. Considering that during this cycle, you had this delay in orders in April, which caused you to print materials in nonoptimal way, you had to pay extra shipping, so this had a negative impact on your margins.\n\nAssuming that you don't have the same thing next year, would it make sense for us to expect a couple of -- some margin expansion on the base case for next year? That -- these are the questions. Thank you.\n\nRoberto Otero -- Chief Financial Officer\n\nHi, Marcelo, Otero here. Thanks for the questions. So I mean as you said, the commercial cycle is performing very well so far. We're still in the middle of the game, OK, so we still have a long way ahead of us.\n\nBut the early signs, they are quite promising, OK? So as we said, on the renewal front, it started slightly later than in previous years mostly because of the late orders as schools pretty much waited for those to be delivered to start renewing contracts for next year. At this point, were in line with the previous year in terms of renewal rates, but our goal is to bring a better number versus last year, OK? On the new school intake, we are seeing very encouraging signs so far across all brands in both core and supplemental. As you said, I mean, growth rates seem very similar to the 2022 sales cycle so far. But this is a moving line, right? So we cannot guarantee that we'll grow at the same pace of last year, OK? So it's a stronger base of comparison.\n\nBut again, the early signs are quite encouraging at this point. Moving to your second point, in terms of the impacts on the cost of product and the margin for next year. So just to give a bit more color on that. So we witnessed a relevant number of late orders coming in this cycle much later than the usual, OK? So this was a direct consequence of decisions coming back after the two years of the pandemic.\n\nSo this led to a significant volume of content to be printed and delivered to schools quickly to avoid these incidents starting this school year with our content. The marginal cost of printing in smaller volumes tends to be significantly higher, OK? And the freight methods we had to choose were also more expensive, such as air freight. It's also important to remember that we don't carry inventory of product for one year to another as we update the content pretty much every year. So we needed to print a new content for every new student that are enrolled later in our partners schools, OK? This is not something that should be repeated, OK, in the second half of the year.\n\nWe don't expect to see this huge surprise in late orders for 2023, especially because these schools are operating in a much more stable way and with much more visibility for the next year, OK? So we don't expect those surprising -- to affect our profitability next year. Of course, we have inflation as a threat for 2023. This was one of the reasons why we have intensified the efficiency agenda internally. And as Ari mentioned in his closing remarks, we have also hired a custodian firm to help us not only accelerate but better structure this efficiency agenda internally, OK? So at this point, we don't see any cost pressure bringing risks to our profitability next year, OK?\n\nMarcelo Santos -- JPMorgan Chase and Company -- Analyst\n\nOK. Perfect. I was actually thinking an upside risk because you wouldn't have the cost, so -- but that was the question.\n\nRoberto Otero -- Chief Financial Officer\n\nIt's a possibility, Marcelo.\n\nMarcelo Santos -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nNext question comes from Vitor Tomita with Goldman Sachs. Please go ahead.\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nHello, good evening all, and thanks for taking our questions. A couple of questions from our side. The first one would be whether -- how -- basically, how you see the potential for revenue in this school cycle to actually beat ACV given the strong revenue recognition in the second quarter and students having enrolled late throughout the year. This would be our first question.\n\nAnd our second question related to Marcelo's is how well have you been able to pass inflation through to schools in renewal negotiations so far, which is a factor that, as you said, should have some influence on margins? Thank you.\n\nRoberto Otero -- Chief Financial Officer\n\nHey, Vitor, Otero here. Thanks for the question. Pleasure to speak to you. So on the first one, at this point, we cannot guarantee that we'll beat the ACV conversion into revenues.\n\nI would say that given the visibility that we have at this point, 100% is what we can provide to the market as the better guidance at this point, OK? So we have no indication of missing this 100%, but at this point, it would be responsible to guide for a beat. On the second point, regarding pricing, I mean, we are working for next year to be able to pass through real price gains, OK, considering the forecast inflation for 2023. We're not sure how much this forecast is accurate or not, right? How much is it going to prove accurate or not, but we are working to bring 2 to 3 percentage points of real price gains considering inflation next year at 8%, OK? So this is the internal goal are working right now. And I mean at this point, we have renewed pretty much half of the contracts for next year, and this price increase has been well received by schools.\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nVery clear. Thank you very much.\n\nOperator\n\nNext question comes from Mirela Oliveira with Bank of America. Please go ahead.\n\nMirela Oliveira -- Bank of America Merrill Lynch -- Analyst\n\nGood evening, everyone. So just two follow-ups here. We've seen other players investing on payment solutions and core management tools. Do you guys have participation on ISAAC, which provides this type of solution? And also, you have Arco Pay.\n\nCould you guys give us some color on the perspective for the segment, if it makes sense for us to think on a unified for coming from these two projects? And second question, if you guys could just give us a view on the [Inaudible] convertible debt. With the stock at current levels, is this something that raises any concern given the convertible -- the conversion price is at $29? If you guys could comment a little bit on that.\n\nRoberto Otero -- Chief Financial Officer\n\nHi, Mirela, Otero here. Thanks for the questions. So yeah, I mean, we think more and more schools are open to partners -- to provide services that go beyond pedagogical services. And we think that the reputation that we have, how intense our relations are with these schools and for how long those relations have been in place put us in a very good position to be able to go beyond pedagogical services.\n\nThis does not necessarily mean financial services, but definitely beyond pedagogical, OK? So this is part of the strategy. As you said, we have Arco Pay in operation right now, and we also have a minority investment in ISAAC. So we have two feet, right, on this strategy. And so far, this has been working well, OK? I would say that more and more, we build conviction that being a one-stop shop platform for schools makes a ton of sense.\n\nOn your second point regarding the convertible, I would say that we are not concerned, honestly. I'd say beyond the convertible, those are very important partners to us. So I think it goes beyond just the financial instrument. It's a very long duration instrument as well.\n\nSo at the end of the day, I think we have a very long path ahead of us, and we are super excited with the years to come, and we're sure that whenever the market conditions improve, this will be reflected in the share price. So we prefer not to spend a lot of attention/concern with that. We'll continue to work here, and we're sure that things will reflect at the right time, OK?\n\nMirela Oliveira -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. Very clear. Thanks, Otero.\n\nRoberto Otero -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] At this time, we have no further questions in the queue. [Operator signoff]\n\nDuration: 0 minutes\n\nCarina Carreira -- Director, Investor Relations\n\nAri de Sa Cavalcante Neto -- Chief Executive Officer\n\nRoberto Otero -- Chief Financial Officer\n\nLucca Marquezini -- Itau BBA -- Analyst\n\nMarcelo Santos -- JPMorgan Chase and Company -- Analyst\n\nVitor Tomita -- Goldman Sachs -- Analyst\n\nMirela Oliveira -- Bank of America Merrill Lynch -- Analyst\n\nMore ARCE analysis\n\nAll earnings call transcripts"
}