{
  "companyName": "DHT Maritime",
  "companyTicker": "DHT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/dht-maritime-dht-q2-2022-earnings-call-transcript/",
  "content": "DHT Maritime (DHT 0.45%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the Q2 2022 DHT Holdings, Inc. earnings conference call. [Operator instructions] I would now like to turn the conference over to your speaker today, Laila Halvorsen.\n\nPlease go ahead.\n\nLaila Halvorsen -- Chief Financial Officer\n\nThank you. Good morning, and good afternoon, everyone. Welcome, and thank you for joining DHT Holdings' second quarter 2022 earnings call. I am joined by DHT's president and CEO, Svein Moxnes Harfjeld.\n\nAs usual, we will go through financials and some highlights before we open up for your questions. The link to the slide deck can be found on our website, dhtankers.com. Before we get started with today's call, I would like to make the following remarks. A replay of this conference call will be available at our website, dhtankers.com, until August 18th.\n\nIn addition, our earnings press release will be available on our website and on the SEC EDGAR system as an exhibit to our Form 6-K. As a reminder on this conference call, we will discuss matters that are forward-looking in nature. These forward-looking statements are based on our current expectations about future events as detailed in our financial report. Actual results may differ materially from the expectations reflected in these forward-looking statements.\n\nWe urge you to read our periodic report available on our website and on the SEC EDGAR system, including the risk factors in this report for more information regarding risks that we face. The company continued to show a very strong and healthy balance sheet, and the quarter ended with 106 million of cash. At quarter end, the company's availability under both revolving credit facilities was 188 million, putting total liquidity of 294 million as of June 30th. Financial leverage is about 28% based on market values for the ships.\n\nAnd net debt per vessel was 15.7 million at quarter end, which is well below current scrap values. Looking at the P&L highlights, EBITDA for the second quarter was 32.5 million. And net income came in at 10 million equal to $0.76 per share. The result includes the gain related to sale of vessels and a noncash gain in fair value related to interest rate derivatives.\n\nThe company continues to -- continues with a good cost control with opex for the quarter at 18 million, equal to $7,800 per day and G&A for the quarter at 4.2 million. In the second quarter, the company achieved an average TCE of $24,300 per day with a vessel's time charter earning $33,800 per day, and the vessels in the spot market earning $21,200 per day. For the third quarter, 68% of the available days have been booked at an average rate of $23,600 per day. And 58% of available spots have been booked at an average rate of $18,400 per day.\n\nWe sold two vessels during the quarter, DHT Hawk and DHT Falcon, for 40 million and 38 million, respectively. The sales generated a combined gain of 12.7 million. In connection with the sales, we repaid outstanding debt on the two vessels of 13.3 million. Both vessels were delivered during the second quarter, and net proceeds amounted to 62.9 million.\n\nFollowing these sales, the average age of our fleet has been reduced and our AER and EEOI metrics improved. Part of the net proceeds were used to reduce debt. In June, we prepaid 23.1 million under the Nordea credit facility. The voluntary prepayment was made under the revolving credit facility tranche and may be reborrowed.\n\nOn the next slide, we present the cash bridge for the quarter. We started the quarter with 58.6 million of cash which generated 32.5 million in EBITDA. Ordinary debt repayment and cash interest amounted to 9.1 million, while 19.2 million was allocated to shareholders through share buybacks and dividend payment; $4.5 million was used for maintenance capex following net proceeds from the sale of vessels amounted to 62.9 million; 23.1 million, as was mentioned on the previous slide, used to prepay long-term debt; 8.3 million was the initial cash recognition from [Inaudible]; and we ended the quarter with 105.8 million of cash. Switching now to capital allocation.\n\nDuring the second quarter, the company purchased 2.8 million of its own shares, equal to 1.7% of the outstanding number of shares as of March 31st for an aggregate consideration of 15.9 million. In addition, the company will pay a dividend of $0.04 per share for the quarter. It will be payable on August 30th to shareholders of record as of August 22. This marks the 50th consecutive quarter cash dividend.\n\nWith that, I'll turn the call over to Svein.\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nThank you, Laila. Following the share repurchases conducted during the second quarter, as discussed by Laila, we continue to buy back stock after the quarter end under the 10b5-1 rule. Our third quarter to date acquired 1.5 million shares at an aggregate cost of 8.8 million at an average price of $5.87 per share. Considering buybacks conducted in 2021 and buybacks made year to date, we have in total bought back close to 10 million shares, equaling some 6% of the company's capital.\n\nWith a total consideration of 57 million, the average price of these repurchases is $5.77 per share. We consider this to be a great and an accretive investment. And all shares have been retired upon receipt. During the quarter, we agreed to refinance the bilateral credit facility for the DHT Tiger with the existing lender, Credit Agricole.\n\nThe structure is in line with the DHT's fund financing; 37.5 million made up of 2.5 million per year of the remaining life of the ship. It has six-year tenor and 20-year repayment profile. The pricing represents a new low for DHT's borrowing cost at the secured overnight financing rate, also referred to as a SOFR, plus a margin of 2.05%. It includes a historical credit adjustment spread of 26 bps between SOFR and LIBOR, as this is a new structure that will replace LIBOR.\n\nYou should note for reference that this pricing is equal to or LIBOR plus a margin or 179 bips. We typically have a mix of spot and fixed employment for our fleet. However, it is not formulaic with the percentage of the fleet employed one way or another but the focus on the nominal rates and tenors that, in our view, will contribute meaningfully to the business. We have entered into a five-year time charter for the DHT Osprey at $37,000 per day.\n\nDelivery is planned for August, and the customer has options to extend for an additional two years at 40,000 and 45,000 per day, respectively. The key attraction to this time charter is the tenure, as we would not find this rate attractive for a two or three-year charter. We see an increased level of inquiries for time charters and will selectively engage with our customers, if and when meaningful business can be conducted. We have committed 25 million to retrofit our additional 8 ships with scrubbers.\n\nThe combination of decreased scrubber costs, early delivery of equipment, and continued elevated spreads between heavy fuel oil and very low-sulphur fuel oil makes this a compelling investment in our view. Considering the current average spreads in Fujairah & Singapore, the payback on these investments should be inside a year. The work will commence in the fourth quarter, and we expect completion during the first quarter of next year. We plan to take each ship out of service for 30 days give or take.\n\nThis is a highly efficient schedule that will be executed by our experienced team at one of our go-to shipyards. Upon completion, we will have a total of 23 vessels fitted with scrubbers. With these additions, expect it to boost earnings for the company. So, to sum it all up, we continue to stay disciplined, focusing on execution of our business model and strategy.\n\nThis includes key building blocks in delivering value for our shareholders. We are well-structured for cyclical markets with probably the strongest balance sheet among the peer group. Ample liquidity, enabling us to invest in the business and act on opportunities should they arise, all with robust downside protection without having given away the upside. The tanker market recovery has started.\n\nAnd we are tuned for this recovery through our actions and structure to create value. This includes a reduced number of outstanding shares through buybacks and an expanded and fast-track scrubber program that will boost earnings. We have substantial operating leverage in the business, combined with a significant capital distribution potential. And with that, we open up for questions.\n\nOperator?\n\nOperator\n\n[Operator instructions] We will now take the first question. And the first question comes from the line of Omar Nokta from Jefferies. Please go ahead. Your line is open.\n\nOmar Nokta -- Jefferies -- Analyst\n\nThank you. Hi, Svein. Hi, Laila. Good afternoon.\n\nYeah, I just wanted to ask, Svein, you sort of touched on the, you know, five-year contract and the durations that made it so compelling. You know, clearly, we haven't seen this much sort of time charter activity or at least that type of duration for the past, I don't know, several years or at least, I would think, a decade-plus. How would you characterize the liquidity in the charter markets today? As you mentioned, the recovery has begun. We haven't necessarily seen a resurgence in VLCC spot rates.\n\nBut how would you say the time charter market is at this point?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nThe liquidity for this sort of tenor really is very, very thin. But there is quite a few clients asking for one, maybe two years, and also want a lot of options for sort of shorter durations. We don't find that very attractive. And we are very constructive on what to expect for next year in '24.\n\nObviously, beyond that, it's always hard to sort of have a specific number. Hence, we found this five-year charter to be attractive. There are some additional discussions or incoming discussions to us. So, you know, it could be that we, over time, will build more fixed income.\n\nBut hopefully, that will be at increased rates going forward, and it will also maybe be with forward delivery. So, let's see. But to your point, liquidity is thin for now, so --\n\nOmar Nokta -- Jefferies -- Analyst\n\nOK. All right. Thank you. And then, just a follow-up sort of maybe a bit more broadly on the market itself.\n\nYou know, e've seen clearly the midsized crude tankers and the product tankers lifted, as you highlighted in the release. On the VLCCs, can you give maybe a sense of just how the market here recently, maybe within the past, call it, four to six weeks, how that's been developing in terms of what you're seeing from your lens in terms of activity levels out of maybe -- out of the Middle East and then maybe the Atlantic Basin?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nSo, the market is clearly on the rise, and the rates are moving up. So, the sort of latter part of what we have booked are at higher rates than the earlier part. We are in discussions as we speak, negotiating spot voyages at the rate meaningfully higher than what we have on average booked quarter to date. And this looks to be robust.\n\nIt's not like a fast-moving super volatile, you know, change in rates, as you can see on smaller ships, but it's certainly going in the right direction. And there is a mix of inquiry from both in the Atlantic and in Asia. I think a key point here is that, you know, oil has been steeply backwardated for quite a while. And the backwardation between the fourth quarter this year and fourth quarter next year is about half in the last few weeks.\n\nAnd this will enable more Atlantic barrels to go long haul into Asia. And we see some of that already and some requests to load in the U.S. and then to discharge in Asia. And of course, this will certainly be good for our markets.\n\nOmar Nokta -- Jefferies -- Analyst\n\nOK. Thank you for that color, Svein. I'll turn it over.\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We will now take the next question, please standby. And the next question comes from the line of Frode Morkedal from Clarksons. Please go ahead.\n\nYour line is open.\n\nFrode Morkedal -- Clarksons Platou Securities -- Analyst\n\nThank you. Hi, Svein. Regarding the final comment you made on the backwardation, actually I read the IEA report this morning, and they now actually predict global inventory build of close to a million barrels a day in the second half of this year, and a half a million barrels in the first half of next year. To me, this seems to be very positive for tankers.\n\nBut I just wanted to hear from you, how you would expect this to be impacting the tank market dynamics going forward.\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nWe certainly agree with you. So, we think that the inventory cycle is the key metric in understanding the tanker cycle. And as you all know, the oil inventories have been brought down over many, many years now. You know, at some point, there has to be more feedstock, we spoke about this on our prior call and also during Marine Money conference.\n\nSo, we certainly think this is a positive. There will likely be more new ones or more supply, if you like, into the refineries, and this should certainly be good for large tankers. VLCCs are really, you know, the real workhorse of the crude market. VLCCs have on average handle about 46%, 47% of all crude being transported.\n\nAnd with Atlantic still being long oil and the big demand picture being in Asia, this is truly VLCC business from a fundamental perspective. So, although, of course, some of the smaller ships will still enjoy benefits from the disruptions, we are seeing following volatilities between Russia and Ukraine. But overall, we are very constructive on this period going forward.\n\nFrode Morkedal -- Clarksons Platou Securities -- Analyst\n\nAgree. Yeah, you've been buying back shares and now announced investment in your own ship with scrubbers, which makes totally sense to me. That's great. On the scrubbers, I'm curious to know if there's been any development in the technology since you last did the retrofits.\n\nSeems to me to be a quite good price versus the obvious benefits.\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nNo, it's not really in the development. The scrubbers are fairly simple. These are essentially washing machines or the model of washing machines with the capacity to handle sort of 30,000 cubic meters of water per day, a handy sized tanker, right? So -- but the cost of building them has come down. I don't think, you know, the cost for the producer, very much higher a few years back, but it was a new thing.\n\nIt was very sort of high-top, and they probably had higher profit margins on them. So, they are available to us now at one of our two key suppliers at a much lower cost than what we did last time. So, 2025, here, you will see that we budget just over 3 million per ship to do this, right, which is a significant improvement in the capex. So, our technology is basically the same.\n\nSo, there's no change.\n\nFrode Morkedal -- Clarksons Platou Securities -- Analyst\n\nPerfect. Thank you. That's it.\n\nOperator\n\nThank you. We will now take the next question. And it comes from the line of Jim [Inaudible] from FactSet. Please go ahead.\n\nYour line is open. Jim [Inaudible] from FactSet, please. We will go to the next question. Please standby.\n\nAnd it comes from the line of Jon Chappell from Evercore. Please go ahead. Your line is open.\n\nJon Chappell -- Evercore ISI -- Analyst\n\nThank you. Laila, can I start with just a couple of modeling questions for you? First of all, my apologies, I missed the spot today. I thought I caught 18,400 for the third quarter. Is that correct? And what percentage is that for?\n\nLaila Halvorsen -- Chief Financial Officer\n\nJust the spot?\n\nJon Chappell -- Evercore ISI -- Analyst\n\nYes, just the spot part.\n\nLaila Halvorsen -- Chief Financial Officer\n\nYeah. So, the -- yeah, the spot was 58% at 18,400.\n\nJon Chappell -- Evercore ISI -- Analyst\n\nOK. Thank you. And then, Svein, you said 30 days roughly for the scrubber retrofittings, should we assume four in the fourth quarter, four in the first? And then my other question regarding to the scrubbers' new model is, how should we think about the depreciation of those? How much will it reset the depreciation higher once completed?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nSo, it's exactly which day we will enter this will depend a bit how we schedule the ships in the spot market, and we want to discharge as close to the yard as possible. So, if we can do six ships in the fourth quarter, we will do it in the fourth quarter. But -- so it's a bit hard to say this, Jon. So, sorry not being able to be more precise, but we are very confident in the fourth and the first quarter schedule.\n\nSo, you know, you will sort of be at limited to do this the way you want, but we can't give you a more precise guidance, I'm afraid. But equipment is ready, and the yard is ready. So, if we can do it sooner, we will do it sooner. But if we want to optimize the fleet to get as little off-hire and positioning cost as possible, it might be, you know, dried out.\n\nIt will not be beyond the first quarter. On the -- yeah, on the depreciation profile, we will communicate this quarter on the third quarter results. But I think it's a reasonable lead to look at what we did last time, which was a three-year depreciation profile. But it's not finalized yet, so --\n\nJon Chappell -- Evercore ISI -- Analyst\n\nOK. And then final bigger picture question. I mean, we talked about this last quarter sign on the deployment of cash as it comes in. It seems asset values have moved and at least in the situation with the VLCCs far before the rates have themselves.\n\nSo, ships was an attractive investment, maybe six to nine months ago. Just mathematically, they're probably even less so today. You've made significant headway with the buyback, and there's a ways to go there, clearly. Would you say that at this point, you remain firmly in that your stock is less than NAV and capital return is the top priority of cash? Or do you think that at a certain point, you have to start pivoting to thinking longer term and start making investments in assets even if the rates don't necessarily catch up to the asset values in the short term?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nI think, you know, when it comes to investments, we are not excited about the current trial values from a buying perspective. So, you know, it has to be a very special opportunity if we are going to buy something. When it comes to buying back our own stock, of course, NAV is also a moving element there. So, we are very happy with what we have done all sort of below $6 mark and which compares well to where the stock is trading today.\n\nBut as I think everybody knows, our capital allocation policy stayed minimum 60% of ordinary net income to be distributed. It could be that we will reduce the debt level even further. So, I think those are sort of the key metrics. But I don't think you should expect us to one, buy ships in the current valuations; and two, we will probably not buy stock at the current level side.\n\nWe will leave that to our investors and then focus on returning money to shareholders in the sort of future.\n\nJon Chappell -- Evercore ISI -- Analyst\n\nOK. My last one is kind of a follow-up to that last point. You know, a $0.04 dividend is certainly off your minimum, so to speak, of $0.02, and in a quarter where if we take out gains, it was still a loss. So, should we think about now, as we're in the early stages of a recovery, assuming all else stays the same, is $0.04 kind of the new base dividend and then we'll transition to that minimum 60% payout once you're more sustainably in the profitability?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nNo. You know, the 60% in this quarter is actually based on the net income reported. Because compared to some of our peers, we don't exclude sort of elements in the P&L that is cash inputs, such as the sale of a ship profit. We tend to include that when we consider the dividend.\n\nSo, for us, this is just the way we've always done it. So, it's not a new law. It's just a pure reflection of what was the income for the quarter.\n\nJon Chappell -- Evercore ISI -- Analyst\n\nOK. That makes sense. Thank you, Svein. Thanks, Laila.\n\nOperator\n\nThank you. We'll now take the next question. And the next question comes from the line of Anders Karlsen from Kepler Cheuvreux. Please go ahead.\n\nYour line is open.\n\nAnders Redigh Karlsen -- Kepler Cheuvreux -- Analyst\n\nThank you. A quick question on your fleet. I mean, you sold in 2006 and 2007 built ship. You have more or less to the same ones.\n\nWith the firming market, are you considering more sales? Or is that off the table now?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nI think for now, we will be very selective. It could, of course, be that we elect to sell one or two ships. But I think we'd like to see, in particular for the scrubber, 50 units appreciation in both asset values but also have these ships give them the opportunity to earn money, which we expect them to do. So, I don't think you should plan for our fleet to be much smaller than what it is today.\n\nAnders Redigh Karlsen -- Kepler Cheuvreux -- Analyst\n\nOK. And then just a quick one on the market. You were mentioning backwardation as one factor that is holding back. What other important drivers do you see in the short term here?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nOf course, there is supply. So, OPEC is a bit tight on handing more oil into the market. Their key argument is that they feel that they're sort of meeting current amount. And they are questioning the macroeconomic picture.\n\nI think these last couple of days, we've seen some pivots here and there, suggesting that inflation might sort of be leveling off and maybe getting some ease to some of the prior macroeconomic concerns. If that is the case, you know, maybe we'll have more oil to the market. But I think that's been the key reason holding things back is that OPEC has been tight, which we assume is they wanted to enjoy the ride of the strong prices for as long as they can.\n\nAnders Redigh Karlsen -- Kepler Cheuvreux -- Analyst\n\nOK. Thank you. And then just a final question on -- have you seen any pool from the EU in terms of building inventory -- I mean, from an energy security perspective? I guess, EU is short energy and would require to build substantial inventories of everything they can get their hands on. So, have you seen any signs of that, Svein?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nNo, I can't say I've seen that. So, of course, the gas has been more of a hot topic for Europe because oil is not really used so much for heating or for energy production, right? It's more for transportation and for petrochemicals.\n\nAnders Redigh Karlsen -- Kepler Cheuvreux -- Analyst\n\nYup.\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nSo, I think there are other areas where you've seen this focus.\n\nAnders Redigh Karlsen -- Kepler Cheuvreux -- Analyst\n\nOK. Thank you. That's all for me.\n\nOperator\n\nThank you. We will now take the next question. Please stand by. Next question comes from the line of Climent Molins from Value Investor's Edge.\n\nPlease go ahead. Your line is open.\n\nCliment Molins -- Value Investor's Edge -- Analyst\n\nGood morning, and thank you for taking my questions. I wanted to ask about the disruptions you're seeing from the sanctions in Russia. The effect mostly revolve around smaller vessels, considering VLCC's heading to Russia's Western ports. But could you provide some commentary on the ship-to-ship transfers and their effect on the overall market?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nWe are not involved in those types of operations, but we are aware that they've been taking place in the Atlantic Basin. So, there's been, say, Aframax is coming out of the Baltic, and Black Sea could also potentially use Suezmax's, but this is mainly, we think, is a Baltic business. And then, we load it on to the VLCCs and then transport it to the Far East and China, in particular, being the destination. But to our knowledge, it's not a huge business tying up with many, many ships.\n\nThere's been, you know, a few of these transactions being done. So, it's a bit on the sideline of the conventional market.\n\nCliment Molins -- Value Investor's Edge -- Analyst\n\nAll right. That's helpful. And considering the high energy prices in Europe, do you expect to see any additional crude import substitution for natural gas volumes during this coming winter?\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nIt could, of course, happen. So, there are some suggestions that the fuel oil will be used for heating this winter. But we haven't seen any sort of clear evidence of it or at least not to our knowledge. But I think this will be defined also by the cost differential between heating oil and gas.\n\nCliment Molins -- Value Investor's Edge -- Analyst\n\nAll right. That's all for me. Thank you very much for taking my questions.\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] We will now take the next question. It comes from the line of Michael [Inaudible] from MRM Capital. Please go ahead. Your line is open.\n\nUnknown speaker\n\nQuestion answered. Thank you.\n\nOperator\n\nNo problem. Thank you. There are no more questions at this time. I would like to hand the conference back to the speakers for final remarks.\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nWell, thank you to everyone who's been on the call and are following DHT. That's greatly appreciated, and wishing all of you a good day ahead.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLaila Halvorsen -- Chief Financial Officer\n\nSvein Harfjeld -- Co-Chief Executive Officer\n\nOmar Nokta -- Jefferies -- Analyst\n\nFrode Morkedal -- Clarksons Platou Securities -- Analyst\n\nJon Chappell -- Evercore ISI -- Analyst\n\nAnders Redigh Karlsen -- Kepler Cheuvreux -- Analyst\n\nCliment Molins -- Value Investor's Edge -- Analyst\n\nUnknown speaker\n\nMore DHT analysis\n\nAll earnings call transcripts"
}