{
  "companyName": "Paychex",
  "companyTicker": "PAYX",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/28/paychex-payx-q1-2023-earnings-call-transcript/",
  "content": "Paychex (PAYX -0.77%)\nQ1 2023 Earnings Call\nSep 28, 2022, 9:30 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to the Paychex first quarter FY '23 earnings conference call. [Operator instructions] Please note this call may be recorded. It is now my pleasure to turn today's program over to Martin Mucci, chairman and chief executive officer of Paychex. Please go ahead.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nThank you, Gretchen, and thank you for joining us for our discussion of the Paychex first quarter fiscal '23 earnings release. Joining me today are John Gibson, our president and chief operating officer; and Efrain Rivera, our chief financial officer. I do want to start out by saying that all of us are thinking of everyone in the path of Hurricane Ian that is approaching Florida at this time. Certainly, our employees, our clients and everyone else in those areas, we hope are safe.\n\nThis morning, before the market opened, we released our financial results for the first quarter ended August 31, 2022. You can access our earnings release on our investor relations website. Our Form 10-Q will be filed with the SEC within the next few days. And this teleconference is, of course, being broadcast over the Internet and will be archived and available for approximately 90 days.\n\nWe'll start today's call with an update on business highlights for the first quarter. Efrain will then review our financial results and outlook for fiscal 2023, and then we'll open it up for your questions. I will start out by acknowledging that this will be my last earnings call as -- in my role as CEO of Paychex. On August 24, we announced I'm retiring as CEO effective October 14.\n\nThat's after our 2022, fiscal 2022 annual meeting of stockholders. However, I will remain in my role as chairman of the board. John Gibson, on the call today, our current president and chief operating officer, will assume the role of president and CEO. John has been a member of the executive leadership team since 2013 and has been instrumental in the success of Paychex during his tenure.\n\nWe have executed on a long-term succession plan, and I'm confident that John is the right person to lead Paychex into its next phase of growth. Really many best days ahead of us. I want to thank all of you also, you directly, for your interest in coverage of Paychex, some of you for more than two decades and for your good questions and feedback over my 12 years as chief executive officer. I also want to publicly thank Efrain.\n\nEveryone knows he's one of the best CFOs in the business, and we've done over 40 quarterly calls together. And more than any -- more than a CFO, Efrain has really been a leader on our executive team and who provides not only great counsel, but is known for his intelligence, his integrity and also music trivia. You can try that out on some time. Fiscal 2023 is off to a great start with a double-digit growth in both revenue and earnings compared to the same quarter last year.\n\nWe have a record level of first quarter sales with strong trends continuing in the mid-market, retirement and HR outsourcing in particular. We have had continued success in the selling of our suite of innovative products from HCM technology to HR solutions that help businesses become more efficient and address complex HR issues in a challenging time for many businesses. We continue to regularly monitor our key leading indicators for signs of changes to the macroeconomic trends. And while we have seen some moderation in key issues, we have not yet seen any significant changes.\n\nAs an example, the latest Paychex IHS small business employment watch showed that workers of U.S. small businesses continue to benefit from higher wages. New jobs continue to grow but at a more moderated pace, and job growth at U.S. small businesses remains resilient even in the face of a tight labor market and inflation pressures.\n\nEmployment levels at our existing clients have continued to increase as they're finding more people to fill those positions, consistent with these findings of our HR -- of our small business index. I will now turn the call over to John, and he will provide you with some highlights surrounding our technology and product suite and results. John?\n\nJohn Gibson -- President and Chief Operating Officer\n\nOK. Thank you, Marty, and good morning, everyone. It's a pleasure to be with you. Based upon our recently released Pulse of HR survey, it's obvious that businesses of all sizes continue to be challenged with attracting and retaining talent, improving their operational efficiency and working to increase their financial flexibility.\n\nOur continued investments in innovative HR technology, combined with our unmatched HR expertise, truly and uniquely positions us to help small businesses and mid-sized businesses navigate a very dynamic and challenging environment. Earlier this month, we attended the annual HR technology conference in Las Vegas, where once again, Paychex demonstrated the latest of our innovations. We showcased significant enhancements to the Paychex flex recruiting and applicant tracking experience, which is designed to digitally deliver candidates to clients faster and allow them to leverage mobile technology to recruit, screen and then onboard candidates in a unified and simple-to-use experience. Already, our digital onboarding experience was utilized by over 1.7 million new hires in the last year alone.\n\nWe also introduced our latest innovation, Paychex voice assist. And really, this is a natural extension of the expansive and ever-growing and utilized self-service capabilities that we have at Paychex. And coupled with our award-winning Paychex pre-check offering, which allows employees to further participate in the payroll process by reviewing their gross to net payroll calculations prior to payroll processing, Paychex voice assist now enables HR and payroll administrators and small business owners to manage their payroll and HR tasks while on the go through any Google Assistant-capable device. This provides a hands-free experience that includes voice recognition and verification security.\n\nI'm proud that Paychex is the first HCM solutions provider to offer voice-activated capabilities such as these. Our technology offerings continue to garner national recognition. Paychex is proud to be recognized for the sixth, I repeat, the sixth, consecutive year by NelsonHall, a global analyst and research firm, and it positioned us as a leader in its 2002 NEAT report for service providers. Paychex flex was recognized for its comprehensive technology as one of the most advanced HR platforms that brings the power of benchmarking, data analytics as well as digital service enablement to drive operational efficiency and improve the employee experience.\n\nI also want to mention that we have once again, for the 12th consecutive year, been recognized as the nation's largest 401(k) recordkeeper by total number of plans by PLANSPONSOR magazine. We were also recognized by them as an industry leader in the number of new plans that we added in 2021. It's obvious that our retirement business continues to be an area of strength for us as many business owners and their employees are focused on financial wellness as a key benefit and issue. In addition, our Pooled Employer Plan offering continues to gain traction in the marketplace with approximately 4,000 new plans onboarded during the first quarter alone.\n\nWe continue to see strong demand for our Employee Retention Tax Credit service. This helps clients maximize their eligible tax credits and thus, provide them more financial flexibility. To date, we have helped over 45,000 clients secure over $8.6 billion, that's $8.6 billion, in combined ERTC and paid leave tax credits. We continue to have the opportunity to educate more of our existing clients on the benefit of this service as well as leverage the service to attract new clients.\n\nWe have started off the fiscal year '23 strong. And while there is uncertainty in the macro environment, our solutions and business model have in the past and continue today to prove their resilience. We help our clients to succeed under any macroeconomic conditions. We continue to focus our product road map on the needs of our clients and anticipate releasing further enhancements this fiscal year designed to continue to provide them a positive digital user experience and help them utilize HR technology to simplify their processes.\n\nNow, before I turn the call over to Efrain, I'd like to take a moment to say thank you, and yes, Marty, you're going to continue to hear this over and over again over the next couple of weeks. But I want to say thank you to Marty for his tireless dedication and strong leadership of the company over the years. And for me, personally, for his mentorship and his friendship for the nearly decade that he and I have been working together. Under Marty's tenure as CEO, Paychex has more than doubled its revenue and transformed into a leading HCM technology solutions company.\n\nToday, Paychex is a tech company, and it's a tech company because of Marty's vision and his leadership. Marty, it's been a pleasure to work alongside you, the leadership team and the nearly 17,000 now employees of Paychex, and I look forward to continuing our relationship in our new roles. As I've said many times and to many people, we're the same great company. It's the same great leadership team.\n\nIt's the same great employees. We're just each playing a little different roles as we move forward. I know that our collective focus on our purpose, which is to help small and mid-sized businesses succeed, will continue to drive us in the future as it has in the past. I'll now turn the call over to Efrain to discuss our first quarter financials.\n\nEfrain Rivera -- Chief Financial Officer\n\nThanks, John, and good morning. I'd like to remind everyone that today's commentary contains forward-looking statements that refer to future events and, therefore, involve risks. Refer to the customary disclosures. Let me start by providing key points for the quarter and finish with a review of fiscal 2023 outlook.\n\nAs Marty and John already mentioned, Q1 was strong. Our financial results for the first quarter included service revenue and total revenue that increased 11% to $1.2 billion. Management solutions revenue increased 12% to $906 million driven by higher client employment levels and revenue per client. Revenue per client was positively impacted by additional product penetration; HR ancillary services, largely our ERTC product; and price realization.\n\nWe continue to see strong attachment of our HR solutions, retirement and time and attendance solutions. I'll note that the revenue from our ERTC service benefited our first quarter revenue by about 1% to 2%. While we had anticipated ERTC revenue would continue in fiscal 2023, strong execution both in sales and service allowed us to realize some of the revenue a bit earlier in the year. While ERTC was a tailwind to growth for the first quarter, its benefit will decline as the year progresses.\n\nFor the full year, the impact will be marginal to growth. PEO and insurance solutions revenue increased 8% to $283 million driven by growth in average worksite employees and PEO health insurance revenue. The rate of growth was tempered by a lower rate of health insurance enrollment in both the PEO and the insurance agency, together with continued softness in workers' compensation rates. So that really is a little bit more focused that the insurance agency has more of an impact on the revenue there.\n\nInterest on funds held for clients increased 24% for the quarter to $18 million primarily due to higher average interest rates along with growth in investment balances. Total expenses increased 11% to $711 million. Expense growth was largely attributable to higher headcount, wage rates and general cost to support growth in our business. In addition, PEO direct costs increased due to higher medical plan enrollments compared to the same period last year.\n\nOp income increased 12% to $496 million with an operating margin of 41.1%, an expansion of 20 basis points over the prior year, a bit above where we anticipated it being in the first quarter. Our effective tax rate for the quarter was 22.9% compared to 24.9% in the prior-year period. Both periods reflect discrete tax benefits related to employee stock-based comp payments. However, the prior year also reflected an increase in state taxes.\n\nNet income and diluted earnings per share both increased 14% to $379 million and $1.05 per share, respectively. Adjusted net income increased 15%, and adjusted diluted earnings per share increased 16% for the quarter to $372 million and $1.03 per share, respectively. Our financial position remains strong with cash, restricted cash and total corporate investments of $1.3 billion, and our borrowings are at approximately $800 million as of the end of the quarter. Cash flow from operations was $364 million during the first quarter, a small decrease from the prior driven by fluctuations in working capital partially offset by higher net income.\n\nAnd we paid out quarterly dividends at $0.79 per share for a total of $285 million in the first quarter. Our 12-month rolling return on equity was a stellar 46%. Now, I'll turn to our guidance for the current fiscal year ending May 31, 2023. Our current outlook incorporates our first quarter results and our view of the evolving macroeconomic landscape.\n\nOne thing I want to emphasize as I walk through the guidance. We don't provide quarter-to-quarter guidance. What we try to do is give you a sense of where we anticipate the quarters will fall. So I'd ask that you keep that in mind.\n\nThe majority of our guidance remains unchanged from that provided in June with the exception of an increase in our expected growth for adjusted earnings per share. Let me provide some color in certain areas as follows. Management solutions revenue is expected to grow in the range of 5% to 7%, but now we anticipate it to be toward the upper end of the range. PEO and insurance solutions is still expected to grow in the range of 8% to 10%, but we now anticipate it to be toward the lower end of the range.\n\nInterest on funds held for clients is expected to be in the range of $85 million to $95 million, but is now again anticipated to be toward the upper end of the range. Total revenue is expected to grow in the range of 7% to 8%, but again, based on what I just said, is anticipated to be toward the upper end of that range. And adjusted diluted earnings per share is now expected to grow in the range of 11% to 12%, increase from the previous guidance of 9% to 10%. I just want everyone to remember, I'm talking about adjusted diluted earnings per share.\n\nSo turning to the second quarter. Our current thoughts are that we anticipate revenue growth will be approximately 7%, and we expect operating margins to be approximately 38%. Of course, all of this is subject to current assumptions, which could change if there are significant changes to the macro environment. We will update you again on the second quarter call, and I refer you to our investor slides on our website for more information.\n\nI'd also like to take a moment to thank you, say thank you to Marty for his years of service to the company. It's been an incredible pleasure working alongside you, and I wish you the best of luck in your future endeavors. I can say that for all of the shareholders on the call, there was never a moment, never a conversation where putting the interest of shareholders didn't come first. And so I know that, that will continue under John's leadership.\n\nThe other thing I'd like to say is that the company that we're reporting on today simply would not be where it is today without Marty's efforts. And one other thing that I want to add, too. For the investors on the call, we filed a supplemental proxy statement this week relating to our say-on-pay proposal. We'd ask that investors who want a position in Paychex take a look, read that closely.\n\nI'm always available. The management team is always available for any calls that you'd like to schedule to discuss that. So with that, let me turn it back over to Marty.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nThanks, John and Efrain. Thank you very much for the comments and for your updates. And also, of course, we wouldn't be here where we are today at the company without our over 16,000 employees, who have worked so tirelessly for our clients and for our shareholders. We'll now open it up for your questions and comments.\n\nGretchen, please open it up, please.\n\nOperator\n\n[Operator instructions] We'll take our first question from Bryan Bergin from Cowen. Bryan, your line is now open.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nHi. Good morning. Thank you. Marty, John, congrats.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nThanks, Bryan.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nI wanted to start here if we can talk about really thinking a little bit more around the moderation comment you mentioned on some of the KPIs, and any changed view on macro assumptions in that fiscal '23 guide, particularly on client employee levels and retention?\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nYeah, I don't think so. I'll let John comment, too. But I think what we're seeing in the moderation is like on retention, I think that we're kind of heading back toward -- we're still above. From a revenue retention standpoint, we're still above pre-pandemic levels.\n\nOn a client retention, we're kind of normalizing back to a pre-pandemic. We kind of expected that. There was a lot of new business growth, new start-up business growth over the last couple of years during the pandemic. And so you're seeing a few more of those go out of business, and you're seeing a few more bankruptcies that way.\n\nAnd the other thing that we're seeing in the small business index is while wages are going up, they're starting to slow down and moderate. So while job growth is still growing and moderating some for small businesses, wage growth is starting to moderate slightly. So that's maybe a good sign that some of the actions being taken by the Fed are working, and maybe that will continue to improve. But other than that, sales continue to be very strong.\n\nSo when you look at that side of it, we're at record levels of sales. We had a great first quarter in sales, and clients are adding employees. So the moderation is probably more on the retention side normalizing and -- but the number of employees being added and the sales are still very strong. John, anything you want to add?\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah. No, I would say I don't think there's anything we're seeing at this point that we'd see as a sign of a recession. As Marty pointed out, there's -- there was moderation that we expected going into this year on the retention because of the business charge. But when I look at it, employment levels continue to be -- increase.\n\nWe see that in our checks. We see that in worksite employees per customer. The labor market continues to be tight. Our business watch certainly showed that information.\n\nI would also point to our revenue retention is remaining at the record levels we've seen before. So again, we continue to see the fact that retention and the use of our products, when I look at the underlying pieces, clients are taking high-value services from us. Those things are creating more stickiness for those customers that are. Our price value losses continue to remain significantly below even the pre-pandemic level.\n\nSo again, any moderation that we're seeing, I view is more of a normalization of what we kind of saw as an anomaly going on during the pandemic.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nOK. OK, thank you. And then just, Efrain, for the 2Q rough targets that you provided here, can you just talk -- dig in a little bit more on the dynamics, first on growth as we think about moving from 1Q to 2Q? And then just on margin, too. You had outperformance on margin in 1Q.\n\nAre there added investments that come back into the model over the course of the year, particularly in 2Q?\n\nEfrain Rivera -- Chief Financial Officer\n\nYeah, a little bit. So let me just take that because obviously, the growth rate in Q2 is a little bit different. This year was always a little odd because the two highest growth quarters were the first and the last and in the middle for different reasons, a little bit idiosyncratic to the processing for our plan process ended up a little bit lower. In Q2, I'd call out three things, Bryan, that are important.\n\nWe don't anticipate that the level of ERTC, I called it out in the quarter, will -- the amount of growth contributed by ERTC will continue in the second quarter. Having said that, I don't know because I didn't think that was going to happen in the first quarter. So we could be a little bit more. But I'm being a little bit cautious about what we think we will get.\n\nSo you won't quite get -- you won't get that level of uptick in growth in Q2. And these comments are about Q2, by the way. We'll talk about the back half of the year when we get a little bit closer to the back half of the year. The second part is that we had, to the point, although there's been discussion about moderation, what was really interesting in the first quarter is that we had higher growth in what we'd call check volume and pays per control, others call, than we anticipated in our plan.\n\nThe first quarter was actually fairly robust. Out of an abundance of caution, reading the same info you are reading, we think we're still going to get some benefit in Q2, but it won't be as pronounced as it was in the first quarter. So that will cause a little bit of a step down. And then with respect to PEO, we called out some trends that are persisting with around -- PEO insurance around healthcare attachment that we think will continue into second quarter.\n\nThat's going to drive growth a bit smaller or a bit lower than we were. We're really consistent, in some ways, a little bit above with what I said when we were in the fourth quarter call. That's really what's driving it. It really is more of a Q2 -- investment side.\n\nThe challenge for this year was we entered the year -- we were -- in the first half of the year last year, we were really at much lower employment levels than we are currently, and so as you have a little bit of a step down in revenue in Q2 -- whereas you have a step down in revenue in Q2, you still have a relatively higher expense level that normalize as we get into the back half of the year. And then we're making investments in marketing, product development, the normal things that you would make in a quarter. And that combines to kind of create a little bit of a lumpy Q2. So that -- those are the key factors in terms of underlying dynamics, no change and it's pretty much in line with what we anticipated.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nOK, thank you very much.\n\nOperator\n\nOur next question comes from Jason Kupferberg from Bank of America. Jason, your line is open.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nSorry. Apologies. I was on mute. Well, first of all, congrats to Marty and John.\n\nI did want to start with a question for Efrain. Just on the EPS guidance raise, Efrain, is this just because you now think revenue and margin will both be at the higher end of your full year expectations? I know everything else is kind of unchanged, so just want to make sure we have the pieces there for EPS.\n\nEfrain Rivera -- Chief Financial Officer\n\nYeah. I think for the full year, we'll be a little bit ahead, I'd say. I think it's more driven, Jason, by more mix. So there's some revenue component to it and there's a mix component to it that's driving the EPS number.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nOK. OK, got it. The -- just the float income guidance for fiscal '23, I know it's unchanged. You're talking about being at the higher end.\n\nI guess maybe just given the magnitude and the speed of the Fed rate hikes, can you walk through some of the pieces there? Some people, I think, might have thought that, that number would be moving a bit higher. But obviously, there's portfolio duration and other variables to consider. Yeah, that would be helpful.\n\nEfrain Rivera -- Chief Financial Officer\n\nJason, thank you. So look, I'm a little bit cautious, and I think we could be accused of some conservatism there. But you're absolutely right. And just to get one level deeper and get a little bit more into the question that you're raising, I think that the issue for us is at what point do you see the Fed raising and then you lock long based on duration? I don't have the great answer to that.\n\nI will say we're meeting basically every other week to decide what our outlook is on that. That could impact that number. I'm looking not only at '23 and '24. You were here long enough to know when we rode that cycle up and then had a bumpy cycle on the way down.\n\nAnd so I want to avoid that even at the expense of maybe a little bit of upside this year. So we're trying to figure all that out. And then we're -- you're reading the same thing. Actually, you have better info than I do.\n\nOne second, it looks like short-term interests are going to go to X. And the next second, someone says, hey, I'm a little bit concerned about that, that could cause a recession. So balancing all of that with the appropriate level of conservatism so that we can hit what we said, we feel good about the forecast at this stage based on what we know is a little bit trickier. We're certainly at the high end of that range, and we'll update next quarter.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nOK. Just one last quick one. Just in that -- picking up on that theme of potential conservatism. I mean, just looking at management solutions, obviously, you're sticking with 5% to 7% for the year.\n\nYou started at 12%. You had some of the ERTC benefit, but it just seems like a lot of decel kind of baked in. So maybe you want to talk through that a little bit. I know you're talking about higher end, but still.\n\nEfrain Rivera -- Chief Financial Officer\n\nYeah, I'd say this. I think and we'll talk more as we get to kind of mid-year. I think one of the things that ends up happening with ERTC in the back half of the year, it becomes a headwind to growth because it doesn't recur in the same way that the revenues do. So we baked that in.\n\nThat's one. We're against tough comps in the back half of the year. So that's another issue. And then employment is really the other part that we're wondering about.\n\nRight now, I'd say we're not assuming that there's a lot of employee adds in the back half of the year. Could we see something that's different than that? I don't know, both ways. At this point, I can't call it close enough. So I'm sticking with where we thought we were going to be at the beginning of the year and then we'll update as we go through the year.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nFair enough. Thank you, Efrain.\n\nEfrain Rivera -- Chief Financial Officer\n\nOK, thank you.\n\nOperator\n\nYour next question comes from Andrew Nicholas from William Blair.\n\nAndrew Nicholas -- William Blair and Company -- Analyst\n\nHi. Good morning. Thanks for taking my question. I wanted to start on the PEO and insurances, our insurance services segment.\n\nObviously, growth came in on the bottom end of the full year range. You're now guiding to kind of lower end of the range for the full year. I know you mentioned some weakness in the insurance business this quarter. Is there anything else to call out within that business that surprised you, whether it was the upside or the downside? It sounds like existing clients' hiring activities are still quite strong.\n\nSales are good. So just want to make sure I understand all the dynamics there as well.\n\nEfrain Rivera -- Chief Financial Officer\n\nLet me frame it, and then I'll let John talk to it. He's obviously well-versed in what's going on in terms of the dynamics of the business. In terms of the plan and forecast and our guidance, we started out the year a little bit lower on the insurance side than we had anticipated. That's primarily an issue around -- and we called it out, on enrollments.\n\nWe think that trend will persist into the second quarter, and then it will start to improve as we get into the back half of the year. So we have a little bit lower first half than originally anticipated and in the back half as we expected. So that's what's really kind of moving the PEO numbers down in terms of our outlook. Look, you know Andrew better than most.\n\nDifferences in attachment can change revenues really, really quickly. And so we'll see where we end up on that front as we go through the year. It's driving it. It's driving our results.\n\nLargely doesn't have a significant impact on margin, again, as you know, because those are relatively low-margin revenues. But out of a sense of, I'd say, at a sense of where we ended up in the first quarter and where we're anticipating second quarter to be, we're good. Now I'll let John talk about the fundamentals of the business because I think they actually are pretty strong.\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah. Look, I feel, particularly, on the PEO side, I'll talk about that first. Like we're well positioned coming out of the first quarter. Remember, we're just now really entering the key selling season.\n\nWe're also in open enrollment season within our PEOs, and those are two critical periods of time. When I look at where we are going into this, our client retention is extremely strong. Really, we had set some pretty aggressive targets, and we're actually beating those targets in the PEO in the first quarter, so the value proposition is resonating. So retention was very strong.\n\nSales were strong for the first quarter. I look at where we are from a sales headcount. We actually accelerated. If you remember in the fourth quarter, we made some investments in the first quarter.\n\nSome of that was actually adding because we saw the demand there. Our tenure is great. We have the best sales retention of any of our divisions in the PEO. So our tenure of our team going into the selling season is really strong.\n\nWe just completed our renewals with our health insurance carriers. I feel good about where we are on those. I think we got a good part of that. To Efrain's point, kind of the attachment of insurance and then once we attach insurance to a client, how many employees are signing up for that? Again, in particular, this might be an affordability issue that we may be seeing.\n\nSo some of the things we've done is we've actually expanded low cost plans in this next enrollment. We've expanded our enrollment consultants, who will go out and engage clients. So we're working against what we've kind of seen some trends in the first quarter. But obviously, some of the drag in revenue, as Efrain said, is we had a little lower than we historically have seen relative to attachment of insurance in the PEO and a little lower participation than we've typically seen as well.\n\nAnd again, we've taken steps in terms of both plan design and in our sales execution to be able to move forward. The agent -- the insurance agency, some of the things we saw relative to attachment and participation in our H&B area, similar to PEO, common theme there that we saw in the first quarter. And then as we've talked about, I think, repeatedly, the market -- just the market is continually soft in P&C and continues to be a headwind.\n\nAndrew Nicholas -- William Blair and Company -- Analyst\n\nGreat. Thanks, John. Thanks, Efrain. Those comments were super helpful.\n\nFor my follow-up, I just wanted to ask a bigger picture question. You mentioned the HR tech conference in your press release and I think again in the prepared remarks. And I, personally, I was impressed by the number of vendors at the conference and the level of innovation really across the sector. So with that in mind, given the number of new products, the amount of money that's come into the space over the past several years, just wondering if it's changed how you kind of think about the build versus buy equation.\n\nDoes M&A make more sense today, given the rate of change in the market and how rapidly new products are being built and gaining adoption? Essentially, just want to get your thoughts on build versus buy, appetite for M&A, given all that's going on right now. Thank you.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nYes. This is Marty. I'll start it out. It's an interesting question.\n\nI think the appetite is still there. I think valuations are still high, but we'll see if they catch up and come down some and get more realistic. We've always been able to use M&A not only for growth from a -- kind of from a product perspective, but I mean, actually adding to the technology. So time and attendance started with M&A back many years ago, now 10, 11 years ago and probably 12 for the first time and attendance product, which we then built into our product and now is one of the fastest-growing products we have from that perspective.\n\nBut I don't think so. I think we really look at that very closely, whether we can build. We have a very successful development team here, product management and development, that kind of decide what do we have to do from a tech standpoint. We like it being bundled into the flex product suite, and so we're careful to do an M&A from a product add-on standpoint.\n\nAnd we don't really see -- I don't really see, and John can comment on this, too -- a product that we're missing right now in the suite that I would have to go out and -- that we would go out and look at from an M&A perspective. It's more adding to what we have. The technology, we feel -- everything is, as John mentioned earlier, the HR, the HCM technology that we have, the combination with being able to do so much on the mobile. We have such a large use now of the mobile app.\n\nWe're also tying much more to the employees in self-service. And so if you didn't pick up on some of that at HR tech, self-service has become a big part of our model. That gets the employees of our clients more involved and right from just making their own changes, self-onboarding many aspects of when they sign up to Paychex pre-check, which allows them to view, as you know, view their payroll before its processed, has really been important to bring the client employees into the picture, which builds better retention and better love of the Paychex mobile app, which still does a 4.8 out of 5 stars. And so I don't think there's a lot of M&A from a product need that we have to add to.\n\nBut there's still a good appetite for M&A, and we're constantly evaluating opportunities.\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah, I'd probably give you a good example that I actually talked about here on the call and one that's -- that we have previously announced and is in the works to go live. I think we're constantly looking for the right combination of partnerships, technology we can build and acquisitions that we can bolt on to kind of put a unified experience together that resonates with our customers and addresses a problem. We talked about the recruiting and applicant tracking and onboarding experience that we launched reintegrated. That's really a combination of build.\n\nWe got a partnership with Indeed, which we've talked about numerous times, to help get candidates faster. And then it was also an acquisition that we made some time ago of a company on the onboarding and kind of applicant tracking side and the unification of that into flex and using the talent that we had bought. And that's taken off tremendously. So it's a better experience.\n\nAs Marty mentioned, already 1.7 million new hires have went through that process. So that's an example. Another example that we're currently in the process of, and this goes back probably to your question on the insurance agency and about us working to really get more employees participating in all of our insurance products, and that was an acquisition that we made just a little bit ago with the benefits administration and enrollment technology, found a great small little company, could add both the talent on how to design that from a user experience perspective. We're in the final stages of deploying that.\n\nAnd actually, that will be deployed in our agency and our PEO as an electronic mobile-enabled way for employees to enroll in benefits. And it's also going to really highlight the ancillary benefits they get. Again, this has been showing them the right plan, getting them to participate and getting them to really see the full suite of insurance we've got electronically in a unified experience. So that's in early stages of being launched as we speak right now.\n\nSo there's a couple of examples of where I think we're going to continue to look for experiences we're trying to build for our clients and their employees, what capabilities do we have built in to flex today and where can we either find partners or find tech bolt-ons that will help us improve that experience.\n\nAndrew Nicholas -- William Blair and Company -- Analyst\n\nGreat. Thanks, again.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nOK.\n\nOperator\n\nOur next question comes from Ramsey El-Assal from Barclays.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thank you for taking my question this morning. I wanted to ask about the pricing environment and the degree to which you've been able to kind of pass through potentially larger price increases, given the inflationary backdrop. Should we expect a bigger contribution from pricing in this environment this year than we normally would?\n\nEfrain Rivera -- Chief Financial Officer\n\nYes. In terms of pricing, Ramsey, I think that -- I think Marty mentioned last quarter's call that we were toward the higher end of the range than of what we typically price. And I think that's where we're at right now, and that's what's holding. Look, I think we are constantly trying to strive for getting the balance between price and value correct, and I think that we're striking at this point the right balance on that issue.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nYeah, the price realization feels very good right now. And as John mentioned, I think it was a combination of a lot of things John is saying. So when you have that, a big need for recruiting, hiring and onboarding employees, and we're able to solve that particularly with technology, you're saving -- we're hearing more and more from the clients that they're saving operationally. They're being more effective.\n\nTherefore, the -- a little bit higher on the price range is working, and it's sticking. So discounting has really been not an issue at all.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nOK. Quite helpful. A follow-up for me. I wanted to ask a question on the sort of the relative resiliency of the two parts of your business.\n\nI'm just curious if there are drivers or factors that make management solutions and/or PEO sort of more cyclically sensitive relative to each other. I kind of feel like investors have a better handle on management solutions as it's sort of the longer-dated segment. But I'm just curious if you feel that PEO also has the sort of resiliency that you'd expect from the overall business.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nI can start, and John can jump in. I think, Ramsey, definitely PEO does. Right now, all the things that John just talked about and I just mentioned, recruiting, hiring, having insurance plans that as a small or mid-sized business you might not be able to have on your own. The PEO has continued to be pretty strong.\n\nYou do see fluctuations. Like we mentioned in this first quarter, we'd have quite as much enrollment, but we're also heading into the real selling season and the enrollment portion of the PEO. So PEO has continued to be very popular. And I think it is very resilient in a time when I'm competing for employees, I'm a business competing for employees, and I need better insurance plans.\n\nI need better help in signing people up for those insurance plans. And so yes, I think it has very strong resiliency just like the management solutions offerings. Anything you want to add to that?\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah. No, look, when I look at the clients that are attracted to the PEO value proposition, these are clients that are having to navigate very complex HR or complex employment situations, multistate, they're in difficult states where there's a lot of regulatory compliance and other risks facing their business. And they view our HR support, our compliance support, the way that we assist them and EEOC type of complaints and issues as a critical part of their business. I just got a comment on this from a client, a small client, that said they couldn't live without their HR person helping them out.\n\nAnd I would step back and just again -- and maybe reiterate macro because maybe we're not explaining it well. You look at our employment, you look at the HR pulse survey, and I look at the -- what issues our nearly 700 HR consultants are facing for our clients. Our clients are still trying to fill open positions. So not only did we see checks and worksite employees increase, but we continue to see them asking for technology solutions, support and how can they continue to fill open positions.\n\nSo certainly, what we see in the underlying macro side in both the managed solutions and the PEO is that they're really needing our HR support. It's a complex environment, and I think there's good resiliency going forward.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nOK, so similar performance profile through the cycle for both segments is what I got from that. So I appreciate your answer. Thanks so much.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nSure.\n\nOperator\n\nOur next question comes from Eugene Simuni from MoffettNathanson.\n\nEugene Simuni -- MoffetNathanson -- Analyst\n\nThank you. Hi, guys.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nHey, Eugene. Yeah, I know that wasn't your name.\n\nEugene Simuni -- MoffetNathanson -- Analyst\n\nNo problem at all. So I wanted to come back for a second to macro. I'm hearing loud and clear what you guys are saying that you're not seeing any signs of recession slowdown in the employment numbers and still a very tight labor market. That's clear.\n\nI wanted to ask about a slightly different metric, which is, let's say, businesses' willingness to invest in new technology, right? So situations where you would get real upgrades, feature additions or maybe switching from a legacy provider to you guys, things like that. I'm curious if you're seeing any incremental caution across your small business customers on that even as performance remains strong as people just get more cautious looking ahead. And if not, then, in your experience running this company for a long time, when times get a little bit more volatile, can we expect that caution to increase? And why, why not?\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nI would say at this point, we're not seeing that yet because, in fact, in a time like this, they're trying to -- the biggest things -- John talked about some of the surveys we've been doing lately. It's about operating efficiency. It's about how do I fill these positions. So the demand is still there for their products.\n\nAnd -- at this stage of the macro, and so they're needing people, and they're needing technology to save them money in other ways because wages are up. They have to give more benefits. So they're actually, I think, in this kind of environment, and it's been this way as the market has been tight, small and mid-sized businesses need to offer better benefits. They need to offer more technology.\n\nThey need to have a mobile app like ours that you can deal with remote workforces. So actually, I don't think that has -- there hasn't -- they haven't gotten any more skittish, I guess, I'd say about investing. They're actually really needed at this stage of the game. And typically, in -- depending on what kind of macro environment you're in, but in this one, where it's about hiring and it's about retaining employees, they're very much looking for technology, benefits, all the things we offer.\n\nAnd even if you're a mid-sized and might have to go through some reshuffling of people, you're looking to one of those 700 HR specialists that John mentioned that we have that would say, OK, how do I do this? How do I attract people? How do I retain them? How do I maybe lay some off while I hire others in the little bit larger companies? So we're actually seeing a great demand for technology in the HCM world as well as being able to handle remote workforces, which really are here to stay.\n\nEugene Simuni -- MoffetNathanson -- Analyst\n\nGot it. OK. OK, thank you. And then for my follow-up, probably a question for Efrain, actually switching gears a bit.\n\nWe talked about the margin dynamics over the short term already a bit, so I understand there's kind of ups and downs for the quarter. But I wanted to touch on the longer-term margin dynamics for a second. As we are now moving away from the COVID pandemic and settling more in maybe the steady state where digital channels have become a bigger part, digital buying has become a bigger part post-pandemic of your model, how are you seeing that really impacting structural margins of the business as we kind of get more experience with that maybe more digitally focused model, I'm curious.\n\nEfrain Rivera -- Chief Financial Officer\n\nWell, Eugene, I think we've talked about -- certainly have talked with many of you on the call. We have a relentless drive for efficiency in the business. And so as more of the business goes into either digitally enabled solutions or fully automated solutions, we expect over time that's going to be a driver of improved productivity and improved operating margins. So I've said -- I always caveat with you also have to balance investment in the business for sustainable growth.\n\nSo if we get 50 basis points or 75 or 100 of improvement in operating margins, we may decide, hey, that in order to create more operating efficiency -- I'm sorry, more sustainable margins over the long haul, we have to invest a part of it. But certainly, there are very few weeks that don't pass where we're not having that conversation. And I think that John has been a big driver in the last decade around making that model work and I expect that to continue over the cycle.\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah. Look, I would -- I'll jump on that because I think, look, our business model and our DNA as a company is around being the best operators in the business. I think we've proven that over decades, and that's certainly not going to change with me in this position. And I think what you're seeing, is it goes back to the question you asked earlier, is, look, clients are demanding technology because their employees are demanding technology.\n\nI mean, what we're seeing relative to the digitalization is really not just us trying to push that on clients. There's a big pull from clients and their employees to expect that they're going to have a technology experience, whether that's when they're recruiting. If they want to recruit people, you're not putting an ad in the paper. So if you're doing that, you're probably not going to find many people, particularly the people that are out looking for employment.\n\nAnd so whether it's benefits, whether it's their finances, they're looking for that to drive that. And not only is that a benefit for the customer, but that's also a benefit for Paychex. So digitization continues with our mobile usage. It continues to accelerate with our clients and our employees.\n\nIt's up 67% year over year, and we had a pretty big year the year prior to that. So I continue to see this as kind of being something -- it's not a nice-to-have anymore. It's really a must-have if you want to go out and compete in the talent market today. You've got to have an HR technology solution that is easy to use and really meets the full needs of what employees are looking for.\n\nEugene Simuni -- MoffetNathanson -- Analyst\n\nGot it. OK, thank you very much.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nThanks, Eugene.\n\nOperator\n\nYour next question comes from Bryan Keane from Deutsche Bank.\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nGood morning. Wanted to ask about kind of the different market segments. I know you guys called out strength in the mid-market. So just thinking about the health in the lower end of the market.\n\nCould you just talk a little bit about new business starts, retention in that market? Any kind of softness in spend you're seeing there?\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nWell, I think as we mentioned at the beginning, Bryan, the small business, new business starts are not as strong as they were last year, right? The last couple of years during COVID and the pandemic, of course, we had a lot of people leave big business and start businesses. And so small business retention, from a client perspective, we said, was starting to normalize a bit because some small businesses that started during that period have gone out of business. But the demand for employees through -- from small businesses is still needed. And we're still -- they're still adding employees.\n\nSo the good -- I guess the bad news is some are a little bit more out of business. But the good news is that most of our clients, even at the small end, are adding employees and still have a lot of postings and openings to fill. So I think that mid-market, I think we're -- what we've said about mid-market being stronger is I think we've executed much, much better in the mid-market, not only from a product suite and a technology suite of what we're offering to the client, but the sales team has done really well. We hit our stride kind of last year, and that has continued right through the first quarter with very good double-digit growth there.\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah. And I would add that not only is the demand is still strong in the mid-market, double-digit first quarter, I think, well positioned going forward. Retention, when you really look at that mid-market, which, you get into our HR services, you get into the PEO, you get into the mid-market HCM, where our clients are getting the full value utilizing the technology, we're seeing very good retention levels. As we said, our revenue retention is at record levels.\n\nI mentioned -- I called out the PEO, particularly just on stellar performance in the first quarter relative to client retention, and we've seen strong retention in our HR businesses holistically, and the mid-market is solid as well. I also think that our price value equation in that market has held up very, very well as well with our average sell-in revenue in the first quarter really strong, really strong.\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nGot it. That's helpful. And just one clarification for Efrain. On the second quarter margin, I heard about the second quarter revenue being lower, and you called out some callouts there.\n\nBut on the margin in particular, is it just a revenue issue plus additional investments that just flow in that caused the drop in the margin? I just want to make sure I have all the pieces there for the 38% margin.\n\nEfrain Rivera -- Chief Financial Officer\n\nBryan, you heard exactly what I said. So I must have been partially clear on that. So no, that's exactly it. A little lower revenue, a little higher expenses.\n\nIt's typically the lowest revenue quarter of the year, so you get a little bit of that impact. And it's in line with what we anticipated it to be.\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nOK, super. Thanks, guys.\n\nOperator\n\nOur next question comes from Bryan -- or I'm sorry, Kevin McVeigh from Credit Suisse.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nGreat. Thanks so much.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nHey, Kev.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nAdd my congratulations and we share your view on Efrain, too, Marty. \n\nMarty Mucci -- Chairman and Chief Executive Officer\n\n[Inaudible] It's astounding.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nYeah, exactly. Maybe just one, I guess, higher level. I mean, John, your taking the baton at the organization is super, super strong. But no two CEOs are the same.\n\nSo any initial thoughts as to areas of focus, maybe where you might dial in a little bit more? I mean, obviously, you're building on a great legacy. But just any thoughts as to where your initial areas of focus are, whether it's capital allocation or just technology or just any initial thoughts?\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah. Well, Kevin, thanks for that. And as you know, I've been a part of the leadership team for nearly a decade now. So a lot of the things we've been working on, I've been involved in and highly supportive of.\n\nSo look, I think you can expect we're going to continue to really focus on expanding our leadership in technology and HR. I mentioned it earlier, going to continue to be the best operators in the business. And we're going to consistently be a top performer in terms of total shareholder return. I mean, I think those are three traditions I don't plan to mess with, quite frankly, because they're working and are what I believe.\n\nLook, I think we've got -- look, we've got opportunities to expand our offerings and continue to innovate and change. I would tell you that I think Paychex has always done that. And there's no question, under Marty's leadership, that has accelerated. And I think you should expect us to continue to accelerate that.\n\nWe're going to continue to look for new ways and growth platforms that we can apply to help our clients grow. We're going to continue to invest in improving the experiences. I've mentioned that. I keep using this word, experiences.\n\nWe have a lot of great products. We have a lot of great service offerings. How we package those things together to address business problems is critical. I think the other thing that we've began to do more of, and I think you'll see more of, is, look, we're really beginning to use a large amount of internal data we have to really apply that, the Retention Insights product that we've launched for our customers and being used with our HR professionals, with the customers to identify how they can retain clients.\n\nWe're also using ERTC as a good example where we're using our internal data sets to really identify customers that have specific needs and then able to get our sales force into a situation where they can talk to a client who has that need at that moment. And that drives productivity. I think you're going to continue to see us do that. And I think we're going to continue to see what I said before.\n\nWe're a tech company, and we're going to continue to invest like a tech company. So I think relative to capital utilization, you're going to continue to see us look at applying capital in areas where we can improve our technology footprint and help our clients.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nThat's super helpful. And then just one quick follow-up I think for you Efrain. I appreciate what you're saying in terms of the outlook on the Fed funds, things like that. But can you tell us like what Fed fund rate is in the implied guidance right now? And then just remind us, if you can, kind of what 25 basis points -- like what the sensitivity is to the revenue for every incremental 25 bps?\n\nEfrain Rivera -- Chief Financial Officer\n\nYeah. So in the first quarter, we called it out. It was between 3% and 4% kind of around the midpoint there where we expected it. I think I may have called specifically three and a quarter.\n\nSo right now, we're working with something in that range. Obviously, everyone's chief economist has a different number that ranges probably with the 4%, and some probably are 5% and above. But I want to call out that -- and so by the way, a quarter basis point is somewhere in the $4 million to $5 million range in terms of net income. So it's potentially important.\n\nIt could be important. But Kevin, the one thing I think that Jason pointed out that's really important that I think what makes it a little bit trickier is you don't want to push your chips to the middle of the table and go all in short term and have a great year in terms of year-over-year interest income only to give it back in the next year. So what we're really looking at is what's the right duration for the portfolio in this environment? And so that's why I can't -- I wouldn't necessarily and I'm cautious about saying, hey, I got 100 basis points up versus my forecast, and that relates to X. I'm a little bit cautious about that because I think we've got to manage a somewhat volatile interest rate environment here with the Fed and figure out what the implications for '24 are.\n\nSo I'll just leave it at that. So we're looking at it. And by the way, I mean, it's not like somehow we're geniuses here. We got some of the best minds in the business on the fixed income side working for us.\n\nSo we'll take counsel and have a lot of discussion on that.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nHelpful. Thank you. \n\nEfrain Rivera -- Chief Financial Officer\n\nSure. Thanks.\n\nOperator\n\nOur next question comes from Samad Samana from Jefferies.\n\nUnknown speaker\n\nHey. This is Guren Gretz on for Samad. Marty and Efrain, congrats on the strong results. John, also congrats on the new role.\n\nJohn Gibson -- President and Chief Operating Officer\n\nThank you.\n\nUnknown speaker\n\nSo I think we've touched on a lot already, but I wanted to double-click on the employee growth that you've spoken about in both management solutions and PEO. So obviously, with COVID, right, the recovery was not completely even by vertical or geographic area. I think in the past, we called out Florida was -- saw some strength first. So I'm curious.\n\nThe growth that you saw this past quarter, is that broad-based? Or is it coming from a specific vertical or geographic area maybe lapping what we saw at the start of the recovery from the pandemic?\n\nEfrain Rivera -- Chief Financial Officer\n\nYeah, so let me disaggregate. I'll give some, and then let John add some color commentary. So the PEO is a little bit different than management solutions per se. So what we saw was strength in ads in larger clients, and that's partly a result of really good work that we have done over the last four to six quarters in mid-market.\n\nWe've done good work before that, but I think you've seen the benefits of that coupled with, and that's always important, coupled with the improvement from last quarter in terms of the overall hiring environment in the first quarter. We expect that, that starts to slow a bit. With respect to PEO, when we look at worksite employees, that was pretty widespread. So obviously, because our business is over-indexed in Florida and in certain verticals relative to management solutions, we saw strength there, but PEO is pretty widespread.\n\nNow, PEO is a little bit different in the sense that our average client is roughly about 30 or so employees. So you're also getting a little bit of a larger, let's call it, client effect in terms of the adds. So that's a little bit more color. Marty, Efrain -- I mean, Marty, John, you want to comment?\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nWell, I just -- I think we've seen it kind of across the board. Most of the client base has seen an increase in employees. So we've seen them adding employees. And of course, that's going to be in that 1 to 20 range, in particular, but 1 to 50, probably we're seeing that.\n\nI think that Florida, the south, we've seen that in the small business index in that those have been the strongest job growth states for small business because that's where the people are. And so there's still a lot of job openings, particularly in leisure and hospitality. And they're able to fill them in the Texas, Florida, Georgia, even North Carolina kind of areas. They're their best job growth kind of area.\n\nSo that's where small businesses are doing the best. But overall, we've seen our business is able to add people. And obviously, then, that's adding checks, as John mentioned.\n\nJohn Gibson -- President and Chief Operating Officer\n\nYes. No, just to reiterate, I think we've seen across the board in pretty much all segments improvement in the employment levels. And still in all the surveys we're seeing, again, both the survey we did, I know there was one that I think that was just in a paper recently a couple of days ago that I read that reinforced it. Small business owners are struggling more than mid-sized companies, and we've seen that in our data.\n\nWhen we look at where the number of checks and where the worksite employees have accelerated more, a mid-market company that offers more benefits is out competing for the talent. And so that's why we've really been focused on sort of this recruiting and the partnerships that we've built and the technology we've built to help small business owners have a fair advantage. I would also say to Efrain's point, another interesting and again, a little dated, but we certainly looked at this a lot when we were doing the down trim. What we know is customers who were in our HR products, whether that's our ASO product or our PEO product, they decelerated less than the general market.\n\nAnd when it came time for recovery, they were able to staff up faster. And I do think that's because of our HR support. So we, certainly in those areas, have seen better recovery, faster recovery, more full employment. And I think that has to do with both our technology and our advisory service and helping them gain advantage there.\n\nUnknown speaker\n\nAwesome. That's all very helpful color. I think along the same lines I wanted to follow up with, we've talked about how difficult hiring is at this time. And your own business or you've seen this hiring pull forward, and that's obviously impacting the cadence of margins throughout the year.\n\nSo this past quarter, were your hiring plans on track, ahead of or lagging your initial expectations? And was there any change in your ability to hire incremental sales or support staff throughout the quarter? Just curious if there were any changes on that end.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nNo. I mean, actually, we did very well. The hiring machine really took off here from a recruiting and a hiring perspective, and retention is better. So I think you're hearing that in the overall market, particularly for larger businesses.\n\nNow, we made some changes to that. We improved some of our starting wage rates just like a lot of companies and did some other things as well for some of the existing employees. And I think that's paid off. Yes, we're fully staffed, and we're ready to go.\n\nActually, we're ready at the start of the quarter for sales and everything else. So we've done very well on the hiring front and are ready for the rest of the year too.\n\nUnknown speaker\n\nGreat. Well, thanks for taking my questions. Again, John, congrats on the new role.\n\nJohn Gibson -- President and Chief Operating Officer\n\nThanks. Thank you.\n\nOperator\n\nOur next question comes from James Faucette from Morgan Stanley.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThank you very much. And my congratulations to both Marty and John as well. I wanted to -- you've addressed a lot of our key questions, but I wanted to quickly follow up. Marty, can you just talk to really quickly again the expected cadence for PEO during the course of the year? And just so I understand the expected improvement later, is that because of the things John mentioned, of adjustments to the PEO plans, some changes in sales, etc.? Or is there something else that you expect to have an impact there?\n\nEfrain Rivera -- Chief Financial Officer\n\nHey, James, let me talk to that. So I think as I said at the beginning of the call, we started the year in the first half a little bit under what we expected from an attachment perspective, and insurances were a little softer than we anticipated. The impact on margin's pretty insignificant. As we get through the year, we -- our expectations are that the PEO growth accelerates in the back half of the year, and part of it is that we had pretty strong worksite employee growth coming out of the first quarter.\n\nSo we -- if you get that coupled with better healthcare attachment in the back half of the year, look, if people make decisions or making decisions in this quarter, you don't see the revenue this quarter. You see it in future quarters. They're making those decisions on the assumption that those things materialize, which they should, then growth accelerates in the back half of the year. That's basically the explanation for what's going on.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGot it. Got it. That's helpful. Thanks for the clarification there.\n\nAnd then, I guess more from a landscape perspective. You've touched on and obviously highlighted over time but also on this call everything that you've done from a technology perspective in terms of Paychex's ability to help its customers and continue to improve. But what are you seeing happening in the regional provider space? How are they being able to keep up with you, the incumbents or on tech? And do you expect further consolidation? Or I guess the real question is, where you're not winning from regionals, what is -- what's the primary reason and how can you address that? Thanks.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nYeah, sure. Actually, we're doing very well against the regionals. I don't -- I think it is hard to keep up. They certainly have been viable competitors, but I think that it's -- we haven't seen a big change in the competitive environment.\n\nI think if anything, we feel like we've really continued to jump start. John mentioned the voice assist that we just offered. No one else has offered that through -- with Google. The work we've done to combine for recruiting and onboarding their clients, I think the -- there may be some consolidation.\n\nI think they're looking for probably some more support from a tech standpoint because there will continue to be a lot of investment going forward that we obviously have a great track record of doing. But I think there's been a lot of demand, so that's kind of kept everybody happy. The pie is -- the overall pie has continued to grow, particularly in the mid-market. So I think they've all done -- everybody has done pretty well.\n\nWe'll have to see how that goes forward as we get to the kind of the back half of this year. But we feel very confident, not any big changes in the competitive environment and we've performed very well.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGreat. Thanks a lot.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from Tien-Tsin Huang from J.P. Morgan.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nTien-Tsin? Maybe you're on mute. Gretchen, are you there?\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nCan you guys hear me? I'm sorry. I'm here. \n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nYes, we can hear you now.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nI apologize. I had some trouble with my headphones. So sorry to keep you guys waiting. Quick thanks to Marty, of course.\n\nAlways appreciate our conversation through the years. So I'm not sure if you'll miss these calls, but definitely we'll miss you and chatting with you. \n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nDefinitely.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nAnd John, look forward to working with you more. You did, in your remarks, credit Marty's vision for embracing technology. And I think someone asked you about what your focus or legacy might be. I caught that, but I'm just curious, John, given your background on services and where you were before Paychex, I'm curious if you see more opportunity to improve services here further for Paychex to complement tech? Or is it one and the same in terms of tech and services starting to blend a little bit further? I'm just curious how you think about balancing those two things, right, between the services and the tech of the company.\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah. Look, Tien-Tsin, I think you're right. I see it one and the same, and that's probably the reason why Marty and I were reminiscing about my interview here. And what really attracted me was Marty's vision was very consistent with mine and my experience about where I saw our industry going from my prior experience.\n\nAnd my view is I think having the best technology and having a unified user experience is going to be critical not only for the demand of what customers and employees want but also to drive the operational efficiency that I think customers are going to want. That being said, customers need to know how to use that tool. And they are facing complex issues outside of items that technology can solve, particularly in the HR area. So I think we have a unique position to be able to reposition our traditional services kind of, \"Hey, I put something in a system for you,\" and really position that more as an advisory opportunity.\n\nAnd I think about the things we're doing with the mass sets of data that we have, the benchmarking data, the way we can do analytics, the fact that we can call client up and say, we think you're going to have a retention problem. Let us walk you through your insights. That's what service is going to be. It's really not even service in the historical sense that you would see a service company talk about.\n\nAnd I do believe that, that's going to resonate, and we see it resonating in this complex environment. More and more companies are going to end up having employees in multiple states than ever before to compete for talent and the remote workforce. That brings regulatory complexities that not just technology can solve for you. You've got to think about how you're going to do this.\n\nAnd so I do think that we're uniquely positioned, and I think you'll continue to see us invest in technology and invest in HR and really position ourselves as the digital HR leader in the marketplace.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nGot it. I appreciate you going through that because I still think about it. When I started covering Paychex, I always thought of it as a services company, and of course, tech and digital has taken over everything. So just wanted to get back to basics there.\n\nIf you don't mind my quick follow-up. I know the call is getting long here. Just thinking about the modules and the breadth of services. You mentioned Paychex being the largest 401(k) recordkeeper.\n\nI know the equity markets have come down a little bit. Is that having any influence on your outlook in general? And also just clarifying, if you don't mind, two questions in one. Just the healthcare enrollment piece. Is the lower attach or enrollment a function of mix of clients or is it a competitiveness of the plans issue? I just want to make sure I understand that, if you don't mind those two questions.\n\nThank you.\n\nEfrain Rivera -- Chief Financial Officer\n\nWell, you got two quick ones in there. \n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nSorry. Yeah. I'm trying not to take up too much time. \n\nEfrain Rivera -- Chief Financial Officer\n\nI'll talk to the first, and I'll let John talk a little bit, Marty, if you want, on the second. So in our retirement services business, as many of you know, we do have about a third of the revenue there is derived from basis points. So it has a modest drag in terms of revenue. It's not really significant.\n\nI just put it as de minimis in terms of the balance of the year. And then on healthcare enrollment, you're asking for more color on that. I'll give -- I'll let John touch on what's driving a little bit lower healthcare enrollment.\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah. Look, I think -- I wish I had the perfect answer to that. Looking at all the data, my experience tells me a lot of that can be mix of clients. Again, a lot of it has to do what's the average wage of a client, what's the industry they're in.\n\nLike you also have, as I said, economic situations where a person may be having benefits and deciding I can't afford benefits right now, given my economic situation, they dropped the benefits. We recognize that. That's why we're doing a lot in really looking at our plan designs and the PEO in particular, rolling out lower cost plans, also rolling out nontraditional plans. We've actually created an entire wellness kind of spectrum of products and services to really meet the needs of the economic needs of every type of worksite employee that we would have there.\n\nAnd we're also driving digitalization into our H&B business. I mentioned that earlier. That's rolling out in the second quarter so that we can offer a more full suite of benefit options that can match the price point of both the clients and their employees regardless of what their economic situation is. So we certainly are trying to expand what we're doing.\n\nWe recognize that for some employees and some customers, the cost of getting some of these benefits is outside of their capabilities right now. And so we're really focused on a product development perspective to make sure we have the broadest suite of offerings in the marketplace.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nGot it. That's helpful. And sorry for extending the call.\n\nEfrain Rivera -- Chief Financial Officer\n\nNo, no, no worries. Always -- your question is always appreciated.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nThanks for the time guys.\n\nOperator\n\nYour next question comes from Mark Marcon from Baird.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nHey. Good morning. Marty, congratulations on just tremendous accomplishments over the tenure that you've been the CEO. And John, look forward to working with you.\n\nWith regards to the macro environment, you did mention small business formations are a little bit lower. How are you thinking about the sales pipeline for HR management solutions? And to what extent can you dial the marketing strategy to highlight some of the tech improvements? I was at HR tech. I was really impressed by the voice recognition program with Google. And are you charging more for those types of solutions?\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nYeah. We're really -- I mean, one, let's take the marketing side of it. It's doing exactly that, Mark. It's being at HR tech.\n\nIt's being -- it's getting the word out there. We're doing a lot with -- in trying to partner with folks like Google to be sure that it's known that we have the only -- we're the only one that can do that with their Google Assistant and have you be able to do it totally hands-free. We're pushing -- the marketing has been pretty aggressive for years on -- through webinars, through the tech conferences and, of course, through all the podcasts and then just all of the online work that we've done. And that's been very important to us to get the message out, and we think that, that's worked well.\n\nSo I think that's been good. I think on the -- so we think there's still a huge demand. And John mentioned, I think, earlier, the product penetration rates continue to go up. I think that as the tech word has gotten out there and the need, of course, as we've talked about a lot on the call, we've really seen this additional product penetration.\n\nAnd even if new business starts are less than what they were, they're still up. They're just not -- they're not up the big numbers that they were during COVID when everybody -- or many people ran from large businesses and started small businesses. So they're still up. We're still obviously doing very well on the start-ups, but I think we're doing even better with the product suite to make the additional penetration of the existing client base.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nRight. So the way I'm taking it, it sounds like the pipeline in terms of the key selling season for management solutions as well as PEO continues to be robust. And you're not really seeing much of a change in terms of what we're reading about from a macro headline perspective as it relates to that.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nCorrect. Correct. We still feel it should be a good selling season. It's early, but we should feel -- we feel good about it.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nGreat. And then can you talk a little bit about retention? How do you think that ends up being impacted as ERTC kind of winds down? Does that have any sort of impact?\n\nEfrain Rivera -- Chief Financial Officer\n\nMark, so as -- we gave a little bit of color on that in Marty's call. I think what I've called out is two things. One is, and it's one thing that John mentioned, but from a revenue retention standpoint, we're at near-record highs. So that makes sense.\n\nMarty called out, on the very lower end, we've seen a little bit more churn. That is to be expected, given where the market is right now. So on those 2, I think we feel we're pretty well positioned going into the balance of the year. ERTC really should not have a significant impact on client retention.\n\nI think that it is a -- if anything, it's positive in the sense that it just demonstrates the value add of Paychex. A lot of our competitors are not talking about it, because candidly, their model doesn't allow them to get there. Some are doing it. But I think we think about giving our clients that level of consulting and expertise that John was mentioning earlier.\n\nSo from a retention standpoint, really should not have a significant impact.\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nTerrific. Thank you.\n\nEfrain Rivera -- Chief Financial Officer\n\nThanks, Mark.\n\nOperator\n\nThe next question comes from Jim Mute from Northcoast Research.\n\nUnknown speaker\n\nGood morning, gentlemen, and congrats on a great quarter. I just want to get some color around your float portfolio. And as the Fed continues to hike rates, do you think there will be any changes or has there been any changes in the management of your float portfolio?\n\nEfrain Rivera -- Chief Financial Officer\n\nHey. I think I answered earlier that in the environment, every time the Fed makes another pronouncement about what they expect to do, we huddle and figure out what the implications of the portfolio are. And what we're trying to do is adjust the duration based on what we believe is going to happen and when we think we're going to see peak interest rates to position the portfolio not just for '23, but for '24. So we -- I would say, the changes would become a little bit more dynamic in terms of what the balance between short and long term is.\n\nAnd as the year progresses, we'll continue to make adjustments real time to take advantage of what we think is our changes in the landscape.\n\nUnknown speaker\n\nAll right. Thank you for reanswering that question. And do you have any thoughts on change in your return of capital to shareholder strategy?\n\nEfrain Rivera -- Chief Financial Officer\n\nThey're really -- the short answer is no. We -- and I think Marty and John talked a little bit about this, which is obviously, we're going to continue to pay a pretty strong dividend. We will buy back shares to offset dilution. And we will look at deployment of capital in terms of M&A if it makes sense, if it builds value in the portfolio.\n\nSo from that standpoint, no significant changes.\n\nUnknown speaker\n\nThank you so much.\n\nEfrain Rivera -- Chief Financial Officer\n\nOK.\n\nOperator\n\nYour last question comes from Scott Wurtzel from Wolfe Research.\n\nScott Wurtzel -- Wolfe Research -- Analyst\n\nHey. Good morning, guys. Just one question from me. Just on the revenue retention side of things.\n\nI know you called out it's still trending above pre-pandemic levels. And I think John had mentioned you're continuing to see attach rates of high-value products. So just wondering if you can just maybe give a little bit more color on what products are exactly resonating most with the client base?\n\nJohn Gibson -- President and Chief Operating Officer\n\nYeah, it's really our HR suite of products. You continue to see our online products. I just mentioned the retention -- the recruiting and applicant tracking really, really popular right now. 401(k) retirement, very popular, right? And then time and attendance is the other.\n\nI put that in kind of the online area. Anything around the automation of the employee-employer relationship is very high demand, very high demand right now. People are looking for those operational efficiencies, their workforces are more dispersed than ever before, and they're leveraging technology to keep track of what's going on.\n\nScott Wurtzel -- Wolfe Research -- Analyst\n\nGot it. That's helpful. Thank you, guys.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nOK, thank you. Gretchen, that's it, right, for the call?\n\nOperator\n\nYeah, no further questions.\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nAll right. Well, one more thank you to the over 16,000 employees at Paychex who deliver the great results for us all. At this point, we'll close the call. If you're interested in replaying the webcast of this conference call, it will be archived for approximately 90 days.\n\nI would like to thank you all for your support you've given me in my role as CEO over the years, and I know I'm leaving you all in good hands. Have a great day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMarty Mucci -- Chairman and Chief Executive Officer\n\nJohn Gibson -- President and Chief Operating Officer\n\nEfrain Rivera -- Chief Financial Officer\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nAndrew Nicholas -- William Blair and Company -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nEugene Simuni -- MoffetNathanson -- Analyst\n\nBryan Keane -- Deutsche Bank -- Analyst\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nUnknown speaker\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nMark Marcon -- Robert W. Baird and Company -- Analyst\n\nScott Wurtzel -- Wolfe Research -- Analyst\n\nMore PAYX analysis\n\nAll earnings call transcripts"
}