{
  "companyName": "MYT Netherlands Parent B.V.",
  "companyTicker": "MYTE",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/15/myt-netherlands-parent-bv-myte-q4-2022-earnings-ca/",
  "content": "MYT Netherlands Parent B.V. (MYTE -0.78%)\nQ4 2022 Earnings Call\nSep 15, 2022, 8:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to the MyTheresa fourth quarter and full fiscal 2022 earnings conference call. At this time, all participants are in a listen-only mode. Today's call is being recorded, and we have allocated one hour for prepared remarks and the Q&A. It is now my pleasure to introduce your host, Martin Beer, MyTheresa's chief financial officer.\n\nThank you, sir. Please begin.\n\nMartin Beer -- Chief Financial Officer\n\nThank you, operator, and welcome, everyone, to MyTheresa's investor conference call for the fourth quarter and full fiscal year 2022. With me today is our CEO, Michael Kliger. Before we begin, we'd like to remind you that our discussions today will include forward-looking statements. Any comments we make about expectations are forward-looking statements and are subject to risks and uncertainties, including the risks and uncertainties described in our annual report.\n\nMany factors could cause actual results to differ materially. We are under no duty to update forward-looking statements. In addition, we will refer to certain financial measures not reported in accordance with IFRS on this call. You can find reconciliations of these non-IFRS financial measures in our earnings press release, which is available on our investor relations website at investors.mytheresa.com.\n\nI will now turn the call over to Michael.\n\nMichael Kliger -- Chief Executive Officer\n\nThank you, Martin. Also, from my side, a very warm welcome to all of you, and thank you for joining our call today. We will today comment on the results and performance of our fourth quarter and full fiscal year 2022. We are very pleased with our results.\n\nOur business has shown excellent strength and resilience in some very challenging economic and geopolitical times. MyTheresa has accelerated its top line growth in the fourth quarter after a slower third quarter and continued to show excellent profitability. We believe this actually sets us very much apart from other digital platforms in the market and proves the unique positioning and business model of our company. We focus on the true luxury wardrobe building consumer.\n\nIn our last earnings call in May, we mentioned the negative customer sentiment that hit us, particularly in Europe, with the outbreak of war in Ukraine. But as expected, sentiments recovered rather quickly in the following weeks. In recent weeks, we have seen significant time and money spent by many of our high-end customers on long overdue vacationing, which shows the high discretionary spending available, and this will be dedicated again to online shopping on their return. Of course, there are ongoing concerns about energy prices, inflation at large, an economic slowdown, the return of COVID or new geopolitical tensions.\n\nHowever, we believe the high-end digital luxury customer in our very agile business model protects us in many ways from these challenges and uncertainties. Nevertheless, we will monitor any developments and their potential impact on our business. I want to leave you today with three key messages allowing you to have a clear view on the strength and health of our business. First, the accelerated growth in our business in the fourth quarter and the strong results for the full fiscal year 2022 show the consistency and strength of MyTheresa.\n\nThis can be seen in our outstanding KPIs for fiscal year 2022 demonstrating our excellence in execution. Second, the amount and quality of brand collaborations and money-can't-buy experiences in the fourth quarter underline our unique luxury positioning and ability to excite our customers and build long-lasting relationships, which drive profitable loyalty in turn. Third, we have put many actions in motion in the fourth quarter that will drive sector-leading growth and profitability in the future. The shift of luxury consumers to online shopping, as well as untapped geographic and category growth potential for our business gives us confidence to reiterate our expectations for a medium-term growth trajectory of 22% to 25% annually for our business despite short-term challenges in the environment.\n\nLet me now comment in more detail on these three key messages for today. First, in the fourth quarter, we grew our gross merchandise value, GMV, by plus 18.2% compared to Q4 of fiscal year 2021. This is a clear acceleration versus the Q3 growth rate. The acceleration in growth in the fourth quarter clearly sets us apart from many other digital platforms in the same period.\n\nFor the full fiscal year, our GMV growth reached plus 21.3% compared to full fiscal year 2021. Our continued growth momentum on top of extraordinary strong growth in fiscal year 2021 is evidenced by the high two-year growth rate in GMV of plus 66.3% in full fiscal year 2022 over full fiscal year 2020. The United States, which is one of our key growth markets showed again an above-average GMV growth with plus 28% compared to Q4 of fiscal year 2021. The United States accounted for 15.6% of our total business in fiscal year 2022 compared to 12.7% in full fiscal year 2021.\n\nWe drove this growth with an unparalleled number of customer and brand events in the United States in the fourth quarter. Please see our investor presentation for more details on our events in the United States in the fourth quarter. I mentioned our strong KPIs before. For example, our customer satisfaction reached again an outstanding level as measured internally with a Net Promoter Score of 83.2% in the fourth quarter of fiscal year 2022.\n\nOur average order value increased by plus 5.2% for the full fiscal year 2022 compared to fiscal year 2021. Our customer acquisition costs only increased modestly by 3.8% in fiscal year 2022, whereas many other digital platforms struggled to keep cost increases at bay. And finally, we achieved our business growth with a very healthy gross profit margin, which was 4.6 percentage points higher in fiscal year 2022 compared to fiscal year 2021, driven not the least by our strong focus on full price selling. All these KPIs demonstrate our excellence and execution.\n\nMartin will talk in a few minutes about how all this translated into excellent bottom line results for the fourth quarter and the full fiscal year 2022. Second, the fourth quarter saw a record number of brand collaborations, which gives evidence to the unparalleled luxury brand relationships we have as a business. We were again able to produce impactful digital content and campaigns that created visibility to our unique high-value multi-brand customer base that cannot be easily reached by mono-brand offerings. Examples from the fourth quarter include the launch of an exclusive 72-piece capsule collection from Dolce & Gabbana only available on MyTheresa.\n\nThe exclusive prelaunch of the Loro Piana resort collection on MyTheresa and the launch of an exclusive capsule collection from Christian Louboutin on MyTheresa. Moreover, we were able to offer our top customers true money-can't-buy experiences in collaboration with major luxury brands. For example, being the global exclusive partner to launch the La Grotta Azzurra collection, we hosted, together with Pucci, a three-day event on Capri, together with the designer. To celebrate the launch of an exclusive capsule collection and the 10-year anniversary of the brand, we hosted with Aquazzura a two-day event in Sorrento at the Amalfi Coast together with the designer.\n\nAnd as another example, to celebrate the exclusive launch of the Escape resort collection, we hosted with Valentino, a two-day event in San Tropez. Please see our investor presentation for even more details on our brand collaborations and experiences in the fourth quarter of fiscal year 2022. No other platform can offer its top customers such amazing experiences that excite the best customers and drive their loyalty. We have seen clearly improving repurchase rates in the fourth quarter for customer cohorts first acquired in Q2 of fiscal year 2022 compared to customer cohorts first acquired in Q2 of fiscal year 2021 as the negative impact of the war in Ukraine on large diminished.\n\nThe average spend per customer grew by plus 5.8% in the fourth quarter of fiscal year 2022 compared to Q4 of fiscal year 2021. The particular focus of our business are our top customers as they give the almost 100% revenue retention from year two onwards for newly acquired customer cohorts. Our top customer base grew by plus 22.1% in the fourth quarter of fiscal year 2022 compared to Q4 of fiscal year 2021. To engage and serve our top customers, we have again grown our team of personal shoppers around the world.\n\nThis allowed us to organize multiple intimate top customer styling events globally. The clear focus on high-end customer engagement is ultimately the key reason for luxury brands to continually intensify the partnership with us. Third, the fourth quarter saw several key milestones that will allow us to drive significant growth for our business in the future. In the fourth quarter, we had successfully transitioned six brands to our curated platform model, CPM.\n\nThis model allows us to curate and serve our customers as we do under the wholesale model, while the inventory ownership remains with the brand, which allows for better inventory management and control for them. Now, with a significant part of our total business being run on the basis of the CPM, it is evident that it does not have a negative impact on profitability. But to the contrary, CPM opened up significant growth opportunities for us. Please see the investor presentation for more details on the financial impact of the CPM.\n\nIn May 2022, we successfully launched a four-main category called Life in addition to our womenswear, menswear and kids were offering on MyTheresa. Life offers our high-end luxury customers a curated of our home and lifestyle products. We launched with a curated set of 50-plus brands across categories such as tabletops, furniture, glassware and vases, as well as travel and pet accessories and other lifestyle products. The offer combined fashion luxury brands such as Gucci, Dolce & Gabbana, Cazal and Missoni, with true lifestyle brands such as Vitra, Genovi, Alessi or Zanat.\n\nWith this category, we can drive further share of wallet penetration with our best customers. Already in June, we were able to launch some very exciting brand collaborations online. We launched an exclusive pop-up with luxury luggage brand Rimowa and we're their exclusive launch partner for the new quartz collection. Also, in June, we had the exclusive launch of Gucci Pets collection on MyTheresa.\n\nWith Life, MyTheresa solidifies its positioning as the luxury shopping destination for high-end customers. June also marked the on-time completion of the first building phase for our new central warehouse at Leipzig Airport, with the expected completion in fiscal year 2024. The new warehouse will not only provide enough capacity with its 55,000 square meter of building space for the future growth of our business, but it will also dramatically improve customer service, thanks to its unique location and direct adjacency to the international airfreight hub of DHL. We will benefit from significantly later cutoff times for international deliveries, additional flight options to the United States, and faster return processing from customs destinations.\n\nIn July, we also announced the addition of a new president for China and Asia Pacific to our organization with Steven Xu. Steven will drive the expansion of our team in Shanghai, as well as more localized customer engagement in the region. Despite the decrease of large-scale COVID related lockdowns, mainland China GMV grew by plus 22.5% in full fiscal year 2022 compared to fiscal year 2021. All the recent actions just mentioned support our long-term GMV growth, be it by regional expansion, category expansion, or share of wallet penetration of existing customers.\n\nThis comes on top, of course, of the continued shift of luxury consumers to online shopping. Bain and Altagamma predict that by 2025, still only 30% of the personal luxury goods spend will be online. With all the above, it should come as no surprise that we strongly believe in the medium-term growth trajectory of 22% to 25% annually for our business, despite the short-term challenges in the current environment. We are very satisfied with our performance in the fourth quarter of fiscal year 2022 and for the full fiscal year 2022.\n\nWe believe that our results demonstrate the fundamental strength and consistency of our business model delivering profitable growth. We see ourselves as one of the few winners in the clearly consolidating luxury e-commerce space. The combination of best brand partnerships and best high-value wardrobe building customer base gives us full confidence to continue achieving outstanding results in the future. And now, I hand over to Martin to discuss the financial results in detail.\n\nMartin Beer -- Chief Financial Officer\n\nThank you, Michael. I will now review the financial results for the fourth quarter and full fiscal year ended June 30, 2022, and we'll provide additional details on some of the previously mentioned factors influencing our performance. Unless otherwise stated, all numbers refer to Euro. GMV in the fourth quarter running from April to June was at EUR 196.7 million, an 18.2% increase from EUR 166.4 million in the prior year quarter.\n\nWith a quarterly growth rate of 18.2%, we were able to report again a strong two-year growth rate at 64.9%, fully in line with the two-year growth rates of preceding quarters between 65% and 68%. The consistency in our top line growth is further evidenced by our three-year growth rate of the quarter at 94.3%. For the full fiscal year 2022, GMV was at EUR 747 million, a strong growth of 21.3%. At constant currency, GMV growth for the full year would have been at 20.5%.\n\nThis small difference is due to the fact that less than a third of our revenues are dominated in currencies other than the Euro. And with that, our exposure to FX fluctuations is limited. As a reminder, GMV is one of our key value drivers as it shows the depth and growth of our customer relationships. In the fourth quarter, we delivered a strong GMV due to robust new customer growth and strong existing customer cohort performance.\n\nCustomer engagement and retention continue to grow as our active customers who shopped with us in the last 12 months grew by 16.4% to EUR 781,000. On a two-year basis, LTM active customers grew 61%. The robust two-year growth rate in active customers and higher retention speaks to our unique positioning, attracting a highly valuable multi-brand customer that appreciates our excellent serves. During the fourth quarter, net sales increased by EUR 12.5 million or 7.7% year over year to EUR 174.8 million.\n\nFor the full fiscal year 2022, net sales was at EUR 690 million, a plus of 12.7% compared to fiscal year 2021. As mentioned before, net sales is impacted by brands transitioning to our curated platform model. Before the transition and in the wholesale model, net sales is equal to GMV. After the transition and in the curated platform model, net sales is equal to the platform fee.\n\nDue to the onetime effects of selected brands transitioning from the wholesale model to our QA platform model, the increase in net sales is lower than the increase in GMV in the quarter. The difference in growth rates between GMV and net sales is purely a onetime financial accounting effect. As for the CPM brands, we now book the platform fee as net sales. 12 months after the full transition of those brands, this onetime effect will be over and net sales will grow in line with GMV again.\n\nAs planned, in the fourth quarter, six of the major brands were operating seamlessly under CPM. We are in a great position to offer both models in our interaction with brands. As mentioned before, in the fourth quarter, we once again saw significant growth in many regions of the world. The US remained a top growth region with 28% GMV growth compared to the prior year quarter.\n\nMainland China grew by 22.5% in fiscal year '22 despite the regional COVID-19 lockdowns. Our total orders shipped in the last 12 months increased by 17.2% to EUR 1.77 million. Return rates LTM were stable, and our AOV LTM increased by 5.2% to now EUR 626, one of the highest in the industry. Reported gross profits of EUR 94.8 million in Q4 increased by EUR 17.4 million or 22.4% year over year, even stronger than our GMV growth.\n\nThe gross profit margin of 54.2%, improved by 650 basis points compared to the prior year period, up 47.7%, driven by our growing share of CPM revenues, a higher share of countries with prepaid duties charged to the customer, and year-end accounting effects as always. Out of the 650 basis points increase, 290 basis points originated from the CPM effect. The underlying operative gross margin remained stable. Reflecting the ongoing focus on full price, fully consistent with the high-end position of MyTheresa.\n\nFor the full fiscal year 2022, MyTheresa achieved a gross profit of EUR 355 million, an increase of 23.7% compared to the fiscal year 2021. The gross profit margin for the full fiscal year 2022 increased to 51.5% compared to 46.9% in the full fiscal year 2021, mostly due to the before mentioned CPM effect. Also, for the full fiscal year, the underlying operated gross margin remained absolutely stable. The sustained stability in our operating gross profit margin over the past five years underlines our unique positioning in the market, maintaining full price selling and our ability to achieve a strong top line growth without compromising on customer quality.\n\nShipping and payment costs increased by EUR 7.5 million to EUR 27.1 million in the quarter, driven by an increase in total order ships. As a percentage of GMV, shipping and payment costs in the quarter increased to 13.8% from 11.7% in the prior year quarter. This increase of 210 basis points is mostly driven by an increasing share of countries where we pay all customs duties for the customer such as the US As mentioned before, the payment of these duties is reflected in our prices and therefore, increases our gross profit margin in respective countries in the same amount. If you exclude GDP costs, the shipping and payment cost ratio in relation to GMV was stable at 9.3% versus 9% in the previous year quarter.\n\nFor the full fiscal year 2022, the shipping and payment cost ratio in relation to GMV was at 13.1% versus 11.6% in fiscal year 2021. If you exclude the DDP costs, the shipping and payment cost ratio in relation to GMV also for the full fiscal year was stable at 8.9% versus 8.6% in the previous year. Despite increasing internationalization and cost pressures on logistics, we were again able to keep this ratio stable. During the fourth quarter, marketing expenses increased to EUR 26.6 million compared to EUR 22.3 million in the prior year quarter due to the number of new customers acquired.\n\nAs a percentage of GMV, marketing expenses were stable at 13.5% compared to 13.4% in the previous year quarter. For the full fiscal year 2022, the marketing cost ratio was stable at 12.9% compared to 13.2% in fiscal year 2021. Despite a strong increase in active customers with very good customer cohort performance, MyTheresa was able to once again keep the marketing cost ratio stable in the quarter and for the full fiscal year. Adjusted selling, general and administrative expenses grew by EUR 2.6 million or 10.6% to EUR 26.7 million in Q4.\n\nAdjusted SG&A expenses as a percent of GMV decreased by 90 basis points to 13.6% from 14.5% due to cost shifts between quarters and the previous fiscal year. For the full fiscal year 2022, the adjusted selling, general and administrative cost ratio was stable at 12.8% compared to 12.7% in fiscal year 2021. Despite a ramp-up of public company costs, we achieved cost leverage and personal expenses and were able to keep the adjusted SG&A expenses in relation to GMV stable. Adjusted EBITDA in Q4 of fiscal 2022 was EUR 13.8 million as compared to EUR 11.2 million in the prior year quarter.\n\nThe adjusted EBITDA margin was at 7.9% compared to 6.9% in the previous year quarter. This was a remarkable 100 basis points increase in profitability despite all the margin and cost pressures in the market. For the full fiscal year 2022, MyTheresa achieved an adjusted EBITDA of EUR 66.3 million compared to EUR 54.9 million in fiscal year 2021, and thus representing a significant growth of 20.7%. For the full fiscal year, the adjusted EBITDA margin increased to 9.6% from 9% in the previous fiscal year.\n\nThe strong adjusted EBITDA margin shows the strength and the resilience of our business model. And we continue to deliver an industry-leading performance on top and bottom line, which is a true exception in the industry. Depreciation and amortization expenses in Q4 were relatively stable at EUR 2.4 million or 1.2% of GMV compared to the prior year period at EUR 2.1 million or 1.3%. For the full fiscal year, this expense ratio in relation to GMV stayed stable at 1.2%.\n\nThe resilient profitability of our business model is also visible on operating income level. For the fourth quarter of fiscal 2022, MyTheresa reported an adjusted operating income of EUR 11.4 million compared to EUR 9.1 million in the previous year quarter. This represents a strong growth of 25.4% in the quarter. Our adjusted operating income or EBIT margin in this quarter was at 6.5%, 90 basis points higher than in the previous year quarter.\n\nFor the full fiscal year 2022, we achieved an adjusted operating income of EUR 57.2 million compared with the EUR 46.7 million in fiscal year 2021 and thus also representing a significant growth of 22.6%. For the full fiscal year, the adjusted EBIT margin increased to 8.3% from 7.6% in the previous fiscal year. To consistently report an EBIT margin at 8% is also remarkable. MyTheresa achieved this strong profitability also on adjusted net income level.\n\nAdjusted net income in this quarter was EUR 11.8 million as compared to EUR 7.6 million in the prior year period, representing an increase of 55.1%. Adjusted net income for the full fiscal year 2022 was at EUR 44.5 million compared to EUR 32.1 million in fiscal year 2021, an increase of 38.6%. This translates into a strong adjusted net income margin of 6.5% for the full fiscal year 2022. Also, on adjusted net income level, we have generated a multiyear track record of continued and resilient performance.\n\nWe focus on continuously delivering profitable growth, which is clearly visible in our very simple and transparent P&L. EBITDA, adjusted EBITDA, adjusted operating income and adjusted net income and their related margin percentages are non-IFRS measures. Moving to the cash flow statement. During the 12 months ended June 30, 2022, operating activities generated EUR 55 million positive operating cash flow, driven by our strong operating profitability and a decrease in owned inventories due to brand switching to CPM.\n\nNet increase in cash and cash equivalents was at a strong EUR 36.8 million. To be able to report a positive operating and free cash flow in fiscal 2022 also sets us apart from most players in the industry, and underscores that MyTheresa operates a superior capital-light model. This is also reflected in the continuous increase in our adjusted return on capital employed. From fiscal year 2018 to fiscal year 2022, we continuously increased and now have doubled the adjusted ROCE to a high 28.6% in fiscal year 2022.\n\nFor more information, please have a look at our investor presentation. MyTheresa has a multiyear track record of running a high return and a capital-efficient business model. We ended the quarter in a strong financial position with cash and cash equivalents of EUR 113.5 million, no bank debt, and total unused availability under the revolving credit facilities of EUR 60 million as of June 30, 2022. Turning now to our expectations for the current fiscal year ending June 30, 2023.\n\nMost of the unprecedented overall market challenges of the past quarters are still intact. A war in the middle of Europe, tensions around Taiwan, COVID restrictions in Asia and predominant inflationary pressures may also affect online luxury sales of high net worth individuals, but to a much lesser degree. Even in these times, MyTheresa has shown a strong top line and a highly resilient bottom line performance. But we also want to guide with prudence as the situation is less predictable.\n\nTherefore, our guidance for fiscal year '23 is GMV in the range of EUR 865 million to EUR 910 million, representing 16% to 22% growth. Net sales of EUR 755 million to EUR 800 million, representing 10% to 16% growth. Gross profit at EUR 410 million to EUR 435 million, growing in line with GMV, also representing 16% to 22% growth. And adjusted EBITDA in the range of EUR 68 million to EUR 76 million and an adjusted EBITDA margin between 9% and 9.5%.\n\nThe current unprecedented uncertainties and challenges in the environment will be overcome in our belief already next year. As in the past, the high-end customer will bounce back the fastest. Therefore, and we clearly outlined this in our investor presentation as well, we confirm our medium-term targets. We continue to target annual GMV growth of 22% to 25% medium-term.\n\nWe also target adjusted EBITDA to grow 22% to 25% per year in the medium-term with a slightly increasing adjusted EBITDA margin around 9% to 10%. In the long term, and with a higher share of existing customers in our GMV, we will be able to reduce our current 13% marketing spend of GMV substantially while still creating impactful experiences for our customers and positioning ourselves for a higher adjusted EBITDA profitability level longer term. We are very satisfied with our performance during the fourth quarter. We are proud to target a performance level for this fiscal year on top and bottom line that is exceptional and unparalleled in the industry.\n\nIt builds on MyTheresa's unique and undisputable leadership position in the online luxury market and its proven business model with a multiyear track record. I will now turn the call back over to Michael for his concluding remarks\n\nMichael Kliger -- Chief Executive Officer\n\nThank you, Martin. We are very pleased with the fourth quarter and full fiscal year earnings results. We see ourselves perfectly positioned to take advantage of the ongoing shift to online and luxury spend, the continued consolidation in digital platforms, and the global market share expansion opportunities. We are confident that MyTheresa offers high-value consumers the best multi-brand digital shopping experience there is.\n\nAnd with that, I'd like to ask the operator to open us for your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Matthew Boss from J.P. Morgan. Matthew, your line is open.\n\nPlease go ahead.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks and congrats on a nice quarter. You cited in the release that clearly consolidating luxury e-commerce space. Maybe could you elaborate on the consolidation that you're seeing in the industry? And what gives you confidence in MyTheresa's unique positioning and business model to take market share over time?\n\nMichael Kliger -- Chief Executive Officer\n\nSure. I mean, we have been saying for quite a while that we fundamentally see two models based on customer demand. One is the curated multi-brand and the other is the marketplace. And what we believe we see is that around these two positions, there's consolidation.\n\nThere is clearly in the marketplace, a player like Farfetch, who has successfully consolidated and is leading, and we see ourselves as a leader in the multi-brand curated. And I think there is consolidation. And in terms of financial performance and in terms of customer feedback, we do see ourselves as the best placed in multi-brand curated offers. And that these two models exist is by customer demand.\n\nSo this is not business model discussion, it's an understanding of customer needs. And we think, we always believe there will be consolidation. The pandemic seems to have accelerated this.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. And then, maybe just a follow-up. Could you speak to trends that you've seen maybe across regions or categories in the first quarter to date? And just what are your expectations for luxury e-commerce growth in '23 that supports your above-market GMV guidance for this year?\n\nMichael Kliger -- Chief Executive Officer\n\nSo in terms of trends, I mean, June, July, August, heavily influenced by vacationing. So we continue to have strong sales in swimwear, outerwears, resort, vacation wears. So these were very strong, and they continued way into the late summer. I think our core customers did double or triple the vacationing we did before.\n\nAnd we were right on mood with many of our exclusives, many resort collections. And now we see the swing back to what we already saw in spring, which is festivities, parties, social gatherings. If you go across regions, of course, China, to some extent, Korea still in, now again, in a more less festive, less party, at least regionally driven by lockdowns, by restrictions. But the outcome of this is clear, whenever this is overcome, it will again have the same trend as we saw in the US and Europe.\n\nPeople will make up for that. US continues to be very strong and Europe, ever since sort of at least sentiment wise, the war on the continent has been digested, it still exists, but in terms of customer sentiment, we have seen back to normal and '23 fully accept there are a lot of uncertainties out there, challenges. But at least for those that we know today, we believe our focus on the high-end, our focus on luxury, our focus on an agile business model allows us to address all those challenges.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat color. Best of luck.\n\nOperator\n\nThank you. Our next question is from Oliver Chen from Cowen. Oliver, your line is open. Please go ahead.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, Michael and Martin. Great results. Our Cowen data is showing increasing pressure at the high-end and investor concern is definitely around higher energy costs in Europe. So I would love your thoughts there.\n\nAnd should you have been more conservative given so many unknown variables? Also, you had a very impressive full price selling. What is your guidance assumed for promotions, we're more broadly constrained about promotions in the marketplace. However, you have a unique model with a focus on curation and a very high-end customer. A follow-up.\n\nYou added a lot of new customers this quarter. What are your thoughts on their cohort behavior and if they'll be one and done or the process for retention and customer lifetime value execution. Thank you.\n\nMichael Kliger -- Chief Executive Officer\n\nThank you, Oliver. So let me address those three. So first on energy. There are two ways to look at it.\n\nWhat does energy cost does do to our business model? Very little. When you look at our results, what we have achieved this fiscal year is increased our AUV again, which is quite a testament to that we focus on the high end. Our AOV is now above 620. We grew it close to 6%.\n\nIf the basket grows to close 6%, even the dramatic increase in energy, which then drives shipping costs can be fully digested because on the 600-plus AOV, 626 that is mitigated fully. On the consumer side, yes, energy prices are going up dramatically and that does impact household income in the medium tier, but the increase in cost does not affect in terms of material, meaning to their discretionary spend. It just doesn't matter. Sentiment wise is something else, but it just doesn't matter.\n\nOn the promotion side, promotions is really the result of overstock. And we don't see a huge amount of overstock at the moment in the market. Our policy has always been to focus on full price. We does have customers that go for newness for the latest for capsules for exclusives, not for the best bargain.\n\nSo we also feel we are well prepared should be a return to higher promotional intensity. And lastly, cohorts, as always and as always explained, this is the most important focus of our business, is the quality of the customers we acquire is the lifetime development of our customers on par with the past. And I can only report back that also the customers we acquired in Q3 and Q4 showed the same pattern as before, which is positive.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you, Michael.\n\nOperator\n\nThank you. [Operator instructions] Our next question is from Kunal Madhukar from UBS. Kunal, your line is open. Please go ahead.\n\nKunal Madhukar -- UBS -- Analyst\n\nGood. Thanks. And thank you for taking my question. A couple, if I could.\n\nOne, on the GMV growth expectation of 16% to 22%, you grew 16% in the second half of this year. So the 16% is kind of in line with the trend. So the 16% to 22%, how do you see that kind of evolving through the year, next year? That's one. And second, a follow-up on China and just trying to understand because most of the other players within the luxury space have kind of said China is down or was down last quarter, it was 30% to 40%.\n\nWhat are you seeing in terms of, not the full year, but for the last quarter, what are you seeing in China trends? Thank you.\n\nMichael Kliger -- Chief Executive Officer\n\nOn the first question, yes, it is 16% for the half year. But again, I think our momentum is key. We grew in Q3 '13, and we grew in Q4 '18. So we're accelerating.\n\nSo we have accelerated from Q3 into Q4, and we continue to see that development. And therefore, our 16% to 22% is based on a momentum that has increased ever since April. That's No. 1.\n\nNo. 2, China is difficult, no question about it. I mean, driven by large-scale lockdowns in population sizes of 40 million each. But again, China is a huge market.\n\nChina will have the same behavior as other regions as they overcome the pandemic, whether they overcome it in six months and 12 months, it depends on what programs they launch the next couple of months, but we are very optimistic and Martin, I believe we have the number for China. We have grown again in China. Can you remind --\n\nMartin Beer -- Chief Financial Officer\n\nExactly. We also grew strongly in China in Q4, but we give the overall growth rate of China for the full fiscal year and in the full fiscal year, Mainland China grew by 22.5%.\n\nKunal Madhukar -- UBS -- Analyst\n\nGreat. And as a follow-up, if I could. So as far as China is concerned, what are you doing differently versus other folks that you are growing, whereas they are declining 30% to 40%?\n\nMichael Kliger -- Chief Executive Officer\n\nI mean, two points. One, we have to admit. We are, by far, not as big as some of the luxury brands in China. So we come from a different basis, which means we have a huge opportunity going forward.\n\nBut then one of the key aspects why we, as we report today are very confident on the outlook, we focus on the luxury customer. We focus on the wardrobe building customer. We do not focus on the aspirational luxury customer. So China is a gigantic luxury market also because even in very younger terms in comparison to Europe, customers, consumers want the luxury bag.\n\nIt's one of the first purchases to demonstrate social climbing. That's why it's a huge accessory market. These are customers that sometimes save money to afford themselves 4K, 5K luxury bag, that's really an icon for them of social climbing. That is, of course, if times get tough, certainly a customer segment that we'll postpone, delay.\n\nWe serve customers that build wardrobes. They're in a different tier. They buy, as we reported in the past, Alaia, Loro Piana, this is really a wardrobe building customer and thus, will, of course, at some point also be affected by economic concerns. Be it in the real estate or the capital markets, but not at the moment.\n\nAnd this gives us a far stronger installation, not only in China, across the globe, because we serve a different and much more elevated customer base than other platforms.\n\nKunal Madhukar -- UBS -- Analyst\n\nGreat. Thank you so much, Michael. Thank you, Martin.\n\nOperator\n\nThank you. Our next question is from Abhinav Sinha from Societe Generale. Abhinav, your line is open. Please go ahead\n\nAbhinav Sinha -- Societe Generale -- Analyst\n\nHi. Thanks for taking my question. A couple of questions from my side. So, one is when you say 16% to 22% growth, can you give us some color on like how that will get executed? Like what will it be in terms of basket size? Or will it be purely in terms of number of customers or something else? And second thing is when you talk about the 5% to 6% growth in the average order value for 2022, how much of that was inflation driven and how much of that was like underlying strong customer basket size?\n\nMichael Kliger -- Chief Executive Officer\n\nLet me start with the second, the increase in basket value was not item-driven but value of item. So it's clearly higher value, but there are two effects in there. There is inflation, but inflation is a difficult word for our type of product because 80% of what we sell didn't exist last year. So it's a new product.\n\nAnd so, it is more than a bag that was put out last year was maybe a 2K and now the new lines of bags sit at 2,500 that you can really have apple-to-apple items that were produced last year is not as clear in luxury fashion where products are constantly coming out in new collections. So, but it's more valuable items that we sell. That's the driver for that. And the first question is, we clearly face the assumption on the one hand, continued increase of spend per customer.\n\nThis is not just basket, it's just how often and how loyal they are. This is one of the drivers that we saw this year with over 5% more spend per customer in our business. We drive loyalty, we drive average spend of our best customers through personal shoppings, but the main driver continues to be new customer acquisition.\n\nAbhinav Sinha -- Societe Generale -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question is from Lauren Schenk from Morgan Stanley. Lauren, your line is open. Please go ahead.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nGreat, thank you. Just two quick, I guess, housekeeping questions. Just first, on the acceleration in GMV from the third quarter to the fourth quarter. I think last quarter, we talked about some delays in spring delivery timing shifts, which at the time you thought might be three or four points of growth out of 3Q into 4Q.\n\nSo I just wanted to confirm that that did happen and that three- to four-point estimate is still accurate. And then, just secondly, in terms of timing, in terms of the CPM rollout and when GMV and sales should send to go in line again, are we still looking to fiscal '24 for the full year? Thanks so much.\n\nMichael Kliger -- Chief Executive Officer\n\nYes. Martin can take the second question. On the first one. The delay in deliveries was actually a discussion we had from Q2 to Q3, Martin, if I believe correctly.\n\nMartin Beer -- Chief Financial Officer\n\nIt was between Q3 and Q4. Lauren is right, it was because of March to April.\n\nMichael Kliger -- Chief Executive Officer\n\nOK. And yes, so completely right, Lauren, from Q3 to Q4. There was a shift. It was a bit smaller.\n\nBut yes, that shift in deliveries happened. But, I mean the 3% to 4% is basically the inventory shift. This cannot be translated into direct sales impact. Timing of the CPM effect we, obviously, in fiscal year, in this running fiscal year '23, the big effect of the first six brands will be fully digested.\n\nRemember, we started with the first brand already in Q1, so July, August, September of last year. And so, this will, the 12 months is per brand when the full effect is over, when the net sales of the brand then increases in line with GMV again. So there's shift effects in this running fiscal year of the first brand and then the following five brands. There will be one to three additional brands might come in this year.\n\nSo that's why we clearly guided the net sales for this year of 10% to 16%. And obviously in, with this, with the end of this fiscal year, then I mean those shift effects for those brands are over. And obviously, then the net sales growth are, is very much in line with GMV. The difference between the growth rates is then smaller and smaller.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nOK. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMartin Beer -- Chief Financial Officer\n\nMichael Kliger -- Chief Executive Officer\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nKunal Madhukar -- UBS -- Analyst\n\nAbhinav Sinha -- Societe Generale -- Analyst\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nMore MYTE analysis\n\nAll earnings call transcripts"
}