{
  "companyName": "Walker & Dunlop",
  "companyTicker": "WD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/walker-dunlop-wd-q3-2022-earnings-call-transcript/",
  "content": "Walker & Dunlop (WD -0.73%)\nQ3 2022 Earnings Call\nNov 09, 2022, 8:30 a.m. ET\n\nKelsey Duffey\n\nGood morning. I'm Kelsey Duffey, senior vice president of investor relations at Walker & Dunlop, and I would like to welcome you to Walker & Dunlop's third quarter 2022 earnings conference call and webcast. Hosting the call today is Willy Walker, Walker & Dunlop chairman and CEO. He is joined by Greg Florkowski, executive vice president and CFO.\n\nToday's webcast is being recorded, and a replay will be available via webcast on our investor relations section of our website. [Operator instructions] This morning, we posted our earnings release and presentation to the investor relations section of our website. These slides serve as a reference point for some of what Willy and Greg will touch on during the call. Please also note that we will reference the non-GAAP financial metrics, adjusted EBITDA, and adjusted diluted earnings per share during the course of this call.\n\nPlease refer to the appendix of the earnings presentation for a reconciliation of these non-GAAP financial metrics. Investors are urged to carefully read the forward-looking statement's language in our earnings release. Statements made on this call, which are not historical facts, may be deemed forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements describe our current expectations, and actual results may differ materially.\n\nWalker & Dunlop is under no obligation to update or alter our forward-looking statements, whether as a result of new information, future events, or otherwise, and we expressly disclaim any obligation to do so. More detailed information about risk factors can be found in our annual and quarterly reports filed with the SEC. I will now turn the call over to Willy.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nThank you, Kelsey, and good morning, everyone. W&D delivered exceptional service to our clients during a volatile and challenging third quarter. Seventeen billion dollars of total transaction volume was very strong and is thanks to our people, brand, and the use of technology in everything we do. I've been CEO of Walker & Dunlop for 15 years.\n\nI've seen a lot, the housing boom and bust, the great financial crisis, dramatic regulatory changes, new administrations, a pandemic, and I've watched this amazing company deal with adversity, adjust, and continue growing. W&D shareholders should be confident in three things. Number one, our scaled lending partnerships with Fannie Mae, Freddie Mac, and HUD provide our clients with much-needed countercyclical capital during times of market dislocation. Number two, our business model, which includes consistent servicing and asset management fees, along with escrow income that expands as rates rise, has consistently outperformed in down markets.\n\nAnd number three, our disciplined credit culture on loans we originate, as well as our own balance sheet, will allow us to expand while others contract over the coming months and years. We have no greater insight than anyone else on how the markets will evolve over the coming quarters. But we are better positioned than any competitor firm in our industry to continue providing solutions to our clients, maintain our exceptional team, and continue investing toward our five-year growth plan, the Drive the '25. Seventeen billion dollars of total transaction volume in Q3 generated total revenues of $316 million, down only 9% from Q3 of last year.\n\nIn this rising rate environment, every deal, whether a sale or refinancing, is underpricing pressure. Spreads on our agency lending remain compressed as we work closely with Fannie Mae and Freddie Mac to make deals work for our clients. Good news, we closed a lot of financing in Q3. Bad news, we saw a steep decline in our noncash mortgage servicing rights revenue and net income.\n\nThis pricing pressure is solely due to interest rate increases, and it will abate the moment rates stabilize. To underscore this point, in Q3 of last year, the capital markets were flooded with competitors lending at tight spreads and low rates, and our average gain on sale margin was 165 basis points. This year, in a quarter when competitors withdrew, our average gain on sale margin was 123 basis points, down 25%. That pricing compression is due to the 10-year Treasury jumping over 100 basis points during the quarter and our need to adjust prices to meet our client's needs.\n\nWhen the Fed stops dramatic rate increases at every meeting, spreads on our agency lending should normalize and our average gain on sale margin will recover. Our scaled and enduring partnerships with Fannie Mae and Freddie Mac provided much-needed countercyclical capital to the multifamily market during the quarter. Year to date, lending volume with the GSEs is $13 billion. And as you can see on Slide 4, $9 billion of volume with Fannie Mae is 17% market share, keeping us on track to be Fannie's largest lending partner once again.\n\nTwo additional comments on pricing deals to win. First, we added $1.8 billion of loans to our servicing portfolio in Q3 and the average servicing fee increased from 24.6 basis points to 24.7 basis points as payoffs had lower average servicing fees than the new loans we added. Second, we get paid for our risk via our servicing fees, so tighter servicing fees would hopefully correspond to lower risk. The weighted average loan-to-value on the risk-sharing loans we originated in Q3 was 57%, down from 61% last year.\n\nWe feel extremely good about the loans, credit quality, and customer service we delivered in Q3. And as soon as rates stabilize, our servicing fees and capitalized MSRs should revert to historic averages. Cash revenues and earnings continued to grow in Q3. Adjusted EBITDA expanded to $75 million, up 4% year over year, while adjusted EPS, which strips out the impact of noncash items, was up 5% to $1.55.\n\nThese numbers are reflective of W&D's terrific business model. As banks, debt finance, and CMBS lenders pulled out of the market in Q3, our capital markets group had a surprisingly strong quarter with $6.6 billion of debt brokerage volume. Similarly, as multifamily sales volumes fell precipitously, off 17%, according to RCA, our property sales team closed $5 billion of volume, down only 5% from last year. These numbers are truly exceptional in comparison to our competitors' published numbers for Q3 and show the ability of our bankers and brokers to deliver for our clients in challenging markets.\n\nWe expect to see softening in both of these executions in Q4, but feel very good about our team's ability to continue growing market share in 2023. All of our teams excelled for our clients in Q3. According to Bain & Company, the most relevant question to determine customer service is would you recommend this product or service to a friend? The answer to that question on a scale of negative 100 to positive 100 is your net promoter score. The average net promoter score in the financial services industry is 44.\n\nWalker & Dunlop's net promoter score is 91, over 2X the industry average. And beyond providing exceptional customer service, we continue to use technology to identify and attract new clients to Walker & Dunlop. In Q3, 69% of our refinancings were new loans to Walker & Dunlop, and 30% of our total transaction volume was with new clients. Rising rates and economic headwinds may curtail business volumes in the short term, but Walker & Dunlop's service level and use of technology position us exceptionally well to continue to outperform going forward.\n\nWe built or acquired complementary businesses in affordable housing, research, small-balance lending, and appraisals over the past three years. Zelman and Alliant, our two major 2021 acquisitions, contributed nearly $30 million in revenues in Q3 and are both on budget for 2022. Hindsight is always 20/20 vision, but it speaks volumes about W&D's M&A strategy, that our two largest recent acquisitions were not pro-cyclical, such as expanding our banking or broking operations, but rather enduring consistent business models that perform in good and bad markets. And GeoPhy, the largest technology investment we've ever made, is focused on accelerating the growth of our small-balance lending and appraisal businesses.\n\nAll of these investments get us very excited about W&D's future growth. Our servicing portfolio grew to $121 billion, up 6% over Q3 2021 and generated $76 million of income on the quarter. Eighty-nine percent of the servicing fees in our portfolio are prepayment protected. And as Greg will explain in a moment, the escrows inside that portfolio earned more and more as rates rise.\n\nWhen the great financial crisis in 2008 and pandemic in 2020 hit, our first concern was credit. Would W&D suffer significant loan losses? The answer was no due to W&D's credit culture and the strength of multifamily as an asset class. Today, as we look at our portfolio and the fundamentals of multifamily, the answer is no once again. We have an exceedingly clean book thanks to our team and credit discipline.\n\nWe have no credit exposure to office, retail, or other commercial real estate asset classes. We have no credit risk on construction loans. We did not make nor carry credit risk on any CLO loans. And the weighted average debt service coverage ratio in our at-risk servicing portfolio currently sits at 2.32 times.\n\nLet me put that into context. Our minimum debt service coverage ratio on new loans is 1.25 times and the overall portfolio currently sits at 2.32 times. Credit is not a concern. I will now turn the call over to Greg to discuss our Q3 results and financial outlook in more detail, and then I'll come back with thoughts about 2023 and beyond.\n\nGreg.\n\nGreg Florkowski -- Executive Vice President and Chief Financial Officer\n\nThank you, Willy, and good morning, everyone. Our $17 billion of transaction volumes this quarter generated total revenues of $316 million, down 9% from the third quarter of last year, and diluted earnings per share of $1.40, down 37% compared to last year. As a result of the spread and pricing dynamics Willy just described, our noncash [Technical difficulty] revenues dropped 38% despite nearly flat Fannie Mae volumes. The decrease in MSR revenues caused our operating margins and return on equity to fall below our target ranges at 17% and 11%, respectively.\n\nOur value proposition includes navigating challenging markets on behalf of our clients and closing the deal that works for them. And this quarter, we were able to deliver for our clients when they needed us most. Importantly, our agency lending grows our servicing portfolio and increases our long-term stable cash revenues, which occurred yet again this quarter as the servicing portfolio increased to $121 billion. As a result, our cash revenues expanded and our adjusted EBITDA grew 4% to $75 million and drove 5% growth in adjusted earnings per share to $1.55 this quarter.\n\nA further benefit of our servicing portfolio is that $3 billion of escrow earnings we hold. Sharp increases in short-term rates disrupted transaction volumes but dramatically increased our escrow earnings. This quarter, escrow earnings increased nearly 800% to $18 million, compared to only $2 million in the year-ago quarter. Another contributor to growth in adjusted EBITDA and adjusted EPS is the acquisitions of Alliant and Zelman.\n\nOn a combined basis, these businesses generated nearly $30 million of primarily cash revenues this quarter, highlighting the benefit of the investments we made in the stable subscription revenues of Zelman and the assets under management at Alliant. In the first quarter of 2022, we introduced segment financial results to provide more transparency into our operating structure and overall financial performance. As shown on Slide 7, our capital markets segment, which drives transaction volumes, generated revenues of $183 million this quarter, down 27% compared to last year. Expenses for the segment fell 8%, largely due to lower variable commissions from lower transaction-related revenues which helped produce break-even adjusted EBITDA for the segment this quarter.\n\nA little more than 60% of compensation costs are variable for this segment, mitigating expected declines in transaction-related revenues for the rest of this year. We are confident our team will continue to deliver strong GSE and HUD volumes due to the countercyclical nature of the capital but recognize our debt brokerage and property sales teams will face pressure as liquidity from banks and other executions pull back. Our long-term outlook for our capital markets team remains unchanged despite the headwinds, and we will continue making investments to sustain our long-term growth objectives for this segment. Our SAM segment includes the performance of our servicing activities and asset management businesses.\n\nAs shown on Slide 8, revenues for our SAM segment grew 40% this quarter, or $39 million, due to increased servicing fees, escrow earnings, and revenues from Alliant. The growth in revenues generated 69% growth in operating income and 30% growth in adjusted EBITDA. The revenues within our SAM segment are resilient and growing. Our loan servicing portfolio is generating over $300 million of annual recurring revenues, and the prepayment-protected duration of the portfolio is nearly nine years.\n\nOur long-term strategy to grow our assets under management is paying dividends as our $17 billion of assets under management earned $83 million of revenues year to date. Lastly, short-term rates continue to increase, and escrow and other interest income will continue to drive growth in cash and adjusted EBITDA. Our corporate segment represents the corporate G&A of our business and also includes our corporate debt expense. As shown on Slide 9, the net loss for this segment decreased $3.4 million, or 11%, this quarter, while adjusted EBITDA increased 3% from the year-ago quarter.\n\nA few things to highlight. Total compensation costs were down $10 million as we made downward adjustments to our company bonus and performance-based equity accruals this quarter on our revised outlook for 2022, which I'll explain in a moment. Those downward revisions were offset by a $7.5 million increase in interest expense on our corporate borrowings as our term debt is indexed to SOFR. During the quarter, we also restructured our legal entity organizational chart and repatriated the intellectual property acquired from GeoPhy earlier this year.\n\nThe impact of which was an overall reduction in future tax liabilities of about $6 million, or approximately $0.20 of diluted EPS, which reduced our consolidated annual effective tax rate to 14% this quarter. This was a one-time benefit of the restructuring, and our annual effective tax rate will return to its normal level of about 27% next quarter. Year to date, total transaction volumes are up 27%, but operating margin and return on equity remain below our target ranges at 22% and 14%, respectively, due largely to the declines in noncash revenues we began experiencing in the second quarter. Our year-to-date diluted EPS is $5.13, down 10% compared to the same period last year.\n\nYear to date, adjusted EPS is up 10%, reflecting our business's ability to generate cash even as the transaction markets slow down. Over the last 90 days, [Audio gap] of a global recession impacted transaction volumes and caused servicing fees on new loans to remain at lower levels. We expect servicing fees on new loans to remain at current levels for at least the rest of 2022, and we do not expect transaction activity for our broker and investment sales transaction executions to rebound until interest rates stabilize. As shown on Slide 10, we are now projecting diluted EPS will be down between 15% and 20% this year.\n\nNotably, year-to-date personnel expense as a percentage of revenue is 48%, in line with last year. Our variable costs will adjust downward in line with any decline in transaction revenues in the fourth quarter. And that, coupled with the strength of our servicing and asset management revenues, gives us confidence that we will deliver growth in adjusted EBITDA in 2022 in the mid-to-high single digits. We are not making any adjustments to our ROE or operating margin targets, but expect to perform at the lower end of the ranges.\n\nAs we look ahead, we reviewed our operating costs and have been actively reducing expenses based on our outlook for lower transaction volumes next year. These reductions will largely impact our G&A costs, and most will not be realized until next year. We are not immediately reducing headcount, but we have significantly curtailed our planned new hires and becomes more selectively backfilling positions. As you can see on Slide 11, we operate an efficient business, generating over $900,000 of annualized revenue per employee.\n\nAt the top of our peer group by a wide margin. Importantly, over half of our compensation costs are variable, causing compensation expense to naturally adjust downward for any declines in transaction revenues. We are in a service business, and we believe that our people and culture differentiate us, as reflected in the net promoter score Willy outlined. We do not intend to disrupt the quality of that service by reducing headcount, and we believe our business model and access to countercyclical capital allow us to invest in our people to not only continue growing market share in the coming months but take advantage of the opportunity when transaction volumes rebound in 2023.\n\nWe ended the third quarter with $152 million of cash on the balance sheet, in line with the end of Q2. We prioritized investing in the business this quarter and used capital to pay down principal on our outstanding debt, fund co-investments to grow our asset management business, bring on three new property sales teams, and fund obligations under our purchase agreement with Alliant. Given the number of opportunities to invest nearly $50 million back into the business this quarter and our desire to maintain a strong cash balance, we did not repurchase shares. We continue to generate a healthy amount of cash to fund our operations and invest in the business.\n\nAnd yesterday, our board approved a dividend of $0.60 per share again this quarter, payable to shareholders of record as of November 25th, 2022. We will have returned nearly $100 million of capital to shareholders this year through a combination of share repurchases and dividends. And we continue to prioritize this closely with investments in the business. We face a challenging macro backdrop, and several of our operating metrics like diluted EPS, operating margin, and ROE will remain under pressure in the near term due to lower servicing fees on new loans and lower transaction volumes.\n\nOur ability to generate cash and growth in adjusted EBITDA is not tied to lower -- to the transaction markets. Our servicing portfolio provides over $300 million of annuity-like cash flows. And as shown on Slide 12, our escrow earnings are growing and fully hedged our floating rate debt. As Fed funds has now reached 4%, our escrow earnings will generate between $100 million and $115 million of annualized revenues, more than offsetting increases in floating rate debt expense and providing between $55 million and $70 million of annualized operating income.\n\nWe also have a healthy balance sheet with $711 million of corporate debt, and we continue to maintain a strong cash position. Our corporate debt to adjusted EBITDA has declined from 2.4 times at year-end to just over two times today, largely from the continued growth in adjusted EBITDA. We have a resilient and diversified business model that will continue to generate strong cash flow despite the uncertain macroenvironment. We remain focused on managing costs to operate an efficient platform while investing in our business to create long-term profitable growth.\n\nI will now turn the call back over to Willy.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nThank you, Greg. Walker & Dunlop's exceptional business model generates strong cash flows in up and down markets. If you look back at our performance coming out of the GFC and pandemic, after initial market overreaction, W&D wildly outperformed the competition due to our access to countercyclical capital, focused business model, and disciplined credit culture. If you look at Slide 14, with W&D in dark blue, after getting hit harder in the market sell-off than the S&P, CRE services providers, and mortgage originators, W&D recovered quickly in 2020 and moved dramatically higher than the market and the competition.\n\nThis was due to our access to countercyclical capital, which not only provided needed liquidity when the market dislocated but also in its aftermath when the competitive landscape was deserted. Remember that Walker & Dunlop surpassed J.P. Morgan and Wells Fargo in 2020 as the largest provider of capital to the multifamily industry. Then fast forward to 2021 when the investments we made in debt and property brokerage rebounded, when you see why the W&D business model is so powerful.\n\nAnd unlike 2021, when the Fed funds rate was zero, in this higher interest rate environment, we will continue generating high-margin revenues on our escrow balances. When I joined Walker & Dunlop in 2003, we had a $6 billion servicing portfolio. Today, that portfolio is 20 times bigger at 121 billion. And as Greg just mentioned, it generates $76 million in revenue in Q3.\n\nAdd to that our asset management business, which is currently making first trust preferred equity and JV equity investments while many competitors sit on the sidelines, and you see the W&D strategy of building long-term durable revenue streams come front and center. And our affordable housing platform, Alliant, is a market leader in the much-needed and focused on area of affordable and workforce housing. Even in this elevated rate environment with the potential for a recession in 2023, we reiterate our confidence in achieving our five-year Drive to '25 growth plan. Can we get to $65 billion of annualized debt financing? We've done 54 billion of debt financing over the past four quarters.\n\nWill we get to $25 billion of multifamily investment sales? We've done 26 billion over the last 12 months, a $160 billion servicing portfolio. In a higher rate environment, existing loans get stickier and our bankers and brokers have shown time and again how to take market share. The new businesses of small-balance lending, appraisals, affordable debt and equity, research, and investment banking add significant cash revenues and will accelerate the growth of our scale banking and brokerage businesses. Reaching our revenue target of $2 billion is highly achievable.\n\nAnd while GAAP EPS is pressured in 2022 due to the lower noncash mortgage servicing rights, a return to normalized servicing fees and MSRs, in conjunction with increased escrow, asset management, and servicing income, will push us over $13 a share by 2025 in our current modeling. Yesterday, we celebrated Walker & Dunlop's 85th anniversary, 85 years since my grandfather and great-uncle started this company. We have weathered many economic cycles at W&D. My family has lived through all of those cycles and tried to provide consistent, visionary leadership throughout.\n\nAnd as we weather the current economic headwinds, it is very clear that W&D is exceptionally well positioned. I would reiterate the three points I made to open this call. W&D has access to countercyclical capital, which will allow us to continue meeting our client's needs. W&D's business plan performs in both up and down markets.\n\nAnd our conservative lending and corporate debt structure positions us very well in times of uncertainty and opportunity. Walker & Dunlop's people, brand, and technology are world-class. We will continue winning with our clients, with our partners, and for our investors. I will now turn the call over to Kelsey to open the line for questions.\n\nKelsey Duffey\n\nThe line is now open for questions. [Operator instructions] Our first question is coming from Jade Rahmani at KBW. Jade?\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nJade, we can't hear you.\n\nGreg Florkowski -- Executive Vice President and Chief Financial Officer\n\nYou're on mute.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nStill nothing, Jade.\n\nGreg Florkowski -- Executive Vice President and Chief Financial Officer\n\nNow, you're good.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nAnd I think you just came through, Jade. Try now.\n\nJade Rahmani -- Keefe, Bruyette and Woods -- Analyst\n\nOh, thank you very much. Sorry about that.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nYeah, it's OK.\n\nJade Rahmani -- Keefe, Bruyette and Woods -- Analyst\n\nOn the transaction volume outlook, quite impressive performance in the quarter. I was wondering if you could give any fourth quarter update on how things are trending. You said you don't expect things to pick up. The Fannie Mae volumes, in particular, were extremely strong, and also broker loan volumes were much stronger than some of the performance we've seen elsewhere.\n\nThey were up 3% year on year. Just on those two line items, maybe, could you provide any comment?\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nFirst of all, Jade, thanks for joining us this morning. It's a -- look, first of all, we're not giving explicit volume guidance for Q4. As you underscored, Q3 volumes were stronger than any of the competition that I've read earnings releases on. And I think that, as I said previously, speaks to our team and their relationships and relevance to our clients.\n\nI would say this on Q4 transaction volumes, there's still quite a bit of carryover from Q3 into Q4 on the investment sales side. And so, we are still seeing sales happen. The real question is the, if you will, the replenishment of the pipeline, and that is slowed down significantly, as I said in my comments. On the capital market side, many of those bankers and brokers in that group are very focused on agency financing right now.\n\nAnd then as it relates to the agencies, what we're generally seeing is that Freddie Mac stepped into the market very strong in October, into the beginning of November, and was pricing deals to win and won a lot of business over the past several weeks. Freddie Mac will get to a point in the next couple of weeks where they can no longer process business in 2022. And I would think that that then opens a lane for Fannie Mae to step back into the market and price deals to win. And so, as you know, our various scale relationships with Fannie and Freddie are very valuable to us.\n\nAnd right now, they are dominating the lending market, as they have in the past, and as they will likely do going well into 2023.\n\nJade Rahmani -- Keefe, Bruyette and Woods -- Analyst\n\nThank you very much. On the gain on sale margins, that was definitely one of the big variances versus our model. And I think when we met, you were hopeful that there could have been a trough in margins in July, thereabouts. Do you still believe that's the case? Can you give any directionality on where you expect the gain on sale margin to be headed?\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nYeah. Jade, when we did meet here in New York back in the late summer, early fall, I did express to you that I was hopeful that we had hit the trough and that things were going to come back out. Quite honestly, that inflation print that we saw and the Fed raising by another 75 basis points basically put the pricing situation right back to where it was. Because if you think about it, our borrowers, if we quote a deal for them, and let's back up a month, and we would say that the indicative pricing was going to be a 525 coupon rate, and all of a sudden rates, move up by 30 basis points on the base rate, on the 10-year Treasury.\n\nAnd now, all of a sudden, we're looking at pricing at 550. We've got to work to get back to that 525. And so, we and Fannie Mae would sit there and look at our G fee and our S fee if I make that type of a deal work. And so, that's the type of pricing pressure we are dealing with right now.\n\nI would underscore what I said in my prepared remarks, which is just that this is all rate driven. It's not competitive landscape driven. And as a result of that, once we get any type of stabilization from the Fed, I think we will see spreads widen, and I think we will see the ability to price back to normalized servicing and guarantee fees, which will obviously help that noncash mortgage servicing rate line item as it relates to both revenues and net income.\n\nJade Rahmani -- Keefe, Bruyette and Woods -- Analyst\n\nThank you very much.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nThank you.\n\nGreg Florkowski -- Executive Vice President and Chief Financial Officer\n\nThanks, Jade.\n\nKelsey Duffey\n\nThank you, Jade. Our next question comes from Steve Delaney at JMP. Steve.\n\nSteven Delaney -- JMP Securities -- Analyst\n\nGood morning, everyone. Thank you for taking the question. Willy, pretty remarkable. I think that top-line transaction volume and revenues, you know, we're down but, you know, in high single digits on a year-over-year basis given what we've been through.\n\nI think we know the rate -- you have a rate-driven business with respect to your customers doing transactions and their demand for 10-year fixed-rate loans. Given where we are, I assume there are some disrupted business plans with your borrowers' properties. Given your relationship with the agencies, is this an opportunity for W&D to step in and expand your bridge lending business, possibly to include extension loans? The CLO market is essentially -- it's not close, but it might as well be, so all the commercial mortgage rates, etc. are not in a position to step in.\n\nYou have capital. Is that an area where, over the next two or three quarters, you see opportunity? And is part of that, specifically Freddie Mac has this Q-Series program that they're trying to reactivate, you know, could that be part of a strategy to get -- to expand short-term lending when high rates are reducing demand for long-term lending? Thank you.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nSure, Steve, and a really good and insightful question. Let me talk through a couple of the things that you mentioned there. The first thing is the volumes that we saw in Q3, I would underscore show the strength of the relationship with Walker & Dunlop and our relevance to our customers. And so, while volumes may come down in Q4, as both Greg and I have said, our relevance to our clients has never been more significant.\n\nWe are engaged with many, many clients who are dealing with exactly what you just outlined, which is a business plan that isn't on pace, a business plan that has changed dramatically given rate movements. That has then driven some people to say [Technical difficulty] to try and add some, you know -- do a cash-out refinancing and put capital on their balance sheet. We're doing a lot of that right now. It's -- some people say, I want to sell my whole portfolio regardless of where cap rates are.\n\nLet's go sell it. And so, we're doing a lot of BOVs on people who want to raise capital and potentially transact at this point. Your point as it relates to the CLO market and the Freddie Q-Series, my understanding is that Freddie is going to do about $3 billion of Q loans in Q4. To those on the call who may not know what Steve and I are talking about, if you back the clock up very significantly back to the 2007 time frame, Freddie Mac went and would buy loans that were, if you will, stuck on warehouse lines and be able to go and securitize those through what became their K-Series and are now being called Q-Series.\n\nAnd some of you may have heard that a few of our competitor firms who had loans sort of hung on warehouse lines have been looking to sell those loans into the Freddie Mac Qs. We, as I said in my prepared remarks, do not have any hung CLO loans, and we have no credit exposure to CLO loans. With that said, Steve, we do have quite a number of loans on our balance sheet. We have loans that sit in our joint venture with Blackstone.\n\nAnd so, the Q execution may be something for some of those loans to create additional liquidity at Walker & Dunlop. And at the same time, I would say this. We are, as Greg said, very focused on both returning capital to our shareholders through our dividend payments, and at the same time, maintaining a cash balance on our balance sheet to not only be opportunistic as it relates to any M&A opportunities that come along, any teams that may not be on a platform that is as stable as Walker & Dunlop, but also to use that capital to help key clients who may need us to step in with our balance sheet and do something for them. We have a track record and history of doing that with some of our largest client partnerships, and I would think that we would do that in a heartbeat when and if it's needed by our clients.\n\nSteven Delaney -- JMP Securities -- Analyst\n\nYour last comment tied in directly to my second question that, you know, in these tough markets, there are usually some casualties -- corporate casualties. We're not wishing for that. But what part of your business would you most like to grow opportunistically, you know, over the next year while we're going through this kind of shakeout period and transition period?\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nSo, I would underscore the fact that we made -- we did not make pro-cyclical acquisitions in 2020 and 2021. I think it's really -- we talked about it at our board meeting yesterday. It says a ton about the fact that both Alliant and Zelman are on budget for 2022. We did not go out and acquire a big investment sales business that's volumes have gone from robust to nothing.\n\nWe did not go out and buy a mortgage brokerage firm because volumes have gone from robust to nothing. So, I feel extremely good about our discipline from an M&A standpoint. And clearly, as you've seen us do in the past, whether it be the acquisition of CWCapital in 2012, coming out of the great financial crisis, we've been very opportunistic to go and buy origination platforms when the market has dislocated and when other platforms don't fare as well as ours do given the long-term consistent revenue streams and earnings that we have. And so, we'll be looking.\n\nI think the other thing to keep in mind, though, and I would underscore this for any investors who would be concerned about this. Buying -- at our scaled size, we've done tuck-in acquisitions on mortgage brokerage and property sales platforms and brought in people. But we haven't done a major enterprise acquisition since that acquisition of CW in 2012. The JLL-HFF merger, as many people who are listening to this call know, was an unmitigated disaster as it relates to human resource and human capital management.\n\nIt turned out to be an accretive deal for JLL because they took a lot of their products and pushed them through the HFF relationships. But as it relates to merging those two big companies together, it was wildly challenging to hold on to talent at both JLL and HFF. So, we are very cautionary as it relates to going and doing a large-scale human capital-intensive acquisition. And then the other thing that I would say on that is culture matters.\n\nWe have maintained and built a culture at Walker & Dunlop that I believe is truly unique and distinct. And so, if we went and did a large-scale transaction, we would put ourselves susceptible to merging cultures that, in a people, business is very challenging. Does that mean we'll never do it? Does that mean we'll never take a look at something which is a large-scale human capital-focused deal? I wouldn't completely rule it out, but it's probably not at the top of the list today.\n\nSteven Delaney -- JMP Securities -- Analyst\n\nUnderstand. And thank you for the comments, Willy. We'll miss you at our conference next week. But [Technical difficulty] job representing W&D on our affordable housing panel.\n\nThanks.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nThanks, Steve.\n\nGreg Florkowski -- Executive Vice President and Chief Financial Officer\n\nThanks, Steve.\n\nKelsey Duffey\n\nThank you, Steve. Our next question comes from Henry Coffey of Wedbush Securities. Henry.\n\nHenry Coffey -- Wedbush Securities -- Analyst\n\nYes. Good morning, everyone, and thank you for taking my question. Is it -- it sounds like, and I don't have the answer here, that, on one hand, you know, your customers are slamming on the brakes. On the other hand, anybody walking around any major metro market doesn't see anything that looks or smells like a recession.\n\nSo, how much of this is just in your mind, customers, you know, overwhelmed by the rapid change in rates, confusion over the election? I hear what's his face may try to run again. And how much of this is, you know, people reacting to some real changes in the underlying economics of multifamily lending, be it rent rates or, you know, ability to get buildings built or whatever, that the, quote, business and -- the \"business disruption issues\" may be? I mean, is this all capital markets related or are there some real shifts going on in the multifamily business from your perspective?\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nSo, Henry, first of all, great to have you on this morning. Let me give you a couple anecdotes that I'll just hopefully will answer your question. First of all, with rates moving at the rate that they have moved, cap rates have not adjusted fully to those rate movements. And so, I've heard Jade ask the question on previous calls of some of our competitor firms, you know, how are people buying with negative leverage? And I think there were many acquirers in the August, September time frame who are happy to deal with the negative leverage of buying at a four to five cap rate and putting 5% debt on a deal.\n\nI would say to you that in October and November, there are not many people who feel comfortable going and putting negative leverage on deals right now due to no real transparency as it relates to where rates end up going. And so, as a result of that, that has put downward pressure on transaction volumes. And at the same time, there are many people -- I've spoken to three clients in the last week who called me up saying, oh, it's just terrible, and there's nothing going on, and we're pencils down, and we can't do anything. And I'll sit there and say, I had dinner with a client last night who told me that they acquired two assets in the last month.\n\nReally? How they'd do that? And talk them through how they're doing it. As I mentioned, we're doing, right now, quite significant refinancing for someone who wants to do a cash-out refinancing to just put cash on their balance sheet. We received a phone call two weeks ago about someone who wants to sell their entire almost billion-dollar multifamily portfolio. So, while many people think that it's pencils down right now, I wrote an email to all Walker & Dunlop salespeople last Friday saying, if you're seeing that life insurance companies and banks are pencils down, this is the opportunity for Walker & Dunlop to be pencils up and meeting our client's needs.\n\nAnd I got a bunch of emails back from bankers and brokers across Walker & Dunlop saying, I've never been busier. And so, the real question there becomes busy or making revenues, right? Because every client wants to talk to us right now. Every client wants us to be running numbers on the valuation of their properties. Every client wants us to be thinking about refinancing scenarios.\n\nThe other thing that's a very interesting data point in the market right now is the number of borrowers who believe that rates are going to go back down. So, we have, in many instances, put forth fixed-rate quotes today. Most fixed-rate financing is going off in the low-sixes. But back a month ago, we were putting out fixed-rate quotes in the mid-fives, and we had numerous clients who opted to go with floating rate debt on a three-year floater rather than going on a seven- or 10-year fixed-rate deal just because they don't think that locking in mid-fives fixed-rate debt for a seven- or 10-year period is a wise move and that they're going to float and watch rates come back down.\n\nPersonally, I would have locked the rate, put the paper away, and focused on my cap rate and my rent growth. But that's me, not my borrowers. But the point I'm trying to underscore here, Henry, is the fact that it's a dynamic market, but there is significant conviction that rates start to come back down in the back half of 2023. And all we need at W&D is for rates to stabilize.\n\nWe don't need rates to come back down. We are not rocket mortgage. We do not need a lower-rate environment to get transaction volumes back up and going. What we need to have happen is, A, we've got countercyclical capital now, so we'll continue to lend with that capital.\n\nAnd B, as it relates to our servicing fees, the moment that we can get some rate stabilization, those MSRs will revert back to normal, and we will have normalized MSR income and net income.\n\nGreg Florkowski -- Executive Vice President and Chief Financial Officer\n\nAnd I'll just -- I'll add on there, too, beyond multi, we are seeing plenty of activity on the nonmultiasset classes as well. And rate stabilization brings capital back into the markets, and we should see our volumes rebound there as soon as we get stabilization. So, there's opportunity across the landscape.\n\nHenry Coffey -- Wedbush Securities -- Analyst\n\nI think everybody listening to the call who was in any history with you understands that W&D is going to be just fine. You plan your business, you plan your balance sheet, etc. I -- what I'm really wondering about is, you know, if we put aside all the \"capital markets funding stuff,\" how -- which is you think, you know, the whole business? If we put that aside and look at your clients, how are they fairing in terms of the operating profitability of their properties? You know, we -- we've seen home price appreciation go down in the residential market since June. Obviously, a lot of that is rate related.\n\nYou know, what about the fundamentals of their business? You all have a unique perspective on exactly that, not only in terms of what people want to do with their balance sheets, but exactly how the properties are performing. And so --\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nI think --\n\nHenry Coffey -- Wedbush Securities -- Analyst\n\nIf we push all the noise aside, what does it look?\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nBut yeah, everyone who owns today, Henry, is loving life. Everyone who owns today, has an asset that was financed any time over the last 10 years is sitting back on. I have rarely had the type of performance on this asset that I've gotten. So, their cash flow is fantastic, their leasing is fantastic.\n\nAnd while there's lots of reporting as it relates to rent growth peeling back from the very elevated levels that it was in 2021 and the beginning of 2022, as I tried to underscore in our comments on our servicing portfolio, I had someone call me last week who said, oh my gosh, you know, there's $100 million of multifamily debt that's coming up to be refi-ed every year over the next 10 years. And with rising interest rates, none of that stuff's going to be able to be done. And I looked at the CEO of this company, and I said, do you know what the debt service coverage ratio is in the Walker & Dunlop $120 billion servicing portfolio today? It's 2.32 times, 2.32 times. Every one of those assets has plenty of cash flow to be refinanced in a higher-rate environment.\n\nAnd so, unless, unless you went out and did a floater in Q1 of 2022 and you didn't put a cap on it because it was done by a CLO provider and not one of the agencies, yeah, you could have some pain there. But as Peter Linneman said on the Walker webcast probably about a month ago when I asked him on this specific point, he said, will there be some pain? Yeah. Will there be real opportunities? Few and far between. So, I think the bottom line here is that we're seeing a market adjustment right now.\n\nWe're seeing a number of people sit on the sidelines, just basically saying, I'm going to wait and see where rates go and where cap rates go, and then I can get back and get active. There are people who are taking advantage of this market dislocation. There will clearly be people who have to sell assets to raise capital and may do so at \"distressed pricing.\" There will be someone there right now to take advantage of that. And the final thing I would say is the banks are still on the sidelines.\n\nAs you well know, J.P. Morgan, Wells Fargo, and Bank of America basically went pencils down sometime in mid-August. There is no way, at least from my read of it, that they can stay on the sidelines in 2023. They are all overcapitalized.\n\nThey have all taken significant loan loss reserves. And my assumption would be come January 1, Jamie Dimon and Charlie Scharf say get back to work. Start making loans again. And if that ends up happening, that will change the liquidity in the commercial real estate space.\n\nToday, warehouse loans have been pulled. As we talked about with Steve, there's no CLO market. There's barely a CMBS market. So, the market's really to the agencies right now, selectively to life insurance companies from a debt capital standpoint.\n\nAnd I think that, to your point, Henry, if we see any kind of break on the inflation numbers, and you get any type of OK, here's our forecast as it relates to Fed rate increases, you could see the market stabilize in Q1, and you could see transaction volume come back nicely. That's clearly a best-case scenario. Many people, many of my -- our competitor firms on their earnings calls last week and the week before said we're looking at a strong back half of 2023. I think that's a reasonably fair and reasonably conservative comment.\n\nThe question will be really Q2 2023. And then the other piece to it for Walker & Dunlop is how long does the market stay dislocated where we take advantage of our position with the agencies to supply capital to market? One of the things we tried to say in our prepared remarks was that if you look at our history in past crises, it's not during the crisis where we completely outperform, even though we do, but it's also afterwards because it takes time for capital to form again. It takes time for life insurance companies to get conviction on the market. It takes time for banks to say, OK, we're clear from a liability standpoint.\n\nWe've finished reserving. Now, it's time to get back into the markets. And so, we will take advantage of that. And every single time, we have shown very clearly that this business and our platform is positioned very well to do just that.\n\nHenry Coffey -- Wedbush Securities -- Analyst\n\nSuper. Thank you.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nThank you.\n\nKelsey Duffey\n\nThank you, Henry. We have no further questions at this time, so I will now turn the call back to Willy for closing remarks.\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nThank you, everyone, for joining us today. Thank you to the W&D team for a fantastic Q3. And as Greg and I both underscored, while these are challenging times, we feel exceptionally well positioned, and we have a team that's engaged with our customers every single day and doing a fantastic job of providing capital and capital solutions to our clients. Thanks, everyone, for joining us today.\n\nThank you, Ginna and Kelsey, for all your work on this earnings call. Greg, well done, and I hope everyone has a great day.\n\nDuration: 0 minutes\n\nKelsey Duffey\n\nWilly Walker -- Chairman and Chief Executive Officer\n\nGreg Florkowski -- Executive Vice President and Chief Financial Officer\n\nJade Rahmani -- Keefe, Bruyette and Woods -- Analyst\n\nSteven Delaney -- JMP Securities -- Analyst\n\nHenry Coffey -- Wedbush Securities -- Analyst\n\nMore WD analysis\n\nAll earnings call transcripts"
}