{
  "companyName": "ONEOK",
  "companyTicker": "OKE",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/oneok-oke-q3-2022-earnings-call-transcript/",
  "content": "ONEOK (OKE -0.38%)\nQ3 2022 Earnings Call\nNov 02, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the ONEOK's third quarter 2022 earnings conference call and webcast. [Operator instructions] Please note, this event is being recorded. I would now like to turn the conference over to Andrew Ziola, vice president of investor relations. Please go ahead.\n\nAndrew Ziola -- Vice President, Investor Relations and Corporate Affairs\n\nThank you, Betsy, and welcome to ONEOK's third quarter 2022 earnings call. We issued our earnings release and presentation after the markets closed yesterday, and those materials are on our website. After our prepared remarks, management will be available to take your questions. Statements made during this call that might include ONEOK's expectations or predictions should be considered forward-looking statements and are covered by the safe harbor provision of the Securities Acts of 1933 and 1934.\n\nActual results could differ materially from those projected in forward-looking statements. For a discussion of factors that could cause actual results to differ, please refer to our SEC filings. [Operator instructions] With that, I'll turn the call over to Pierce Norton, president and chief executive officer. Pierce?\n\nPierce Norton -- President and Chief Executive Officer\n\nThanks, Andrew. Good morning, everyone, and thank you for joining us on our call this morning. We appreciate your interest and investment in our company. On the call today is Walt Hulse, the chief financial officer and executive vice president, investor relations, and corporate development; and Kevin Burdick, executive vice president and chief commercial officer.\n\nAlso available to answer your questions are Sheridan Swords, our senior vice president of natural gas liquids and natural gas gathering and processing; and Chuck Kelley, our senior vice president of natural gas pipelines. Yesterday, we announced strong third quarter 2022 earnings, affirmed our 2022 financial guidance midpoints, and provided our 2023 growth outlook to exceed $4 billion of adjusted EBITDA. Our third quarter results demonstrate the resiliency of our strategic and integrated assets in some of the most highly productive U.S. shale basins, and our employees who are dedicated -- have dedicated themselves to the safety and reliability, and sustainability of our operations.\n\nLooking forward, we expect continued strength in producer activity and increased volumes and higher earnings from our fee-based services in all of our business segments in a favorable commodity price and increasing demand backdrop. So with that, I will turn the call over to Walt for a discussion of our financial performance and the expectations and our insurance update. So Walt?\n\nWalt Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nThank you, Pierce. ONEOK's third quarter 2022 net income totaled $432 million or $0.96 per share, a 10% increase compared with the third quarter of 2021 and a 4% increase when compared with the second quarter. Third quarter adjusted EBITDA was $902 million, a 4% year-over-year increase and an increase from the second quarter. Higher results benefited from increased Rocky Mountain region NGL and natural gas volumes, higher realized commodity prices, net of hedging, and higher average fee rates.\n\nAdditionally, we had lower interest expense due to our lower debt balances and increased capitalized interest. Third quarter 2022 results reflected our $5 million property insurance deductible related to the Medford incident and approximately $30 million of losses related to the 45-day business interruption waiting period under the terms of our insurance policy. We received notice in September that our Medford property insurers agreed to pay $100 million unallocated first installment of insurance proceeds. And as of today, we received $45 million of that amount and expect to receive the remaining amount before year-end.\n\nWe've applied this cash receipts to our outstanding insurance receivables. After the waiting period ended, we incurred costs subsequent to the 45-day business interruption waiting period of $21.7 million, primarily related to third quarter -- I'm sorry, to third-party fractionation agreements and recorded a partial impairment charge of $6.7 million, representing the value of associated with certain Medford facility property based on the limited assessments completed to date. There is no income statement impacts of these incurred business interruption costs or impairment charges as they are fully offset by insurance receivables. We continue sharing information with our insurance carriers to refine ongoing business interruption insurance coverage and to determine the ultimate path to replacement of this temporary loss of fractionation capacity.\n\nWe will provide additional updates as we move forward in this process when material information is available. And lastly, for the third quarter, we ended with higher NGL inventory levels that have since been sold forward, and we will realize $17 million earnings benefit from those sales in the fourth quarter and first quarter of 2023. As of September 30, our net debt-to-EBITDA on an annualized run rate basis was 3.8 times, and we continue to view 3.5 times or lower as our long-term aspirational goal. We currently have no long-term debt maturities until September of 2023 and we have no material exposure to floating interest rates through our current outstanding long-term debt.\n\nYesterday, we affirmed our 2022 guidance midpoints of $1.69 billion for net income and $3.62 billion for adjusted EBITDA. We now expect total capital expenditures of $1.2 billion, driven by our acceleration of spending on the MB-5 fractionator and smaller scale expansion projects that were not previously planned for '22 across our three business segments that will contribute to growth in 2023. Key drivers for our 2023 outlook of a more than 10% increase compared with our 2022 midpoints to exceed $4 billion in adjusted EBITDA include continued strength in fee-based earnings and rates, stable to growing producer activity providing higher natural gas and natural gas liquids volumes in our system and expected higher realized commodity prices due to higher hedges. These tailwinds into 2023 from our base business, additional insurance recoveries related to Medford, and our strong financial position provide us confidence in our double-digit earnings growth outlook for next year.\n\nI'll now turn the call over to Kevin for a commercial update.\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nThank you, Walt. Let's start with our natural gas liquids segment. Rocky Mountain region NGL volumes increased 17% year over year and 12% compared with the second quarter 2022, driven by volume recovery following the April severe weather and overall volume growth, including higher incentivized ethane on our system. Volumes have remained strong in the region with September averaging more than 380,000 barrels per day.\n\nThird quarter Mid-Continent NGL volumes decreased year over year and compared with the second quarter, due primarily to lower ethane recovery on our system. In the Permian Basin, NGL volumes were unchanged year over year and compared with the prior quarter. With the recent third-party plant connection in October, we expect volumes from this region to increase through the remainder of this year and into 2023. We also continue to see interest from customers seeking additional NGL takeaway out of the Permian, so we will continue to evaluate future low-cost expansions on our system.\n\nFrom a 2022 NGL volume guidance perspective, we expect to be near the midpoint of our guidance range, due mostly to the ethane rejection we have been seeing in the Mid-Continent and the impact of the April storms. Regarding ethane. Beginning in September, we started to see lower demand for ethane from the pet chems leading to more ethane rejection across most regions. The decrease in utilization has been driven by lower NGL demand globally, especially in China and Europe, along with some pet chem outages.\n\nWe expect ethane demand to remain muted somewhat in the fourth quarter and into early 2023. And this has been factored into our 2022 and 2023 expectations. As we sit today, we are seeing ethane and ethylene inventories starting to get worked off, which we believe will lead to increasing demand in 2023. As for ONEOK, it is typical that we don't incentivize as much ethane out of the Bakken during the winter season due to higher natural gas prices and natural gas demand, but we will continue to be opportunistic.\n\nAs it relates to our 2023 outlook, we expect the Permian to be in full ethane recovery, the Mid-Continent to be in partial recovery, and the Rockies continuing to provide opportunities to incentivize recovery. Construction continues on our 125,000 barrel per day MB-5 fractionator in Mont Belvieu, which we still expect to be completed early in the second quarter of 2023 and is reflected in our updated 2022 capital guidance. Moving on to the natural gas gathering and processing segment. Producer activity remained strong in the Rocky Mountain region with third quarter processed volumes averaging 1.4 billion cubic feet per day, a record quarter for us.\n\nOur average fee rate also increased, reflecting the impact of contract escalators, higher volumes on higher fee component contracts and a larger percentage of our total volumes from the Rockies. On a go-forward basis, we expect this average rate to range between $1.10 and $1.20. Year to date, we've connected 244 wells in the region. We now expect to complete approximately 375 well connections near or at the low end of our guidance due to the impact of the April storms, timing of some wells coming on, and availability of completion crews and materials.\n\nActivity still remains high, just some timing elements that we now expect will push a few large pad completions into next year. These same factors also led us adjusting our volume expectations for 2022 to be near or slightly below the guidance range. There are currently more than 40 rigs and 18 completion crews operating in the basin, with more than 20 rigs and approximately half the completion crews on our dedicated acreage. As we've said before, approximately 15 rigs on our acreage to maintain natural gas production at current levels.\n\nBut with more than 20 currently on our acreage, we expect to see higher well connections and volumes in 2023 compared with 2022. The 200 million cubic feet per day Demicks Lake III processing plant under construction remains on schedule to be completed in the first quarter and will bring needed capacity to the region. The basinwide DUC inventory remained stable at around 500, considering the increasing rig count and activity with half of those on our dedicated acreage. In the Mid-Continent region, we continue to see increased activity with four rigs now operating on our acreage and more than 50 rigs basinwide.\n\nWe expect steady to increasing activity and volumes through the remainder of the year and into next year with the majority of rigs basinwide driving additional NGLs to our system. In the natural gas pipeline segment, with strong year-to-date results benefiting from the continued increasing demand for natural gas storage and transportation services, we now expect this segment to exceed the high end of its guidance range of $400 million to $430 million. We are highly subscribed for our storage service in Oklahoma and Texas at higher rates and for longer terms, including our recent expansion of our Texas storage facilities, which is now fully subscribed through 2032. Additionally, we are expanding our storage capabilities in Oklahoma, enabling an additional 4 billion cubic feet of storage capacity to be contracted.\n\nThis project is expected to be complete in April 2023 and is nearly 90% subscribed through 2029, and we are also evaluating an additional expansion of our Texas storage assets. And lastly, before I turn the call back to Pierce, we began a compression electrification project on our interstate Viking gas transmission pipeline to improve operational reliability and provide future greenhouse gas emissions reductions on the system. The project is expected to cost $95 million and be completed in the third quarter of 2023 and is included in our outlook. Pierce, that concludes my remarks.\n\nPierce Norton -- President and Chief Executive Officer\n\nThank you, Walt and Kevin. As we enter the last couple of months of 2022 and look forward to the next year, I'm proud of our employees and want to thank them for their hard work and contributions who continue to focus on operating safely, sustainably and environmentally responsible and are key to our success as a midstream operator. How we operate is important, but also how we engage with our employees, communities and other stakeholders is equally as important. Also important for ONEOK is to remain focused on meeting the growing energy demand for today even as it looks forward to helping drive the energy transformation needs for the future.\n\nWe also recently announced that ONEOK joined with two other large publicly traded companies based in Oklahoma and a venture capital firm to fund an effort to transform Oklahoma into a hub of energy technology start-ups and redefine a sector that has shaped the region's economy for more than a century. We believe this partnership aligns to our long-term business strategy, which includes potential low-carbon investments that contribute to low -- long-term growth and business diversification. ONEOK has been building the right teams and resources to better participate in the innovative practices and technologies that it sees now and those that may play a role in the future. Before I turn the call over for Q&A, I wanted to highlight an important ESG item we mentioned in our earnings release.\n\nONEOK's MSCI ESG rating was recently reviewed and updated by MSCI to AAA from AA, and we maintained our industry leader status. As I previously said, our ESG efforts are a source of pride for ONEOK, and we are committed to continuing to make progress in these important areas. With that, operator, we're now ready for questions.\n\nOperator\n\n[Operator instructions] The first question comes from Brian Reynolds with UBS. Please go ahead.\n\nBrian Reynolds -- UBS -- Analyst\n\nHi. Good morning, everyone. Maybe to revisit some of the assumptions in your prepared remarks around '23 earnings growth, it seems like we should see some tailwinds on volumes and hedges rolling higher. I was curious if you could just dive a little bit further into the ethane recovery assumptions for '23.\n\nHistorically, you guys have been pretty conservative on this assumption, but curious as how we should think about how Btu concerns plateauing ethane demand for the next few years and Permian nat gas tightness impacted some of your assumptions as it relates to Rockies recovery into 2023 and that 10% earnings growth? Thanks.\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nHi, Brian. This is Kevin. I'll start and then Sheridan can add in. Think about the overall 2023 growth outlook, we expect our volumes are going to be up, both NGL and Gathering and Processing in all of our basins with the tailwinds, with the existing rigs we're seeing today as those carry over into '23.\n\nSo volume growth is going to be the primary driver. You've also got -- you're going to have a full year of the contract fee escalations. So we'll see a full year of that. You've got a step up in our hedging.\n\nIf you look at the hedge prices we have in '23 compared to '22, that's going to be a significant step up there. The ethane recovery assumptions are pretty similar to what we had going into '22. As we mentioned, full recovery we expect out of Permian, partial in the Mid-Continent, and we'll continue to incentivize ethane out of the Bakken, where appropriate.\n\nSheridan Swords -- President, Gathering and Fractionation\n\nThe one thing I would add on that is when we look at '23 as we looked in '22, we have limited incentivized ethane coming out of the Bakken factored in. We really see that as an opportunistic -- opportunity going forward.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. I appreciate that color. Maybe just to pivot toward capital allocation for a minute. ONEOK is trending toward its leverage target and payout ratio targets.\n\nObviously, there are some concerns that were partially alleviated with earnings around the insurance proceeds. But I was curious of how we should think about the return of capital framework looking into '23 given that you've had the same dividend since 2019, but that said, never cut at the same time. So any color there, I appreciate it.\n\nPierce Norton -- President and Chief Executive Officer\n\nSo, Brian. This is Pierce. With our positive earnings growth indications for 2023, our payout ratio and our debt-to-EBITDA metrics are indicating that we are going to have more flexibility to execute on one or more of the capital allocation levers that are going to be available to us to create that value for our shareholders as we progress through 2023. So that's the way I'd answer your question there.\n\nBrian Reynolds -- UBS -- Analyst\n\nFair enough. I'll leave it there. Have a great rest of your morning.\n\nPierce Norton -- President and Chief Executive Officer\n\nThank you, Brian.\n\nOperator\n\nThe next question comes from Michael Blum with Wells Fargo. Please go ahead.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nThanks. Good morning, everyone. I wanted to ask the latest on Northern Border. Where does it stand in terms of gas coming from Canada versus the Bakken? Is there any more room there? And then related to that, any updates on a potential expansion project on North Border?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nYeah, Michael. It's Kevin. For your first question, we estimate there's still probably 300 million to 400 million a day of gas coming from Canada. That will continue to get displaced from Bakken as Bakken grows.\n\nSo you've got some opportunities there. And also, we're in active discussions with multiple parties on various residue takeaway and demand projects, actually some demand projects in Basin. We have secured about 100 million a day of takeaway solution on WBI that's going out south that doesn't go to Northern Border. So that's going to help.\n\nSo we don't think there's one single solution that provides -- that's going to provide that, but we do believe we'll be able to find and there will be the necessary capacity out of Basin as we move forward.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nOK. I guess second question, just wanted to ask -- I know you haven't really made a decision yet about whether you're going to rebuild Medford or maybe build something else at Mont Belvieu or otherwise. So just curious if you could talk to the dynamics, if you do choose to not rebuild Medford, does that change anything in terms of the market dynamics between Conway and Mont Belvieu for you as it relates to Sterling?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nNo. I mean, there will be a little bit of an impact on that if we build down in Mont Belvieu if you put Medford down in there. But today, or when Medford was up, most of our liquids was transported down Sterling anyway to the Mont Belvieu market. So we think overall, the market dynamics are not going to be impacted that much, whether we build it at Medford or at Mont Belvieu.\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nThe next question comes from Jean Ann Salisbury with Bernstein. Please go ahead.\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nHi. Good morning. In the third quarter, there was more ethane recovered from the Rockies and less from the Mid-Con than I would have expected. Is it fair to say that most of the time you would recover marginal ethane from the Mid-Con before the Rockies and that maybe it was specifically due to AECO price blowouts in the quarter that it was a little flipped from usual?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nYes. We look at the gas basis as really what kind of drives us on which basin we're going to incentivize. So yes, AECO pricing versus what's going on in the Mid-Continent will drive what's going -- where we incentivize ethane coming out of there. We did see a lot of benefit in the third quarter coming out of the Rockies due to the basis and what we could secure gas prices for and so on for ethane.\n\nSo that we see that as a great opportunistic two basins that we can incentivize at times and kind of play that gas base between the two. So we think that's a big advantage to our system.\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nOK. That's helpful. And assuming that Bakken does go back to higher rejection in the next couple of quarters, I think the Northern Border Btu spec at that receipt point is probably going to exceed the 1,100, which I think Northern Border has said, is kind of the max that they really want. Does anything happen then? Or is that just all kind of a whole FERC process to potential cap in?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nJean, this is Kevin. Yes, as you reject more ethane, that will raise the Btu content on Northern Border. If you were back to about where we were pre-COVID and that number was north of 1,100, right now, there is not a spec on the pipe. So the Northern Border, it's our understand they'll watch it.\n\nThey've got some levers to pull if it gets too high and downstream markets start to have concerns. They continue to work with shippers and all the relevant stakeholders to potentially go back to FERC for a spec, but we don't have an exact timing on that. So we'll watch it. If it gets to the point where it gets -- the Btu level gets too high and downstream markets start raising issues, then we always have the option to recover ethane to lower it back.\n\nAnd if we do that, if it's required at that point, then that would require -- I mean, that would be at full rates, not at an incentivized rate.\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nGreat. That's all for me. Thank you.\n\nOperator\n\nThe next question comes from Jeremy Tonet with J.P. Morgan. Please go ahead.\n\nStephen McGee -- JPMorgan Chase and Company -- Analyst\n\nHey. Good morning. This is Stephen McGee on for Jeremy. Just starting along the insurance line, as far as business interruption insurance goes.\n\nJust trying to get an idea of what's covered under that. Does that include optimization, marketing in there as well? And then for 2023, does that include the business insurance as well?\n\nWalt Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nWell, as we said on the last call, the coverage that we have is that we are entitled to receive coverage so that we get return to what we would have made, but for this event. So it's systemwide. So if that does impact other parts of the business like optimization and marketing, that gets factored into our BI calculation. The money that we received in September, [Inaudible] that we booked in September, I wouldn't necessarily look at as a run rate because there's still are some moving parts that we're working with the insurance companies to refine how we look at BI going forward.\n\nThose costs were predominantly the third-party frac costs. And as we work with them and refine how much optimization in the market, we do expect to receive some benefit from that going forward. In 2023, we expect BI coverage to continue. And at that point, be on a pretty regular month-to-month catch-up so that we're hoping that you really don't see any real variation from the BI insurance going forward.\n\nStephen McGee -- JPMorgan Chase and Company -- Analyst\n\nUnderstood. And then, I guess, flipping over to capex, you pulled some forward, well connects kind of toward the lower end of the guide, but still up a little bit this year. So I'm guessing most of the uptick this year is MB-5. Should we expect, I guess, a little bit less capex into 2023 now because of that? And just if you could walk us through, I guess, that raise this year and then what that looks like in the next year as well.\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nYes, Stephen. It's Kevin. Yes, MB-5 was a significant mover in moving some of that capital forward into '22. We also had a compressor station up north in the Bakken that we moved forward with that will add to our growth in '23.\n\nWe referenced the Viking compression project in the -- in our opening remarks. And then we just had a handful of smaller routine growth-type projects that typically have extremely strong multiple -- strong earnings power from them, and that will contribute in '23 as well. So just a combination of those factors are what led into the increase in '22. You're thinking about '23 correctly.\n\nIf -- once we complete MB-5 and Demicks Lake III, that would lead you probably to a little step down in capital barring other projects that we continue to work on that could prove. So that's the unknown at this point is we're constantly working on new projects that -- and as they reach FID, we'll announce them. But absent those, then yes, you would expect capex to maybe come down a little bit in '23.\n\nStephen McGee -- JPMorgan Chase and Company -- Analyst\n\nAll right. Great. Thank you. I'll leave it there.\n\nOperator\n\nThe next question comes from Theresa Chen with Barclays. Please go ahead.\n\nTheresa Chen -- Barclays -- Analyst\n\nHi. Thank you for taking my questions. First, I would love to touch on the 2023 guidance and delve into some of the assumptions here. Mainly, if you could provide some color on your price deck assumption and then in terms of Bakken activity, in particular, any color you can share on assumptions for rig counts, well completions, exit-to-exit growth in oil or gas? And then granted that the ethane recovery dynamic remains in development and can be volatile, but any sort of color you can give on the recovery assumption in 2023 versus the level that you just reported for the third quarter 2022?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nTheresa, this is Kevin. And we're not -- again, we're not going to get into the detailed guidance specifics that we'll release probably sometime next -- early next year. But I would tell you, as we think about price decks and activity levels, there's probably more rig. If you just look at today, there's more activity in the basins that we're looking at, that we're talking about than we have in that outlook.\n\nSo the activity levels we're seeing today are plenty strong to help us achieve that exceedings of $4 billion.\n\nTheresa Chen -- Barclays -- Analyst\n\nGot it. And in the Gathering and Processing segment, that $1.16 average fee rate, quite a step-up from the previous run rate and I understand the color you shared on the fee escalators and the composition of it. Just trying to think about the trajectory of growth here. Was there anything in particular driving this? And as we think about the escalators in 2023 and beyond, should we assume similar magnitudes of step-ups? Or generally speaking, how should we think about this line?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nTheresa, this is Sheridan. When you think about that margin which is driving that increased step up, a lot of it was on escalation is where it came from. Some on the contract mix being on. We got volume on higher contracts or more margin contracts and on others as we go forward.\n\nThe big thing that's going to drive as we get into '23, executing that trajectory is what the inflationary escalators are going to be, and we'll have to see how inflation comes out and how the -- we go against CPI and most of the time on that, how CPI reacts in '23 versus '22 is going to be a big driver on where we land on that and going forward. So it's really going to be based on inflation, would be the biggest piece.\n\nTheresa Chen -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nNext question comes from Michael Cusimano with Pickering Energy Partners. Please go ahead.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nHi. Good morning, everyone. I wanted to first focus on the natural gas liquids optimization and marketing number, I think you all noted a 44 million decrease sequentially. Was any of that a result of Medford at all? Or was it just other -- I think you all mentioned some price differentials and timing on the NGLs?\n\nSheridan Swords -- President, Gathering and Fractionation\n\nMichael, this is Sheridan. Yes, Medford did have an impact on those numbers, and that's factored in there. And that 45-day waiting period, we did take some hits in optimization and marketing there. And as you mentioned, the other things we have is spreads were a little bit narrowed during that time.\n\nWe had forward sales due to Medford, that we push forward sales forward, that we will receive some of that money or $17 million of that money in the first quarter and second quarter -- I'm sorry, fourth quarter and first quarter as we go forward here, we will get that $17 million back. So that -- those are the three main factors as you see in that drop in optimization and marketing.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nOK. And just to clarify, you would expect to be -- in the future, you would expect to be -- or you expect to recoup insurance proceeds in the event of any optimization of marketing reductions, what would happen?\n\nPierce Norton -- President and Chief Executive Officer\n\nWe do. We do expect to get insurance proceeds, but a lot of that $45 million as we -- part of that is in the 45-day waiting period, which we wouldn't get that because that's on us. But going forward, we expect to get any losses in marketing and optimization that we would have received if Medford had been up, we expect insurance to cover that.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nOK. That is helpful. And then previously, you all have given like a current month run rate out of the Bakken for NGL takeaway. I think you gave a September number.\n\nAny indication you can have for what October looks like going forward?\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nMichael, we're not going to provide kind of numbers in Q4. We gave you the number for September. That was a -- that's a really good run rate if you think about it as we move through. We get into the fourth quarter and you start bringing weather into play.\n\nSo that's why we backed off that.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nOK. Understood. And then last one, if I can. If I break up the insurance proceeds from one allocation for business interruption, the other for property loss, are you all viewing the property loss as replacement cost? Or is it getting back the frac capacity to where like MB-5 recover some of that? Just trying to think of like how that shapes out from the way you and the insurance company are thinking about it?\n\nWalt Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nWe have specific coverage that would cover the replacement or the repair of the facility to get it back to the point where we would achieve the 210,000 barrels of capacity that we currently have. So we have property coverage to put us back in the same position that we were before. And then -- but we do have the flexibility with those dollars that it would cost to do that to build it wherever we want to do that, and that's what we're still considering at this point. Going forward, we would expect to likely not get as much -- not get unallocated money.\n\nThis was -- it should be allocated out for the BI on a monthly basis once we get into kind of a monthly rhythm. And the property will be what it is as we spend the money for the repair or replacement of the facility.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nOK. That's helpful. Would MB-5, since it was already undergoing construction, be something that you could allocate any sort of property loss to? Or would it be in MB-6 and beyond if you wanted to?\n\nWalt Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nNo. MB-5 is its own stand-alone project that we built because we needed it. And -- we -- obviously, it will help us a little bit as it comes on and we are going to be in our natural ramp-up phase. But that is part of our capital and the proceeds that we received for the repair or replacement of the Medford facility will be discrete, and it will cover those costs.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nOK. This is all really helpful. I appreciate it. That's all for me.\n\nThank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Andrew Ziola for any closing remarks.\n\nAndrew Ziola -- Vice President, Investor Relations and Corporate Affairs\n\nAll right. Thank you, all. Our quiet period for the fourth quarter starts when we close our books in January and extends until we release earnings in late February. We'll provide details for that conference call at a later date.\n\nHave a good day, and thank you for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAndrew Ziola -- Vice President, Investor Relations and Corporate Affairs\n\nPierce Norton -- President and Chief Executive Officer\n\nWalt Hulse -- Chief Financial Officer and Executive Vice President, Strategy and Corporate Affairs\n\nKevin Burdick -- Executive Vice President and Chief Operating Officer\n\nBrian Reynolds -- UBS -- Analyst\n\nSheridan Swords -- President, Gathering and Fractionation\n\nMichael Blum -- Wells Fargo Securities -- Analyst\n\nJean Salisbury -- AllianceBernstein -- Analyst\n\nStephen McGee -- JPMorgan Chase and Company -- Analyst\n\nTheresa Chen -- Barclays -- Analyst\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nMore OKE analysis\n\nAll earnings call transcripts"
}