{
  "companyName": "1stdibs.Com, Inc.",
  "companyTicker": "DIBS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/1stdibscom-inc-dibs-q2-2022-earnings-call-transcri/",
  "content": "1stdibs.Com, Inc. (DIBS -2.31%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the 1stDibs.com second quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Kevin LaBuz.\n\nPlease go ahead.\n\nKevin LaBuz -- Investor Relations\n\nGood morning, and welcome to 1stDibs' earnings call for the quarter ended June 30th, 2022. I'm Kevin LaBuz, head of investor relations and corporate development. Joining me today are CEO, David Rosenblatt; and CFO, Tom Etergino. David will provide an update on our business, including our strategy and growth opportunities, and Tom will review our second quarter financial results and third quarter outlook.\n\nThis call will be available via webcast on our Investor Relations website at investors.1stdibs.com. Before we begin, please keep in mind that our prepared remarks include forward-looking statements, including but not limited to statements regarding guidance and future financial performance, market demand, growth prospects, business plans, strategic initiatives, evaluation of alternatives, business and economic trends and dynamics, including e-commerce growth rates and our potential responses thereto, international opportunities and competitive position. Our actual results may differ materially from those expressed or implied in these forward-looking statements as a result of risks and uncertainties, including those described in our SEC filings. Any forward-looking statements that we make on this call are based on our beliefs and assumptions as of today, and we disclaim any obligation to update them except to the extent required by law.\n\nAdditionally, during the call, we'll present GAAP and non-GAAP financial measures. A reconciliation of non-GAAP to GAAP measures is included in today's earnings press release, which you can find on our Investor Relations website along with the replay of this call. Lastly, please note that all growth comparisons are on a year-over-year basis unless otherwise noted. I'll now turn the call over to our CEO, David Rosenblatt.\n\nDavid?\n\nDavid Rosenblatt -- Chief Executive Officer\n\nThanks, Kevin. Good morning, and thank you for joining us today. Amid a challenging operating environment for e-commerce and home goods, we delivered GMV and revenue within our guidance range and EBITDA margin above our guidance range as we managed expenses in light of continued soft consumer conversion. We strengthened our balance sheet and streamlined our business with the sale of Design Manager for $14.8 million, generating a healthy $9.7 million return on our purchase price.\n\nLastly, we're pleased with early signs of traction in our key strategic initiatives, auctions, international expansion, and supply growth. During the quarter, some business trends remained resilient as compared to our last earnings report, while others softened. First, I'll review what remained resilient. Traffic growth accelerated versus the first quarter due to SEO gains, and upper funnel activity, in general, remain robust.\n\nTrade growth continued, and returning buyer conversion increased as well. Supply growth remains healthy. Helped by our pricing test, we're adding new sellers at three times last year's monthly run rate. Additionally, seller churn remains at historic lows.\n\nFinally, our strategic initiatives are making solid progress. While metrics are moving in the right direction, these efforts are in their early stages, and GMV contribution isn't yet large enough to offset softening new buyer conversion. Now on to what softened. Most importantly, consumer growth, which is historically 70% to 75% of GMV, declined further due to conversion softness, particularly for new buyers.\n\nWhile we're bringing more traffic to the marketplace, it's not converting at historical rates. There are multiple factors at play here. In addition to economic uncertainty, consumers are spending less online in favor of out-of-home experiences, such as travel and dining out. In addition, we are seeing a traffic mix shift toward mobile web, which is a lower converting device type.\n\nGiven softening demand, we have begun recalibrating our expenses, which Tom will review in more detail. With two-thirds of our GMV from furniture, we're at the intersection of e-commerce and home goods, two areas negatively impacted by increased mobility post-COVID and heightened economic uncertainty. We see this most significantly in lower conversion rates. We have begun, and intend to continue, responding forcefully to this changed set of circumstances.\n\nAt the same time, what encourages us is that, with the exception of new buyer conversion, we believe the long-term drivers of our competitiveness and the value we provide to buyers and sellers remain healthy. Traffic growth accelerated in the second quarter. Our organic traffic mix increased. Supply growth is robust, and seller churn is low.\n\nAuctions are improving sell-through and new buyer activation rates. Additionally, 50% of auction buyers in the second quarter have never purchased from 1stDibs before. Lastly, while we intend to continue to invest responsibly in auctions international expansion, and supply growth, we are reprioritizing projects and continuing to identify cost efficiencies so that, when demand for home categories rebounds, our business will be more efficient and in a stronger, more competitive position. We are committed to reaccelerating GMV growth and enhancing shareholder value and are reviewing multiple paths to help us achieve these objectives.\n\nAlternatives may include buy- and sell-side M&A, capital return strategies and partnerships, as well as revisions to our operational objectives and priorities. We are working with our financial advisors at Allen & Company to evaluate all options. Turning to operations. We continued to enhance our platform for buyers and sellers.\n\nSimilar to the first quarter, top-of-funnel activity remains healthy; with traffic, registrations, and item favorites growing by double digits. Organic traffic mix increased by over five percentage points year over year driven by continued strength in SEO, coupled with a pullback in paid spend. Reaccelerating GMV growth is a top priority. Our largest lever is improving conversion, particularly for new buyers and on mobile web.\n\nIn addition to our strategic initiatives, we have a number of projects and tests underway focused on this. During the second quarter, we prioritized projects to increase checkout entry and reduce purchase friction. For example, we launched improvements for low inventory pages, tested increasing the visibility of items with lower shipping costs in search, and improve the discovery of auctions listings which have higher sell-through and conversion rates. Conversion is a game of incremental gains.\n\nThe goal is to keep accumulating small wins that compound over time. On the supply side, our seller team launched a bulk upload tool, saving sellers time and supporting listings growth. Additionally, we rolled out inventory lifecycle recommendations which suggest age and engagement-based actions to help sellers optimize sell-through. We also made meaningful progress in our strategic initiatives, which I'll review in more detail below.\n\nAuctions are making great progress. Bidder activity, order volume, and GMV continued to grow sequentially. In June, for example, auctions accounted for over 5% of total orders, as compared to 1% of supply, and this trend carried over into July. In addition to higher sell-through rates, another strategic rationale for building auctions was activating new buyers.\n\nDuring the quarter, 50% of bidders had never made a purchase on 1stDibs. Auctions average order value was under $1,000, less than half of the AOV in our marketplace overall. Lower AOV is what we expected for auctions and is consistent with a value-oriented channel. Lastly, auction supply continues to ramp.\n\nWe added 20,000 new auction listings in the second quarter, up 100% from the first quarter. However, that's just a fraction of our 1.4 million listings. We believe there is ample opportunity to meaningfully expand supply from our existing items. Since launch, we've enhanced the auctions product experience through weekly updates.\n\nThe focus this quarter was building features that optimize for value and urgency to drive bid participation by, for example, displaying the original list price in search and browse and on product pages to highlight value. We also built tools for scaling auction events. These are curated groupings of items with the same launch date, akin to a physical auction. Events drive urgency, traffic, and bid participation.\n\nStarting in May, we increased the cadence of curated events to monthly from every other month. Additionally, our work to boost supply and set competitive auctions pricing is ongoing. Given the success we're seeing, we are evaluating shifting existing resources to auctions. June also marked the first full month of operations for both of our localized sites.\n\nGermany went live on April 26th, and France launched on May 10. Users in these countries can now search in local languages, see search results that prioritize items located in Europe, and experience a fully localized customer journey, including currency, customer service, and shipping. While it's still early, we believe we're seeing promising performance in both markets. Given the highly considered nature of our purchases, our first priority is growing traffic from performance marketing and SEO.\n\nTraffic from French IP addresses grew 60% year over year during the quarter, while traffic from German IP addresses grew over 75% year over year even though these sites launched late in the quarter. Building an international business is a multiyear process, and we're off to a great start. Our development philosophy is to prioritize speed to market and then test and iterate as we gather data and feedback. For the rest of the year, our international focus will be optimizing foreign language paid marketing, building SEO authority, and introducing product enhancements, like incorporating real-time machine translation into our message center.\n\nWe see a meaningful long-term international opportunity. Today, about 40% of our sellers, one-third of our traffic, and one-fifth of our buyers are located outside the United States. Because supply begets demand for two-sided marketplaces, accelerating supply growth is another priority. Our goal is to aggregate the world's most beautiful items, regardless of where they're located, while maintaining our curatorial standards.\n\nSupply drives traffic, made search results more robust, and increases the chances that we'll make a match. Given our long tail of one-of-a-kind listings, providing buyers with more options should ultimately translate into higher order volumes. Our new seller pricing test, which launched in January, continued to perform well. We signed over 700 new sellers in the second quarter, ending June with over 6,100 seller accounts.\n\nThe number of sellers and listings continued to grow at healthy double-digit rates, and our monthly seller acquisition was triple our monthly average in 2021, consistent with the first quarter. We expect the pace to slow during the summer when many sellers take vacation. As a reminder, we launched a pricing test for new sellers in January. This allows sellers to choose the plan that best fits their business and includes a subscription-free tier with a higher commission rate.\n\nThis reduces friction by lowering the upfront cost of trying 1stDibs and remains the most popular option for new sellers. Despite material growth in our seller base, the absolute number of churn sellers declined year over year. As I mentioned above, while we believe the metrics for auction international and supply growth are trending in the right direction, these efforts are in their early stages, and GMV contribution isn't yet large enough to offset softening demand. Over the past few months, the market for NFTs has slowed dramatically, and we were not immune.\n\nWhile we continued to believe in the long-term promise of the digital art market, given the reduced near-term outlook, we have paused incremental investment in our NFT platform. During the quarter, GMV growth rates softened month-over-month from April through June, and this trend has carried over into July. Given the slowdown, we're focusing on what we can control and taking actions to better align expenses to demand. For example, we have drastically reduced the number of open roles, limited hiring to critical positions, and increased the efficiency targets on our performance marketing spend.\n\nHowever, fundamentals like traffic and supply growth remain healthy, and our strategic initiatives are gaining traction, which we believe in turn sets us up for future success. We intend to continue adjusting to the environment while focusing on the strategic initiatives that we believe will drive our long-term growth. We are also working with our financial advisors at Allen & Company to review multiple paths to enhance GMV growth and shareholder value. When e-commerce growth rebounds, we expect to be more focused, more efficient, and poised to capitalize.\n\nTom Etergino -- Chief Financial Officer\n\nThanks, David. We delivered GMV and revenue at the low end of our guidance range and EBITDA margins above the high end. GMV was $104.8 million, down 2%. In the first quarter, we saw strong top-of-funnel engagement but softer conversion.\n\nThese trends were exaggerated in the second quarter. While traffic growth accelerated, conversion softened, particularly for new buyers. This was partially offset by returning buyer conversion, which improved modestly year over year. Trade GMV growth decelerated but remained positive, while consumer GMV declined.\n\nTrade remains a relative bright spot. The number of spending trade firms and average spend per firm both increased. We believe pipelines and project volumes remain healthy, but we expect to see a return to normal seasonality in the third quarter, which is historically slower for trade. As a reminder, when we reference trade GMV or consumer GMV, we are speaking about the subsets of on-platform GMV attributable to each of these buyer groups.\n\nTurning to vertical performance. New and custom furniture and jewelry GMV grew while all other verticals declined. Consistent with recent quarters, vintage and antique furniture accounted for less than 50% of GMV, and the majority of our first-time orders continue to come from newer categories like art, jewelry and new and custom furniture. Average order value growth moderated in part due to a mix shift to auctions.\n\nLower AOV for auctions is a conscious part of our strategy and has many benefits, including higher sell-through, conversion, and new buyer activation. We ended the quarter with approximately 69,300 active buyers, flat year over year and down 3% quarter over quarter. We expect this metric to be choppy near-term as we manage through strong comps from the pandemic-related e-commerce boost and a period of softer conversion. On the supply side of the marketplace, we closed the quarter with over 6,100 seller accounts, up 40%.\n\nNet revenue was $24.6 million, flat year over year. Transaction revenue, which is tied directly to GMV growth, was approximately 70% of revenue, with subscriptions making up the bulk of the remainder. Given the Design Manager sale closed on June 29th, second quarter results included a full quarter of contribution. Design Manager accounted for roughly 3% of revenue in the quarter.\n\nGross profit was $16.6 million, down 4%. Gross profit margins were 68%, down from 70% a year ago. Gross margins declined year over year due to a higher hosting and co-location cost, payroll and benefits, and stock-based compensation. The higher hosting and colocation cost was a result of accelerated traffic growth, which are not offset by higher GMV and revenue due to softening conversion.\n\nAdditionally, our operational teams make up approximately 30% of cost of revenue. Given current demand, we're seeing negative operating leverage here. Lastly, payroll and stock-based compensation expenses reflect a full quarter of our annual merit increases and stock-based compensation refresh, which went into effect in March. In addition to cost of revenue, these annual merit increases impact headcount-related expenses across all operating areas.\n\nSales and marketing expenses were $11.3 million, flat year over year. Growth in headcount was offset by lower performance marketing spend. Given softening conversion, we pulled back our performance marketing during the quarter. This is an example of recalibrating expenses to match demand.\n\nSales and marketing as a percentage of revenue was 46%, flat year over year. Technology development expenses were $6.6 million, up 45%, driven by higher stock-based compensation and payroll and benefits. These reflect both hiring to support our strategic initiatives as well as our annual merit cycle, as mentioned above. As a percentage of revenue, technology development was 27%, up from 18%.\n\nGeneral and administrative expenses were $7.5 million, up 58%. The increase was mainly driven by expenses related to public company costs, including D&O insurance and increased headcount, higher stock-based compensation, and approximately $300,000 of onetime legal fees related to the sale of Design Manager. As a percentage of revenue, general and administrative expenses were 31%, up from 19%. We went public in June 2021, so this will be the last quarter of cycling periods without fully loaded public company costs.\n\nLastly, provision for transaction losses were $1.6 million, 6% of revenue, flat year over year. Adjusted EBITDA loss was $6.1 million, compared to a loss of $3 million last year. Adjusted EBITDA margin was a loss of 25% versus a loss of 12% last year. This year-over-year change was driven primarily by higher G&A expenses and higher technology development spending against flat revenue growth.\n\nCombined, public company costs and headcount supporting strategic initiatives, primarily in technology development, were approximately $4 million in the second quarter. Excluding these expenses, our second quarter adjusted EBITDA would have been a loss of roughly $2 million, an improvement versus last year. Moving on to the balance sheet. We ended the quarter with a strong cash and cash equivalents position of $162.7 million, including the proceeds from our sale of Design Manager for $14.8 million.\n\nTurning to the outlook. Demand cooled throughout the second quarter, and this trend has so far carried into the third quarter. We forecast third quarter GMV of $88 million to $95 million, down 19% to 13% year over year; net revenue of $20.7 million to $21.9 million, down 19% to 14% year over year; and adjusted EBITDA margin loss of 37% to 33%. GMV guidance reflects a number of converging factors, including shifting consumer behavior, ongoing economic uncertainty, and conversion headwinds, and the GMV contribution from our strategic initiatives will increase sequentially, but won't be enough to offset broader conversion softness.\n\nTurning to adjusted EBITDA margins. Guidance reflects a softening demand environment and a sequential decline of approximately $3 million in revenue at the midpoint, resulting in negative operating leverage. Lastly, starting in the third quarter, results will not include Design Manager, which generated less than $1 million in quarterly revenue and was operated approximately EBITDA breakeven. During the second quarter, we began taking steps to align our cost base to current demand.\n\nWe expect that this work will continue in the third quarter. To date, we've limited hiring to critical positions, increased our efficiency targets for performance marketing spend and started rationalizing non-headcount costs. We continue to aggressively renegotiate contracts as they renew. Additionally, we are actively marketing our New York office space with the goal of reducing our real estate footprint.\n\nSome of these actions are immediate, while others will take time to impact the income statement. We are not satisfied with the EBITDA margins reflected in our third quarter and are focused on identifying and realizing incremental cost savings. In summary, our expectation is that e-commerce will revert to historical growth rates over time. We are positioning ourselves to emerge from the current environment with a deeper competitive advantage.\n\nThat's why we continue investing in auctions, international expansion and supply to drive long-term growth while managing expenses elsewhere. As always, we intend to adjust as needed, balancing long-term growth and EBITDA margin expansion. Thank you for your time. I'll now turn the call over to the operator to take your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Trevor Young with Barclays. Your line is now open.\n\nTrevor Young -- Barclays -- Analyst\n\nGreat. Thanks. Two, if I may. First, given the current environment, it would seem that your balance sheet gives you a pretty sizable competitive advantage versus some of the privates in this space.\n\nWhat buy-side M&A opportunities might make sense? I'm obviously not looking for specific targets, but rather any categories that are complementary or any capabilities that might be attractive in the context of buy versus build. And then second one, on the strong trends in auction, could you just provide some color on which categories tend to do better in that auction format?\n\nDavid Rosenblatt -- Chief Executive Officer\n\nHey. Good morning. This is David. Yes.\n\nSo first, in terms of M&A, we do think this environment potentially does create opportunities, especially among smaller private companies that may have challenges in raising capital. I don't think the criteria is any different in this environment than it ever would be in any other. We have a very clear strategy, and I think we'd evaluate possible partners in the context of being able to help those strategies. So it could be straight consolidation, or it could be some of the things you mentioned, vertical expansion, geographic expansion, and so on.\n\nBut overall, again, I don't think it's fundamentally different than in any other market environment. And in all cases, it's important for us to remain focused on our strategy. Second, in terms of auctions, as I mentioned in the script, we are very pleased with our growth in auctions. Order volume, for example, in Q2 is up 49% versus Q1.\n\nI think it's a little too early to call it among different verticals. That said, jewelry and art have been strong for us. But again, we think it's super-early in this, and the opportunity exists in all of our verticals.\n\nTrevor Young -- Barclays -- Analyst\n\nGreat. Thanks, David.\n\nOperator\n\nThank you. Our next question comes from the line of Nick Jones with JMP Securities. Your line is now open.\n\nNick Jones -- JMP Securities -- Analyst\n\nGreat. Thanks for taking the questions. With kind of weaker conversion and just kind of challenged macro conditions, are there options on the platform to kind of get a little more nimble with maybe lower AOV items that could convert better? And then a second question on kind of shifting preference to mobile, or mobile browser, I think, is what you said. What initiatives do you have in place to kind of drive conversion up there? Is that forcing people maybe more into the app as opposed to the mobile browser? Any color there would be great.\n\nThanks.\n\nDavid Rosenblatt -- Chief Executive Officer\n\nYeah. So a couple of things. First, let me start with conversion. In general, the way I would characterize our kind of top-of-funnel activity is that the very top of the funnel, traffic, and engagement metrics, including things like favoriting and registrations and so on have been very healthy, as healthy as they've ever been in the business.\n\nWhen we look at conversion, the softness in conversion is concentrated or specific to new buyer conversion. The conversion rate from returning buyers is actually higher, or was higher in Q2 than it had been in the Q2 prior. And as you correctly point out, that softness, in turn, is driven largely by a mix shift in favor of mobile web and lower converting channels. Our strategies there, again, are not that different from what they've been in the past, which is a combination of, on one hand, incremental kind of always on improvements to the core user experience, things like figuring out how to optimize how we present shipping prices and changing around the format on mobile web landing pages and so on.\n\nYes, we want to continue to drive people into the app, as well. The app has conversion rates which are substantially higher than mobile web. With respect to your second question in terms of AOV, we have seen relative strength actually in lower AOV orders, which for us is below $1,000. I think that's across the board.\n\nAuctions has an AOV that's kind of in that zip code. And then we're seeing, at the same time, strength in the non-auction marketplace at those price points, as well. Where we've seen softness is at the higher AOV levels, again, not surprisingly. So we are continuing to feed that primarily through our strategy to expand supply via experimentation with different pricing formats, seller pricing formats.\n\nOperator\n\nThank you. Our next question comes from the line of Justin Post with Bank of America. Your line is open.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. First, a couple of questions on sellers. You're seeing a lot of accounts added, but obviously, GMV is slowing.\n\nAny pushback there? And how is non-transaction revenue trending? I'll start there.\n\nDavid Rosenblatt -- Chief Executive Officer\n\nI'll cover the second question. In terms of supply, so yes, as you correctly point out, we're adding sellers at roughly three times the rate that we added them historically. Churn, I will also note, is at kind of all-time historical lows. However, given the length of the sales cycle on 1stDibs, there is a pretty substantial lag time between when we add sellers when they add supply, right, because there's a cumulative effect as they add more supply over time, and then when those translate into GMV.\n\nSo we're in the phase now where we're adding a lot of sellers. Obviously, most of that supply has not yet converted into orders, but that's in line with the experience of all sellers on 1stDibs, and we'll have a much better sense of how that inventory performs over the next six to nine months. I would also say that auctions really potentially does change the velocity of sales. It's the one product we have that creates urgency.\n\nIt's also a value-oriented product, which I think works well with the macros that we're currently in. And so we expect to see those two strategies act somewhat synergistically.\n\nTom Etergino -- Chief Financial Officer\n\nThis is Tom. Our non-transaction revenue, it's been relatively flat year over year. It's primarily subscription-based revenue, excluding our Design Manager, which clearly, we sold in quarter. So year-over-year trends, excluding Design Manager, have been flat, relatively flat\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you. And then two follow-ups. It looks like some interesting progress on auction.\n\nJust wondering the scale of that to start moving the needle. Is that a year away? How are you thinking about that? And then, secondly, how do you correlate sales that you see with the housing market? Do you think there's a correlation there? And is that one metric to watch on potential future sales? Thank you.\n\nDavid Rosenblatt -- Chief Executive Officer\n\nYeah. So first, in terms of auctions and when they move the needle, I mean, to some degree, they have. So in Q2, for example, auctions were roughly 5% of our total order volume. That increased in July in percentage terms.\n\nSo there's less of a GMV impact because the AOV on auctions is lower than that of the rest of the marketplace. But as long as we continue our current momentum, I think it will obviously continue to grow in impact over time. In terms of the correlation of our sales with the housing market in general, we're much more levered to the luxury housing market, and we have seen continued strength in trade. Trade had a good quarter in Q2.\n\nTrade growth rates, GMV growth rates softened a little bit versus the prior quarter but were still very healthy. And what we hear back from our designer clients is that in Q3, Q3 last year, we were comping a quarter where there wasn't typical seasonality. This year, there is some seasonality; again, we hear from our customers in Q3. That said, they also report to us that their own pipelines are full and remain healthy.\n\nSo I'm not a macroeconomist. And we're still early in the adoption cycle of digital by the design community. So it's sort of hard to know whether secular trends, how they relate to kind of economic cyclicality. But everything we hear from our customers, at least over the near-term horizon, is positive.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. Thank you very much.\n\nOperator\n\nThank you. Our next question comes from the line of Mark Mahaney with Evercore ISI. Your line is now open.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thanks. I want to ask two topics; one on international, the localized versions out in Germany and France. Just remind us, the country roadmap, so other markets that you're looking to roll out? And then your thoughts on how long it will take those two markets to ramp up to where you want them to be now that they're launched, now that they're localized.\n\nIs that something that takes a year or two? Or is that half a year? Just your thoughts on how quickly that takes to ramp up to be material to you? Because there's clearly a lot of kind of pent-up opportunity there given the data points you've disclosed about the percentage of sellers and buyers that are already overseas.\n\nDavid Rosenblatt -- Chief Executive Officer\n\nYeah. So just to recap, I mean, July was our first full month where we had a kind of sequential comp for international. And what we saw was traffic from German, French IP domains, meaning not necessarily only to the new sites that we launched, but overall from those countries were up, between the two of them, well over 50%. So we're pleased with our progress there, particularly since our first priority is to grow traffic.\n\nIn terms of both the roadmap for other countries and then also kind of the overall impact, I mean, in terms of the roadmap for other countries, our first priority is to make sure that we develop the playbook via scaling France and Germany. So that's both growing traffic organically and inorganically, and then obviously converting that into orders. So we're still in the early stages there. And as soon as we feel like we have a good handle on that; then, given the cost, we'll then apply that to new markets.\n\nBut I think it's a little premature to assign a month or a quarter to either of your questions.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nAnd then one follow-up on auctions. I know people have already asked about this a little bit. Are there any pockets of resistance to the rollout of auctions? Do you find that there are certain seller bases, certain categories, or certain buyer cohorts that would prefer not to have auctions? It would seem like a pretty good win for the marketplace, for sellers and buyers. I know it's a small part of your business now, but you have kind of a hybrid, as eBay did way in the past, Buy It Now and auction format.\n\nSo just talk about the resistance to, if there are any, or the obstacles to getting options more broadly rolled out.\n\nDavid Rosenblatt -- Chief Executive Officer\n\nSo on the demand side, I wouldn't call it resistance; but, I mean, auctions don't really work as well with the trait, with the interior designer business model. They operate on schedules, and almost definitionally, of course, auctions don't really correspond to customer buyer schedules. So that's the customer segment for which it isn't a perfect fit. On the consumer side, obviously, on some level, it appeals to everyone, particularly people who are focused on value.\n\nSo we do see occasionally, for example, designers who appreciate value, or because they appreciate value, buy. But usually, they're buying for their own account rather than for their client's accounts. I think on the demand side, the biggest obstacle is really awareness. I mean, we've been in business for almost 20 years in one form or another without auctions.\n\nAnd now, all of a sudden, we've had them for eight months. So kind of growing awareness among both our existing buyers that we have this format and understanding how it works, as well as marketing to people who love auctions and are active auction buyers. But because we haven't had auctions, haven't been 1stDibs customers is, I think, the second challenge. On the supply side, again, I would say I wouldn't call anything an obstacle.\n\nI mean, sellers have adopted auctions. And actually, we saw a very substantial acceleration in supply growth in Q2 versus Q1 from our sellers. I think the biggest challenge is really the learning curve of helping our sellers understand how to price for auctions versus the marketplace. Part of the reason why auctions are so compelling is that, whereas in the marketplace sellers price typically at a slight premium to where they anticipate the market clearing price to end up for a given item because we support negotiations; in auctions, it works the other way, right? You want to generate a competitive dynamic by starting with a lower price.\n\nSo that's a somewhat counterintuitive pricing strategy for our sellers and very different than the way they price on 1stDibs for a long time now. So a lot of our effort is focused on teaching them kind of how to price to maximize the value and the impact of auctions.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nThank you, David.\n\nOperator\n\nThank you. [Operator instructions] Our next question comes from Ralph Schackart with William Blair. Your line is now open.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nGood morning. Thanks for taking the question. Two, if I could. Last quarter, you talked about improvements in shipping loss provisions.\n\nJust curious how that trended this quarter. And then maybe just kind of turning to expenses. It sounds like you're making some improvements both in the short-term and maybe a little bit longer-term in duration. But if the macro deteriorated further, maybe kind of just speak to your philosophy and how you're thinking about margins and could you potentially be more aggressive on some of the cost savings.\n\nThank you.\n\nTom Etergino -- Chief Financial Officer\n\nSure. This is Tom. I'll take both of those questions. So shipping charges, to remind everyone, are primarily borne by the buyer.\n\nWhen our shipping quotes are different from our actual expenses, we do take a loss. Shipping expenses in the second quarter were minimal, less than $100,000 as we do continue to increase our pre-quotes to reflect the changes in shipping prices. So you're correct in stating in Q4 we took a larger charge. We course-corrected in Q1, and we've continued to ensure that our pricing is appropriate and that the charge in the quarter was minimal as a result.\n\nAs far as on the expense side, yes, we're committed to calibrating our expenses to current demand environment, and we're evaluating all of our options. During Q2, as you mentioned, we did begin to make some concrete actions to align our expenses to demand. We drastically reduced our number of open roles, limiting our hiring to only critical hires. We increased our efficiency thresholds for our performance marketing spend.\n\nAdditionally, we're renegotiating aggressively on all new contracts as they come up. And we began actively marketing our New York office space, as well, as a result. Obviously, that will take time to realize any savings there. And we're going to continue to work in the third quarter.\n\nWe're moving quickly to adjust our plans, and we would expect you to see substantially more financial progress, which will flow through primarily in Q4. I will say I'm not satisfied with the EBITDA margins that we reflected in the third quarter guidance, and we're focused on identifying and realizing more incremental savings. However, we do want to be careful not to trade off future growth drivers. So we continue to resource our key strategic initiatives, the ones that David has been talking about on this call, auctions in international, and the supply expansion.\n\nAnd we expect to drive long-term growth there and deepen our competitive position. So we are going to continue to fund those strategic initiatives.\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKevin LaBuz -- Investor Relations\n\nDavid Rosenblatt -- Chief Executive Officer\n\nTom Etergino -- Chief Financial Officer\n\nTrevor Young -- Barclays -- Analyst\n\nNick Jones -- JMP Securities -- Analyst\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nRalph Schackart -- William Blair and Company -- Analyst\n\nMore DIBS analysis\n\nAll earnings call transcripts"
}