{
  "companyName": "Roblox Corporation",
  "companyTicker": "RBLX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/roblox-corporation-rblx-q2-2022-earnings-call-tran/",
  "content": "Roblox Corporation (RBLX 5.06%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Dennis, and I will be your conference operator today. At this time, I would like to welcome everyone to the Roblox second quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the conference over to Stefanie Notaney, director of financial communications.\n\nPlease go ahead.\n\nStefanie Notaney -- Director, Financial Communications\n\nGood morning, everyone, and thank you for joining our Q&A session to discuss Roblox's Q2 2022 results. With me today is Roblox's CEO, David Baszucki; and CFO, Mike Guthrie. Before we start, I want to remind everyone that yesterday after market close, we published a shareholder letter and earnings results on our investor relations website at ir.roblox.com. On this call, we will make some brief opening remarks and reserve the rest of the time for your questions.\n\nFor our webcast participants, please note the question icon at the bottom of your screen where you can type in your questions. We'll do our best to take as many questions as possible in the time we have allotted today. On today's call, we may be making forward-looking statements, including, but not limited to, our expectations of our business future financial results and business and financial strategy. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those described in our forward-looking statements, and such risks are described in our risk factors included in our SEC filings, including our Form 10-K filed for our first quarter ended March 31, 2022.\n\nYou should not rely on our forward-looking statements as predictions of future events. We disclaim any obligation to update any forward-looking statements, except as required by law. During this call, we will also discuss certain non-GAAP financial measures. Reconciliations between GAAP and non-GAAP metrics for our reported results can be found in our press release issued yesterday, as well as in our supplemental slides, copies of which can be found on our investor relations website.\n\nThis call is being webcast, and it will be archived on our website shortly afterwards. With that, I'll turn it over to Dave.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nThank you, and welcome to our investors, and welcome Roblox community. I'll share a few quick highlights and then we'll take questions. We had a solid Q2, and then we followed this up with July, which was absolutely the biggest engagement month in Roblox history, including all peak COVID times. And the month of July was a peak across regions and across demographics.\n\nI want to share a few highlights. In July, our DAUs were $58.5 million, up 26% year on year. And our hours of engagement were 4.7 billion hours across the whole platform, up 25% year on year. I want to highlight that this year-on-year growth and this peak engagement also included our core U.S.\n\nCanada market, with DAUs up 15% year on year and hours up 23% and bookings up 14% year on year in July. We continue to see accelerating growth in our over 13 DAUs, which were up 36% year-on-year globally. And as greater than 13 users on the platform become more prevalent, this is a good harbinger of the potential size of this market and why we continue to be so optimistic. And then finally, we exited June bookings up 8% year on year and July bookings up roughly 8% to 10% year on year.\n\nThis is powered by amazing content and our amazing community and continued innovation on the technology side. On the content side, we are approaching 50% of our top 1,000 experiences with more over 13 than under 13 players. And our developer community with our developers producing experience that gained over 1 million hours per month is up 32% year on year. We continue to see great brand experiences side-by-side, the amazing Roblox experiences that has traditionally been on our platform.\n\nAnd more and more of these are self-served. I'll highlight some of the brands we shared with this last quarter, including Gucci Town, which had over 30 million visits since March. We saw Tommy Play from Tommy Hilfiger with over 7 million visits since June. Wimbledon released WimbleWorld and Spotify Island was released, which is a persistent space with artist appearances.\n\nI want to highlight that we are getting to the point where our 17 through 24 cohort is going to pass our nine through 12 cohort in size. Now, the 17 to 24 cohort is larger. But once again, this is a great signal of the potential size of our market across all ages. This growth, in addition to being powered by our amazing content developers and our amazing viral community is supported by our innovative tech, some of which is iterative and measurable, including improvements to our Roblox translation system, including the quality and personalization of our search and discovery system and even including things that might not be ratably noticeable such as the speed that our mobile app and game joins occur in this raw performance.\n\nOn the vision side, our layered clothing system is just a first step to very highly personalized avatars across the platform. Our voice system is rolling out and is a great sign of really the future of how people will communicate on platforms like Roblox. And our physically based material system has been widely acclaimed by our developers as the next step in taking Roblox to a more realistic look and feel. Finally, I want to highlight that we continue to work on innovative, immersive, native monetization systems, and we do expect to be rolling out a test of our immersive advertising system sometime later this year.\n\nYou'll notice in our announcement, we are making investments in infrastructure. We are building a worldwide cost performance and reliability. We're leading infrastructure into active performance around the world. And I want to highlight that infrastructure performance contributes to our growth with an example of the recent data center we deployed in India.\n\nFinally, we continue to hire at the same rate we did in H1 and are optimistic about continuing to bring great talent into the company. With that, we will move on to your questions. Thank you.\n\nOperator\n\n[Operator instructions] And we'll first go to Drew Crum from Stifel. Please go ahead.\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nOK, Thanks. Hey, guys. Good morning. So Dave, in your shareholder letter and your preamble, you noted your fastest growth demographic in U.S.\n\nand Canada was that 17- to 24-year-old segment. Can you remind us how this cohort monetizes relative to others on the Roblox platform? And then, I have a follow-up.\n\nMike Guthrie -- Chief Financial Officer\n\nDrew, it's Mike. Just getting into the numbers. In the last -- in the month of July, that 17- to 24-year-old cohort in the U.S., and we measured this on a bookings per hour basis, was actually just slightly ahead of our core nine to 12 demographic, which historically has been our peak monetizing age demo. Now, we've expected that.\n\nOver time, we would say that the older users who have more direct control over their spend become more prominent in the market. They would monetize better, and we certainly saw that in July.\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nGot it. And then, Dave, maybe more broad question. During this current earnings cycle, several video game publishers have cited weaker trends across mobile gaming with Roblox being a free-to-play model. What are your thoughts on how the business should perform during a period of economic weakness?\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes. I want to highlight one of the wonderful things about Roblox is we're not a game and we're not really even a game platform. We're a future human experience platform. And a lot of what people do on Roblox is to come together to be together, to connect, to socialize.\n\nWe're starting to see people supporting educational experiences. We have traditionally been neutral, i.e., immune to these types of economic cycles. We have a robust economy. We've been through these cycles before, and we've been relatively immune to them.\n\nOperator\n\nWe'll move next to David Karnovsky at J.P. Morgan. Please go ahead.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for the question. I wonder if you could just discuss the ongoing rollout of voice chat, how developers and players are responding to it and how that might be impacting frequency for some of the older cohorts. And then, just as a follow-up, you mentioned a test of immersive advertising later this year.\n\nJust wondering if you could expand on the scope of that and what that potentially implies for rollout or when you might be able to update investors on kind of the longer opportunity there.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes. I want to highlight consistent with our values and the way we run Roblox since the early days, safety and stability is high priority here. We are rolling voice out. It is partially rolled out now with older players with validated IDs in which we're opening that aperture.\n\nWe can measure increased engagement from the people using voice. And so, we're very optimistic about what's happening there. The vision of immersive advertising has been around for a long time, and this is both performance, as well as brand advertising. We are going to be rolling out tests ultimately along both of these lines.\n\nAnd it's the notion that in an immersive 3D space, it's a lot less -- there's a lot less friction when we see appropriate advertising, just like we would in the real world of billboard ads, for example, which we could scale across all the experiences on Roblox. But we're also optimistic now that we see many brands establishing a presence in Roblox that some of these brands will also want performance marketing, which is a way for -- in the appropriate case for people to be able to go to one of our brand partners directly from someone else's 3D experience. So we're really optimistic about this. And we love the idea of, in a gentle way, complementing our already very healthy economy with an additional potential revenue source.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nWe'll move next to Clark Lampen with BTIG. Please go ahead.\n\nClark Lampen -- BTIG -- Analyst\n\nThanks a lot. Good morning. I wanted to come back to the sort of success that you're seeing with 17-plus users just because we are seeing a lot of signs of success with aging out, both in terms of aggregate DAUs and engagement. Could you give us more of a sense how those users are engaging differently versus younger ones? Are they spending time in different experiences? Or are they monetizing more passively or using different hardware? Any color you could provide would be appreciated.\n\nAnd then, Mike, just given you guys made some comments around sort of capex trends over the balance of the year. Could you give us a sense for infrastructure investment projects? Is this really a '22 endeavor? Or is this something that we can see sort of stretching into '23 and beyond? Anything you can say about cash flow and capex would be appreciated.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes, I'll start off on the experiences. I noted that the top 1,000 experiences on our platform, 481 now have more 13 and up players than under 13 players. Our developer community is amazingly responsive. The quality of the content that they're creating is getting better and better, both based on their sophistication, the size of their teams, as well as our tool set and our infrastructure.\n\nAnd we can see more and more experiences in those top thousands that are very heavily targeted to older players. So like any healthy market, given the size of our developer economy, we are seeing developers respond with those experiences. And in addition, we have a pipeline of experiences that are very aligned with the types of things older players might want to do coming through our game fund. I want to highlight that across our platform the vision for a platform like this goes way beyond playing games.\n\nWe know right now, for example, in the midst of COVID, people use robots as a communication tool to be together when they can't be together physically. We can see partners like FIRST Robotics now getting ready to launch educational experiences for people who can't build Roblox with the physical kits. And we ultimately, all of our brand partners including our music partners, are using Roblox as a way for people to go to concerts together. So the vision of this category is bigger than play.\n\nAnd as you correctly note, there's a lot of difference use patterns we see across the platform.\n\nMike Guthrie -- Chief Financial Officer\n\nAnd Clark, capex will be spread across the balance of this year and next year. So we'll certainly be investing in infrastructure across both periods. Timing of spend, we give a rough estimate of what it looked like for the back half of the year, but we'll definitely have incremental spend in 2023. But we view it as incredibly productive and is partially driven by just a substantial growth in our user base and a desire to get to more -- even more economical infrastructure.\n\nSo more performance, more reliable and more efficient for us.\n\nClark Lampen -- BTIG -- Analyst\n\nThank you.\n\nOperator\n\nWe'll move next to Matthew Cost at Morgan Stanley. Please go ahead.\n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking the question. So one for Dave, one for Mike. Dave, just there's much in the letter about key investments and product initiatives that drove a positive impact for July.\n\nYou touched on it in the prepared remarks, but I wonder if you could just give any more detail about what specific products you think were the most impactful for July. And then for Mike, just wondering how should we think about the pathway for margins from here as you continue to invest in new hires and infrastructure?\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes. Our growth is powered by the content created by our community by the core virality of our product, which is great content, coupled with a viral loop and then with innovative technology. All of the things I measured are early signals. Our layered clothing system is an early signal toward hyper personalized avatars that more and more might look like you might be of various styles that are supported by our creator community.\n\nSo this is a first step. And on voice, once again, would highlight long term. We see more and more people potentially using voice as we roll this out. There are also under the covers coupled with the visionary type we're working on, constant iterative improvements on raw performance, how quickly can you join a Roblox experience.\n\nSo we can see our translate system, we can see search and discovery, we can see raw mobile app performance, we could see our game engine performance, all contributing to growth as we go forward. And up and down our product stack, there continues to be big things we're working on. We'll share some of these at investor day, but we have a lot of other visionary things in the pipeline. We've said publicly that this doesn't really stop until we're supporting a 50,000-person concert at photorealism in real time with simulated audio and video.\n\nSo there's a huge runway for technical innovation in this space.\n\nMike Guthrie -- Chief Financial Officer\n\nAnd then, Matthew, you asked a question about margins. So let me address that, and then I want to make another comment here. During sort of peak period, so let's go back, prior to scaling what we saw during COVID, the business tended to run in EBITDA margins in the mid-teens, pretty consistently. And as we scaled up during COVID, those margins basically doubled, and we found ourselves in the 30% range.\n\nAnd we were really clear at the time that that was not steady-state margins for us, and we saw an enormous amount of opportunity to invest. But the top line is growing so quickly that it's very difficult to almost bring the margins down. What we've chosen to invest in are the things that we see incredibly high ROI, hiring great people, pushing more in the economics for our developer community, which is clearly bearing fruit today, and we'll continue to do so in the investment in infrastructure. Today, as we've been incredibly consistent in our investments and the top line has flattened as we're coming out of COVID and now it started to pick up again, obviously, margins are going to move around.\n\nWhat's consistent is that we're investing for the long run and that we have the unit economics and liquidity to continue to do that. I suspect that when we get into 2023 and we're no longer dealing -- or hopefully, no longer dealing with COVID comparisons or non-COVID comparisons, we'll start to see the top line grow at a rate that will allow us to produce a really healthy EBITDA margin. We will, however, continue to invest in infrastructure next year. So free cash flow margins will be down.\n\nBut overall, operating margins, I think, will go back up and we'll be in a healthy place. So we'll continue to invest for the future. I just want to make one quick comment. You had -- in your note this morning, you said that you expect elevated SBC will continue to drive scrutiny on the risk of dilution from new higher retention background.\n\nI just -- maybe we'll just removing scrutiny. We've been really clear, we wrote in the letter. We've been tracking this as a management team, as operating executives, and we're spending an enormous amount of time structuring our compensation plans and our recruiting plans. We worked with our board.\n\nWe saw this coming, and we've been really clear that we would keep share dilution under 5%. The good news here is you've got shareholders on the side of the table. And so, we are a dilution-sensitive as any shareholder who is out there on the call. So we're going to continue to recruit great talent.\n\nWe're going to continue to compensate our people. And we're also going to watch the dilution and keep it under 5%, and hopefully do even a little bit better than that. So I don't think there should be undue speculation or concern there.\n\nOperator\n\nWe'll move next to Omar Dessouky with Bank of America. Please go ahead.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nHi, guys. OK. So can you please give me an update on the level of adoption of layered clothing among your players, No. 1? And No.\n\n2, back in March, shortly after its launch, you had showed that the purchases of layered clothing items did not cannibalize purchases of existing 2D and 3D clothing items, and that was at the GBC. I wanted to ask you whether that is still the case. And No. 3, do you have a sense yet for when 3D layered clothing will be coming to the community at large, the creation of 3D layered clothing will be coming to the community at large? And I have a follow-up question after that.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes. I'll go highlight, and then I'll see if Mike has the numbers floating around on that. Taking a step back and peaking at the vision of where this is going, it's ultimately every avatar, every head, every piece of clothing on our platform is created by the community. Historically, almost all of this was created by Roblox, and we're just about through that transition where everything is made by the community.\n\nThe final one that you're going to see rolling out is Avatars themselves being created by our community as well, and that will bring us full circle and you'll see an amazing new look. So we are very optimistic that this is not viewed as a necessary cannibalization situation as much as where is the future here. And the future is everyone has a hyper-realistic avatar. It looks just like them.\n\nYou can imagine all the ways we might build in avatar including using a camera on a device, using ML, using developers themselves. There's a lot of interesting and exciting ways in the future. We'll build avatars, coupled with a lot of clothing that is more and more created by our community. So this is the right direction.\n\nIt is the big vision. Ultimately, all of the clothing on our platform will be 3D clothing. And there will still be an opportunity for users to create clothings, but it will be painting on 3D clothing rather than long term using our traditional 2D clothings. I don't know, Mike, if we are sharing any numbers on the adoption.\n\nBut ultimately, we expect 100% of users to be using layered clothing.\n\nMike Guthrie -- Chief Financial Officer\n\nYes. So I would give you a couple of quick numbers and just some trends. I think that's the most important thing, but it's a good question. So as of June 30, we had over 100 million users that had actually acquired a layered clothing item.\n\nAnd we've been doing tests to look at the economic output of those users and how they behave. And we've clearly seen it being accretive to bookings and robust spend. So we'll give more data as that becomes a bigger and bigger part of the business. But so far, the early indications are high levels of adoption and high performance within the user base that does acquire the items.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nOK. And then, along the same kind of topic, you released dynamic heads toward the end of June. And I was wondering -- and you also said, I believe, in the release that dynamic heads would be available in the avatar store at some point in the fourth quarter, which is new information. Can you give us a little bit of an idea of what the plan for monetization of dynamic heads is? Like will the heads developed by a curated community of creators sort of beyond sale there? Will users buy heads with a subset of emotions that are animated on their faces.\n\nI guess exactly -- what exactly will the buyers on Roblox be buying?\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes. Let's take a big visionary step here. And we acquired a company called Loom.ai over a year ago, and you can check out the types of demos and the technology that they create, but it ultimately drives toward the vision that for those users who so choose on our platform, in addition to having their avatars to be more personalized and more animated like themselves, the opportunity to actually have the heads and faces of those avatars animate instinct with optionally the use of the camera on your device or lip syncing. We shared demos of this.\n\nI've done meetings this way. It's absolutely immersive and engaging in the future of where this is all going. Dynamic is one part of this. And the rollout will occur in various steps.\n\nOne is developer tooling. The next step is very simple things like emojis and really emotes actually and the ability to have a pre-canned animation on your head and ultimately full tracking of that. We always think long term, first and foremost, about engagement, retention and really frequency and making our experiences better. Because our bookings tend to scale with bookings per hour, we expect the more engagement we get, the better this is going to really be on top.\n\nSo I think we're not as much -- there is huge opportunity for Dynamic heads in our marketplace. And at the same time, I want to highlight that we're primarily thinking about this long term as increasing engagement. But it's going to be overall positive in both dimensions. And then, I don't know, Mike, if you want to share anything on top of that.\n\nMike Guthrie -- Chief Financial Officer\n\nNo, I think we'll report more as we have more data and maybe touch on this at investor day next month.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks very much.\n\nMike Guthrie -- Chief Financial Officer\n\nThanks, Omar.\n\nOperator\n\nWe'll move next to Bernie McTernan at Needham & Company. Please go ahead.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thanks for taking the questions. Maybe just to start, if you could talk about the product improvements to search and discovery. You spoke about on the last call, and I think it helped with some of the age of content this quarter.\n\nSo if you could just detail when the improvements happened during the quarter and if there's still more improvements to come, just looking for a full quarter benefit in the third quarter.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nI want to highlight that one of our vision -- values is take a long view, but one of our values is get stuff done. These improvements are happening every day. They are not forklift drops. There's a constant weekly improvement in the way we do search and discovery.\n\nThere is so much opportunity here because as people come to our platform from different regions, from different ages, from different interest, there's an amazing opportunity to personalize the types of experiences they see when they both first join our platform, as well as when they become mature users. And we have a lot of signals that you might not find on a traditional platform, including what are your friends doing, what do people like you do, what have you done in the past. So this is constantly improving. We are more and more getting personalized.\n\nWe are ultimately trying to share experiences with everyone on the platform that will keep them engaged as much as possible and ultimately drive the long-term enterprise value. And this is occurring both in cold start, as well as a warm start for more mature players on the platform. So to go full circle on your answer every day, I will add that one of the things we have done in the last quarter, we shared that we were going to do it is more and more move to the efficient frontier where we have historically been 100% engagement based on our discovery and search. We believe there is an efficient frontier where engagement is balanced with monetization that drives the overall health of our platform.\n\nAnd really, when we have two experiences that are both retaining well, that are both predictive of the same play time, we are nudging toward that experience that monetizes better in that type of situation, which is what the efficient frontier is about.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nUnderstood. And then, just as a follow-up, in the past, you've spoken about the weekend versus weekday usage, and that gave you confidence in to be able to grow following the tough COVID comps. Can you just talk about what you're seeing for weekday versus weekend usage now that you're at peak engagement again?\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nI want to just highlight that our long-term growth has so much opportunity, it's not predicated on weekdays or weekend. Even in our most healthy long-term cohorts, which would be U.S., Canada in nine through 12, there's a lot of headroom there given that traditional Roblox users aren't using Roblox every day as a communication tool. So there's a lot of room on frequency within our traditional audience. As you can see, the growth rates in our 13 and up and 17 through 24 cohorts, that cohort of 17 to 100 is much larger than the cohort of nine through 12.\n\nAnd so, there is also amazing headroom among the older players on our platform to complement the headroom we have in our traditionally strong cohorts based on frequency.\n\nMike Guthrie -- Chief Financial Officer\n\nYes, just adding to that, we -- when COVID started, our core age demo spiked up very quickly and especially in terms of engagement. And then, as we started to lap and reopen, obviously, especially in the U.S., that nine to 12 cohort was actually [Inaudible] bookings growth numbers down, but we were making up for in other places. We've now gotten to the point where we crested back to the point of we're on an absolute level. Those cohorts are now growing around the world.\n\nAnd importantly, in the U.S. and Canada because that's where there's a more significant amount of wealth and spend. So we are now at peak levels of daily active users and engagement and bookings in those nine- to 12-year-old cohorts in the U.S. and benefiting from growth in 17 to 24, 13 to 16 and all the older user bases.\n\nSo we're in a great position. We're finally now on an absolute basis. Now, where all of that growth that we benefited from during COVID, we've absorbed. We've obviously retained the vast majority of it, and we're now growing on top of that really across all age demographics.\n\nSo that's true on Tuesdays, Wednesdays and Fridays and Saturdays as well. So yes, I think we're -- hopefully, if we all stay healthy and go on living our lives, we'll be more or less done with COVID comparisons here pretty soon.\n\nBernie McTernan -- Needham and Company -- Analyst\n\nGreat. Thank you both.\n\nMike Guthrie -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nWe'll move next to Eric Sheridan at Goldman Sachs. Please go ahead.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the question. Maybe talk a little bit about what you're building on the advertising side as another means of monetization. And how should we be thinking about the mixture of both investments on the advertising side, building relationships with advertisers and what you see as some of the revenue output of that as we look out over the next couple of years.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes. I want to highlight the opportunity on our platform, both for traditional experienced developers who are new developers creating new games and experiences on our platform, as well as brands who are establishing presence for people to interact with clothing, people to interact with music, people to interact with beauty, people to interact with a wide range of things and potentially even monetize within those experiences. So traditionally, a lot of these experienced developers and brands have been saying, how do I boost more, how do I get more traffic to my experience, how do I do a test, how do I reliably bring 1 million users a day to this experience. And this is the wonderful opportunity for native immersive non-intrusive advertising in our platform.\n\nImagine we are at one of our most popular Roblox experiences. Imagine a AAA partner had a small pop up in the town square, and players will be able to choose whether to stop by, use that pop up or portal or door, you name it, to jump over to one of our brand experiences, experience something new, pick up some free merchant and back, pop back to the experience that they're playing. So this is a very scalable potential way to incorporate gently, both playing, as well as performance and brand advertising. Given that we did 4.7 billion hours of engagement in the month of July, even at a very conservative gentle way is an initially trying this with top-notch brands, you can see the potential there relative to the advertising per hour.\n\nSo I said it before, this has been always a visionary type of advertising. It's exciting because it doesn't get in the way of a user or add friction like some other types of advertising. And we believe it will actually be a fun and positive way that will complement our experiences.\n\nMike Guthrie -- Chief Financial Officer\n\nAnd Eric, you ended up your question on are we scaling up the team internally to covering the brands? Is that the last part of your question?\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\n[Inaudible]\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes, I think I'll take two things, and then Mike, maybe finish. We are building -- traditionally, what has powered Roblox is the notion that at its foundation we built self-service. And self-service is always more difficult to build than bespoke things. Our Roblox's success is we are a self-service platform for experienced creators.\n\nThe product direction for this advertising system will also be self-service, but it will be complemented by our amazing brands. We have a great team. It's scaling. We have amazing people who are working with the Gucci and the Tommy Hilfiger to us in this new form of advertising to the platform.\n\nAnd we expect to continue building this amazing brand team. It will not be a sales team, it will be a consultative team to help people who are doing self-service and exploring our platform.\n\nMike Guthrie -- Chief Financial Officer\n\nYes, I'd just add, it is a thing that's been in place for a while. These discussions with brands have been going on for quite a while. And we really do see it above and beyond just an ad sales organization. It's very strategic.\n\nAnd we've been talking with brand about the overall benefit of immersive engagement on our platform in multiple ways. You've heard us talk about this before. We have had incredibly high-quality brands more or less experimenting on our platform in a new medium, which is really exciting. We've not raised to monetize these too quickly.\n\nI think we've learned the time. And the team has done a great job, and the quality of the brands that we've been working with has just been first class.\n\nOperator\n\nWe'll move next to Matthew Thornton with Truist Securities. Please go ahead.\n\nUnknown speaker\n\nHey. Good morning, David and Mike. This is Steve on for Matt Thornton. Two questions, if I could.\n\nCan you talk about how we should think about the incremental monetization efforts lying around and impacting second half of 2022? Samples being sponsored or commercial pads and commerce. Also, how should we think about what normal seasonality is for August and September? And any growth comparisons you would call out for the second half of 2022?\n\nMike Guthrie -- Chief Financial Officer\n\nSteve, let me take the last questions and work in reverse. So we noted in the letter that there was Omicron happened in Q4 of last year. So we're just making sure that everybody is aware in doing their own homework as we go into the fourth quarter. Obviously, we've got a lot of momentum from May to June and June to July.\n\nWe expect that to continue. The normal shape of the curve in terms of the third quarter is what you saw last year, which is that from July to August, specifically August is flat to slightly down 2%, let's say, off of July that sort of the normal seasonality. And that's really because, of course, people start to go back to school. And so, later as the month goes on, you start to see the absolute numbers going down.\n\nThat doesn't mean the growth rates will go down. It just means the absolute numbers will go down. And so, it ends up being somewhere around 1% to 2%. September is full-blown back-to-school and on a sequential basis.\n\nTypically, last year, as an example, we were down 15% September from August. But that's totally normal seasonality completely expected. So you can -- I think the shape of the curve this year will be very, very similar. Q4 of last year, we had an unusual October.\n\nSo I just want to make sure everyone goes back and does their homework. We had an outage. So you've got to look at the numbers. We reported a lot of information on October last year.\n\nNovember, things start to pick back up around Thanksgiving. And then, December is obviously a huge month with the holidays. And I suspect that we're going to see the exact same trends this year because, generally, those are business seasonal trends that we've seen over the years.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes. I just want to highlight, we'll be testing our immersive advertising system sometime this year, we believe. Right now, we don't expect that to contribute to our bookings. We do -- I do want to highlight the things I have mentioned that are iterative improvements that we're constantly making, including translate quality, search and discovery quality efficient frontier.\n\nThose types of things may have small incremental improvements, but that's something we're doing all the time.\n\nOperator\n\nWe'll move next to Brandon Ross with LightShed Partners. Please go ahead.\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nThanks. Brandon Ross. Just looking at your devex fees, I think this is the first quarter that they actually went down as a percentage of bookings as far back as we have a window into. Can you talk about what you expect the cadence of devex to be over time? And how much pressure you feel as perhaps Epic rolls out the next version of Fortnite Creative and have potentially more significant creator splits? How much pressure do you feel to match or move toward those splits? Then I have a follow-up.\n\nMike Guthrie -- Chief Financial Officer\n\nSo our devex numbers as a percentage of bookings have been pretty consistently growing over time as we suggested for literally years. We wanted to share more and more of the economics of the developer. So I'm looking at the supplemental materials that we posted on our site. And if you look at that over the last three years, as a percentage of bookings, good numbers have gone from about 15% to 23% in Q1 and 22% last quarter.\n\nHonestly, I wouldn't read much into a 100 basis point movement in a 90-day period. I mean, there's mostly devex variable cost that is driven with bookings. So it goes up as bookings grows on an absolute dollar basis. It could come down a little bit if bookings comes down.\n\nBut generally, we've leaned in pretty heavily to this. The sheer growth in our developer community is all the sheer amount of creativity, new content. It's absolutely phenomenal. The economics for our developers is clearly getting better and better.\n\nWhen you look at the amount of currency earned by the 1,000th developer on the platform, those numbers are growing incredibly robustly. And so, we just see a bigger and bigger community making a full-time living on the Roblox platform, and we're incredibly excited about that. We have a unique value proposition with our developers. It is not -- we talked about this a lot.\n\nIt's not about absolute take rates. It's about the level of the service and the quality of that service. And we just continue to build great relationships with our community, and we'll continue to push more and more toward them over time. We have, I think, a few quarters ago, said that we would be pushing toward 25%, and we're obviously in that zip code right now.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes, four years ago at the Roblox developer conference, I made a wild conjecture that we'd see a developer studio with more than 100 people. And it actually has come through much sooner than we thought it would happen. And we're going to continue to see these larger studios go well beyond 100 people in the studio, which highlights the economic support they're getting from creating on our platform, as well as more developers down around 1,000 or even 10,000 who are starting to make money and filling out that super long tail of talent that's starting to build on our platform.\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nGreat. And then, in your letter when you mentioned the highest, the most engaged and most profitable cohorts that you have, I've noticed they were both male cohorts. And it got me to wondering what the overall split is between male and female on the platform. And what would take -- what you need to do to bring females up to parity with male engagement.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes, I want to highlight long term -- I don't know the exact ratio at the top of my head right now. I don't think we've ever shared it. But over the years, Roblox has more and more converged to exactly 50-50 on the platform. And the reason is these types of platforms support everything from traditional gameplay to their social gameplay to things spanning from sports to fashion, to beauty, to vehicles, you name it.\n\nSo we're pretty optimistic that, long term, the direction continues to be toward 50-50 with a wide range of types of activity on a platform like Roblox. And I think that shows in our internal numbers.\n\nMike Guthrie -- Chief Financial Officer\n\nYeah, and we --\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nThank you.\n\nMike Guthrie -- Chief Financial Officer\n\nYeah. Thanks.\n\nOperator\n\nWe'll move on to the next question from Eric Handler with MKM Partners. Please go ahead.\n\nEric Handler -- MKM Partners -- Analyst\n\nYes, good morning and thanks for the question. Two questions. I wonder if we could start with -- it seems like there's a lot of announcements in the last month or so of new brands getting involved in Roblox and the metaverse. And I'm curious, are there enough developers out there to support all these inquiries from the various brands?\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes. What I believe we're seeing right now, and we saw this with print a long time ago, we saw this with video more recently and we're going to see this with immersive 3D going forward is there is a traditional structure of service bureaus, of developers, creators who help either with graphics and video or 3D production. Our Talent Hub is serving the purpose of bringing these brands together with our creators. We have an active market for people to connect here.\n\nAnd many of the brands that are starting to shop on our platform are doing it unannounced, which means they're doing it in a self-service way. They are finding developers out there either on their own or through our Talent Hub to help them or they're developing that expertise in-house. We think this is -- this highlights the future where our traditional developers have been 100% experienced developers for play or for social, but there's an emerging class of developers who are brand support developers who will complement those traditional experienced developers.\n\nMike Guthrie -- Chief Financial Officer\n\nYes, Eric, I think these are just a classic behavior of the market in a sense. It's a great question. And right now, we would hope almost that there's more demand than there is supply because that will be a signal to the community that this is a business that they can expand into. I was talking to a venture capitalist the other day, who has now invested in a Roblox studio, which again is a dynamic that we feel is very healthy.\n\nPart of what they've said was there's a really interesting balance between their investments and the experiences that they've built and in support of brands. And that's the dynamic that we want to see, and as that demand comes from brands that will spur on more developers. So if we are potentially capacity constrained on developers right now, that's just the market dynamic that will obviously clear itself up over time. And that's a really good signal.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nYes, and we can see some of these larger studios hiring new college grads with Computer Science degrees, bringing them onboard and training them in their corporate best practices for using the Roblox platform.\n\nMike Guthrie -- Chief Financial Officer\n\nI wouldn't be surprised to see agencies off of it as well.\n\nEric Handler -- MKM Partners -- Analyst\n\nWell, that was going to be my next question. Have you had any discussion with the big ad agencies about maybe even setting up some type of metaverse development studio?\n\nMike Guthrie -- Chief Financial Officer\n\nWe'll have to -- I can defer it to Craig Donato. Maybe he'll address that on investor day. It wouldn't surprise -- I know there have been inbound conversations with agencies, whether that specifically is where we've gone probably not, but why don't we defer that for next month, and we'll dig into that.\n\nEric Handler -- MKM Partners -- Analyst\n\nThank you very much.\n\nMike Guthrie -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nAnd we have no further questions in the phone queue. I'll turn the call over to Hans [Inaudible] for web questions.\n\nUnknown speaker\n\nI think we have time for one more question from the web. Dave, this is a question for you from Harco Patterson from So Far So Good Incorporated. Are there any plans to collaborate with educators and local departments of education to integrate actual great, appropriate supplemental education tools that mirror academic focus and lesson plans throughout the school year?\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nGreat question. Thank you. The vision for platforms like Roblox goes beyond coding and computer science, and it gets into simulation and ultimately, allowing people to be together in real life realize. I'll highlight one example of a partnership that is so appropriate for Roblox, and it will help so many students around the world.\n\nAnd that is our partnership with FIRST Robotics. So FIRST Robotics has traditionally been an activity that involves creation of Roblox testing them, competition. And it requires hardware, it requires kits for building road blocks. What we are doing with First Robotics is partnering, and they're creating a simulation that mimics Roblox -- robot construction and testing and competition virtually on Roblox rather than in the real world.\n\nSo this is a great example of an educational opportunity for many students around the world who may not have had access or opportunity to participate in a FIRST Robotic activity that cannot do it on a platform like Roblox. So we're really optimistic about the range of educational opportunity.\n\nStefanie Notaney -- Director, Financial Communications\n\nWell, that's a wrap for us. Thank you all for joining us today.\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nThank you, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStefanie Notaney -- Director, Financial Communications\n\nDavid Baszucki -- Co-Founder and Chief Executive Officer\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nMike Guthrie -- Chief Financial Officer\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nClark Lampen -- BTIG -- Analyst\n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nBernie McTernan -- Needham and Company -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nUnknown speaker\n\nBrandon Ross -- LightShed Partners -- Analyst\n\nEric Handler -- MKM Partners -- Analyst\n\nMore RBLX analysis\n\nAll earnings call transcripts"
}