{
  "companyName": "Astronics",
  "companyTicker": "ATRO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/astronics-atro-q2-2022-earnings-call-transcript/",
  "content": "Astronics (ATRO 2.90%)\nQ2 2022 Earnings Call\nAug 10, 2022, 11:00 a.m. ET\n\nOperator\n\nGreetings and welcome to Astronics second quarter 2022 financial results call. At this time, all participants are on the listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions].\n\nAs a reminder, this conference is being recorded. I would now like to turn a conference over to your host, Craig Mychajluk with investor relations. Thank you. You may begin.\n\nCraig Mychajluk -- Investor Relations\n\nYeah, thank you. Good morning, everyone. We appreciate you joining us here today. On the call with me are Peter Gunderman, our chairman, president, and CEO; Dave Burney, our chief financial officer.\n\nShould you have a copy of our second quarter 2022 financial results, which we released earlier this morning. If not, you can find a release on our website at astronics.com. As you are likely aware, we may make some forward-looking statements during the formal discussion, as well as during the Q and A session. These statements apply at a future events that are subject to risk and uncertainties as well as other factors that could cause actual results to differ materially from what is stated here today.\n\nThese risk and uncertainties and other factors are provided in the release as well as with other documents filed with the Securities and Exchange Commission. You can find the documents on our website or at sec.gov. During today's call, we'll also discuss some non-GAAP financial measures. We believe these will be useful in evaluating our performance, should not consider the presentation of this additional information in isolation, or is the substitute for results prepared in accordance with GAAP.\n\nWe have provided reconciliations of non-GAAP measures with comparable GAAP measures in the tables that accompany today's release. With that, let me turn it over to Pete to begin. Pete.\n\nPete Gundermann -- President and Chief Executive Officer\n\nThanks, Craig. And good morning everybody. As in most quarters, there are some good things to think about or good things that happened in the second quarter, and there are some things that are a little bit more concerning or maybe watch items going forward. I've organized my comments today to talk about the good things first and the watch items or bad things second.\n\nAnd then we'll go today for some specifics on a few topics, and then we'll do questions and answers afterwards. So the positive things, when I look at the second quarter, there are a couple things that really stand out to me. One is that demand continues to be pretty strong for our business and for our products. Second quarter bookings were $148 million.\n\nThat's slightly off the pace of recent quarters, but was still a book to bill of 1.15, leaving us with another record backlog of $494 million, an all-time high. This continues the trend over the last year. Over the last four quarters, we had bookings of $655 million against sales of $473 million. That's a book to bill of 1.38, very strong in our experience.\n\nThe important thing to recognize about the bookings that we've experienced to date is that for the most part, it's really a groundswell of business, kind of across the business as the aviation industry, particularly the commercial transport industry comes back to life. There are no big blockbuster bookings that inflated those numbers. It's really much more of a groundswell of business across the company. Again, a book to bill of 1.38 over the last year.\n\nThat being the case, in the second quarter, we did announce some major program wins, which we think are gonna be real important for driving our volume in the near future, but again, did not contribute meaningfully to our bookings in the second quarter. They will turn into bookings in the current quarter or the fourth quarter or the beginning of next year. And those three awards in particular that we released news about involve in-seat power for Southwest Airlines, one of the world's most prominent airlines obviously, and one that has never used our in-seat power product before, that's specifically for their 737 Max aircraft, which they run a bunch of Maxes now and they're going to take deliveries of quite a few more over the next year or two. We also announced SATCOM hardware award with Safran, which is going to be primarily originally for Airbus aircraft, but will be extended around the world.\n\nWe think this is going to be a meaningful contributor to our progress also, but again did not meaningfully contribute to second quarter bookings. And finally, we were awarded the electrical distribution system for the Lilium aircraft, which is our first major eVTOL announcement. eVTOL is electric vertical takeoff and landing. There are a bunch of other acronyms that describe that kind of aircraft, but most of you are aware that there's a bit of a rush going on around the world with a number of companies developing electric aircraft.\n\nAnd it happens as we've discussed before that our electrical system design expertise is very applicable to this class of aircraft. And we expect to play a prominent  role in it, recognizing that reasonable people can differ over the timing and magnitude of how that industry's going to take off, but we're pleased to be on the Lilium team, and we're running hot and heavy on that one and we'll continue to do so for the next year and a half, two years as they work toward certification. So demand is strong, has been strong, continues to be strong, and it's starting to drive a ramp in sales volume. And that ramp was beginning to show signs in the second quarter.\n\nWe expect it to step forward and become more of a driving force in our results in the third quarter and fourth quarter, as we close out 2022. Second quarter revenue of $129 million is really a step-up from where we were for the previous four quarters when we averaged $114 million. So $114 million, stepping up to $129 million, we think is an important indicator of where we're going. The second quarter was actually our highest volume since the pandemic took hold in the first quarter of 2020.\n\nAnd as I said, we expect the revenue ramp to accelerate in the second half of the year, the current quarter, and the fourth quarter. We revised our full year guidance to be $550 million to $580 million. The midpoint there implies average quarterly volume in the second half of $160 million. It's going to weigh a little bit toward the fourth quarter, third quarter being a little lighter, fourth quarter being a little heavier, but that's what we are thinking our average will be in the second half of the year.\n\nSo when you look at it sequentially, we averaged 114 for the previous four quarters, 129 in the second quarter, and we're thinking we're going to average about 160 million in the second half here. So it's quite a ramp. It gets us also, if we're successful within spitting distance of where we were before the pandemic struck when we were routinely in the $175 million to $200 million range. So if we can close the year being at or near $160 million on average, we'll within line of sight of where we were pre-pandemic.\n\nThere were some negative items of course, and they are significant also, nothing unique to our business, but more a sign of the macroeconomic situation that's playing out in many companies in our industry and around the world. Supply chain in particular continues to be a struggle, especially with electronics, but with other items also. We described it, I think in past calls as a bit of a whack-a-mole kind of game where you think you have things under control and things pop up last minute that causes delays or missed shipments. We continue to see those kinds of pressures in the second quarter.\n\nWe expect it's going to continue in the third quarter and fourth quarter. In the second quarter, compared to where we started out, we ended up deferring shipments or delaying shipments to the tune of about 5 million or 6 million over the course of the quarter. We thought we might end up -- we were shooting for about 135 as the quarter began. We ended up at about 129.\n\nThere is some reason for optimism. Most of our operations report that at least things are not getting worse. They've stabilized and in some cases seem to be getting a little bit better. And that lines up with what a lot of people are reading in the press.\n\nParticularly dropping demand from other sectors for things like electronic components might give reason for hope for our business, where we're a little bit more of a niche player, and we use some high reliability electronics, which are a little harder to get. But if the world in general relaxes a little bit in terms of demand, we expect that'll trickle down to our type of business also. The supply chain struggles are also the major reason for our revised revenue guidance. We up till now have been talking about 550 million to 600 million revenue range, top line range.\n\nWe're taking 20 million off the high end of that range. We're keeping the low end. So our revised range is 550 to 580. That midpoint, if we're successful, will be 565.\n\nAnd if we were to hit that, that would represent about 27% growth over 2021. So again, we think that would be a strong step in the right direction going forward. Second item that's kind of on the negative side is that labor shortages, still exist. The great resignation is how people refer to it typically.\n\nAnd we are not immune from these pressures. We're experiencing turnover, have experienced turnover like a lot of other companies and have had troubles attracting people more so than before the pandemic. The good news here is that we think pressure does seem to be lessening a little bit, that we're finding an easier time bringing people on board. People today are not our limiting factor in terms of deliveries.\n\nWe do not expect them to be going forward. Supply chain will be a bigger struggle, we think, at least through the rest of this year. Finally, again, a major macro economic issue, shouldn't be news to anybody in the call, but we do face some inflationary pressure on the inputs to our business, both material and labor. Some of these we expect to decline or reverse over time.\n\nWe do experience some spot buys for special material, where you have to go to secondary sources and pay some premiums to get parts in to make deliveries that hurts margins, of course, but we think it's important to keep up with our customers when we can with their expectations. There also is a general sense of inflation, both with material and labor. We think some of the commodity prices will decline as shipping expenses, for example, straighten out and revert back to something a little bit more normal around the world, which we expect will happen over the next year or so, six months to a year. But regardless, we are working to pass higher costs on as best we can.\n\nA lot of our business is tied up by long term contracts. We're more limited there. It's going to be a slower recovery, but other parts of our business are more higher  velocity orders and typically in lower volumes, but incrementally, we have flexibility at increased pricing in those areas and we're doing so as aggressively as we can. All this results in a lot of margin pressure.\n\nFrom my perspective, the biggest issue that we think we can correct in the near term is getting our volume up as I've already discussed. We have been intentionally maintaining a lot of capability across the business to execute on programs that our customers have entrusted to us. We don't want to change that. But we recognize that that puts pressure on our income statement.\n\nWe need volume to increase, to justify that organizational structure and cost that we carry across our business going forward. We think we're in good shape in this area, but we also need to deal with the elevated input cost. And we recognize that's going to be a major focus of ours as we work through the rest of the year here. Sequentially, of course, if you look back to the first quarter or to the fourth quarter last year, you'll recognize we had AMJP proceeds done.\n\nWe don't have them now. We also had earn out income in both those quarters from a company or a product line sale that we did a couple years ago. We don't have that right now. So the second quarter results kind of stand on their own and compared to the fourth quarter and the first quarter, look a little thin accordingly.\n\nA watch item, Dave will talk about this in more detail momentarily, but we did extend our bank facility for another three months. We announced that today to allow us to work a new deal with our banks, which is something we've been working on for the last couple months. Like everything these days, it seems to take a little longer than you'd think. And while we think we're pretty close coming weeks, we should be able to close up this new deal.\n\nWe needed to do an extension to allow the time to get that to happen. So I think that closes my prepared remarks. Dave, why don't you add in what you'd like?\n\nDave Burney -- Chief Financial Officer\n\nSure. Well, thanks. As Pete said, so while sales continue to improve, we've experienced headwinds are putting downward pressure on our margins. The consolidated revenue of $129 million in the quarter was up 16% from last year's first quarter and up 11% sequentially from the first quarter, driven by continued strength in the commercial transport market.\n\nDespite an $18 million increase in our top line compared to the year ago quarter, we experienced the operating margin decline. So why is that? So the margin headwinds for the quarter were on sales increase of $18 million compared to the previous year's quarter. Historically, we'd expect about 45% of that sales increase were about $7 million to $8 million to drop to the operating profit. But we didn't see that.\n\nWe saw our loss from operations actually increase from a loss of $5.9 million to a loss of $8.4 million. And Pete mentioned some of the headwinds that we saw for the quarter in comparing this quarter to a year ago. First, effecting comparability in the 2021 second quarter, we eliminated a liability relating to the contingent consideration on an acquisition from a prior year. Eliminating this liability had the impact of reducing our SG&A cost last year in the second quarter by $2.2 million.\n\nSecond wage and benefit inflation amounted to somewhere around $3 million to $4 million on top of the wage base from a year ago. That's close to a 10% or more increase there. It's not different than what other companies are seeing as well. Third, the cost of raw materials and sub assemblies is up somewhere in the range of 5% to 10% typically.\n\nIn addition to that, we have the cost of the spot buys that we've been making when we can find components outside of our traditional supply chain. Together, these are estimated to be about $4 million to $5 million compared to a year ago. And then we had some lower margins on a couple of development programs, where the programs were operating at close to breakeven. So they contributed sales, but no earnings on those, which is not totally uncommon, but it's not consistent from quarter to quarter.\n\nAdditionally when comparing operating margins this quarter, the preceding first quarter, first quarter of 2021 or 2022, rather, the first quarter had AMJP grant income of $6 million. And for the most part- that was offsetting cost to sales. And for the most part annual pay adjustments did not have that much of an impact on our first quarter this year, as most pay adjustments happened toward the end of the first and into the second quarter. Additionally, in the first quarter, we recognized earn out income on contingent consideration for the sale of the semi business totaling $11.3 million.\n\nThat's shown on the income statement below operating margin. Going to the balance sheet, it was not a strong quarter cash flow wise, as we used $10.6 million for operations. If you take a look at the cash statement of cash flows, clearly you can see what jumps out as the increase in the inventory. Most of the increase in working capital related to inventory and to some degree, a lesser degree to investment in receivables, which is expected given our sales increase for the quarter.\n\nPart of the increase is driven to inefficient supply chain and part driven to the fact that we're ramping up sales for the third and fourth quarter. It's extremely difficult to optimize  inventory levels when the supply chain is inconsistent in terms of lead times. And as a customer-centric organization, we've been erring on the conservative side to do our best to keep our on time delivery as high as possible with our customer base. Turning to the credit facility update, with the cooperation of our bank group, we extended the expiration of our revolving credit facility by three months to the end of August, 2023.\n\nThe extension will provide more time to get a long term credit arrangement in place. You may recall that three months ago we reported we were targeting they have this done by now. And as Pete mentioned, the process has moved a little bit slower than we expected three or four months ago. While we're not finished yet, we're into the final stretch in working with our lenders and expect that we'll have a new multi-year agreement in place shortly.\n\nSome select changes to the terms of the revolver relating to the extension is the facility was reduced from $225 million down to $190 million, further dropping to $180 million in mid-September and then $170 million in mid-October. The SOFR pricing spread increased by 100 basis points at all tiers, and there's a 10 basis point amendment fee. This financing strategy that we're working on and expect to have completed in the quarter will provide sufficient liquidity to fund our operations and will likely involve two pieces, pieces being a term note and an asset based credit facility supported by primarily inventory and receivables. And we're expecting the total facility to be somewhere in the range of $190 million to $200 million of availability.\n\nPete, this ends my prepared remark.\n\nPete Gundermann -- President and Chief Executive Officer\n\nOK. I think we'll open it up for questions now.\n\nOperator\n\nThank you. At this time, we'll be conducting a question-and-answer session. [Operator instructions]. Our first question comes from Jon Tanwanteng with CJS Securities.\n\nPlease proceed with your question.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nHey, good morning guys. Thank you for taking my questions. First one is, Pete, did you have a specific component or pieces of supply chain that's been giving you the difficulty that's reducing the top end? Could you call out what that is?\n\nPete Gundermann -- President and Chief Executive Officer\n\nI don't know if I have specific components that have caused us. It's more a general trend and you try to ratio it. We certainly have the work to do the- even go beyond our original range, but we're observing that you just have these consistent and regular supply chain snap foods that bring you down at a certain rate. And so we're thinking about that.\n\nRevised range is more realistic given that we're halfway through the year now. But pretty much everything we make involves electronic components and quite a bit of it. We have some products that don't use so much, primarily on the lighting side of our business, but it's the electronic components that are causing us the most trouble, but it's not limited to that. I mean, raw plastics paints, basic hardware, it's really like I just said, it's a whack-a-mole effort.\n\nI think we're getting pretty good at dealing with it, but that doesn't mean that we're overcoming it. We're just surviving with it. So like I said, some of our operations report that things might be getting a little bit of better, others don't feel that way, but nobody's saying it's getting a whole lot worse. So that's actually good news compared to where we've been in previous quarters.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nGot it. And then, can you just talk a little bit more about these three projects or these contracts that you signed? The Southwest one especially sounds pretty interesting. Can you talk about the revenues that might be associated with each one of these and the scale in the coming year or two?\n\nPete Gundermann -- President and Chief Executive Officer\n\nSure. Timing's a little bit of a question mark, actually on all three of them. As opening statement though, let me say this. The pandemic's been horrific.\n\nObviously, being focused and concentrated on commercial transport, aircraft, like we were, is a bad place to be when a pandemic grounds the airlines around the world. So that's obvious. We just don't have the military diversification or defense diversification that a lot of other companies did. We were much more concentrated.\n\nSo that being said, two years later as I look at the way the industry's coming back and I look at the way we're positioned, we're not implementing any major changes to our product line strategy or to our approach to the market. We were pretty happy with how we were situated up until the moment the pandemic struck. And now that it's coming back, we continued to feel pretty good about the product lines that we have, the customer relationships we have. And there's a lot of enthusiasm kind of in our corner of the world across the industry.\n\nAnd these three programs, I think demonstrate that to a large extent. The Southwest one, this was specifically for the Max fleet, obviously a narrow body airplane. Narrow body in-seat power is typically somewhere in the range of a $100,000 per ship, something like that. And we've come out with a new architecture.\n\nWe've been talking to Southwest for years. We came out with a new architecture and they're kind of a launch customers. It's USB only type C and type A, but it's a very lightweight system that really got them interested and excited. And we think it's going to play out positively in other narrow body operators around the world.\n\nBefore the pandemic, our feeling was that in-seat power is going to become more and more ubiquitous, more and more in demand. And three years later, we still feel that way. Narrow bodies had a much lower penetration rate. We think sooner or later, they're going to be as a common- installations on narrow body aircraft are going to be as common as they are on widebody aircraft today.\n\nSo that's a positive program. It's only for the Max fleet at Southwest. Southwest also runs a  bunch of NGs. And a question you might ask is, will they extend this program to those NGs and some of them, we think they might, as they plan to operate them for a while, but as of today, it's only for the Max aircraft.\n\nThe second one is with the Safran program for -- the idea here is to make antenna satellite communication capability line fit offerable on aircraft, as they're being built that can be kind of generically moved from one content provider to another, or operate within different networks. And that's a little bit of a change in approach to how the industry typically works. Typically, it's an aftermarket choice that the airlines make where they pick a provider and they get a hardware suite that is specific to that content provider to that constellation, and that hardware doesn't work really with any other constellation. The idea here is to separate it a little bit, put an antenna system on an airplane that airlines can use on multiple networks or change from one network to another over time, if they feel so inclined.\n\nAnd it's going to start off with Airbus airplanes, like I talked about. It's going to be line fit. That's the goal, and it'll move more broadly to other aircraft types and retrofit opportunities, as time goes on. It's a little bit unclear what the take rate's going to be.\n\nThis is something we're going to have to keep our eye on, but we announced it with Safran at a major trade show in Germany in June, and the initial reaction from airlines who were also at that show was very positive. So we're pretty excited about that. And then the third one is the eVTOL with Lilium. I could talk about this one forever.\n\nI think it's pretty exciting. And those who are interested in the electric space, I think should find it exciting. I mean, our hardware, our capability is very much in demand in that space. I expect that we may not always have the whole system design like we do at Lilium, but we're going to have a series of announcements.\n\nI think we're going to be flying on a bunch of aircraft over the next year or so. And so stay tuned. We will announce those as we can. Again, reasonable people can differ.\n\nSome people are very pessimistic about the possibility of the electric space really becoming something significant in the near term. Other people think it's a real strong solution for urban congestion and noise. And it's a much greener way to travel. So there are some very lofty volume predictions out there.\n\nWe're not necessarily committed to those, but they do exist. So the way we're approaching this industry is we are funding the development work that's necessary for our system architecture. So we stay in control of our product capabilities and we can mix and match. We're developing a whole suite of capabilities that are applicable to these aircraft.\n\nBut we are expecting customers to pay for development efforts that are unique or specific to their aircraft where we wouldn't do it except for their aircraft being on our project list. So it's a little bit of a shared cost. At this point, with Lilium, most of the costs that are basic to our architecture have already been incurred and the effort going forward will largely be funded. We're not allowed to describe what that is at this point, but it shouldn't be a major drain on our margins from this point going forward.\n\nAnd I think that's enough on those three. OK.\n\nOperator\n\n[Operator instructions]. Our next question comes from Michael Ciarmoli with Truist Securities. Please proceed with your question.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nHey, good morning, guys. Thanks for taking the questions. Pete, maybe just to stay on Lilium, you're probably not going to like this question, but maybe some of us remember Eclipse. I mean, it's certainly a very crowded space right now.\n\nIt sounds like you're doing some fun to development, but you can port this system to other potential operators out there. I guess when should we expect to see a ramp-up in revenue specifically tied to Lilium or any of the other?\n\nPete Gundermann -- President and Chief Executive Officer\n\nI think again, nobody knows how this whole thing's going to shake out. There are a lot of different contenders like you've said, and there are some real differences in architecture in terms of the kind of aircraft that these companies are trying to develop. And I think it's safe to say it's unclear if everybody's going to win and if not, who's going to be the winners, who's going to be the losers. It's just too early to tell.\n\nBut what we do think is that now is the time to be involved, if you want to be involved. It's going to be hard to jump in later once these development efforts are well underway and certification is proceeding. At that point, it's going to be too late to get in. So what we are endeavoring to do is to play a role in the electrical systems and some of the other product lines that we have may also come into play like lighting and again, be reasonable with our funded development or our internally funded development so that we stay in control of our technology.\n\nBut we don't want to get too far over our skis in terms of investing in specific program requirements that various aircraft may require or customers may desire. So we're going to balance that going forward, where they pay for the customization and we pay for the basic system architecture and development. We think that's a reasonable, balanced  position to take, as most of these companies are seeking certifications sometime in the 2024, 2025 timeframe. That means the systems are going to have to be nailed down and largely developed over the next year and a half, two years at most.\n\nAnd that's what we are preparing for and gearing ourselves for.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nOK. And then just back to the second half, I guess, looking at the guidance, looking at the step-up sequentially, I mean, do you guys think you can- with the higher costs right now, do you think you can be operating income positive? And do you think you can generate cash flow in second half?\n\nDave Burney -- Chief Financial Officer\n\nSorry, Mike. Yes, for sure. Our GAAP break even point is right around 160 million to 165 million per quarter in sales. So if you look at our adjusted EBITDA calculation in in the press release, at $129 million in sales, we're right at about an adjusted EBITDA breakeven point here.\n\nOur capex requirements, while we are estimating them at $9 million or $10 million, I think they may come in a bit lower than that for the quarter, but that's where we're estimating now. So I think when we get up to north of $160 million, $165 million per quarter in sales, we start to generate positive cash flow, assuming we can keep our working capital in check. And as I mentioned earlier, the supply chain is the challenge there. Our receivables are in good shape.\n\nBut you buy all the stuff you need to deliver on an order and you're missing a $20 component and you have a million dollars worth of stuff sitting on the shelf that you don't ship until you get that last piece in. So that's part of the challenge there in terms of managing inventory, but we're getting better at doing it, but again, part of that ramp-up in working capital and inventory relates to the sales growth we're expecting. We're not expecting to continue growing our inventory at the level you saw in the second quarter.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nOK. And then last one, just, can you maybe elaborate on the new credit facilities, the term and the asset based facility? I mean, the market clearly moving against and depending on when you close this, the spread might get even higher. What should we be thinking for the increase in annual interest expense? I mean, I guess could probably figure it out on the term, but what else are you going to be paying for the asset based credit facility? I mean, I think you're running kind of maybe $6.5 million in annual interest right now.\n\nDave Burney -- Chief Financial Officer\n\nYes. So we don't have the details finalized to that point yet, but both pieces are going to be SOFR based. We're expecting SOFR to get up to between three and three and a half, maybe over the next six months. And then on top of that, there'll be the spread.\n\nSo the spread's going to be determined based on the ABL, it'll be based on some type of measurement of leverage. Still working through the details of that. And then on the term note, it'll most likely be a SOFR spread on that and details to be determined there. I can't give you how much because we're not there yet, but it will be an increase over what our interest experience has been [Inaudible] this year.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nOK. And then just the last one. As you guys are defining leverage with your lenders, what's the trailing 12-month number you guys are using now? Because, I mean, if we just look at the kind of reported adjusted EBITDA, only about $3 million on a trailing 12 months. So what kind of leverage ratio are you guys currently sitting at today for your sort of facility-- \n\nDave Burney -- Chief Financial Officer\n\nYes. Based on the calculation and the revolving credit agreement, we're a little over four at the end of the second quarter. We're projecting that to drop.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nOK. Perfect. All right. Thanks, guys.\n\nOperator\n\nOur next question is from Jon Tanwanteng with CJS Securities. Please proceed with your question.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nAll right. Thanks for the follow-up. Pete, what's the update on the FLRAA and FARA programs?\n\nPete Gundermann -- President and Chief Executive Officer\n\nOn the FARA program? Is that what you are asking?\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nYes.\n\nPete Gundermann -- President and Chief Executive Officer\n\nOK. Well, the FLRAA program has been , delayed a little bit. I think award is now expected in the mid-October, late October timeframe, which is a slide of about two months from what the army was saying before. As a reminder, we are very heavily on the Textron team, the Bell team, and that award, if it goes to Bell, will be a very significant game changer for us.\n\nWe are much less involved on the Sikorsky or Lockheed team. So if it goes that direction, that would be a negative thing for us, although we have some opportunities there that would play out subsequent to award. The FARA program has been pushed off more substantially, and I don't have a date for you exactly. I think that's been pushed off like another year or year and a half.\n\nSo it's probably in the 2024-2025 timeframe for down select. So FLRAA is the big deal, and probably, hopefully before we talk again, that'll be decided. We're firmly in the Bell camp at this point. So that would be good for our company.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nGot it. Thanks Pete. What's going on in the test business? What's your outlook there and kind of are the programs that you expected [Inaudible]?\n\nPete Gundermann -- President and Chief Executive Officer\n\nThat's been a bit of a sore spot. The order rate for our test business has been slow, kind of keeping up with shipments, but we're not seeing the growth that we thought. There are a couple of substantial radio test programs, one that we thought was going to be awarded in June, one that we thought was going to be awarded in October or so. And both of those have slid.\n\nWe think the one from June will be awarded yet this month. That's the latest we've been told. And the one that we thought was going to happen kind of at the end of the government operating year is going to slide into the beginning of the next calendar year. That's what we understand.\n\nSo we haven't lost those programs, but the award date keeps sliding. It seems like that's the theme these days. And the other major pursuits generally are along the lines of our transit business, our train test and subway test business. And those also have moved a little bit.\n\nI think it's somewhat situational, but in general COVID and work from home and budget pressures have slowed down that process. We still have a very long target list. In fact, nothing's come off the target list. It's just that things that we thought were going to get awarded midyear now are a little bit less definite.\n\nSo we're continuing to push it. We obviously need to get bookings there to see some growth in that business in 2023. So we're doing what we can to push bookings in the second half of this year, and hopefully they come in. If not, we'll have to adjust as always, but we're still pretty optimistic long term, just seeing short term delays.\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nGot it. Thanks, Pete.\n\nOperator\n\nOur next question is from Michael Ciarmoli with Truist Securities. Please proceed with your question.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nHey, guys. Thanks for taking the follow-up. Just on the ramp into the second half, obviously supply chain issues. I guess your, your supply chain challenges getting components, was that sort of the biggest driver, or are you looking at kind of a  slower rate here with the Max, with the A320, the 787 restart? Have those kind of factored into taking the top end of the guidance down? Just trying to understand kind of more of the moving pieces around what's really impacting the ramp and how sensitive you are to some of these production rates and deliveries?\n\nPete Gundermann -- President and Chief Executive Officer\n\nNo, it's really just supply chain, Michael. Book to bill is great and our backlog is great. Yeah, there's some puts and takes with rate on some major programs, but the real big deal is customers want products. And the question is when can we get material to support those orders? And that big ramp is something that we have anticipated for many, many months.\n\nWhen lead times for a lot of commodities went way out, when we started getting strong orders over the last year, we had to schedule accordingly and the way the calendar fell, it disproportionately fell on the second half of 2022. So we went into the year with an internal plan that was well above the range that we guided to 550 to 600. As we've moved through the year and as we've experienced supply chains struggles, it really comes down to a probability weighted expectation going forward about how those troubles are going to continue. It's not any kind lessening of demand from customers.\n\nIt's not a reduction in rates on major programs. Those are all kind of going in the right direction. It's really an issue of how is our supply chain going to respond? We're kind of in a unique position of a major ramp in a really tough macroeconomic environments. So there are things that could go wrong, and I think I mentioned that we went into the second quarter thinking that internally we should be somewhere in $135 million range.\n\nThat was our perspective going into the quarter. We ended up at $129 million. If you run those numbers over six months, you responsibly come down from $600 million to $580 million on the high end. So that's what our thinking was.\n\nCertainly, it's not a reduction in demand from customers.\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nGot it. OK. Thanks, guys.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I'd now like to turn a call back over to management for closing comments.\n\nPete Gundermann -- President and Chief Executive Officer\n\nThank you for your time today. We're looking forward to an interesting and exciting second half of 2022, which we hope will set us up well for 2023. Thanks for your interest in Astronics, and have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCraig Mychajluk -- Investor Relations\n\nPete Gundermann -- President and Chief Executive Officer\n\nDave Burney -- Chief Financial Officer\n\nJon Tanwanteng -- CJS Securities -- Analyst\n\nMichael Ciarmoli -- Truist Securities -- Analyst\n\nMore ATRO analysis\n\nAll earnings call transcripts"
}