{
  "companyName": "Golub Capital BDC",
  "companyTicker": "GBDC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/golub-capital-bdc-gbdc-q3-2022-earnings-call-trans/",
  "content": "Golub Capital BDC (GBDC -0.68%)\nQ3 2022 Earnings Call\nAug 11, 2022, 10:00 a.m. ET\n\nJon Simmons\n\nHello everyone and welcome to GBDC's June 30, 2022 quarterly earnings call. Before we begin, I'd like to take a moment to remind our listeners that remarks made during this call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Statements other than statements of historical facts made during this call may constitute forward-looking statements and are not guarantees of future performance or results and involve a number of risks and uncertainties. Actual results may differ materially from those in the forward-looking statements as a result of a number of factors, including those described from time-to-time in GBDC's SEC filings.\n\nFor materials we intend to refer to on today's earnings call, please visit the Investor Resources tab on the home page of our website, which is www.golubcapitalbdc.com and click on the Events Presentations link. Our earnings release is also available on our website in the Investor Resources section. As a reminder, this call is being recorded. With that, I'm pleased to turn the call over to David Golub, CEO of GBDC.\n\nDavid?\n\nDavid Golub -- Chief Executive Officer\n\nThanks, Jon. Hello everybody, and thanks for joining us today. I'm joined by Chris Ericson, our chief financial officer; Gregory Robbins, senior managing director; and Jon Simmons, managing director at Golub Capital. Yesterday, we issued our earnings press release for the quarter ended June 30, and we posted an earnings presentation on our website.\n\nWe'll be referring to this presentation through the call today. For those of you who are new to GBDC, our investment strategy is and since inception it has been to focus on providing first lien senior secured loans to healthy resilient middle-market companies that are backed by strong partnership-oriented private equity sponsors. Let me start with the headline for this quarter. The headline is that GBDC's results were fundamentally solid, despite a major downdraft in credit and equity markets and despite a volatile and uncertain economic environment.\n\nGBDC's borrowers continue to perform well, realized losses remain low, and net investment income stayed strong. While unrealized losses, primarily due to spread widening, did impact results, we believe these unrealized losses are in general not due to fundamental credit issues and that they're likely to reverse over time. We remain focused as usual on minimizing realized credit losses. For the quarter ended June 30, adjusted NII was $0.34, adjusted net realized and unrealized loss per share was $0.25 and adjusted EPS was $0.09.\n\nDuring the quarter, GBDC made a quarterly distribution of $0.30 per share and ending NAV was $15.14 per share, a decline of 1.4% quarter over quarter. For comparison, the leveraged loan index declined 4.5% in Q2, the high yield index declined 9.8% and the S&P 500 declined 16.1%. We believe the relatively modest decline in GBDC's NAV reflects the resilience of our investment strategy. And importantly, we expect the decline in NAV to reverse in future quarters.\n\nNow I'll hand the floor to Gregory, Jon, and Chris to elaborate on GBDC's performance for the quarter ended June 30. And after that, I'll provide some commentary on the investment environment and what we see coming from here. Then I'll open the line for questions. Gregory, over to you.\n\nGregory Robbins -- Senior Managing Director\n\nThank you, David. I'm going to begin on Slide 6, which highlights several key themes that played out in the quarter ended June 30 and how they specifically relate to GBDC. The first theme is strong portfolio performance. Despite the downdraft in equity and credit markets and the slowdown in the US economy generally, Golub Capital portfolio companies continued to perform well.\n\nThis is reflected in the strong credit results of our borrowers, including stable internal performance ratings, low non-accruals, and low net realized losses. We'll take a closer look at the data later in this presentation. The second theme is rising base rates. Short-term interest rates increased meaningfully during the quarter as the U.S.\n\nFederal Reserve looked to address high inflation. GBDC will be able to take advantage of the higher interest rate environment and got some benefit in the quarter. Nearly all of GBDC's investments are floating rate, while only about 25% of its funding sources are floating rate. Bear in mind that base rates for different loans reset with a lag, so we haven't yet seen the full benefit of higher base rates across the portfolio.\n\nWe believe GBDC will continue to benefit as higher base rates are fully realized in future quarters. The third theme is unrealized losses. Market uncertainty and higher interest rates caused credit spreads to widen across nearly all classes of credit. This resulted in net unrealized losses for GBDC.\n\nAnd I want to emphasize the word unrealized. As David mentioned earlier, we believe fundamental credit issues remain rare and that these unrealized losses will likely reverse over time. Lastly, Golub Capital's origination was solid and consistent with our activity in the second calendar quarter of 2021. We continue to benefit from our strong sponsor relationships and incumbencies.\n\nRoughly 90% of our originations in Q2 was with repeat sponsors and over 50% was with repeat borrowers. Moving on to Slide 7. This slide provides a bridge from GBDC's $15.35 NAV per share as of 3/31 to its decreased $15.14 NAV per share as of 6/30. Let's walk through the bridge.\n\nAdjusted NII per share was $0.34. Dividends per share paid during the quarter were $0.30 and adjusted net realized and unrealized losses per share were $0.25. We have spoken about this in the past, but we are firm believers that Golub Capital should be strongly aligned with GBDC's stockholders. We have created this alignment in multiple ways.\n\nFirst, through our fee structure, which has both the highest incentive fee hurdle rate in the industry and a since inception cumulative lookback on our incentive fee. We're only one of a limited number of BDCs to have this type of a lifetime lookback. Second, we have also sought to maintain strong insider ownership of GBDC stock. On this last point, I want to mention that during the three months ended June 30, the Golub Capital Employee Grant Program Rabbi Trust purchased approximately $11.5 million, or over 800,000 shares of our common stock for the purpose of awarding incentive compensation to employees of Golub Capital.\n\nThrough the first two calendar quarters of 2022, the trust purchased $23.2 million, or over 1.6 million shares of our common stock. With that, let me hand the call over to Jon Simmons to walk you through the results in more detail. Jon?\n\nJon Simmons\n\nThanks, Gregory. Slide 9 summarizes our results for the June 30 quarter, which are shown in the column on the far right, as well as over the last several quarters. Moving to Slide 10. New investment commitments totaled $449.6 million for the quarter.\n\nAfter factoring in total exits and sales of investments of $171.2 million, as well as net changes in fair value and other portfolio activity, total investments at fair value increased by 3.5% or $187.4 million during the quarter. Also, as of June 30th, we had $42.9 million of undrawn revolver commitments and $225.7 million of undrawn commitments on delayed draw term loans. Each of these unfunded commitments are relatively small in the context of GBDC's balance sheet and liquidity position. The table at the bottom of the slide shows that the weighted average rate on new investments increased meaningfully quarter over quarter, due to rising base rates, while the spread over the applicable base rates on new investments remained consistent.\n\nSlide 11 shows that GBDC's overall portfolio mix by investment type remained consistent quarter over quarter, with one-stop loans continuing to represent over 80% of the portfolio at fair value. Slide 12 shows that GBDC's portfolio remained highly diversified by obligor with an average investment size of approximately 30 basis points. As of June 30th, 94% of our investment portfolio was comprised of first lien, senior secured floating rate loans and defensively positioned in what we believe to be resilient industries. Turning to Slide 13.\n\nThis graph summarizes trends in our portfolio yields and net investment spreads. Focusing first on the light blue line, this line represents the income yield, or the actual amount earned on our investments, including interest and fee income, but excluding the amortization of upfront origination fees and purchase price premium. The income yield increased by 20 basis points to 7.1% for the quarter ended June 30th. The investment income yield, or the dark blue line, which includes the amortization of fees and discounts, also increased by 20 basis points to 7.5% during the quarter.\n\nDuring the quarter ended June 30th, repayments increased from an unusually low level in the prior quarter, which resulted in an increase in fee income and amortization of origination fees. Our weighted average cost of debt, which is the aqua blue line, increased by 20 basis points to 3%. And our net investment spread, the green line, which is the difference between the investment income yield and the weighted average cost of debt, remained flat at 4.5% as the majority of our investment portfolio have base rate contracts that reset during the last month of the quarter. So as a result of that, we expect the continued rise in base rates will be a positive for GBDC's portfolio yield starting next quarter.\n\nWith that, I'll hand the call over to Chris to continue the discussion of our quarterly results. Chris?\n\nChris Ericson -- Chief Financial Officer\n\nThanks, Jon. Flipping to the next two slides. Non-accrual investments as a percentage of total debt investments at cost and fair value stayed consistent at 1.5% and 1.1%, respectively, as of June 30th. There were eight non-accrual investments at quarter end, one of which was repaid with a full recovery of par subsequent to quarter end.\n\nOverall, fundamental credit quality remained strong and stable with over 90% of the investments in our portfolio having an internal performance rating of four or higher as of June 30. As a reminder, independent valuation firms value at least 25% of our investments each quarter. Slides 16 and 17 provide further details on our balance sheet and income statement as of and for the three months ended June 30th. Turning to Slide 18.\n\nThe graph on the top summarizes our quarterly returns on equity over the past five years, and the graph on the bottom summarizes our regular quarterly distributions, as well as our special distributions over the same time frame. Turning to Slide 19. This graph illustrates our long history of strong shareholder returns since our IPO. As illustrated, investors of GBDC's 2010 IPO have achieved a 9.9% IRR on NAV since inception.\n\nSlide 20 summarizes our liquidity and investment capacity as of June 30th, which remained strong with over $700 million of capital available through cash, restricted cash, and availability in our various credit facilities. Slide 21 summarizes the terms of our debt facilities as of June 30th. Slide 22 summarizes our recent distributions to stockholders. Most recently, our board declared a quarterly distribution of $0.30 per share payable on September 29, 2022 to stockholders of record as of September 2, 2022.\n\nAnd with that, I will turn it over to David for some closing remarks. David?\n\nDavid Golub -- Chief Executive Officer\n\nThanks, Chris. To wrap up, we believe GBDC demonstrated its resiliency this quarter. Our portfolio companies continued to perform well, realized losses were low and while we saw some unrealized losses, they were generally the results of marketwide spread widening and not from fundamental credit deterioration. Let's talk briefly about our outlook before I open the line for questions.\n\nThe headline is we're in confusing times, and this is exactly the kind of environment where GBDC is poised to outperform. Let me start with why I think we're in confusing times. There are an unusual number of powerful vectors right now affecting the economy. Many of them don't have precedent and they're occurring at the same time and pushing in different directions.\n\nLet's start by looking at what I call the bad vectors. We're experiencing high inflation, rising interest rates, quantitative tightening and declining fiscal stimulus. At the same time, there are also some powerful positive forces: very low unemployment, healthy consumer balance sheets, momentum from a sustained period of high revenue and profit growth, and in most sectors, low durable goods inventories, thank you supply chain problems. So where are we going from here? Some people sound confident, but I think the intellectually honest answer is, we don't know.\n\nThe truth is there's no historical period that we can cite as a good parallel to what we're experiencing right now. And the collection of characteristics that I just went through, they don't look reminiscent of a traditional economic downturn or the precursors of a traditional economic downturn. So with this context, we think the prudent approach is to prepare for a variety of potential scenarios and to seek investment strategies that can be resilient across a wide range of them. I want to elaborate on some of the key factors that we think make GBDC's strategy resilient.\n\nIf inflation remains elevated, we think the impact of inflation on GBDC's portfolio is going to be muted. We focus on lending to market leaders in resilient industries that have strong competitive advantages and limited substitutes. In other words, the companies that we lend to typically have pricing power that enables them to pass higher costs through to their customers. If interest rates continue to rise, GBDC stands to benefit given its asset sensitive balance sheet.\n\nNearly all of GBDC's investments are floating rate, while roughly three-quarters of its funding sources are equity or low-cost fixed rate debt. As interest rates for our borrowers reset at prevailing base rates, we think GBDC will capture more and more benefits of higher short-term rates. At the same time, GBDC's portfolio companies can generally bear higher interest expense without much impact on default rates. If there's a sustained economic slowdown or even a recession, GBDC's portfolio is positioned conservatively.\n\nThe portfolio is predominantly first lien, first-out floating rate senior secured bonds to companies in resilient industries with minimal exposure to cyclical industries like energy or real estate. In fact, a muddling economy is fine for our strategy; our borrowers don't need rapid growth to be able to pay us back. We've focused so far on GBDC's resilience to the risks and uncertainties in today's environment. But there's an important positive side of the story.\n\nThese same risks and uncertainties create opportunities. I want to highlight three of those opportunities. First, as investors look for safety amid the uncertain environment, the odds are that the BSL and high yield markets are going to remain volatile. This makes the reliability and the simplicity of Golub Capital's financing solutions particularly valuable to sponsors.\n\nSecond, the environment has improved market conditions for direct lenders. Our world has gotten more lender-friendly. We've been pleased in recent weeks to see spreads, terms, and leverage getting more favorable across our sponsor finance business from the small end to larger end. Finally, our incumbencies are particularly valuable in this environment.\n\nIn our experience, market volatility tends to drive M&A activity from new deals, from new logos to add-ons. We love doing add-ons for borrowers that we know well and that we're in the pole position to win incremental business from. In short, we're cautiously optimistic about GBDC's prospects in this uncertain environment. We see a lot of opportunity going forward and GBDC's conservative portfolio and rock-solid balance sheet should enable the company to play offense during this coming period.\n\nWith that, operator, please open the line for questions.\n\nOperator\n\n[Operator instructions] Your first question is from Finian O'Shea of Wells Fargo Securities. Please go ahead. Your line is open.\n\nFinian O'Shea -- Well Fargo Securities -- Analyst\n\nHi, everyone. Good morning. First question on -- looking at origination, it was strong this quarter. It sounds like the outlook is good.\n\nBut of course, the credit look back takes down, what would be your incentive fee, sort of a modeling question here really. Are you effectively approaching or above your high hurdle seeing what to model there? And if so, what would we expect for perhaps supplemental dividends, retained earnings or whatnot. It's just sort of a two-part question, so I'll stop there.\n\nDavid Golub -- Chief Executive Officer\n\nSure. So as we look, Fin, at the future, there are a number of elements that point to higher earnings. We talked about several of these in our prepared remarks. One is higher base rates.\n\nAnd I think Jon and Gregory both made this point in their remarks, I think it's important enough to reiterate, the calendar Q2 results that we just discussed don't really reflect the full benefit or even most of the benefit of higher base rates, because our borrowers generally did not see resets in their loans until either late in the quarter or perhaps not even at the time of the end of the quarter. So we think we're going to see meaningful improvement in net investment income in the coming quarters as a consequence of the lag effect of increases in base rates that have already taken place, and then there are further increases that are embedded in the forward curve. Second element which is important relates to, let's flip to Page 13 of the presentation. If you think about what's going to happen to the teal line with the triangles, which is our weighted average cost of debt, it's going to move up meaningfully more slowly than the income yield line because 46% of our debt is fixed rate and has an average cost of about 2.8%.\n\nI think that's either the lowest or among the lowest in the BDC industry. So we have one benefit. Our assets are going to be generating more interest income. We have a second benefit.\n\nOur liability structure is asset sensitive. It has a very significant fixed rate component to it. A third tailwind is that spreads are improving. Now this doesn't impact results right away.\n\nIt doesn't impact it in one quarter or even two quarters because you need time for the portfolio to turn over. But we are seeing a more lender-friendly environment right now. And as a consequence, we're seeing higher spreads on many of the new loans that we're making. I'd also add a bit of a caution on this, in that while I anticipate new originations going to be OK in the coming period, we are seeing a more generalized slowdown in deal activity in Q3 and my expectation is that's going to continue into Q4 as a result of the decline in equity markets and the more challenging debt environment for new deals.\n\nSo I think there are a number of sources of improvement in earnings power that all play a role here. I'm not prepared to give you guidance right now on where I think this is going to shake out, but I think the direction is clearly improving.\n\nFinian O'Shea -- Well Fargo Securities -- Analyst\n\nYeah. That's helpful. And I did miss the interest rate part in there so that's helpful as well. I guess a second question, I'll admit you, David, I've – this is a bit – the question for me is tiring a little bit.\n\nI've asked for a few quarters on the technology topic in the Golub Altman Index you put out, it is showing slower revenue and earnings. Revenue is still very good, earnings still positive, but seeing a slower trend there. At any high level you can give on the tech side of the portfolio if they're facing headwinds or this was anticipated in underwriting?\n\nDavid Golub -- Chief Executive Officer\n\nSo sure. By way of context again, those who may not be so familiar with it, Golub Capital publishes on a quarterly basis in an index called the Golub Capital Altman Index that details the median company in our portfolios growth in revenues and in EBITDA, and it also provides a breakout by sector. And what Fin is referencing is if you look at the Golub Capital Altman Middle Market Index over recent quarters, the most recent quarter showed sustained good solid growth across the portfolio in revenues, but slower growth in EBITDA, reflecting some margin compression that I think is largely attributable to inflation. And if you look specifically at the technology sector, you see a rate of revenue growth, while still double digit, while still attractive, it's lower than it's been in prior quarters.\n\nAnd we are starting to see the same margin compression, the same slower EBITDA growth in technology that we've seen in other sectors. I think this is broadly reflective of market conditions generally. I think our technology portfolio remains very strong from a credit perspective, and we remain very confident and comfortable with our technology exposures. I do think there is a market change, Fin, more in spaces within technology that we're not players.\n\nSo spaces in technology like streaming services and consumer-oriented web platforms have seen very significant slowdowns in demand and in the public markets, very sharp decreases in equity prices. Those are not sectors that we play in. We are very focused on backing companies in the sector that are mission-critical business-to-business software providers. And what we're seeing is continued resilient demand for the products and services of these companies.\n\nOne reason, I think, is that as all companies are looking to become more efficient to keep costs under control in the inflationary environment, labor-reducing software products are actually a very compelling part of that solution. So I remain quite optimistic about our software portfolio. We're not seeing additions to watch list and to our non-accrual assets from that sector, and I don't expect to.\n\nFinian O'Shea -- Well Fargo Securities -- Analyst\n\nThank you again. Just one small bonus question looking at my notes here. Chris mentioned, I think a post-quarter repay, was that part of a non-accrual or underperforming, or can you remind us of that, Chris, the context in which you mentioned the post-quarter repay?\n\nDavid Golub -- Chief Executive Officer\n\nSure. If you flip to the page that -- details are non-accruals, which is on Page 14. We had at quarter end, $60.2 million at fair value of non-accrual investments. That included a $3.9 million position in a company called Paradigm, which paid off in full shortly after quarter end.\n\nThis is actually a great Golub Capital story. We made this loan a number of years ago. It underperformed. We ultimately reached an agreement with the sponsor to take control over the company and worked with new management, new Board to improve the company's operations and recently, the company went through a sale process and was purchased by a strategic competitor.\n\nI think it's very reflective of our skills and talents in managing workout credits that we were able to get a very good outcome here.\n\nFinian O'Shea -- Well Fargo Securities -- Analyst\n\nVery good. Thank you so much.\n\nOperator\n\nYour next question is from Paul Johnson of KBW. Please go ahead. Your line is open.\n\nPaul Johnson -- KBW -- Analyst\n\nGood morning. Thanks for taking my questions. One of my questions actually answered from one of Fin's questions. But just wondering, as you mentioned that your pipeline has kind of slowed here in recent quarters, but here more recently in the last few weeks or so, we've seen significant turn in sentiment in the equity markets and perhaps avoiding the works of a recession or correctly discounting a mild recession.\n\nBut how quickly does that type of turn and interest usually do you find kind of take to see back into, I guess, the middle market sponsors and the sentiment that you find them on the sponsors that you work with?\n\nDavid Golub -- Chief Executive Officer\n\nYes. It's a great question. If you look at Q2, overall deal volume in the industry was down in Q2. Our origination in Golub Capital was actually up year over year.\n\nAnd the second quarter of 2021 was a record quarter for us. So it was quite a strong quarter, the second calendar quarter of 2022. As I look forward into the current quarter and the rest of the year, I do think we're currently being impacted by the market downdraft that we saw in both equity and credit markets in the late part of calendar Q2. And I think, even with the sentiment shift that you're quite correctly pointing out that we've seen over the last couple of weeks, I think we're still seeing relatively slow new deal volume.\n\nWe'll be fine at Golub Capital during this period. We have an enormous proportion of our new originations in any quarter coming from add-ons. It's been running 50% to 60% for the last almost 10 years. So we're well positioned for an environment like this.\n\nI think firms that are more focused and more dependent on new are going to be more impacted by this. When will that new deal environment start to strengthen? I think that's a great question and it's really hard to say. Clearly, the recent improvement in sentiment is a help. But it's August right now, that tends to be a seasonal low.\n\nCredit markets are still choppy, particularly the broadly syndicated and high yield markets. So I think it's reasonably likely that we're going to see continuing lower-than-normal deal activity into the fall.\n\nPaul Johnson -- KBW -- Analyst\n\nThanks for that, David. I appreciate that. That's a great answer. And I guess in addition to that, I mean, have you seen, particularly in this last quarter here in the second quarter, have you experienced any sort of benefit from, I guess, potentially broken bank deals or any sort of syndicated deal that just didn't quite work out at some point during the market volatility in the second quarter that you were able to potentially capitalize on?\n\nDavid Golub -- Chief Executive Officer\n\nIt's a great question. We're often asked what's the relationship between the middle market and the broadly syndicated loan market? And the answer is that while on the one hand, they're different markets, they're distinct markets. On the other hand, one's influenced by the other. And so if you look at what happened in calendar Q2, late in the quarter, we saw significant downward movement in broadly syndicated loan secondary prices.\n\nAnd we saw arrangers in the broadly syndicated market have more difficulties placing deals unless they increased spreads or increased OIDs. What happened is what typically happens. And what I mean by that is, in the immediate term, the direct lending market didn't move nearly as much. And there was a lag before you started to see spread widening and more favorable terms start to appear in direct lending deals.\n\nBut they did. They did start to appear. And they have continued to move in what I characterize as a lender-friendly direction as we push the calendar into calendar Q3. So, I think all of us in the direct lending industry have been beneficiaries of the moves in the market in the broadly syndicated space.\n\nAnd I think the relationship between the two will probably continue to be one where the direct lending space is insulated, but not immune from what's happening in the BSL market and what's happening in the BSL market tends to occur in the direct lending market with a lag.\n\nPaul Johnson -- KBW -- Analyst\n\nGot it. Appreciate it. Appreciate those answers. And thanks for taking my questions and congrats on a good quarter.\n\nDavid Golub -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question is from Robert Dodd of Raymond James. Please go ahead. Your line is now open.\n\nRobert Dodd -- Raymond James -- Analyst\n\nHi, David. Just really following on to that question, I mean to your point, David, in the prepared remarks, you've talked about spread widening, which is ongoing in the private credit markets. But now obviously -- and it tends to lag the BSL market. The BSL market the spreads are tightly trading spread origination still, as you say, choppy and soft.\n\nBut trading spreads seem to be tightening back up with half of the second quarter widening wide-cap so far, I think, in this quarter. So to your point, with the direct lending space, kind of, moves in the same direction of the BSL market with a lag. With your comment about spread widening and the benefit of that, I mean, do you think that's going to stick? Do you think direct lenders have seen the light a little bit or is it more just purely a lag? And as if the BSL market does tighten back up and get more active again, is the current spread widening environment just going back to light?\n\nDavid Golub -- Chief Executive Officer\n\nAgain, great question, Robert. And one -- well, I'm not sure, I can give you an answer to that I have a lot of confidence in. I think it depends on a lot of factors, including new inflation numbers that come out, including new indicators of how the economy is doing, including funds flows in the broadly syndicated market. So there are an enormous number of factors that I think are going to influence the answer to your question.\n\nWhat I can tell you right now is the market today feels meaningfully more lender-friendly than three months ago. And I don't see pressure right now that's pushing the pendulum back toward a more borrower-friendly environment. Factors that would cause that to happen would include continued improvement in economic data coming out and in sentiments.\n\nRobert Dodd -- Raymond James -- Analyst\n\nI appreciate your thoughts. I realize it a tough question. Let's just call it a tough question follow-up, if I can. On coming back to the Altman Index, I mean, technology is still growing, consumers still growing and maybe surprisingly still growing earnings in the second quarter, but healthcare did see a decline in EBITDA, not revenues.\n\nI mean is that – that's the second largest sector within your portfolio other than healthcare, and I think it's other than software and I think it's the biggest piece of software. Is there anything you can – any color you can give us on – I mean is that labor costs, or any color you can give us about what's going on in the healthcare market and why it's underperforming the other, the consumer Industrials and Technology segments in the Altman Index by a fairly material on that.\n\nDavid Golub -- Chief Executive Officer\n\nA couple of points I'd make. One, I think you're right that pressure on labor costs has been part of the reason for healthcare company margin compression. I think a second element is that, in many cases, healthcare companies need a bit more time to adjust their pricing and to have their new pricing reflecting inflationary pressures than companies in other sectors. So imagine, for example, that your reliance on contracts with insurance companies, those insurance company contracts don't get reset on a month-to-month basis.\n\nOr imagine that we're looking at services that are reimbursed under Medicare. Again, those are not rates that are reset on a monthly basis. So I think there are a large number of factors. I think in many cases, healthcare companies saw maybe unusually high margins in the immediate bounce back post-COVID period, and now we're seeing some normalization.\n\nBut I think the – probably, the most important factors relate to labor costs and lags in revenues adjusting to inflationary pressures.\n\nRobert Dodd -- Raymond James -- Analyst\n\nThank you. I appreciate that.\n\nOperator\n\nThere are no further questions at this time. I will now turn the call over to David Golub, for closing remarks.\n\nDavid Golub -- Chief Executive Officer\n\nSo thanks again for joining us today. I very much appreciate the opportunity to give you an update on the Golub Capital story. And as always, should you have any questions before we get together next quarter, please feel free to reach out to me or to Chris. We'd be happy to answer more questions.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJon Simmons\n\nDavid Golub -- Chief Executive Officer\n\nGregory Robbins -- Senior Managing Director\n\nChris Ericson -- Chief Financial Officer\n\nFinian O'Shea -- Well Fargo Securities -- Analyst\n\nPaul Johnson -- KBW -- Analyst\n\nRobert Dodd -- Raymond James -- Analyst\n\nMore GBDC analysis\n\nAll earnings call transcripts"
}