{
  "companyName": "Coinbase Global, Inc.",
  "companyTicker": "COIN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/coinbase-global-inc-coin-q2-2022-earnings-call-tra/",
  "content": "Coinbase Global, Inc. (COIN 1.75%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Sarah, and I will be your conference operator today. At this time, I would like to welcome everyone to the Coinbase second quarter 2022 earnings call. All lines have been placed on mute to prevent any background noise.\n\n[Operator instructions] Anil Gupta, vice president, investor relations, you may begin your conference.\n\nAnil Gupta -- Vice President, Investor Relations\n\nThank you. Good afternoon, and welcome to the Coinbase second quarter 2022 earnings call. Joining me on today's call are Brian Armstrong, co-founder and CEO; and Emilie Choi, president and COO; and Alesia Haas, CFO. I hope you've all had the opportunity to read our shareholder letter, which was published on our IR site earlier today.\n\nBefore we get started, I'd like to remind you that during today's call, we may make forward-looking statements. Actual results may vary materially from today's statements. Information concerning risks, uncertainties, and other factors that could cause these results to differ is included in our SEC filings. Our discussion today will include references to certain non-GAAP financial measures.\n\nReconciliations to the most directly comparable GAAP financial measures are provided in the shareholder letter on our IR website. Non-GAAP financial measures should be considered in addition to, not as a substitute for, GAAP measures. We are once again using the Say Technologies platform to enable our shareholders to post questions. And in addition, we will take some live questions from our research analysts.\n\nBefore that, I'll turn it over to Brian and Alesia for some opening comments. Brian?\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nThanks, Anil. All right. So, for the opening comments, I'd like to touch on three topics. The first is looking at crypto asset cycles broadly and where we are in this one.\n\nThe second topic is going to be about our product momentum and how we're winning in this environment. And the third is about the regulatory landscape. So, let's start by talking about these crypto asset price cycles. So, there's a phrase that we say often internally at Coinbase.\n\nIt's never as good as it seems, and it's never as bad as it seems. And we say that and we learn the truth of it every crypto cycle that we go through. We've actually -- this is probably our fourth crypto cycle that we've gone through. And they always seem a little bit scary, especially if people haven't gone through them before, and this is our first one as a public company.\n\nThere's lots of things like material Luna collapse, and there's contagion with things like Three Arrows and Voyager and Celsius, although none of these things had any impact on Coinbase. But we've seen this all before. And so, what do we do in down cycles at Coinbase? Well, first of all, we keep building. And so, in up cycles, it's -- we're usually growing, and we have to focus a lot on scaling.\n\nAnd so, in down cycles, it's actually kind of a breath of fresh air. We get to go back and focus on paying down tech debt, doing innovation in our products, growing our existing products. And so, it's been kind of nice to get back to that and keep focusing on building great products for customers. The other big thing we do is we focus on managing expenses closely to make sure that we can outlast any kind of down cycle.\n\nAnd we intentionally raised capital in 2021 to ensure that we had a really strong balance sheet going into this downturn, which has been great. We also historically have seen casual competitors take a step back in down markets, and that's been to our benefit over time. Sometimes, there's interesting M&A opportunities that arise and things like that. And then every prior cycle has landed higher than the previous one due to the innovations that got built during those downturns.\n\nAnd so, I think it's really important to kind of zoom out and look at the performance of Coinbase across these cycles. And so, one thing we put in the earnings letter was just looking back over the last two years, if you compare our results to Q2 of 2020, of course, we had COVID in there as well, but I think looking over crypto cycle is important. Our verified users have nearly tripled in that time frame. Our monthly transacting users have grown 6x.\n\nOur total quarterly trading volume has increased 8x. Our asset platform has increased nearly 4x. So, more than two-thirds of our MTUs are now engaging with multiple of our products. That number was just 20% two years ago.\n\nAnd our subscription and services revenue, which is more predictable, has contributed 18% to our total net revenue, which was only up 4% two years ago. So, you have to really remember that crypto is not linear. Any given quarter could be up or down or even any given year. But if you evaluate the business across price cycles, it tells a much different story.\n\nSo, that's a little bit about the price cycles. Let's jump to the second topic around our product momentum. So, Coinbase, in this period, is very focused on five product areas. The first one is our Coinbase retail app.\n\nThis is the one that accounts for the majority of those 100 million or so verified users, and it's a large revenue generator for us. The second is Coinbase Prime, which is our prime brokerage product, serving institutions around the world, which has ended up doing very well. The third one is our staking business, which has also grown into a great source of subscription and services revenue and is growing nicely. The fourth one is Coinbase Cloud, our products for developers, which we believe will be an awesome business over time, similar to AWS or something like that, helping the thousands of start-ups out there and actually not just start-ups, established companies integrate crypto into their product with our suite of APIs.\n\nAnd the fifth one, the last one we call broadly Web3, but this touches on a major future area of growth that we believe will materialize. And in products, we have there with Coinbase Wallet, our self-custodial app, various protocols that we're working on, and some things we'll touch on later. So, the goal of these products, of course, is to help 1 billion people access eventually the primary to access the open financial system and be the primary financial account for them. And we generally try to differentiate our products by making them the most trusted out there, the easiest to use, and building one integrated suite of products so that if you sign up for your one Coinbase account and verify your identity, you connect your information, your bank, your payment method, and your crypto, you can then switch over and easily access any of our products.\n\nSo, there's a nice integration there into the suite. We've had a number of really exciting product wins in the last quarter. You may have seen that we were selected by BlackRock and Meta as their partners as they develop their crypto offering. This is actually a really huge deal for a few reasons.\n\nBlackRock is the largest institutional asset manager in the world. It took several years of diligence to go through with them and close this deal. I think it really shows that Coinbase is situated uniquely to be the preferred partner to the largest companies in the world who want to integrate crypto into their offerings, which increasingly will be more and more of the Fortune 500, I believe, over time. And we're really the only reasonable choice for many of these companies as the most trusted platform and the first public company in crypto.\n\nSo, I think it shows that we can build not only a successful retail platform but also close deals with the largest companies in the world so we can win across multiple customer segments. Our self-custodial wallet also had a number of wins this past quarter. We've been getting rave reviews that people believe it's now the most advanced self-custodial crypto wallet in the market. And I think our pace of product launches has really been accelerating in this period.\n\nSo, lastly, I just want to touch on the regulatory environment. And I'll start with the recent SEC headlines, although we've been having great interactions with the CFTC and numerous regulators around the world. So, in May, the SEC sent us a voluntary request for information, including for information about our asset listings process. We do not yet know if this inquiry will become a formal investigation.\n\nAs with all regulators around the world, we're committed to a productive discussion with the SEC around digital assets and securities regulation. And if this inquiry is an opportunity for that discussion, we welcome it. Tuning out, we've been pleased to see the progress recently both in the U.S. and in countries around the world toward more clear legislation for crypto.\n\nIn the U.S., there are several bills making their way through Congress with strong bipartisan support. For instance, the Stabenow-Boozman bill proposes legislation that aims to provide clarity on the regulatory authority of crypto assets between the SEC and the CFTC and others where we frequently seem to get caught in the middle. We look forward to engaging with all relevant parties to develop common sense frameworks for regulation and oversight to help clarify what is a crypto commodity, what is a crypto security, what is a stablecoin, and what is something else entirely in the crypto ecosystem such as NFTs are probably considered artwork. The White House put out an executive order recently asking the various departments of government in the U.S.\n\nto work together on a comprehensive crypto legislation that preserve the innovation potential of this technology and that now seems to be happening. When I was in D.C. two weeks ago, several people told me that crypto is one of the few bipartisan issues in D.C. right now where they can actually get work done.\n\nAnd with some luck, we may see clear stable point legislation passed later this year and comprehensive legislation for crypto passed next year in the United States. Of course, Coinbase is a global company, and we're seeing similar moves toward regulatory clarity globally, including in the EU with the recent passage of the Markets in Crypto Assets, or MICA regulation. We're also seeing positive developments in Australia, the U.K., Hong Kong, Brazil, and other markets as well. So, it's sort of strange to say, but in some ways the most -- in some ways, the more regulation there is for crypto, the better it is for Coinbase.\n\nWe're the most trusted brand in crypto and have leaned into regulations since the early days of the Company. We are and will continue to be a champion for this industry, ensuring that any crypto legislation that passes preserves the innovation potential of this technology and at a minimum, treats it on a level playing field with traditional financial services. Therefore, we're more than happy to engage with any regulators around the world who will take time to meet with us. We don't see this as a bad thing.\n\nOn the contrary, we believe it's the best way to help the industry move forward. I don't have anything else I can say about the SEC information request in particular, but we plan to keep you updated on developments in the regulatory space broadly as we have more to share. So, just to wrap things up before I hand it over to Alesia, hopefully, the overarching message here is clear. We've been through many crypto cycles before.\n\nIt seems scary, but it's never a bad as it seems. It's never as good as it seems. Coinbase has succeeded over the last 10 years by continuing to focus on great product execution during down markets and managing expenses closely. We're a responsible company in the space with plenty of cash on the balance sheet, strong fundamentals, if you look over the last two years, and we're winning deals with the largest companies to integrate crypto into their offerings.\n\nWe're going to be here through the long term through the ups and downs of this industry. And with that, let me turn it over to Alesia to discuss Q2.\n\nAlesia Haas -- Chief Financial Officer\n\nThanks, Brian. I'm going to briefly recap Q2, share our areas of focus and strength as we adapt to these new market conditions, and then touch briefly on the outlook for the remainder of the year. First, to recap Q2, down markets create financial headwinds, which are reflected in our Q2 results. Our MTUs totaled 9 million.\n\nWe're pleased to see that decline was only 2% lower as compared to Q1. And we note 67% or 6 million MTUs were engaging with our noninvesting products. And so, we'll talk about that later, but we're definitely seeing a shift in behavior as MTUs are trading less but participating increasingly in staking and other noninvesting products. Our total trading volume was $217 billion and transaction revenue was $655 million, down 30% and 35%, respectively.\n\nBoth metrics were influenced by a shift in consumer behavior and market activity. This is very consistent with what we've seen in prior down markets that retail customers tend to shift from traders to huddlers. And market volume, in turn, then shifts to concentrate among market makers and pro-style traders. Much of that volume, the market makers, the pro-style traders takes place in offshore exchanges where financing and derivative products are more prevalent.\n\nOver time, we look forward to building products to better compete for this volume, but today, we are a heavily retail concentrated platform. Lastly, there was a spike of trading volume in May as investors traded around the Terra Luna collapse and subsequent credit events surrounding crypto insolvencies. We have not listed Luna, nor do we have exposure to these insolvencies and as a result, did not participate in this volume spike. Despite these headwinds, we're really happy to see the growth of our subscription and services revenues, which were $147 million as of Q2 and notably up 44% year over year.\n\nWe also have shared with you in the shareholder letter a way to look at our subscription and services revenue price adjusted, i.e., if you freeze price as of Q2 and look at that historic trend line, we're pleased to see pretty linear growth quarter over quarter as we continue to roll out breadth and depth of different product experiences on our platform. Combined, our net revenue was at $803 million. Our adjusted EBITDA loss was $151 million. And our net loss was $1.1 billion, but I want to call out here that that was heavily impacted by noncash impairments.\n\nExcluding those noncash impairments, our net loss would have been $647 million. We take impairments when the value of crypto assets or the value of our ventures' investments fall below our carrying value of those assets. Importantly, we don't take write-ups if the market recovers above that point. So intra-quarter, as crypto dropped to lows, even if it recovered intra-quarter, are taking the impairment down to the lowest point it reached during that reporting period and then never writing it up until we sell that asset.\n\nAnd so, that's the impact of noncash impairments on our P&L and on our balance sheet. I want to switch gears now and talk about how Coinbase is adjusting to these market conditions and how we're focused on operating more efficiently as we move forward. On the expense side, we've taken several steps to streamline our cost structure, including the 18% employee reduction that we announced in June. We want to highlight that it will take some time to fully realize the financial impact of all of our actions, but we are lowering our full-year expense range for technology and development and general administrative expenses to $4 billion to $4.25 billion, which is down from our prior outlook of $4.25 billion to $5.25 billion.\n\nOn the product side, we've taken the approach of pause, maintain and prioritize, and we're focusing on the five key areas that Brian outlined earlier. We are working hard to operate within the $500 million adjusted EBITDA loss guardrail we communicated for 2022. Clearly, we acknowledge these are stressed market conditions. But based on the expense initiatives we took in Q2, we're cautiously optimistic about our ability to operate within this guardrail.\n\nThat optimism is conditioned on crypto market capitalization not deteriorating meaningfully below the July 2022 levels and that we don't see another significant change in the behaviors of our customers. In the event of those events that we see further deterioration or the performance approach is the low end of our MTU range that we're providing in our updated outlook, we may not be able to reduce our expenses quickly enough, and we may exceed that guardrail. However, despite short term, we want to commit to you that we're going to operate more efficiently as we build for the future. Lastly, I want to just close with some comments about our strong capital position and our risk.\n\nThere are three primary factors that we look at to assess our financial strength and durability. First, at the end of Q2, we had $6.2 billion in total USD resources. We provided enhanced disclosures in our shareholder letter to really help you understand the balance sheet and how we look at it. This includes cash and cash equivalents.\n\nIt includes our USDC, which we operate with the same as cash. We are treating USD stable coin as fungible to cash in our daily operations at Coinbase and so we would like you to look at it in the same way and think about that as a cash asset. Second, we take a prudent approach to risk management. We've had no credit losses from our financing activities, no exposure to client or counterparty insolvencies.\n\nWe have never blocked a client withdrawal or gated anybody taking assets off our platform, nor have we had any changes in access to the credit products for our clients. We stand apart in this way of how we operate risk within the crypto ecosystem today, and we believe this is a strength that we can continue to broaden our financing activities and be there from our clients going forward. Third, and Brian touched a lot on this, but there's a global wave toward regulation, and we're committed to working alongside policymakers to build workable regulatory framework for the crypto economy that addresses risk but also enables the development of adoption of digital innovation. We believe we're uniquely positioned here.\n\nSo, with that, let's turn to questions.\n\nOperator\n\nThank you. [Operator instructions] Your first question comes from the line of Owen Lau with Oppenheimer. Please go ahead.\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nGood afternoon and thank you for taking my question. So, in terms of expense control, what does it take for Coinbase to trigger maybe another run of resource allocation if this crypto winter continues to last? And also based on current trading volume and if the current net for last, I understand that if this winter lasts for quite some time, and unfortunately, some other crypto companies may also be in trouble, and Coinbase can benefit longer term. But how confident you are to manage the adjusted EBITDA loss to be around $500 million this year and maybe next year? Thank you.\n\nAlesia Haas -- Chief Financial Officer\n\nThanks for the question, Owen. I'll take this one. It's Alesia. So, we share some of our philosophy in our shareholder letter.\n\nBut the way that we approach our business is that we're operating across the cycle. And going back to our S-1 from last April, we shared with you in our opening founders' letter that we're really looking to breakeven across the cycle as we think it's important in these early days in the nascent days of crypto that we're building for growth, we're expanding the breadth and depth of products on our platform, and we're bringing new users into this ecosystem. And so, we do show historically, we've been able to generate profit, and we're taking those profits and we're reinvesting those into the business. And so, what we do is we look at stress scenarios.\n\nWe forecast out multiple different revenue scenarios, and then we make sure that we can plan for expenses over a multiyear winter. Historically, crypto winters have lasted two to four years. And so, we do look at all of those historic scenarios to see can we operate through those. This year, we did set a guardrail that if we went into a winter that we would operate to a $500 million loss.\n\nIt's never clear to us exactly where we are in a crypto cycle. And so, we're constantly updating our scenarios, updating our contingency plans, and ensuring that we can take a long-term view. So, we will balance expense management with prudent investment, but make sure that we can manage that through a multi-period downturn. We have not yet given an outlook for what we believe 2023 would be, but we continue to think about this as investing for the future.\n\nWe're not looking to make a profit in every quarter or every year, but we are looking to continue to show growth in the adoption of our products and services seen in the green shoots, seen in the right progress, and believe that then when we have the right expense against that opportunity.\n\nAnil Gupta -- Vice President, Investor Relations\n\nThis is Anil Gupta. I'll jump back in. I think we reordered the call on accident. So, I'll go back and state some ground rules for our shareholder Q&A.\n\nBefore we dive into Q&A, I wanted to just quickly reiterate our principles. First, we're going to answer the most uploaded questions determined by the number of shares, and we might group questions together that touch on the same themes. Second, we do not plan to answer questions related to the potential listing of new assets. And third, we will avoid questions we've answered in the past if there are no updates.\n\nFor example, we still don't plan to issue a dividend. So, with that, I'll start the Q&A from our shareholders with Brian, Emilie, and Alesia. The first question we have that's top of mind for many shareholders, especially in light of recent industry events, is the safety and security of their assets, as well as exposure to some of the leverage products and counterparties at the center of the recent market turbulence. Alesia?\n\nAlesia Haas -- Chief Financial Officer\n\nThanks for this question. So, as I said in my opening remarks, we have seen some credit events in the second quarter. And these events shocked the crypto credit market. And we think these are going to be a major inflection point for the industry.\n\nI want to first note that the solvency concerns surrounding entities like Celsius, 3AC, Voyagers, and others, in our view, are a reflection of insufficient risk controls at those entities. To us, these issues were foreseeable and actually credit-specific rather than crypto-specific in nature. Many of these firms were under -- were overleveraged with short-term liabilities mismatched against longer duration or illiquid assets. Those are common flaws that we've seen across TradFi and now crypto alike, but these are credit-specific issues.\n\nCoinbase had no financial exposure to these entities that I just spoke about. Further, we have not engaged in these types of risky lending practices and is focused on building a more sustainable financing business with prudent and deliberate taking lessons of the TradFi passed into consideration. As I mentioned in my remarks, we have not blocked any client withdrawals. We have not had any access to changes for our clients.\n\nAnd risk management is a first principle in our product design. We're holding customer assets one to one. We're not rehypothecating. We're not lending any assets without customer consent.\n\nWhat our customers choose to do with their assets is our customers' choice. Coinbase is not making independent decisions of what to do with those assets without customer approval. I want to switch gears and then just talk about the safety and security beyond the credit risk for a minute because this was a big topic coming out of our prior call. Customer assets are segregated and protected on Coinbase.\n\nWe've recently clarified in our retail user agreement to expressly highlight the applicability of UCC Article 8, and this provides the same legal protection for our institutional customers, as well as our retail customers. And it is the strongest known legal protection available to crypto assets. Our chief legal officer, Paul Graywell, recently penned a blog post a few weeks ago with a very detailed approach on the mechanism that we have put in place to safeguard customer assets, and I would encourage you all to read it. But we feel very good that we have industry-leading protection for crypto assets.\n\nAnil Gupta -- Vice President, Investor Relations\n\nGreat. Our next question is that a number of shareholders have expressed disappointment with our share price performance since going public. What's the plan to get the stock price back on track? Brian?\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYes. So, I think it's important when looking at this to distinguish between what is in our control and what's not in our control. And of course, we don't control the macroeconomic factors or downturn. We don't really even control the crypto market more broadly, right? So, what do we control? Well, obviously, we can focus on building great products for our customers.\n\nWe can focus on staying on the forefront of crypto technology to make sure that we're creating compelling use cases and making those available to our customers. We can focus on our expense management closely in down markets and frankly, we can ensure we just don't get distracted or disillusioned by short-term thinking. So, I believe that the work we're doing today to develop and innovate new products and tools is going to make us really well situated to capture disproportionate share in the next upcycle.\n\nAnil Gupta -- Vice President, Investor Relations\n\nOur next question centers on competition. Several shareholders have asked how Coinbase intends to differentiate and compete, particularly as other exchanges seem to be gaining share, lowering their fees, and are perceived to be moving and innovating faster. Emilie?\n\nEmilie Choi -- President and Chief Operating Officer\n\nYeah. Thanks for the question. Let's unpack that a bit. So, it is true that some of our core U.S.\n\nretail customers are trading less. And what we found is that our core users tend to hibernate and transact less in these periods of uncertainty. We observed similar behavior during 2018 and 2019, and yet we're happy because, for those who are still choosing to transact, average revenue per investing MTU is still comfortably above the lows that we saw in the last crypto downturn that began in 2018. And it's also important to note that customers are hanging around and engaging with crypto in new passive ways, notably staking.\n\nThere's another explanation for Q2, and that is that there was a lot of episodic activity that we didn't participate in. We believe that much of this was driven by events in Q2 relating to assets we didn't support such as Luna and counterparties like 3AC, Celsius, and Voyager that we had no exposure to, thanks to our robust risk management and asset listing process. And then finally, we should note that there is a larger amount of trading volume moving offshore as high-volume traders and market makers seek diversification overseas with derivatives and other products that aren't currently available in the U.S. Now, Coin is live in 100-plus countries, but we are overweight the U.S.\n\nAnd that's actually the reason we're so focused on compliance and moving the innovation conversation forward in the U.S. That's why Brian was talking about the trip we made to D.C. and the cycles we're spending on that. Longer term, though, the way that we move market share is just focusing on our customers, and we are committed to regaining share over time in a way that is compliant and safe for them, including through our new derivatives offering and continued international expansion.\n\nAlesia Haas -- Chief Financial Officer\n\nHey, can I just jump in here, Emilie? I do think we should also talk about the fee part of that question. And the way I've been thinking about it is in terms of customer cohorts as we see very different behavior between our retail customers, our market makers, and high-frequency traders, and many new institutional customers that are beginning to engage in crypto the Coinbase Prime. So, today, as many of our listeners know, Coinbase generates most of our revenue from our retail customers. They trust our products because they're safe, easy to use, and we give them an integrated platform to grade with a range of Coinbase assets and in crypto activities like staking and spending on your card and access to the DApp wallet, NFTs, increasing breadth of things you can do on our platform.\n\nWe are OK with being a premium product. We feel like we've differentiated versus other services and that customers are willing to pay a premium for that service. And to date, we have not seen fee compression on the retail side and have not seen the need to change that fee model. In fact, we're experimenting with pricing like, for example, with Coinbase One with doing a subscription product, where we're bundling all these services together and giving our users the opportunity to trade with no fees.\n\nThey still pay a spread, but no fees to have better product experience. But over the long term, we continue to believe that there will be fee compression, and we started to build a diversified set of products that monetize in other ways, which is why we're so happy to see subscription and services become an increasing percentage of our net revenue, 18% in Q2. But when I shift gears and look at the market makers, this is a group where we do think there will be a fee compression in the short term. This is a client segment that's trading the highest volumes on our platform.\n\nSo, they're already receiving the lowest fee tiers based on our volume-based pricing. But this is a group that we would gain to see increasing competition of competitors' lower fees and as we compete for this volume. We talk about this extensively in our shareholder letter. And while this is an important group, we are more focused candidly on that retail customer and on that institutional customer who's coming into Coinbase Prime and looking at the breadth of products and services that we offer.\n\nBut we will be building products over time to compete more aggressively for the market maker platform. And that is something that we can talk about later.\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah. I think the only thing I would add here is in terms of differentiating versus competitors, I think about it as three main things. The first is that our brand, I think, and everything -- all the products option for customers in the industry. And that comes down to cybersecurity, preventing pack that comes down to compliance, lending into regulation.\n\nIt comes down to great customer support, doing what we say we're going to do, not being sketchy. So, I think being the most trusted option is a good first pillar there. The second thing is around ease of use. So, again, we try to make crypto accessible to everybody in the world.\n\nWe want to eventually have 1 billion people accessing this new economy through our products. And crypto is still often way too difficult to use. And so, I think we're continually leading the industry there and making our product simpler and simpler. And lastly, we're building an integrated product suite sort of one-stop shop, if you will.\n\nSo, if somebody already has a Coinbase account, and it's not trivial to get a new account set up somewhere, you have to do KYC, you may have to connect your payment methods, you may have to store your crypto balances there. So, once you have a Coinbase account, we just make it easy to switch over and try any of these products or services. So, you can get any kind of crypto activity you want in one place, whether that's trading or staking or paying or borrowing or creating something like an NFT. And so, one-stop shop is a very powerful differentiator for us over time.\n\nAnil Gupta -- Vice President, Investor Relations\n\nAll right. Our next question is, what are the tangible steps we're taking to diversify our revenue from trading and other revenues linked to crypto asset prices? Alesia?\n\nAlesia Haas -- Chief Financial Officer\n\nSure. I want to start with, first, we're a crypto company. So, all our revenues will likely always have some correlation with broad crypto markets; however, we're working hard to diversify our product mix to reduce the volatility in our revenues. A couple of years ago, we started to invest in these products, and as we shared in our shareholder letter, now 18% of our net revenues are coming from subscription and services, up from 4% in Q2 2020.\n\nThis is also up 44% year over year even in this down market, so stacking as a big growth driver for us. We're also starting to see significant growth from interest income which has driven underlying from the activities that we see in USDC and our platform and the adoption of that stablecoin. But this is an area we're continuing to invest in. So, if you look at our product areas that we outlined in our shareholder letter, what you see in terms of the developer products with Coinbase Cloud or some of the actions that we're making within Web3, we think we'll continue to add diversified revenue streams over time.\n\nAnil Gupta -- Vice President, Investor Relations\n\nOur next question is looking for a bit of clarity on our wallet strategy and particularly if we have plans to integrate it into the core Coinbase platform. Brian?\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYes. So, I'm happy to talk a bit about Coinbase Wallet. For those of you who don't know, Wallet is our self-custodial app, meaning that it lets users store their own crypto assets instead of having us store it on their behalf. And we've seen strong customer demand for both our custodial app and self-custodial apps.\n\nAnd so, it's important for us to kind of get broad coverage across the different user segments who want both of these types of functionality. So, Coinbase Wallet is really important to us for a few reasons strategically. One is that it allows us to onboard customers in many different countries around the world. It's treated more like a software product in that regard since the customers are storing their own funds.\n\nAnd it also allows our customers to access the latest development in crypto, whether that's interacting with DeFi or smart contracts or people want to use NFTs or accessing what's broadly being called now Web3, which is a really exciting area of development, we think will be a big area of growth. And just briefly to touch on that. So, today's Internet is largely run by a handful of centralized companies that access and monetize their users' personal data, but Web3 is something that -- it's the next generation that is being owned by builders and users storing their own data in a more private way, and it's often orchestrated by these different crypto tokens, creating a more decentralized and community-governed version of the Internet. So, we're also seeing a lot of start-ups and venture dollars and entrepreneurs building new companies and apps.\n\nSometimes these are called decentralized apps, or DApps, in Web3. And so, Coinbase Wallet is a really important way for people to access all of this emerging functionality. In fact, we often say our strategy is to be the primary financial account for people in the crypto economy and while it is an important way that they're now doing that with Web3. As I mentioned in my opening remarks, we've made a number of improvements to the Wallet app over the last few quarters.\n\nFor instance, we now support more than seven different blockchains in Coinbase Wallet and different Layer 2s, enabling users to utilize apps across all of this change without bridges or multiple wallets. We also totally redesigned Wallet on a new tech stack in Q2, and we're seeing rave reviews, really great customer responses from that online. So, we now believe it's the best self-custodial wallet on the market, and we're seeing a lot of that positive chatter. The second part of this question really asked about how will we integrate Wallet into our core Coinbase platform.\n\nAnd of course, the core retail app has a lot of distribution, and a lot of people don't want to have two apps installed. They prefer to have to use our custodial app. And so, we worked really hard to bring that same functionality that's in Wallet into our main Coinbase app. And we're doing that, without getting too much into the technical details, we've had to make a new wallet-type available that met all of the stringent cyber security requirements that we have in place.\n\nIt uses a technology called MPC, or multiparty computation, which we spent a long time investing in to enable some of this functionality. But what's great about it is that now we have this, we call it the DApp wallet inside our core retail app. We have the marketplace where people can try these different third-party applications, interface with them seamlessly. And it's enabling to do all of these things that I mentioned earlier, DeFi, NFTs Web3, just like they would be able to in the Wallet app, but now we brought it to 100% of our customers.\n\nSo, the technical details don't matter as much as the customer experience. I think we're really excited about empowering some of this new functionality. It's helping us attract and retain more and more customers in this space. And it's going to keep moving really quickly, so I'm glad that we've been able to provide these experiences to our customers.\n\nAnil Gupta -- Vice President, Investor Relations\n\nOK. Great. Thanks, Brian. So, now with that, Sarah, let's switch gears and go back to the live questions from our analysts, please.\n\nOperator\n\nThank you. Your question comes from Lisa Ellis with MoffettNathanson. Please go ahead.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nGood afternoon.  Tanks for taking my question, and thanks for the additional disclosures. I thought this bridge on Page 18 of the shareholder letter is super helpful. That was actually the direction of where I wanted to go with my question. Maybe that's one, Alesia, it's for you on sort of how you think about cash burn at Coinbase.\n\nThis bridge shows down $423 million in the quarter, and that's kind of the decrease in cash available. I think looking back at Q1, I don't know the exact number because I have to do this exact math, but it's sort of similar or slightly higher than that. So, is that how we should be thinking about cash burn? And are you thinking about sort of solving for cash burn rate in the same way you're thinking about solving for an adjusted EBITDA figure? Thank you.\n\nAlesia Haas -- Chief Financial Officer\n\nThanks for the question, Lisa. So, we do think about EBITDA and cash a little bit separately because EBITDA is a closer proxy to what we're spending on operations, but we continue to make investments. We think our venture investments are an important part of developing the ecosystem and giving us a lens into the future. And then we also think of our financing activities to the products that we offer to institutional and retail customers as an important part of our business.\n\nAnd so, you will see cash fluctuating within our investing and financing activities that we think is just adding good revenue and good future strategic value to the Company, independent from the operating cash.And so, I do think about our operating cash is the metric that I would focus you on that we are managing closely and ensuring that we are prudent in how much we burn vis-a-vis our balance sheet resources.\n\nOperator\n\nYour next question comes from the line of Ken Worthington with J.P. Morgan. Please go ahead.\n\nKen Worthington -- J.P. Morgan -- Analyst\n\nGood afternoon. Thank you for taking the question. Crypto markets have been under pressure. And during the last call, you mentioned that in the past, Coinbase was able to accelerate its growth by investing and acquiring.\n\nAnd I think Alesia brought up the example of acquiring Xapo in the last call. In this call, you mentioned the repurchase of your debt in the past. And we've seen a couple of your peers acquire distressed assets in sort of high-profile ways. So, I don't think we've seen, at least in an obvious way, Coinbase leveraging the downturn to acquire its way into building the business.\n\nSo, I think, first, has Coinbase taken advantage of the sell-off and stress in the market to build via M&A or debt pay down? And if not, why not yet? And then second, there are a number of bears that point out that Coinbase debt is trading at distressed levels and Coinbase is burning some cash. And therefore, these actions are not taking place because you're not in a position to do so. So, can you talk about the pricing of the debt and maybe the misperceptions that you're hearing about your balance sheet? That would be great.\n\nAlesia Haas -- Chief Financial Officer\n\nSure. Why don't I address the debt? And then, Emilie, I'll turn it over to you and talk a little bit about our M&A philosophy and where we see opportunities in this market.So, what I would share with you is we strategically raised capital in 2021, and we have very long-dated liabilities. So, the convert comes due in 2026, and then we raise seven- and 10-year high-yield notes. We believe this gives us the resources to operate for many years.\n\nAnd those were priced to interest rates that, frankly, we couldn't get in the market today. We don't anticipate being able to find in the market for the next two to three years. This gives us the resources quite candidly to invest through a winter. This gives us the resources to be able to offer financing products to our customers off our balance sheet.\n\nAnd this gives us a lot of flexibility to make decisions for a much longer-term duration. So, we are not looking to take advantage of the price dislocation and just buy that back because we think that's a financial engineering activity and not really in the best interest of building a long sustainable operating business, which is what we're focused on doing. And then with regards to M&A, Emilie, do you want to talk about how we think about these markets?\n\nEmilie Choi -- President and Chief Operating Officer\n\nSure. We continue to be active across both ventures and M&A. It's an area that has helped us gain access to the innovation happening in the crypto ecosystem. It helps us strengthen our competitive positioning.\n\nIt helps us execute against our mission. And crypto winters, we view as builders' markets. It's often the best time for us to be greedy when others are fearful. So, you mentioned the Xapo acquisition.\n\nThat underpins our custody offering. We did that last crypto winter. We also did the acquisition of DOGAMÍ, which essentially laid the foundation for our Prime brokerage platform. And you can expect that we'll continue to do targeted M&A that has high hurdles for ROI.\n\nIn this type of a market, we'll probably have higher hurdles. And then on the venture side, we typically like seed stage investments during this time because, again, it's a builder's market, you tend to see a lot of innovation happening at the ground level such as OpenSea during 2018 when we invested in that seed OpenSea during 2018 when we invested to be prudent about capital allocation, but we think we have a very unique lens on development across the crypto space, and we're going to take advantage of it.\n\nOperator\n\nYour next question comes from the line of Richard Repetto with Piper Sandler. Please go ahead.\n\nRichard Repetto -- Piper Sandler -- Analyst\n\nYeah. Good evening. And my question is more of a high -- you know, a more general question, but it's for Brian. And Brian, in July, in mid-July, you wrote a blog post and very thoughtful, well-researched post about operating efficiently at scale.\n\nAnd then in one of the paragraphs you talked, and I think this was to your employees, but you talked about avoiding spending too much time on what's going well and really share what's not going well so you can improve on it. So, in the spirit of what you put out in that blog, Brian, I'm just trying to see what things -- and again, I know you're invested for the future and you're making progress expanding crypto to all. But what things aren't going so well? What areas could you improve?\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nYeah. Well, thanks for the question. That's certainly been an interesting cultural change for us. We always try to think about, OK, let's take a minute to celebrate the things that are going well, but we always try to think about what we can be doing even better.\n\nI think a lot is going well. But if you look back, I think that we probably could have grown slower over the last couple of years, right? That's something that we probably could have done better. I think that we're still iterating on how we communicate. Our expenses are actually quite predictable.\n\nBut as you can see, our revenue and of course, that ties into EBITDA is less predictable. And so, I think we're still iterating on how we want to communicate ranges publicly and things like that and making sure that we're explaining this new industry to the public markets. It's sort of as the first crypto company to go out, I feel like we're a little bit of like a bellwether for the whole industry. And we're kind of trying to write the playbook on how to understand this industry if it is going to keep going through ups and downs.\n\nNow, my guess is that those cycles will become more muted over time just because the adoption of crypto kind of keeps growing through all of these cycles. And as the use cases are more and more prevalent, like today, there might be hundreds of millions or something like that of people who want to try crypto. But as it gets to be billions or something like that, then I think these cycles will just become more muted. So, I'd say we're iterating on all kinds of things in that direction.\n\nOperator\n\nYour next question comes from the line of Stephen Glagola with Cowen. Please go ahead.\n\nStephen Glagola -- Cowen and Company -- Analyst\n\nThanks for the question. Can you just unpack further the puts and takes around the Q2 retail take rate coming in slightly higher versus Q1 and year over year, including the mix of pro users and the main consumer app? And just can you discuss your outlook on the retail take rate for the second half? Any early reads on the impact of consolidating advanced trading with the main consumer app? Thanks.\n\nAlesia Haas -- Chief Financial Officer\n\nThanks for the question. So, there's very little update that we have compared to our past comments that the retail fee take rate is mathematically the output of the mix of volume on our platform. And as we know, we have two pricing models. One, we have the simple trading pricing model now and then we have tier pricing for our more advanced traders.\n\nAnd so, as mix shift occurs, what pencils out then is the blended rate. And so, we didn't change pricing in Q2. But what we saw is less trading at the higher volume tiers. And so, as people trade at lower volumes, those were higher feed tiers, which resulted in a slightly higher fee rate.\n\nAnd so, as we think about for the second half, what we're expecting and what we shared in our outlook is that we think that volumes will be on the lower side or in line with what we've seen in July so far. And those are lower volumes, which means we'll see sort of the -- on the higher side of fees, which is probably in line with what we saw in Q2. But again, it's all mathematical and mix. And we have not seen any impact yet on our fees.\n\nWe're not seeing cannibalization or anything that would indicate that there would be a broad change in consumer behavior as how they trade our platform. But it's, again, early days. We just announced the retail advances trading within the main app this quarter, but we're watching it closely, but we don't have an update to share at this time.\n\nOperator\n\nYour next question comes from the line of Devin Ryan with JMP Securities. Please go ahead.\n\nDevin Ryan -- JMP Securities -- Analyst\n\nHi. Good evening. Maybe a little bit of a follow-up just on that last line of question. So, if we look at crypto prices, they're up maybe slightly over the past months.\n\nSo, maybe you could say we're seeing some stabilization after a big drop. And I appreciate it's a very short period of time, but the trading volumes that we can track on platform are still declining a fair amount from the second quarter and you're expecting a pretty healthy drop in AT or RPU in the back half of the year for the guide. So, just love to get a little more color on the interplay between crypto market cap and price and activity. That would be helpful.\n\nAnd then also just the scaling of Coinbase One, we've been getting some questions and whether that's impacting ARPU in any direction or just the overall outlook.\n\nAlesia Haas -- Chief Financial Officer\n\nSure. So, we have seen price come up, but I would just note that crypto is very volatile. And so, it's very hard to see if it's a true change in directory until we see it truly in hindsight. So, what we're looking at is the broad headwinds of the macro environment is still putting a lot of investors on the sidelines.\n\nWe are looking at the headwinds of still seeing some fallout in the crypto credit environment. We just saw another exchange in Germany, unfortunately, filed for insolvency today, or it might have been yesterday, but recently. And so, I think that we need to see a little bit of stabilization there, as well as we'd like to have more certainty in the regulatory market, and that's all influencing what we're expecting for the second half. But I would comment to you these markets move very quickly, and we could see a shift.\n\nIt is very hard to predict what will happen and there could be rallies from things that we can't have visibility in today. So, we are focusing, as we shared with you where we're focused. We're focused on rolling out the products and services that we have. On our road map, we're really excited about the feedback we're getting from customers on some of our newly released features such as retail advanced trading in the main app, such as the new Wallet app that we've put out there.\n\nAnd we think that by doing that and engaging our customers, we'll be able to bring that volume to our platform.\n\nAnil Gupta -- Vice President, Investor Relations\n\nSara, we have time for one more question, please.\n\nOperator\n\nOur final question will come from the line of Will Nance with Goldman Sachs. Please go ahead.\n\nWill Nance -- Goldman Sachs -- Analyst\n\nHey, guys, good evening. Thanks for taking the question. Just a question on stock-based comp. I appreciate all the comments on trying to manage the business more efficiently.\n\nStock-based comps running over half of revenue. And just wondering, how you're thinking -- one, is there anything nuanced in there about founder grants or things that are coming in at high exercise prices? And then two, just more broadly, how are you guys thinking about limiting the noncash dilution that shareholders experience from stock-based comp over time? Thanks. \n\nAlesia Haas -- Chief Financial Officer\n\nSure. Thanks for that question. So, the thing I want to share with you is that our board and our management team really understand investor concerns around stock-based comp, and we're very aligned with investors. Our goal is to grow profits and grow stock price and manage dilution effectively.\n\nGiven the inherent volatility in crypto, we're a little bit different in how we think about these metrics. And when we think about our stock-based comp metric similarly to how we think about all of our other financial metrics, which took a longer-term horizon view. So, the metric that we look at is we look at gross dilution over a trailing three-year average. And when you look at it through that lens in 2021, our growth solution from new awards was 2.4%.\n\nYear to date, it's been about 3%. And we're looking at that and saying, how does that benchmark against peers? And we're feeling fairly good about that right now. Looking forward, what I can share with you is that if we have the same size of employee base in 2023, our stock-based comp would come down on a year-over-year basis as we do have some M&A earn-outs and other multiyear grants from prior years that are being amortized in this year from a multiyear best schedule. We're not prepared to provide a 2023 outlook right now, but we do expect a year-over-year decline in stock-based comp.\n\nAnil Gupta -- Vice President, Investor Relations\n\nGreat. Thank you for joining us, and we look forward to speaking with you on our call again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAnil Gupta -- Vice President, Investor Relations\n\nBrian Armstrong -- Co-Founder and Chief Executive Officer\n\nAlesia Haas -- Chief Financial Officer\n\nOwen Lau -- Oppenheimer and Company -- Analyst\n\nEmilie Choi -- President and Chief Operating Officer\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nKen Worthington -- J.P. Morgan -- Analyst\n\nRichard Repetto -- Piper Sandler -- Analyst\n\nStephen Glagola -- Cowen and Company -- Analyst\n\nDevin Ryan -- JMP Securities -- Analyst\n\nWill Nance -- Goldman Sachs -- Analyst\n\nMore COIN analysis\n\nAll earnings call transcripts"
}