{
  "companyName": "Dominion Energy, Inc",
  "companyTicker": "D",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/dominion-energy-inc-d-q2-2022-earnings-call-transc/",
  "content": "Dominion Energy, Inc (D -0.52%)\nQ2 2022 Earnings Call\nAug 08, 2022, 10:00 a.m. ET\n\nOperator\n\nWelcome to the Dominion Energy second quarter earnings conference call. [Operator instructions] I would now like to turn the call over to David McFarland, director of investor relations.\n\nDavid McFarland -- Director, Investor Relations\n\nGood morning, and thank you for joining today's call. Earnings materials, including today's prepared remarks, may contain forward-looking statements and estimates that are subject to various risks and uncertainties. Please refer to our SEC filings, including our most recent annual reports on Form 10-K and our quarterly reports on Form 10-Q, for a discussion of factors that may cause results to differ from management's estimates and expectations. This morning, we'll discuss some measures of our company's performance that differ from those recognized by GAAP.\n\nReconciliation of non-GAAP measures to the most directly comparable GAAP measures, financial measures which we can calculate, are contained in the earnings release kit. I encourage you to visit our investor relations website to review webcast slides, as well as the earnings release kit. Joining today's call are Bob Blue, chair, president, and chief executive officer; Jim Chapman, executive vice president, chief financial officer; and Diane Leopold, executive vice president, chief operating officer. I will now turn the call over to Bob.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nThank you, David, and good morning, everyone. We had another solid quarter and are well-positioned to meet our expectations for the year. We're steadily executing on the largest decarbonization investment opportunity in the country as outlined on our fourth quarter call in February. The successful execution of this plan is already benefiting our customers, communities, the environment, and our investors.\n\nI'll begin with safety on Slide 4. For June, our OSHA recordable rate was 0.52, which remains low relative to our historical levels and substantially below industry averages. We take pride in our relentless focus on safety, and it is the first of our company's core values. Now, I'll turn to updates around the execution of our growth plan.\n\nFirst at Dominion Energy Virginia. Our regulated offshore wind project development continues to be on schedule and on budget. On Friday, we received approval from the Virginia SCC for our rider and the CPCN for onshore transmission. The commission concluded that the project is in the public interest and that our request for cost recovery associated with the project met all requirements as called for in the VCEA.\n\nWe're continuing to review the specifics of the order, but we are extremely disappointed in the commission's requirement of a performance guarantee. While there are scant details, the order states the customer shall be held harmless for any shortfall in energy production below an annual net capacity factor of 42%, as measured on a three-year rolling average. You may recall that 42% is also our projected 30-year lifetime average net capacity factor, meaning, of course, that roughly half the time it would be above that level and half below. Effectively, such guarantee would require deeply to financially guarantee the weather, among other factors, beyond its control for the life of the project.\n\nWhile their party oppose approval of the project, there were concerns raised regarding affordability and the financial risk to customers, given a project of this magnitude. However, the commission's performance guarantee creates an unprecedented layer of financial one-way risk to the EV and is inconsistent with the utility risk profile expected by our investors. There are obviously factors that can affect the output of any generation facility, notwithstanding the reasonable and prudent actions of the operator, including natural disasters, acts of war or terrorism, changes in law or policy, regional transmission constraints, or a host of other uncontrollable circumstances. We believe the commission already settled this issue when it declined to adopt a performance guarantee for our clean energy, one solar projects in 2021 after such a provision was proposed by SCC staff.\n\nIn that case, the commission ordered that involuntary performance guarantees, already unprecedented in regulated utility generation, are not required for projects specifically contemplated within the framework of the VCEA and needed by law to meet the objectives and requirements therein. By applying the commission's own logic, the same outcome should be made here. And all this is occurring at a time when fuel costs have increased dramatically, leaving renewable energy as one of the few ways to alleviate inflationary pressures on electricity prices. As shown on Slide 5, offshore wind is expected to save Virginia customers billions of dollars in fuel costs.\n\nIt will also enable economic development opportunities through Hampton Roads and the Commonwealth. This project is a key component to a diverse energy generation strategy to meet the Commonwealth's clean energy goals while simultaneously meeting the need for an affordable and reliable grid. For example, that is expected to provide customers over $5 billion in benefits on a net present value as compared to being dependent upon purchasing energy and capacity from the PJM market. In summary, we continue to believe this is an important and beneficial project for our customers.\n\nIt also has significant stakeholder support. Nevertheless, the performance guarantee, as outlined in the commission's order, is untenable. We plan to actively engage with stakeholders on the unintended consequences of that provision and are reviewing all public policy options, including reconsideration or an appeal. So, more to come here.\n\nWe'll update you along the way. Turning to other notable clean energy investment updates on Slide 7. Last month, the Virginia SCC approved a settlement agreement for the nuclear subsequent license renewal rider filing. Nuclear life extension represents nearly $4 billion in capital investment through 2035.\n\nThese Virginia units have performed exceptionally well for years, providing over 30% of our customers' energy needs and providing that energy at a low cost and with zero carbon emissions. Successful nuclear life extension is a win for our customers and the environment. On solar, our next clean energy filing will take place in the third quarter. We expect the filing to include about a dozen solar and energy storage projects.\n\nThe filing will represent at least $1.5 billion of utility-owned and rider-eligible investment, further derisking our growth capital plan provided earlier this year. Let me touch on the solar supply chain. As we've discussed on prior calls, there continue to be challenges. Supply is still tight, and prices for certain components are still up.\n\nHowever, our plans remain largely derisked. As it relates to the Department of Commerce's anti-circumvention review, I would remind everyone of the detailed remarks I shared on last quarter's call. We remain focused on the customer impact and advocate for energy policy that provides for an affordable, clean energy transition. Development since our last call only reinforce our confidence in our near-term and long-term development expectations.\n\nThis past quarter, we received commission approval to suspend our Rider RGGI as Virginia works toward its exit from that program. We also received approval that RGGI compliance costs incurred through July 31 and not yet recovered, totaling approximately $180 million, we alternatively recovered through base rates currently in effect. These approvals provide a meaningful benefit to customer bills. Finally, last month, we reached a settlement agreement with the SCC staff on the fuel factor component in DEV's rates.\n\nThe settlement includes our voluntary mitigation alternative to spread the recovery of the under-recovered fuel balance over a three-year period to reduce the effect on customer bills. If approved, this settlement, together with other recent rate revisions, represents an increase to the typical residential customers' monthly bill by approximately 7%. Turning to Slide 8. We're dedicated to the delivery of safe and reliable energy to our customers, which is also affordable.\n\nBased on data from the U.S. Census Bureau, the share of our customers' wallet attributable to DEV's customer bill has declined over the years, a testament to the fact that DEV's rates have remained relatively stable despite an overall increase in household income during that time. Also, as regards to the starting point for relative rates, we're proud to have rates today that remain below the national and various regional averages. Based on EIA data, our rates, even after taking into account our most recent fuel filing, are 8% lower than the national average.\n\nLooking ahead, we expect to continue to offer a compelling value proposition to our customers, with the addition of zero fuel resources to support sales growth in our service area. As reflected on Slide 10, the share of our typical customer rate attributable to fuel is expected to decline, reducing our customers' exposure to future fuel cost as. By 2035, fuel is expected to be less than 10% of the total customer bill as compared to 25% of the total today. Our customers and our policymakers have made it abundantly clear: They want cleaner energy in a way that supports economic growth within our service area, and we're working to deliver those results.\n\nLet me now address data centers, which have provided strong sales growth in our service area to date, a trend we certainly expect to continue. Recently, we've been laser-focused on the potential for transmission constraints in a small pocket of Eastern Loudoun County, Virginia that could impact the pace of new connections for data center customers, which are shown on Slide 7. Let me share a few thoughts on: one, what has created this issue; two, what's being done to resolve it; and three, the impact to our long-term financial plan. First, what has created this issue? The data center industry has grown substantially in Northern Virginia in recent years.\n\nIn aggregate, we've connected nearly 70 data centers with over 2,600 megawatts of capacity since 2019. This is roughly equivalent to over 650,000 residential homes. Data center volumes today represent about 20% of total sales in Virginia. Last year, this growth began to accelerate in orders of magnitude, driven by: one, the number of data centers requesting to be connected on to our system; two, the size of each facility; and three, the acceleration of each facility's ramp schedule to reach full capacity.\n\nFor some context, a single data center typically has demand of 30 megawatts or greater. However, we're now receiving individual requests for demand of 60 megawatts or greater. After extensive discussions and exchanges of data with our team throughout 2021, PJM incorporated this step-change in growth into its 2022 load forecast, as shown on Slide 12. In 2027 alone, it shows an increase in data center load of 2,600 megawatts, which represents a 12% increase as compared to the forecast just last year.\n\nTo put that in perspective, that is equal to the entire installed capacity of our planned offshore wind project. This is an important step as the official PJM DOM zone load forecast is what governs all transmission planning and demonstration of need at both FERC and the Virginia State Corporation Commission. After reviewing existing load and contract commitments and validating the power flow models, we've identified the need to accelerate our previous plans for new transmission and substation infrastructure in this area of Eastern Loudoun County, bringing it forward by several years. To be clear, we're not at the limits of our facilities today, but we need to act now to alleviate transmission constraints in the future while serving our customers growth in this region.\n\nAs delivering safe and reliable energy to our customers is our core mission, one that includes maintaining transparency, we're actively engaged with our customers and other stakeholders to communicate about this potential issue. This resulted in a pause on new data center connections while we work on solutions to alleviate the constraints as quickly as possible. For the avoidance of any doubt, transmission capacity is not constrained outside of this data center alley in Eastern Loudoun County nor our data center customers in other parts of our service territory impacted by this issue. Second, what are we doing to resolve the issue? We are actively working on a variety of potential solutions to serve as much of this increased demand as possible, while we work to accelerate transmission solutions to ensure a safe and reliable grid.\n\nThis includes: reviewing the current capacity constraint analysis, including performing additional in-depth analysis substation by substation; engaging further with customers and other stakeholders on projects to pace new connections and ramp-up schedules; and reviewing a variety of technical alternatives to address areas of concentrated load. Based on the work and outreach done to date, it is clear that we will be able to resume new connections in the near term. But how much and how quickly is still being determined. The longer-term solution will absolutely require additional transmission infrastructure to be built.\n\nAmong the needed additional infrastructure are two new 500 kV transmission lines into Eastern Loudoun County. We're working expeditiously with PJM, the SEC, local officials and other stakeholders to fast-track these along with several other critical projects in order to alleviate the constraints. In fact, we have already submitted plans for the first new 500 kV transmission line with an in-service target date of 2026 to PJM last week. And we plan to file for approval with the SCC in the coming weeks.\n\nWe're committed to pursuing solutions that support our customers and the continued growth of the region. Finally, what's the impact to our financial plan? It's still early, and we'll have to work through this issue. But at a high level, we see this issue as being neutral to our financial plan based on the following. For 2022, in the near term, we expect no impact to sales growth as we have sufficient transmission capacity to meet our customers' load growth as recently connected data centers are continuing to ramp up their demand from existing facilities.\n\nA little more color for that perspective. Data centers tend to have longer ramp-up and load following their connection to the electric grid. Historically, that period is about three to four years, although we see that period shortening over time. For the latter few years of our five-year plan, we expect slightly lower sales growth due to the transmission capacity constraints until new infrastructure can be placed into service.\n\nHowever, we expect to overcome any potential headwinds by the acceleration of needed new build transition projects from later in the long-term plan to earlier, which increases capital in rider form in our five-year growth capital program. We plan to reflect such updates in our next roll forward to our long-term capital plan in early 2023. As a reminder, all related transmission capital spend is in rider form at FERC formula rates. We will continue to provide updates as things develop.\n\nWe remain focused on our core responsibility of safely providing reliable energy to our customers. And it's worth noting that in Virginia last week, we reached a record summer peak demand, and our colleagues kept the electric grid operating flawlessly under demanding load conditions. We expect that exceptional performance to continue. Turning to other business updates on Slide 13.\n\nAt Dominion Energy South Carolina, new electric and gas customer accounts increased nearly 3% in the second quarter as compared to last year, driven by continued strong underlying population growth, as South Carolina's population continues to increase at one of the fastest rates in the nation. In addition, we've reduced the average annual customer outage met, or SAIDI, by over 20% during the first half of the year relative to the same period last year. I note that we've been in the top quartile among all utilities in the Southeast eight out of the past 10 years. Investments made in prior periods are critical to system reliability and the continuation of this trend for the benefit of our customers.\n\nIn that regard, let me provide an update on our integrated resource plan. Last month, the South Carolina Public Service Commission unanimously approved our 2021 IRP update. As a reminder, our preferred plan is indicative of the potential for accelerated decarbonization and assumes our three remaining coal units are retired by the end of the decade, which would result in a nearly 60% reduction in DESC's CO2 emissions. Recently, we filed a retirement study to evaluate the generation transmission resources needed to replace those units.\n\nThese findings, among other updates, will be part of our 2022 IRP update expected to be filed next month. We look forward to engaging with all stakeholders on this planning process. At gas distribution, our utilities operate in some of the fastest-growing areas of the country, with annual customer growth rates over 2% in two of our largest markets. We continue to see strong support for timely recovery on prudently incurred investment that provide safe, reliable, affordable, and increasingly sustainable service.\n\nIn May, we filed our statutorily scheduled rate case at Dominion Energy Utah. We're currently in the discovery phase and responding to data requests. We asked for an ROE of 10.3% and a revenue requirement increase of $70 million, which represents around a 6% increase to a typical customer bill. We expect new rates to be effective in January of next year.\n\nLast month, first gas occurred in our natural gas storage project in Utah, Magna LNG, which will be used to meet system reliability for customers' gas supply in the Salt Lake City area. We remain on schedule to place this facility in service later this year. On RNG, we remain one of the largest agriculture-based RNG developers in the country. We've recently commenced operations at our fourth RNG project and expect two additional projects to come online this year, for a total of six projects producing negative carbon renewable natural gas.\n\nIn addition to these six projects, we have a portfolio of projects in various stages of development, continuing progress toward our aspirational goal of investing up to $2 billion by 2035. Before I hand it over to Jim, I'll recap an important addition to our board of directors. Last month, our board elected Kristin Lovejoy to serve as a director effective August 1. Kris brings CEO and entrepreneur experience, a global business perspective, a passion for diversity as a catalyst for business excellence, and deep experience in the intersection of business, technology and cybersecurity.\n\nKris' skills and experience in management, governance, and technology will enhance our continuing efforts to deliver on our core mission. We look forward to her leadership on behalf of the company and our 7 million customers. And with that, I'll turn the call over to Jim.\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nThanks, Bob. Now I'm going to discuss our second quarter results and a few related financial topics. Our second quarter 2022 operating earnings, as shown on Slide 14, were $0.77 per share, which included $0.01 of hurt from worse than normal weather in our utility service territories. These results are above the midpoint of our quarterly guidance range, extending to 26th consecutive quarters our track record of delivering weather-normal quarterly results that meet or exceed the midpoint of our quarterly guidance ranges.\n\nPositive factors, as compared to the second quarter last year, included strong sales growth and increased regulated investment across electric and gas utility program. Other factors as compared to the prior year include a millstone planned outage, some tax timing, and share dilution. Second quarter GAAP results reflect a net loss of $0.58 per share, which includes the previously announced sale of the retired Kewaunee nuclear power station in Wisconsin, the noncash mark-to-market impact of economic hedging activities, unrealized changes in the value of our nuclear decommissioning trust funds, and other adjustments. A summary of all adjustments between operating and reported results is included in Schedule 2 of our earnings release kit.\n\nTurning now to guidance on Slide 15. For the third quarter of 2022, we expect operating earnings to be between $0.98 and $1.13 per share. Positive factors as compared to last year are expected to be normal course regulated rider growth and sales growth. Other factors as compared to last year are expected to be interest expense, tax timing, and share dilution.\n\nWe are affirming our existing full-year and long-term operating earnings and dividend guidance as well. No changes here from prior guidance. Through the first half of this year, weather normal operating EPS of $1.93 is tracking in line with our expectations. We'll provide our formal fourth quarter earnings guidance as is typical on our next earnings call, but let me provide some commentary on the implied cadence of our earnings over the second half of this year.\n\nAs compared to last year, we expect a number of items will lead to a slightly larger fourth quarter, including normal course regulated rider growth, the absence of a millstone planned outage, absence of last year's COVID deferred O&M, and tax timing that combined are expected to help us deliver solid second half results, in line with our annual guidance. Next, let me touch on electric sales trend. In Virginia, weather-normalized sales increased 2.5% over the 12 months through June as compared to the prior-year period and 1.1% in South Carolina. Components of this growth include a slight decline for residential, as you'd expect, continued back to work trend and higher growth for the commercial segment.\n\nFor 2022, we expect the growth rate to moderate some as we move into the second half of the year. And we expect overall sales to be just slightly above our long-term run rate of 1% to 1.5% per year. I know this topic of sales expectations for our sector is of interest to many investors as we head into what is perhaps a less certain economic period. So, we are again providing demand-related earnings sensitivities for our two electric utilities in today's materials, as we show on Slide 16.\n\nLet me share some commentary. First, for our largest segment, Dominion Energy Virginia. You'll recall that demand in PJM DOM zone in the last few years was despite the pandemic relatively resilient due to robust residential and data center demand, as Bob touched on. Around 50% of DEV's operating revenues are effectively decoupled from changes in load due to riders and fuel pass-through, a dynamic that is reflected in the EPS rules of thumb provided on this page.\n\nLet me now turn to South Carolina, which is more exposed to industrial load, but on the other hand, continues to benefit from strong customer growth, as Bob mentioned. In addition, like Virginia, there are structural mitigants to the load impact on revenue, including riders and fuel passenger mechanisms, as well as a gas operation that adjusts annually for changes in usage. In total, about half of DESC's operating revenues are also effectively decoupled from changes in load. Turning now to our other business segments.\n\nAt gas distribution, about 88% of segment operating margin is stabilized through decoupling or fixed charges, including riders and gas pass-through mechanisms. And our contracted assets segment operates primarily under long-term PPA or hedge arrangements. In West Virginia, we recently reached a comprehensive settlement agreement with the West Virginia Public Service Commission staff and other parties to approve the sale of Hope Gas. If approved by the West Virginia Commission, the transaction may close as soon as the end of this month.\n\nSo, we've covered a lot of ground today. We continue to aggressively execute on our decarbonization investment programs to meet our customers' needs, while creating jobs and spurring new business growth. We'll be actively engaging with stakeholders on offshore wind and reviewing all public policy options, including reconsideration or appeal of the SCC order. We'll be filing our next clean energy solar and storage rider in Virginia later in the quarter.\n\nWe're working expeditiously with all stakeholders to alleviate the constraints in Eastern Loudoun County for our data center customers. We're quite pleased that the South Carolina Public Service Commission unanimously approved our 2021 IRP. And we're on track to meet our annual earnings guidance. With that, we're ready to take your questions.\n\nOperator\n\n[Operator instructions] And we'll take our first question from Shahriar Pourreza from Guggenheim Partners.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nHey. Good morning, guys.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nGood morning, Shar.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nSo Bob, just maybe starting with offshore wind and the performance guarantee. I know it's obviously a tough position to be in here. It's a lot of risk you're going to be taking on, and that could be kind of long term in nature. I know you guys talked about paths to resolve.\n\nBut what if you don't resolve, right? So, one, we know it's a lot of growth for you. But could you decide to walk away from this project as order going to be a no go? And two, I know you laid out some thoughts in the script on next steps. Is there a bid-ask here that would make some sort of a standard palatable? Could you negotiate this, or any performance guarantees, or a no go?\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nYes, Shar. First of all, I'm shocked that you didn't ask about Millstone that breaks through.\n\nShar Pourreza\n\nYeah. That was my follow-up question, Bob.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nOK. All right. Fair enough. Good.\n\nI'm glad you're remaining consistent. But let me address the questions that you asked. It's premature to be talking about that, Shar. We just got this order Friday afternoon.\n\nAs we said in our prepared remarks, there's very little detail in that order. And as it is drafted, as we look at it, it is inconsistent with the utility risk profile expected by our investors. But it's a great project, and it has a lot of stakeholder support. There are options for us to seek reconsideration and options for us to work with stakeholders so that we can get the clarity that we need for this to meet our expectations of what utility investors are looking for.\n\nSo, we're confident that we're going to be able to get that clarity as we work with stakeholders. But we're just 72 hours after the order, so there's not a lot more beyond that that I can tell you this morning.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nBob, any -- I guess, any sense on just the timing and when we can get some more clarity or resolution on this?\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nYeah, that will depend obviously on stakeholders and on the commission. So, we'll work through that, I would hope. And over the coming weeks is the kind of time line that we would be looking for, for something like this.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nOK. Got it. Got it. And then maybe just switching gears quickly to Washington.\n\nObviously, the IRA passed the Senate. It seems to be a lot of puts and takes for utilities. And how are you, I guess, thinking about the potential impacts of the 15% AMT on cash flows and rate base growth weighted against maybe the enlargement and extension of some of those tax credits? And just remind us on the AMT recovery methods in the States. And should we assume some lag? Thanks.\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nShar, it's Jim. Let me recap our view on the act, the Inflation Reduction Act. Still a moving target, of course. Really good that it passed the Senate.\n\nWe'll see what other amendments pop up, if any, as it goes to the House this week. But here's where we are on broad strokes. So, really, high level, pretty good, really positive from a decarbonization incentive perspective, really positive for a utility customer cost perspective. So, good.\n\nWhen it comes to all of the impacts to Dominion's financial plan, you touched on a little bit of it, the devil's in the details. It's going to take a long time before all the treasury regs are worked out. I mean it's not even law yet. But right now, based on what we know, we don't really see a major impact to our plan.\n\nNow, customer beneficial incentive is good, and that could have some knock-on effects that are positive. But we don't see it as being an impact. And let me talk about a little bit the parts. ITC and PTC, the extension, the increases, again, all good.\n\nGood for us, good in the sense that it's direct customer bill benefit. We assume that we're going to continue to do what we've already been doing, recognizing those benefits in the customer bill over time. And it's different for different assets. So, nuclear PTC, a big topic of discussion, of course.\n\nWe view that as positive as well for the nuclear industry, for customers. I think there, it's going to take some real time before the regulations are worked out to determine how exactly nuclear units within a vertically regulated utility, like most of ours, how they're treated when it comes to earned revenue per megawatt hour. Because there's a phase out, right, $43 a megawatt hour. Above that, you're not eligible.\n\nBut we'll see. We have low-cost units, should be eligible. How that's calculated for a vertically regulated utility? No detail yet.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nRight.\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nIf we qualify under that cap, it's a benefit to our customers in Virginia and South Carolina, no question. Millstone, obviously, not regulated, hedged, PPA. But as a reminder, under that existing 10-year PPA, all tax attributes, new taxes, like this. For 100% of the plant output, they flow through to the PPA off-takers and their customers.\n\nSo, again, customer-friendly element even for Millstone, and long term, good for the industry, good for the future of Millstone, whatever happens after that 10-year PPA. For offshore wind, again, sticking with PTC, on the surface, we expect kind of the same thing that we talked about in the BBB era, that if there's a full rate PTC, which the Senate version includes a full rate PTC, that could lower the LCOE for our offshore wind project by up to $7. So, pretty good there, too. So, all that, the PTCs, ITCs, the extension, the increase, we think it's good in a customer-friendly way, and that can have, as I mentioned, knock-on effects.\n\nThe AMT -- of course, the other part, in my sense for the AMT is it's going to impact companies even in our industry in really different ways depending on whether you're a cash taxpayer right now or not and whether you generate credits or not, ITC PTC.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nRight.\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nSo, in our case, we're already a federal cash taxpayer and have been for some years. So, our rates though, our federal cash tax rate is shielded by our inventory of tax credits because we generate a lot of tax credit. So, as you know, Shar, the way that works is the 21% top federal rate is shielded by tax credits, but the maximum you can shield is 75% of your cash tax liability. So, that means for us, our current federal cash tax rate is 5.25%.\n\nSo, 25% of the federal 21% -- 25% times 21%. So, the IRA, this bill, totally different approach, 15% minimum on adjusted GAAP pre-tax income. And those adjustments, again, devil's in detail, but you take out pension plans, you take out NDTs, you add in the -- I mean, this is a change from over the week, and you add in accelerated tax depreciation from the tax book into this calculation of GAAP, adjusted GAAP. But the tax credit, that shield remains.\n\nSo, you can still shield up to 75% of your cash tax liability of credits. So in this case, it'd be -- not the 5.25% of your tax -- pre-taxable income, but it would be 3.75 of adjusted GAAP, so 25% of the 15%. So, a lot of math there. But you can probably guess from that, that taking a view on a go-forward basis, like what is this going to look like? What's the difference between 5.25% of taxable income compared to 3.25 of adjusted GAAP? How does it change over time? It's complicated.\n\nBut our view based on what we know is probably kind of in the same general area since we're already a cash taxpayer. So that drives us to the conclusion that, look, devil's in the details, we're not seeing a material impact. So, details to come. We'll see where it lands this week in the House.\n\nWe would guess that the dust will settle in the next couple of weeks, and we're going to be in a position to talk about the detailed impacts on a more granular basis by the time we're sitting down with you and others at EEI.\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nPerfect. Thank you, guys, for the color. Bob, I will jump back in the queue to ask my standard Millstone question. Thanks, guys.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nOK. Thanks, Shar.\n\nOperator\n\nOur next question comes from Jeremy Tonet from J.P. Morgan.\n\nJeremy Tonet -- J.P. Morgan -- Analyst\n\nHi, good morning.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nGood morning, Jeremy.\n\nJeremy Tonet -- J.P. Morgan -- Analyst\n\nMaybe I'll pick up with Millstone a little bit here. And there were some reports that Massachusetts might have interest in nuclear power. I'm just wondering, any thoughts that you could share there? And I guess, does things change with the PPC for Millstone? Just any thoughts on this as it relates to regular -- regulated and non-regulated nuclear in Massachusetts potential interest in Millstone?\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nWell, as we've been saying for a while, Jeremy, we think Millstone is critical to the New England region achieving its zero carbon goals. And our view on that has only grown. Our confidence on that has only grown in recent months. The Connecticut General Assembly passed a law allowing for additional nuclear as long as it's at the site of an existing nuclear plant.\n\nObviously, that would be Millstone. So, we think there's an increasing recognition of the value of Millstone. And we're happy to work with stakeholders throughout the region on ensuring that Millstone is there to help them meet their clean energy goals. But beyond that, sort of specific to the recent developments in Massachusetts, not a lot to offer.\n\nWe just think it's a great long-term asset, incredibly valuable to the region.\n\nJeremy Tonet -- J.P. Morgan -- Analyst\n\nGot it. That's helpful. Thank you. And just as it relates to the issues around the data centers with regards to congestion there.\n\nCould you provide any more color on what the accelerated T&D investments might look there? And could you provide us a perspective on potential dollar amounts here and what size of the plan this represents? Just trying to see if there's any more detail possible that you could provide on this side?\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nHey, Jeremy, it's Jim. Full detail to come on our full roll forward of our five-year plan, and you'll see changes there, an acceleration of transmission spend. One data point that's out there, last week, there was a filing with PJM for one required transmission investment, one of several to come to make sure we're meeting demand there. And that was $500 million to $600 million.\n\nBut that's not the total. More will be defined in our planning, and we'll discuss that on our fourth quarter call when we do our full roll forward of our capital plan, including all the transmission spend in Virginia.\n\nJeremy Tonet -- J.P. Morgan -- Analyst\n\nGot it. That's helpful. I'll leave it there. Thanks.\n\nOperator\n\nNext question comes from Ross Fowler from UBS.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nHey, Ross. Good morning. Can -- can you hear us? We're not hearing you. All right.\n\nWe'll try again. Operator, shall we go to the next in the queue?\n\nRoss Fowler -- UBS -- Analyst\n\nHey, guys. Can you hear me?\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nThere we go. Hey, Ross. Good morning.\n\nRoss Fowler -- UBS -- Analyst\n\nHey. How are you.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nPretty good.\n\nRoss Fowler -- UBS -- Analyst\n\nIt's too hot. It's probably too hot outside [Inaudible] so there we go. So, just a couple of questions. So, Jim, you talked about how it's up to $7 a megawatt hour savings in terms of the PTCs, should the House pass this as written.\n\nAgainst that $80 to $90 megawatt hour cost for offshore wind or LCOE, that would also lower the cost cap at 125 because it's a 1.4x multiple. I just want to make sure that I'm clear on that.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nYes, Ross. Actually, that it does not affect the cost cap. The multiple in the statute is off of a CT, what the LCOE of a CT from the EIA report of 2019, I think it was. So, that change, while incredibly valuable to our customers, does not change the cost cap figure.\n\nRoss Fowler -- UBS -- Analyst\n\nGot you. Got you. So it gives you more headroom to that cap. All right.\n\nAnd then in the original settlement for offshore winds, there certainly wasn't a performance guarantee. But there was this concept of lower-capacity factor of about 37%. And then you'd report to the commission if it was ever lower than that on a three-year rolling average. And then the commission would determine whether that was a deficiency related to basically unreasonable actions by you versus sort of weather and everything else.\n\nSo, it seems like there's space between that and what was very unclearly written in the order as a reconsideration here to make sure we're not necessarily punishing you for the weather and things you can't control. Is that fair? Is that kind of where you see and where we could be headed here?\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nYeah. I mean, you accurately described the performance provision and the stipulation. And yes, so there's space in between. And as we mentioned, we intend to work with stakeholders.\n\nObviously, just got the order less than 72 hours ago. But that space in between, I think, is precisely where we would be looking to try to find common ground.\n\nRoss Fowler -- UBS -- Analyst\n\nAll right. That's perfect. Thanks, Bob.\n\nOperator\n\nAnd our next question comes from Julien Dumoulin-Smith from Bank of America.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, team. Thanks for the time an opportunity. I will be back next quarter here.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nGood morning, Julien.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nHey. Thank you, guys. If I can, just following up a little bit from Jeremy here, the timing of that capex related to PJM, if I can. Can you elaborate a little bit on it, as well as maybe how this might tie into some of the new reform that we're seeing with PJM? Obviously, that impacts more from the renewable side.\n\nBut again, obviously, load interconnect matters as well here as it goes. Can you talk a little bit about that from a PJM perspective? Obviously, you submitted these things to PJM. And then if I can go on -- the second question is the same. It's all related.\n\nYou identified a series of numbers here related to load sensitivity to data centers. And if I get it right, you're talking about 12% number, and broadly speaking, it kind of backs into about a 2% in change total load growth from the data center side going into next year. And if you look at the sensitivities, it's perhaps $0.02 to $0.03 on earnings. Just want to make sure.\n\nYou try to call it out very specifically. I want to make sure we're looking at that math correctly here on the year-on-year as well.\n\nDiane Leopold -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, Julien, this is Diane Leopold. I'll at least start and then maybe hand it off to Jim on some of the latter parts of your question. So, related to timing on the data centers, so these were all transmission projects that we had planned long term anyway. We'd seen some of these constraints.\n\nWe were already designing it. So, accelerating it is really moving the capital in our plan up roughly two years so to have the first set of projects in by 2026, the latter part of 2025. So, that transmission spend that was maybe more focused on '25, '26 and '27 would move into capital that would be '23, '24 and '25. And likewise, the next set of projects, and that's what's going to be filed in the next -- in the coming weeks.\n\nThe next tranche of relieving the transmission constraint, also moving up in time, but instead of being online by 2026, is 2028. So, you can just kind of move that on out.\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nHey, Julien, on your sales question, let me give you a couple of comments there. So, look, first, you need to differentiate between demand and sales. Some of Bob's comments that we set out is on demand, increases in demand for data centers and in this potentially affected area. So, we don't get paid on demand, of course, typically, not fully utilized.\n\nIt takes a long time for data centers to ramp up, etc. But we get paid on sales. And for this customer class, like other high-usage customers, there's a lower margin. So, what drops to the bottom line isn't necessarily the same as a sales number.\n\nIt's still helpful. Meaning, the increased sales helps offset increases to the typical customer bill across the system, but it is lower margin based on its high usage. So impacts to the bottom line from these issues just described could be a little bit years out after this ramp period of plateauing, slower growth slightly in data center sales, offset by what Diane just mentioned, increases in the needed transmission spend, which is, of course, not lower margin it's formula rate and rider. So, it's hard to take a -- in summary, a straight line from changes in demand down to the bottom line for EPS sensitivities.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nYes, understood. That's why I asked. Excellent. And then just to clarify the last comment.\n\nYou did a bunch of math, super quick. With respect to the ability, some of the changes over the weekend here on the tax adjustments that you can do for the adjusted GAAP, just to clarify, you can deduct items against AMC with respect to bonus depreciation here, as you described. I think you said that. I just want to make it crystal clear.\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nOK. Not bonus depreciation, but the tax depreciation makers. Whatever is in your tax books for -- including for utility spend translates over as an adjustment in this GAAP -- adjusted GAAP pre-tax income calculation for AMT purposes.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Excellent. Thank you. Appreciate that.\n\nOperator\n\nOur next question comes from Durgesh Chopra from Evercore ISI.\n\nDurgesh Chopra -- Evercore ISI -- Analyst\n\nHey. Good morning, team. Thanks for giving me the time this morning.\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nGood morning.\n\nDurgesh Chopra -- Evercore ISI -- Analyst\n\nGood morning, Bob. Jim, just a finer point on Julien's question. Just to be clear on the -- utilities aren't eligible for bonus depreciation, correct? I mean the related assets?\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nCorrect. From the last round of tax reform, that's correct.\n\nDurgesh Chopra -- Evercore ISI -- Analyst\n\nRight. So, this is just -- when we talk about accelerated depreciation, this is just your normal makers type setup?\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nExactly right, Durgesh.\n\nDurgesh Chopra -- Evercore ISI -- Analyst\n\nOK. Thanks. And just, Bob, quickly following up on the sort of the performance guarantee provision. I understand there's a lot of moving pieces.\n\nHow does this impact the sort of the schedule of the project and your planned activities in the second half of the year and next year?\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nWe wouldn't expect it to have any effect on the schedule. We're -- again, we'll work as quickly as we can with stakeholders. But this, as you know, is a guarantee that affects the -- applies to the operation, not the construction of the facility. So, it won't have an effect on the schedule.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid McFarland -- Director, Investor Relations\n\nBob Blue -- Chairman, President, and Chief Executive Officer\n\nJim Chapman -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nShar Pourreza -- Guggenheim Partners -- Analyst\n\nShahriar Pourreza\n\nJeremy Tonet -- J.P. Morgan -- Analyst\n\nRoss Fowler -- UBS -- Analyst\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nDiane Leopold -- Bank of America Merrill Lynch -- Analyst\n\nDurgesh Chopra -- Evercore ISI -- Analyst\n\nMore D analysis\n\nAll earnings call transcripts"
}