{
  "companyName": "Noah Holdings",
  "companyTicker": "NOAH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/noah-holdings-noah-q2-2022-earnings-call-transcrip/",
  "content": "Noah Holdings (NOAH -0.13%)\nQ2 2022 Earnings Call\nAug 22, 2022, 8:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the Noah Holdings second quarter 2022 earnings conference call. All participants will be in a listen-only mode. [Operator instructions] After today's presentation, there will be an opportunity to ask questions. [Operator instructions] Please note this event is being recorded.\n\nI would now like to turn the conference over to Ms. Jingbo Wang, CEO of Noah Holdings. Please go ahead.\n\nJingbo Wang -- Founder, Chairwoman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nOn the agenda of today's teleconference, I will first share my views on the macro environment, then introduce the overall performance of Noah in the second quarter of 2022, the development of our major business segments, and our overall strategy. Next, let's invite our group CFO, Pan Qing, to introduce the quarterly financial information, followed by a Q&A. In the past two years, the global real economy deleveraging and capacity reduction caused by the epidemic and the impact of the Russian-Ukraine war has exacerbated global inflation in the first half of 2022. China's continuous epidemic prevention and control policy has brought unprecedented challenges to the economic growth of core regions, including the Pearl River Delta and the Yangtze River Delta.\n\nOn one hand, the supply side has been impacted and the demand side has contracted significantly. On the other hand, expectations are weakening, the economy reached the bottom, and the market bottomed out in the second quarter. As the company is headquartered in Shanghai, more than 1,800 employees experienced a lockdown at home in the second quarter. We observed that the investment sentiment of high-net-worth families and private enterprise clients have changed significantly.\n\nImproving the safety and liquidity of assets is the first demand of clients. At the same time, the global allocation needs of Chinese private enterprises and high-net-worth families have been significantly improved. Noah's judgment on client demand and asset allocation suggestions are stability first, survival of the city, and domestic and international dual circulation for Chinese enterprises and high net worth families. We suggest that clients started rebalancing their global asset allocation.\n\nThe ratio of Chinese and overseas asset allocation is 100 to 100. Domestic assets are allocated to the Chinese market and overseas assets are allocated to the international market. Chinese private enterprises do establish new brands or international headquarters in the overseas market and cultivate the international market completely independently. Domestic headquarters and international headquarters assume different functions.\n\nOver time, China's private enterprises and high-net-worth families may make great progress in the process of passive globalization and even have unexpected surprises. Noah has been in business for 18 years and has experienced many market cycles. We're also lucky that we had suggested clients to withdraw from assets such as domestic real estate developers' bonds in advance and protected the assets of clients as much as possible. Noah was listed on the New York Stock Exchange in 2010 and successfully listed in Hong Kong on July 13, 2022.\n\nWe have also announced the start of the conversion to do primary listing. Today, I hereby, sincerely thank the shareholders and investors who give us great support in the process of Hong Kong's secondary listing. Under the turbulent market environment, our global offering was 5.9 times oversubscribed. The Hong Kong public offering was 3.3 times oversubscribed.\n\nAnd specifically, we saw long-term value investors 2.6 times oversubscribed. During the secondary listing offering, we received support from many types of new institutional shareholders, which is quite an investor onboarding achievement in the sluggish market environment. At the beginning of this month, the Board of Directors approved Noah's long-term annual dividend mechanism. We plan to pay dividends of no less than 10% of the annual non-GAAP net income in the future, aiming to deliver stable and sustainable return to shareholders.\n\nJingbo Wang -- Founder, Chairwoman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nIn the second quarter of 2022, Noah achieved net revenues of RMB 738 million and the non-GAAP net income attributable to shareholders of RMB 365 million, up 5.4% year on year and 13.3% quarter on quarter. As of June 30, the accumulated non-GAAP net income was RMB 669 million, reaching 46% of the annual guidance. In terms of core business data, the transaction value of the second quarter was RMB 19.3 billion, a year-on-year decrease of 22.7% and a quarter-on-quarter increase of 28.8%. Among them, the transaction value of private equity was RMB 3.9 billion, an increase of 23.2% quarter on quarter.\n\nMutual funds were RMB 12.2 billion, up 30% year on year and 71.4% quarter on quarter. We're gratified by the outcome that although clients have insufficient investment confidence amid sluggish markets, they're still willing to let Noah manage a larger share of their wallets in this quarter. Affected by the market environment and investment sentiment, the overall household savings rate has risen by a large margin. Our transaction value of private secondary funds dropped significantly year on year and quarter on quarter.\n\nHigh net worth and ultra-high net worth clients are our core client group, and Noah Diamond and Black Card clients have been growing steadily. As of June 30, 2022, Noah had 6,774 Diamond clients, which grew 6.1% year on year. The number of Black Card clients reached 1,786 with a year-on-year increase of 20.5%. While continuing to focus on Diamond and Black Card clients, we're also putting forth efforts on identifying and serving potential Diamond and Black Card clients, as well as recovering lost clients and reactivating dormant accounts.\n\nIn terms of recovering lost clients and dormant clients, great progress has been made this year. As of August 19, we have recovered 714 lost clients this year.\n\nJingbo Wang -- Founder, Chairwoman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nAs of June 30, 2022, growth of AUM was RMB 165.4 billion, which slightly decreased by 0.4% compared with the end of the previous quarter due to more distribution. Among them, the AUM of private equity stabilized at RMB 132 billion and public securities increased by 3% over the end of last quarter, reaching RMB 10.7 billion. In terms of Gopher's real estate AUM, it is mainly composed of the U.S. rental apartment fund and the office buildings located in two commercial core areas in China.\n\nGopher's overseas AUM increased by 6.2% year on year and 1.5% quarter on quarter, reaching RMB 29.6 billion, with private equity, public securities, and real estate achieved 1.1%, 6.4%, and 2% quarter-on-quarter growth, respectively. In terms of primary market, Gopher completed the exit of four projects in the second quarter. The Series 6 of S fund continues to raise capital. And with the gradual return of the secondary market valuation, the investment of S Fund has entered a safer valuation margin.\n\nGopher's private equity funds raised RMB 2.6 billion in the second quarter. Gopher's target strategy products have three types of strategies: conservative, balanced and positive. Although the market environment in 2022 remains severe as of August 12, the performances of the three strategies were 0.4%, minus 3.3%, and minus 4.7%, respectively, while that of CSI 300 and CSI 800 were minus 15.2% and minus 14.6%, respectively, in the same period. The performances of Gopher's target strategy funds have been far better than that of the comparable indices, effectively controlling volatilities and pullbacks and playing the role of wealth stabilizer.\n\nAt the same time, Gopher is also actively incubating different strategies and complementary equity in direct investment products. After the second release in Hong Kong, we began to establish a larger international private banking team and a global product screening team in Hong Kong to meet the global asset allocation and service needs of clients. Noah's Singapore office also began to promote new business plans. Now Gopher International has also started to build new research capabilities and enrich international product lines to meet clients' demands.\n\nJingbo Wang -- Founder, Chairwoman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nSince its establishment in 2021, the Sustainable Development Committee of Noah Holdings has been practicing the value proposition that sustainable development brings long-term kinetic energy to Noah. It has held regular and irregular meetings to promote the inclusion of relevant ESG issues in the decision-making of investment and product selection to improve the ESG awareness of clients and business partners and regularly reports to the board of directors and senior management. In the past year, our ESG promotion work was fruitful. We conducted ESG survey on the Black Card and Diamond Card clients in 2021, and the results showed that the popularity of ESG among high-net-worth clients increased by 35% and reached 80%.\n\nOur clients' ESG investment intention increased by about 3.5 times to 50%. Gopher also issued an ESG questionnaire to its investment partners in May this year. The results show that ESG behavior of the leading asset managers has become more prominent in the past year. Most of them plan to increase the proportion of ESG-related investment products in the next one to three years, and more than 70% of the institutions have started to practice.\n\nAt the same time, we have constantly enriched the product offering of our dedicated online ESG investment sessions both onshore and offshore, conducted continuous ESG special investment consultancy training for our relationship managers, and imparted more ESG information and product information in internal and external media platforms. Noah and Gopher are duty bound to continue to exert our circle influence, improve research and development of ESG products, and enhance the sustainable operations of the group.\n\nJingbo Wang -- Founder, Chairwoman and Chief Executive Officer\n\n[Foreign language]\n\nUnknown speaker\n\nFinally, I would like to say that the future is bright and the road is winding. There was an article titled Name is Strategy, which said that the name of a company often contains a certain strategy. First, it contains a certain vision, planning, and intention. On the other hand, vision, planning, and intention will reversely shape our behavior.\n\nNoah's name is taken from the Bible. First of all, Noah was a righteous man. He chose to live an honest an upright life regardless of the behavior of people around him. He insisted on giving trust and was full of all for life.\n\nHis life was full of possible risks. He took precautions and built the ark with gopherwood, making full preparation for the possible flood. Noah was full of courage, forward-looking and correct judgment. The ark carried pairs of healthy species.\n\nNoah then sails to the future on the ark. This is the meaning of Noah's ark, and it seems to be a metaphor for Noah Holding's own mission, vision, and value. In 2022, we deeply feel that we have a great responsibility to our clients. The greater the macro uncertainty, the more we need to think calmly and make mature judgments.\n\nWe believe that beyond wealth lies the wisdom of life. Noah devotes ourselves to creating legacy for clients for generation to come. Next, let's invite CFO, Pan Qing, to introduce the financial data of this quarter in detail. Thank you.\n\nQing Pan -- Chief Financial Officer\n\nThank you. Thank you, Chair Lady. And hello, dear investors and analysts, including our new shareholders who supported our secondary listing in Hong Kong. Following the impact of major events such as geopolitical conflicts in the first quarter, the macro environment in the second quarter continued to be under pressure.\n\nAs of the end of July 2022, the United States Federal Reserve has raised interest rates by cumulative 225 bps. In China, prolonged COVID-19 lockdown led to only a 0.4% GDP growth in the second quarter. Investor sentiment hasn't fully recovered, evidenced by distribution value of mutual fund products in the country decreased by 25.8% year over year in the quarter and dropped a whopping 57.8% year over year for the first half of the year, as well as the savings rate has risen to 34% as of the end of second quarter, compared to only roughly 30% pre-pandemic. At the same time, we're mindful of the tensions between the two largest economies in the world.\n\nIn July, Noah successfully completed the secondary listing in Hong Kong, partially mitigating the ADR delisting risk. This month, we have also announced to pursue a voluntary conversion to dual primary listing status in the U.S. and Hong Kong, opened to further resolve delisting pressure. We also installed a long-term scheme to pay at least 10% of our non-GAAP net income as annual dividends to shareholders starting from April next year.\n\nNow please let me walk you through more detailed results of the second quarter. Non-GAAP net income was RMB 355 million for the quarter, up 5.4% year over year and 13.3% quarter over quarter. For the first half, it was RMB 669 million, representing 46.1% of our full year non-GAAP net income guidance. Income from operations for the quarter was RMB 323 million, a 3.6% decrease year over year with a 3% growth over the last quarter, mainly because of the decreased net revenues for the quarter, but partially offset by lower expenses such as general administrative expenses, marketing spending, high activities, as well as more government grants received in the second quarter due to the COVID-19 lockdown in parts of China, especially in Shanghai.\n\nConsequently, the operating margin was 43.8%, up 17.4% year over year and 11% quarter over quarter. With the orderly resumption of work in major domestic economic regions since June, it is encouraging to witness a recovery in transaction value as expected, which recorded a 28.8% increase over the last quarter from RMB 15 billion to RMB 19.3 billion, but compared to the last year, still down 22%, especially when we had a really strong second quarter last year. Notably, the transaction value of mutual fund products continues to grow against the market tide with a significant increase of 71.4% quarter over quarter and 30% year over year to RMB 12.2 billion. In the second quarter, the total number of mutual fund active clients was 11,248.\n\nThe transaction value of private equity increased 23.2% over the last quarter to RMB 3.9 billion, but down 39% year over year, representing a quarterly recovery that had been expected, while the transaction value of PE products saw a decrease of 40% quarter over quarter and 68.9% year over year due to a volatile market environment and less investor interest in that asset class as expected. Benefiting from continued strategic investments in our core client group, Diamond and Black Card clients grew to 8,560, up 3.3% quarter over quarter and 8.8% year over year, among which the number of Black Card clients increased by 20% year over year. We have also been making efforts on reactivating dormant accounts and retrieving lost accounts due to the transformation to standardized products. Our client-centric philosophy will continue to be a key strategy in the long run.\n\nIt's also worth mentioning that among active clients, the number of clients who purchased insurance products during the quarter was 1,009, 16 times more than the first quarter of 2022 and three times more than the same period last year as we resume the sales of certain products after resolving a temporary regulatory requirement in the first quarter this year. Net revenues of the quarter was RMB 738.1 million, down 17.9% and 7.2% quarter over quarter, mainly due to decreases in performance-based income. As the transaction value of private equity mutual funds and insurance products recovered in the quarter, our one-time commission more than doubled quarter over quarter to RMB 207 million, but still down 16.1% year over year due to less public securities distributed. Recurring service fee remained relatively stable at RMB 458.9 million, a decline of 7.9% year over year and 5.2% quarter over quarter, mainly due to NAV adjustments.\n\nPerformance-based income swapped to RMB 25.9 million, down 78.8% and 85% quarter over quarter, primarily due to the lack of profitable assets from public securities. Net revenues from other service fees for the second quarter of 2022 were RMB 46.4 million, a 44% increase from the corresponding period in 2021, primarily due to more value-added services Noah offers to our high-net-worth clients since the Shanghai lockdown. Let me go back and do a quick correction. When I mentioned the transaction value of private products saw a decrease of 40% quarter over quarter.\n\nIt should be transaction value of private secondary products saw a decrease of 40%. Now the segmented results. As for our segmented results, net revenues from the Wealth Management segment were RMB 509 million, down 18.7% year over year, 12% quarter over quarter due to a slowdown in transaction value during the quarter. Net revenues from the Asset Management segment were RMB 210 million, down 17% year over year, but up 5% quarter over quarter.\n\nGopher's AUM was RMB 155.4 billion as of June 30, 2022, slightly lower than RMB 156.1 billion at the end of first quarter due to more distribution and redemptions during the quarter. Moving on to the balance sheet. We remain in a healthy liquidity position and the current ratio stood at 3.2 times. The debt-to-asset ratio was 19.4, still with no interest-bearing debt on our book.\n\nBy the end of second quarter, we had RMB 3.6 billion in cash. It should also be noted that net proceeds of the Hong Kong secondary listing have not been included yet and should in the next quarter. Supported by this healthy balance sheet and continuous strong cash flow generating capabilities, we announced that the board had approved and adopted an annual dividend policy on August 10. In normal circumstances, the annual dividends to be declared and distributed in each calendar year shall be in principle no less than 10% of the group's non-GAAP net income attributable to the shareholders of the preceding financial year as reported in the company's audited financial statements, which aims to provide stable and sustainable returns to the shareholders of the company.\n\nThe dividend will be subject to shareholders' approval at the AGM no later than the end of June each year. Once approved, the dividend shall be declared by the company and paid out to the shareholders. Being confronted with the current complex international geopolitical environment, the board had approved a motion to pursue the voluntary conversion to dual primary listing on Hong Kong exchange, which will further eliminate the risk of U.S. delisting.\n\nWe want to thank the investors who supported the Hong Kong secondary listing and hope to provide the market with positive outcome in the coming months. Our CIO office also published the investment outlook for the second half of 2022, reiterating the protection for growth strategy for our clients. Meanwhile, we suggest our clients to initiate investment strategic layout, both onshore and offshore, also known as fuel circulation. We are mindful of changing and challenging market scenarios and will adjust our strategy accordingly.\n\nAgain, we sincerely thank our shareholders for ongoing trust and support and strive to create long-term value for our clients and for our shareholders. Thank you, everyone, for listening. And I will now open the floor for questions.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] And at this time, we will pause momentarily to assemble our roster. And the first question will come from Chiao Huang with Morgan Stanley. Please go ahead.\n\nChiao Huang -- Morgan Stanley -- Analyst\n\n[Foreign language] Maybe I'll just briefly translate. The first question is about the client base. But obviously, given a very volatile market environment, we're still achieving a steady growth in the number of key clients in Black Card and Diamond Card. So just wondering if management can share any of the drivers behind.\n\nAnd do we have any target or plan for the client number growth this year or next year? And second question is on the number of relationship managers, which we think is important to keep a high hedge service, and we see the numbers have kind of structured in between 1,200 and 1,300 in the last two years with some slight decline in the past two months -- two quarters. So, I wonder how's the team's reaction or acceptance to the newly completed restructuring on the compensation of KPI system? And do we have any target for the next two to three years? Thank you.\n\nJingbo Wang -- Founder, Chairwoman and Chief Executive Officer\n\n[Foreign language]\n\nQing Pan -- Chief Financial Officer\n\nSo, to your first question, we believe that because of the complex situation, especially faced in the lockdown, so it has been quite difficult to get to the client scenario, especially in the offline situation. So what we have been doing is really to serve and make the existing client base increase their satisfactory level. And the majority of the growth achieved in the Diamond and Black Card client tier is from the existing clients when they actually made more investments and upgrades internally. And at the same time, the strategy of making the existing clients happy, and they are more willing to actually bring in their clients and make referrals.\n\nSo, we actually have another program called MGM, Member Get Member, which has shown actually very positive progress as well. It seems that the strategy has been working. And just a little bit of supplement to what Chair Lady has mentioned. Another thing is that we have been continuouslyinvesting and upgrading our branding, as well as the benefit system that's associated with the Black Card and Diamond Card members.\n\nIn the past, it's mostly probably just some rebates or some points that's associated with benefits. But at this time, we actually added a lot more benefits in terms of free classes, free lessons they can get on investors, as well as some other educational sessions, which are actually being very welcomed by the client. So basically, internal system during the lockdown actually had more time to invest, as well I agree that something to actually increased the satisfactory level of clients greatly. In terms of the relationship manager's team, obviously, we're still eyeing for growth.\n\nBut I guess the strategy for this year is mainly for making room for better talent to come in and to upgrade the talent mix. Especially, we're investing more heavily toward the fresh graduates from good schools. We want to make sure actually we have a younger pipeline for the future RMS team. At the same time, we're also actually having another program called [Foreign language], which means that we're actually targeting to recruit good veterans into Noah.\n\nSo, the overall strategy undoubtedly will be toward the growth of our team, but at the same time, while we make sure that the quality is well selected. We're also actually planning to invest quite heavily in terms of the team that's in Hong Kong and Singapore. We probably see a greater growth speed in that team in these two places. Chiao, do we have your question?\n\nChiao Huang -- Morgan Stanley -- Analyst\n\nYes, thanks very much, management.\n\nQing Pan -- Chief Financial Officer\n\nOK.\n\nOperator\n\n[Operator instructions] Our next question will come from Peter Zhang with J.P. Morgan. Please go ahead.\n\nPeter Zhang -- JPMorgan Chase and Company -- Analyst\n\n[Foreign language] I will do the translation. So my question is about the second half outlook because we noticed management maintained our non-GAAP focus, which will translate to a quite strong growth in the second half non-GAAP profit goals. So we are wondering what will be the key driver and what's the, say, target and key sales outlook in the second half. Thanks.\n\nQing Pan -- Chief Financial Officer\n\nOK. Thank you, Peter. I appreciate your question. Yeah, we actually are relatively happy, especially with the challenges that we faced in the second quarter.\n\nEspecially, one of our main cities, Shanghai, which is also the headquarter of Noah, faced two months of lockdown and still be able to actually obtain a 46% progress. And actually, the non-GAAP net income actually has grown over both last quarter as well as year over year. So, we believe that we're still on track to make the full year guidance, especially for the industry seasonality. Majority of these big so-called client conferences and marketing events usually occur in the second half of the year.\n\nFor example, we have so-called [Foreign language], which are both the end of the year, as well as beginning of the year major marketing points, as well as the main event of Black Card Gala usually takes place in November and December. So we still believe that good wave of marketing events, as well as the client conference, are waiting to happen. Obviously, we are prudently optimistic about how the client sentiment will be before the big conference in probably October, November. But we believe that no matter what the outcome is, once our clients' sentiment actually sees some sort of level of certainty, they will definitely have a higher sentiment of making especially investments and probably easier for them to make investment decisions.\n\nSo that's primarily the reason behind. [Foreign language]\n\nJingbo Wang -- Founder, Chairwoman and Chief Executive Officer\n\n[Foreign language]\n\nPeter Zhang -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nQing Pan -- Chief Financial Officer\n\n[Foreign language]\n\nOperator\n\n[Operator instructions] This will conclude our question-and-answer session. I would like to turn the conference back over to Grant Pan for any closing remarks. Please go ahead.\n\nQing Pan -- Chief Financial Officer\n\nThank you, operator, and thank you very much, our investors and analysts. We have two quarters to go, and we're striving to get positive results for the market. Thank you very much for your time.\n\nJingbo Wang -- Founder, Chairwoman and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJingbo Wang -- Founder, Chairwoman and Chief Executive Officer\n\nUnknown speaker\n\nQing Pan -- Chief Financial Officer\n\nChiao Huang -- Morgan Stanley -- Analyst\n\nPeter Zhang -- JPMorgan Chase and Company -- Analyst\n\nMore NOAH analysis\n\nAll earnings call transcripts"
}