{
  "companyName": "ClearPoint Neuro, Inc.",
  "companyTicker": "CLPT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/clearpoint-neuro-inc-clpt-q2-2022-earnings-call-tr/",
  "content": "ClearPoint Neuro, Inc. (CLPT -1.97%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the ClearPoint Neuro second quarter 202 financial results conference call. [Operator instructions] As a reminder, this conference is being recorded. Comments made on this call may include statements that are forward-looking within the meaning of securities laws. These forward-looking statements may include, without limitation, statements related to anticipated industry trends, the company's plans, prospects, and strategies, both preliminary and projected, and management's expectations, beliefs, estimates, or projections regarding future results of operations.\n\nActual results or trends could differ materially. The company undertakes no obligation to revise forward-looking statements for new information or future events. For more information, please refer to the company's annual report on Form 10-K for the year ended December 31st, 2021, and the company's quarterly report on Form 10-Q for the first three months ended March 31, 2022, both of which have been filed with the Securities and Exchange Commission and the company's quarterly report on Form 10-Q for the three months ended June 30th, 2022, which the company intends to file with the Securities and Exchange Commission on or before August 15th, 2022. All the company's filings may be obtained from the SEC or the company's website at www.clearpointneuro.com.\n\nI would now like to turn the conference over to your host, Joe Burnett, chief executive officer.\n\nJoe Burnett -- Chief Executive Officer\n\nGood afternoon, everyone, and thank you to all of the investors and analysts on today's call for being a part of the ClearPoint vision and journey. Our mission and our priority is to help restore quality of life to patients and their families who are suffering from some of the most debilitating neurological disorders imaginable. In the first half of 2022, we continue to make progress across our four-pillar growth strategy, including biologics and drug delivery, functional neurosurgery navigation, therapy and access products, and in achieving global scale. Despite a continued high cancellation of procedures due to COVID, historically high surgeon transitions, and daily supply chain challenges, our team was able to achieve record revenue of $5.2 million for the second quarter, representing 52% growth year over year.\n\nBiologics and drug delivery revenue surpassed functional neurosurgery revenue for the first time as our largest contributor and grew 73% year over year in the quarter at $2.4 million, including the addition of multiple new partners. As a company, we believe we remain well capitalized with over $45 million in cash and short-term investments, and we'll continue to execute against our strategy while carefully managing our expenses. We continue to expect total revenue for 2022 to be in the range of $21 million to $22 million, representing 30% to 35% annualized growth for the year. I will now turn the call over to Danilo D'Alessandro, our CFO, to review our financial performance in the second quarter, after which I will add some detail to our four-pillar growth strategy moving forward.\n\nDanilo?\n\nDanilo D'Alessandro -- Chief Financial Officer\n\nThank you, Joe, and thank you all for joining us today. Looking at the second quarter 2022 results. Total revenue was $5.2 million for the three months ended June 30th, 2022, and $3.4 million for the three months ended June 30th, 2021, which represents 52% growth versus the second quarter of 2021. Our revenue is made up of three components: biologics and drug delivery, functional neurosurgery navigation and therapy and capital equipment and software.\n\nBiologics and drug delivery revenue include sales of disposable products and services related to customer-sponsored preclinical and clinical trials utilizing our products. Biologics and drug delivery revenue increased 73% to $2.4 million in the second quarter, up from $1.4 million in Q2 2021. Functional neurosurgery navigation revenue consists of commercial sales of disposable products and services related to cases utilizing the ClearPoint system to deliver medical device therapy to the proper target. This revenue segment increased 17% to $2.2 million for the second quarter, up from $1.9 million in the second quarter of 2021.\n\nCapital equipment and software revenue, consisting of sales of ClearPoint reusable hardware and software and related services nearly tripled to $0.6 million for the second quarter from $0.2 million for the same period in 2021 following the addition of the centers installed in the second quarter. We achieved a gross margin of 63% in the second quarter of 2022, slightly lower than the 67% gross margin recorded in the second quarter of 2021. The decline in gross margin was mostly due to an increase in overhead expenses and obsolete reserves. Research and development costs were $2.3 million in Q2, compared to $2.1 million for the same period in 2021, an increase of $0.2 million or 8%.\n\nThis increase was due primarily to increase in product development of $0.1 million, resulting from our efforts to expand the applications of our technological platforms. Sales and marketing expenses were $2.2 million for the second quarter, compared to $1.6 million for the same period in 2021, an increase of $0.6 million or 38%. This increase was due primarily to additional personnel costs of $0.3 million as we expand our clinical team. Additionally, our travel cost and marketing activities increased $0.1 million each in the quarter.\n\nGeneral and administrative expenses were $3 million in Q2, compared to $2 million for the same period in 2021, an increase of $1 million or 51%. This increase was due primarily to increased share-based compensation of $0.5 million and increased personnel costs of $0.4 million, both attributed to increases in headcount. Net interest expense in the second quarter was compared to $0.2 million for the same period in 2021 due to the conversion into equity of two tranches of convertible debt in May 2021 and November 2021. In the first half of the year, our operational cash burn was $9.3 million.\n\nSimilar to many of our peers, we continue to face a challenging supply chain environment that occasionally requires us to deploy more capital near term to solidify vendor supply. Despite these issues, we continue to expect a step down in operational cash burn in the second half of the year and remain confident that we are well capitalized to achieve our mid- and long-term growth ambitions. With respect to our cash position, we finished the quarter with cash and short-term investments of 41 -- 45 -- sorry, $45.1 million, compared to $54.1 million as of December 31st, 2021. As interest rates have picked up over the prior months, we have shifted some of our liquidity position to be in the form of six-month and one-year U.S.\n\ntreasury bills to capture some yield from the market. At this point, I'd like to turn the call back to Joe.\n\nJoe Burnett -- Chief Executive Officer\n\nThanks, Danilo. The second quarter of 2022 was another record quarter for ClearPoint as we executed against our four-pillar growth strategy and continued to pave the way for future success through new product milestones and development. This included the hiring of talented professionals across multiple functions, bringing our total direct employee count to just under 100. Our team, however, feels much larger when you consider the support and teamwork we received from our multiple pharma, biotech, and device partners.\n\nLet's break that progress down into our four growth pillars. First, our biologics and drug delivery team continued to add additional partners and services in the second quarter, adding multiple new partners to our accounts, which is now over 45 active partners in the space, and keeping pace with our past two years of history, adding approximately one new partner every month. Arguably, our biggest milestone in the past three months was our partner, PTC Therapeutics, being granted market authorization by the European Commission for Upstaza, a gene therapy product for the treatment of AADC deficiency. Our multiyear strategy has played out as expected where the labeling for Upstaza includes reference to our SmartFlow Cannula explicitly in the summary of product characteristics as the only infusion cannula to be used for infusion of this gene therapy.\n\nTo say it another way, the very first marketed gene therapy ever approved for direct infusion into the brain can only be administered with our device. We believe this approval, along with the exhaustive bench, preclinical and clinical testing required for submission is a sign of things to come for our more than 45 partners that could see a similar path to approval. Our goal for our SmartFlow family of cannulas products is to be referenced in the labeling for therapies across multiple partners and indications so that ClearPoint is the go-to delivery mechanism for pharma delivery to the brain and spine. As a reminder, it is common that ClearPoint has redundancy in multiple directions.\n\nFirst, each partner is commonly working on more than one indication that their drug platform is targeted for. And second, we are diversified within each indication as well as we routinely have multiple partners working on the same indication. If one of these high-risk programs does not make it all the way to regulatory approval, we often have other partners pursuing treatments for the same patient population keeping our overall target addressable market intact. With the precedent set by this first approval, we expect that our current and future partners will be even more confident that our products and services are capable of achieving the device-related goals necessary to support the pharma industry.\n\nAn important milestone that is part of our global scale strategy is the achievement of MDSAP certification earlier this year. MDSAP allows the conduct of a single regulatory audit for our quality management system to satisfy the regulatory requirements of multiple countries, including Australia, Brazil, Canada, Japan, and the United States. Pharma companies are interested in supplying the entire world with these therapies, not just the U.S. and Europe.\n\nThis certification shows our pharma partners that we are making the investments to support their submission as a co-labeled device globally, which is an important priority for everyone involved. Moving on to pillar number two. Our functional neurosurgery navigation business expanded as well in the quarter despite headwinds from case cancellations and surgeon hospital movement. We continue to see demand for access to ClearPoint navigation, including our largest expected capital pipeline to date and four additional installs in the second quarter alone.\n\nNow as a reminder, during COVID, we placed a total of three new systems in all of 2021 and have now placed eight systems in the first half of 2022 alone. We expect these systems and additional systems placed in the second half of 2022 will provide a footprint for growth in 2023 and beyond. From a product development standpoint, we've continued to make progress across our portfolio, although we have made a few changes in prioritization to reflect the changing economic and supply chain environment. As Danilo mentioned, we have successfully secured supply and raw materials for our more mature products.\n\nHowever, securing test samples, electronics and new materials and services for development projects has been more challenging with lead times commonly four to five times historic level. Where possible, we have prioritized certain projects to make sure we are using our capital most effectively in the second half of 2022. Now we did receive FDA clearance for our array system and software, which is starting to be deployed here in the second half, including an upcoming webinar and working on white papers demonstrating the value of this new approach. We are also excited to share that we just received clearance for the first-generation Maestro segmentation tool, which we plan to embed into our live navigation system.\n\nSimilar to our other product launches, we will now start a limited market release here in 2022 and expect first commercial revenues for Maestro in 2023. Our 2.1 software that includes meaningful ease-of-use improvement, which we believe will enable some procedures at high-volume customers to be performed without on-site clinical support is on track for submission here in the third quarter and potential clearance before the end of the year or in the first quarter of 2023. Our Orchestra platform, MER platform, and Revolution robotic platform are continuing development, however, at a slower pace than before as we manage new vendor expectations and capital spending as required by economic and supply chain challenges. We will update timelines accordingly at the end of the year after assessing if these issues are resolved or if they persist.\n\nWe continue to support our brain computer interface partner, BlackRock Neurotech with the development of a custom hardware navigation solution and additional software and clinical services. We continue to expect first clinical use of this first-generation product in 2023. For our third pillar, therapeutic products and access devices, we have continued progress internally and through partnerships. Our neuro laser product in development with CLS is currently under review by the FDA.\n\nAnd -- we continue to expect our first clinical case to be performed this year, either as part of a U.S. limited market release or via an actively recruiting clinical trial in Sweden. Our MRI conditional power drill and development with adeor continues to make progress, and we plan to be prepared for a formal submission in 2023 with first clinical cases in revenue in 2024. Our biopsy products are continuing but have been deprioritized and are progressing at a slower pace to add certainty to the programs already listed before.\n\nIt is also important to note that the majority of our investment into the navigation system mentioned in pillar two applies to biologics and drug delivery as well. That is the beauty of our platform strategy as much of the investment is applied across many indications, including biologics, DBS, laser, biopsy, brain computer interface, and perhaps even others in the future. This is crucial from a training standpoint as well. Every biopsy case, laser ablation case or DBS case that a hospital does with ClearPoint today, is, in fact, training and preparing them to do biologics and bring computer interface cases in the future.\n\nFinally, our fourth pillar of achieving global scale has made progress as well. In addition to receiving MDSAP and EU MDR certification earlier in the year, we have placed additional systems in Europe to expand our global footprint and prepare for future drug delivery trial enrollment. As Danilo mentioned, A significant portion of our cash burn went toward working capital, including prepaid inventory and expenses and raw material and component purchases. We believe some of these inventory purchases will start to slow down here in the second half which will, in some ways, be offset by inventory of new products, for example, laser systems to support the limited market relief.\n\nIf you add up the global opportunity across all of our current and future product lines, the results are actually quite impressive. Today, we are actively working directly or through partnerships on more than 35 different indications, which is estimated to include more than 1 million new patients diagnosed each year in the United States alone. If those 1 million-plus patients were all treated with ClearPoint enabling technology, the potential market is in excess of $12 billion annually. These markets, of course, will take time to develop, but the sheer number of partnerships and opportunities we have today diversifies ClearPoint in a way that many individual therapy technology companies cannot.\n\nWe have many ways to win and to positively impact a large number of patient lives. Importantly, in both drug delivery and device partnerships, we generally do not bear the expense of the clinical trials themselves, which allows us to maintain a limited and consistent operational burn. At this point, we are reiterating our full year 2022 revenue guidance of between $21 million and $22 million, which corresponds to annualized growth between 30% and 35%. With that, I would like to open the call up to any questions.\n\nOperator\n\nThank you. [Operator instructions] And our first question comes from Frank Takkinen from Lake Street Capital. Go ahead, Frank.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nHey, Joe and Danilo. Thanks for taking the questions and congrats on all the progress. Wanted to start with a question around the PTC partnership. I'm just curious if you could bring us a little bit deeper into how that product will be commercialized and a little bit more directed.\n\nIs this a kitted product? Or is this a separate commercial sale for the therapy itself and the cannula itself? Just trying to understand how demanding this will be for you or if it's more of a hands-off process now that the therapy is on the market?\n\nJoe Burnett -- Chief Executive Officer\n\nThanks for the question, Frank. Yes, this is definitely going to be a hands-on process for us. So we will be involved in many different ways. There's effectively three products or services that we provide as part of the commercialization for this.\n\nThe first one is the product that's actually co-labeled with, Upstaza, the drug itself, which is the SmartFlow Cannula. That strategy can actually change geography by geography. But the way that we're starting today is that we actually provide the product or the cannula to PTC and then PTC, in turn, provides it to the site itself. So you can think of it as kind of like a kitted product in that side -- from that standpoint.\n\nThe second product is the navigation itself, which is not listed in the label itself. Part of the reason is because this is a new product and a new process. But part of the reason is that, remember, Upstaza is designed for pediatric patients, and in many cases, these patients historically had not been treated under MRI guidance because some companies and physicians are reluctant to mix the drug with MRI visible fluid. So if you can't see the infusion the emphasis of seeing and performing that procedure under MRI guidance is not quite as strong.\n\nSo we are not listed for the navigation side there. So it becomes a decision from a hospital standpoint in how they want to treat the patient. So in some cases, they might use operating room navigation to deploy the drug and the SmartFlow Cannula in the OR under CT guidance or optical navigation, or in some cases, the hospitals can choose to do it under MRI guidance using ClearPoint, in which case we would sell the ClearPoint Navigation directly to the hospital. And as you saw, there are a number of European hospitals getting ready for this launch, which is part of the reason that there's been demand for our placements in Europe.\n\nAnd then the third part of the product solution is really the services that we provide to PTC in effect that we are going to be trained on the delivery of the drug as well as far as setting up the infusion pumps, working with pharmacy so that in the future, down the road, PTC will not need to be present at every single one of these procedures. They've effectively hired us to be someone that can kind of deploy that part of the procedure for them. So in effect, there's kind of three different buckets of potential value that we're providing to these procedures. And as you can imagine, we're going to be very, very hands-on throughout this process.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nOK. That's really helpful. Maybe just one more on the broader biologic and drug delivery business in the category of a success be gate success, how has this impacted conversations with other partners who are current partners as well as potential partners in the funnel debating whether or not they should sign up with ClearPoint as their therapy partner on a go-forward basis?\n\nJoe Burnett -- Chief Executive Officer\n\nYeah. I think it's built quite a bit of credibility in two different ways. The first is the product readiness itself. I believe that we're the only cannula or catheter for brain infusion that's approved in both the United States and Europe and is now underweight or under review in other geographies as well.\n\nSo the fact that our dossier, our portfolio, our bench data, toxicology data, all of that was able to pass the muster as part of a combination device here, I think, absolutely says, if it's a pharma company in a situation to say hey, do I use the company and the SmartFlow Cannula that's actually been successful in getting approval? Or do I roll the dice with something that maybe doesn't have that level of data and certainly not that level of clinical experience? So I think that certainly helps. And then the second part that I think helps build credibility is we've done exactly what we said we were going to do. So folks that have been working with us and listening to our strategy and hiring us as regulatory consultants over that period of time, everything that we've said playing out has, in fact, played out. So I think that gives us -- it gives them confidence in our team as well that the expertise and the services provide can you get them the results that they're looking for.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nOK. That's great. Then maybe just one more for me on the capital equipment side. Congrats on another great quarter there.\n\nI think you alluded to the potential for some additional placements in the second half in your prepared remarks, but maybe could you just restate that and take us a little bit deeper into your expectations for capital placements in the second half of 2022.\n\nJoe Burnett -- Chief Executive Officer\n\nYeah. I think we continue to see interest. We continue to negotiate with hospital IT departments that end up being the biggest barrier for good reason in many cases. But we do continue maybe not quite at the same pace in the second half, but certainly, those installations to continue in Europe and Europe in the United States and then potentially in a couple additional geographies as well.\n\nSo without getting too far into numbers, I'd say probably at least another four additional units and potentially more that are installed. They might not all translate into capital sales this year. As it's very common that we have a three-month or potentially longer evaluation period. But again, our priority is installations themselves to get them using the product to get them sort of and having that aha! moment on the value of MRI guidance.\n\nSo installations are our priority versus chasing down the revenue on a quarter-to-quarter basis.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nGot it. OK. That makes sense. Thanks for taking my questions and congrats again on all the progress.\n\nJoe Burnett -- Chief Executive Officer\n\nThanks, Frank.\n\nOperator\n\n[Operator instructions] Our next question comes from Marc Wiesenberger from B. Riley. Go ahead.\n\nWilliam Wood -- B. Riley Financial -- Analyst\n\nThank you. This is actually William Wood on for Marc today. Really nice looking quarter you had there. Congratulations on everything.\n\nWe've got a couple of questions here. First one -- absolutely. And then the first question here is kind of a multipart. So with regards to PTC's EU approval of Upstaza and the SmartFlow Cannula being written into the protocol as a cool label device, what in your mind would impact the decision after PTC submits a BLA in fourth quarter? And then can you talk about any explicit directives related to the navigation platform more broadly in the EU decision and how many other options and how easy it is to use another navigation platform with the SmartFlow Cannula? Or is it more implicitly tied and restrictive of other platforms? And then finally, based on what you've seen thus far, how has your expectations in terms of the navigation system being explicitly called out in the FDA protocols? And then I've got a couple more.\n\nJoe Burnett -- Chief Executive Officer\n\nAll right. Let me try and track through one at a time. So I think the first question was around the PTC BLA submission here in the United States and do we believe that FDA could follow the same precedent that you have now said? I believe that is the plan, I would say, Again, nothing has ever been approved at least for a neuro infusion in the U.S. So this will be the very first one.\n\nWe have to take that caveat. But what I can tell you is that the level of testing that has done specifically with the drug interaction with our cannula on the bench, in preclinical testing, in clinical testing, in workflow analysis, time and motion, all those types of things has not been replicated with any other devices. So there's no reason to believe that the initial strategy would not do exactly what we attempted to do in Europe. Now whether the FDA agrees with that at the end and is more open to any devices or specifically our device, which has been provided with all of the backup testing.\n\nI would say it's more likely that it should follow the same path as the EU. So that's kind of our thoughts there. And we're excited. I believe PTC is expecting a submission toward the end of this year, which could put 2023 on the map as a potential FDA decision.\n\nThe second question, I believe, was around navigation relative to PTC in Europe or elsewhere. And I touched on that a little bit. But again, one of the things to consider is that when you're doing a procedure, I believe Upstaza is designed and labeled in Europe, for 18 months of age or older. This is an undeveloped brain with a lot of work to still do in the development stages.\n\nSo putting a few foreign agents into that brain as possible. It's certainly a priority and a thought of many companies. That's very different from an 80-year-old Parkinson's patient, for example. So what's commonly used in our procedures is that the drug would be mixed with something called gadolinium, which is a contrast agent, which allows you to see it right as a day on the MRI scheme.\n\nSo you're looking at the gadolinium and where the gadolinium infuses you make the assumption that the drug is there with it. So in these particular cases, MRI guidance is not as essential as it is for some adult procedures because, again, the drug is not mixed with gadolinium to remove that from the equation. So the argument can be made is that if your target is large enough and you're only doing one infusion and it's a pediatric patient, that it doesn't necessarily need to be done in the MRI because you could hit the target, in this case, the putamen in the operating room as well, OK? So in those cases, as you look at how ClearPoint will be involved, today in an operating room procedure, our cannula, the SmartFlow would be used in those procedures. Our clinical support team would be present in those procedures as well.\n\nAnd in the future, as we've discussed earlier, we do plan on evolving into the operating room. We're making that investment to have an operating room navigation system as well. So when that becomes available, it's very likely that many of these PTC cases would be done using that system as well. So that's kind of the difference of this specific approval and where navigation fits in.\n\nNow moving on to your third question, which is, well, what about everything else? What about the other partners? What about adult procedures that have gadolinium mixed in. What about procedures that have three, four, five, six different trajectories that are much more smaller targets. There, the MRI guidance actually provides quite a bit of value, not just being able to watch the infusion, but to be able to make sure you choose the safest path, to make sure you don't kick a vessel and cause a hemorrhage on the way in to make sure you hit that very, very small target. And that's why a number of our partners have decided to use ClearPoint as part of their clinical trial protocol, which is different than what the original PTC data was collected on.\n\nSo in those cases, the FDA or a European notified body has three choices. They can go to the company and say, \"Sure, we're going to give you an open label where you can use every single navigation possible.\" That could be a result. Another result is they could say, \"Well, every single one of your patients enrolled clinically was done using ClearPoint. Until you show us you can do something different than that, we want to demand ClearPoint as part of that label as well.\" or they can kind of meet in the middle.\n\nAnd they can say, \"Well, we're not going to call out ClearPoint navigation by name, but you did them all under live MRI guidance. So we are going to demand MRI guidance.\" And that would be just as valuable for ClearPoint because again, we're the de facto standard in the MRI. So there's still a number of different ways that, that can play out and work that can be done. From our standpoint, we just want to install our system in as many of these centers of excellence as possible.\n\nget people using it today for biopsy for DBS or laser ablation so that we're prepared when -- if and when these drugs achieve their regulatory significance.\n\nWilliam Wood -- B. Riley Financial -- Analyst\n\nRight. Makes a lot of sense. I appreciate that extra color there. So regarding the commercial launch of Upstaza, I believe PTC has talked about aspirations of creating a commercial footprint across more than 50 countries.\n\nCan you talk about your expectations in terms of the number of centers of excellence ultimately needed to accommodate that growth? How far along you are and maybe a timeline of reaching that goal?\n\nJoe Burnett -- Chief Executive Officer\n\nYeah. I mean, I can tell you, we have active conversations with PTC globally, and there's a constant sort of calculus that goes into it, which is in any individual country, first and foremost, what is the regulatory pathway? How easy is it to get the drug approved? Do they follow the FDA? Do they follow CE mark? Do they have some sort of hybrid? Or do they have their entirely owned pathway? So that's one thought is how expensive is it to get the drug approved? Same exact question for how expensive is it to put our entire program in there, the navigation, the cannula and get that approved as well through distributorships and things like that. So first, we start with the regulatory challenge. And then we balance that against the cost of a plane ticket and the ability to negotiate patients that can travel from state to state or country to country to have the procedure paid for and reimbursed in another country.\n\nAnd based on I can't tell you if it's going to be 50 countries or if it's going to be 15 or if it's going to be 75. At this point, we're still walking through that strategy. But again, the most important first step was CE mark, which allows PTC in particular to start having those conversations where -- is it better to treat a patient in Germany or in France? And is it even possible to bring them across borders based on different payment schemes? So a lot of work still to be done there. But again, as being a good partner and a service that we hope to provide to our pharma partners, if they have the resources to help us achieve that clearance, then we're going to go ahead and help them pursue it.\n\nAn example is we are going through the process to get our -- all of our devices approved and installed in Brazil as we speak, where there is a higher concentration of these patients that -- these children that have AADC deficiency and that's a priority target for Brazil -- I mean for PTC rather.\n\nWilliam Wood -- B. Riley Financial -- Analyst\n\nExcellent. I really appreciate that answer. So sort of thinking beyond traditional applications. We've seen a lot of increase lately of research related to neurosurgery procedures, especially as DBS for depression, OCD, alcohol use disorder as well as lit for treating new and current glioblastomas.\n\nCan you talk about how you think about these emerging applications and anecdotal examples you've seen thus far? And ultimately, how you think it can change the trajectory of growth in these types of procedures in the near and medium term relative to the historic growth rates?\n\nJoe Burnett -- Chief Executive Officer\n\nYeah. I think that the excitement around future device applications is very similar to biologic application, whether it's, as you said, OCD or severe depression or stroke rehabilitation. There's some really massive markets out there. Everything that BlackRock is looking at for bring computer interfaces and hearing loss and whatnot.\n\nSo there's a ton of opportunities there, but many of them are very much early stage that also have some alternative treatments available. So in the case of PTC, getting approval relatively quickly is possible because there's no alternative for these children versus hearing loss and stroke rehabilitation. There are other things in the work. So before the FDA approved something or CMS reimburses it, you're really going to have to prove it.\n\nSo many of these things are still early stage but have massive total addressable markets as well. You could make the argument that on the device side of things, it could move a little bit faster because the device is arguably better known than some of these biotech agents that are going into the body -- and in a worst-case scenario, it could be removed where removing the drug agent is not possible. But again, I think that's kind of more in the noise as opposed to a meaningful difference between the two. But from our standpoint, we're equally excited because our platform does the same thing across both approaches.\n\nWe're either taking an electronic lead or an implant to a target or we're tracking our drug catheter to a target to infuse it. But again, the software, the workflow, the team doing the delivery, the customers, the neurosurgeon making these implants and infusions, they're all the same person. So we believe that, that sort of intimate relationship we have with that space and that reliance on our platform will only get stronger.\n\nWilliam Wood -- B. Riley Financial -- Analyst\n\nThat makes a lot of sense. And then one last question, and then I'll let you go. Can you talk about the environment for your BDD clinical services, how the pipeline has been building, and the visibility you have going out? And maybe how much has already been contracted versus the need to still in -- sorry, to still sign agreements.\n\nJoe Burnett -- Chief Executive Officer\n\nYes. It's one of the businesses we're the most excited about. It's now the fastest growing. It's the largest segment if you will.\n\nSo it's a place that we're continuing to invest. I can tell what's maybe changed in the economic climate and the cost of capital recently has led us to focus a little bit more on ensuring the revenue is there before we hire as opposed to the field of dreams kind of if you build it, they will come sort of thing. So we're a little bit more thoughtful in the way that we do things there. But I can tell you, we absolutely plan to continue hiring people in the second half.\n\nWe have, I think, three additional biologics and drug delivery, people sort of headcount open right now that we're recruiting for. So I can tell you, we're only doing that because we expect further growth in that space. And to the other question about contract, the way contracts generally work is we would sign a master service agreement with a partner. This is normally essential from a compliance standpoint with pharma and supply chain standpoint, they don't want to work with us unless we can kind of guarantee them supply for decades.\n\nThey want to make sure that if they put their eggs in our basket that we're going to be around and that we can guarantee supply and have redundancy and things like that before they make the investment. So we start with an MSA of some kind. And then we build statements of work on top of that. And in some cases, we could have two or three statements of work in parallel.\n\nIn some cases, it's more in series where their project doesn't move to the next stage until the first project is done. So it's -- I wish I could give you -- this is how it always fits, but it really is evolving, and it's all over the place today. We're just -- we just try to be flexible and create new services when we need to because there's kind of an absence of some of them today.\n\nWilliam Wood -- B. Riley Financial -- Analyst\n\nGreat. I appreciate that. That was a really nice, helpful answer. So I'll leave it there again.\n\nCongratulations on the very nice quarter and thank you for taking our questions.\n\nJoe Burnett -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd that appears to be the last question at this time. I would now like to turn it back to management for any closing remarks.\n\nJoe Burnett -- Chief Executive Officer\n\nThanks, Kat. And once again, thank you to everyone interested in being a part of our team's journey here at ClearPoint. We recognize the challenging global environment that we are all forced to live in today, and we assure you that we are going to help patients around the world as best as we can by keeping our heads down, staying focused, and executing against our strategy to develop products that truly improve the quality of life for our patients and their families. As management, we will react quickly and thoughtfully to future challenges, which we realize are always around the corner.\n\nGood night, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJoe Burnett -- Chief Executive Officer\n\nDanilo D'Alessandro -- Chief Financial Officer\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nWilliam Wood -- B. Riley Financial -- Analyst\n\nMore CLPT analysis\n\nAll earnings call transcripts"
}