{
  "companyName": "Repay Holdings Corporation",
  "companyTicker": "RPAY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/repay-holdings-corporation-rpay-q2-2022-earnings-c/",
  "content": "Repay Holdings Corporation (RPAY 0.50%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to today's earnings conference call being hosted by Repay. With us today are John Morris, co-founder and chief executive officer; and Tim Murphy, chief financial officer. During this call, we will be making forward-looking statements about our beliefs and estimates regarding future events and results. These forward-looking statements are subject to risks and uncertainties, including those set forth in the SEC filings related to today's results, as well as in our most recent Form 10-K filed with the SEC.\n\nActual results may differ materially from any forward-looking statements that we make today. The forward-looking statements speak only as of today, and we do not assume any obligation or intent to update them, except as required by law. In an effort to provide additional information to investors, today's discussion will also include references to certain non-GAAP financial measures. Reconciliations and other explanations of those non-GAAP financial measures can be found in today's press release and in earnings supplement, each of which are available on the company's IR site.\n\nI would now like to turn the call over to Mr. Morris. Please go ahead, sir, you may begin your presentation at this time.\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nThank you, operator, and good afternoon, everyone. There are three subjects I will be covering on today's call. First, I'll briefly review our Q2 results and business updates; second, provide color on our current trends and what we're expecting for the rest of the year; and lastly, discuss our medium-term vision for the business. First, on the second quarter, we reported card payment volume growth of 34%, total revenue growth of 39% and gross profit growth of 42%.\n\nOrganic gross profit growth in the quarter was 10%. We view these as solid results in light of the increasingly uncertain macro environment. We continue to see strength in our B2B payments business during the quarter. This strength is driven by secular tailwinds, including the digitization of business payments, as well as the need to find more efficiencies now that many U.S.\n\nbusinesses are implementing hiring freezes. This has been aided by our focus on our B2B go-to-market strategy, which is partially through our direct sales team, which continues to expand, as well as through our 85 software integration partners. Also importantly, our supplier network has grown to 135,000 vendors. We continue to be at the forefront of B2B innovation, including our offering for both AR and AP.\n\nIn fact, we were recently honored at Premier Inc.'s 2022 Breakthroughs Conference with the Supplier Horizon Award within the Purchased Services Category. We experienced strong business development quarter in the consumer payments side of our business. We continue to succeed in the credit union space, reaching 225 credit union clients. One of our new partners in this space is Q2.\n\nMany of you know Q2 Holdings, which is a leading provider of digital transformation solutions for banking and lending. This integration means that Repay will be able to offer its payment technology within Q2's digital banking solution, as well as leverage Q2's integrations with various core systems, further expanding our reach within the personal loan and credit union verticals. Credit unions have been able to differentiate by maintaining lower rates, gaining share in this new operating environment. So they have continued to be a focus of ours from a business development standpoint.\n\nWe also experienced another record quarter with our Instant Funding product. Our second quarter 2022 instant funding volume was approximately 50% ahead of Q2 2021. We believe this will be another way to influence our more digital card-based repayment transactions, as the repayment method on file is a debit card. In fact, one of our largest lending clients just told us, they love instant funding, and their goal is to replace all checks in the branches with Instant Funding.\n\nAnd while we continue to be excited about addressing the large and underserved consumer lending opportunity, personal lenders are giving a mixed near-term outlook in terms of consumer loan demand and credit performance. In Q1, most market participants indicated that demand was accelerating toward or above pre-COVID levels. The momentum seems to have slowed over the past few months, depending on which part of the borrower credit spectrum that lenders ultimately serve. Given these factors, we expect the recovery to pre-COVID levels in the personal loan market will take longer than we originally anticipated.\n\nWhile our auto lending clients have held up well and auto lending demand is strong, the market remains supply constrained and used car prices are still elevated, leading to affordability concerns. That said, our clients have long-duration auto loan portfolios. So we have robust non-discretionary and highly recurring payment streams to process. We continue to see an exciting opportunity in this very large vertical that is now fully embracing digital payment solutions.\n\nLastly, REPAY Clearing & Settlement, or RCS, continues to perform nicely with a significant pipeline for future growth. We officially and successfully completed the back in conversion of BillingTree to RCS. We're starting to realize these synergies and generally have more control now that our systems are unified. In addition, we recently brought on Mike Cottrell to lead our efforts for the RCS business.\n\nWith the increase in demand for more innovation and flexible third-party processing solutions, and his extensive background of working with PayFacs, gateways and payment platforms, Mike is well equipped to help us accelerate the growth of our Clearing and Settlement solutions as we expand into additional payment modalities and networks. Now to move on to my second topic, the second half of this year. Tim will go into more detail shortly, but we have updated our expectations for the remainder of the year based mainly on trends we are seeing. First, for our consumer payments business.\n\nAs I just mentioned, with varying degrees of expected client loan growth for the personal lending business, we felt that it was prudent to update our outlook for the year. To be clear, though, we continue to believe that the majority of our personal lending clients will achieve pre-COVID levels of loan growth in the coming quarters due to increased demand for consumer credit, which is derived from elevated consumer spending, drilling savings and no further seamless plan. In addition, the majority of our clients do not have funding constraints and are diversified across credit types, all of which are important during these dynamic economic times. As for our B2B business, year remains strong.\n\nOur customer base on the B2B side is mostly medium to enterprise businesses, who are looking to find efficiencies and other ways to generate revenue in the inflationary environment, and our solutions provide just that. We also continue to have confidence that our AP Media vertical will ramp significantly in the second half of the year. Just to further explain our media business, our clients are seeing payments to suppliers for political ads. So when you see political ads on TV, it could be our client that is the agency working on behalf of that candidate.\n\nFor the first six months of this year, we processed significantly more than our original forecast, and we on pace with the amount we processed during the first half of 2020. The agencies with whom we are currently working represent an impressive lineup of the most well-funded candidates, PACs, and party committees. Now I'd like to turn to our medium-term vision. We know that next year is on investor minds.\n\nAnd while our planning for 2023 is very preliminary at the moment, we feel confident in mid-teens organic growth, even during a recessionary period, which further exhibits our confidence in durable growth at Repay. This expectation is due to our large, diverse underpenetrated end markets and our vast distribution network of 230 integrated software partners that we have spent over a decade building. This is also supported by secular tailwinds. As we've always said, the secular trends toward frictionless digital payments will not go away in any macro environment and will continue to be a tailwind that will drive our business for years to come.\n\nThis is evidenced by a new survey of American adults commissioned by OnePoll, which finds that digital payment options remain key for consumers paying off personal and auto loans. This continues to support our core value proposition that we provide integrated financial technology solutions, which allow our clients to be paid anywhere, anyway, anytime. Also, as I'm sure many of you heard, Visa reported that second quarter debit spending was significantly above pre-pandemic levels. Net debit has also benefited from accelerated cash digitization.\n\nThese are all trends from which we pay benefits. As always, our focus is on sustainable, durable growth with strong unit economics. To do this, we look to further increase our card penetration across all verticals with top clients. We continue to expect the majority of our growth to be derived from our existing client base, which is generally comprised of scaled and highly integrated clients.\n\nWe continue to also focus on optimizing our processing infrastructure in order to reduce costs as we grow volume. The BillingTree to RCS conversion is a great example of this. We're also developing the best software and payment solutions for all verticals. One of our many moats continues to be targeted new product solutions that easily differentiate us from competitors and help us win new clients.\n\nWe're able to do this efficiently by replicating our current tech platform and are optimizing product development for near-term revenue. Lastly, we are laser focused on thoughtful capital allocation. During the quarter, we implemented our share repurchase program and have been buying back shares in a disciplined way. We believe that this repurchase program will not inhibit our growth strategies based on anticipated free cash flow for years ahead.\n\nLastly, we're always on the lookout for strategic M&A opportunities to enhance our overall scale, market competitiveness and organic growth runway. With that, I'll now turn the call over to Tim to review our second quarter results in more detail. Tim?\n\nTim Murphy -- Chief Financial Officer\n\nThank you, John. Now let's move on to our Q2 financial results before I review our financial guidance for 2022. As John mentioned, in the second quarter, Repay delivered solid results across all of our key metrics. Card payment volume was $6.2 billion, an increase of 34% over the prior-year second quarter.\n\nTotal revenue was $67.4 million, an increase of 39% over the prior-year second quarter. This represents a take rate of approximately 109 basis points, which as discussed previously, is back to levels shown prior to Q1 2022. BillingTree, Kontrol, and Payix contributed approximately $14.2 million of incremental revenue during the quarter. Moving onto expenses in the quarter.\n\nOther costs of services were $16.7 million, compared to $12.7 million in the second quarter of 2021. Incremental other cost of services from BillingTree, Kontrol and Payix were $2.6 million for Q2. Gross profit was $50.7 million, an increase of 42% over the prior-year second quarter. On an organic basis, we saw gross profit growth of 10% compared to the second quarter of 2021.\n\nNote that we exited the quarter at 11% in June and see stronger trends into July. SG&A was $39.1 million, compared to $29.5 million in the second quarter of 2021. Second quarter adjusted net income was $16.1 million or $0.17 per share. Lastly, second quarter adjusted EBITDA was $27.6 million, an increase of 35% over the prior-year second quarter.\n\nSecond quarter adjusted EBITDA as a percentage of total revenue was 41%. We are prudently managing hiring and other non-personnel expenses due to the current environment. So we expect adjusted EBITDA margins to be higher in the second half of 2022, while remaining focused on putting in place the proper infrastructure for accelerated organic growth throughout 2022 and beyond. Combined pro forma net leverage is approximately 3.5 times.\n\nWe expect this to be below three times by the end of 2022, a very comfortable level, which will allow us to continue to fund organic and inorganic opportunities. Please recall that of the $460 million of total gross debt, $440 million of this is convertible with a 0% coupon and 40% conversion premium. This convertible debt does not mature until February 2026. As of June 30, we had $60 million of cash to the balance sheet and access to $165 million of undrawn revolver capacity for a total liquidity amount of $225 million.\n\nSo we feel very good about our balance sheet heading into a potential downturn. Please note that we made a relatively large earn-out payment during Q2. Have we not made that payment, we would have ended the quarter with over $70 million of cash? As of June 30, we had approximately 100 million shares outstanding on a fully diluted basis. Finally, moving onto our thoughts for the remainder of the year.\n\nBased on our first half results, as well as current trends, we're updating our guidance for 2022, which now includes volume to be between $25 billion and $26.3 billion, total revenue to be between $268 million and $286 million, gross profit to be between $204 million and $216 million and adjusted EBITDA to be between $118 million and $126 million. As John touched on previously, we continue to expect growth to ramp in the second half of 2022, driven mostly by our exposure to the AP Media vertical, which is expected to be positively impacted by the political cycle. This revised 2022 outlook assumes organic gross profit growth of approximately 14%. Again, we expect this growth to ramp in Q3 can be higher in Q4.\n\nWhile the current macro environment is highly uncertain, we feel confident that we understand the primary drivers underlying the verticals we serve, and we'll continue to keep a pulse on the moving pieces surrounding these industries, in order to effectively manage our business. I'll now turn the call back over to the operator to take your questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Ramsey El-Assal with Barclays. You may proceed with your question.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thanks for taking my question this evening. I wanted to ask for a little bit more details or color as you can provide on what you're seeing in the personal loan vertical. Is it originations that your clients are signaling, they're pulling back on? Or have customers also stopped kind of paying as much as they were? What kind of has led you to be a little bit more conservative there in terms of the forward look?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nYeah. So we -- basically, what we're seeing is there's still really strong demand, but we're seeing some lenders tighten their credit box just because they're also seeing a tick up in delinquencies and a decline in credit performance in some cases. So we think it's a good thing that there's demand and there's just varying degrees of tightening of underwriting standards. And so all of that has led to us just taking a closer look at the outlook and taking those dynamics into account with what we've revised.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGot it. That makes a ton of sense. And then just a quick follow-up for me. On the mid-teens organic growth next year, can you help -- just update us on the algorithm there? How much do you expect the B2B business to grow? How fast do you expect it to grow relative to loan repayments for the rest of the business? And any granularity that you could provide on just the algorithm would be helpful at this point?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nYeah. And so we expect to exit this year at about 20% organic growth, but that includes the political media volume. If you exclude the political media volume, the exit rate will be above 15%. So we're going into next year with strong organic growth.\n\nWe still expect B2B to be growing north of 25%. We expect some normalization of the consumer lending business and consumer payments in general back into kind of the low double digits. And then we expect our RCS business to be growing as well, probably high-single digits to low double digits, all of that building up to the mid-teens outlook for next year.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nSuper helpful. Thanks so much.\n\nOperator\n\nOur next question comes from the line of Peter Heckmann with D.A. Davidson. You may proceed with your question.\n\nPeter Heckmann -- D.A. Davidson -- Analyst\n\nHey, good afternoon. Thanks for taking my question. I missed your comment on auto loans, noting long duration. Were you also seeing some pockets of increased delinquencies in certain credit tiers or are you not observing that yet?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nOur comment on duration is just that we have -- it's a very long existing book of business, six or seven years. And because of that, we just have highly recurring payment streams for quite a long time. So we have seen somewhat of a tick up in delinquencies and declining credit performance. But because the book of business is such long duration and it's so recurring, it's not having as big of an impact to us, as if were a personal loan, which is shorter duration, and you start to feel it more quickly.\n\nPeter Heckmann -- D.A. Davidson -- Analyst\n\nOK. You're just not as reliant on new originations in the auto loan side.\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nThat's right.\n\nPeter Heckmann -- D.A. Davidson -- Analyst\n\nOK. And then did you mention your mortgage business? I know not a huge percentage of revenue, but if you could give us an update on some of the trends you're seeing there?\n\nTim Murphy -- Chief Financial Officer\n\nYeah. So we didn't mention that on the call. I did not mention that on the call, but we've actually seen from that perspective, on the origination side, we probably will lean more toward on the servicing side as the majority of our processing abilities today. And obviously, we're trying to grow the origination side from an LMA perspective.\n\nBut ultimately, our processing side of that on the servicing side is actually growing for us as there's probably some in-sourcing of servicing that we're benefiting from there, but we didn't give any specific direction on the long-term outlook of that other than our existing customer base, it continues to grow and use more of our services.\n\nPeter Heckmann -- D.A. Davidson -- Analyst\n\nOK. All right. I appreciate it. Thanks.\n\nOperator\n\nOur next question comes from the line of Andrew Jeffrey with Truist. You may proceed with your question.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nHey, guys. Appreciate you taking the question tonight. John, I appreciate your enthusiasm for Instant Funding and the 50% growth. Can you talk about kind of what the trajectory is in Instant Funding? I know it gives you good light to debit repayments, especially in that personal loans product.\n\nIs that continuing to grow a lot faster than originations? I assume it is. And can that help you blunt some of the downturn or the less robust recovery in the personal loans market that you're talking about?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nYeah. That's a perfect example of -- you guys have heard us say before, sometimes even when the macro part of the market shifts around, we find that people use more of our tools, and that's a perfect example of someone many of our clients are starting to use our tools for the digitization piece of that. And that's obviously growing most for us, it's definitely growing faster than likely their originations are growing as we're seeing a shift to a digital transaction, that predominantly was either a cash check or even an ACH. And we're seeing, especially our largest clients shift to that experience because the consumer is demanding that.\n\nAnd what we have historically seen is the method of funding turns out to be the default repayment method, which -- that bodes well for us, if the debit card is used to fund their direct bank account, it's most likely to default repayment mechanism as well, which we see great demand. We've seen that for really a long time, and we continue to see the use of debit as repayment growing. So yeah, we do see that. We see that across multiple customers where that shift is happening.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nOK. It would be interesting to see how that affects your business in a more normalized demand environment. And then I guess just from a high-level perspective, given what's happening in the macro and given the shifting mix of your business that we've seen over the last couple of years, do you think it's time to increasingly emphasize from an incremental investment standpoint B2B? You've got a lot of exciting stuff going on there. I know the consumer business is core.\n\nBut I just wonder, as far as investment priorities, product development, go-to-market, etc., whether Repay in a year or two doesn't look more heavily like a B2B company? I just philosophically, just from an incremental investment dollar perspective, how would you encourage us to think about that?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nYeah. So from an allocation of capital, we still see that that is a fantastic opportunity for our shareholders to create long-term value there. The end market is there. There's still a go-get part of that.\n\nThat is large and enormous. We are allocating more capital there from a product and technology perspective as we're rolling those out to our various different integrated partners as well. So you would see us allocating more capital in that -- on that side of it. As we really have done some of that, if you look at our core allocation of capital, where we've purchased businesses in that particular business, and that's performing where our technology is superior to some of the things we see in the marketplace.\n\nYou'll see us grow that. You'll see us allocate capital there. So the answer to that is yes. One of the reasons it hasn't specifically outgrown the other parts of our businesses, the other parts of our business were growing fairly fast as well, with this macro scenario that we're talking about and the B2B is growing -- continue to grow at a fast pace.\n\nWe see that to being a larger part of our business as we move into the upcoming years.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nOK. So to be clear, you're allocating more internal capital as well as M&A?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nThat's correct.\n\nTim Murphy -- Chief Financial Officer\n\nAnd specifically, within B2B, we're allocating more capital to the AP side. And we're seeing a lot of growth there. Some of our recent announcements on ERP partners are now leading to very nice distribution paths and bringing us deals, and that's where we're spending a lot of resources.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nOur next question comes from the line of Timothy Chiodo with Credit Suisse. You may proceed with your question.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nGreat. Thanks a lot for taking the question. I think we touched on this a little bit earlier, but I think it's important to circle back on it. It kind of relates to Ramsey's question.\n\nYou had mentioned, Tim, I think everyone appreciates this. You mentioned the Q4 gross profit exit rate ex the media contributions and sort of the mid-teens aligned with the initial look at next year. But you made the comment that even in a recessionary scenario you think the growth could maintain that mid-teens growth. Maybe you could just add some additional context around what would be the offsets that would help the growth maintain that mid-teens even in a recessionary scenario?\n\nTim Murphy -- Chief Financial Officer\n\nYeah. So I mean, we talked a lot about durable growth. And what we're really talking about is a potential downturn. We think that there's probably greater adoption of our payment tools to facilitate repayments on these loans.\n\nAnd so if there is a situation where there's weakening credit performance, we think our customers would actually want to utilize our tools more and have greater penetration to help with that performance. And so I think that's a major offset. And I think there's probably a sweet spot where employment stays strong and maybe it's sort of a mild recession where there's still good demand and then there's greater adoption for our products and that could lead to us having really nice sustainable growth.\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nYeah. There are some great things we're doing on the product and features and functionalities that we're moving through our process and through our integrated partners that should bode well for growth -- long-term growth as well, but also the strength of our sales pipeline that's already there and the strength of our implementation pipeline of what we have sold this year that will flow through next year's growth.\n\nTim Murphy -- Chief Financial Officer\n\nAnd also, I'd say, Tim, B2B, we've diversified. And we think because we're serving more of a medium to enterprise customer in the B2B side, that's going to perform better in a potential downturn. We're not -- we don't have exposure to SMB. And we think if there is a downturn that may be impacted before medium to enterprise would be.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nExcellent points. Really appreciate that context, both John and Tim. A minor one as a follow-up around the B2B business, so on a much brighter note, to your point, B2B doing great. You also showed the supplier network continues to expand, which is another nice positive.\n\nWithin that supplier network, is there any change at all to call out? Or is it steady as she goes in terms of the mix of suppliers that are willing to accept virtual card versus those that might be beginning to opt for the enhanced ACH offering?\n\nTim Murphy -- Chief Financial Officer\n\nNot really a change. I think similar penetration rates. A lot of it is about the verticals we serve. And so we'll start to see more and more suppliers, for example, in auto dealerships or hospitals or property management, field services, and that's where you start to see the network effect of having those suppliers.\n\nAnd when we talk to new customers in those sub-verticals, having that supplier network that we can already address with them is very helpful. And so that's where we start to see more and more wins because when we look at their supplier database for a new prospect, and we already have them in ours, that allows for much greater penetration and therefore, a greater rebate to the customer, which is helpful in that discussion.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nAbsolutely. All right. Appreciate it.\n\nOperator\n\nOur next question comes from the line of James Faucette with Morgan Stanley. You may proceed with your question.\n\nJeff Goldstein -- Morgan Stanley -- Analyst\n\nHey, guys. This is Jeff Goldstein on for James. Just looking at the implied margin in your new guide, it's actually 50 basis points above that of the prior outlook. So maybe you could talk a little bit more about the managing expenses.\n\nI think I heard you mention in your prepared remarks and how that may offset some of the reduced operating leverage, you'd probably be getting from lower revenue.\n\nTim Murphy -- Chief Financial Officer\n\nYeah. So we -- you're right, the margin is a little bit higher, and we are managing both personnel and non-personnel expenses. We're trying to continue to focus only on hiring truly revenue-generating and revenue-supporting roles. That would be in sales, product and tech and then being very disciplined about that.\n\nAnd then on the non-personnel side, just scrubbing our expenses, making sure we're finding everything we can to put us in a position to have reduced opex going into the back half of the year and particularly into next year where -- if it were a downturn, we'd be set up for success from an opex perspective.\n\nJeff Goldstein -- Morgan Stanley -- Analyst\n\nOK. Got it. And then just a follow-up around pricing. I know in the past, you've mentioned 15% of your business is priced on convenience fees.\n\nSo how should we think about the like-for-like trend of those fees given the inflationary environment? Is that going up given the environment as contracts are renegotiated? How should we think about that? And maybe also just the outlook for take rate more generally into the second half of the year and into 2023?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nYeah. I think the best answer is it would be similar and maintain a similar trajectory unless there were some large win that would could move that percentage around some. But for the most part, it's two-sided. You've got the business side of the world who, by doing a convenience fee, it allows them to drive acceptance of that payment type with less impact on their financial.\n\nAnd on the consumer side, it gives them that option to make a payment through that particular channel. So we would say it, it would remain similar to where it is today.\n\nJeff Goldstein -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Andrew Schmidt with Citi. You may proceed with your question.\n\nAndrew Schmidt -- Citi -- Analyst\n\nHey, John. Hey, Tim. Thanks for taking my questions here. I want to go back to the discussion on personal loans.\n\nAnd apologies if I missed this, but perhaps you could just mention the expectation for personal loan growth that was embedded in the previous outlook versus the current outlook? And then just, John, I think you had some comments around this. But just the confidence that we have it pegged correctly now in terms of just what we can expect for the remainder of this year?\n\nTim Murphy -- Chief Financial Officer\n\nYeah. I mean, so we -- again, we expected the personal loan market to normalize more quickly than it has. We expected it to get back to probably mid-teens growth by the end of this year, and now that's looking more like high single digits to low double digits and then still with the expectation of that in a normalized environment, it could get back to that level. And so that's what we expected previously, and that's where we are today.\n\nAndrew Schmidt -- Citi -- Analyst\n\nOK. And then confidence that we're at the right level with a high-single-digit to low-double, or is that just more macro dependent in TBD, just curious on that assumption?\n\nTim Murphy -- Chief Financial Officer\n\nBased on what we know today, and we feel good about it, but it is somewhat macro dependent because, again, things are moving quickly.\n\nAndrew Schmidt -- Citi -- Analyst\n\nYeah. No, it makes sense. I saw the acquired revenue came down a little bit. Can you just talk a little bit about that, whether that's related to personal loan volume or something else that would be helpful?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nYeah. So the way we calculate that as an incremental revenue in the quarter and so there was actually -- in Q1, there was no BillingTree or Payix revenue in the prior Q1, but there was some BillingTree revenue in Q2. So this is just the incremental amount, which is why it came down, but the total amount of revenue would be similar. And so that's why -- there was.\n\nThere was some BillingTree revenue in Q2 of last year.\n\nAndrew Schmidt -- Citi -- Analyst\n\nGot it. That makes sense. I appreciate that clarification. And then if I could sneak one more in just on the B2B payments business, obviously, a good amount of secular growth there.\n\nBut if you look into the sub verticals, maybe this is a little bit adjacent to Tim's question, but is there any changes in terms of customer behavior just from more of a macro perspective, obviously, I would expect adoption to kind of step up during -- perhaps during periods of macro volatility as companies look to digitize. But on the other hand, obviously, economic activity can have impacts on B2B payments volume. Just curious if you're seeing anything in the -- in your merchant set to suggest any change in customer behavior?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nGenerally speaking, no major changes in customer behavior. We still think, it's wide open, and most of the conversations are competing against other forms of payment. We have recently experienced some competitive takeaways, which we think is encouraging, which shows the strength of our solutions. But again, most of the situations are where we're competing against other forms of payment.\n\nTim Murphy -- Chief Financial Officer\n\nAnd I would say, I was -- in the healthcare part of our B2B it has returned to what we consider normalized levels. So that's -- as we continue, but we do see strong demand for our solutions in the healthcare verticals.\n\nAndrew Schmidt -- Citi -- Analyst\n\nGot it. Thank you, John. Thank you, Tim. Appreciate the comments.\n\nOperator\n\nOur next question comes from the line of Bob Napoli with William Blair. You may proceed with your question.\n\nNoah Katz -- William Blair -- Analyst\n\nHey, this is Noah Katz on for Bob Napoli. Thanks for taking the question. You guys told us that you have $60 million in cash on hand. Just curious like what the appetite is for M&A and what the M&A pipeline looks like today, given that you guys have said that you have significant liquidity and you're currently managing your leverage.\n\nJust any color there would be great. Thank you.\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nSure. As you're aware, we do have our own corporate development team on staff. We have seen, I guess, last quarter call, we were waiting for the private world to adjust to the public valuations. We've seen some more normalization of that.\n\nWe think there's probably a little bit more to come there. We do have a healthy pipeline of things that we have visibility into. But as I've said as well, we will be prudent with our capital allocation. We also think that as a company, our own valuation is very attractive, which is why we activated the share repurchase program.\n\nBut we are seeing certain things in the market that could be very strategic at times. And we will be -- if it fits all of our attributes, as is something that we will heavily evaluate and see how we could possibly drive overall shareholder value. Knowing as well that we have -- we will also evaluate what's the highest and best use for growth capital.\n\nNoah Katz -- William Blair -- Analyst\n\nIf I could play off the B2B question a little bit, too. Because just in general, like with the B2B question, you guys have said it represents about 20% of the total revenue mix. I guess just if you could give us some more color on like the long-term strategy for the business and how you're going to grow it. That would be great.\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nSure. Yeah. So obviously, we -- as we continue to see, we said we'll continue to add our software -- integrated software ERP systems. There are several of those that are in our pipeline for additional ads and wins and partnerships.\n\nWe'll also continue to drive our AP/AR one-stop-shop solution inside of those. Then we'll continue to also drive our overall what I would call, sub verticals. As we -- as we've said, we do -- we've seen great success in auto and healthcare hospitals, as well as even some travel and entertainment and even in some servicing areas. So we'll continue to drive those relationships.\n\nThere may be some additional sub-verticals in the B2B space that we find, and we are seeing some opportunities in a couple of those sub-verticals. We'll continue to expand on our direct sales force and our business development teams. We think those are really good investments and they're paying nice dividends for us -- as far as new wins coming in our pipelines. Inorganically, if there's an opportunity for us to do something that's significant at proper valuations as a way to inorganically expand our overall team, expand our overall technology, expand some overall integrations, we would looked to potentially make some investments in that world, given the right scenarios there.\n\nWe do think that, obviously, long -- large addressable TAM, and we think that's for many years to come here. We are in the medium to enterprise level customer base. And so we still see significant opportunities there. Just really -- just whitespace where they're just never taken what we consider to be our total pay solution.\n\nThere may be some flavors of that in the marketplace, but really not a one-stop-shop. So we'll continue to grow that, expand that. As Tim said as well, it's really overall product technology and sales.\n\nTim Murphy -- Chief Financial Officer\n\nAnd to add to that, we do want it to be a bigger part of the mix, we're investing, like we said, another -- John hit on all the key points and I'd add to that. We really want to grow our supplier network. We've hired specialists on our team. We have a proprietary process for building out that that network that we think leads to higher virtual card adoption and penetration.\n\nAnd so building that out within these key sub verticals that John mentioned is also a big part of the strategy.\n\nNoah Katz -- William Blair -- Analyst\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Sanjay Sakhrani with KBW. You may proceed with your question.\n\nSanjay Sakhrani -- KBW -- Analyst\n\nThanks. Tim, you mentioned like during a recession, you do see more engagement with their product. I mean, is that what you've seen sort of historically in downturns?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nYeah, Sanjay. So we -- obviously, we've been doing this since 2006. And during that recession, which was a completely Ozondifferent job environment, completely different consumer balance sheet environment. We actually saw -- of course, we were growing rapidly in general, just driving debt at that level.\n\nBut overall, we saw where most of our financial institution lenders were really meeting the demand from the need for credit. So as long as that demand for credit is there, it usually finds a home, and then that ultimately drives some form of payment piece of that. What we have also seen, and we do see this because we're seeing it in some conversations already is the ability to take a real-time payment and drive that all the way into all the different channels. We see that happening.\n\nSo historically, we have absolutely seen it, and we think that will be the case as we move into a more -- maybe credit stressed economic environment. Ultimately, everyone wants to get paid back, right? And you make it the easiest way possible. And when you make it easier way possible, you get paid more often.\n\nSanjay Sakhrani -- KBW -- Analyst\n\n100%. I guess when we think about the B2B business, how do you think that behaves during a downturn? Is that fairly incubated? Or would it also see stress?\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nWell, we are serving the medium to enterprise level. And so hard to say something couldn't be. But from what we see is we're -- again, that's the digital shift that you're seeing. So the overall total pay solution really helps automate.\n\nIt really helps to create efficiencies overall. We actually think our conversations will uptick as people look for ways to generate savings. Our rebates will be credits back to an outsourcing solution. It's one of the best value propositions I've seen, right? You're going to outsource something and you're going to get a credit for doing that.\n\nAnd it just drives the overall reconciliation efficiencies back in and out of your ERP systems. Just we think the value proposition alone is going to continue to drive that for just its own merits. And if you look at our overall customer base, it shouldn't be and it's definitely in the medium term shouldn't be under any heavy stress from a macro environment. And the corporate balance sheets are obviously in great shape.\n\nSanjay Sakhrani -- KBW -- Analyst\n\nOK, great. Thank you very much.\n\nOperator\n\nLadies and gentlemen, we have reached the end of today's question-and-answer session. I would like to turn this call back over to Mr. John Morris for closing remarks.\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nYes. Thank you, everyone, for your time today. Really appreciate your questions. I just want to continue to say we'll continue to focus on our business on sustainable durable growth, as we've talked about, with strong economics.\n\nOur business is performing well, and it is strong. So thank you for your time, looking forward to speaking with you in person.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Morris -- Co-Founder and Chief Executive Officer\n\nTim Murphy -- Chief Financial Officer\n\nRamsey El-Assal -- Barclays -- Analyst\n\nPeter Heckmann -- D.A. Davidson -- Analyst\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nJeff Goldstein -- Morgan Stanley -- Analyst\n\nAndrew Schmidt -- Citi -- Analyst\n\nNoah Katz -- William Blair -- Analyst\n\nSanjay Sakhrani -- KBW -- Analyst\n\nMore RPAY analysis\n\nAll earnings call transcripts"
}