{
  "companyName": "Booking Holdings",
  "companyTicker": "BKNG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/booking-holdings-bkng-q3-2022-earnings-call-transc/",
  "content": "Booking Holdings (BKNG 0.59%)\nQ3 2022 Earnings Call\nNov 02, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to Booking Holdings' third quarter 2022 conference call. Booking Holdings would like to remind everyone that this call may contain forward-looking statements which are made pursuant to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not guarantees of future performance and are subject to certain risks, uncertainties, and assumptions that are difficult to predict. Therefore, actual results may differ materially from those expressed, implied, or forecasted in such forward-looking statements.\n\nExpressions of future goals or expectations and similar expressions reflecting something other than historical fact are intended to identify forward-looking statements. For a list of factors that could cause Booking Holdings' actual results to differ materially from those described in the forward-looking statements, please refer to the safe harbor statements at the end of Booking Holdings' earnings press release, as well as Booking Holdings' most recent filings with the Securities and Exchange Commission. Unless required by law, Booking Holdings undertakes no obligation to update publicly any forward-looking statements, whether as a result of new information, future events, or otherwise. A copy of Booking Holdings' earnings press release, together with the accompanying financial and statistical supplement, is available in the For Investors section of Booking Holdings' website, www.bookingholdings.com.\n\nAnd now, I'd like to introduce Booking Holdings' speaker for this afternoon, Glenn Fogel and David Goulden. Please go ahead, gentlemen.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nThank you, and welcome to Booking Holdings' third quarter conference call. I'm joined this afternoon by our CFO, David Gould. I am encouraged by the strong results we are reporting today and by the record level of travel during our peak summer season. In the third quarter, our customers booked 240 million room nights, a little under a quarter of a billion results, which was 8% higher than in Q3 2019.\n\nWe saw an improvement in room night growth during the third quarter from 4% growth in July to 10% growth in both August and September relative to the comparable months in 2019. We note that, sadly, the war in Ukraine continues. And as you know, we suspended our operations in Russia and Belarus routes shortly after the war began. If we exclude these suspended areas, as well as Ukraine, our room night growth for the quarter would have been 11%.\n\nWe are pleased that all of our major regions improved in August and September versus July. And room nights in Asia surpassed 2019 levels for the first time in September. In the U.S., both our placement and Booking.com brands continued to execute well and contributed to room night growth of almost 30% in the third quarter versus the third quarter of 2019. We continue to see very strong accommodation ADR growth, which helped drive a 27% increase in global gross bookings in the third quarter, or 41% on a constant currency basis, both versus Q3 2019.\n\nDespite the strong pricing environment, we have not seen evidence of our customers trading down to lower hotel star ratings or reducing the length of their trips. We took another important step in our company's recovery from a profitability perspective, with the third quarter being the first time that adjusted EBITDA surpassed pre-pandemic levels. In fact, the third quarter was our highest revenue in adjusted EBITDA quarter ever. Our Q3 revenue and adjusted EBITDA were 20% and 7% higher than Q3 2019 and grew 34% and 25% on a constant currency basis.\n\nMore recently, we have seen resiliency in the level of demand from travelers, with room night growth improving slightly from September levels to about 12% growth estimated for the month of October versus October 2019. Gross bookings in October are estimated to be up about 30%, or just over 45% on a constant currency basis. The slight improvement in October was primarily driven by the continued recovery in Asia, as well as a slight improvement in Europe. As we take an early look at demand into 2023 at Booking.com, we see strong growth in gross bookings on the books for travel that will take place in the first quarter of next year.\n\nNow, I know that a high percentage of these bookings are cancellable. Interestingly, we have strong numbers on our books for early 2023, despite the booking window being shorter than it was at this point in 2019. David will provide further details on our results and on the recent trends we have been saying. While there is widely concern around the macro-economic environment and uncertainty around consumer spending, we believe the sustained level of demand we have seen through October helps demonstrate our consumers' strong desire to travel.\n\nFurther, we believe our solid operating results, substantial liquidity, and strong free cash flow position as well to navigate potential near-term economic uncertainty while we continue to work attracting customers and partners to our platform and making progress on our key strategic priorities of payments and the connected trip vision. Given our confidence in the positioning of our business, the positive long-term outlook for travel and our strong balance sheet, we have stepped up the pace of our share repurchases since we reinitiated the program at the start of the year. With a $4.2 billion in repurchases for the first three quarters of this year, we have reduced our share count by 5% relative to our ending share count last year. We remain focused on building a better experience for our customers and addressing their needs of value, choice, and convenience.\n\nWe continue to focus on our customers. We aim to increase loyalty, frequency, spend, and direct relationships over time. We are encouraged to see our unique active customers at Booking.com above 2019 levels in the third quarter, which was driven by strong growth in reactivated customers who had not made a booking in over a year, as well as growth in repeat customers. Our mix of customers booking directly on our platforms reached its highest third quarter level ever.\n\nOur goal over time is to further increase our direct mix through several initiatives, including continued efforts to enhance the benefits of our Genius loyalty program, further building out our connected trip vision to increase engagement with our customers and driving more of our customers to download and utilize the mobile app. The mobile app is an important platform as it allows us more opportunities to engage directly with travelers. And ultimately, we see it as the center of our connected trip vision. About 45% of our room nights were booked through our apps in the third quarter, which is just over 10 percentage points higher than in 2019.\n\nBooking.com remains the No. 1 downloaded OTA app globally according to a third-party research firm, and we have seen increasing levels of downloads in the U.S. We will continue our efforts to enhance the app experience to build on the recent success we have seen here. We're thinking about addressing our customers' need for value.\n\nWe believe providing attractive prices on accommodations is very important. As has always been the case, our first priority, as we think about providing attractive prices, is to source competitive rates from our supply partners. We do this by working closely with our supply partners to get the best prices possible and increase participation in our targeted rate programs to ensure that compelling prices are available to our customers. Our Genius loyalty program at Booking.com is a great example of a program where hundreds of thousands of our property partners are participating to offer lower rates and other benefits to travelers in ways that meet our property partners' specific revenue needs.\n\nIn addition to sourcing competitive rates directly from our partners, we have built up our ability to selectively offer discounts and incentives at Booking.com over the last few years. This ability to merchandise is another lever that we can now pull as we look to deliver value to our customers' more competitive pricing. We believe this competitive tool helps us attract and retain customers and drive improved conversion on our platform. Importantly, we take a disciplined approach to merchandising by very closely monitoring the incremental return on investment on that spend.\n\nAnd we can adjust the level of our spend according to our desired return objectives. We have been pleased with the levels of incremental return we have seen this year for merchandising and will continue to selectively utilize this tool going forward. For our supply partners, we strive to be a valuable partner for all accommodation types on our platform by delivering incremental demand and developing products and features to help support their businesses. Alternative accommodation room nights at Booking.com grew about 11% versus 2019 and represented about 30% of Booking.com's total nights in Q3.\n\nWe've continued to make progress with our alternative accommodation offerings by increasing our supply base of properties, which has grown by about 300,000 since the end of 2021 and is increasing each of our major regions around the world over that time period. We aim to build on this growth in our alternative accommodation supply base by improving our product offering to our supply partners globally with a continued focus on the U.S. market. Let me now talk about the progress we have made in our interrelated strategic priorities of payments and the connected trip vision.\n\nOn payments, 40% of Booking.com's gross bookings were processed through our payment platform in the third quarter, which, once again, is our highest quarterly level ever. We believe Booking.com's payment services drive benefits for both our travelers and our supplier partners across hotels, alternative accommodations, cars, flights, and attractions. Furthermore, we believe that Booking.com's payment platform helps deliver a more seamless and frictionless booking experience, which are important elements of our larger connected trip vision. On connected trip, our long-term vision is to make booking and experiencing travel easier, more personal, and more enjoyable, while delivering better value to our customers and supplier partners.\n\nWe are expanding our offering into travel verticals other than accommodations, and then we will work to link relevant travel components together to provide a more seamless, flexible consumer experience. As a result of this initiative, we believe, over time, we will drive increases in customer engagement, share spend, and loyalty to our platform. We continue to make progress on building foundations of connected trip vision, including our work to integrate ground transportation options and further develop our flight offering on Booking.com. This flight offering gives us the ability to engage with potential customers who choose their flight options early in their discovery process.\n\nAnd over 20% of all of our flight bookings globally are new to Booking.com. There is much more work to do as we strive to give our customers the best possible travel experience. But we are pleased with the early results we have seen so far. In conclusion, I am encouraged by our strong third quarter results and the sustained levels of travel demand we are seeing into the fall and into early next year.\n\nWe continue to make progress in several key areas, including engagement with our app, the Genius program, our alternative accommodation offerings, payments at Booking.com, and building toward our connected trip vision. I believe these initiatives will help us deliver a better offering and experience for our customers and our partners. What continues to be uncertainty around the near term macroeconomic environment, we are as confident as ever in the long-term growth of travel and in the opportunities ahead for our company. I will now turn the call over to our CFO, David Goulden.\n\nDavid Goulden -- Chief Financial Officer\n\nThank you, Glenn. And good afternoon. I will review our results for the third quarter and provide some color on the trends we've seen so far in the fourth quarter. All growth rates for 2022 are relative to the comparable period in 2019, unless otherwise indicated.\n\nInformation regarding reconciliation of non-GAAP results to results can be found in our earnings release. Now, onto our results for the third quarter. In the third quarter, we were encouraged to see room night growth improved to 10% in both August and September, up from the 4% room night growth we've previously reported for the month of July. All regions improved in August and September relative to July.\n\nFor the full third quarter, global room night growth was 8%, with Europe high single digits; the U.S. up almost 30%; rest of world, up over 10%; and Asia, down mid single digits. September was the first month of room night growth in Asia versus 2019 as the delayed recovery continues in that region. And mobile apps represented about 45% of our Q3 total room nights, an increase of slightly over 40% in the second quarter.\n\nTotal mobile bookings represented over 60% of our total room nights in the third quarter, also an increase from the second quarter. In the third quarter, we continue to see an increasing mix of hotel room nights coming to us through our direct channel versus 2019 and also versus Q3 2019 and also versus Q3 2021. The international mix of our total room night in Q3 was about 45%, in line with Q2. Our Q3 cancellation rates continue to be below 2019 levels as they were in Q2.\n\nIn Q3, the booking window of Booking.com remained shorter than in 2019, similar to what we saw in the second quarter of 2022. This booking window expanded meaningfully versus the third quarter of 2021, where we saw a higher mix of [Inaudible] bookings due to the COVID-19 delta variant wave. For our alternative accommodations at Booking.com, our room night growth rate was 11% in Q3 versus 2019. And the global mix of alternative accommodations was about 30%, which is slightly higher than Q3 2019.\n\nQ3 global mix was about in line with 2021. Q3 gross bookings increased 27% versus 2019 or 41% on a constant currency basis. The 27% increase in gross bookings was 19 percentage points better than the 8% room nights increase due to 28% higher accommodation constant currency ADRs and also due to 4 points from strong flight gross bookings across the group, partially offset by the 14% points of negative impacts FX movements. Our accommodation constant currency ADRs benefited by about 2 percentage points from regional mix and about 26 percentage points from rate increases across all our regions, most notably in Europe and North America.\n\nDespite the high ADRs in the third quarter, we have not seen a change in the mix of hotel star ratings being booked or changes in length of stay that could indicate the consumers are trending down. We'll continue to watch these dates closely. Airline tickets booked in the third quarter were up about 235% versus a small base in 2019, up 45% versus 2021, driven by the continued expansion of Booking.com's flight offering. Revenue for the third quarter was over 6 billion, which was up 20% versus 2019 and up about 34% on a constant currency basis.\n\nRevenue, as a percentage of gross bookings, was about 110 basis points below Q3 2019 due to a number of factors, including investments in merchandising, which are consistent with our prior commentary about the opportunity for us to lead into a recovering travel market in 2022 and also due to an increase in the mix of flights, the slow recovery of our advertising and other revenues, which have no associated gross bookings, and some negative impacts from FX rates. Q3 take rates were down more than expectation of being down about 70 basis points, primarily due to timing differences between gross bookings and revenue recognition, driven by the improved bookings in Q3, some of which relate to travel in future quarters. Our underlying accommodation take rates were about in line with Q3 2019 levels. Marketing expense, which is a highly variable expense item, increased 27% versus Q3 2019.\n\nMarketing expense as a percentage of gross bookings was about in line with Q3 2019, which was better than our expectations, mainly due to higher-than-expected stock mix. As expected, our marketing ROIs were lower than in Q3 2019, which was in line with our strategy to lead into a recovering travel market in the Q3 peak season. Sales and other expenses as a percentage of gross bookings were about 40 basis points compared to Q3 2021, which was in line with our expectations. About 40% of Booking.com's gross bookings were processed through our payments platform in Q3, up from almost one-third in Q3 2021.\n\nOur more fixed expenses in aggregate were better than our expectations of 17% versus Q3 2021, primarily due to a slower-than-expected ramp-up of our IT expenses and lower-than-expected personnel expenses. Adjusted EBITDA was $2.7 billion in the third quarter, which is better than our expectations and about 7% above 2019, and would have been about 25% above 2019 on a constant currency basis. Non-GAAP net income of $2.1 billion results in non-GAAP earnings per share of about $53 per share, which was up 17% versus Q3 2019. On a GAAP basis, we had operating income of $2.6 billion in Q3.\n\nWe recorded GAAP net income of $1.7 billion in the quarter, which includes a 336 million unrealized loss on our equity investments, primarily related to Meituan, as well as $125 million expense related to an ongoing French tax matter. Now, onto our cash and liquidity position. Our Q3 ending cash and investment balance of $11.8 billion was down with Q2 ending balance of $14.2 billion, primarily driven by about $2 billion in share repurchases in Q3, as well as the unrealized losses on our equity investments. The $2 billion in share purchases in Q3 was a step-up from the 1.3 billion in Q2 as we increased the pace of our repurchases, given the pullback in our share price.\n\nIn October, we repurchased another $595 million with our shares, which brings our year-to-date repurchase up to about $4.8 billion and our remaining outstanding authorization to about 5.6 billion. As Glenn mentioned, we reduced our share count by about 5% since the end of last year. And over the last five years, we reduced our share count by 20% despite suspending our share buyback activity for 21 months during the COVID-19 pandemic. We had negative $95 million in free cash flow for the third quarter.\n\nOther earnings for the quarter were offset by about a $2 billion decrease in our deferred merchant booking balance following the peak travel season in Europe and North America. Now, onto recent trends and our thoughts for the fourth quarter. We estimate the October room nights to increase about 12% versus 2019, a slight improvement from the 10% growth in September, driven primarily by the continued recovery in Asia, as well as a slight improvement in Europe. In October, all regions were about 2019 levels.\n\nThe U.S. was up almost 35%, rest of world was up high teens, and both Asia and Europe were up high single digits. ADR growth has remained around Q3 levels. And we estimate growth bookings are up about 30% in October, which includes negative impacts from FX pressures.\n\nWe estimate the constant currency growth bookings were up just over 45% in October. While there continues to be uncertainty in the near term, all comments for the quarter make the assumption the room night growth for the full quarter will be about 10% above 2019, which is in line with level growth we've seen over the last three months. Ten percent room night growth in Q4 versus 2019 would also be an acceleration on a year-on-year basis from 31% growth in Q3 2022 versus Q3 2021, to 39% growth in Q4 '22 versus Q4 '21. We expect the strength of ADRs we've seen in recent months to continue to remain in the fourth quarter, as well as continued growth in flight bookings.\n\nWe expect about a 15% difference between the level of room night growth and gross booking growth, less than 19% gap in Q3 due to more FX pressure in Q4. We expect FX to pressure gross bookings growth versus 2019 by about 18% in Q4. We expect Q4 revenue as a percentage of gross bookings to be about 120 basis points lower than Q4 2019 due to investments in merchandising, an increase in mix of flights, and negative impact on the timing differences between gross bookings and revenue recognition. We expect Q4 marketing expense as a percentage of gross bookings to be a bit higher than in Q4 2019, as we expect to continue to invest in capturing demand and increasing awareness during the continued global recovery of travel demand.\n\nWe expect Q4 sales and other expenses as a percentage of gross bookings to be about 40 basis points higher, thank you for 2021, due to higher merchant gross bookings mix and higher third-party call center costs, including the impact of our partnership with Majorel. We expect our more fixed expenses aggregate will be about 20% higher than in Q4 2021, with personnel, G&A, and IT each up similar percentage year on year. Taking all of this in account, we expect the Q4 adjusted EBITDA to be over 1.1 billion. If it were not for the impacts of FX, we expect Q4 adjusted EBITDA to be above Q4 2019.\n\nWe are maintaining our full year adjusted EBITDA margin commentary and still expect EBITDA margin for 2022 to be a few points higher than in 2021. And if not for the impact of timing, our expectations for the full year adjusted EBITDA margins will be higher by another few points. For the full year, we expect our revenue as a percentage of gross bookings to be just over 14%, lower than our prior expectations of mid-40% range due primarily to timing differences between gross bookings and revenue recognition, driven by stronger bookings than previously expected, which relates to travel expected to occur in 2023. Compared to the 15.6% take rate in 2019, the expected take rate in 2022 includes almost a full point of negative impact from timing, about 40 basis points from the slower recovery in advertising and other revenue, which have no associated gross bookings and about 30 basis points for increased mix of flights.\n\nThe benefit to take rates in 2022 from increased revenues associated with payments is offset by our increased investments in merchandising, each of which impacts our reported take rates by about 1% in 2022 compared with about 0.5% each in 2019. These change in payment revenues, emerging costs versus 2019, are mainly our Booking.com. Looking forward into the winter months, the booking window continues to be shorter than it was in 2019, which means that we would expect low levels of people to stay already on our books. Given this, we are pleased that the gross bookings we have already received at Booking.com for -- in Q1, up about 25% in euros versus the same time in 2019.\n\nOf course, we note that high percentage of these bookings are cancellable. While this represents a relatively small percentage of the total revenue we'll record in Q1, we think it's a helpful early data point to share. In closing, we're pleased with our Q3 results and the trends we're seeing into Q4 and early into 2023. We remain confident that our strategic priorities are the right ones and will enable us to provide better travel services for our customers and partners.\n\nWe'll now move to Q&A. Sylvie, can you please open the lines?\n\nOperator\n\n[Operator instructions] And your first question will be from Lloyd Walmsley at UBS. Please go ahead.\n\nLloyd Walmsley -- UBS -- Analyst\n\nAll right. Thank you. Two, if I can. First, sounds like you're not seeing any consumer weakness right now.\n\nBut, you know, are there any actions you're thinking about taking or approaches to the costs to batten down the hatches ahead of what could be a tough year? From a macro standpoint, maybe, you know, help us think about fixed cost growth and, you know, marketing posture for next year. And then, second one would just be, you know, can you give us an update on payments, monetization, and profitability? Appreciate some of the added disclosure you gave us this quarter. But maybe where are we in the roll-out FX translation? And how should we think about impact of that on take rates and profitability maybe over the next year or so? Thanks a lot.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nHi, Lloyd. Why don't I take that first? And I'll let David talk about payments over there that he wants in terms of fixed costs going forward. So, obviously, we are very pleased with the third quarter. And we are very pleased what we're seeing, albeit in small numbers into the first quarter.\n\nDavid just talked about that 25% on the books in Europe -- in euros. I'd like to see that. Your question is, you know, is there anything we're seeing from consumer sentiment or experience in macros that may be inhibiting growth or may hurt in the future? In some, that's very hard to know. What's the counterfactual? And we're doing well.\n\nImagine what would it be if all these terrible things that we read in the newspapers have not been happening? How much better would it be? I can't measure that. I don't know. What I do know, though, is that we are seeing good numbers, and we're pleased with where we are. We know that we've been through bad times in the past and are able to do very well.\n\nWe've made adjustments when we've had to. I've been at this company for 23 years almost, and we've had some recessions, and we have some real disasters. And we have managed this company extremely well, you know, steering it through some very stormy weather and being able to adjust. So, many of our expenses are variable, so we can adjust very quickly, and we adjust automatically on those as volumes change.\n\nWell, I'm feeling good right now, albeit the world can change at any time. And I'll let David now talk what he wants and tell you about specifically fixed expenses and also mobile payments.\n\nDavid Goulden -- Chief Financial Officer\n\nYeah, thank you, Glenn. I just pointed this out. Two-thirds of our expenses are variable, which is, of course, very important starting point. We, of course, do look at the fixed payments cost very carefully.\n\nBut just to kind of put that into context. And then, also, just to clarify, the 25% is actually at Booking.com. Global number, not just Europe. It's throughout the whole of business.\n\nSo, I think, as Glenn said, what we need to say about the expense side, we will we have an agenda to move what we really want to continue enhancing our products and services. And obviously, that requires continued investments and movement toward very important payments and our connected trip. Relative to the payments platform across, we're pleased with the progress. We did give you some additional commentary, Lloyd, as you mentioned, so you get a feel for what the revenues are for payments now.\n\nAlso, you get a feel for what the corresponding expenses are in sales in order to offset those revenues. Because as we said, this year, we're running the payments platform at about breakeven when you look at revenues and you subtract these sales and other expenses. What I'll also tell you is that relative to 2019, payments is having about a half of basis points or about half a point impact on EBITDA margin. As that mix of revenue has increased, that breakeven or mix revenue has increased.\n\nNow, of course, back in 2019, we actually weren't a breakeven. The combined impact, the way we were to where we are now is about a half a point of headwind on margins. But of course, giving us additional capabilities. Going forward, our road map has not changed.\n\nWe do expect to turn to profitability in that combination of payments platform, combination of revenues, less still no expenses in 2023. We are rolling out FX and other services on the market-by-market basis. And of course, testing them as we always do before we continue to push further. We have an exciting roadmap.\n\nIt's a multi-year roadmap for payments. Don't expect anything to change very rapidly in the course of 12 months. It'll be a course of multiple years. But as we look at the services we can provide for our business today in terms of reducing friction for customers and bookers, and then we can look at how payments can really help underpin the magnitude of the future, we're very encouraged and excited about it.\n\nAnd I think with the additional disclosure beginning today, we will have a more constructive dialogue on how it's doing going forward against those benchmarks.\n\nLloyd Walmsley -- UBS -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nThank you. Next question will be from Brian Nowak at Morgan Stanley. Please go ahead.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking my questions. I have two. Appreciate the color on the U.S., almost growing 30%.\n\nI guess the question on the U.S. is, as you're sort of looking at the different regions of the globe from a profitability perspective, can you just help us understand where you are at this point from the U.S. from a profit contribution perspective? Or is it still sort of very much in an investment mode to drive growth? And how do you think about the path to making that a more profitable region for the company? And the second one, I'm going to mispronounce this, Majorel. I apologize.\n\nDavid, can you just talk us through? How do we think about the puts and takes of potential tailwinds of that arrangement into 2023 to P&L?\n\nDavid Goulden -- Chief Financial Officer\n\nOK, Brian. We're going to take this in the reverse order. So, Majorel, you're pretty close, is basically, from a P&L point of view this year is really moving around geography because also we're going through a transition phase. I think we mentioned that about $25 million of personnel expense a quarter and about $6 million of G&A expense a quarter, move out of those lines, respective in sales and other.\n\nAnd that started in June 1st. So, essentially starting in Q3. Q4, you see the full impact of that. As we mentioned, the policy of Majorel does have some cost benefits to it.\n\nBut really, most about flexibility. It's about our ability to flex up and flex down quickly, respond to different market needs, different mixes of languages. So, over the longer term, compared to continuing to build out ourselves. There are some cost benefits.\n\nAnd they'll start occurring in 2023. We haven't quantified yet. We'll think about whether it makes sense to try and quantify more for you next year. But again, it's not the primary driver.\n\nSo, I'm not saying there are no cost benefits. That's not why we ended up on ship. What I would say, the partnership is working exceptionally well. We just completed the summer period.\n\nAnd our customer survey results are also solid under the new regime because we did keep some books ourselves. On the U.S., of course, we are growing. So, we're investing. I mean, it's no big surprise.\n\nWe haven't broken out what contribution volumes are and the reasons we don't plan to do that. But obviously, we're investing in the U.S. to grow a position which is continue to decrease. And as that increases over time, we'll be able to deliver a higher profitability for it.\n\nBut, you know, we're not any way displeased with what we're doing in the U.S. And obviously, it's a market where people do make money and we do, too. Just maybe not the same rate as markets we are not investing quite heavily.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nThanks, David.\n\nOperator\n\nThank you. Next question will be from Kevin Kopelman at Cowen. Please go ahead.\n\nKevin Kopelman -- Cowen and Company -- Analyst\n\nThanks a lot. Just a follow-up on the marketing spend. Could you characterize how you see the competitive environment right now on advertising channels over Q3 and quarter to date, you know, how that compared to earlier in the year and maybe also compared to 2019? Thanks.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nKevin, why don't I just answer in general, then if David wants to be specific. Look, marketing for travel is always extremely competitive. It's never not competitive. No matter what channel you're spending your money in, it's competitive.\n\nAnd we're always trying to make the right judgment on how much money to spend, what we think the ROI is going to be, and looking into for the long view in terms of what this does in terms of our overall building the franchise. I can't give any specifics in terms of ups and downs. David can talk about percentages of how marketing spend we've been doing versus gross bookings over the last couple of years. But, again, the market is never less competitive.\n\nIt's always competitive. And I think we have performed very, very well regardless.\n\nDavid Goulden -- Chief Financial Officer\n\nGo on, Kevin, please. The second question?\n\nKevin Kopelman -- Cowen and Company -- Analyst\n\nJust kind of a separate follow-up on investment levels. Can you talk about just how headcount has been trending and kind of what you're doing now in terms of hiring? And any color on how that looks over the next year?\n\nDavid Goulden -- Chief Financial Officer\n\nSure. Just to finish up on Glenn's point on the marketing environment. Remember that we did say that our ROIs were lower than last quarter. Q3, as we expected, we talked to lower ROIs.\n\nWe chose to drive ourselves, to continue to lean into the recovery. Also, remember, our ROIs were actually, in fact, higher in the first half than it were in 2019. So, you know, you have to kind of look at it in that context. Investment levels, we continue to be -- you know, I say, we continue to want to invest in the business, but, of course, we do recognize some of the macro factor.\n\nWe're not going to pull back anything strategic from what we want to do if we have a short-term slowdown. But, of course, you know, we are all looking at how many people we added, you know, where we are to make sure we own them against the things that really matter most for the business as you would expect us to do.\n\nKevin Kopelman -- Cowen and Company -- Analyst\n\nGreat. Thanks, David. Thanks, Glenn.\n\nOperator\n\nThank you. Next question will be from Mark Mahaney at Evercore. Please go ahead.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thanks. Two questions, please. Can you talk about how you have been able to drive up that mobile app usage? It's obviously got great benefits for the business model.\n\nBut how have you been able to do it? And just I know you'd like to get it higher. How much higher? What's realistic for how much higher it could get? And then if you could please double click on the flights business, and where are you now in terms of rolling that out into how many markets? How broadly used is it? How high is the awareness of the product? Just talk about what the growth path is just for the flights product. Thank you very much.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nHi, Mark. Thanks. So, you're very right about the importance of the mobile app. And I say that every single prepared remarks we do.\n\nI always mention it's an important part of our platform. How we're doing it is by creating a great experience for the people who are using it. That's the same thing as well when you're trying to get somebody to use this. Provide a great experience.\n\nThey'll come back, and they'll tell all the people, etc. We're not necessarily doing anything really different than anyone else does, but just doing it well. In terms of when -- you know, what would be the top level for it, that's hard to say because as the people who create this mobile device continue improve upon it. And people find it more advantageous to use that versus their desktops.\n\nIt's hard to say, but it could be an extremely high number that people go to the mobile device. Now, our job is to make sure people use our app and don't use mobile web search, where we have to pay, which is one of the key things. You know, we mentioned, I think, you know, 60% of our business was going mobile but 45% at the app. So, obviously, we want to make anybody who's using mobile device, we want them to use the app.\n\nIt's how to direct them. Regarding flights, you know, I should have checked from other countries. I haven't done that recently. It's an awful lot, but some of the areas, it's a relatively low amount because there's very little awareness.\n\nSo, I think, for example, let me give you an example, I know we brought up Pakistan not that long ago. Not a lot of flights yet in Pakistan, but we are getting out there. The key thing for us, again, is creating a better experience. And I'll be honest with you, our flight product is not yet what I would say as good as it should be.\n\nWe'll continue to improve upon it, make it better than it's been in the past, providing the features that some other of our competitors offer up to consumers that we don't do yet that we want to offer. So, there's a lot of upside left in this, I think a tremendous amount of upside. And the numbers are still what we'd like the growth rate. It's still relatively small.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nThank you, Glenn.\n\nOperator\n\nThank you. Next question will be from Justin Post at Bank of America Merrill Lynch. Please go ahead.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGreat. One for Glenn. You know, obviously, merchandising, I think you call that a one-point headwind. Payments might be offsetting.\n\nBut can you explain why you think that's a good thing to do? Is it training the consumer? Is there something you have to comp next year? Why do you like that aspect of the business? And then, maybe for David, assuming we don't have -- you know, a real unusual year for travel, as you think about the unwind of the timing differences and the added marketing spend this year, how do we think about those kind of unwinding next year? And then, maybe last, if you want to call anything about 1Q. I remember -- I think we had a real COVID slow start to the quarter, and then bookings really accelerated in March. If there's anything unusual in Q1 we should be thinking about. Thank you.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nSo, I'll talk a little bit about merchandising. A couple of things. First thing is -- so merchandising can be an investment that we're making, a way to bring in customers, retain customers, more ways that we feel is necessary to be competitive against other OTAs or our suppliers even. The fact is that we're always looking where to spend the money to get the best return.\n\nAnd merchandising if we see somebody else is offering a lower price, we recognize that one of the most important things is to give a competitive price. And we need to make sure that we're offering that up to the customer. Many times, we want to do it, like talk with our supplier partners and making sure that they bring us -- as I said in the prepared remarks, about bringing us the most competitive prices. But if for some reason it's not available, and we feel a need, we'll put money in there to make sure that our customers recognize coming to Booking.com.\n\nWe'll provide them with a great place to do their travel bookings. That's one. Second thing, and I'll make sure everybody understands that merchandising doesn't always mean a discount by us. It can mean lots of things.\n\nPeople offering up some other type of benefit. For example, I'll go with if somebody were to offer up a upgrade in a room, I'll consider that a merchandising technique to do. If somebody offers a free breakfast at the hotel, I'll consider that, too. We're not paying for that breakfast.\n\nIt's a free breakfast. So, lots of ways to do, lots of levers to play with. That's one of the things we think is so important, is making sure that we are providing most competitive offering out in the space. And in addition, being able to use all of our investments in the right way at the right time to get the right return, and working in a lot of data to see where is it best to be put out.\n\nI'll let David go with the other two questions.\n\nDavid Goulden -- Chief Financial Officer\n\nYeah. Thanks, Glenn. Yeah, in terms of just looking forward, on the timing side, I mentioned the timing is costing us about a point of take rate this year. We think we get most of that back next year, maybe not 100% of it.\n\nThere'll probably be some minor timing impact. But again, it's really a function of what the growth rates look like going into -- going out of the year. But this year, we got most of them back. On the marketing and merchandising side combined, you know, that's where we've been, you know, leaning this year to really take advantage of recovery from the marketplace.\n\nWe certainly won't be deleveraging of those lines further next year, but we want to see how really what the market looks like and just how much recovery there is left. Don't forget, we still have about [Inaudible] travel. There are a few things that have not yet gone back to where they were before. So, we'll look at exactly what the right level of investment is.\n\nAnd if we feel that we continue to gain share, which we believe we're gaining this year, we believe we gained share last year, we think the share gains that we had, then we may maintain those levels for a while until we get back to a more normal market growth rate. So, we'll give you more thinking upon where we are in that spectrum when we get together in February to complete our planning process for the year. And we've got a bit more visibility into next year. And then, finally, on your Q1 question, Q1 last year was unusual.\n\nOmicron was really having an impact. We'll have to see exactly what happens. There's different variants that are out there this year. We want to give you that stats about 25% more gross bookings on the books for next year.\n\nAnd we had same time with '19 for the first quarter of 2020 as a way to understand it. The book is building quite nicely for Q1. Obviously, there's a lot of ground to happen between now and then. It still represents a relatively small percentage of what we'll do in total in Q1 revenue.\n\nBut we think it's a positive stat. And it's a stat we gave out a couple of -- of actually for the last two quarters, when the number was more like 15% for growth, not 25%. And in both cases, the revenue for the fourth quarter wound up being a fair amount higher than our early indicator as those books built. Now, again, don't forget, I'm talking about a euro number, just to be clear, with the 25%.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. Thank you so much.\n\nOperator\n\nThank you. Next question would be from Doug Anmuth at JPMorgan. Please go ahead.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nThanks for taking the questions. I have two. I know you indicated that you're not seeing hotel trade-down or shortening of trips. I just wanted to clarify, is that the case across all geographies? And do you have any more relative stability in the U.S.\n\nversus other regions? And then, secondly, how should we think about ADR growth? I know you said it continues to be strong. As you look into '23, just factors around FX. And any relevant mix factors and like-for-like potential pressures as well? Thanks.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nSo, Doug, I'll start with the hotel trading down stars or length of stay. I'm not seeing anything in any sort of geographical area that would make anything stand out differently. We're seeing people who want to travel that have a significant amount of savings over this COVID period, and they want to travel. And some are even, you know, traveling longer, length of stay, and enjoying it regardless of what the economic situation is.\n\nSo, we -- I have not seen anything. And, David, you can correct me. You saw it. [Inaudible] what we're seeing for ADRs going forward.\n\nI'm not sure we've said -- what we were going to say publicly.\n\nDavid Goulden -- Chief Financial Officer\n\nYeah. On the mix -- on the trade-down, Doug, as you mentioned, we're not seeing that in Europe to be perfectly clear because that's where sometimes people are asking the question. But we're not seeing global either. So, it's just not a factor.\n\nBut particularly, it's also not a factor in Europe either. On the ADRs that we got some takes into next year, we'll talk in constant currency because it's difficult to know exactly how exchange rates are going to move on us. We're not -- so the 28 points of constant currency ADR mix we saw in Q3, and we saw, you know, continued roughly same level into October, was 26 points strong from rates and only 2 percentage points from mix. So, as ADR continues to rebound, we'll lose that 2 points of mix, which is really what's driving right now, the fact that Asia had a lot of mix down it used to be.\n\nSo, that will go away. But, obviously, most of what we're seeing is rate-driven. And as we talk to our property partners, they continue to be, you know, facing the same expense pressure and inflation pressures that made people face you in terms of utility, energy, labor, etc. So, we'll see how the environment develops.\n\nAnd we have no other color on that to give at this point in time. We'll update you again when we get to February if we see anything differently.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you both.\n\nOperator\n\nNext question will be from Eric Sheridan at Goldman Sachs. Please go ahead.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for taking the question. Maybe a few, if I can, on the alternative accommodation space where you made some interesting comments there. When you think about supply growth, are there any areas of either geographic focus or mix or types of properties or types of duration stays that are levels of target for supply growth as you look out into '23 and beyond in terms of alternative accommodations? Is there any color also you can give us on, as you have more of that type of supply to show that the consumer what that might do to either a traffic conversion or ROI in the platform as you have a wider array of inventory to show the consumer? And the last piece for you, is there any element of either mix or size of the business you're sort of thinking about in terms of striking the right balance between traditional inventory and alternative accommodation inventory over the long term? Thanks, guys.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nSo, Eric, basic concept for us has always been more is better. More supply is better. And it's always the consumer's choice on what they want to stay, where they want to stay. They want to stay in a home, or villa, apartment, or a hotel, that's it.\n\nSo, in terms of overall, we do need to continue working hard at getting more supply of all types. I've talked many times in the past about our need for the single property, the home specifically that we need to build. I've talked geography. I've always talked about we need to build in the U.S.\n\neven better. And one of the things is creating a better onboarding experience for people who own these properties, improving the payments for these people, coming up with ways they feel better about having some may stay in their property with an insurance-type property. These are something that we have been working on, that we brought out, and we're going to continue to roll things out down the road to make it better for the owners and the managers of these properties to be willing to put it up on our platform. Now, I believe the -- and this is what we've seen over many, many years is that as we bring more and more supply in, that will help us build the business.\n\nAnd I absolutely think that this is something that is not some is going to require some rocket science or some great thing that can't be invented. People are doing this. We just need to continue to work on it, put people to work, create the things necessary. And we will roll this out, albeit it is taking longer than I would like.\n\nBut I am very pleased with where we are. And I think some of the numbers that we've talked about are encouraging.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks, Glenn.\n\nOperator\n\nThank you. Next question will be from Naved Kahn at Truist Securities. Please go ahead.\n\nNaved Khan -- Truist Securities -- Analyst\n\nHi. Thanks a lot. Glenn, I think you mentioned you see opportunities to enhance the experience in the mobile app. Can you give an example of what kind of things we could see there? And then, I don't know if you guys updated us on the mix of urban and cross-border, but any stats that would be pretty helpful.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nI'll let Dave talk about stat you want to revolve about urban or cross-border. But in term of the app, I'll give you one right off the bat that I think it's -- and again, I look at it as a traveler, I say, what am I missing? Why am I not getting this? Something as simple as, as you know, we have attraction, so we're building that up right now. But in destination, I need to have things being popping up on my screen from our app, telling me great things to do, maybe the discount or skip a line, things that will make somebody say, \"Gee, using Booking.com for this travel experience is much better because I'm getting so much more.\" And I can go through so many different examples of that. The great thing about the mobile app is it's in people's hands or in their pocket book, or in their pocket.\n\nThey're carrying it with them. And that gives us the connection to be able to provide better service, better things to do, better value. And that's why it's such an important part of this connected trip vision. David, I don't know if you want to give anything from any steps?\n\nDavid Goulden -- Chief Financial Officer\n\nNo stats on urban other than to say that, historically, urban is -- you know, we've had a heavier weight of mix urban than not. So, as the recovery continues, if people go back to cities and other locations, that usually is a positive for us. But no stats on mix. On cross-border, we did tell you that we're back up to 45% of our bookings now in the third quarter.\n\nFor international, that's down from a little over 50% on a pre-pandemic basis. So, there's still some decent recovery left there to be had as things continue to normalize back to where they were.\n\nNaved Khan -- Truist Securities -- Analyst\n\nGot it. Thank you, Glenn. Thank you, David.\n\nOperator\n\nThank you. Next question will be from Lee Horowitz at Deutsche Bank. Please go ahead.\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nTwo on margins that -- margin, if I could. When you think about margins beyond this year, how does the strength in direct and applicants impact the way you think about the long-term margin profile of the business, particularly with some of your growth initiatives like flights having lower margin than your core could direct end of offsetting these headwinds in the fullness of time? And then, when you think about the shape of margins, perhaps, next year, how, if at all, should we be thinking about APAC being potentially a source of premium growth impact in the overall margin profile of the business in 2023? Thanks so much.\n\nDavid Goulden -- Chief Financial Officer\n\nYeah, Lee, I wouldn't try to talk about 2023 margins today. That's really a conversation for next February. But maybe, longer term, it's a place to have to kind of recap on what we're thinking and save the 2023 commentary for Glenn. So, as we said, the -- our strategy here is to build a better product and service for customers and partners.\n\nSo, they'll come back to us more frequently and more directly. And obviously, our direct mix is super important. And direct mix is tied heavily to frequency and to people who do more with. People who bought or buy multiple things from us are much more likely to come back to us directly in the through the pay channel.\n\nSo, yes, of course, there are some headwinds to our volume profile because of our business mix changing. It's always changing from almost the pure accommodation business, having a higher mix of payments, a high mix of flights. And those, of course, are lower-margin businesses. We've had that conversation before.\n\nBut the most important thing we can do to kind of keep our margins in a strong position is to continue to drive that mix of direct up. And that will impact all parts of the business. But as we said before, we'll be industry-leading profitability and margins. Because of the mix factors, we do not have a -- we believe that medium term, the margin will be a little bit lower than they were in 2019.\n\nBut we'll have a faster growing business with more EBITDA, more earnings per share that's growing faster than the top line and bottom line. We think that's the most important thing.\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Next question will be from Mario Lu at Barclays. Please go ahead.\n\nMario Lu -- Barclays -- Analyst\n\nThanks for taking the question. The first one is on the room night guide in the fourth quarter, the 10% for 2019. I guess, can you talk a little bit more about what you saw in October? Did the trends within the month, you know, get worse as we exited the month? Just trying to tie that 10% versus 12% in October. Thanks.\n\nDavid Goulden -- Chief Financial Officer\n\nSo, yeah, sure. The 10% room night guide, it's essentially -- it's really a framework, what we give you for Q4. There's still a lot of volatility. And, obviously, we can't predict exactly what's going to happen to room nights in November and December, given the macro out there.\n\nBut what we did was say, \"Look, we grew -- you know, we've been growing at 10%, increased up to 12%. It's a nice round number to kind of pin our commentary to with Q4 to explain to you what the shape of the P&L might be.\" It does not indicate that there was a slowdown at the end of October. In fact, room night growth was fairly linear at 12% throughout the entire month of October. So it's more of a framework than it is a hard guide.\n\nBut, of course, we give you a number to kind of think about when building, you know, your models. But it's not reflective of anything we're seeing in October, either slowing down or speeding up. It's just a way to think about the shape of the income statement and how things might look in Q4.\n\nMario Lu -- Barclays -- Analyst\n\nAnd then, just one on alternative combinations. You guys mentioned as a percentage of total, it's around 30%, slightly higher than 3Q '19. I guess, are there any low-hanging fruit or, you know, opportunities ahead to kind of increase this percentage over the next couple of years?\n\nGlenn Fogel -- President and Chief Executive Officer\n\nWell, I mean, we could easily increase that if we didn't do so well in hotels. It's, you know, one of those things where we think of this holistically. We want to get more bookings, as I mentioned earlier. This is really a case where the consumer makes the decision, not us.\n\nWe think one of the great advantages of our platform is that we offer all the different types of accommodations. And we have seen the data where people come to our site. And the first thing they're looking at may be one type of combination, let's say, hotel. They end up booking with a home because they saw that in the search results, and they were going back and forth looking around.\n\nIt's really -- so, we are very pleased to have that ability to offer up all the types of accommodations to the customer. So, I don't see anything to try and artificially try and drive more people to the alternative accommodations necessarily, a thing that's going to increase the value of the company. I think providing the customer with what they want, what they need, what they think is best for them is really the right way being consumer-centric and really driving that is the best way to build the company.\n\nMario Lu -- Barclays -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Your last question will be from Stephen Ju at Credit Suisse. Please go ahead.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nThank you so much. So, Glenn, your unit growth commentary in the U.S. was actually very interesting. So can you talk about the relative size of your user base for Booking.com in the U.S.\n\nversus, say, Priceline? And, you know, presumably as booking continues to grow, do you think it's necessary to support both brands longer term? And if you were to take one step out and zoom out more globally, there was always a sharper line in the sand between the consumer experience on booking in Agora. So, do you think as you do more merchandising and connected trips, should we be thinking about a unified brand position under Booking.com? Thanks.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nYeah. So, let me talk in general about why we have different brands. We have different brands because they offer a different user experience to the consumer and the different things that they are aiming to do, different strategies. We really -- we totally understand the issue of are we causing excess cost? Are there ways to save money by doing things that are not duplicative? So, we are -- we understand that.\n\nWe are working all the time looking at those things that we can try and improve upon. But at this time, I do not see any reason I'd want to separate out and say, \"Well, we're going to eliminate one of these, and just go under one brand.\" Some of our competitors have done that. And to me, that may be their strategy. Our strategy is to continue with the differentiation among these brands and continue to build them out the way they're doing them.\n\nIn terms of the actual numbers, U.S. for Priceline versus Booking, I don't believe we ever disclose anything of that nature. So, I think we're going to sit tight with that and keep going the way we are.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nAt this time, I would like to turn the call back over to Mr. Fogel. Please go ahead.\n\nGlenn Fogel -- President and Chief Executive Officer\n\nThank you. And I want to thank our partners, our customers, our dedicated employees, and our shareholders. We appreciate your support as we continue to build on the long-term vision for the company. Thank you, everyone, and good night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGlenn Fogel -- President and Chief Executive Officer\n\nDavid Goulden -- Chief Financial Officer\n\nLloyd Walmsley -- UBS -- Analyst\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nKevin Kopelman -- Cowen and Company -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nNaved Khan -- Truist Securities -- Analyst\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nMario Lu -- Barclays -- Analyst\n\nStephen Ju -- Credit Suisse -- Analyst\n\nMore BKNG analysis\n\nAll earnings call transcripts"
}