{
  "companyName": "Peloton Interactive",
  "companyTicker": "PTON",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/peloton-interactive-pton-q4-2022-earnings-call-tra/",
  "content": "Peloton Interactive (PTON -1.85%)\nQ4 2022 Earnings Call\nAug 25, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Peloton Interactive fourth quarter '22 earnings call. At this time, all participants are on a listen-only mode. [Operator instructions] Please be advised that today's conference is being recorded and we will take one minute to assemble the queue after the Safe Harbor.\n\nI would now like to hand over to your speaker today, Peter Stabler, head of Investor Relations. Please go ahead.\n\nPeter Stabler -- Head of Investor Relations\n\nGood morning. Welcome to Peloton's fiscal fourth quarter conference call. Joining today's call are CEO, Barry McCarthy; and CFO, Liz Coddington. Our comments and responses to your questions reflect management's views as of today only and will include statements related to our business that are forward-looking statements under federal securities law.\n\nActual results may differ materially from those contained in or implied by these forward-looking statements due to risks and uncertainties associated with our business. For a discussion of the material risks and other important factors that could impact our actual results. Please refer to our SEC filings and today's shareholder letter, both of which can be found on our Investor Relations website. During this call, we will discuss both GAAP and non-GAAP financial measures.\n\nA reconciliation of GAAP to non-GAAP financial measures is provided in today's shareholder letter. I'll now turn the call over to our operator to take our first question. Operator?\n\nOperator\n\n[Operator instructions] And our first question will come from line of Justin Post from Bank of America. Your line is open.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks a couple. First, when you said churn about 141, I think it would be lower if you adjust for Canada. Is that what you're looking for in the first quarter or is it -- is the adjusted with Canada? And then secondly, just thinking about the shape of the year, looking for flattish subs in the first quarter.\n\nHow are you thinking about holiday seasonality going forward and what needs to happen to get to breakeven cash flow? Thank you.\n\nBarry McCarthy -- Chief Executive Officer\n\nTake the first two parts and I'll lead cash flow.\n\nLiz Coddington -- Chief Financial Officer\n\nSure. So the first question, I believe, I understand correctly was related to churn and what our expectations are for the first quarter. As as we mentioned in our shareholder letter, we saw a modest increase in our monthly churn and for Q4. And that was visit that was related to our all-access subscription price increase that we had in June.\n\nI'm happy to say, though, that for July we saw churn levels declined from June and declined from the Q4 average. So we expect our attention levels to remain attractive. Our engagement trends suggest that churn will continue to remain low in the first quarter and for the rest of the year. With regard to the flat subs, seasonally, Q1 is a low-growth quarter for Connected Fitness product sales.\n\nWe did increase prices on Bike+ and Tread and that took effect on 8/12. And while we do expect our Q1 churn to remain low, as I said before, our volume of Connected Fitness growth additions in Q1 is expected to be offset by churn due to the size of the sub base. Now how does that play for seasonality going forward for the rest of the year? We're not providing any full year guidance on revenue or subscribers, but we do expect revenue for the year to most closely resemble the seasonality for fiscal '22 in terms of revenue per quarter. Hopefully, that's helpful.\n\nBarry McCarthy -- Chief Executive Officer\n\nAnd then the -- I think the third part of the question, Justin, was related to cash flow, what do we have to do to get to breakeven cash flow. And the short answer is, and not to be glib, we need to rightsize the spending of the business, the run rate of the business, whatever the run rate of the business turns out to be. And then secondly, and I made this point when I first joined the company, both employees and investors, it's not enough to just cut expenses. We have to grow revenue.\n\nAnd we've taken a number of steps in order to accomplish that objective. We have substantially picked up the pace of innovation and testing and risk taking in order to accomplish that objective. Among the new initiatives are fitness-as-a-service, the sale of previously owned bikes, evolution of our digital app strategy, which will have more to say over the next several months, among other initiatives like the introduction of the Rower and the new pricing strategy. So if we happen to sit right smack in the middle of the pivot where we have made substantial progress addressing all of the infrastructure-related headwinds of the business, and now it's time to get back to the business of expanding the franchise, we do that principally by expanding the TAM and we do that principally with a good, better, best strategy that targets not only the premium segment of the market, but the value segment of the market, and the use case for Connected Fitness with competitive platforms.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nThat's great. I'll let someone else ask more questions. Thanks.\n\nOperator\n\nThank you. And one more for our next question. Our next question comes from the line of Doug Anmuth from J.P. Morgan.\n\nYour line is open.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nThanks for taking the questions. You've had multiple product price changes over the past several months. Trying to understand how comfortable you are now with the most recently revised pricing that creates this greater gap between entry level and premium products and then how you're going to communicate those options in your marketing. And then, Barry, if you could perhaps also update us on fitness-as-a service.\n\nHow we should be thinking about kind of for full rollout and how you'll increase awareness around the product going forward. Thanks.\n\nBarry McCarthy -- Chief Executive Officer\n\nDoug, I have difficulty hearing, but I think the first part of the question is about pricing generally.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nYes. Yes.\n\nBarry McCarthy -- Chief Executive Officer\n\nAnd then loans market. And the second piece of the question is about FAAS, how do we think about it and what are our plans for it?\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nExactly.\n\nBarry McCarthy -- Chief Executive Officer\n\nOK. Let me begin with FAAS and then I think I'm going to ask Liz to jump in on top. So we've sort of gradually expanded the footprint for FAAS and our marketing initiatives around FAAS. We're selling, renting at a pace of, in round numbers, 30,000 to 40,000 units on an annual basis.\n\nSo it's a relatively small footprint and we haven't really leaned into it yet. We -- and it begs the question, why because we've been at it for a while. And the answer is in order to know whether or not the value proposition works for consumers and works for Peloton, we need to understand what the retention behavior is and the implied churn rate so we can calculate lifetime value and figure out whether or not we've created a nuclear bomb or we're on the path of the Promised Land. And I would say so far, we're encouraged by the churn data that we've seen, recognizing that it's a growing but limited sample.\n\nSo I'm guardedly optimistic. I would say that I would think a win for us might be something like 125,000 to 150,000 bikes a year, renters, and the ability, which we have just brought online, to utilize a certified pre-owned inventory to fulfill demand under that program. So I would say net net, that looks pretty encouraging. Now, there will be some substitution behavior, I think, between certified pre-owned and and growth in fitness-as-a-service because they both target basically the same segment of the marketplace, which is the value-minded shopper.\n\nAnd it's pretty clear that we are bringing into the Peloton family a younger, slightly more female demo than we have historically, which is good. I mean those programs are expanding the TAM. Now, as it relates to 3PL, we said we've seen substantially better performance. We have a very small numbers, so take it with a grain of salt.\n\nWe outperformed our forecast by 3x. And we have a lot of bikes in story, used bikes that we can recycle into that program. We've been talking about it for a year. We finally got it live.\n\nWe're going to lean into it. Remains to be seen how big that program can become and as it scales, what the what the substitution behavior will be with the fitness-as-a-service. OK. Probably talked to long about that.\n\nSorry. As it as it relates to pricing, I want us to pursue a good, better, best strategy. So we believe and I think the net promoter scores for our various products support that notion that in the premium segment of the marketplace, the integrated hardware user experience in Peloton is the absolute best. And there are people who are willing to pay a premium for that, and we want to serve that marketplace well.\n\nBut we also want -- if we're going to grow our revenues as fast as we would like, we're going to have to increase the TAM. And if we're going to increase the TAM, we're going to have to reach for new market segments. And that's where the good and better comes in. And that's where the FAAS and fitness-as-a-service and the digital app strategy comes into play.\n\nAnd with respect to the digital app strategy, I had previously told investors that I wanted us to pursue a freemium strategy. We are going to implement that. There'll be various price points and you'll have access to different kinds of content depending on how much you pay for the digital app. Roughly half of our paying customers today use our Connected Fitness-related content on the app, so it's quite clear they're using the app on somebody else's hardware, which is something we've always shied away from and going forward is something we're going to lean into.\n\nI would be delighted for you to use our content on somebody else's hardware if you already purchased it. That's a big installed base and I think it's a big opportunity for monetization for us and we're going to lean into that segment of the market as well in order to grow TAM. So we'll figure out the pricing as we go. I think if we have the luxury, like we do now because of our cash position and the changes we've made in the business, to price products in order to earn a reasonable return on hardware, we will.\n\nThat wasn't the case earlier in the year. We absolutely needed to liquidate hardware to manage for cash, so we did. But we put that in the rearview mirror at the moment. Did I answer your question?\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nYou did. Very helpful. Thank you, Barry.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Ron Josey from Citi. Your line is open.\n\nRon Josey -- Citi -- Analyst\n\nGreat. Thanks for taking the question. And I wanted to ask maybe bigger picture on gross margins. And Barry, I know we talked about the focusing on free cash flow, but help us understand how you view gross margins maybe on the subscription side, given the pricing increase.\n\nAnd then on the product side, as you exit manufacturing and last mile and FAAS gain share here, just as we think bigger picture on the way toward free cash flow. And maybe a second one just on that, any insight or help us understand how you view inventory, just continue to coming down going forward? Thank you.\n\nBarry McCarthy -- Chief Executive Officer\n\nI'm going to ask Liz to take the gross margin subscription and bigger picture piece and I'll just take the inventory liquidation. I think there might be a perception that because we have a large inventory position that we will be liquidating during FY '23, we will have a large wind at our backs from a free cash flow perspective that will help us achieve our objective in FY '23 but we will not have the benefit of FY '24. And I just want to burst that balloon and say, actually, on a net basis, the benefit in FY '23 will be all of $6 million, roughly. And the reason for that is the benefit, of course, of selling inventory we've already paid for, but we also in settlement of supply related issues that we've dealt with in the past several quarters, we have quite a bit of money flowing out the door.\n\nSo on a net basis, that's sort of no harm, no foul. And I think for the full year, if we're successful and it's in our current forecast, we'll end here with about a billion in cash, which leaves us well-capitalized for the remainder of the business. Liz, if you want to address the gross margin piece of the question?\n\nLiz Coddington -- Chief Financial Officer\n\nYeah. So with regard to gross margins, the way we think about the -- the way I think about gross margin is just kind of two piece for the right services. The revenue piece, which we increase the prices for Bike+ and Tread, and so that's going to obviously have a positive effect on gross margin overall. And then from a cost of goods perspective, we decided to fully outsource our last mile delivery for TLC.\n\nWe announced that. That will have a positive impact on our delivery costs. We're also focusing on improving our delivery quality. That should also help reduce our warranty costs over time.\n\nAnd then kind of more of a longer term opportunity on gross margin, this is related to the Connected Fitness side of it is opportunities to reduce the cost of our hardware through how we design our products but that's obviously a longer term opportunity.\n\nBarry McCarthy -- Chief Executive Officer\n\nLet me just jump in and mention related to that is redesigned to enable self install, which would dramatically change the logistics and the cost associated with last mile domestically and internationally.\n\nLiz Coddington -- Chief Financial Officer\n\nAnd I did want to reiterate that for Q1, we provided a guidance of around 35% gross margin, but we're not providing any further guidance for the year beyond that at this time. You also had a question about kind of subscription gross margin. And obviously that is -- that margin is higher than our product for our Connected Fitness product gross margin. As that subscription base continues to grow and mature, that will naturally have some benefits to gross margin overall as well.\n\nRon Josey -- Citi -- Analyst\n\nThank you, Barry. Thank you, Liz.\n\nOperator\n\nOne moment for our next question. Our next question comes after the line of Lauren Schenk from Morgan Stanley. Your line is open.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Just following up on that last one. How should we think about sort of the longer term or stabilized Connected Fitness gross margin? And my second question in terms of the self-install option, is that only going to be available on Amazon for the time being? Any color on the margin benefit from that? It looks like pricing is similar or the same as as having the professional delivery.\n\nAnd then in terms of of other potential or third-party partners, what are you looking for in those new relationships? Thanks.\n\nBarry McCarthy -- Chief Executive Officer\n\nWell, let's see. As it relates to long-term gross margins, I think increasingly the business is driven by the growth in recurring subscription revenue. That has an inherently higher margin than the hardware side of the business. And so the long-term trend for margin is toward the software margin rather than the hardware margin.\n\nThe cost implications for self-install, well, let me talk about the implications of self-install generally. One of the challenges related to the delivery of hardware is coordinating the delivery schedule with the availability of the members who purchased hardware. And if we could move to a dropship model, we eliminate all or the majority of that friction, which would be a very good thing. And secondly, if in the process of designing a self install capability, we were able to decrease the weight of the unit.\n\nThere's some last mile cost-related benefits that would flow through to us as well. And then lastly, if we can get to a self-install, we think it significantly improves the opportunities for international growth, which we tend to lean into when we are able to absorb that incremental cost of that expansion. And then there was a question generally about third-party retail partners. In my previous comments to investors, I had indicated this was the strategy that I hopefully would lean into.\n\nIt's early. We're learning. This is not a substitute for our own retail strategy. This is a recognition that we need to be where our customers are.\n\nSometimes that's in the store, sometimes it's on our website. We know from our own research that there are roughly 500,000 searches today on Amazon for a month -- excuse me, a month for Peloton. And so there's an opportunity to sell there and in other retail formats as well. And it's important that we test and learn by broadening our distribution to see which of those could be cost effective for us.\n\nAnd then we'll over time as we come to understand the margin implications that would be great. In time, it'd be terrific if we could broaden the distribution to other Peloton hardware platforms on Amazon. But at the moment, we need to be able to be dropshipped in order to be on their platform. And our Tread and our Bike+ doesn't lend itself to that solution yet, which is why it's not yet -- we have not yet offered it for sale on their platform.\n\nBut in time, I hope that we are able to find a solution to that short-term roadblock.\n\nPeter Stabler -- Head of Investor Relations\n\nThank you. Next question, please.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Edward Yruma from Piper Sandler. Your line is open.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nHey, guys. Good morning. Thanks for taking the question. I wanted to put down a little bit on engagement.\n\nI know you're going to stop reporting metrics on a quarterly basis, but I'm trying to think about engagement holistically. I would say I know lots of moving pieces on COVID and seasonality, but where do you see engagement going over time and is there anything you can do to help drive that number higher? Thank you.\n\nBarry McCarthy -- Chief Executive Officer\n\nSo let me jump in here. I said I wanted to lean into software. It's important that we be -- that we create both hardware and software. But I think the primary growth opportunity for us is in exploiting our, our singularly unique competitive advantage, which is our content, right.\n\nIt's the crown jewel and it continued to perform spectacularly well. Now, for you to be able to enjoy it, you have to be able to discover it. And the way we improve engagement and lower churn and increase lifetime value and drive more organic growth from word of mouth is by making you more delighted with that content. And the way we do that is by helping you engage with it, by understanding, by personalizing it, by giving it a front end that understands what your likes and dislikes are, and then serving you content that is consistent with your preferences, right.\n\nThis is what -- this is why Netflix beat Blockbuster. And this is among the reasons that Spotify has run the table as the world's largest streaming music service. And the more content you have, the more important it becomes that you be good, even great, at building that personalized user interface. So it is currently a focus for us and we will be relentless about it.\n\nAnd I would say we're still really in very early stages. I mean, there's a little bit of stuff we serve you than if you use bike, by way of example, it's a little bit of stuff on your screen when you log in that reflects maybe in fact, some of the instructors you've taken classes from. But there's a ton of stuff that we continue to serve to you that you had never engaged with that reflects what we think you should be interested in. But what really matters is what you think you should be interested in.\n\nAnd so we need to close that gap.\n\nPeter Stabler -- Head of Investor Relations\n\nNext question, Victor, please.\n\nOperator\n\nOne moment. Our next question will come from the line of Eric Sheridan from Goldman Sachs. Your line is open.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the questions. Maybe just a two-parter. How are you thinking about the health of the brand today? You came out of the pandemic with a lot of awareness of the brand, a lot of halo effect. But sales and marketing has been more of a reduction in the last couple of quarters.\n\nHow do you think about sort of returning to sales and marketing as a channel, continuing to grow awareness of the brand and use sales and marketing as a tool to address sort of the better, best strategy you talked about in terms of amplifying the gross additions dynamic for the platform? Thanks.\n\nBarry McCarthy -- Chief Executive Officer\n\nThanks for the question, Eric. Fortunately, I think the health of the brand is exquisitely good. The health of the business has been challenged, but the brand remains beloved and the net promoter scores remain extraordinary. If you are what your track record says you are, we are a U.S.-based bike company.\n\n96% of hardware -- of the hardware platforms in people's homes today are bikes, but there's so much more opportunity available to us to drive growth, not just Bike+, but the Tread, the Rower, the Guide, and especially the digital app and coupled with the good, better, best strategy that opens up segment of the TAM we haven't historically targeted. And the opportunity for us now is to invest in growing awareness. By way of example, the Bike has 53% unaided awareness, but the Tread is only 21%. The unaided awareness for the digital app is 4%.\n\nAnd so there's tremendous upside to be had. We can execute here. And in part, the principal message of my letter is, OK, pivoting now. Bunch of things we had to fix in order to put ourselves in this position.\n\nWish it happened sooner, but it's happening now and we're going to tackle head on, this challenge, related to partnering and growth. And what I'm trying to articulate is the different initiatives that we're going to pursue in order to drive success. The important thing to recognize is that the path to success involves having more swings at the plate. And so you've seen us deploy a number of initiatives to accomplish that objectives.\n\nAnd we're going to connect with the ball. It's just a matter of time. And I know from my Netflix experience and my Spotify experience. I can't tell you exactly which one of those initiatives is going to get us where we want to go, but I am confident that the cumulative effect.\n\nPeter Stabler -- Head of Investor Relations\n\nNext question, please, Victor.\n\nOperator\n\nThank you. Our next question comes from the line of Shweta Khajuria from Evercore ISI. Your line is open.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you for taking my questions. I have one on the next quarter guide. So I think this was somewhat asked earlier, but I just want to get a little bit more clarification.\n\nIf you exclude the Canadian members in the guide organically, does that imply net adds decline because 85% of members actually did take the actions? Could you please clarify that? Second is on gross margins. Is it possible to get a little bit more color on the magnitude of impact from the price increases versus the cost-cutting actions that you took related to customer service and outsourcing third-party logistics? And then the final question is, Barry, as you think about growth next year, possible to give a sense of how fast, if at all, the Connected Fitness market is expected to grow and in terms of the magnitude of the impact of all these initiatives? Whether it's FAAS or international or digital subscription app initiatives, which ones do you think, in order of magnitude, will be most impactful next year? Thank you very much.\n\nBarry McCarthy -- Chief Executive Officer\n\nLiz is deciding how she wants to --\n\nLiz Coddington -- Chief Financial Officer\n\nI'm trying to make sure I understand your questions. So the first question was about the Canadian subscribers. I think what you were asking is if that implies a negative net add as a result of the fact that these subscribers churn, but not --\n\nBarry McCarthy -- Chief Executive Officer\n\nThey're not a gross add.\n\nLiz Coddington -- Chief Financial Officer\n\nThey're not gross add so they would -- so if they had not churned, it just -- it wouldn't be an impact, is the way that I sort of think about that. So I'm not really -- they're not considered a gross add is effectively the way that we would think about that.\n\nBarry McCarthy -- Chief Executive Officer\n\n[Inaudible]\n\nLiz Coddington -- Chief Financial Officer\n\nCorrect. Correct. The gross margin question, I wasn't quite following what you were asking there. Is that --\n\nBarry McCarthy -- Chief Executive Officer\n\nHow much of the gross margin -- correct me if I'm wrong, how much of the gross margin improvement comes from last mile, member service reduction as opposed to price increase?\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nThat's right. Thank you.\n\nOperator\n\nThank you. One moment.\n\nPeter Stabler -- Head of Investor Relations\n\nNo. No, Victor, we're not finished with this question yet.\n\nBarry McCarthy -- Chief Executive Officer\n\nWell, Liz is nearly on that. Let me let me jump in on the Connected Fitness market next year. Honestly, I don't pretend to know what's going to happen to the marketplace as a result of different puts and calls in -- with the economy. I think the challenge for us regardless, is to grow the TAM and to reach market segments that we don't currently reach in order to accomplish that objective.\n\nSo which leads me to the answer to your question. Where do I think will be the principal leverage points for the business? And then I put Rower on the shelf for for a moment and answering that question. Probably certified pre-owned, that just flew out the door, followed by -- in my nirvana, it would be followed by growth in the digital app because I think that is singularly important to us from a strategic perspective. And if we're successful with that initiative, it will unlock access to the installed base of competitive hardware and use occasions that don't currently exist for our content, followed by fitness-as-a-service.\n\nAnd if fitness-as-a-service really takes off, then there's a whole capital strategy that we'll need to figure out for that business, but I'm confident that we will have access to the capital if the margins are as attractive as we think and if it's really growing as fast as we think it might. Then I said I put Rover on the shelf. We will have to see how that product does when it arrives. It's going to be expensive, but I think we're going to revolutionize the market and we'll see how those two cross-currents land.\n\nBut we anticipate that it will be a significantly better user experience than anything currently available in the marketplace.\n\nLiz Coddington -- Chief Financial Officer\n\nOK. For the gross margin question, I think you were asking like how should we think about the composition of the gross margin improvement and how much is coming from price and how much is coming from our 3PL logistics, moving from -- moving to the 3PL outsourcing model from a just last mile logistics. In Q1, the vast majority is going to come from pricing because we just announced the move to outsource to third-parties, and so that will take a bit of time. Over the course of the year, we still expect more of it, more than 50% to come from the pricing and -- but the logistics will be very impactful and it will be it will be in full over the course of the year.\n\nDoes that help? Does that answer your question, Shweta.\n\nPeter Stabler -- Head of Investor Relations\n\nNext question, please, Victor.\n\nOperator\n\nAll right, one moment. Our next question comes line of Kaumil Gajrawala from Credit Suisse. Your line is open.\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nHi. Thanks. Good morning, everybody. Can you talk a little bit about the consumer and maybe the interaction between in-person, studios and gyms, and Connected Fitness? Obviously, the industry is down quite a bit and there's a lot of macro effects, but can you maybe just talk about what you might be seeing in terms of the pendulum maybe swinging one direction than the other?\n\nBarry McCarthy -- Chief Executive Officer\n\nLet's see. I'm not sure that our experience is -- translates to the experience of our competitors. I think it probably doesn't. In our uniquely different ecosystem where we just opened up our studios, the amount of energy and -- among our passionate user base is, well, it's just something to behold.\n\nPeople lined up around the block for hours, classes over-sold, crashing our reservation system. I mean, it's just insane. And no, that's not what the industry is experiencing generally now. That fact notwithstanding, notwithstanding the passion and enthusiasm among their rabid member base, as a percentage of total classes taken live, relatively small, but it has an enormous halo effect and drives tremendous word of mouth, I think, all of which helps to grow the brand.\n\nThat helpful?\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nYeah, that helps. Would you consider expanding the in-person studios and such? Obviously, you have a lot of excitement so far, but it's fairly small.\n\nBarry McCarthy -- Chief Executive Officer\n\nI think there's an opportunity -- I'll tell you how we are thinking about it. Jen Carter, who runs that business for us spectacularly well, and I have spent time thinking about ways in which to create marketing and branding and PR opportunities on a local basis using the celebrity power of our instructors and in different geographic markets. So if we were to expand, I think that would be the sort of the kernel of an idea that we would try to leverage geographically rather than opening, say, incremental studios around the country. Just because of the cost of doing that is so [Inaudible].\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nOne moment. Our next question comes from the line of John Blackledge from Cowen. Your line is open.\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nGreat. Thanks. Two questions. First, how should we think about the retail store footprint in fiscal '23 and beyond? And the second question on cash flow breakeven, is there any way to kind of think about the level of top line in second half '23 to get to that cash flow breakeven number? Thank you.\n\nBarry McCarthy -- Chief Executive Officer\n\nI'll let Liz take the second one. Let me do the retail footprint. I don't -- we don't know how many stores we're going to end up with when the dust settles. Our objective is to repurpose about $50 million worth of run rate spending, to deploy it more productively from a marketing perspective when the dust has settled and we are done restructuring the retail footprint domestically and internationally.\n\nLiz, do you want to do the capital --\n\nLiz Coddington -- Chief Financial Officer\n\nThe cash flow question and thinking about revenue? As we mentioned, we are pulling all these different levers on the business right now. And so there's a lot of uncertainty about how these levers will bear out. And so we're not we're not providing any full year guidance on revenue, but we did expect that to follow the seasonality in terms of revenue per quarter from prior years. Now, that being said, from a cash flow perspective, we do have this Northstar goal that we are working to achieve to achieve free cash flow breakeven by the end of the year and we will be maintaining a cash balance of at least a billion dollars.\n\nAnd what we have to do in order to do that is make sure that we continue to work hard to rightsize our costs, as Barry mentioned earlier, to align with the run rate of the business. So we will continue to do that in order to make sure that we achieve our goal of being breakeven free cash flow by the end of the second half.\n\nBarry McCarthy -- Chief Executive Officer\n\nI would say, by the way, related to the retail footprint savings, I'm not expecting any savings in FY '23 for the cost of rationalizing that distribution and will mostly consume whatever savings we would otherwise realize so that the savings, if there are any, would happen in '24. In my nirvana, there wouldn't be any savings. We'd take that and we redeploy in marketing to drive incremental growth. Question is can find ways to spend that cost effectively within our LTV to CAP framework?\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nThank you.\n\nOperator\n\nOne moment. Direct question come from line of Youssef Squali from Truist. Your line is open.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nThank you very much. I have a couple maybe for Barry. On the Amazon partnership that you announced yesterday, arguably, you guys can do a lot more with Amazon. I wanted to understand just how you think about that partnership right now.\n\nIt seems like based on the type of products you're allowing Amazon to sell or you're selling through Amazon, it's maybe with the lower end of your goods, better, best strategy. Is that kind of the way to think about your retail strategy broadly speaking, or is it just versus DTC? Or is that just as you try to learn more about that strategy, since you've basically pivoted from DTC to a broader retail strategy? And then maybe can you just talk about the status of Precor within the company? What is the strategic rationale of keeping it?\n\nBarry McCarthy -- Chief Executive Officer\n\nI'll let Liz handle the Precor. With respect to Amazon, I'd love to sell all of our Connected Fitness platforms on Amazon good, better, best. But they need to be at the moment we need to have the ability to to -- for consumers to opt in to self-install, and that's not possible with Bike+ or Tread. And so until or unless that constraint changes where we complete a redesign cycle, you won't see those service platforms on Amazon.\n\nHow important will it be? We don't know and we have modest assumptions in our forecast related to the impact for that business. I hope there's tremendous upside. But we won't know till we we know. So just the point here is to begin the process of learning.\n\nAnd then based on the learning, make smart operating decisions about how to leverage the learning into a profitable opportunity both for them and for us. And so that's the journey we're on. And the same thing with FAAS and the same thing with certified pre-owned and the same thing with the various flavors of digital app that we're going to be rolling out. So it's your intuition to figure out what to test, then use the data and inform you about how to react to the test results you're seeing and take risk and move fast and don't be afraid to break stuff.\n\nLiz Coddington -- Chief Financial Officer\n\nJust regard to Precor, -- so there was a question in there about Precor. We're continuing to assess our strategy for Precor, and it's been helpful for us as we've been building our Peloton commercial business. But with all the other things that we're working on, all of our supply chain work, the FAAS work that we've been doing, Precor hasn't -- the focus on Precor hasn't been our highest priority area. And we don't have we don't have much else to share at this point.\n\nBarry McCarthy -- Chief Executive Officer\n\nIt is true that there have been other priorities that consume our focus and attention. I did say when I first joined, if it wasn't Connected Fitness-related, it wasn't going to be part of our long-term strategy and strategy to be that choice. All those things are true. Liz pointed out, has been very helpful to us.\n\nThat acquisition has been very helpful to us with our commercial business. Our commercial business growing at about 35% year over year in terms of revenue. Like to lean into that, like to accelerate that growth, making that a priority to make that happen. And in the fullness of time, we'll have more to say about Precor, particularly now that we have more bandwidth to be able to think about the role it plays in our long-term strategy.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nThat makes sense.\n\nPeter Stabler -- Head of Investor Relations\n\nVictor, we'll take one more question.\n\nOperator\n\nThank you. One moment. And our last question comes line of Arpine Kocharyan with UBS. Your line is open.\n\nArpine Kocharyan -- UBS -- Analyst\n\nHi. Good morning. Thanks for taking my question. In terms of your previously announced $800 million of cost-saves, and I appreciate that you're probably looking at many moving parts to that.\n\nBut just if you could sort of bring it all together and outline what's the latest and some of the buckets that you're looking at and overall cost savings you should be targeting sort of more medium term? Just trying to understand, have you identified any areas where that initial expectation of how much you could cut could be much bigger than thought? And then as a quick follow up, now that you've done some testing of removing that upfront cost for the customer to have them pay higher subscription over time, do you have a more kind of updated sense of what incremental demand opportunity that is for you? Some numbers, if you could share whatever you're looking at. Thank you very much.\n\nLiz Coddington -- Chief Financial Officer\n\nSo with regard to the cost savings, so I might -- it was a little bit hard to hear on the phone, but I believe you're referring to the the restructuring plan that we laid out back in February, that $800 million of which $500 million was opex and $300 million was cost. So we're actually tracking ahead of the $500 million opex target at this point. And we'll continue, like we said, to right size the cost structure of the business to align with the run rate of the business and whatever that requires. Some of the things that we've announced, the 3PL strategy shift as part of that cost savings opportunity.\n\nOn COGS -- sorry, but actually the 3PL shift is more related to the COGS side, excuse me. So on COGS, our savings is coming from that for the most part and also some headcount reductions. For that $300 million piece, we said that that was going to take longer than it will, in part because we have the very dependent on inventory. And so that will take more time as we move through the inventory that we already have to be able to realize some of those cost savings.\n\nBarry McCarthy -- Chief Executive Officer\n\nIt's a function of the way we account for inventory.\n\nLiz Coddington -- Chief Financial Officer\n\nYeah.\n\nBarry McCarthy -- Chief Executive Officer\n\nAnd then I'm pretty sure I didn't understand the second piece of the question related to upfront cost and subscription.\n\nArpine Kocharyan -- UBS -- Analyst\n\nNow, now that you've done some testing of removing that upfront cost and have the customer pay higher subscription, do you have a -- because last time you shared some sort of helpful numbers. Do you have a more updated view or sense of what incremental demand that unlocks for you over time?\n\nBarry McCarthy -- Chief Executive Officer\n\nOh, I see. This is related to the rental program with SAAS, I think.\n\nArpine Kocharyan -- UBS -- Analyst\n\nThat's right. Yeah.\n\nBarry McCarthy -- Chief Executive Officer\n\nWell, and I think what I said on the call earlier, I should reiterate here. We're currently at a run rate of about 40,000 units annually and I think a win for us would be something like 125,000, 150,000 a year. And so the the opportunity and the challenge for us is to move it from where we are currently to that higher run rate. How big a challenge will that be? Well, we really haven't marketed yet.\n\nMost people really don't know it exists. And when we do market, it looks like it grows pretty fast. And I'm hesitant to share any numbers because I really don't want it to be misleading. There are a couple of puts and calls which make reading the data a little dicey.\n\nWe have changed price points so the value prop is -- and so we de-tuned the value proposition for consumers, then we included Bike+, then we removed Bike+, and we put -- now we're putting Bike+ back in. When we put Bike+ back in, we saw a 74% increase in volume over eight weeks, week over week. But if we look back to the prior week when we had included Bike+ in the mix, it was only like a 35% increase over nine weeks. OK.\n\nBut it's still a 35% increase over nine weeks. And that's because we started to broaden the marketing of the FAAS program and create awareness for it. So really the question is how high is the glass ceiling? And I don't know how long it will take us to get there. My intuition is that we're on to something really important.\n\nThe FAAS users, as I said, are younger. It skews slightly more female. And the big surprise for me, they're actually more engaged than our core users, which isn't what I expected, since they had a less of the financial investment in the product. Maybe that reflects the younger age demo.\n\nI'm not sure, and we'll have to see if that continues to scale as we broaden the market. But it's quite clear that there's a big opportunity for us in the value conscious segment of the marketplace. And so we're going for it.\n\nArpine Kocharyan -- UBS -- Analyst\n\nThank you very much.\n\nPeter Stabler -- Head of Investor Relations\n\nThank you, everyone, for your time today. Hope you all have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPeter Stabler -- Head of Investor Relations\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nBarry McCarthy -- Chief Executive Officer\n\nLiz Coddington -- Chief Financial Officer\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nRon Josey -- Citi -- Analyst\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nKaumil Gajrawala -- Credit Suisse -- Analyst\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nYoussef Squali -- Truist Securities -- Analyst\n\nArpine Kocharyan -- UBS -- Analyst\n\nMore PTON analysis\n\nAll earnings call transcripts"
}