{
  "companyName": "3D Systems",
  "companyTicker": "DDD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/3d-systems-ddd-q3-2022-earnings-call-transcript/",
  "content": "3D Systems (DDD 1.65%)\nQ3 2022 Earnings Call\nNov 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning and welcome to 3D Systems conference call and audio webcast to discuss the results of the third quarter 2022. My name is Kevin, and I'll facilitate the audio portion of today's interactive broadcast. [Operator instructions] At this time, I'd like to turn the call over to Russell Johnson, vice president, treasury and investor relations. Please go ahead.\n\nRussell Johnson -- Vice President, Treasurer and Investor Relations\n\nGood morning, and welcome to 3D Systems' third quarter 2022 conference call. With me on today's call are Dr. Jeffrey Graves, president and chief executive officer; Michael Turner, executive vice president and chief financial officer; and Andrew Johnson, executive vice president and chief legal officer. The webcast portion of this call contains a slide presentation that we will refer to during the call.\n\nThose following along on the phone who wish to access the slide portion of this presentation may do so on the investor relations section of our website. For those who have access to streaming portion of the webcast, please be aware that there may be a few seconds delay and that you will not be able to post questions via the web. The following discussions and responses to your questions reflect management views as of today only and will include forward-looking statements as described on this slide. Actual results may differ materially.\n\nAdditional information about factors that could potentially impact our financial results is included in last night's press release and our filings with the SEC, including our most recent annual report on Form 10-K and quarterly reports on Form 10-Q. During this call, we will discuss certain non-GAAP financial measures. In our press release and slides accompanying this webcast, which are both available on our investor relations website, you will find additional disclosures regarding these non-GAAP measures, including reconciliations of these measures with comparable GAAP measures. Finally, unless otherwise stated, all comparisons in this call will be against our results for the comparable period of 2021.\n\nWith that, I'll turn the call over to our CEO, Jeff Graves, for opening remarks. \n\nJeff Graves -- Chief Executive Officer\n\nThanks, Russell, and good morning, everyone. I'll open this morning with a few comments on the current business climate, our position in the markets, and a summary of our Q3 performance. After that, I'll turn the call over to our new CFO, Michael Turner, for a more detailed review of our third quarter results. I know that many of you are looking forward to hearing from Michael for the first time.\n\nHaving joined the company in September, Michael has already proven to be an excellent leader of our finance organization and a valuable addition to our executive team. So welcome aboard, Michael. Reflecting on the year to date, the global economic and geopolitical backdrop has compounded existing supply chain disruptions created by the COVID pandemic. While these macro headwinds are negatively impacting many companies, the good news for our industry is that customers are increasingly adopting additive manufacturing in their production operations in order to reduce supply chain risks, enhance product design flexibility, and reduce manufacturing costs.\n\nThis gives us an opportunity for growth even in a more cautious capital investment environment. For 3D Systems specifically, we benefited this year from our prior efforts to focus and streamline the company while significantly strengthening our balance sheet. This has allowed us to make important investments in new technology platforms and in operational efficiency initiatives, which are already showing results. Our customers are confident that once recession fears subside, we will emerge from this period stronger than ever with a completely refreshed product lineup and efficient operational footprint and the scale needed to support their growth.\n\nIn the meantime, we're focusing intently on execution, profitability, and cash performance, which is what our customers and our shareholders expect from an industry leader. On behalf of my nearly 2,000 dedicated 3D Systems colleagues around the world, as we finish out the year and look ahead to 2023, I can tell you that we're proud of our leadership role in the additive industry and very confident about the future. Turning then to Slide 5. Reflecting on our third quarter, we delivered results that were basically in line with our internal expectations and, in some areas, exceeded them.\n\nFrom an operating standpoint, high inflation is impacting both purchase components and labor costs. We're taking pricing actions, where possible, to offset these pressures, but there's typically a lag effect that can put a drag on quarterly performance. In addition, the strength of the U.S. dollars clearly impacted our financial performance.\n\nMichael will shed more light on these factors in a few moments. On the positive side, supply chains are showing signs of initial stabilization. And if no further disruptions occur, we expect this trend to continue. Our engineers have worked hard to increase our component supply base and to design our new products with more sourcing options in mind.\n\nWith regard to our in-sourcing of manufacturing, I'm very pleased with the progress we've made in our Rock Hill, South Carolina production facility, which we took over mid-quarter from a contract manufacturer. This plant will soon produce over 40% of our polymer printing systems. We expect that percentage to grow rapidly as our investments in people and technology gain momentum. In the third quarter, we were pleased to see our production rates increase, our productivity improve, and our gross margins begin to expand as the workforce transition to 3D Systems management.\n\nI want to give a sincere shout-out to our new manufacturing colleagues in South Carolina. Your efforts are noticed and greatly appreciated. From a broader standpoint, inflation is taking a significant toll on global markets that are dependent upon discretionary consumer spending. As consumers spend more on daily necessities like food and gasoline, they have less to spend on optional items.\n\nFor us, this impacts our dental markets and particularly, our orthodontic products. While this is still a great business that we're fully committed to, key customers have slowed their spending, which, while largely anticipated in our previous guidance, can clearly be seen in our financials. Fortunately, we expect this business to strengthen once the economy normalizes, but this may take some time. More to come on our market dynamics in a few moments, but for now, I want to give you a clear understanding of our position in the industry and how our business model works in this volatile climate.\n\nAs additive manufacturing and production environments becomes widespread, we're very well-positioned to enable rapid adoption across virtually all market verticals. The reasons are twofold. First, we have the greatest experience base to draw on. With over 20,000 production printers active in the field, consuming almost 5,000 tons of our proprietary materials each year, our customers produce over 1 million parts every day using our technology.\n\nThis output is greater than the entire rest of the industry combined, giving us unparalleled experience in the management of large fleets of printers and in the integration of complex workflows in our customers' factories around the world. Second, over the last two and a half years, we've reorganized and restructured our company into two market-facing business units, industrial solutions, and healthcare solutions. This enables us to focus on market-specific applications, developing with our customers the most effective manufacturing workflows and then supporting the transfer of these technologies into their factories. Once complete, additional workflows are then added and manufacturing capacity expanded to support their growth plans.\n\nThis approach has proven highly effective, and we believe it will drive exciting growth for our company in the years ahead. This operational model is one that we increasingly see mimicked by others around our industry, but the key to success is having a full complement of metal and polymer printing technologies supported by software expertise and a wide range of production materials. It is the combination of these elements, to address specific high-value applications, that our customers are looking for in a partner. That is what sets our company apart from the competition, and this gap continues to grow.\n\nToday, at 3D Systems, our core technology span, not only the broadest range of metal and polymer systems in the industry but now also include the unique materials and printing systems that I broadly refer to as biologics. These truly groundbreaking materials and printing technologies are essential in addressing biological applications within the human body and in the development of new methodologies for drug development. When viewed in total, this unique combination of technologies and application expertise in a company with global scale allows us to assume a leadership position in the additive industry as we now enter true production environments. With that introduction, I'll now turn to Slide 6 for a brief overview of the quarter.\n\nFor the consolidated company, after adjusting for businesses that we divested during 2021, revenue for the third quarter decreased 3.2% year over year. However, adjusting for the impact of foreign currency fluctuations, consolidated revenue increased 2.7%, showing the significant negative impact of the strong U.S. dollar. While this growth rate is much lower than we would like, we fully expect to meet our long-term expectations of double-digit organic growth in the years ahead, as consumer spending rebounds and additive manufacturing takes hold in production environments across virtually all market segments.\n\nTurning to our divestiture-adjusted segment performance in the third quarter. Revenue for our industrial solutions segment was flat year over year but increased nearly 9% in constant currency. Revenue for our healthcare solutions segment decreased 6.6% per year and decreased 3.5% in constant currency, driven by a substantial slowing of our dental segment due to softer consumer spending. As we saw last quarter, the FX impact on our industrial solutions segment was most pronounced due to that segment's exposure to manufacturers and service bureau customers in Europe and Asia Pacific.\n\nWith that said, the currency impact on healthcare solutions sales was also material. In our industrial solutions business, we saw regional variations in the third quarter. In Europe, the war in Ukraine and uncertainty regarding recession and energy supplies continue to pressure our customers. This is impactful given our industrial solutions segment's historically strong market presence in Europe and particularly, in Germany.\n\nOn the positive side, demand in the Americas remained robust during the third quarter and with strong SLA printer sales into the energy and commercial space verticals. We also saw solid demand for our recently acquired Titan printer platform among consumer goods and defense customers. In our healthcare solutions business, the third quarter performance varied sharply by market. In our medical devices business, we saw significant year-over-year growth in printer sales to customers who manufacture orthopedic and surgical instrumentation.\n\nAnd our industry-leading business of providing virtual surgical planning packages and other personalized healthcare solutions for doctors, surgeons, and hospitals had a strong quarter as well. The broader story here is the demand for nonelective surgical procedures is holding up well despite economic uncertainty. Within that strong market, 3D system stands out for best-in-class suite of products, strong regulatory infrastructure, and our years of experience using additive manufacturing solutions to improve patient outcomes. However, the biggest factor for our healthcare solutions business during the quarter was a significant year-over-year decline in dental market sales, particularly in the orthodontic area.\n\nAs we communicated to our investors last quarter, we were aware that this decline was coming. And our general results for the third quarter, while disappointing, were roughly in line with our expectations. It's difficult to gauge how long this softer demand might last because it's so dependent on how macroeconomic conditions evolve over the coming quarters. We expect this business to eventually recover and to be a strong contributor to our growth and profitability.\n\nSo, despite these ups and downs, we believe we now have good visibility into our broad business performance for the remainder of this year. This is why, as Michael will describe for you in a moment, we're updating our full year 2022 guidance to significantly tighten our revenue range while improving the forecast for operating expenses to reflect strong execution and cost controls. Turning to Slide 7. I'd like to highlight some advancements from the third quarter.\n\nThese are not only interesting in isolation, but they also provide valuable insights into the type of core activities that will drive our company's growth in the next five years. As I described for you on our last quarter's call, we agreed during the third quarter to acquire dp polar, the Germany-based developer of the industry's first additive manufacturing system designed for true high-speed mass production of customized components. I'm pleased to report that we closed this acquisition in early October, ahead of schedule, and integration efforts are well underway. I can't emphasize enough the importance of bringing this revolutionary printer technology into the 3D Systems portfolio.\n\nThe machine's continuously rotating build platform can print jetted polymer parts up to five times faster than today's batch process systems, which represents a quantum leap toward true mass production of custom componentry using additive manufacturing. We plan to move forward with this technology as fast as possible with a critical mass of dp polar machines moving into beta testing with key customers in 2023 and initial commercial sales targeted for 2024. If any of you are planning to be at the upcoming Formnext Trade Show in November, I strongly encourage you to visit the dp polar booth and see this exciting new system for yourself. With our metal printing portfolio, we continue to leverage the unique capabilities of our applications innovation group, along with our strong lineup of metal printing technologies, to drive solution sales to customers in both industrial and healthcare segments.\n\nOur technological advantage is primarily in our atmosphere control system, which is the industry's best for the manufacture of reactive metals such as titanium, nickel, and refractory metal alloys. We've been very successful recently with customers in commercial space and medical devices, both of which are extremely well suited to our technology and the type of application-focused customer-specific printing solutions in which 3D Systems is long specialized. During the third quarter, we also announced several significant additions to our materials portfolio. On the polymer side, we introduced two new production-grade materials, tough clear for our Figure 4 projection-based printing platforms, and DuraForm PAx Black for SLS printer line.\n\nBoth of these materials address critical applications with key customers across several market verticals. On the metals front, we introduced new copper nickel alloy, CuNi30, which is now certified for use on all of our DMP metal printing solutions. This copper nickel alloy was developed in close collaboration with Newport News Shipbuilding, which is a division of Huntington Ingalls Industries and is the largest shipbuilding company in the United States. Copper can be particularly challenging to 3D print due to its high reflectivity.\n\nHowever, it's an ideal material for extremely demanding applications in marine systems, chemical processing plants, oil and gas, and of course, rocketry. Turning to Slide 8, and before I hand off to Michael, I want to highlight the tremendous progress we're making on one of my most important goals for 3D Systems, namely the creation of a world-class regenerative medicine business. As I've shared with you previously, our efforts in this area are currently proceeding along three primary lines: First, through a long-standing partnership with our biotechnology partner, United Therapeutics, we've achieved remarkable progress toward our goal of 3D printing functional human organs for transplantation, initially targeting lungs, but now with an expanded scope, including livers and kidneys. Our partner announced publicly this summer that our goal is to have printed organs in human trials within five years.\n\nSecond, building on the organ program's technological progress, we've expanded into the adjacent field of printing non-organ human tissue for transplantation and surgical reconstruction applications. More details regarding this exciting initiative will be announced in the months ahead. But today, I want to focus on the third initiative, which is summarized on Chart 8. In this case, we're leveraging our expertise in creating vascularized human tissue and combining this capability with our polymer printing expertise to develop and manufacture highly differentiated organs on chips for use in drug discovery and development by the pharmaceutical industry.\n\nDuring the third quarter, we marked a major milestone in this initiative with our announcement of the formation of a new wholly owned biotech company called Systemic Bio. This subsidiary is being managed as an internal start-up with its own dedicated management team and R&D staff. We've committed to support Systemic Bio with an initial seed investment of $15 million, which should sustain the company until it reaches a material level of revenue and profitability. One point that I want to emphasize is that Systemic Bio's go-to-market strategy will differ from 3D Systems' traditional business model.\n\nDue to the unique value of the printed products themselves and the sensitivity of this novel technology platform, Systemic Bio will not sell printers and materials, rather it will work with customers to develop organ and disease-specific human models for organs on chips, and then we'll market those chips directly to pharmaceutical and biotech companies engaged in drug discovery. To support the business model, Systemic Bio has invented a novel patent-print pending organ-on-a-chip platform which we call h-VIOS. This stands for human vascularized integrated organ system. This platform is comprised of 3D-printed microfluidic components and bioprinted vascularized 3D scaffolds.\n\nOnce printed, these custom-designed vascularized scaffolds are then seeded with any desired combination of healthy or disease cell types for Houston drug studies. We're producing h-VIOS chips daily at our state-of-the-art laboratory in Houston, Texas, where they're being tested by our Systemic Bio's team of scientists to validate their use for modeling specific organ and disease functions in collaboration with key pharma customers. As you can see in the images on Slide 8, virtually any desired vasculature architecture can be printed and then mass produced to develop the statistical data needed for drug studies. Turning to Slide 9.\n\nLet me emphasize what differentiates Systemic Bio's technological approach from those in the market today and therefore, why we're so excited about this new business. The 3D bioprinted fully integrated vasculature contained within 3D -- within Systemic Bio's h-VIOS chip can closely mimic human organ structures, allowing for active perfusion of blood through the tissue sample, as shown in the lower left image, where you can see blood flow through the printed structure. This vasculature is critical for cell survival as the blood flow is needed to bring nutrients to the implanted cells and then remove waste products just as the process works within your body. You can see the success of this approach in the lower right-hand image on Slide 9, with the green regions being human cells that have thrived in this printed tissue sample for over 28 days.\n\nThis is unique, and it's the true magic of the h-VIOS system. The cell types comprising these tissues can be of any type. For example, on one end of the chip can be human liver cells, and on the other end can be cancer cells with the printed blood vessels connecting them together in a continuous circuit. Developmental drugs can then be introduced to evaluate the interaction with both the healthy cells and the cancer cells in a continuous blood flow environment with an ability to create virtually any combination of tissues at high volumes.\n\nFor evaluation using this technology, we believe that the drug development cycle can be shortened, success rates enhanced, and the use of animal testing ultimately eliminated over time. From a financial standpoint, our goal is to establish key contracts with the pharmaceutical industry companies over the next year to affirm the technology and incorporate it into drug development protocols. Needless to say, I'm tremendously excited about the potential of this new business, and I'm driving to see early customer validation of our technology. Investors in our company should note that we believe Systemic Bio, given its highly advanced bioprinting and biomaterial capabilities and its business model of selling proprietary h-VIOS chips rather than printing technology, has the potential to achieve profit margins more like a biotech company than a manufacturing technology supplier.\n\nBased upon early customer feedback, I believe Systemic Bio could be a $100 million revenue company within five years. I'm confident that we'll announce the first agreement with a major pharmaceutical company in the near future, and we look forward to sharing the progress with you. Before I turn the call over to Michael, I'd like to close my remarks by turning to Slide 10 to highlight our software business. 3D Systems has long been an innovator in 3D printing software, offering specialized applications such as Geomagic, 3D Sprint, and 3D Experts.\n\nWe advanced that position significantly in late 2021 by acquiring Oqton, a leading provider of software solutions to utilize AI and machine learning to help manufacturers intelligently automate their entire digital production workflows. Since the acquisition of Oqton, we've transformed our entire software go-to-market strategy. All software operations are now under a single management structure with that being Oqton. And we're integrating 3D Systems legacy stand-alone applications into the Oqton manufacturing OS.\n\nThe end-to-end result will be complete cloud-based digital manufacturing solution that is hardware-agnostic and technology neutral. It will be able to seamlessly integrate the entire factory floor across multiple sites with a digital thread that provides complete control and traceability of every action in the manufacturing workflow from order to delivery. The combined suite of Oqton and 3D system software provides, by far, the most complete and feature-rich software offering in the additive industry today, as shown in the comparison table on Slide 10. While customers themselves can put together point solutions for each feature, an approach commonly called do-it-yourself, or DIY, they're hesitant to do so given the cost and complexity of the approach.\n\nThe only alternative to this approach are the leading CAD suppliers shown in the middle column or other 3D equipment manufacturers who, at best, have only a fraction of the capability spectrum that Oqton offers. And we will continue to refine and add to the Oqton offering over time through both R&D investments and through commercial partnerships with leading players in the field of industrial automation. As just one example of our development road map, Oqton is in partnership discussions with major manufacturing partners that would include joint development of new software functionality in part identification, e-commerce, and cataloging. Most importantly, the new integrated Oqton suite of applications not only leads the industry, it has the potential to become a key enabler of true serial scale additive manufacturing that can make an impact on our entire industry.\n\nFor this reason, we have opened Oqton's availability to the entire additive manufacturing industry. This includes all elements of the new Oqton platform, including the historical 3D Systems printing software, as we believe it will have a tremendous impact on the acceptance of additive manufacturing broadly. To facilitate industrywide adoption, the Oqton business is run as a stand-alone operation with a high priority on protection of user-sensitive data, including externally audited firewalls to ensure security and confidentiality. With this approach, Oqton is gaining traction every day and now has customer wins in the automotive, aerospace, contract manufacturing, healthcare, and dental markets.\n\nWith growth potential ranging from double to triple digits, we're very excited about the future of this software platform. And with that, I'd like to turn the call over to Michael to review our third quarter financial results. Michael?\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nAll right. Great. Thanks, Jeff, for the warm welcome. I'm excited to be here, and I look forward to upcoming opportunities to meet our investor and analyst community directly.\n\nBefore I start, I'd like to remind everyone that 3D Systems made three significant divestitures in 2021. The earnings release that we issued last night contains tables with non-GAAP measures relating to our 2021 results, from which we excluded the impact of the 2021 divested businesses. Likewise, on today's call, any reference that I'll make to our 2021 results will be on that same ex divestiture basis. The point of this adjustment is to make our 2022 results comparable to our 2021 results on an organic basis.\n\nStarting out on Slide 12 of the presentation. As Jeff discussed, our revenue results for the quarter were generally in line with our expectations with some bright spots in certain areas that we will highlight to you this morning. As we saw last quarter, the overall business environment during the third quarter remained challenging due to continued FX headwinds, inflationary pressures, recessionary fears, persistent supply chain challenges, and geopolitical tensions. However, the biggest headwind we faced during the quarter, which we expected and called out in our revised Q2 guidance, was a significant year-over-year decline in revenues from dental market customers.\n\nRevenue for the third quarter was $132.3 million, a decrease of 15.3% versus the prior year. Excluding divestitures and the unfavorable impact of FX, revenue increased by 2.7% compared to the prior year. This top-line growth reflects continued solid demand in both our industrial and healthcare segments, partially offset by weakness in dental market sales, which, as you know, represents a significant portion of our overall business. Just to quantify the impact on revenue from some of the factors I mentioned earlier, starting with FX.\n\nWe experienced headwinds of over $8 million related to the sharp appreciation of the U.S. dollar that occurred during the third quarter, which reduced the U.S. dollar value of our international sales made in foreign currencies, which typically represents roughly 40% of our total sales. There may have also been some third quarter international sales that did not materialize because, in some cases, we price our overseas product offerings in U.S.\n\ndollars. And in these cases, the customer has to convert more of their local currency earnings into U.S. dollars to pay us, which represents a price increase for them and can therefore result in some lost sales. On our second quarter earnings call, we highlighted two additional items that had an adverse impact on our year-over-year revenue growth: one being the Russia-Ukraine conflict and the other being persistent supply chain disruptions.\n\nBoth of these items had less of an impact during the third quarter. Regarding sales to Russia. While our second quarter of 2021 sales to Russia were relatively material, by the start of the third quarter of 2021, we had largely exited the Russian market. And as a result, our year-over-year revenue comparisons for the third quarter were much less impacted than what we saw in Q2.\n\nAnd on the supply chain front, you'll recall that we commented on the impact of these disruptions, including component shortages, as well as inefficiencies and portions of our contract manufacturing network that caused us to get behind on supply to orders. We estimate that the total impact of supply chain issues in Q2 resulted in approximately $9 million of customer orders that we cannot ship as planned. During the current quarter, however, we were able to significantly catch up on many of these late shipments. And as a result, we estimate that we had approximately $2 million of firm customer printer orders that we're unable to ship due to supply chain delays.\n\nI'm pleased to say that this was, in large part, attributable to our decision early last quarter to bring one of our major outsourced printer manufacturing facilities back in-house. This has enabled us to significantly increase the rate of printer production at that facility and thereby work on our backlog of late customer orders, while also having a favorable impact on gross profit margins. And lastly, for consolidated year-to-date revenue, looking back over the first nine months of the year, we grew revenue, excluding divestitures and the unfavorable impacts of FX, by 7.6%. Despite a very challenging operating environment, we were able to achieve year-over-year revenue growth for the first nine months of the year in the high single digits.\n\nTurning now to Slide 13 for a review of segment revenues. For our healthcare solutions segment, revenue, excluding divestitures and the unfavorable impact of FX, decreased by 3.5% as compared to the third quarter of the prior year, while revenue excluding divestitures and the unfavorable impact of FX in our industrial solutions segment increased by 9% year over year. The biggest driver of the decline in healthcare solutions was a sharp reduction in spending by certain key dental customers in the market for elective orthodontic procedures. High inflation, reduced consumer confidence, and geopolitical factors are negatively impacting patient demand for such elective procedures, resulting in lower caseloads.\n\nAt this time, we cannot say with confidence how long the weaker dental demand environment will last, given that it is so heavily dependent on how macroeconomic and other factors evolve over the coming quarters. But starting last quarter, we have incorporated this revised view into our 2022 revenue guidance. And at this point, we do not foresee a material improvement for the rest of 2022. Outside of dental, we saw a healthy growth in some of the other major business lines within our healthcare solutions segment, including strong sales to customers at 3D print various types of medical devices, such as orthopedic implants and surgical guides.\n\nAdditionally, our sales of virtual surgical planning and point-of-care solutions, the doctors, surgeons, and hospitals grew very nicely in the third quarter. These business lines tend to serve patients needing surgical procedures that are less elective in nature. Therefore, demand in this area has held up very well despite macroeconomic uncertainty. As Jeff noted, 3D Systems is recognized as a leader in the surgical planting field with the ability to combine 3D printing services, software, and materials to create an integrated end-to-end surgical package in a way that our competitors cannot.\n\nTurning now to our industrial solutions segment. Industrial revenue growth was driven by continued strength in precision microcasting applications and for production machines in energy and commercial space applications. Offsetting this were lower sales and automotive applications, largely because of a tough year-over-year comparison provided by some large deals in the third quarter of last year that did not repeat in the current year. As Jeff noted, we're starting to see good sales tractions with our Titan family of printers, which we acquired in 2021.\n\nOverall, both of our polymer and metal printers continue to sell well across our industrial solutions segment. Moving on to gross profit on Slide 14. Our gross profit margin was 39.8% compared to 41.2% in the prior year. The decrease in margins is due to multiple factors, including 2021 divestitures of noncore assets, inflationary impacts on input cost and freight, and product mix changes, mostly related to selling more printers and less materials than in the prior year.\n\nI'd also like to note that while margins are down on a year-over-year basis, we have seen some sequential improvement with 190-basis-point increase from Q2, driven by the full run rate impact of price increases announced earlier in the year, as well as the early benefit of bringing some of our outsourced printer production back in-house during the quarter. Turning now to operating expenses on Slide 15. GAAP operating expenses increased 6% or $4.9 million to $86.4 million in the third quarter of 2022 compared to the same period a year ago. This includes a $9 million increase in legal and other settlement costs, partially offset by decreases in expenditures due to divestitures.\n\nOn a non-GAAP basis, which excludes nonrecurring charges and divestitures, operating expenses were $58.3 million as compared to $49.3 million from the same period a year ago. The higher non-GAAP operating expenses reflect spending in targeted areas to support future growth, including expenses from acquired businesses, research and development, and investments in corporate infrastructure. We did, however, see some sequential improvement in operating expenses as compared to the second quarter of 2022, which reflects our efforts to tighten cost controls in response to the volatile demand conditions that we've experienced this year. Moving now to Slide 16.\n\nAdjusted EBITDA, which is defined as non-GAAP operating profit plus depreciation, was negative $0.3 million for the third quarter of 2022 compared to $11.6 million for the third quarter of 2021. The year-over-year decline in adjusted EBITDA reflects all the factors that we've previously discussed. One callout I would like to mention here is regarding SG&A and R&D expenses from businesses that we have acquired over the last year and a half. These acquisitions represent important investments by 3D Systems, and we expect to contribute significantly to our revenue growth over the coming years.\n\nHowever, for the time being, these acquired businesses in aggregate have yet to generate meaningful revenue for us. As a result, you should expect our adjusted EBITDA to run below our natural potential for a period of time due to the near-term expense impact of recent acquisitions. And for EPS in the third quarter, we had a fully diluted loss per share of $0.30 compared to income per share of $2.34 in the third quarter of 2021. Excluding charges for stock-based compensation expense and other nonrecurring items, as detailed in the appendix of the earnings release that we posted last night, our non-GAAP loss per share in the third quarter was $0.05 compared to non-GAAP earnings per share of $0.05 in the third quarter of the prior year.\n\nThe year-over-year decline again reflects all the factors that we've previously discussed. Now turning to Slide 17 for balance sheet highlights. We ended the quarter with $609 million of cash and short-term investments on hand. Our cash and short-term investments declined approximately $180 million since the end of 2021, driven primarily by $85 million paid for acquisitions and equity investments, cash used in operations of $52 million, capital expenditures of $17 million, and other cash used in financing activities of approximately $13 million.\n\nWe continue to have a strong balance sheet with sufficient cash to support organic growth. As previously stated, we regard 2022 as an investment year, during which we will make additional targeted investments at high potential growth areas of our business and in our corporate infrastructure. This is part of our overall strategy to profitably grow revenue in both the industrial and healthcare segments, as well as to enter new businesses such as regenerative medicine. While we are always willing to consider M&A opportunities as they arise, we are currently focused on integrating and growing the businesses that we have acquired over the last year and a half.\n\nAnd finally, I'll conclude my remarks on Slide 18 with an update on our full year guidance for 2022. As a reminder, we announced a reduction in our 2022 full year guidance during our second quarter earnings call. We took this step because we expect that the challenging macroeconomic and geopolitical environment to put pressure on international industrial solutions sales and because we believe that softer demand for elective procedures would negatively impact our healthcare solutions segment, particularly in the dental market. Our third quarter results were in line with these revised expectations.\n\nAnd at this point in the year, we now have improved visibility into our likely revenue and operating expenses during the fourth quarter. This improved visibility incorporates the impact of certain cost control measures that we have taken to better align our cost with the current revenue environment. Based on these factors, we are updating our full year guidance to significantly tighten our expected revenue range while improving our outlook for non-GAAP operating expenses. Our full year gross profit margin guidance remains unchanged.\n\nPulling it all together, our updated guidance for 2022 is as follows: We expect revenue to be within a range of $535 million to $545 million, we expect non-GAAP gross profit margins to remain unchanged and in the range of 39% to 41%, and we expect non-GAAP operating expenses to be in the range of $240 million to $245 million. This full year 2022 guidance assumes no significant additional changes in the macroeconomic environment that can negatively impact business demand or disrupt our supply chain, such as COVID-19, geopolitical events, or continued foreign exchange volatility. That concludes my prepared remarks. Operator, we are now ready to open up the line for questions. \n\nOperator\n\nThank you. We'll now be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for questions. Our first question today is coming from Troy Jensen from Lake Street.\n\nYour line is now live.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nHey, gentlemen, thanks for taking my question here. Michael, I'm going to start with you. Just you talked about opex between $240 million to $245 million for the year. On a sequential basis, that implies about a $5 million to $10 million sequential increase in opex.\n\nSo, I'm just kind of curious, is that like one-time in nature? Is that for next? And how do you think about opex turning out -- explain the sequential increase, and then how do think of opex growing or declining quarterly on an absolute basis beyond that.\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nYeah. Great question, Troy. So, one driver going from Q3 to Q4 is dp polar, which we closed on in October, as Jeff mentioned. So, we will get the full run rate of their expenses going forward.\n\nWe'll also have slightly higher commission. Sales commissions in Q4 is related to higher sales demand. And I mean, I think you should think about our kind of run rate opex being the Q4 exit rate for now. We'll give you further guidance in 2023 as we get to that point.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nAll right. Perfect. Very helpful. And Jeff, also for you, with Systemic, why carve out just that business segment within your regenerative businesses? I mean, what was so attractive on that, that it required kind of its own stand-alone business versus everything else you're doing in regenerative?\n\nJeff Graves -- Chief Executive Officer\n\nYeah. Thanks, Troy. It's a good question. There's a couple of reasons.\n\nFrom a -- there's two kind of cultural reasons, if you will. Number one, we wanted to drive a real start-up mentality in that business. Because it is a new business, new technology going to market, it is a different customer base than we've historically had. The customer base there are the pharmaceutical companies largely and the companies that are testing new drugs for the pharma companies.\n\nSo, the sales model is different. Also, Troy, as I mentioned in passing, that business model for the business is different than the rest of the company. We're selling -- in that case, we're setting ourselves up to sell these h-VIOS chips, the chips that come off the printer, not the printers themselves. Fundamentally, the printing technology is just too valuable to be selling printers.\n\nWe want to really jealously guard that IP and know-how to do that and sell the product that comes off it. We think the product will be very valuable. We think it will drive exciting not only revenue growth, but gross margin performance. We want real clarity on that that business model works and that the technology is proven.\n\nSo, the best way to do that in my mind was carve it out separately and look at it. In fairness to our shareholders, investors, we wanted to say how much we were going to spend on it. So, we put that flag out there to say we're going to invest $15 million in this business to get it to a material revenue contribution and profitability. And we think we will hit those objectives.\n\nClearly, we want to be able to measure that and report out on it. And beyond that, this gives us optionality to continue to invest ourselves or if we want to bring in outside parties to invest with us in that business, if the capital requirements exceed what we can comfortably do, we want to allow it to grow in its own right as fast as it can logically grow. And the base plan is we'll put that capital in ourselves based on the return we would estimate for it at the time. If that business really requires -- because it is a revolutionary technology, if it requires additional capital we may, at some point, entertain outside investment in it as well.\n\nSo, for all those reasons, we wanted to set it up as a stand-alone business. It is a wholly owned business, and our default assumption is it will be part of the 3D Systems' portfolio forever, but it gives us optionality on how that goes in the future. Does that make sense?\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nMakes perfect sense. And if I could ask just one last follow-up. I'm assuming that the weakness in kind of product sales is more on the systems side, but could you just delineate maybe material demand in the quarter or existing machines being used to the full extent? Or just some color on material demand would be great. \n\nJeff Graves -- Chief Executive Officer\n\nYeah, Troy, as you might guess, with everybody being concerned about where the economy is going, capital spending is certainly, I think, being viewed by our customers are being more conservative in it, which translates to fewer printer sales broadly. We see some sales pushed off. We see some just hesitation on customers. They want to make sure the demand is going to be there.\n\nAnd on the flip side, they're using their assets more heavily. They're bringing 3D printing in and actually using it more heavily in production. So, in that scenario, you see materials going up, new printer sales -- the growth rate in it declining. So that's a quarter-to-quarter variation, and it very much depends on how customers are viewing the future and how much they need their cash.\n\nFortunately, the people we sell to are -- have really good balance sheets. So, it's not that they don't have the money to invest. It's -- they're just mainly being prudent about how they spend their money given all the macro stuff going on, and it has a direct impact on us each quarter. Hard to predict where that goes, but that's the current trend.\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nPerfect, guys. Thanks, and good luck going forward here.\n\nJeff Graves -- Chief Executive Officer\n\nThanks, Troy. Thanks so much.\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Next question today is coming from Paul Chung from J.P. Morgan. Your line is now live.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking my question. So just a follow-up on opex. I think I heard you say the exit rate of maybe $66 million or so on a quarterly run rate business or basis kind of moving forward, is that kind of the pace of opex implied around high single digits for '23? Is that the right way to think about it?\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nWell, so thanks for the question, Paul. We're not prepared to comment yet on 2023. We'll give you that guidance as we get closer maybe on our next call or definitely on our next call. But I think you're directionally thinking about Q4 correctly.\n\nWe hope to beat that number slightly, what you mentioned, but we'll be in and around that ballpark.\n\nJeff Graves -- Chief Executive Officer\n\nAnd Paul, from a longer --\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nOK.\n\nJeff Graves -- Chief Executive Officer\n\nFrom a longer-term perspective, Paul, there were investments we needed to make this year to make sure that basically our back-office infrastructure could support our future growth and do so efficiently. We would expect in future years to start gaining efficiencies in our G&A, if you will, our back-office infrastructure. So, the idea was, that's why we view this as an investment year, not only in R&D, but in G&A, if you will, to make those critical investments to gain efficiency in the future years, OK? You hit our scale, and you just need to do that.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nGreat. And then on gross margins, you're seeing some sequential improvement here after a trough in 2Q. How do we think about margin expansion in '23 as some -- the supply chain costs come down, you get some pricing benefits. And then what is the benefit from in-sourcing, I guess, on the margin line and also impact on opex from in-sourcing?\n\nJeff Graves -- Chief Executive Officer\n\nSo, we'll give you much better clarity on 2023 as much as any company can when the year finishes out, Paul. But I would tell you, all the trends you just mentioned are correct, that as we implement price increases, it takes a little bit to take route and flow through. Some of them are tied to the introduction of new technology, new platforms that bring more value to customers. So, that all -- there's a lag between your cost going up in COGS and your recovery in pricing.\n\nSo, we saw some pricing improvement in the quarter flow through. We expect more of that to come as we go into '23. We've been very careful about not getting out over our skews in advertising manufacturing cost reductions, which again shows up on the COGS line, but they're real. And we saw the initial benefit, as Michael mentioned, in Q3, and we had only done it.\n\nWe had only in-sourced it in about the mid-quarter point, and we already saw benefits from that. So, we expect our gross margins to be consistently improving. Hopefully, Q2 was the low point. We expect it to be consistently improving, but we can't give you specifically a guidance until we get into '23.\n\nWe'll have to see what the macroeconomic outlook is.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nGotcha. And then last one on free cash. How do we think about it to end the year? It's been -- you've seen a usage here for the last four quarters, mostly on lower earnings, but can we start to see some kind of rebound here in free cash flow as we exit the year and look forward to '23? Maybe some moves to in-sourcing helps. I'm not sure.\n\nJust your general outlook there.\n\nJeff Graves -- Chief Executive Officer\n\nYeah, Paul, when people look at the details, you know it's a big tick-up in inventory levels and working capital. That was because of the in-sourcing of manufacturing. We had to pick up a lot of existing inventory from that supplier. It's good inventory.\n\nWe'll burn it down over time, and that will be a cash source for us. And we would expect operational improvements to continue to drive better operating cash flow as well. So, in terms of free cash flow, we're really not a very capital-intensive business. So, cash from operations, we get a nice flow-through into free cash flow because we don't spend a lot of capital inherently on organic growth.\n\nWhere we would spend it on a kind of bolt-on acquisitions or other infrastructure changes, but a lot of the infrastructure changes we've already made. And we don't -- we wouldn't expect that to be a big cash usage going forward. So, as Michael mentioned, we exited the quarter with over $600 million in cash. We did close out the dp polar acquisition after the quarter closed.\n\nBut other than that, we've got a strong balance sheet, and we own the assets we really need to own for the future. We just need to execute now and grow them time.\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nYeah. And I'd just add, right, if you kind of look at Q3, we had roughly kind of in the range of $15 million to $20 million of outflows and cash related to the in-sourcing and manufacturing. So, you strip that out and kind of strip out all the acquisition activity that we've done, and you can see it on the face of our cash flow statement, I think you'll be kind of in the ballpark for what to expect cash flow was.\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you so much.\n\nJeff Graves -- Chief Executive Officer\n\nThank you.\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Next question is coming from Tyler Hunt from William Blair. Your line is now live.\n\nUnknown speaker\n\nGood morning. Thanks for taking my questions.\n\nJeff Graves -- Chief Executive Officer\n\nSure, Tyler.\n\nUnknown speaker\n\nI just want to start off just with dental and healthcare. I know you said that, obviously, growth was down. I was wondering if you could quantify kind of any year-to-date numbers on how much dental is down year over year.\n\nJeff Graves -- Chief Executive Officer\n\nWe didn't break out that number. \n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nNo.\n\nJeff Graves -- Chief Executive Officer\n\nWe didn't break out that number, but it was meaningful. I mean when you look at the orthodontic business for us, if you will, have been growing strong double digits coming into this inflationary environment. And clearly, if you follow that segment of the market, what manufacturers of those products have said is growth rates have declined from strong double-digit performance to more single digits to more flattish performance, all in a very rapid period of time. And what they've attributed it to, which I fully understand, is that consumers are having to decide between mill kegs and gas and straightening their teeth.\n\nAnd in that case, crooked teeth are tolerable for a while. So that's -- I fully expect that market will rebound, and it's -- we've got great technology, great channels to market there. But for right now, it's in the doldrums and has really declined rapidly during the year.\n\nUnknown speaker\n\nRight. Thanks for the additional color on that. And then I guess my follow-up would just be on the pricing, you said there's kind of a lag in pricing. When should we kind of see that effect take part? And kind of just like a long term, not really '23 guidance, but just getting back to your long-term goal to gross margin of 50%, kind of where do you see that trajectory now?\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nSo I'll start with your question on pricing. I mean, I think that we've seen the full run rate of the price increase in Q3, the price increases announced earlier in the year. So, you can kind of expect that not change materially going forward into Q4. And in 2023, I mean, we're not going to -- like I said, we're not going to comment on specifically, but I'll just say that we'll continue to monitor input costs and make price adjustments where we can.\n\nBut for now, I think the run rate that you're seeing in Q3 is indicative of where we are for the near term.\n\nJeff Graves -- Chief Executive Officer\n\nIf you look at what we've said from the past and now is the pricing opportunity on existing products is always a bit tricky to drive that because it is usually a capital item for our customers, at least on the printer side. Materials is a little more opex for customers. So, an opportune time to look at pricing strategy is really when you introduce new products. And we set out at the beginning of '22 to refresh our entire product line over the next two years.\n\nSo '22 and '23, most of that will happen in '23. And those are always the opportunity to set new pricing points with new products hitting the market.\n\nUnknown speaker\n\nOK. Thank you for the color on that. That's it for me. All right.\n\nThank you.\n\nJeff Graves -- Chief Executive Officer\n\nThanks, Tyler.\n\nOperator\n\nThank you. Your next question is coming from Wamsi Mohan from Bank of America. Your line is now live.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nYes. Thank you. Good morning. I was wondering if you could help characterize perhaps how 3D Systems is positioned going into a potential downturn here.\n\nIn terms of maybe revenue margin levers and cash flow, maybe if we take a hypothetical case, we've seen revenue compression 10%, not unreasonable in a decelerating environment. Could you -- I'm not saying that's what's going to happen, but if it were to happen, how should investors think about what would be the flow-through of that? What sort of levers you have to pull? I know it's a little bit of a tough question given that's not maybe how things will play out. But at the same time, investors want to get some sense of comfort around where the trough and potentially margins and cash flows are. So, anything you can do to help us there would be great.\n\nJeff Graves -- Chief Executive Officer\n\nSure. Yes, as a backdrop to that answer, Wamsi, I would tell you, it's a marvelous time to have a strong balance sheet. And we had -- because of our divestitures and our other actions in the capital markets in '21, we came into '22 with an excellent cash position, and we've maintained that cash position largely in the year. We feel really good about our base foundation.\n\nIn terms of flexibility going forward, yeah, you never know where the economy is going and what's going to happen on the top line and also with all the currency fluctuations. Hopefully, the dollar recently kind of plateauing will be stable now for a while and that won't be an additional headwind. The economy is anybody's guess. A lot of our business is not discretionary business.\n\nSo, you would expect outside of dental and maybe a few procedures that are medically oriented, unless the economy gets really bad, those procedures don't get pushed out. So, in terms of revenue impact, it's anybody's guess, but certainly, there is some downside if the economy gets worse, but probably a little bit more modest than many other industries. On the cost side, we've got all the normal levers. And we've got labor costs.\n\nI am pleased the supply chains are starting to at least stabilize and now hopefully improve. Wamsi, you follow many industries. You know the -- like computer chips were a real issue early in the year. Those have really moderated quite a lot.\n\nSo, components are easier to buy. We're even starting to be able to negotiate some pricing on componentry. So, that's all a good thing. And then, of course, we have labor costs if volumes drop off.\n\nSo, we have all the normal levers to pull, and we will do that. We've tried to maintain our initiatives in 2022 really hard. So, you can view that as, yeah, we've spent a lot of money on in '22, but that's then all available to us if we need to cut back in '23. Those are all things that can, in the future, be done.\n\nSo, Michael, I don't know if you have any other --\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nYeah. No, you hit all the right comments, I would just say. Just kind of double back on the strength of our balance sheet and capital structure, I mean, we do have enough liquidity to weather, I think certainly any near-term storm. And when combined with other levers that Jeff mentioned, I think we're very well-positioned.\n\nJeff Graves -- Chief Executive Officer\n\nAnd Wamsi, it's interesting, too. I don't know if this was included in your question, but from a labor standpoint, we're -- given that the company is healthy and we have a strong balance sheet, we've been able to attract really nice talent to the business. So, availability of talent is not an issue, how much labor you have is dependent on how much business that you have to do. But in terms of attracting good labor, it's been a really good situation for us.\n\nThe issue that every company faces is labor costs have gone up a lot because of inflation. And you have to be sensitive to employees' needs on that front. So, we've tried to make adjustments in our pay scales, if you will, to address that. Very hard to keep up on that.\n\nSo those are -- that's kind of the challenge part of it. But we've got all the normal levers to pull if times get harder, and we will pull them. I'll end by saying we are heavily focused on execution. We own the assets we need to own.\n\nWe now need to execute with those assets, and we're focused on profitability and cash performance. That is our priority, OK? The top-line growth, we hope will be there in these markets rebound. But our priority now is executing on what we've invested in and drive profitability and cash performance.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nOK. Very clear. Thank you so much.\n\nJeff Graves -- Chief Executive Officer\n\nThank you. \n\nOperator\n\nThank you. [Operator instructions] Our next question is coming from Shannon Cross from Credit Suisse. Your line is now live.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you very much. I just had a question with regards to the comments you made about maybe losing some sales due to U.S. dollar strength, which I think, to some extent, plays in the pricing, obviously, given how the currency impacts some of the purchasing decisions overseas. So, I'm wondering what led you to say that.\n\nAnd how you're thinking about pricing from the standpoint of international? Do you think you need to take it down to sort of offset currency pressure or where you price in U.S. dollars? Or just in general, what you're thinking about in terms of elasticity of demand there.\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean I think I would just say a couple of general comments, Shannon. So, number one, we're always evaluating perfect ways to the price and assessing risk with regards to international sales. Maybe we overstated it a little bit, but I would just say that in general, we have some FX headwinds, right? And those FX headwinds can come in the form of -- in two forms, right? It's just the foreign-denominated sales that you do make.\n\nIt's translated to lower U.S. dollars, and the stuff that you're traditionally pricing in U.S. dollars overseas generates a little more headwinds and may affect your pricing or it may impacted you losing sales, but it's going to have the same kind of net overall impact to us as a business.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nOK. And then --\n\nJeff Graves -- Chief Executive Officer\n\nNo, [Inaudible] but, yeah, it's OK. I think we probably commented enough. Go ahead with your next question. \n\nShannon Cross -- Credit Suisse -- Analyst\n\nOK. No, I was just wondering, can you talk a bit more about Systemic -- or Bio Systemic? Because what I'm thinking is that those on the call, including myself, are not biotech analysts. So, I'm just wondering, as we look forward, what sort of both qualitative and quantitative milestones should we watch for to show that everything is trending in the right direction?\n\nJeff Graves -- Chief Executive Officer\n\nYeah. So, I would say it's probably a little bit qualitative, but we will be as quantitative as we can in terms of contracts that we land. So, we're -- we're in discussions with multiple pharmaceutical companies now about demonstrating the model, make sure the models work. This is not a brand-new concept.\n\nWhat is new is the technology that we can offer with printed vasculature inside the tissue, which allow cells to live. And if cells can live for, say, a month, then you can do an effective drug study on those cells. So, it's really attractive to pharma companies. We have to demonstrate the model works, and then you can do it with good statistics.\n\nExternally, what you should watch for are announcements of contracts. Wherever we can, we're going to announce them. We're going to announce we've landed them. Wherever we can, we're going to put numbers to those.\n\nSo over time, you want to see those growing. How much financial transparency, some of it depends on how much work we want to put into the actual margin reporting on the business. So, I would think we can talk about revenue growth, and we'll do as much on margins as we can because we want to be pretty transparent. It's a different type of business.\n\nBiotech is a different business. I don't think anyone in this industry has really moved into it yet. And we want -- for biotech investor, we want to really amortize what that business is doing and what it could be worth to make sure we get value for our shareholders for it. So, we'll be as transparent, Shannon, as we can.\n\nFirst indicator would be announcement of contracts, and then we'll give you as much financial information about it as we possibly can.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nAnd are you -- I'm just curious, in your discussions with some of the pharmaceutical companies, are you looking for any strategic investments from those companies or more just a guaranteed contract that would lock in revenue? I'm just -- from a funding perspective, as this grows, I'm wondering how you're thinking.\n\nJeff Graves -- Chief Executive Officer\n\nNo, we don't need any investments right now. We've committed $15 million to it. That's fine to get us to a material scale where we can show to internally and externally that this business is a good business, and it's going to grow from there. So, we've already had people wanting to come up and invest in it with us, but we don't want to take investment too early because I'm afraid we'll give away future value.\n\nIt depends a little bit on how demand grows and what capital requirements there are. If they're really high, we might look at somebody coming in to share the burden with us on the capital investment. If they're low enough, we may do it ourselves. That will just be decided based on the magnitude and the return on investment.\n\nBut we've set it up to give ourselves optionality on bringing in outside investment if we want it, and that's the way we'll run the business right now. I'm really excited to see the first contracts come in and this model demonstrated because truly, Shannon, nobody else can do this in the world right now. These models have a chance to accelerate drug development and obviously reduce the amount of animal testing. That's not just an advertisement for cruelty to animals.\n\nit is a statement that animal physiology is not the same as humans. And that's why the failure rate on drug is one reason why the failure rate on drug development is so high, is you test it in mice and sheep and pigs and so forth to work your way up to scale to trust to go into the humans. And those physiologies are just not human physiologies. So, if we can demonstrate this in a lab that it works with human cells, there's a chance to shorten the cycle, increase the hit rate, and reduce animal testing, which is a win for everybody.\n\nSo that is the value to shareholders that we talk about creating. I want to see it come through in pharmaceutical contracts that we can talk about and show that the business model works.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nGreat. Thank you very much. You're welcome.\n\nJeff Graves -- Chief Executive Officer\n\nYou're welcome, Shannon.\n\nOperator\n\nThank you. Next question is coming from Alex Valero from Loop Capital. Your line is now live.\n\nUnknown speaker\n\nHey, how's it going? How's it going, guys? Actually --\n\nJeff Graves -- Chief Executive Officer\n\nAlex, good morning.\n\nUnknown speaker\n\nGood morning. My question is, so what's your view on macro's impact on customer behavior, as you mentioned, 2023? And maybe if you guys could provide deeper concept on how you believe customers are doing their actions and the patient has actions as macro increasing manifest?\n\nJeff Graves -- Chief Executive Officer\n\nWell, I'm not sure I picked up all that question. So, run it by me again and go a little slower. You run it by me again.\n\nUnknown speaker\n\nYou got it. I'm so sorry. So, I said, what's your view on macro's impact on customer behavior as we enter 2023? And then the second part of the question was maybe if you could provide a deeper context on how you believe customers are viewing their actions and the patient directions as macro increase in the manifest?\n\nJeff Graves -- Chief Executive Officer\n\nYeah. Do you want to start off on that?\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nYeah. So, I think your question is really how customers are reacting to macroeconomic uncertainty. And I mean I'm not -- first of all, nobody fully knows what's going to happen in 2023. I mean we're continuing to experience a choppy supply chain environment, and consumer spending is moving in different directions.\n\nAnd people are kind of batting down the hatches. But we're addressing that as best as we can. And I think as you saw in our prepared remarks, right, as it impacts 3D Systems, the primary impact is in the procedures that are more elective in our healthcare segments within the orthodontic market. But we do have some kind of recession-proof or recession-resistant areas of the business that are continuing to perform very strongly outside of the dental markets.\n\nOur healthcare business was up pretty nicely year over year. And in our industrial solutions segment had 9% year-over-year growth. And I think that was like the seventh consecutive quarter of year-over-year growth. But just to lay that backdrop and then let Jeff kind of fill in some of the blanks.\n\nJeff Graves -- Chief Executive Officer\n\nSo everything Michael said is absolutely true. And the reason you can still get growth, and this is an industry broad industry comment, is additive manufacturing allows customers to bring in flexibility in their supply chain. On top of which, they can design more exotic parts for better performance. So, you've got this tailwind, if you will, the headwinds in the economy, clearly.\n\nAnd for us in the U.S., the strength of the dollar, those are headwinds. But the tailwind we all have in this industry, and I think we're well-positioned to leverage this, is customers have -- all of them were stung by these extended supply chains and virtually every industry stung by these extended supply chains into Asia and Eastern Europe and things where we've had pandemics, we've had wars. We've had all of this uncertainty. So, most of our customers are saying, \"Well, if I should look at additive in my factory, because I can bring it closer to home, I can have flexibility.\n\nSo that if I need to make multiple types of parts, I can do it on a fly. I can do that, and I can make parts that perform better in my product.\" So as an industry, and I think we've been leaders in this of introducing new materials for manufacturing production, they say, \"Well, I can make the parts I really want to make now with additive.\" And that really helps us a lot in a recessionary environment because everybody remembers the pain of the pandemic, it still exists. And supply chains, with China shutdowns --open a newspaper and you see China is shutting down periodically, still logistical issues getting parts shipped around the world. So yeah, there's a macro headwind from the economy, but there is a tailwind unique to our industry of people adopting additive and production.\n\nAnd that's -- I believe that's going to continue and accelerate, particularly as the economy rebounds and capital spending get loosens up more. So, it's a trade-off. Which of those wins, I have no idea in the short term, one month, two months, who knows? But in the longer term, these supply chain issues have opened a real opportunity for this industry that I believe is going to make it a permanent part of the production supply chain in most companies, both industrial and healthcare around the world.\n\nUnknown speaker\n\nThat's really helpful. Thank you very much.\n\nJeff Graves -- Chief Executive Officer\n\nSure. Thank you.\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nThank you. Next question is coming from Greg Palm from Craig-Hallum Capital Group. Your line is now live.\n\nDanny Eggerichs -- Craig-Hallum Capital Group -- Analyst\n\nYeah. Hey, this is Danny Eggerichs on for Greg today. I'll try to keep it short. I guess just on the revenue guide implies Q4 more or less in line with Q3.\n\nObviously, dental sounds like remains pretty challenged. But I guess more broadly across other end markets, what are you seeing through October and November here? And maybe how you're expecting that project into the next few months?\n\nJeff Graves -- Chief Executive Officer\n\nIt's kind of steady as you go. We don't expect -- and honestly, as we sit here today, and it could always happen, we don't expect -- and unless I can throw out the 15 caveats, unless there's a bigger war, unless there's a new outbreak or pandemic, we don't expect any major changes between now and the end of the year. That's why we could tighten our revenue range down. We think that revenue range fully reflects the risk that we have today as we sit here, and we're in mid-November.\n\nSo, between now and the end of the year, unless some catastrophe happens in the world, we don't expect any significant changes. I think everybody -- even on a personal level, people are more cautious, and that will continue. There's also interest in 2023 from our customers in enhancing the -- or reducing the risk of their supply chain. So, as we end the year and go into next year, unless there's a major disruption, I think it's kind of steady as you go right now.\n\nAnd that may not be the most exciting environment, but that's what we see right now as we sit here.\n\nDanny Eggerichs -- Craig-Hallum Capital Group -- Analyst\n\nGot it. And then I guess, just in light of that weaker demand environment, slower growth, just how you're thinking about managing and balancing investments.\n\nJeff Graves -- Chief Executive Officer\n\nYeah. Well, that's the tricky part of it because we do believe this is an exciting growth industry. And there's a minimum number of seeds you got to be planting and watering in order to fulfill that growth. We want to be very prudent about it.\n\nAnd that's why I want to be clear. We're focused right now. The good news is we bought the assets or invested in the assets that we really needed to have to live into that growth. There's not a lot of incremental investments we need to be making.\n\nWe've got the broadest technology portfolio in the industry today. We need to run it well, do some incremental investing for organic growth and capability. Any external investments we make are purely opportunistic at this point. We don't need to do them.\n\nAnd on top of it, we've got $600 million in the bank. So, we don't -- we're not in a position where we need to spend that money. We just need to execute on what we own predominantly. We're focused heavily on profitability and cash performance.\n\nIn spite of having a strong balance sheet, we're going to do that because we think it's prudent. And at the same time, we want to bring those seeds that we've purchased and brought into the company to full mighty oaks, if you will. That's what we want to see them happen over time. That's why we stuck with our long-term guidance of double-digit growth, then we hung out there being a $1 billion company in five years.\n\nI still think that's very possible. Again, assuming no catastrophes in the world. And if things return to normal and economies over the next year or two, I think there's no reason in the world we can't see that kind of exciting growth ahead.\n\nDanny Eggerichs -- Craig-Hallum Capital Group -- Analyst\n\nAll right. I'll leave it there. Thanks.\n\nJeff Graves -- Chief Executive Officer\n\nOK. Thanks so much.\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nJeff Graves -- Chief Executive Officer\n\nAnd Kevin, with that, I think we'll wrap up the Q&A and close out.\n\nOperator\n\nI'll turn it over to you for any further or closing comments, Doctor.\n\nJeff Graves -- Chief Executive Officer\n\nGreat. Thank you all for joining us today. It's been a pleasure talking to you, and we look forward to updating you with our year-end results on our next call. Thanks, and have a good day.\n\nBye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRussell Johnson -- Vice President, Treasurer and Investor Relations\n\nJeff Graves -- Chief Executive Officer\n\nMichael Turner -- Executive Vice President and Chief Financial Officer\n\nTroy Jensen -- Lake Street Capital Markets -- Analyst\n\nPaul Chung -- JPMorgan Chase and Company -- Analyst\n\nUnknown speaker\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nShannon Cross -- Credit Suisse -- Analyst\n\nDanny Eggerichs -- Craig-Hallum Capital Group -- Analyst\n\nMore DDD analysis\n\nAll earnings call transcripts"
}