{
  "companyName": "Mr. Cooper Group Inc.",
  "companyTicker": "COOP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/mr-cooper-group-inc-coop-q3-2022-earnings-call-tra/",
  "content": "Mr. Cooper Group Inc. (COOP -0.45%)\nQ3 2022 Earnings Call\nOct 26, 2022, 10:00 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Mr. Cooper Group third quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded.\n\nI would now like to hand the conference over to your speaker today, Ken Posner. Please go ahead.\n\nKen Posner -- Senior Vice President of Strategic Planning and Investor Relations\n\nGood morning and welcome to Mr. Cooper Group's third quarter earnings call. My name is Ken Posner and I'm SVP of strategic planning and investor relations. With me today are Jay Bray, chairman and CEO; Chris Marshall, vice chairman and president; and Jaime Gow, executive vice president and CFO.\n\nAs a quick reminder, this call is being recorded. Also, you can find the slides on our Investor Relations webpage at investors.mrcoopergroup.com. During the call, we may refer to non-GAAP measures which are reconciled to GAAP results in the appendix to the slide deck. Also, we may make forward-looking statements, which you should understand could be affected by risk factors that we've identified in our 10-K and other SEC filings.\n\nWe are not undertaking any commitment to update these statements if conditions change. I'll now turn the call over to Jay.\n\nJay Bray -- Chairman and Chief Executive Officer\n\nThanks, Ken, and good morning, everyone and welcome to our call. I'm going to start with the highlights as we always do, but then we'll pull up and talk about the recent interest rate shock and more broadly, the macro backdrop where a number of indicators are now signaling higher risk. And then discuss how we are positioning Mr. Cooper for an environment of heightened uncertainty.\n\nSo with that preface, let's go through the highlights on Slide 3. In summary, we had a very solid quarter with positive earnings and cash flow and strong capital generation, while continuing to grow our customer base. Net income was $113 million, which was a function of both operating earnings and a positive MSR mark. As a result, tangible book value per share rose to $56.35, which is up 36% year over year and our capital ratio increased to a new record high of 31.3%.\n\nWe talk a lot about our balanced business model and this quarter's solid results demonstrate the obvious benefit of operating with a large servicing portfolio. Servicing income more than doubled to $81 million in the quarter, up from $30 million in the second quarter. And most of this increase is the predictable impact of higher rates on amortization and interest income, which we guided you to expect. Looking ahead, we project servicing income reaching $125 million or more in the fourth quarter with strong results continuing into 2023, especially if the Fed continues on its current path.\n\nTurning to the portfolio, the UPB reached $854 billion or 4.1 million customers, which is 28% year-over-year growth. Most of this growth was in our sub-servicing portfolio where we continue to win new clients and gain wallet share. In sub-servicing, we believe we are the market leader with a platform that's scalable, efficient, compliant with unparalleled recapture capabilities. Additionally, we believe as we enter into this uncertain environment, our strong loss mitigation track record and capabilities will be another key differentiator.\n\nHistorically, we grew this business with a small number of very large clients, but today we are actively calling on a much broader segment of the marketplace. I think there are excellent opportunities for further growth as we take share from competitors who haven't invested in technology or loss mitigation. What's especially appealing about sub-service in this environment is that it allows us to grow our platform and our customer base achieve greater scale and drive down unit costs without employing capital. Now let's talk about originations where the situation is clearly very challenging.\n\nWe generated $45 million in EBT, which was in line with our guidance and reflects fantastic execution on the part of our originations team. However, with the recent move-in rates, there's going to be significant pressure here, more on that in a second. Finally, in terms of capital management during the quarter, we repurchased 1.1 million shares for $50 million, which I would describe as a measured pace and appropriate for the current macro backdrop. OK, now let's pull up and talk more strategically about how we're positioning the company for an environment of heightened risk.\n\nAs you'd expect, our leadership team tracks a large number of macro and market indicators very closely. Of concern right now, we see very elevated levels of volatility in both equity and fixed-income markets, which tells us to prepare for a wide range of potential scenarios. We're monitoring liquidity and credit stress in the financial system, which means we need to be mindful not only of our own balance sheet but how our partners are doing. We're obviously watching the deterioration in the leading economic indicators which point to a growing risk of recession as well as a housing correction, which is already begun and the go little backdrop looks quite fragile.\n\nNow, there are also some very positive indicators. Employment is currently very strong as is consumer credit where delinquency rates are only just starting to normalize and only in certain pockets. But net-net, it's our mission to serve customers in both good times and difficult times, which means we need to be prepared for adverse scenarios. So let's talk about how Mr.\n\nCooper is positioned for heightened risk, including where we're pivoting and where we're staying the course. Starting with originations, as we all know, rates have moved very sharply in the last few weeks. To put this in some perspective, year to date, mortgage rates have more than doubled, which we believe is the most extreme shock the industry is experienced in its history. As a result, the rate and term refinance opportunity is basically nonexistent and now we are seeing the cash-out market coming under pressure too.\n\nAs many of our customers who would like to tap their equity are facing an affordability problem. In light of this situation, we're moving forward once again to realign capacity in our originations business. We want to serve our customers needs where that makes sense financially and we want to safeguard the high credit quality of our portfolio. In other words, this is not the time to loosen our credit standards or to take our eye off manufacturing quality.\n\nWe're also taking a fresh look at corporate expenses in order to streamline overhead costs where appropriate. As always, we're reacting quickly and decisively to market changes while ensuring we continue to make smart investments in the business. On this point, longer term we believe our origination business has enormous potential, especially our DTC platform where we have initiatives underway to expand in the new products and channels and where we're continuing to invest in automation. And we'll talk more about these initiatives at a future point once the market is stabilized.\n\nTurning to servicing, the story is very different. We have terrific momentum, we've got the best technology in the industry and we're making great strides with our process discipline, the result of which is the operating leverage you can see in our results. In terms of how we navigate the credit cycle, technology and process discipline are the keys to managing both current and delinquent loans. Also, as you know, last quarter we acquired Right Path, which is a special servicer with a sophisticated data-driven approach.\n\nIntegration is on track and we're incredibly optimistic about growing Right Path's client base and using their techniques for our own portfolio. Credit quality is also an important consideration. Chris will take you through our portfolio so you can understand our diversification and conservative approach to acquisitions. In summary, I'd emphasize that we have the scale, technology, people, and experience to play a leadership role if the mortgage market comes under stress and I'd remind you that is exactly what we did during the last downturn.\n\nNow turning to zone, we feel that the platform is in great shape from an operating and competitive standpoint, and of course, a recession if one happens is only going to create more demand for the exchange. Right now, we are in a transition period, where home prices are following but foreclosures are not yet rising. There's no change to our strategy, but we will need to be patient a little bit longer to see EBT ramp, which is the key to monetization. Finally, let's focus on the balance sheet, which I know everyone on this call would agree is the most important aspect of any company strategy when facing a risky macro situation.\n\nWith respect to capital and liquidity, we're in great shape. In fact, the company's balance sheet has never been stronger. And in this environment, you should expect us to continue operating with a significant amount of excess capital and liquidity. Part of the reason for this posture is that we do expect to see more pain in the mortgage industry, as the current players grapple with challenges that many of them have never faced.\n\nWe have to be prepared to deal with stress and instability in our markets, which could also produce extraordinary opportunities. For now, when it comes to capital deployment, you should expect us to remain very thoughtful and disciplined and also very patient. And to wrap up my comments, the theme I'd like to emphasize is sustainability. We have a balanced business model.\n\nWe have the best technology and significant scale, a conservative high-quality portfolio, robust capital and liquidity, and a team that pivots quickly when conditions warrant. We don't know how the macro scenario will develop from here, but we're positioning ourselves to navigate the risk and emerge on the other side of this cycle in an even stronger position. And with that, I'll turn the call over to Chris.\n\nChris Marshall -- Vice Chairman and President\n\nThanks, Jay, and good morning, everyone. I'm going to start on Slide 5 and give you a little bit of a deeper dive into the operating businesses. And I'll start with servicing income, which is ramping very nicely just as we guided you to expect. During the quarter, servicing generated $81 million in pre-tax income, more than doubling the second quarter level of $30 million.\n\nLooking forward, we expect to generate at least $125 million in the fourth quarter as a function of a better mix, lower amortization, and higher interest income. Meanwhile, since our last fall, consensus is now projecting the Fed funds rate reaching nearly 5% in 2023, which is almost 150 basis points higher than where expectations were last quarter. So I describe the outlook for servicing in 2023 as excellent. Now let's spend a minute on operating expenses, which you can see are benefiting from scale as well as process enhancements.\n\nExpenses were down $7 million sequentially as we've begun realizing synergies from the integration of Right Path. On a year-over-year basis, expenses are up 9% while UPB has grown by 28%, which I hope you agree is a very compelling demonstration of positive operating leverage. And I'd add that compared to our peers, our customer delight metrics like speed to answer and abandonment rates are in excellent shape. Our strategy is to drive down unit costs to levels that no one else in the industry can match, and then to keep driving them down further by continuously optimizing our processes.\n\nNow I know many of you have questions about cost to serve for performing and non-performing loans so that you can model earnings in different scenarios and that's a very fair topic to discuss. However, cost to serve very significantly by collateral type and credit profile. So it's hard to offer a snapshot for today that's going to be relevant for tomorrow. Second, we're currently operating with excess capacity for non-performing loans, which by the way, we don't think is the case for many of our peers.\n\nAnd since we've used technology to automate many of the tasks involved with managing non-performing loans, our average cost will decline as we leverage fixed costs with higher volumes. Finally, since we have huge scale, we're able to shift resources across functional areas which helps us manage costs more efficiently than our smaller peers. I'd remind you that we demonstrated significant positive operating leverage during the pandemic despite a huge volume of forbearances and modifications. You're seeing outstanding cost management continuing today and that will remain our focus in 2023.\n\nWe'll share more information on how we plan to manage costs as the shape of the next credit cycle becomes more apparent. But bear in mind, if recession strikes in mid-2023 as most of us think is possible, we probably wouldn't see any impact on our costs until 2024. Now let's turn to Slide 6 and talk a little bit about growth. We ended the quarter with total UPB of $854 billion and 4.1 million customers.\n\nOur mission is to help these customers manage their most important financial asset, preserve their dream of home ownership, and delight them with personalized friction-free service. The portfolio is up 6% sequentially and 28% year over year, largely from strong growth in sub-servicing where we won business from new accounts and expanded wallet share with existing clients. Now as you've probably heard, we do have a client which has decided to take their portfolio in-house following acquisition of a servicing platform. We planted the board $20 billion in the fourth quarter and another $50 billion to $60 billion in 2023, which could potentially flatten out our UPB growth for a couple of quarters depending on what goes on with other opportunities.\n\nWe're always sorry to lose a customer. However, in our view, the prevailing trend in the servicing sector is going to be consolidation and we expect over the next couple of years to see many more firms exiting and very few entering the business. Servicers face operational and compliance demands, which are extremely high. And as you know regulators have raised their expectations in terms of capital and liquidity.\n\nRegulators also care a great deal about loss mitigation capacity and we don't think there's enough capacity in the industry. We'd expect even a mild credit cycle to add considerable stress and create further opportunities for us to gain share with sub-servicing. Now turning to MSR acquisitions. You can see we were very selective in the quarter purchasing $6 billion in UPB at very attractive pricing.\n\nI'd characterize yields on the MSRs as mid to upper double digit. We remain an active participant in the market. In fact, as we speak, we're due diligence seeing a $20 billion pull with attractive collateral and pricing. However, the key themes for us at this point in the cycle are discipline and patience.\n\nGiven the macro backdrop, we believe there is unfortunately more pain in store for the industry, which is going to put pressure on MSR sellers. And while I can't speak for other buyers, we've been focusing on pools that were comfortable we can manage through the credit cycle and we're looking for yields that compensate us for the risk of deploying capital in an uncertain environment. You can see our portfolio mix increased to 54% sub-servicing in the quarter. Looking ahead, we continue to think 50-50 is a good long-term target, although we may deviate to some degree as you're seeing right now based on where we see the best risk-adjusted returns.\n\nNow let's stay on the topic of credit quality. If you'll turn to Slide 7, let's spend a minute on our portfolio composition. Some of our peers have been quite aggressive about moving into Ginnie loans and other potentially higher-risk segments of the market, but we've grown our portfolio in a defensive matter and consistently maintained our overall diversification. To start with, over half the portfolio is sub-servicing, which really requires no capital or no liquidity.\n\nFurthermore, sub-servicing contracts provide higher servicing fees and incentives for non-performing loans. Accordingly, during a credit cycle, we'd expect that our sub-servicing margins would be stable or potentially expand. Now turning to our MSR portfolio. On an overall basis, the weighted average FICO score of our portfolio has increased from 720 a year ago to 727 today, and the weighted average LTV has decreased from 60% to 53%.\n\nSo you can see that we've maintained our credit standards despite the pressure of lower origination volumes. You can also see that we've maintained diversity within the owned portfolio. With respect to Ginnie Mae loans, whereas other servicers have focused primarily on this segment during the past couple of years, we took a more balanced approach and grew our agency servicing far faster than our Ginnie book. Furthermore, the majority of our growth in the Ginnie portfolio came as a result of purchasing a seasoned very high-quality book of VA loans from a client whose portfolio we sub-serviced for many years.\n\nSo we're very comfortable with the performance of these loans and think our prudent acquisition strategy will serve us well if there is a downturn in the market. With respect to our Ginnie book, the boxes on the right of this page provide you with supplemental data on the breakdown of LTV and note rate for FHA and VA portfolios. And as you can see, the majority of our customers have substantial equity built up and also enjoy very low note rates, which bodes very well for credit performance. Now turning to Slide 8, we continue to see stable delinquency numbers.\n\nIn fact, while we still have over 40,000 customers in active COVID forbearance plans who are behind on their mortgage payments, even when including that volume, our delinquency levels are very low. As you would expect, we pay special attention to FHA delinquency rates as these customers tend to have higher debt-to-equity ratios, lower reserves, and lower FICO scores than agency bars. There's a slight increase in delinquency rates, which rose from 2.8% in the second quarter to 3% in the third, which we would attribute to seizing of older vintages. Even so, compared to the rest of the industry, our portfolio quality is excellent.\n\nYou can gauge performance of Ginnie loans by tracking the compare ratio, which is publicly available. This ratio looks at 90-plus day delinquent loans as a percentage of loans originated in the last two years and normalizes to the industry with 100 being industry average and levels below that showing better than industry performance. As you can see, our compare ratio was 42 in September, which is well below industry average. In fact, we're tied with one other issuer with the lowest score in the industry.\n\nNow let's switch gears and talk about originations on Slide 9. Our teammates did a fantastic job closing out the quarter with $45 million in EBT on volume of $5.7 billion despite rates having increased by over 100 basis points since we last spoke to you in September. However, as you know, rates were moving up toward the end of the quarter, so you're not seeing the full impact in these results. For some perspective where rates now stand, we're facing the single most severe affordability shock in the history of the mortgage industry, which has eliminated rate and term refi and is now putting a great deal of pressure on cash outs as well.\n\nSo as Jay mentioned, we're now moving forward with the plans to realign capacity to a smaller market. We'll continue to serve our customers for whom the financial benefits of refinancing make sense, but now that is a much smaller number than it was just three months ago, let alone a year ago. And we don't think it's a good idea for either the company or our customers to support volumes by relaxing credit standards rather our strategies to maintain the defensive quality of our portfolio. Now we'll continue to invest in projects like Flash and other automation projects and we'll continue to work on initiatives to extend DTC into other products and channels.\n\nThese investments will help us exit the cycle with a very strong platform and even higher levels of profitability. But in the short term, our priority is managing capacity. For now, I guide you to expect fourth quarter EBT for our origination segment to be roughly breakeven. Now if you'll turn to Slide 10, I'd like to share our latest thoughts on Xome where the platform is in excellent shape, but the market continues to go through transition.\n\nAs a result, property sales and revenue were stable instead of ramping up further as we would've expected. On the positive side, the platform is doing great. Our market share was up to 32% in the quarter and based on discussions with clients, we continue to expect to hit 40% by year end. Also, inflows from servicer clients who've been moving very conservatively to avoid regulatory criticism are finally picking up and that's helping to push our inventories higher.\n\nHowever, sales have not followed suit. One reason is that we're still seeing quite a high level of foreclosures curing as borrowers enter modification plans shortly before the schedule date. A second issue is that buyers are starting to hesitate because their financing costs are suddenly much higher and now they're starting to see home prices falling. At the same time, servicers are relying on appraisals for their reserve prices, which are of course a lagging indicator.\n\nThese two factors have negatively impacted our pull-through rates. So I characterize the market as in a transition phase for the moment and caution you that our sales and revenues could be choppy until buyer and seller expectations converge again. But there's no question that foreclosure levels will rise, it's only a question of timing. In this regard, there's no change in our monetization strategy.\n\nThe exchange for now is operating at roughly breakeven. And once sales start to rise, given the very wide contribution margin, you'll see EBT start to ramp quickly. That's the point when we'd expect to see investors stepping up to pay a fair price for the platform and to the extent that recession impacts employment on top of the housing correction already underway, then there's potentially significant upside at Xome. So now I'm going to turn it over to Jaime who'll walk you through the financials.\n\nJaime Gow -- Executive Vice President and Chief Financial Officer\n\nThanks Chris, and good morning everyone. Now let's turn to Slide 11 and review our third quarter results. Net income was $113 million, which comprised of $56 million in pre-tax operating earnings, a positive MSR mark of $122 million, and adjustments totalling $23 million. Adjustments consisted of $18 million primary related to write-downs and new ownership interest we retained in the sale of our title Valuation and Field Services businesses last year and $5 million in a lease breakage and other car charges incurred as we continue to optimize our operations.\n\nOur weighted average diluted share count declined from 74.3 million to 72.9 million shares and we ended the quarter with 70.6 million shares outstanding as a result of our continued share repurchases. Between net income and the reduction in our share count, we saw strong growth in our tangible book value per share, which increased by 36% last year reaching $56.35 per share. Now let's turn to Slide 12 and discuss our mortgage service rights. During the quarter, the MSR value increased by 5% or 7 basis points to 162 basis points, reflecting the recent rise in mortgage rates and the corresponding decrease in the lifetime CPR assumption of 7.7% to 7.4%.\n\nAnd additionally, swap rates increased by 127 basis points with a corresponding higher expectation for service interest income. Partially offsetting these positives, we increased our discount rate from 11.3% to 11.4%. We were also providing service fee multiples, which in our view is a better high-level comparison. Since the basis point valuation can be affected by mix and extra strip.\n\nFor the third quarter, we were at of multiple 5.2 times the underlying servicing strip slightly above the 5x you saw in the second quarter. Now turning to Slide 13, let's review the company's record-level liquidity. At quarter end total available liquidity was nearly $2.3 billion the highest in the company's history. And of this amount, $530 million was unrestricted cash.\n\nAnd when we talk about liquidity, this is already collateralized and available immediately. During the quarter, we expanded our capacity by another $400 million and we also extended maturities. And with our committed MSR lines in particular, we pushed most of our maturities out by two years. During the quarter, we drew down an additional $90 million from our MSR lines, which brings our outstanding balance to just over $1 billion.\n\nBut relative to the total debt outstanding, we remain at an extremely conservative level of 27%, which we think is very appropriate given our considerable excess capital. And we'll continue to use MSR lines for working capital needs and opportunistic MSR acquisition, but we will be very judicious in doing so as these clients do not represent a permanent form of financing. Advances were down 7% in the quarter to $830 million and are now down 9% year over year. Now obviously this could change if the credit cycle turns, but with over $1 billion in capacity, we believe we're in excellent shape.\n\nOur cash flow during the quarter benefited from the steady ramping and service interest income and we would expect servicing cash flow to continue happening into the fourth quarter. Now I'm going to wrap up my comments on Slide 14 by talking about our capital position. Our capital ratio at quarter end as measured by tangible net worth assets was 31.3% up from 30.6% last quarter. Now excluding deferred tax assets and EBOs, our capital ratio rose to 31.4% from 29.7% last quarter, reflecting both strong capital generation in the quarter and the utilization of the DTI.\n\nNow I'd like to echo Jay's earlier comment on the heightened level of market volatility and macro risks that our industry is currently operating under. In this environment, you should expect us to remain extremely disciplined and patient when it comes to capital deployment, and as you would expect us to continue operating with a sizable buffer in excess capital and liquidity. This posture will allow us to sustain a measured pace of growth, navigate the macro environment and continue to deliver on our mission to serve our customers. Our capital liquidity will also allow us to take advantage of special growth opportunities, which sometimes surface during stress periods.\n\nWith that, I'd like to thank you for listening to our presentation. And now I'll turn the call back to Ken for Q&A.\n\nKen Posner -- Senior Vice President of Strategic Planning and Investor Relations\n\nThank you, Jaime. And Victor, if you could please now start the Q&A session.\n\nOperator\n\nSure. [Operator instructions] And our first question will come from line of Kevin Barker from Piper Sandler. Your line is open.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nThank you. So Chris thanks for that comments regarding 4Q origination, pre-tax income breakeven. Does that breakeven income before taxes include some of the alignment expenses that you're likely to incur in the fourth quarter? And do you expect the origination segment to start to show more consistent pre-tax profitability as we go into the first few quarters of 2023 despite the headwinds we're seeing on the refi market?\n\nChris Marshall -- Vice Chairman and President\n\nYes. Kevin, I'd say we will -- that number does not include a charge that we will undoubtedly take in the quarter and we'll announce that and disclose that. But of course, there is some realignment of fixed expenses that'll have to come out a little bit slower and that would include the impact of that. We'll obviously adjust those as we get through the quarter with the goal of repositioning originations of course to be profitable in 2023.\n\nThe reason we're not giving you more guidance at this point is changes in rates and volatility have been so heightened that we want to make sure when we give you guidance, it's stuff we know we can deliver. So fourth quarter, we're going to have to make a lot of changes and there will be a charge that will be taking, it's not a dramatic number, but a material number. But the other impacts of this transition are yes, included in that number.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. All right. And then your capital ratios are very high relative historical past. You cite the Ba3 corporate rating threshold in your slides, but generally bought back 1.1 million shares of stock despite trading at roughly 80% of book value today.\n\nIs there something there that makes you hesitate in deploying that capital, whether it's macroeconomic conditions or other potential capital or liquidity constraints?\n\nChris Marshall -- Vice Chairman and President\n\nI think, well, first of all, we're well aware of the amount of equity we have on the balance sheet and the amount of flexibility we have. We have been very disciplined because we see lots of opportunity coming down the pipe. Now, at the same time, we have been consistently buying back shares roughly a $50 million a quarter pace. And we think that's a judicious use of capital while we're patiently waiting for larger capital deployment opportunities to come to fruition.\n\nIn fact, our board yesterday gave us a new authorization of an additional $200 million to -- that's on top of the -- I think we have $60 million of remaining authorization, so you should expect us to continue to act prudently with capital. But there are definitely going to be opportunities. And while that may be painful for others, that's the way we've grown the company. The returns on the assets we're buying are extremely attractive.\n\nAnd we really want to take advantage of the changes in this cycle to grow the company in a disciplined way, but a very, very profitably.\n\nJay Bray -- Chairman and Chief Executive Officer\n\nYes. I think Kevin if you look at the bulk market it's just gotten better and better, and we see fantastic opportunities there, and we think it's going to continue. I think there's going to be more supply. So I think we want to be disciplined, and to your point, we're obviously in a very volatile environment, so we want to be prudent as well.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. So could you quantify what your expected return on investment would be in the bulk MSR market given valuations and the potential refi opportunity, whether that ever emerges within those bulk acquisitions?\n\nChris Marshall -- Vice Chairman and President\n\nWell, I think we've talked about this a little bit and we made some comments on this call that, recently we're seeing -- depending on the quality of collateral type, etc., we're adding small pools and more diligence in large pools with say, returns between 13% and 18% on an unlevered basis. Those are returns that we couldn't dream about 18 months ago. And with some even larger pools coming to market, we would expect those returns could even be wider.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. Great. Thanks for taking the questions.\n\nChris Marshall -- Vice Chairman and President\n\nThank you, Kevin.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes to line of Bose George from KBW. Your line is open.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nHey, guys. Good morning. Actually, first I just wanted to ask the 221 basis points valuation of your capitalized servicing, that's on Slide 20 -- on Slide 25. Actually, what's the difference between that number and the value of the capitalized servicing at lock? Is there like excess servicing in there, or just -- curious what's driving that difference?\n\nJaime Gow -- Executive Vice President and Chief Financial Officer\n\nYes. The majority of that is excess servicing. Just given the volatility to market, given what we're seeing from the agencies, we are keeping almost all the excess. So that's what's really driving that.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Great. Yes. Thanks for that.\n\nAnd then the origination EBT guidance is the decline really driven by volumes or again, on sale margins remaining fairly stable?\n\nChris Marshall -- Vice Chairman and President\n\nProbably both.\n\nJaime Gow -- Executive Vice President and Chief Financial Officer\n\nYeah. It's both. I mean, volumes certainly have come down given the rapid rate increase. So we're seeing less locks and submissions.\n\nAnd as you know, within the MBS volatility or in within the MBS world, there's a lot of volatility. So the premiums on the higher coupon loans have come down are pretty moderate. So it's a combination. And on volumes, we're soliciting less of our customers to -- we've shifted mainly to cash-out financing.\n\nSo when it makes sense for a customer to who really needs cash and it's got to tap the equity in their home we're here to serve them. But for the majority of our customers, that's not a good trade right now. So we're soliciting less, we're spending less on marketing, we're generating fewer applications. We think that's going to continue for the foreseeable future.\n\nBut the offset that, as you know, servicing profitability is going to continue to improve, as we talked about, and frankly benefit from that in a considerable way. And we think that's the right economic decision for the company and the customer.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nOK. That makes sense. Thanks. Actually, just one quick one on Xome.\n\nJust given your commentary, what are your thoughts on, I think you discussed earlier that the EBIT run rate there could be $120 million going into 2023. What are your thoughts about sort of when that happens? Or is that just a little bit harder to tell when that kicks in now?\n\nJaime Gow -- Executive Vice President and Chief Financial Officer\n\nI think $120 million make sense when we talked about the foreclosure sales coming back much faster than they have. So we'll have to give you better guidance for 2023, but that number will certainly come down because we've probably moved back at least two quarters in terms of sales recovering. And we see it happening, but it's happening at a much slower level. Our inventories are much higher than we anticipated, which is great.\n\nBut until the sales really start to pick up and when they do pick up, the margin on those sales is quite wide. It will not take long for EBT to grow very, very quickly. But the pace has been slower than we anticipated.\n\nChris Marshall -- Vice Chairman and President\n\nI mean, having said that, Bose, once you get back to historical levels we did -- we still think that's going to be achievable.\n\nJaime Gow -- Executive Vice President and Chief Financial Officer\n\nYes. That's just going to -- I mean, the $120 million is going to be achievable, but it's too early to put a time period on that. We got to see more activity there.\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Great. That's helpful. Thanks a lot.\n\nOperator\n\nThank you. One moment for our next question. Our next question will come from line of Mark DeVries from Barclays. Your line is open.\n\nMark DeVries -- Barclays -- Analyst\n\nYes. Thanks. What inning would you say that we're in, in terms of kind of industry rationalization of capacity? And what do you think the outlook is for, again, on sale margins once we've kind of gotten through that?\n\nJaime Gow -- Executive Vice President and Chief Financial Officer\n\nI don't want to guess that again, in sale margins, Mark, because the volatility and changes that are happening much too fast. Once things stabilize a little bit, we'll give you more clear guidance there. In terms of rationalized expenses, I think it's hard to talk about the industry. We can just talk about what we're doing, and that is to move quickly and decisively to resize the business so that we're in a position to optimize profitability in 2023.\n\nAnd we've been doing that and you'll see us do more of that very quickly.\n\nMark DeVries -- Barclays -- Analyst\n\nOK. And do you expect to get through most of your capacity rationalization by the end of this year?\n\nJaime Gow -- Executive Vice President and Chief Financial Officer\n\nYes.\n\nMark DeVries -- Barclays -- Analyst\n\nOK. Great. And then turning to the MSR market, it sounds like you're optimistic on the supply that you're going to see there. What are you seeing on the demand side? Is there a lot of competition for the servicing that's coming to the market?\n\nChris Marshall -- Vice Chairman and President\n\nI'd say there's competition depending on the collateral. But for the large pools, there are very few buyers that have the capability to onboard large pools of MSR and the confidence of the agencies, the regulators to allow them. And that is the single biggest differentiator for Mr. Cooper in the industry.\n\nWe have the capital clearly, but we have the experience. We bought more MSRs, more large pools of MSRs by a factor of many over the years. And we have a highly efficient automated process for doing it. And I think we have the confidence of all the constituents to get approvals quickly to do that.\n\nSo competition, there is a small handful of people that can say that. And I think even among that small handful, we are by far the best.\n\nJay Bray -- Chairman and Chief Executive Officer\n\nYes. And I'd say overall we consistently hear from the dealers that are selling the books, that there's not a lot of buyers. So I think it's a good environment for us.\n\nMark DeVries -- Barclays -- Analyst\n\nOK. Got it. And then finally, are you seeing any opportunities to convert sub-service to owned from partners who may be a little bit liquidity constraints themselves in this kind of tough environment?\n\nChris Marshall -- Vice Chairman and President\n\nWell, we did that in a big way in the second quarter, I think where we bought a $50 billion portfolio that we had sub-servicer for six years. But those things don't come along quite often.\n\nJay Bray -- Chairman and Chief Executive Officer\n\nYes. I don't think right now there's anything imminent. As you know, we service for a lot of strong financial buyers. Not that there will not be opportunities, but I don't think there's anything imminent.\n\nChris Marshall -- Vice Chairman and President\n\nYes. I'd say there are more opportunities with other servicers either scaling down their operations or even exiting and that's where we're focusing a lot of our attention.\n\nMark DeVries -- Barclays -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Eric Hagen from BTIG. Your line is open.\n\nEric Hagen -- BTIG -- Analyst\n\nHey. Thanks. Good morning. Hope you guys are well.\n\nJust two quick follow-ups on the MSR. Can you identify maybe a little more clearly who the incremental seller of MSR is in this market and whether you think banks will have a greater appetite to sell MSRs going forward? And then also, what are the conditions by which you'd look to maybe draw more leverage against your MSR -- your MSR going forward? Excuse me.\n\nChris Marshall -- Vice Chairman and President\n\nWell, two -- I'll start with the sellers. I think what you've seen consistently through the year and we -- which we had been fully expecting was that the originators that had been holding on to MSR are now all selling. And what we hadn't anticipated, because we didn't expect rates to move this quickly, is that there -- as I just said, other servicers are either exiting the market or they're being forced to sell MSR. They would naturally hold just to generate cash because the originations business is losing significant amounts of money.\n\nSo that's a perfect storm for us. We don't see banks as big sellers, with the exception of one large money center bank who's announced there. They may be making changes to the size of the mortgage operation. I think that's a one-off thing that may occur at some point in the future.\n\nBut I don't see banks -- we actually see banks stepping in and buying at certain times depending on collateral type.\n\nEric Hagen -- BTIG -- Analyst\n\nThat's helpful. How about the leverage on the MSR and the conditions you'd look to draw against that?\n\nChris Marshall -- Vice Chairman and President\n\nWe use our MSR lines conservatively, so there's no reason to do that today. If we had opportunities to buy things at the right price, we would use our leverage judiciously with the only -- not only with a plan to be able to pay it back to conservative levels over a short period of time.\n\nEric Hagen -- BTIG -- Analyst\n\nGotcha.\n\nChris Marshall -- Vice Chairman and President\n\nOur MSR lines are although they are -- we've recently gone through extending and expanding them for this opportunity they're two-year facilities, so we don't want to be overly dependent on MSR lines.\n\nEric Hagen -- BTIG -- Analyst\n\nYes. Definitely makes sense. If there is a more material pickup in delinquencies that you see going forward, do you have a sense for what the structure of loan modifications could look like? In the last crisis, it was largely taking borrowers from a higher rate to a lower one, which obviously makes sense, but here we could be looking at folks that already have a really low rate and need a mod in a higher rate environment. So how do you see that evolving?\n\nChris Marshall -- Vice Chairman and President\n\nI'm not quite sure I would talk about that today. I think the -- some of the government agencies are spending a lot of time right now, trying to come up with new solutions for the -- to deal with the situation you're referring to right now. People that are still exiting forbearance are facing rates that are far higher for the FHA/VA customers, for example. So we expect there will be some solutions coming soon, but I'm not going to guess at what those are.\n\nI would make one comment, one big change for modifications in the past, not so much the type as how we're going to handle them. One of the big and very timely investments we made, if you go back to Project Titan was our CMOD system, which really is a fully digital automated solution for handling modifications, which were in the past. If you went back to the days of HAMP modification, they were 100% manual. So that's what we're talking about, we do expect there will be high volumes of those, but we're fortunate to have developed a state-of-the-art digital solution to do so.\n\nEric Hagen -- BTIG -- Analyst\n\nThat's interesting.\n\nJay Bray -- Chairman and Chief Executive Officer\n\nAnd I think if you look at the GSE portfolio, I think you have more flexibility there to have the borrower remain, if you will, in their current coupon versus the FHA. But as we speak to Chris' point, the government's working on other solutions. So I think, there will be solutions for customers across the board, but certainly, in GSE land, I think there's solutions today that can keep them in their kind of existing coupon territory.\n\nEric Hagen -- BTIG -- Analyst\n\nThat's good commentary. Thank you, guys very much.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Doug Harter from Credit Suisse. Your line is open.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nThanks. Can you talk about the attractiveness of the correspondent channel as a way to acquire MSR today?\n\nJay Bray -- Chairman and Chief Executive Officer\n\nCorrespondent margins are thin right now and on a historical basis, so I would say at this moment, it's less attractive than some of the other channels. We acquire MSR through, obviously through the bulk market, through co-issue, and through correspondent. Today co-issue margins are better, but that changes very quickly. So I wouldn't draw any long-term trend from that.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nAnd then just on the DTC channel, while clearly rates are moving and necessitate the need to take costs out, how do these actions impact your ability to benefit if say mortgage spreads were to tighten and mortgage rates were to fall quickly, at some point in the not too distant future?\n\nChris Marshall -- Vice Chairman and President\n\nWe will adjust the workforce but we will retain 100% of the optionality to spring right back. So if rates move, you will see us react in an instant. That's why some of our comments, if you want back in the call, we're continuing to invest in Project Flash, which has says dramatically improve the efficiency of our originations platform and some other key initiatives that we think are going to provide new channels and possibly some new products for the DTC channel. So we will adjust appropriately but we're not going to give up any -- the originations platform for our company is a critical part of the business.\n\nIt always will be. We run a balanced business and just like two years ago when servicing was barely making any money, we continue to invest in it, we're going to benefit from it now. So you're seeing exactly what we told you that servicing income was going to double quarter over quarter and double again, and we think it'll be even stronger in 2023. Originations is going to drop back, but these are long-term parts of the company and we are not going to do anything that would impact their ability to react quickly when rates are more favorable.\n\nDoug Harter -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line Giuliano Bologna from Compass Point. Your line is open.\n\nGiuliano Bologna -- Compass Point Research and Trading -- Analyst\n\nGood morning. I guess from a starting point, one thing I was curious about taking your brain about was looking at the servicing segment. You guys are calling for $125 million plus of EBT, next quarter and that's roughly about $44 million at $125 million versus the $81 million this quarter. If I look at the slide, what you guys are calling for roughly a $9 million benefit in amortization quarter over quarter.\n\nI'm just curious where the, call it the mid $30 million of other benefits that's going to flow through, is it coming mostly from expense leverage, or is it coming from a bump up in interest income from the escrow deposits or just where the benefits flow through outside of amortization?\n\nChris Marshall -- Vice Chairman and President\n\nIt's a combination of all three. Obviously, short-term rates are up and interest income is going to benefit from that significantly. But we're also seeing efficiencies in servicing. And they're in a number of areas, we introduce a state-of-the-art omnichannel communication system, we've seen tremendous efficiency from our new IVR chat features.\n\nWe've integrated Right Path and seen efficiencies from that. So expenses are still coming out of servicing even though, volumes are up and we expect that to continue next year. We have a very comprehensive process optimization program that is a permanent part of servicing. So there's not one area, Giuliano, but we'll see at least $125 million in the fourth quarter and you'll see that improve as we get into 2023.\n\nGiuliano Bologna -- Compass Point Research and Trading -- Analyst\n\nThat's great. And then going back to one of the comments that you're making earlier about Xome or maybe you or Jay making comments, but one of the comments says that there's been roughly few months away. I'm curious when you just kind of dialing back the clock to last quarter, like last quarter you guys were saying it was roughly called a one-month kind of push-out. And in the timing, I'm curious, is the two months kind of inclusive of that one month that we were talking about last quarter or is it kind of an additional two months that you're kind of referring to this quarter in terms of the timing of getting the volume up and margins back up?\n\nChris Marshall -- Vice Chairman and President\n\nI'm not sure I can recall the exact comments because I think last quarter we were saying things were moving out a quarter, but I'll have to go back and look at the comments. I think right now, we expected to be at a full run rate at this point. And the good news, bad news with Xome is and go back to Jay's comment about when we get to a normalized run rate for foreclosures and there's no reason that won't occur, it's just a matter of timing. When we do $120 million a year is a realistic number for Xome.\n\nIf we get to a normalized run rate and those levels rise because we go into recession, which I think is becoming a very strong consensus in the country, those levels are going to be higher and earnings are going to be higher. So Xome is well positioned, but there are lots of factors for why sales have not picked up faster. The thing that's right in front of us now is individual buyers seeing their financing costs up, home prices falling. So there's some disconnect that's got to happen, but that's going to converge.\n\nThese homes are going to sell and these foreclosure levels, there's no reason that foreclosure levels will not rise again from essentially zero. It just -- it's going to take some time.\n\nJay Bray -- Chairman and Chief Executive Officer\n\nYes. And really our forecast and back to the 120 is based on pre-pandemic foreclosure levels. So overall that was still pretty low foreclosure levels, but that's what we're kind of basing our long-term thoughts on around what the EBT will be for Xome. So I think it's very realistic.\n\nGiuliano Bologna -- Compass Point Research and Trading -- Analyst\n\nThat makes sense. And this is more -- this might be one kind of high-level question from capital allocation perspective. When I look at where you're trading from a book value perspective, you're kind of like training a little bit toward like below 75% of tangible. When you think about capital allocation on a go-forward basis, you obviously have the potential monetization of Xome, which timing is obviously you can't put exact timing on that today, which could be make, push your book value significantly higher and significantly reduce that discount to kind an implied fair value in the future.\n\nWhen you think about the combination of that versus buying MSRs at, let's say mid-teens unlevered yield, in some ways buying your stock back at 30% discount or a 30% plus discount on an applied forward book value. If you can generate a low to mid-teens return on equity could generate a higher teens type return on a relative basis, how do you think about the interplay between where MSRs are trading in the market versus buying back your stock over the next kind of few quarters or on a go-forward basis?\n\nChris Marshall -- Vice Chairman and President\n\nThat's a lot to respond to. I think I agree with it all. I think the essential point you're making is our stock seems to be undervalued and buying it back produces a great return. That's why we have been buying it back consistently.\n\nBut I go back to we're in a very unprecedented time, Giuliano, we want to come out on top. So we are going to deploy our capital in the -- and only the way that we think and have lots of confidence in is going to produce the best long-term return for our shareholders, including us who are large shareholders. So we're being patient and that might not sound sexy this morning, but we are going to take advantage of the changes in the cycle in the absolute best way that builds shareholder value long-term.\n\nGiuliano Bologna -- Compass Point Research and Trading -- Analyst\n\nThat's great. Thank you very much. And I'll jump back in the queue.\n\nOperator\n\nThank you. One moment for our next question. Our next question come from the line of Jay McCanless from Wedbush. Your line is open.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nHey. Good morning. Couple questions on Xome. I think the first one we had and I think it's on Slide 4, the deck where you put on there that you're managing it for 2023 monetization.\n\nIs that new updated thinking on that or is a plan always been some time in 2023 to get that monetized?\n\nChris Marshall -- Vice Chairman and President\n\nNo. It's always been the plan that we would monetize in 2023. It may be a quarter or two later in 2023, but we are spending a lot of time with our bankers now, just beginning conversations with potential interested parties, but we don't think that will sell until some point next year. And we'll update you on timing as we have a better beat on that.\n\nSo we've consistently said 2023, so there's no change too.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nOK. Thank you. And then the other question I had just property sales which had been trending up sequentially were down a little bit this quarter. Understanding that mortgage rates went up pretty significantly, is it just weakness in the market or a decision to sit on some of these properties longer?\n\nChris Marshall -- Vice Chairman and President\n\nNo. I think it's just that, I mean when you see interest rates, there are lot of individual buyers out there seeing their financing costs that have doubled while they were looking at homes. And at the same time, if you looked at month-over-month change in housing prices starting to come down, it's understandable, you'd see people pause a little bit, but as prices reset, as appraisals start to reflect real value, those guys are going to jump back in and buy.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nDo you, I guess, you talked a lot on the call today about prices coming in. I mean, do you have any kind of outlook or forecast for where you think home values and price -- home prices go over the next say three to four quarters?\n\nChris Marshall -- Vice Chairman and President\n\nNo. I'm not going to forecast that, but I think we're seeing a trend. I mean, the cost of your mortgage payment and house prices are strongly correlated. So if rates go from three and a half to seven and a half, you got to assume home prices are going to come down.\n\nHome price affordability, which I think was at 102 on the index last June, I don't know where that's going to end up, but I wouldn't be surprised. It was at 85 after the full impact of this rate rise is factored in. So now keep in mind, if you look at home prices, you look at Case-Shiller, I think they peaked at 100. I mean up 21% or 22% for the year.\n\nAnd that was in April. From April to, I guess it was last month, September they've dropped 7%. So I don't know if that's long enough to say a trend, but I fully expect home prices to come down. I wouldn't put a number on it, but --\n\nJay Bray -- Chairman and Chief Executive Officer\n\nYeah. I think our B is consistent with the overall market, which is in that 15% range. So that's kind of our current macro view and we'll keep an eye on it.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nOK. That sounds great. Thanks for the color.\n\nOperator\n\nThank you. And that's all the time we have for Q&A today. I'd like to turn the call back over to Jay Bray for any closing remarks.\n\nJay Bray -- Chairman and Chief Executive Officer\n\nThanks everybody for joining the call and we look forward to additional conversations. Have a great day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKen Posner -- Senior Vice President of Strategic Planning and Investor Relations\n\nJay Bray -- Chairman and Chief Executive Officer\n\nChris Marshall -- Vice Chairman and President\n\nJaime Gow -- Executive Vice President and Chief Financial Officer\n\nKevin Barker -- Piper Sandler -- Analyst\n\nBose George -- Keefe, Bruyette and Woods -- Analyst\n\nMark DeVries -- Barclays -- Analyst\n\nEric Hagen -- BTIG -- Analyst\n\nDoug Harter -- Credit Suisse -- Analyst\n\nGiuliano Bologna -- Compass Point Research and Trading -- Analyst\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nMore COOP analysis\n\nAll earnings call transcripts"
}