{
  "companyName": "LGI Homes",
  "companyTicker": "LGIH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/lgi-homes-lgih-q3-2022-earnings-call-transcript/",
  "content": "LGI Homes (LGIH -0.12%)\nQ3 2022 Earnings Call\nNov 01, 2022, 12:30 p.m. ET\n\nOperator\n\nWelcome to LGI Homes' third quarter 2022 conference call. Today's call is being recorded and a replay will be available on the company's website later today at www.lgihomes.com. We have allocated an hour for prepared remarks and Q&A. [Operator instructions] I will turn the call over to Josh Fattor, vice president investor relations at LGI Homes.\n\nJosh Fattor -- Vice President, Investor Relations\n\nThank you, and good afternoon. I'll remind listeners, this call contains forward-looking statements, including management's views on LGI Homes' business strategy, outlook plans, objectives and guidance for 2022. Such statements reflect management's current expectations and involve assumptions and estimates that are subject to risks and uncertainties that could cause management's expectations to prove to be incorrect. You should review our filings with the SEC, including the risk factors and cautionary statement about forward-looking statements sections for discussion of the risks, uncertainties, and other factors that could cause actual results to differ from those presented today.\n\nAll forward-looking statements must be considered in light of those related risks and you should not place undue reliance on such statements which reflect management's viewpoints as of the date of this conference call and are not guarantees of future performance. Additionally, on today's call, we will discuss non-GAAP financial measures that are not intended to be considered in isolation or as a substitute for financial information presented in accordance with GAAP. Reconciliations of non-GAAP financial measures to the most comparable measures prepared in accordance with GAAP can be found in the press release we issued this morning and at our quarterly report on Form 10-Q for the quarter ended September 30, 2022, that we expect to file with the SEC later today. This filing will be accessible on the SEC's website and in the investor relations section of our website.\n\nOur hosts today are Eric Lipar, LGI Holmes' chief executive officer and chairman of the board; and Charles Merdian, chief financial officer and treasurer. I will now turn the call over to Eric.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nThanks, Josh. Good afternoon, everyone, and welcome to our earnings call. I'll open by congratulating the LGI team on our accomplishments in the third quarter. In prior calls, we've said we were preparing for the housing market to normalize.\n\nNow, it's clear the pendulum has swung past normal and into challenging. With mortgage rates doubling and expectations they could move higher demand has cooled considerably. Finding buyers who are both motivated and qualified is the new game in town, and we're pivoting in line with our core competencies to meet this challenge. I'm pleased to report our teams across the country are charging forward with enthusiasm and confidence.\n\nAs we said on the last call, we've ramped up our marketing efforts to find qualified buyers. This continued in the third quarter and we saw positive results with over 74,000 leads, an increase of 72% over our prior quarter. I want to commend our marketing team for their ability to quickly pivot and for their success connecting with families interested in home ownership. In our information centers, we aren't focused on treasury yields, equity markets or global instability.\n\nInstead, we're focused on the needs of the customers who call us looking to discover if home ownership is possible for them. To understand and meet our customers' needs we're focused on training. The selling skills that differentiate our model and built our company are currently being refreshed, rehearsed, drilled and successfully executed every day in every information center across the nation. We want to thank our salespeople for their commitment, focus and positivity they demonstrate each day.\n\nWe've seen considerable success driving demand to our information centers. However, the main headwind is buyer qualification. Higher selling prices combined with higher rates has further stretched affordability and pushed ownership beyond the reach of many renters. To address this, we've implemented a number of incentives designed to make monthly payments more affordable.\n\nAdditionally, in high-margin communities where existing backlog isn't at risk as well as in communities where input costs are normalizing, we've rolled out selective price reductions while maintaining gross margins in our historical ranges. These efforts are ongoing, but results to date have been positive with third quarter net orders at a pace of 5.5 homes per month per community, mashing our third quarter closings pace of 5.5 homes per community. As noted on previous calls, our wholesale channel, selling homes to the single family rental space is a powerful lever to drive volume, and this quarter was no exception. During the quarter, we delivered 443 homes into this channel and had an additional 591 wholesale contracts and our backlog at quarter end.\n\nOur wholesale business has now generated cumulative revenue of over $1 billion since beginning operations in 2016. Congratulations to the LGI Living team on this impressive milestone and on their accomplishments during the quarter. With that, I'll turn the call over to Charles to discuss our financial results.\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nThanks, Eric. During the quarter, we closed 1,547 homes, a decline of 38.1%, primarily related to lower community count and absorptions compared to last year's record comp. As Eric noted, 443 of our closings were sold through our wholesale business, representing 28.6% of our total closings compared to 433 homes or 17.3% of our total closings in the same quarter last year. Revenue in the third quarter was $547 million, a decline of 27.2% from last year, primarily driven by fewer home closings and partially offset by a 17.6% increase in our average selling prices to $353,635.\n\nSelling prices increased in all of our reportable segments, primarily due to the quality of and our success maintaining our backlog as well as our ability to pass through higher input costs in supply constrained markets. Gross margin this quarter was 28.5%, a 160-basis-point improvement over the same period last year and a new third quarter record. The increase resulted from prices and excessive costs in our backlog, lower capitalized interest expense and lower lot costs as a percentage of average sales price. Adjusted gross margin this quarter was 29.5%, a 130-basis-point improvement over the same period last year and also a new third quarter record.\n\nAdjusted gross margin excludes $4.6 million of capitalized interest charged cost of sales during the quarter and approximately $1.2 million related to purchase accounting, together representing 100 basis points. Combined selling general and administrative expenses for the third quarter were 11.2% of revenue compared to 8.6% during the same period last year. Selling expenses for the quarter were $33.9 million or 6.2% of revenue compared to 5.3% for the third quarter of 2021. The increase was primarily related to higher advertising spend and other selling related expenses as a percentage of revenues and was partially offset by lower outside commissions.\n\nGeneral and administrative expenses totaled $27.3 million or 5% of revenue compared to $24.5 million last year. The increase was primarily driven by increased overhead expenses and terminated deal costs. We expect quarterly SG&A to vary based on revenue and initiatives undertaken to navigate the current market uncertainty. Based on our results to date, we now expect our full year SG&A expenses as a percentage of revenue to be in a range between 11% and 12%.\n\nEBITDA for the quarter was $113.7 million or 20.8% of revenue, representing a 270-basis-point improvement over the same period last year and a new third quarter record. Adjusted EBITDA was $100.8 million for 18.4% of revenue, a 130-basis-point decrease year over year. Adjusted EBITDA excludes $14.1 million of other income and $1.2 million related to purchase accounting, together representing approximately 240 basis points. The decrease in adjusted EBITDA as a percentage of revenue was attributable to an $11.8 million year-over-year increase in other income, reflecting a one-time gain on the sale of an interest rate cap prior to its expiration.\n\nIncome associated with our investment in unconsolidated entities and an increase in the number of acreage home sites sold in a North Carolina community not associated with our core home building operations. Pretax net income was $108.7 million or 19.9% of revenue, a 300-basis-point improvement over the same period last year and a new third quarter record. Our effective tax rate in the third quarter was 16.8% compared to 20.8% last year. The decrease was driven by the reinstatement of federal energy efficient tax credits on qualified homes, including the retroactive impact of credits related to closings in the first half of 2022.\n\nWe plan to receive additional tax credits during the fourth quarter and now estimate our full year effective tax rate will be in the range between 21% and 22%. Our third quarter reported net income was $90.4 million or 16.5% of revenue. Earnings per share in the third quarter were $3.88 per basic share and $3.85 per diluted share. Gross orders in the third quarter were 1,951.\n\nNet orders were 1,536, an increase of 94.4% year over year, primarily due to our decision to limit sales in the third quarter of last year, resulting in a modest comp. Net orders were up 77.8% sequentially, illustrating our success, driving more leads through increased advertising spend as well as our ability to implement the right combinations of incentives needed to qualify more customers. Excluding wholesale contracts written during the quarter, retail net orders were up 30% year over year and 20.8% sequentially. Our cancellation rate for the third quarter was 21.3% compared to 43.1% last year and 30.5% last quarter.\n\nOur backlog at the end of the third quarter consisted of 1,255 homes valued at $428.3 million. Turning to our land position. As of September 30, our portfolio consisted of 76,453 owned and controlled lots, a decrease of 12.6% year over year and 15% sequentially. We ended the quarter with 60,627 owned lots, an increase of 37.2% year over year and a decrease of 2% sequentially.\n\nOf our owned lots, 48,516 were either raw land or land under development. And approximately 1/3 of those lots were actively under development. Of the remaining 12,111 of our owned lots, 8,001 were finished vacant lots. We slowed our pace of starts during the quarter to align our vertical inventory with current demand.\n\nDuring the quarter, we started approximately 840 homes compared to over 2,300 starts this time last year and a similar amount last quarter. At September 30, we had 4,110 completed homes, information centers or homes in process. Excluding information centers and homes in process, we had 1,420 completed homes. Finally, at quarter end we controlled 15,826 lots, a decrease of 63.5% year over year and 43.7% sequentially.\n\nThe decrease in controlled lots primarily resulted from an ongoing assessment of our pipeline and the decision to walk from deals that no longer met our criteria or where we believe we could acquire the same or similar piece of land at more opportunistic prices in the future. During the quarter, these terminations resulted in approximately $3.1 million of costs. Turning to the balance sheet, we ended the quarter with $52.7 million in cash, nearly $2.9 billion in real estate inventory and total assets of over $3.1 billion. Total debt at quarter end was $1.2 billion, resulting in a debt to capitalization ratio of 43.4% and a net debt to capitalization ratio 42.3%.\n\nAs of September 30, we had total liquidity of $180 million, consisting of the $52.7 million of cash on hand and $127.3 million available to borrow under our credit facility. We'll continue to adjust inventory in line with the pace of demand in each community. And as our vertical inventory rebalances, we expect to generate positive cash flow that will further enhance our balance sheet and create additional liquidity by the end of the year. Given current market conditions, we chose not to repurchase stock during the third quarter, focusing instead on developing the land that will drive our community count growth in 2023 and 2024.\n\nAt this point, I'll turn the call back over to Eric.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nThanks, Charles. While rates may keep climbing and the market will remain uncertain for a while, there's no question in our mind about the parts of our business that we control and how we will manage our business in this environment. Pending verifications of fundings we expect to report, we closed approximately 530 homes in October. Based on our closings today, we now expect to close between 6,700 and 7,100 homes at an average selling price between $340,000 and $350,000 for the full year.\n\nSupply shortages continue to extend development timelines, and we now expect to end the year with 95 to 100 active communities. We're tightening the range of our gross margin guidance to a range between 27.7% and 28.7%, and adjusted gross margin between 29% and 30%. Finally, we now expect wholesale closings to be approximately 20% of our full year closings. I'll conclude by talking briefly about our people and LGI Homes' longer-term outlook for the business.\n\nWhen times get tough, the people in an organization can start to feel uncertain about the future. What they need is reliable, honest communication about the business, and, more importantly, how the organization plans to manage the situation. To that end, we're regularly updating our employees on our business and the exact steps management is taking to confront the headwinds through all-employee calls, our weekly national sales calls, quarterly updates at corporate and in our local markets, and a number of other role-specific calls, meetings and retreats. Additionally, we look forward to hosting our senior leadership teams here in Houston next week for additional updates, training and development that they'll take back to their local markets around the country.\n\nWe remain positive about the long-term outlook for the housing market and continue to manage our business with a focus on growth and profitability, not just in the coming quarters, but for many years in the future. We're actively investing in development to grow our community count 20% to 30% in 2023 and another 20% to 30% in 2024. To do this, we need to retain our loyal employees and hire additional people to support our plan growth. We thank our employees for their commitment and enthusiasm during this uncertain time.\n\nYour determined efforts on behalf of our customers, combined with our systems, culture and 100% spec-focused model delivered positive results last quarter and will continue to drive our success in the future. We'll now open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Michael Rehaut from J.P. Morgan. Please go ahead.\n\nUnknown speaker\n\nHi, everyone. Thanks for taking my question. This is Andrew Rossie on for Mike. Congrats on the quarter.\n\nI wanted to ask, it's great to see that you guys haven't lowered your gross margin guidance despite being a spec builder and pricing the market. How should we be thinking about the next two to three quarters as you're adjusting prices for new communities ahead of their opening?\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah. Great question, Andrew, and good morning. Yeah, I think we're not going to get into guidance for next year's gross margin, but I think our guidance for this year is assuming margins are normalizing. We're really -- margins is a byproduct of pricing and really looking at pricing on a community-by-community level.\n\nAnd we are lowering prices. Last quarter was the highest gross margin history in Q2, solid gross margins in Q3, and then we're adjusting to current market. Most of our peer group is lowering price around us to get into appraisal challenges. So we're pricing to market.\n\nAnd that's part of our incentive program. But yes, no, we're pleased with our gross margin guidance. And that'll be great gross margin to end the year with.\n\nUnknown speaker\n\nThat's helpful. And then speaking about pricing, looking at the pricing that's kind of implied next quarter, can you speak to whether that's more so due to new communities coming online or if it's just adjustments at existing communities? And if you can kind of provide a percentage gap that would be great between the pricing.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah, our backlog is at 341,000. I think there's a couple things that impact our AFPs going forward. One is normalize the margins and lowering the price point communities and also the newer communities coming online would be priced with normal margins, which is going to lead to a lower ASP. Also our wholesale mix has increased.\n\nWe sell houses in bulk to the single-family rental industry. They're getting a discount off of the retail price. So that's a headwind to ASP and gross margin, but very accretive to the bottom line of LGI. And then also what we're seeing and not surprising in this higher rate environment where payment is very important is our customers are choosing smaller floor plans.\n\nAnd that has an impact on ASP. So, for example, if the customer chooses and qualifies for and we close on a 1,400 square foot house instead of a 1,700 square foot house in the same community, there's probably a delta of $20,000 to $30,000 in ASP because they chose the smaller floor plan. And we're also introducing smaller floor plans in a select number of communities as well.\n\nUnknown speaker\n\nOK, that's really helpful. Congrats on the quarter and good luck in the coming quarters.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nThank you. Appreciate it. Thanks.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Truman Patterson with Wolfe Research. Please go ahead.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nHey. Good afternoon, everyone. Thanks for taking my questions. First, a bit of a housekeeping question, but I'm hoping you can help us understand the delta between your reported gross margin and adjusted gross margin.\n\nI think it implies that the fourth quarter amortized interest is going to triple, maybe quadruple from here in the fourth quarter versus the third quarter. And I believe you mentioned something about selling an interest rate cap in your prepared remarks. So hoping to get a little clarity there.\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nYeah. Sure, Truman. This is Charles speaking. So we're expecting the delta between adjusted gross margin and gross margin to stay relatively similar.\n\nI think we gave 130 basis points spread. The third quarter came in at about 100 basis points. So similar to what we've said in the past but we tightened that up a little bit from 150 to 130 based on what we've seen so far year to date. So the spread should be consistent with what we've said on previous calls.\n\nAnd then the interest rate cap sale is coming in through other income. It was a $7.1 million impact to other income. This was an interest rate cap that we purchased back in November of 2020 and sold in the third quarter as we felt like it had good value and the term was expiring in early 2023. So we felt like it was the right time to monetize that interest cap for us during the quarter.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nOK. OK. Thanks for that. And then in your orders, I'm hoping to understand the incentive level, including kind of base pricing adjustments and we'll call it September compared to earlier in the year.\n\nAnd then could you also discuss the incentive levels needed to move product for the core home buyer compared to your wholesale channel?\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah, Truman. This is Eric. I put incentives in a few different buckets. One is on the mortgage side.\n\nObviously, rates are higher. We're in the business of offering an affordable alternative to rent. So monthly payment is important and mostly impacted by rates. We have not went down the road of spending a lot of dollars on big forward commitments to the mortgage partner or going that route.\n\nWe're doing one to two discount points every week as an incentive to get that fixed rate as low as possible going into every weekend. So that's the incentive part on the mortgage side. And then how much we are normalizing pricing in the community is really community-by-community nationwide. It depends on what the backlog is, how many houses are left in that community, what the gross margins are at to start off.\n\nAnd then new communities are in our 25% to 28% adjusted gross margin rolling out business as usual. And then the wholesale mix is also a way not necessarily to reduce the prices through the retail channel, but is a way to move some excess inventory. That's been a big part of our business and very important part of our business. And the single-family rental industry is still buying houses from us and their appetite is still strong.\n\nIt's just working on the price that works for both parties.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nOK. OK, thanks for that. And if I could sneak one more in. Your can rate dropped almost 10 points, I think, quarter over quarter.\n\nI think you're the first builder to report that. Can you just help us think through what drove that result? Is it you all scrubbing buyers more aggressively, rate locks, buy-downs? Or did you all adjust pricing in your backlog as well?\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah. No, I can -- this is Eric. I can handle that one. We did not adjust pricing in our backlog at all.\n\nI would describe our cancellation rate is back to normal. And I think the difference between us and the other builders is we are 100% spec builder, the backlog is all new. We don't have backlog from sales from quarters ago flowing through anymore. So our sales going forward and our closings are really going to be what we sell over the next 30 to 60 days, still are going to impact Q4 closing.\n\nSo our cancellation rate is back to normal. I think our team is doing a great job of managing the pipeline. But I would expect normal cancellation rate in that range for next year as well.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nAll right. Thank you. Appreciate it.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah. You're welcome, Truman.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Kenneth Zener from KeyBanc. Please go ahead.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nGood morning, gentlemen. \n\nEric Lipar -- Chairman and Chief Executive Officer\n\nGood morning.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nHopefully I have two questions here. As you talked about starts, we're in the 800 range, matching demand, I don't want to paraphrase you, but I think that's what I heard. And can you talk to what that means about the level of activity sequentially really? I realize you're opening communities up, so I don't want to get -- I'm not looking for guidance. I'm just trying to -- it is an impressive number versus sequentially and year over year.\n\nSo is that where demand is in terms of what you -- yes, if you could answer that or give -- illuminate that, I would appreciate it.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah. I think that's about where demand is on the resale side -- Retail side, excuse me, Ken, 840 starts and just where demand is with rates where they are right now and affordability. And the inventory we already had on the ground, we just didn't need to start a lot of houses. So we got -- I won't say ahead of ourselves because we are building houses according to the demand and the demand from the retail side when interest rates have went from 3.5%, 4%, all the way up to 7% has slowed considerably.\n\nSo that total amount of inventory that we have is just not necessary. I mean we got as high as 4,800 houses total under construction. We got that number down to 4,100. And at the pace we're running right now, probably 3,500 is where we need to be.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nGood. And then I want this to be one question, but they tie in together. Sorry about that. You mentioned community count growth.\n\nI think you said 20%, 30% in '23, '24. Can you talk about how that impacts SG&A because it's varied, obviously, between '22 and '21. Are you going to see leverage there up or down versus kind of your run rate right now? And how do you think that's going to be impacting your cash flow? That requires obviously a lot of people as well as capital. And if you might just give us some broad thoughts because I'm sure you've already considered that, those elements.\n\nThank you.\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nYeah. You bet, Ken, this is Charles. So starting, I think the way we think about it is breaking it down into the two components. So on the selling expense side, we've been talking about over the last several quarters just the benefits of limited advertising spend as we went through kind of through the pandemic and post pandemic.\n\nSo as we grow community count, we would expect selling expenses really to not see much leverage there and actually the opposite where you see selling expenses as a percentage of revenue start to tick back up. That's also implied in our guidance for full year SG&A for this year. So I think you'll see selling as a percentage inch up rather than leverage. And then on the G&A side, that is where we do have opportunity for some leverage in the future.\n\nI think it will be muted more in the short term. We'll obviously give guidance for 2023 at a later date. But I think that on the G&A side, where it tends to be more fixed expenses is where there's some opportunity for leverage in the future. And then the second part of the question on just how we're thinking about that in cash flow.\n\nMost of the acquisitions that are resulting in the community count growth are deals that we purchased in 2020 and '21, raw land deals that we've been developing over time. So most of the cost to get those lots ready have been incurred up to this point. So we do have about a third of our lots that were under active development. So the majority of those costs have been incurred as we're getting those communities online.\n\nSo we expect our development cost to taper as we deliver those sections which in the short run will generate some cash flow, as we mentioned, particularly as we adjust our vertical inventory as well.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nYou're welcome.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Carl Reichardt with BTIG. Please go ahead.\n\nCarl Reichardt -- BTIG -- Analyst\n\nThanks, everybody. Hey, Eric. You mentioned 3,500 units being kind of the ideal vertical construction number now. And you were at, I think, a little over 1,500 finished this quarter, which I think is the highest you've had in a couple of years.\n\nIs the right ratio for that 3,500 to be kind of one-thirds finished, two-thirds under construction? Or how do you sort of think about that given that you want to run your business model based on specs? And I assume as much finished as you think the balance sheet can handle running that model.\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nYeah. Sure, Carl. This is Charles. So we're really thinking about inventory from a six-month supply.\n\nSo 3,500 would make sense to us at a 7,000 a year pace. If you go back and look pre-pandemic, we had about 1,800 completed houses at the end of 2019. So but we're really thinking about inventories, about half of it should be complete on the ground, getting back to normal where our salespeople have the ability to show the customer the house that they're going to move into, which is not what we've experienced over the last couple of years. So about half in complete and about half under production, and then we would start what we're closing and then get back to that rotational aspect of close six, start six; close five, start five.\n\nSo get back into that inventory management type of flow.\n\nCarl Reichardt -- BTIG -- Analyst\n\nOK. So this has been encouraging in that it feels like you're getting back a little more to the balanced model on the sales and construction side. Are you seeing any kind of improvement in your cycle times over the last quarter or so, labor availability? Obviously, you've heard the front-end trades are a little more available now or is that 1,500 also partially a function of cans?\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nNo, I think the production flow is, how we would describe as similar. I think you're accurate and the feedback you're getting in terms of the front end seems to be slightly better, but really nominal from that aspect in terms of improvement costs are marginally better. We would not describe them as significantly better, but hopefully headed that way.\n\nCarl Reichardt -- BTIG -- Analyst\n\nOK, great. I'll get back in queue. Thanks.\n\nOperator\n\nThank you. One moment for our next question. The next question comes from Jay McCanless from Wedbush. Please go ahead.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nHey. Good afternoon, everyone. First question, are you guys still limiting sales until you're within 60 days of closing? Or have you all had to take that off just given what's going on in the market.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nWe're limiting sales, Jay. This is Eric. We're limiting sales at 90 days, just so we can be comfortable with the closing dates. And most of the time, that house will have started construction.\n\nSo as long as we have a good -- know the closing date, want to have the customer have a great experience. So 90 days instead of 60 days in this is the current environment.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nDo you -- I guess, when you made that change, is that maybe part of the reason that the cans have gone up, are those two not related?\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah, I don't think they're really related. The cans rates, it really went down a lot year over year. So yes, the cancellation rate around 20% is normalized. So I won't look too much into that.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nGot it. And then I guess to get to 20% to 30% community growth for, I think you said '23 and '24. What needs to go right because that seems a pretty ambitious goal given that you guys and pretty much every other builder we talked to said that horizontal development is still harder right now than vertical development.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah. It is very difficult, Jay. And hopefully we have enough contingency in. We've got today's current market conditions embedded in those dates, but we have been wrong so far.\n\nWe thought it was going to get better, and it's gotten worse. As you -- as everybody has seen, we've adjusted our community count guidance down from where we started the year. But those communities didn't disappear. They're still under development, they're still owned, and they're still coming.\n\nIt's just been a delay. So the community count growth in '23 and '24 should be conservative. We own all that land, all those projects are on development. We think we've got the correct schedules built in based on today's environment.\n\nThat is not built in any additional opportunities we see or any additional communities that we have an opportunity to buy and add to that number, has no M&A built in. So we think those numbers should be conservative, and we're confident in that community count growth.\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nOK, great. I'll jump back in queue. Thank you.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Alex Barron with Housing Research Center. Please go ahead.\n\nAlex Barron -- Housing Research Center -- Analyst\n\nYeah. Thank you, gentlemen. I just wanted to make sure I heard correctly, you said the growth for the next two years is expected to be 20% to 30%. Is that correct? How are you guys looking to fund it? Is it going to be mainly with debt? And if so, what kind of maximum leverage are you thinking you'll be willing to carry?\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah. It was community count growth of 20%, 30%, and I'll let Charles handle the debt question.\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nSure. Yeah, Alex. So our target leverage ratio, as we've previously stated, has been between 35% and 45%. So by lowering our vertical inventory, we expect to generate some positive cash flow in the short run.\n\nAnd as I mentioned, most of the development costs incurred to bring on next year's communities have already been spent. So that is on balance sheet already. So as we move and open into those communities, we'll start generating cash flow. We feel very comfortable with the section sizes that we have coming online.\n\nSo we feel like a good portion of that investment for both 2023 and 2024 has already been made and is reflected on our balance sheet today.\n\nAlex Barron -- Housing Research Center -- Analyst\n\nGot it. And then as it pertains to margins and costs going forward, I mean, it seems you guys have obviously adjusted pricing and orders have gone up as a result. But as we look forward, with rates kind of still trending up and all that stuff, are you guys finding a way to offset the price cuts with cost cuts as well somehow, like are the trades responding at this point? And if so, do you feel like margins are going to stabilize pretty soon?\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah. I think, Alex, margins are definitely normalizing. You see our margins quarter-over-quarter trending down. Based on our guidance, we're expecting gross margins to be lower in the fourth quarter, but still in the historical range, like we said earlier.\n\nAs we roll out new communities, 25% to 28% adjusted gross margin is where we were historically. And that obviously has been a very robust gross margin environment the last couple of years from the pandemic. We expect to go back to that with the asterisk even that the more business we put through the wholesale channel, that lowers the gross margin as well. But we don't anticipate getting to a 20% or below type of gross margin.\n\nWe plan on getting back to our historical range of 25% to 28% and then factoring in the wholesale business.\n\nAlex Barron -- Housing Research Center -- Analyst\n\nOK. But I guess my question was, are you guys getting some type of offset from subs at this point or not yet?\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nNot yet. We'll start seeing the cost come down. Obviously, it's by community-by-community and market-by-market. So we're starting to see some cost relief.\n\nObviously lumber is down. And I think it's really just how strong or weak the market is going forward and where the pricing is going to come out for all of us.\n\nAlex Barron -- Housing Research Center -- Analyst\n\nGot it. OK, thanks and best of luck.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nThank you.\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Carl Reichardt with BTIG. Please go ahead.\n\nCarl Reichardt -- BTIG -- Analyst\n\nHey. Thanks for the follow-up time. Charles, you said you put $3.1 million in, I think, it's option walk away and written off due diligence costs in the G&A line. Does the full year SG&A guidance include any more of those types of costs in fourth quarter? And if so, how much?\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nYeah, we should probably see some, not as much as what we saw in the third quarter as we brought down our controlled pretty significantly already. There may be some left in the queue to pull through in the fourth quarter. I think the majority of what you'll see in the implied guidance is really more getting back to normal expenses, hosting meetings, some of the things that we talked about in terms of some of the initiatives that we're doing from a training standpoint is going to offset any reduction from Q3 to Q4.\n\nCarl Reichardt -- BTIG -- Analyst\n\nOK, thank you for that. And then Eric, just to clarify the last comment you made. So 25% to 28% normalized adjusted gross margin and then factoring in what comes from the wholesale business? Or is that inclusive of what you expect from wholesale?\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nNo, that's -- you need to factor that separately. And I'm talking generally here, that's really what our guidance applies as well for the end of the year. And then going forward, we don't want to get into '23 type of guidance. That's just how we think about the business.\n\nAnd we do a lot of land development. So we need to be capturing some of that development profit as well.\n\nCarl Reichardt -- BTIG -- Analyst\n\nYeah. OK, I got it. Thanks so much. Appreciate it guys.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYou're welcome. You're welcome.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Kenneth Zener with KeyBanc. Please go ahead.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nHello, again. I wonder if you guys could expand on comments you made around the wholesale buyers. Can you talk to cap rates specifically like a change in cap rates or what your understanding of their appetite is based on what cap rates are changing because obviously related to interest rates as well. I'm just interested to see how that part of the market is shifting from your perspective.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYeah, Ken. This is Eric. I'll take it at a high level, but we work with a number of different investors from big, large, single-family REITs to smaller private equity type of customers, and it's been very positive for us, and there's still demand. But there is some price discovery when we're work with our wholesale investors.\n\nInterest rates have impacted them. Cap rates have changed. So they're looking to pay less for houses than they did six months or a year ago, but that's also part of the normalization. So I don't really look at that as a headwind.\n\nWe both have to get back to normal margins, whether we're selling the houses retail or selling it to wholesale. So it's a lot of negotiation and also how we look at it. Right now, we're starting to build finished inventory that we're open-minded to moving and getting closed, etc. But going forward, once we get our inventory balance to the current retail environment, it's going to go back to more of we're starting construction and selling them to the single-family rental industry.\n\nSo it's going to be more normalized pricing as well. I think all of us in the industry, if we're going to make aggressive deals with single-family rental operators coming out and finish the inventory that we have. And we're getting limited in those. We put a big dent in our inventory.\n\nInventory dollars are coming down and our inventory units, like we talked about earlier on the call.\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Truman Patterson with Wolfe Research. Please go ahead.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nHey, thanks for taking my follow-up. Just wanted to get a little clarity. I believe the midpoint of your fourth quarter gross margin guide implies -- your reported gross margin guide implies like a 22.5% level, but it's pretty wide anywhere from 20% to 25%. I'm just hoping to understand what would get you all to the upper and lower bands of that range, and I'm trying to tie it all together with the new community openings coming in at an adjusted 25% to 28% level.\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nYeah. No, I think, Truman, it's a great question. I think the lower end of the range just assumes more -- higher percentage of our business coming from the wholesale channel, and a tougher sales environment with more incentives. And that I think the higher end of the range is exactly the opposite on gross margin.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nOK. All right. Thank you.\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nYou're welcome.\n\nOperator\n\nThank you. At this time I'm not showing any further questions.\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nAll right. Thank you for participating on today's call and for your continued interest in LGI Homes. Have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJosh Fattor -- Vice President, Investor Relations\n\nEric Lipar -- Chairman and Chief Executive Officer\n\nCharles Merdian -- Chief Financial Officer and Treasurer\n\nUnknown speaker\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nKen Zener -- KeyBanc Capital Markets -- Analyst\n\nCarl Reichardt -- BTIG -- Analyst\n\nJay McCanless -- Wedbush Securities -- Analyst\n\nAlex Barron -- Housing Research Center -- Analyst\n\nMore LGIH analysis\n\nAll earnings call transcripts"
}