{
  "companyName": "uCloudlink Group Inc.",
  "companyTicker": "UCL",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/ucloudlink-group-inc-ucl-q2-2022-earnings-call-tra/",
  "content": "uCloudlink Group Inc. (UCL 11.71%)\nQ2 2022 Earnings Call\nAug 24, 2022, 8:30 a.m. ET\n\nOperator\n\nHello, and welcome to uCloudlink Group Inc. second quarter 2022 earnings conference call. [Operator instructions] Please note, today's event is being recorded. And now, I would like to turn the conference over to Jillian Zeng, investor relations.\n\nMs. Zeng, please go ahead.\n\nJillian Zeng -- Investor Relations\n\nThanks, everyone, for joining us on our second quarter 2022 earnings call today. The earnings release is now available on our IR website at ir.ucloudlink.com as well with newswire services. I will give a brief introduction to our uCloudlink management team. Zhiping Peng is our co-founder and the chairman of the board of directors.\n\nChaohui Chen is our Co-Founder, director and chief executive officer. Yimeng Shi is our chief financial officer. Zhu Tan is our vice president of the marketing and sales. Our CEO will begin with an overview of our company and business highlights, which will cover Section 1 of the earnings presentation posted on our IR website.\n\nOur CFO, Yimeng Shi, will then discuss our operational highlights and the financial results as presented in Sections 2 and 3. Before we proceed, please note that this call may contain forward-looking statements made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on management's current expectations and observations that involve the known and unknown risks, uncertainties and other factors not under the company's control, which may cause actual results, performance or achievements of the company to be materially different from the results, performance or expectations implied by these forward-looking statements. All forward-looking statements are expressly qualified in their entity by the cautionary statements, risk factors and details of the company's filings with the SEC.\n\nThe company does not assume any obligation to revise or update any forward-looking statements as a result of new information, future events, change in the market conditions or otherwise, except as required by law. Please also note that uCloudlink's earnings press release and this conference call include discussions of the unaudited GAAP financial information as well as unaudited non-GAAP financial measures. uCloudlink's press release contains a reconciliation of the unaudited non-GAAP measures to the unaudited most directly comparable GAAP measures. I will now turn the call over to our co-founder and CEO, Mr.\n\nChaohui Chen. Please go ahead.\n\nChaohui Chen -- Co-Founder, Director, and Chief Executive Officer\n\nYes. Thank you, Jillian. Page 4 to Page 12 are similar content as the earnings presentation of the first quarter of year 2022. We still encourage you to review in the second quarter of year 2022 earning presentation uploaded to our investor relationship website with some latest updates.\n\nHence, I will not elaborate on the past similar with the first quarter of year 2022 earnings release, but will instead focus on our most recent developments in the second quarter. Let's move to the Page 13. uCloudlink 1.0 is our international data connectivity services business, which has had a strong track record of high gross margins and profitability with ongoing growth potential. During the second quarter of year 2022, our 1.0 business revenues has increased by 40.1% compared to the same period in year 2021 as international tariff restrictions around the world continue to abate over time.\n\nThe number of average daily active terminal for the 1.0 business has increased during the second quarter of the year 2022. Compared to the second quarter of the year 2021, average daily device terminal has increased by 23.6%, a testament to the faster recovery of our 1.0 business, which indicates that more and more customers are using our products and services. With our innovative global 5G roaming solution, we hope to strengthen our leading technology position in providing reliable, high-quality international data connectivity services in more than 140 countries, powered by our PaaS and SaaS platform, enabling single operator entry point to assess more than 300 global mobile network operators of our network. We remain positive about the ongoing recovery and growth of global tourism demand and expect revenue from 1.0 business to steadily grow and exceed pre-COVID-19 level in the future.\n\nLet's move to Page 14. uCloudlink 2.0 is our local data connectivity services business and has become a new source of revenue growth since the year 2020. Its growth is built upon our efforts in exploring market opportunities such as the post-pandemic new normal lifestyle that people are getting more and more used to. The development of 5G applications in the IoT area, our abilities to improve network conversions, data connections, cooperation with intelligent hardware manufacturers to implement GlocalMe Inside, etc.\n\nIn the past quarters, we have continued to strengthen our presence in our existing markets, including Japan, North America, Southeast Asia, where we help operators and business partners improve their data connectivity services and solve data connection problems through our PaaS and SaaS platform based on our patent technologies, including CloudSIM and HyperConn technology solution. We adapt ourselves to the evolving market by introducing and upgrading innovative products to address various 2.0 business application scenarios. During the second quarter of year 2022, our various IoT solutions, such as industry WiFi router, IP Camera, has gained increasing recognition in various markets, actively extending our footprint into more industries, including power, emergency services, autopilot, etc. This is -- reflects by a 52.6% increase in the 2.0 revenue during the second quarter of year 2022 compared to the same period in the prior years.\n\nOur customers were able to realize reduced operating costs and increase their connectivity experience through this cutting-edge IoT solution, and we continue to focus on exploring new business prospects to serve a broader spectrum of partners with IoT needs. We expect our 2.0 business to grow with the support of our innovative CloudSIM and HyperConn technologies as we continue to introduce our solutions, services and products to the market and strengthen our collaborations with local partners. Let's move to the Page 15. Based on our innovative CloudSIM and HyperConn technology solutions, we continue to develop and broaden our portfolio of offerings with new products and services, such as our self-developed terminals and third-party devices.\n\nIn the second quarter of year 2022, we continue to promote our existing portfolio of innovative 5G products in countries and regions such as the U.S., Japan and Europe. We are now one of the few companies led to provide 5G products with a global radio band. In terms of the IoT side, the IP Camera, which has -- which was applied with our GMI solution that we launched commercially in the first quarter of year 2022 has now been promoted in the international market and received global recognition with the innovative technologies that ensure a reliable, high-quality and innovative mobile data connection for the devices. Going forward, we plan to launch and provide more of these type of innovative products and services.\n\nuCloudlink is positioned as the pioneer technology solution provider in the data connectivity markets. Based on the mature 1.0 business and newer 2.0 business, we promote a long-term development of our PaaS and SaaS ecosystem, which has been recognized by various business partners. We remain confident in our business development team to empower the building of our PaaS and SaaS ecosystem, and in our research and development teams to address, diversify and meet our customers want from us. In the coming quarters, we expect PaaS and SaaS platform revenues to grow into a more significant part of our business and continue to enlarge its marginal effects and improve margin profile.\n\nWe are more than pleased to announce that our total revenue reached $18 million during the second quarter of the year 2022, which has slightly absorbed our previous projection range due to a faster-than-expected recovery of international data connectivity services and development of local data connectivity services. We successfully achieved a positive operating cash flow for the first quarter since the second quarter of year 2020 during the COVID-19 pandemic. We are confident in our financial and operational position to see a better result in the future. We believe that from connected to better connection, uCloudlink is a significant driving force in the transformation of the increasing advanced information era.\n\nWe are committed to building a more connected future. And for more customers and users, we will strive to make a positive impact in the service and global user community. I will now turn it over to our CFO, Yimeng Shi, who will go through the business and financial highlights.\n\nYimeng Shi -- Chief Financial Officer\n\nThank you, Mr. Chen. Hello, everyone. I will quickly go over our business highlights for the quarter ended June 30, 2022.\n\nAverage daily active terminal for the second quarter were 292,432, including 1,223 owned by the company and 291,209 owned by our business partners, representing an increase of 23.6% from 236,553 in the second quarter of 2021. Our uCloudlink 2.0 service accounted for around 68% of our total DAT during the second quarter of 2022. Average daily data use per terminal was 1.58 gigabit in June 2022. Let's all turn to Page 18, which shows global diversification of our business.\n\nWe had around 99% of total revenue from outside Mainland China. During second quarter of 2022, Japan contributed to around 38.1% of total revenue. For other countries revenue, the U.S. market had the largest contribution to our business with further development of our U.S.\n\nbusiness. And we will continue to expand other markets such as Europe and Southeast Asia, etc. During second quarter of 2021, we had 8.3% of the total revenue coming from Mainland China, 32.6% of total revenue came in from Japan, and 39.1% of total revenue came in from other countries and the regions. Please turn to Page 20.\n\nI will go through our financial highlights of the second quarter of 2022. Service-related revenue as a percentage of total revenue was 62.5% during the second quarter of 2022 compared with 48.5% during the second quarter of 2021. Revenue from international data connectivity service and local data connectivity service increased by 40.1% and 52.6% year over year, respectively. This increase in revenues from data connectivity service was mainly attributable to our gradual recovery of international travel and the continuous development of our local data connectivity service business.\n\nLet's just move to Page 21, which shows the revenue breakdown of our two business segments, namely revenue from service and sales products. Our total revenue decreased by 6.3% from $19.2 million in the second quarter of 2021 to $18 million in the second quarter of 2022 primarily due to a decrease in sales of data-related products and others. Revenue from service were $11.2 million, representing an increase of 20.7% from $9.3 million for the same period of 2021. The increase was primarily attributable to the increase in revenue from international data connectivity service and local data connectivity service.\n\nLet us turn to Page 22 for gross margins of our business. Our service gross margin increased to 56.2% in the second quarter of 2022 compared to 45.4% in the same period of 2021. And our overall gross margin was 44.1% in the second quarter of 2022, increased from 28.1% during the same period of 2021. The increase of our service gross margins during the second quarter of 2022 was primarily attributable to highest margin profile from international data connectivity service.\n\nLet us move to Page 23, which shows the breakdown of our operating expenses. Excluding share-based compensations and others, excluding share-based compensation, operating expenses as a percentage of total revenue was 41% in the second quarter of 2022 compared with 61% during the same period of 2021. We have further streamlined our business operations, including optimizing labor costs. And our total operating expenses, excluding share-based compensation, decreased to $7.3 million in the second quarter of 2022 compared to $11.8 million in the same period of 2021.\n\nLet's turn to Page 24. Operating cash flow turned positive during the second quarter of 2022 and was $2.5 million compared to negative $6.1 million during the same period of 2021. This is primarily a result of our ongoing efforts to improve margins profile and control operating expenses. Our cash and cash equivalents and short-term deposits were $12.2 million as at June 30, 2022.\n\nOur capex was $0.2 million compared to $0.3 million in the same period of 2021. Let us move to Page 25. The net loss during the second quarter of 2022 was $6.3 million compared to $8.2 million during the second quarter of 2021. Adjusted EBITDA was negative $1 million during the second quarter of 2022 compared to negative $5.5 million during the second quarter of 2021.\n\nAs mentioned above, the company is working toward improving its bottom-line results and financial position. With that, let me conclude today's presentation. Thank you, and we start our Q&A session.\n\nOperator\n\nYes, thank you. [Operator instructions] And today's first question comes from Vivian Zhang with Diamond Equity.\n\nVivian Zhang -- Diamond Equity Research -- Analyst\n\nGood evening. This is Vivian Zhang from Diamond Equity. Thanks for taking my question, and congrats on the progress you made this quarter. So my first question will be about the gross margin.\n\nWe saw the gross margin on both services, and sales of products increased significantly this quarter. So I would like to know what's the reason for the increase. Will you continue to maintain the gross margin at this level in future quarters? Thank you.\n\nYimeng Shi -- Chief Financial Officer\n\nYeah. Thanks, Vivian. Yeah, regarding the gross margin improvement in the second quarter, first of all, the gross margin on service, that's a massive improvement compared with the same period last year. And as we explained in the earnings release, our revenue generated from international data connectivity service increased a lot compared with last year.\n\nThe gross margins related to the international data connectivity service is much higher than like a local data connectivity service, and that's the major contributions to improvement on gross -- service gross margins. As we expect, the international travel is in the recovery. And the most countries, more and more country open their door to the traveler. So we expect in the future, we have generated more revenue from international data connectivity service.\n\nSo we expect our service gross margin will have -- will keep this similar level and will be improved in the future once we have more revenue came from international data connectivity service. And also the second contribution related to the product, yes, our product gross margin is improving as well. That's mainly due to the mix product selling related to high-end product selling like 5G-related products sold to the market. And yes, this year, we'll deliver massive products, 5G-related products to the market.\n\nAnd we expect that the trend will carry on in the following quarter and this year. Thanks.\n\nChaohui Chen -- Co-Founder, Director, and Chief Executive Officer\n\nAnd yes, so I have some more comments about -- sorry. I have more comment about this point because in the R&D side, we also put a lot of effort to improve our margins, improve our algorithm and the efficiency of our data usage and the combination. And this part also increased our margin capability. Another factor is we are now have some new design and some replacement of the -- to optimize the hardware to improve our -- more the profitability of our hardware and the data connection together.\n\nVivian Zhang -- Diamond Equity Research -- Analyst\n\nOK, I see. Thanks for that. So my second question is that can you elaborate on the partnership you published in the second quarter and how shareholders should view this development, I mean, the partnership with Tuya, SAN Group and Ctrip.\n\nChaohui Chen -- Co-Founder, Director, and Chief Executive Officer\n\nSo which two partner? Yeah. Tuya.\n\nVivian Zhang -- Diamond Equity Research -- Analyst\n\nYes. So partnerships with Tuya, SAN Group and Ctrip you published.\n\nChaohui Chen -- Co-Founder, Director, and Chief Executive Officer\n\nOK, yeah.\n\nVivian Zhang -- Diamond Equity Research -- Analyst\n\nYes.\n\nChaohui Chen -- Co-Founder, Director, and Chief Executive Officer\n\nYeah. Last year, we have signed a friend contract with Tuya of use our technology to improve the efficient and the connected quality in the IoT area. So it's just a friend contract and it's just a starting point. We believe, in the future, we have more partners because -- to recognize our technology because our HyperConn technology not only include the coverage of the IoT device, but also lower the cost of operation cost because market network can enhance the reliability of the IoT network connectivity.\n\nThat's very useful to the IoT area. So we hope in the future with more of this kind of partner can work with us. For example, as you understand in our presentation, so we already embed our service into the IP Camera, IP router so -- and also now apply into the autopilot. So we believe, the basic need for better connection and lower the operation cost is the basic need of IoT application.\n\nThat's for cooperation partners similar like Tuya and kind of partner. That's just the start point, and now we have more partners in this area. That's for the first one. For the second one, we're working with Ctrip because you can see now the global tourism travel is recovering.\n\nBefore the COVID-19, we already is a big partner working with Ctrip, so because we are the biggest channel and for -- of mobile WiFi hotspot rental in China wireless channel. So now we are prepared for recovery of COVID-19. So now we are not only prepared for recovery in China, but in U.S., in the Southeast Asia. We have more difficult operation to prepare for the people recovering from the global travel scenario.\n\nVivian Zhang -- Diamond Equity Research -- Analyst\n\nOK, OK, got it. That helps. Thank you. OK, that's all my questions.\n\nAgain, congrats on the quarter.\n\nOperator\n\nThank you. [Operator instructions] All right. At this time, we would like to return the conference to Jillian Zeng for any closing comments.\n\nJillian Zeng -- Investor Relations\n\nOK. There are no further questions. OK. Thank you once again for joining us.\n\nIf you have further questions, yes, please contact our investor relations or contact our investor relations firm, The Equity Group.\n\nOperator\n\n[Operator signoff]\n\nChaohui Chen -- Co-Founder, Director, and Chief Executive Officer\n\nThank you.\n\nYimeng Shi -- Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nJillian Zeng -- Investor Relations\n\nChaohui Chen -- Co-Founder, Director, and Chief Executive Officer\n\nYimeng Shi -- Chief Financial Officer\n\nVivian Zhang -- Diamond Equity Research -- Analyst\n\nMore UCL analysis\n\nAll earnings call transcripts"
}