{
  "companyName": "Shopify",
  "companyTicker": "SHOP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/shopify-shop-q3-2022-earnings-call-transcript/",
  "content": "Shopify (SHOP -1.11%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:30 a.m. ET\n\nAmy Feng\n\nGood morning, and thank you for joining Shopify's third quarter 2022 conference call. Tobi Lütke, Shopify's CEO; Harley Finkelstein, Shopify's President; Amy Shapero, our CFO; and Jeff Hoffmeister, our incoming CFO, are with us this morning. After their prepared remarks, we will open it up for your questions. We will make forward-looking statements on our call today that are based on assumptions and therefore, subject to risks and uncertainties that could cause actual results to differ materially from those projected.\n\nWe undertake no obligation to update these statements, except as required by law. You can read about these assumptions, risks and uncertainties in our press release this morning as well as in our filings with U.S. and Canadian regulators. We'll also speak to adjusted financial measures which are non-GAAP measures and not a substitute for GAAP financial measures.\n\nReconciliations between the two are in the tables at the end of our press release. And finally, we report in U.S. dollars. So all amounts discussed today are in U.S.\n\ndollars unless otherwise indicated. With that, I will turn the call over to Harley.\n\nHarley Finkelstein -- President\n\nThanks, Amy, and good morning, everyone. As you can see from our Q3 performance, merchants continue to succeed on Shopify, growing sales and using more of our mission-critical tools to run their businesses. Shopify's essential tools serve as a business' central operating system. These tools help our merchants stay ahead of the curve as commerce continues to rapidly evolve.\n\nThis is particularly important today as businesses grapple with the consequences of rising interest rates and inflation. This is a key reason why merchants choose Shopify: We make the important things easy and everything else possible. Later, Amy will discuss our Q3 financial performance and expectations for the rest of the year. I'm going to focus on the investments and the progress we've made in Q3 that further our competitive positioning and enable merchants to build buyer relationships to go global, to advance from first sale to full scale and simplify logistics, all of which plays a vital role in making commerce better for everyone.\n\nStarting with building buyer relationships. For our merchants, discovering and connecting with more buyers and deepening relationships with existing customers are critical to a merchant's ability to create long-term success. Whether that connection is online or offline, Shopify has a suite of innovative products, like our best-in-class retail point-of-sale offering, that is rapidly becoming the solution of choice not only for SMBs, but also for large retailers. During the quarter, the outsized pace of offline growth on Shopify continued as we brought on eight new merchants with over 20 locations each and one with over 175 locations.\n\nWith our commercial teams increasingly selling to larger retailers, Plus merchants accounted for approximately 35% of all point-of-sale pro sales closed in Q3, and that's up from 14% in the same period a year ago. Well-known brands, including department store, Schofields, and designer apparel, TOTEME, implemented our point-of-sale Pro solutions for their locations, driving Q3 offline GMV growth by 35% year over year or 41% in constant currency. Since the beginning of 2021, over half of the rapid adoption of point-of-sale Pro is being driven by new SMB retailers coming to Shopify to get their start as a new omnichannel business. Additionally, over a third are from established offline retailers who are entirely new to e-commerce or selling only on point of sale.\n\nThese stats demonstrate the power of our commerce platform and the breadth of capabilities we have built to make it easier for our merchants to reach customers on every surface. In late September, we launched our new first-in-class mobile hardware device, point-of-sale Go. POS Go was developed to empower merchants to meet consumers wherever they are, however they want to purchase, from curb to counter. With POS Go, merchants can close sales anywhere and take payments securely and smoothly.\n\nPOS Go is one more pathway to bring even more merchants into our flywheel. In just three weeks since launch, POS Go has seen enthusiastic adoption among new and existing merchants with strong performance right out of the gates. Building buyer relationships is paramount as our merchants gear up for Black Friday and Cyber Monday. Shopify is already.\n\nOur platform is equipped to handle the influx of orders and volume because we don't just do this a few times a year, we support merchants through these types of flash sales all the time. For example, last month, during New York Fashion Week, we supported a top designer during an online drop. During the flash sale, this Shopify merchant sold hundreds of thousands of units and achieved tens of millions of dollars in sales within only a few hours. Shopify made this possible.\n\nToday, brands have to be more sophisticated in how they reach and sell to consumers as shopping continues to evolve. It has become critical for merchants to be discoverable across multiple platforms and services, showing up directly where their consumers are shopping. While still very nascent, GMV through native checkout integrations on key partner services such as Facebook, Instagram and Google, more than tripled from Q3 last year. The more merchants continue to invest in multichannel sales, the more successful they become in building brand value among their consumers.\n\nAnother way that Shopify is enabling merchants to build buyer relationships is through Shopify audiences, our new tool that helps Plus merchants find high-intent customers. Since launching in May of this year, audiences is significantly improving conversion rates, return on ad spend and other important metrics for those Plus merchants who have opted in. Last quarter, I mentioned a couple of merchants who have really benefited from audiences. Today, I want to share a couple of additional examples.\n\nHiya a children's wellness brand worked with Snow Agency, who is a Plus-certified partner to onboard into audiences. As a result, Hiya has seen their return on ad spend increased over 170%. Their conversion rate has increased over 150%, all while driving down cost per acquisition by 35%. Fast-growing home furnishing brand, Nathan James, attributed over 500 new customers to their use of Shopify audiences.\n\nThey also saw a 200% increase in purchases, a 5.6 times return on ad spend on the targeted campaign, over $100,000 in new revenue, all while customer acquisition costs declined by over 50%. Examples like these fuel our excitement about how audiences can drive merchant growth, especially going into the upcoming holiday season. Additionally, we're excited to continue to deepen our partnership with Google with upcoming new features for Shopify merchants to improve their impact on Google. Another marketing tool that we launched in early access in mid-August is Shopify Collabs, which brings brands and creators together.\n\nIt has generated approximately 50 million organic impressions across social channels in less than two months. Collabs allows creators to monetize their talents by discovering and partnering with independent brands and sharing their favorite products with their followers. This gives merchants yet another new channel to grow their brand reach and find new customers. We're also investing in our merchants' ability to grow by helping them go global.\n\nShopify Markets, which launched in Q1 allows merchants to identify, set up, launch, optimize and manage their international markets from a single storefront. To date, more than 175,000 merchants across the world have used markets to help launch their international businesses. By reducing the barriers to international selling, U.S. merchants utilizing Markets now sell into an average of 14 additional countries.\n\nShopify Markets Pro, which debuted in mid-September in early access, is our cross-border solution built on top of Markets. By combining global use features with markets capabilities such as the Translate and Adapt app, Markets Pro makes it easier for merchants to accelerate their global expansion to over 150 countries overnight without increasing their operational costs, risks or complexity. So when merchants add languages to their store, they will now be able to leverage automatic translations and create localized buyer experiences with duty prepaid Express international shipping. And this is just the beginning.\n\nOur own studies have shown that a merchant's GMV increases when customers are shown localized content. And we are confident that adoption will continue to increase as merchants look for ways to grow their businesses beyond their domestic borders. Like everything we do, we are laser-focused on lowering the barrier to entry in entrepreneurship globally. In May, we introduced localized subscription plans in over 200 countries.\n\nInternational retailers outside of North America continued to grow our overall merchant mix, comprising 45% of all merchants in Q3 and demonstrating the continued success of our investments. As we continue to expand our geographic reach, we launched Shopify Payments in Finland, Switzerland and Portugal. We launched Shopify Capital in Australia and Shopify Shipping in Italy and France. Also during the quarter, we launched Shopify point-of-sale with integrated payments in Singapore and Finland, which brings the total number of countries where merchants can use our point-of-sale offering to 14.\n\nShopify is built to help merchants as they grow from first sale to full scale and everywhere in between. Solutions like Shopify Shipping and Shopify Capital help smaller businesses grow, while development features, like Shopify Functions, enables customized pricing and discounts to increase consumer engagement and loyalty. Shopify Capital has come a long way since its humble beginnings in 2016. Even back then, we had Shopify had our merchant's backs when no one else did, supported them by providing a few thousand dollars to a handful of retailers.\n\nFast forward until 2020, capital hit the $1 billion mark. And in 2021, it surpassed $2 billion in funding. At the end of August of this year, capital broke another record. We've provided cumulative funding of $4 billion since inception to our merchants.\n\nThe team continues to fund and advance money to more merchants as they ramp up for Black Friday, Cyber Monday. Capital has made a real difference in merchant success rate, particularly as more and more banks and lenders are shutting off the spigot to smaller businesses. We also continue to improve the back office experience. Earlier this year, we launched Shopify Tax, a new product that takes the stress out of sales tax for our merchants so they can focus on what matters most to them: Their products and their customers.\n\nOur strategy of making certain high-value features available only in our Plus package continues to pay off. In Q3, we saw our Plus base continue to expand, not only from upgrades, but also from entirely new merchants coming on to Shopify for the first time. New to Shopify Plus merchants came from a wide array of verticals, driving growth of Shopify Plus GMV in Q3, which continued to outpace overall GMV growth. Some examples of brands that have joined Shopify Plus during the quarter and into early October, include beauty care creator Glossier, electronics manufacturer Panasonic Technics, footwear and lifestyle accessories maker Cole Haan, jewelry designer Stella & Dots, fitness apparel provider Zumba Wear, children's toy maker Melissa & Doug, and pet food manufacturer Greenies.\n\nOur Plus team continues to gain traction outside of North America as well. International brands new to our platform included a leading athletic footwear company, Converse Japan, nutrition and vitamin supplement manufacturer GNC India, footwear line Superga Italy, and sports apparel designer New Era Hong Kong. The world's biggest superstars are also building their brands on Shopify Plus. In Q3, the Kardashian brand continued to build their Empire on Shopify with their latest brand, Courtney Kardashian's vitamin and supplement company, Lemme.\n\nAdditionally, Food Network star, Giada De Laurentiis introduced Giadzy a new line of sauces and condiments. Ciara launched On Emission, her new line of clinical skinware. And homegrown Toronto celebrity, Matty Matheson, launched a new workwear brand, Rosa Rugosa. Shopify continues to invest in global partnerships to support the adoption of Shopify by some of the world's largest brands.\n\nAnd during the quarter, we officially signed partnership agreements with Ernst & Young and KPMG, adding to our relationship with Deloitte. Our strategic alliance with Ernst & Young, or EY, serves and scale to the needs of the client's enterprise. EY will be training an initial cohort of 500 technical professionals across their EY Wavespace network at 50 locations globally on Shopify. And we'll further support those professionals by enabling up to 10,000 consultants through exposure to the Shopify platform.\n\nThis access will enable co-creation of unique, immersive experiences that will help reimagine the online customer experience and unlock new markets for certain regulated industries and products. In addition, Shopify is thrilled to announce that we signed a collaboration agreement with KPMG in Canada. As one of Canada's largest systems integrators, our collaboration will help bring Shopify solutions to KPMG's clients to enable seamless commerce on their transaction platform of choice. On the development front, we are currently beta testing Hydrogen as a front-end web development framework or headless infrastructure.\n\nHydrogen gives bigger retailers with in-house creators, the tooling needed to accelerate development and deploy their bespoke storefronts with just one click on a hosting solution, Oxygen. With unique features such as audiences, B2B, Hydrogen plus Oxygen, and the expansion of our partner program for ERP and systems integrators, we expect Shopify Plus' momentum with larger merchants to continue. Last, I'll provide more context on our fourth major investment area: Simplifying logistics. The Internet has leveled the playing field for so many parts of an independent retailers business, but not for logistics.\n\nWe have set out to change that paradigm with Shopify Fulfillment Network. Last quarter, we outlined the three complex stages of a merchant supply chain across freight, distribution and fulfillment as inventory moves from port-to-porch. Today, I'll share updates on our integration of Deliver, how we are accelerating our vision for SFN to become an end-to-end logistics platform for merchants, and most importantly, how we are shifting the logistics conversation with merchants to focus on driving value through fast and reliable fulfillment. First, since closing the Deliver acquisition on July 8, we have developed an ambitious plan to create a new fulfillment app for Shopify merchants and also combine the Deliver and Shopify Fulfillment Networks into a single network, spanning a merchant's full supply chain.\n\nWe have made significant progress in our first quarter together with lots more still to come. We've also started creating a unified network built on top of the Deliver software platform. The combined scale of SFN and Deliver allows us to consolidate volume, streamline operations and expand our carrier relationships. This unified network will enable Shopify to operate a small number of regional hubs that will serve several functions, including cross-docking, multichannel distribution, inventory balancing and some local fulfillment.\n\nThese hubs will absorb as much complexity as possible for the rest of the network. We will continue to partner with the highest-fit 3PLs around the U.S. to enable local fulfillment, leveraging our proprietary warehouse management software, FMS. The first combined SFN and Deliver facility is already operationally functional in Atlanta and have seen a tenfold quarter-over-quarter increase in the number of merchants holding inventory in our facility.\n\nWe anticipate that unifying the network will be complete in Q1. Second, as we mentioned last quarter, we are building an end-to-end logistics platform that will connect every single part of a merchant supply chain. It enables merchants to dynamically route inventory across all their channels from B2B to D2C. Ultimately, we will create a fulfillment network that can accept orders and make customer delivery promises from the moment of merchants' goods lead their supplier.\n\nSince last quarter, we have seen a threefold increase in the number of shipped containers with our freight partner, Flexport. Initial runs have shown that, as we expected, SFN merchants are experiencing up to 20% faster service from origin ports with significantly lower cost per pallet than average. This will allow SFN to guarantee that merchants' inventory is Black Friday, Cyber Monday ready, the moment it leaves a supplier's facility. Let me share with you some of the initial stats on the rest of the supply chain.\n\nWe have seen a 75% year-over-year increase in merchant inventory being received into Deliver cross docks, a nearly 80% growth quarter over quarter in the number of merchants using more than one of our logistics services across all three stages of the supply chain. And a 450% year-over-year increase in orders fulfilled by FMS across both Shopify and partner-run facilities. Finally and most importantly, we are shifting the conversation with merchants to focus on logistics being a tremendous value driver for their operations. When done right, fast and reliable fulfillment can significantly increase cart size, conversion rate, order value and turn buyers into repeat customers.\n\nIn Q3, we completed the rollout of Shop Promise to all SFN merchants. Shop Promise is a consumer-facing badge indicating fast and reliable delivery across Shopify's online store and other popular direct-to-consumer channels. Shop Promise has already significantly boosted sales as participating merchants increased buyer conversion by up to 9% during the initial rollout. In September alone, SFN saw over two-thirds of domestic packages delivered within two business days, an exponential increase from less than 2% predicted delivery before SFN's software update in early 2022.\n\nAll new SFN merchants are now automatically qualified to display the Shop Promise badge out of the box. We are confident that Shop Promise's impact on merchant value will continue to increase as it evolves and matures. And we believe that SFN has the opportunity to become the de facto fulfillment solution for independent merchants in the consumer packaged goods and apparel categories. The highlights I've shared so far are just skimming the surface on why we continue to increase merchant solutions revenue as a percentage of GMV or the merchant solutions attach rate, which reached an all-time high of 2.14% in Q3 compared to 1.98% in Q2 on a sequential basis, with 8 basis points in Q3 coming from Deliver.\n\nOur record-setting merchant solutions attach rate is a primary component of our total revenue attach rate of 2.96% in Q3, defined as total revenue as a percentage of GMV, compared to 2.76% last quarter. Turning now to recent leadership changes. Starting with the promotion of Kaz Nejatian in September to chief operating officer. I've worked with Kaz for over three years and know him to be the real deal.\n\nHe embodies the best of Shopify with his product-driven mindset and an uncanny ability to see the alignment between product, sales support and go-to-market strategies, all of which he oversees in his new role as COO. Reporting to Kaz includes the newly created role of chief revenue officer and chief growth officer. As our new chief revenue officer, Bobby Morrison comes to Shopify with more than 25 years of experience transforming multibillion-dollar enterprises. Formerly, he was the chief sales officer at Intuit.\n\nLuc Levesque joined Shopify in January 2020. He previously oversaw growth in Facebook and TripAdvisor. Luc is recently promoted to chief growth officer, where he leads our new merchant additions and new business development efforts. And finally, the announcement of our new chief financial officer, Jeff Hoffmeister.\n\nJeff has known Shopify for many years as he has led numerous transactions for us, including our IPO during his 20-plus years at Morgan Stanley. Let me turn the call over to Jeff to say a few words before I conclude my remarks.\n\nJeff Hoffmeister -- Incoming Chief Financial Officer\n\nThanks, Harley. I am extremely excited to join the company. Thank you to Amy for all the leadership, stewardship and hard work over the past five years. You built a finance team that has a breadth and depth of expertise that is multiples of what you inherited.\n\nI'm proud to be able to take the baton from you and work with the team that you've built. To the investors, I got to know many of you during my years at Morgan Stanley and look forward to working together with you in my new role. As many of you know, I had the opportunity to work with Tobi, Harley and team on the IPO seven years ago and on numerous projects since then, that vantage point has allowed me to understand the complexities of the business into this role with a head start, but also have an appreciation for all the incredible things that Shopify has accomplished since its IPO. The decision to join Shopify was an easy one, given my historical context and the tremendous potential ahead for the company.\n\nI look forward to working closely with Tobi, Harley, Kaz and the rest of the senior leadership team to support the company's mission and next phase of growth. Back to you, Harley.\n\nHarley Finkelstein -- President\n\nThanks, Jeff. This is my last earnings call with Amy. And before I turn it over to her, I want to say what an honor it has been to work with her over the past five years. Amy has been a true partner.\n\nUnder her watch, she has built an incredibly talented finance team and has supported the company's rapid growth and massive scaling. On behalf of the entire Shopify leadership team, I want to thank Amy for her service and her dedication to Shopify. To wrap it up, Shopify's commerce operating system serves as a central nervous system that powers millions of businesses all over the world. If you talk to our merchants, you will hear repeatedly that they love the simplicity of our technology and the experience it offers to their buyers.\n\nAs our merchants get ready for their busiest shopping season of the year, we are here to help them capture every opportunity. We remain steadfast in our mission to solve the most difficult problems facing our merchants as we continue to make commerce better for everyone. And with that, let me turn the call over to Amy.\n\nAmy Shapero -- Chief Financial Officer\n\nGood morning, everyone, and thank you, Harley, for your kind words and sendoff. As Harley indicated, I will first provide an overview of our Q3 results, highlighting how we are continuing to operate with discipline as we position ourselves to be a 100-year company, then provide a summary of our new compensation system and finish with our expectations for the rest of the year. Beginning with our Q3 results, a reminder that we closed the Deliver acquisition on July 8, and this is the first quarter of results with Deliver included. Our total revenue for the third quarter grew to nearly $1.4 billion, 22% higher than the same period last year, driven primarily by merchant solutions revenue growth.\n\nOn a three-year basis, our revenue compound annual growth rate was 52%. Given the significant strengthening of the U.S. dollar relative to foreign currencies in Q3, total reported revenue growth year over year for Q3 was negatively impacted by approximately two percentage points. Next, to GMV.\n\nLast year's third quarter GMV growth was 35% year over year, driven by online consumer spending on goods during the pandemic. Fast forward to a year later, our total GMV in Q3 was $46.2 billion, which grew 11% year over year or 15% on a constant-currency basis, higher than retail growth overall in the U.S. of about 9%. The challenging macro conditions we saw in Q2 persisted in Q3, with high inflation leading consumers to continue favoring discount retailers and reduced discretionary spend.\n\nMerchant solutions revenue of $989.9 million increased 26% year over year, driven by GMV growth and by merchants utilizing our solutions to run greater parts of their business in this inflationary environment. Several factors drove this growth, including the increased GMV penetration of Shopify Payments, Shopify Capital and Shopify markets, greater revenue contribution from partners as well as contribution from Deliver. Excluding Deliver, merchant solutions revenue increased 21% year over year. Headwinds from significant strengthening in the U.S.\n\ndollar relative to foreign currencies was most felt here, impacting merchant solutions revenue growth year over year by approximately 3 percentage points. Approximately $25 billion of GMV was processed on Shopify Payments in Q3, 22% higher than in last year's third quarter or up 26% in constant currency. Payments penetration of GMV, or gross payments volume, was 54% versus 49% in Q3 of 2021 and up 113 basis points quarter over quarter. Over the past six quarters, we've seen GPV benefit from strong performance by merchants on Shopify Payments, an increasing percentage of which is Shopify Plus GMV, new merchant adoption, both in North America and internationally, penetration gains in ShopPay, which has facilitated nearly $66 billion in GMV since inception, and expanded availability of our POS Pro hardware in brick-and-mortar stores with integrated payments now being used in 14 countries.\n\nSubscription solutions revenue grew to $376.3 million, which was 12% higher than a year ago, driven by growth in monthly recurring revenue and reflecting lapping of our change in terms to make selling in our app and theme stores free for partners up to their first $1 million annually, terms that we put in place in the middle of the third quarter of 2021. Monthly recurring revenue was $107 million, up 8% year over year in Q3 versus a year ago, we saw a greater number of Shopify Plus merchants with plus increasing its share of total MRR to 33% from 28% in Q3 of last year. Additionally, thousands more retail locations began using POS Pro year over year, and Q3 was our first full quarter of traction for our starter plan, aimed at creators and other entrepreneurs who need a lighter offering to get started. Offsetting these MRR gains in Q3 were free and paid trial experiences for non-Plus plans that extend beyond our typical 14-day free trial.\n\nEntrepreneurs participating in the trials are immaterial to our MRR until they convert to one of our non-Plus subscriptions. While these factors slowed MRR growth in Q3 and will likely continue to defer near-term MRR gains, our actions have led to valuable insights as we continue to test ways to increase the top of the funnel and build a better merchant onboarding experience. Adjusted gross profit was $681.8 million, up nearly 11% compared with $616.4 million in the third quarter of 2021 and -- on a three-year basis, our adjusted gross profit compound annual growth rate was 46%. Compared to the third quarter of 2021, adjusted gross profit growth was impacted by a greater mix of our lower-margin merchant solutions revenue, lower margins in Shopify Payments due to merchant and card mix shifts and industrywide network cost increases, the impact of Deliver and increased investments in our cloud infrastructure.\n\nAdjusted operating loss was $45.1 million in the third quarter compared to adjusted operating income of $140.2 million a year ago. The loss was largely driven by increased headcount, including Deliver, and our new compensation framework versus a year ago, as well as some marketing program spend. Adjusted operating loss in Q3 of this year excludes onetime charges as follows: Approximately $30 million of severance expenses related to the workforce reduction we announced in July and accruals for two pending litigation cases related to patent infringement and publishing copyright infringement, which together total approximately $97 million. Consistent with our outlook last quarter, excluding severance and other onetime items, we did see a sequential deceleration of year-over-year operating expense growth from Q2 to Q3, reflecting the streamlining of our commercial organization and other actions we took in July and continue to take to align spend for long-term success.\n\nOur Q3 adjusted operating loss was relatively flat quarter over quarter, driven by greater cost efficiencies realized in the quarter and lower marketing program spend while the team focused on free and paid trial experiences that I noted earlier. Adjusted net loss for the third quarter was $30 million or a loss of $0.02 per diluted share compared with adjusted net income of $102.8 million or $0.08 per diluted share in the third quarter of 2021. Turning to our balance sheet. Our cash, cash equivalents and marketable securities balance on September 30 was $4.9 billion, which is $2 billion lower than June 30, reflecting $1.7 billion deployed for the Deliver acquisition.\n\nOur cash position continues to be strong, reflecting our approach to prudent and stringent capital allocation. We continue to place the highest importance on opportunities that we expect will significantly expand our merchants businesses accelerate our product road map and/or have strong paybacks from improved operational efficiency. Before turning to our outlook, I'd like to outline our new compensation system that we implemented on September 1, 2022, called Flex Comp. It's designed to recruit, reward and retain the best talent in the world and provide greater transparency and flexibility to our employees in how they are paid.\n\nAs part of opting into this new compensation system, employees received a single total compensation number and had the choice to allocate their pay between cash and newly granted equity in the form of restricted stock units and/or stock options. In addition, previously granted unvested equity was canceled, and the new quarterly equity grants will vest monthly. Employees will be able to change their allocation between cash and equity each quarter as their personal preferences change. We link Flex Comp tightly to our mission and long-term vision of building a 100-year company.\n\nSo for those employees who elected extra equity above the default settings, they were given an additional 5% bonus on that equity amount. In the future, we'll add other mission-driven elements, like charitable donations and Shop cash. All financial implications of Flex Comp are reflected in our Q3 results and full year expectations. Turning to our outlook.\n\nAs we have stated since the onset of this year, we are in a transitional period in which we are investing in our core themes that Harley mentioned earlier to ensure our long-term success. We expect these investments will allow us to emerge from this macro cycle stronger and will position us well for long-term growth and sustainable profitability. As a reminder, our financial outlook includes the expected impact of Deliver, our new compensation system and currency headwinds from the stronger U.S. dollar, and assumes that higher inflation and rising interest rates will continue to negatively affect the consumers' purchasing power of discretionary goods and services.\n\nIn light of these assumptions, our expectations for our own results as we close out 2022 are as follows. Our GMV growth will continue to outpace the broader retail market in the fourth quarter, aided by our omnichannel capabilities. Merchant solutions revenue growth year over year will be more than double that of subscription solutions revenue growth for the full year 2022. Both GMV and total revenue in 2022 to be more evenly distributed across the four quarters, similar to 2021.\n\nBecause of this larger mix of merchant solutions contributing to overall revenue and dilutive impact of Deliver, gross profit dollar growth will meaningfully trail revenue growth. And we continue to anticipate that operating expense growth year over year in Q4 will sequentially decelerate from Q3. From an adjusted operating loss perspective, we continue to expect a loss for the full year. For Q4, based on our updated outlook, we now expect an adjusted operating loss dollar amount that will be fairly comparable to the adjusted operating loss in Q3.\n\nFinally, the full year estimates of stock-based compensation and related payroll taxes, capex and amortization of acquired intangibles are now $575 million, $125 million and $55 million, respectively. In closing, the flexibility and scalability of our technology has proven time and time again to be a must-have for our merchants, enabling them to quickly pivot as commerce continues to evolve. The discipline and rigor that we continue to apply across the organization, beginning with software development to ultimately the commercialization of our solutions, will position us well for long-term growth and improving profitability when exiting this macro cycle. And finally, I'd like to thank Tobi, Harley and the rest of the management team, the finance team, all ShopiFolk around the world and the board for their support and partnership.\n\nBeing the CFO of Shopify will always be one of the crowning highlights of my career, and I'm so proud of my team and what we have accomplished over the years. I look forward to cheering on the company in its next chapter of growth and success as it empowers merchants across the globe. I'll now turn the call back to the other Amy to open the call for your questions.\n\nAmy Feng\n\nThank you, Amy. We will now open the call for your questions. Please use the raise hand feature in Zoom to ask your question. If you are dialing in by phone, you will need to press star nine to join the queue and star six to unmute yourself.\n\nAlso, please note that Jeff Hoffmeister will not be taking any questions on this call. Thank you in advance for limiting yourself to one question. Our first question today will come from Brian Peterson from Raymond James. Go ahead, Brian.\n\nBrian Peterson -- Raymond James -- Analyst\n\nHi, guys. Thanks for taking the question. So first one, we did see a noticeable improvement in take rates, even if you exclude Deliver. Curious if you could give a little bit more color on what drove that sequentially, that would be helpful.\n\nThanks, guys.\n\nAmy Shapero -- Chief Financial Officer\n\nYeah, I'll take that one. Yes, we did see a sizable increase year over year in merchant services solutions take rate. It was largely driven by mainstays of payments and capital new products, including installments and markets, and yes, the addition of Deliver. Also additional revenue from partners contributed.\n\nIt's important to also note that on an organic basis, excluding deliver, it still would have risen significantly quarter over quarter.\n\nAmy Feng\n\nOur next question will come from Mark Mahaney from Evercore ISI. Mark, go ahead.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thanks, Amy. Let me -- two questions. There's just a small change in your commentary, your outlook commentary about merchants growth in the second half versus the first half.\n\nJust why the change in the commentary there -- and then let's talk about just the Shopify fulfillment network in the investment horizon for that. Is there any change there? And do you feel like post the Deliver acquisition, do you feel like you have all the assets in place? Are there additional acquisitions or maybe areas you feel like you need to build out? Do you have the solutions that you need now or is it still kind of work in progress, like most things? Thank you.\n\nAmy Shapero -- Chief Financial Officer\n\nYes, I'll take the first question. So I think the important thing to note here is that our primary objective always is to get more entrepreneurs and merchants to success. And so let me just dissect our Q3 MRR, again, to kind of [Audio gap]\n\nAmy Feng\n\nWe're going to go ahead. Go ahead, sorry.\n\nAmy Shapero -- Chief Financial Officer\n\nSorry, we did see total MRR growth year over year, led by gains in Plus and POS. More Plus merchants, year over year, quarter over quarter, Plus increasing its share of MRR, as I noted earlier, to 33%. Also, thousands more retail locations adopted POS Pro. Those [Audio gap]\n\nHarley Finkelstein -- President\n\nI think we're losing Amy. It's Harley here, Mark. I'll jump in on the second part of the question, and then Amy, she can jump back on when her connection is better. In terms of SFN, we're really happy with where we're at right now.\n\nWe don't think we need to increase in terms of the overall investment. We're trying to build this -- rather than it be this cost driver, we think fulfillment can actually create huge value for our merchants. And so we think the fast, reliable fulfillment will increase their customer conversion, as I mentioned on the call. We're already increasing the number of SFN orders with predicted delivery of two days or less, from -- to over 65%.\n\nAnd so we're on track to hit over 75% by the end of the year. We're really happy with where SFN is going, and we think this will be a reason that people will not only come to Shopify, but also will give merchants on Shopify this incredible competitive advantage. And Shopcom is, in particular, is really the thing that we're really excited about. By putting all these things together this end-to-end logistics network, we now can provide this incredible tool to merchants to tell their consumers when to anticipate their packages, and we think that's going to do incredible things for conversion rate.\n\nBut in terms of the investment, there is no change to it. We think we can do this on its asset-light, software-first model, and Deliver obviously helps us accelerate the product road map there.\n\nAmy Feng\n\nWe will take our next question from Tom Forte from D.A. Davidson. Tom, go ahead.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. So first, Jeff, welcome to Shopify. Amy, it was a pleasure working with you, and I wish you all the best in the future. On its earnings call yesterday, when comparing and contrasting the current economic environment against the last downturn, Google's CEO discussed the emergence of mobile in the last downturn and his expectations about the emergence of artificial intelligence in the current market downturn.\n\nTobi, can you talk about Shopify's efforts in AI and how they may advance over the next 10 years?\n\nTobi Lütke -- Chief Executive Officer\n\nYeah, gladly. I think AI is one of the most remarkable spots right now of inflection, like the recent months in transformers, and especially, large language models have really accelerated the space. I'm going to go fast like, I have seen my job as tracking the fastest and quickest changing fields in technology and have a very good view of where things will go because, I mean, I built -- when we make product decisions, we are building for -- like we make decisions that will take about often a year, two years to implement. And so we have to have a good read of the future and what will be needed by then to make these decisions well.\n\nAI is at this spot where there's a lot of hype, and there's a nontrivial can that the hype is underestimating how much it will affect especially the latter part of this decade. So I know it's very vague, but it's because that -- it is vague. It's kind of hard to know how these kind of millions of little things will intersect. I mean, obviously, Shopify has a lot of efforts in machine learning.\n\nOur fraud products are powered by -- it's something we employ a lot for underwriting purposes. In Shopify payments, it's a lot of active day-to-day engineering work that's going into it is related to machine learning. I think this is actually a really good example of why Shopify is important here because we are looking after the small medium business space, of course. We have managed the business on Shopify.\n\nIn times where there's a lot of technological advance and change. It's very hard for individual merchants to stay on top of technological developments. However, as Shopify, we can invest in this almost collectively and roll out improvements very, very quickly to everyone, often giving the SMB advances that aren't even available or the larger retails have not really developed for themselves yet already. I think a perfect example is our recent successes around Shopify audiences, and where, of course, machine learning is a very important component.\n\nI think the places to monitor are really on creative. Image generation, they'll have impacts on -- a democratizing effect on marketing asset generation, which is currently -- while not expensive, it is something that is done via emails and sourcing and building a relationship with a designer and so on, which is all very good and valuable and presumably should be done anyways. But like getting your first version of your ad copy and other assets done by just writing a prompt is going to, again, allow more people to do early experimentation. I think these effects are ones we believe will be really welcome because we find that every time something that was previously difficult and sometimes byzantine, every time we can use technology to make that available and easier, this actually increases the success rates of the cohorts of merchants that sign up after.\n\nAnd I mean, this is also kind of a -- this is, from a product perspective, the most gratifying loop and impact we can have inside of Shopify. So we will use everything we got to get to these advances quickly. And as soon as something becomes practical and we should make it available. And I think that's -- the reason why merchants tend to go to Shopify.\n\nAmy Feng\n\nOur next question will come from Deepak Mathivanan from Wolfe Research. Deepak, go your line is open.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGreat. Thanks for taking the question. Harley, maybe a question for you. Where do you think fulfillment adoption of SFN can reach under the current model long term, either as a percent of merchants or maybe as a percent of GMV? Any color on kind of how you're approaching it in the early days with Deliver would be super helpful.\n\nAnd then maybe a quick follow-up for Amy. On the SMB side, MRR was down 3% quarter-on-quarter, like my math is correct. Can you unpack the impact of sort of the local market pricing being lower than your prior levels versus merchant growth? Thank you so much.\n\nHarley Finkelstein -- President\n\nOn the SFN side of things, we're quite clear of the type of merchants we can handle. We know, for example, we're not going to do perishables, at least no time soon. We're getting a lot more thoughtful about the exact target product-market fit that we can have and who are the target merchants. And there's a lot of merchants.\n\nI mean, I mentioned CPGs, I mentioned apparel in my prepared remarks. Those are sort of the ideal customers, people that are selling things that are smaller than a microwave that really works well for us. Part of what we want to do is -- like I think the thing that often gets misformed SFN is that we're trying to make it so merchants don't have to think about logistics. So that they know that when they come to Shopify, it is one less headache for them.\n\nBut at the same time, they can offer something that most consumers are beginning to expect, which is an anticipated delivery time. Whether that's two days or that's three days, we want to be able to provide merchants on Shopify, we're starting with the U.S., the ability to offer that. We think that will do wonders for things like buyer conversion. I mentioned in my remarks that Shop Promise is already significantly boosted buyer conversion simply like just with participating merchants that are just trying it now by 9% in the initial rollout.\n\nThat is real business. That is real sales for them. And so we think it's a very large swath of our merchant base that we can help, but we're also not trying to be everything to everyone. We want to be specific.\n\nWe want to be targeted about who this is for. And the people it is for will be delighted by this.\n\nAmy Feng\n\nWe'll take our next question from Matthew Pfau from William Blair. Go ahead, Matthew.\n\nMatt Pfau -- William Blair and Company -- Analyst\n\nHey. Great. Thanks for taking my question, guys. Wanted to ask about your strategy to target larger merchants.\n\nSo you've been making some big changes in the strategy with Hydrogen, Oxygen, functions and partnerships. Maybe you can just discuss these changes. Because years ago, it seemed like you thought you could target that segment of larger merchants with a more packaged solution, but that seems to be changing. So just curious as to what's driving that.\n\nThanks.\n\nHarley Finkelstein -- President\n\nYeah, I'll take that question here. Look, I mean, I mentioned these names on every call because more and more of these large, established brands are migrating to Shopify, either from existing -- larger -- like existing enterprise solutions their own stack they're running in-house. Shopify Plus is becoming a very, very compelling solution for them. So I mentioned Glossier, for example, or Panasonic and then obviously, the international push as well with Converse and companies like New Era.\n\nWe actually think that originally, Plus was a great migration path for our most successful merchants. More and more, it's becoming the best place to sell when you're selling at scale. And so yes, total cost of ownership and simplicity is important. But now when you add things like Hydrogen and you add things like some of the more enterprise features like audiences, for example, you're able to effectively build anything you want on Shopify.\n\nAnd I think that you're going to see more of these existing large-GMV merchants continue to come on to Shopify Plus and our enterprise offering in the coming months. And part of the strategy also is there are ways where these enterprises like to purchase. So for example, I mentioned a bunch of SIs on the call, whether it's Deloitte or it's KPMG, Ernst & Young, there's a lot of large brands that prefer to work through an SI when they are digitalizing or they're modernizing the retail operations. And by partnering closely with these SIs and becoming their preferred enterprise e-commerce solution, we think we can see more merchants come on faster.\n\nSo again, EY alone is now training 500 technical professionals around their entire network to -- how to sell Shopify and what Shopify can do. So I think when you combine flexibility, simplicity, it's still incredibly well priced relative -- to the value-to-cost equation is still very much on the side of value in terms of Shopify Plus, that's the reason why you're seeing Plus growth outpacing GMV growth over the last couple of quarters. And so you'll see a lot more merchants continue to upgrade the plus, you'll all see a lot of brands that are not currently on Shopify migrating to us to use this enterprise functionality. It will be a part of our future, and we're excited by it.\n\nAmy Feng\n\nOur next question will come from Terry Tillman at Truist Securities. Go ahead, Terry.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah. Thank you. Thank you for taking my question. I wanted to build on that last question, Harley, and I love theory.\n\nI love to see these new logos each quarter that are really household names. I guess just a quick two-part question, and it is a single question is first, when you have these Cole Haans and some of these other brands, is it across all of their storefronts? Or is it maybe some of their smaller GMV-producing storefront, so they want to kind of test you out on the enterprise side? I'm just trying to understand, are you kind of getting kind of wall-to-wall across all their storefronts? And then secondly, with some of these really big brands, what are the attach rates on some of the other products around merchant solutions? Thank you.\n\nHarley Finkelstein -- President\n\nIt's a great question. So when you look at companies like Glossier, for example, or Cole Haan, we now host their entire business. In other cases, part of our strategy is, come in, let us prove to you that we are the best enterprise e-commerce platform for your business. So in the case of Converse in Japan, we'd like to get the rest of Converse's business, of course, they are owned by Nike, but we're going to start by showing them proving to them that we are exceptional in what we do on the enterprise side.\n\nSo in some cases, whether it's SPANX, or it's -- with Mattel, for example, we host the entire American Girl store, which is one of the largest businesses. By proving to them that we are incredible at this enterprise e-commerce thing, they will bring more stores on. And then, of course, again, with Glossier and some of the others, we have the entire business. So part of it is we want to land and expand with some merchants.\n\nIn other cases, they want to bring the entire base -- their entire business on to us. On the merchant solutions point, I just want to hit this -- I want to mention this one more time. The reason that we talked about merchant solutions attach rate on this call is because it is a proxy for the value that we are adding to these merchants' lives. We are not just their e-commerce partner, where they're capital partner, where they're shipping partner or their payments partner.\n\nThe merchant solutions attach rate is a proxy for the value that we create for them. And the reason that it's exciting to us we're at an all-time high in the history of the company is because we're doing so by virtue of creating more features that they want. And if it's not just a small businesses, we're also seeing penetration of things like payments and capital increase with Shopify Plus merchants, the larger brands in the platform. And then obviously, with audiences, which is now a Shopify Plus-only feature, of course, that will continue to increase the take rate.\n\nBut all these things further tie Shopify and our merchants together in this wonderful partnership. And I think you'll see, again, more brands come on to the platform and more brands take more of our products and features.\n\nAmy Feng\n\nWe'll take our next question from Andrew Boone from JMP Securities. Andrew, go ahead.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nGood morning and thanks so much for taking my question. It sounds like audiences is really helping merchants to improve return on ad spend. Can you just talk about what you're doing to facilitate the expansion of audiences within your merchants? And just bigger picture, what's the role of Shopify within advertising over the next three to five years? Thanks so much.\n\nTobi Lütke -- Chief Executive Officer\n\nYeah, I'll take this. I mean, I -- we don't do product announcements on these calls. So like I mean, the role is that the take out so far is we're helping bring CPAs down. We are running this on -- for our Plus customers.\n\nIt is an opt-in. It takes advantage of the platform we built. Audience is -- the way people adopt audiences is by installing an app that is the first-party app that we created. So it's -- it really, I think, ties together the way we are thinking about the platform.\n\nBecause currently, in this phase of the Internet, given the certain realities that exists right now, we can play this role. And we are intending to play it very well, like I said, we are making investments in it and our machine learning focus is with audiences right now. Advertising is rapidly evolving, and it's hard to predict exactly where things are going, like the types of ad units that are available to small and medium businesses and enterprise businesses rapidly evolving. Sometimes certain things work really well, and the next day, they don't.\n\nAnd sometimes, certain things are being done for a couple of years. And through a change somewhere else entirely and deep browser architecture, suddenly, as things -- like certain completely unrelated things end up becoming high-converting. Again, these are great functioning growth teams can take advantage of all these kind of things. But many of our customers cannot and because they have to be focused on providing great product and great experiences.\n\nSo we like to take -- wherever we become active, it's an area where we can make significant conceptual simplification improvements to our customers' businesses. I don't know if this is helpful, but I think it's a good idea to explain how we are getting into these businesses because it's -- it's a different decision matrix than what's generally assumed, OK? It is a focus area, though, and it's where we can probably have more than most other areas, given certain current realities. A lot of our customers have products at the intersections of several interests. So targeting, as in like finding, is the people who need those products is -- has always been very, very difficult, has recently become more difficult.\n\nWe hope that we can at least backfill some of what was lost from the perspective of the merchants. And most of the products, we have -- I mean both of the products where buyers really, really want the kind of personalization as well because, again, without advertising channels, there's no way to find out about some of these delightful products. So it will remain a focus area, and we will have more products and expansions of these programs to announce in the coming year.\n\nAmy Feng\n\nWe'll take two more questions. Our next question comes from Jeff Cantwell at Wells Fargo. Jeff, go ahead.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nHey. Can you hear me?\n\nAmy Feng\n\nYes, we can.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nOK. Great. Sorry about that, and thanks for letting me ask a question. My first was on your -- just a follow-up on that.\n\nJust on your recent product launches, I still want to follow up on B2B. I'm just curious to have any updates or signs of progress there that you can talk about. We understand it's still early days, but I just want to get a feel for what excites you there and what you're seeing from that launch. And then second, on profitability, it does look better than expected.\n\nSo can you talk about sustainability there? Because on the outside, where all trying to get comfortable with macro, and investors are clearly honed in on profitability and they've been a slowdown. So do you see yourselves becoming progressively more focused on profitability? And I guess the point of the question is to try to get a feel for how we should be thinking about your ability to improve profitability going forward. Thank you.\n\nHarley Finkelstein -- President\n\nI'll take the first question on B2B and wholesale generally. I mentioned on previous calls that our ambition is really to be the central nervous system of our merchants' businesses. We want to be their retail operating system, and retail is not just direct-to-consumer for all merchants, there are merchants that have wholesale and B2B businesses as well. And so the ability to actually tie that all in together and make the Shopify admin truly their central nervous system is really important to us.\n\nAnd I think what we're doing around B2B is making it more centralized so that they have a single view of their entire business. So one is we have all these merchants on the platform that also do B2B, now we can add more value for them, and we can actually become more important in their lives. But the second thing is it also now gives us an opportunity to go to market with a strict B2B offering for B2B merchants exclusively. Previously, if you're just selling wholesale, you may not consider Shopify, we think the B2B offering we're offering -- we're talking about here, it is going to be world-class.\n\nAnd what that means is that we can actually go after a new segment of the market. I maybe -- I don't know, Amy, if you want to jump in on the profitability. And the only thing I just will say is that I think Shopify has been historically an operationally disciplined company. Nearly all our growth pre-Deliver has been organic.\n\nAnd we funded -- like all our gross profits have been redeployed back into our business. We have raised cash externally very strategically, and that's only been used accelerate our road map, and we're decelerating year-on-year operating expense growth. And so we're a company that likes profitability. If you look over the seven years since IPO, five of those years, we've been profitable.\n\nWe plan on becoming profitable again. We said this year as an investment year, but this is a company that thinks deeply about managing expenses, growing revenue. But ultimately, this is a company that likes to be profitable, and we will get back there. Amy, I think you're muted.\n\nI can see you speaking.\n\nAmy Shapero -- Chief Financial Officer\n\nSorry, can you hear me? I have strange Internet problems. Yes, we show discipline in our Q3 opex in the face of adding major acquisition with Deliver. And our new flexible compensation system, we managed to only have a slight increase in opex expenses quarter over quarter. And you saw a sequential improvement in our subscription margin quarter over quarter.\n\nThat's the operating discipline that we've always exhibited and will continue to exhibit into the future. As Harley said, we had increasing profitability from 2017 to 2021, we intend to get back there.\n\nAmy Feng\n\nOur last question today will come from Gabriela Borges at Goldman Sachs. Go ahead, Gabriela.\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nHi. Good morning. Harley, I'd love to get an update on how negotiations integration with Amazon with going success outcome. And then help us get inside the head of a Shopify merchant a little bit.\n\nHow do you think merchants will evaluate the pros and cons of Buy with Prime versus [Audio gap]\n\nHarley Finkelstein -- President\n\nHey, Gabriela. I'll take that one. Look, I think we said previously, any time a large company is making their infrastructure available to small businesses in a way that levels the playing field, we think is a great thing. And so Buy with Prime is no different than that, but obviously, it has been in the right way.\n\nAnd we have nothing to announce now, other than that we are, as we said last time we spoke, we were talking to Amazon about how we implement this in the right way. What's important for merchants is they want to be able to manage their entire business from one centralized place. They want all the information they need to make really, really good decisions. But at a high level, at a macro level, when great companies, or any company for that matter, makes infrastructure available to small businesses and does so in a way that levels the playing fields further for small businesses, that is a very, very good thing.\n\nYou broke up on the second part of your question, but I think you asked about getting into the minds of merchants right now, I think, for the holiday season. Look, I think our merchants are preparing. Shopify is our partner. We want to make sure they have a very successful season.\n\nThey're all ramping up right now. This multichannel strategy that we've been implementing for years is really starting to pay off because merchants want to sell wherever their consumers are, and they can do all that from Shopify. When you add our merchant solutions and you add the fact that we can simplify things that are usually not easy to simplify, Shopify becomes the most important piece of software that merchants use, and that's what we're thinking about going to the holiday season.\n\nTobi Lütke -- Chief Executive Officer\n\nHey. I think -- and that was I think our last question. And I just wanted to quickly jump in here because I just want to personally thank Amy Shapiro for her leadership and bringing Shopify here, being a teacher to me and to the company. And like these are journeys are best done together with friends.\n\nAnd thank you for everything you've done and being a friend and a teacher over all the years.\n\nAmy Shapero -- Chief Financial Officer\n\nThank you.\n\nAmy Feng\n\nAnd with that, thank you to all of you who have joined us this morning and for your questions. This concludes our earnings conference call for the third quarter of 2022. We look forward to providing our fourth quarter and fiscal year-end results next year. Thanks again, and goodbye.\n\nDuration: 0 minutes\n\nAmy Feng\n\nHarley Finkelstein -- President\n\nJeff Hoffmeister -- Incoming Chief Financial Officer\n\nAmy Shapero -- Chief Financial Officer\n\nBrian Peterson -- Raymond James -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nTom Forte -- D.A. Davidson -- Analyst\n\nTobi Lütke -- Chief Executive Officer\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nMatt Pfau -- William Blair and Company -- Analyst\n\nTerry Tillman -- Truist Securities -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nGabriela Borges -- Goldman Sachs -- Analyst\n\nMore SHOP analysis\n\nAll earnings call transcripts"
}