{
  "companyName": "Calavo Growers",
  "companyTicker": "CVGW",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/calavo-growers-cvgw-q3-2022-earnings-call-transcri/",
  "content": "Calavo Growers (CVGW -0.10%)\nQ3 2022 Earnings Call\nSep 01, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the third quarter 2022 Calavo Growers earnings conference call and webcast. [Operator instructions] I will now turn the conference over to your host, Julie Kegley, investor relations for Calavo. Julie, you may begin.\n\nJulie Kegley -- Investor Relations\n\nGood afternoon and thank you for joining us today to discuss Calavo Growers' financial results for the third quarter of 2022. This afternoon, we issued our earnings release, and it is available in the investor relations section of our website at ir.calavo.com. With me on today's call are Brian Kocher, president and chief executive officer, and Shawn Munsell, chief financial officer. We will begin with prepared remarks and then open up the call for your questions.\n\nBefore we begin, I would like to remind you that today's comments will include forward-looking statements under federal securities laws. Forward-looking statements are identified by words such as will, be, intends, believe, expect, anticipate or other comparable words and phrases. Statements that are not historical facts such as statements about expected improvement in revenue and operating profit are also forward-looking statements. Our actual results may vary materially from those contemplated by such forward-looking statements.\n\nA discussion of the factors that could cause a material difference in our results compared to these forward-looking statements is contained in our SEC filings, including our reports on Form 10-K and 10-Q. As you saw in our earnings press release, we have begun our new segment reporting structure. What was the fresh segment is now known as the grown segment. The foods and RFG segments have been combined into the new prepared segment.\n\nIn our discussion today, we may refer to the prior segment names as we make the transition. With that, I will now turn the call over to Brian Kocher.\n\nBrian Kocher -- President and Chief Executive Officer\n\nThank you, Julie, and good afternoon, everyone. We appreciate you joining us today. As we look back at Q3, we continue to make meaningful operational and structural progress. Compared to Q3 last year, gross profit more than doubled to $18.5 million.\n\nNet income improved to $0.07 per share compared to a loss of $0.74 a share last year, and adjusted EBITDA improved by more than $7 million. Our liquidity and capital ratios all improved, and we fill very key leadership roles with talent that allows us to fight above our weight class. On a sequential basis from the second quarter, gross profit declined while net income was up $0.08 per share versus a loss of $0.01 a share in Q2. Adjusted EBITDA was down by $4.6 million.\n\nUnfortunately, one tough month of commodity volatility and continued input cost pressure in our Guacamole product line masked tremendous improvement in the fresh cut portion of our prepared segment, formerly known as RFG. The former RFG business achieved almost 8% gross margins in Q3, and I'm excited about the structural changes in place to manage that business within everyday intensity. Temporary avocado price volatility affected both the grown and prepared segments. Let me explain those impacts a little further.\n\nFirst in the grown segment. The grown segment finished the quarter modestly down compared to Q3 last year. Just think about the work that we did during the quarter to deliver gross profit that finished basically flat with Q3 of 2021. Avocado volume was down almost 20% due to a combination of short supply from Mexico and our intentional approach to mitigate losses as we were selling through high-priced inventory.\n\nMexican import volume also was down 34% versus the second quarter and 35% year over year for the quarter. But we managed to mitigate those declines by increasing our sourcing from California, Peru, and Colombia. During July alone, market prices decreased over $20 a carton from the beginning of the month to the end of the month. Yet through aggressive inventory management and minute-by-minute attention to sales prices, our team managed to squeak out positive gross profit during July and achieve our overall targeted margin per case for the quarter.\n\nOverall for the quarter, gross profit per carton was still around $3.65. However, with the market conditions and constraints on available fruit during the quarter, we simply did not have enough sellable volume to increase our gross margin in grown sequentially from Q2. I'm proud of how we managed commodity volatility in the market and already look forward to more normal conditions in Q4. As evidence of our ability to react quickly to temporary changes in the market, by August, we already recovered from the July decrease in avocado market prices, and our margins have rebounded from the July lows.\n\nWe expect the grown segment to return to realizing margins per carton within a normalized range this quarter. But there is likely to be near-term volatility associated with volume. With the price of fruit as high as it was at the beginning of the third quarter, we did see the retail trade pull back on promotions and shrink display sizes. In August, supply and demand started rebalancing, and we are pushing volumes where appropriate, while tracking toward our overall targeted gross profit per carton.\n\nIn August, we opened our Jalisco facility for exports to the U.S. market. We have another option to help us manage market exposures. With our network of grower partners, we now have access to the largest GlobalG.A.P.-certified acreage in Jalisco.\n\nThis broadens our sourcing capability has provided additional volume with which to promote and drive sales and provides us with optionality and flexibility, which should benefit the business both in the short and the long term. As mentioned, the prepared segment also felt pressure from higher avocado costs. As we indicated during our call last quarter, our Guacamole business within the prepared segment, formerly known as the Food segment, was pressured by the cost of fruit. Input costs in Q3 were up 50% compared to last year.\n\nAnd while we implemented price increases, we could not keep up with the rising cost of inputs. Volume was down approximately 19% versus the prior year due to pricing margin pressures and lingering COVID demand softness in the international markets. However, input costs consistently declined over the course of the quarter following the peak in May. We are now selling product for positive gross margin and expect margins to strengthen as we work through our frozen inventory.\n\nWe also expect our alternative sourcing, process improvement initiatives and price increases to support gross margin in the fourth quarter. As the grown segment in the Guacamole product line pressured adjusted EBITDA in the quarter, I am most excited about the progress in our prepared segment. Despite facing challenges, the prepared segment performed very well in Q3, showing an $11 million gross profit improvement year over year in addition to sequential improvement over Q2. We achieved 5% gross margin in prepared, but that included a nearly 8% gross margin within the fresh-cut product line, formerly known as RFG.\n\nWe continue making steady progress toward our goal of 10% to 12% gross margin for the former RFG segment. Again, this improvement is structural and throughout the entire P&L. Pricing, cost mitigation, labor productivity, yield enhancements, and transportation savings, all improved gross margins. Our team in prepared is managing this business with an hour-by-hour urgency, and the improvement in this segment is both confident and momentum building.\n\nIn addition, pricing and efficiency improvements from Project Uno are being seen, capturing $15 million in the third quarter and approximately $30 million of benefits year-to-date. I'd like to wrap up my remarks today by saying how thrilled I am to have our leadership team finalized and in place. We recently filled three key roles on the management team, including Shawn Munsell, who began in June as chief financial officer, Danny Dumas, who started in July as senior vice president and general manager of grown, and Helen Kurtz, who joined in August as senior vice president and general manager of prepared. Each one of these individuals have been involved in broad international businesses.\n\nNothing at Calavo is too big for these seasoned leaders. And even in a short period of time, I've seen their growth and profit orientation positively impact our business and team. We have the right people in these important roles with the passion, energy and competitiveness of a full team driving Calavo, we are positioned to take our performance to the next level and demonstrate that progress through continued sequential profit improvement. With that, I'll turn the call over to Shawn Munsell to report on the financials.\n\nShawn Munsell -- Chief Financial Officer\n\nThank you, Brian. It's good to be here as part of the Calavo team. We provided year-over-year comparisons in our press release, so I will focus my discussion on a sequential basis from the second quarter. On a consolidated basis, third quarter revenue was $342 million, an increase of $10.6 million from the second quarter of 2022.\n\ngrown segment revenue was $207.6 million, down about $3 million from the second quarter as the average selling price of avocados increased by 14%, while avocado volumes were about 10% lower due to supply constraints in Mexico and intentional steps taken to maintain margins. Prepared segment revenue was $134.9 million, up $14 million from the second quarter, benefiting from price and mix initiatives. Consolidated gross profit was $18.5 million, down $3.2 million from the second quarter. The decrease primarily was due to a $6.4 million decline in gross profits in the grown segment from the volume constraints, inventory sell-through challenges and margin management decisions Brian outlined.\n\nThe decline in grown was partly offset by a $3.2 million sequential improvement in prepared. Within Prepared, the former RFG portion of the segment realized a significant increase in gross profit from ongoing operational initiatives, achieving a 7.7% gross margin from just over 2% in the prior quarter. The improvement was even more pronounced relative to the negative 5.4% gross margin in the prior year quarter, which included some unfavorable onetime adjustments, represented a recovery of almost $15 million year over year. However, as we shared, negative gross profits in our Guacamole line in the third quarter caused by input cost increases tempered overall prepared gross profit.\n\nFor additional perspective on segment performance, year-to-date gross profit through the third quarter totaled $53.5 million, up from $48.3 million for the prior year. The $5 million increase year-to-date is attributed to gross profit increases of approximately $1 million and $4 million in our grown and prepared segments, respectively. In the grown segment, year-to-date gross profit per carton for avocados increased by over 20% or almost $10 million. However, the benefit was mostly offset by a 15% decline in volume and an unfavorable foreign exchange impact.\n\nThe gross profit increase of $4 million in prepared consisted of a $14 million recovery in the former RFG portion of the segment, much of which occurred in the third quarter, partly offset by an almost $10 million decline attributed to our Guacamole line from input cost pressure. Year-to-date, fruit input costs are up over 70%, which has exceeded the pace of price increases. SG&A was $16.7 million for the quarter or 4.9% of sales, while the bottom line with $16.6 million from the second quarter of 2022, the third quarter also included an increase of $800,000 associated with our new performance-based bonus plan. Adjusted EBITDA was $8.1 million for the third quarter, down from $12.7 million in the second quarter of 2022, mainly driven by lower gross profit in the grown segment, partly offset by higher gross profit in prepared.\n\nRelative to prior year, third quarter adjusted EBITDA was up $7 million, primarily on higher gross profit in prepared. On a year-to-date basis, adjusted EBITDA totaled $25.5 million, about flat to prior year as higher segment gross profit of about $5 million was offset mostly by higher SG&A attributed primarily to increased compensation and bonus expense and other costs. Now, turning to our financial position. During the quarter, we generated strong cash from operations of over $20 million, including from improvements in cycle times for working capital.\n\nWe further strengthened our balance sheet by paying down debt by $16 million in the third quarter and $38 million since the end of the first quarter. As a result, net debt to adjusted EBITDA was about one times as of July 31. Continuing our disciplined use of cash, we invested $3.9 million in capex in the quarter, mostly focused on efficiency. We expect full year capex to approximate $12 million.\n\nThe company ended the quarter with $31.4 million of total debt, which included $25.6 million of borrowing under our line of credit plus other long-term obligations and finance leases. Unrestricted cash and equivalents totaled about $3 million as of July 31, and available liquidity was approximately $20 million, providing ample resources for investment. The volatility that affected the third quarter is subsiding in the fourth quarter, and we expect more normal conditions to persist over the balance of the quarter. In grown, gross profit per carton started to recover in August and margins are now tracking toward the historical range of $3 to $4 per carton, but volume will remain challenged in the near term.\n\nWe are focused on growing this business. The recently announced opening of our Jalisco facility for exports to the U.S. underscores our growth plans. In prepared, we started buying fruit in August for our Guacamole line at prices that will generate more normalized gross margins as it flows through inventory over the balance of the quarter.\n\nWe will continue implementing operating improvements within our prepared RFG business as planned, although we typically experience some seasonal softness in the business in the fourth quarter as food availability and demand moderate. We still expect the prepared RFG business to attain ongoing gross margins of 10% to 12% by the end of fiscal 2023. That concludes my prepared remarks, and I will turn it back over to Brian.\n\nBrian Kocher -- President and Chief Executive Officer\n\nThanks, Shawn. Since the day I sat in the CEO chair, I've made a big deal about and focus on continuous improvement. The third quarter brought some tough challenges. And before we go to questions, I just want to give you some perspective of how I feel about our performance.\n\nI'm thrilled with the progress we are making in the fresh cut product lines of our prepared segment, formerly RFG. We are delivering profit improvement throughout the P&L. We are making structural changes to the management and oversight of the business so that our profit improvement is sustainable. These aren't one-off events where we're just getting a little lucky.\n\nI'm proud of the way we manage significant commodity volatility in a historically high-priced avocado market. We tightened our inventory starting in June. We managed to get out of the inventory over the course of a three or four-week period and kept our avocado customer service and priced right in the market. At the total company, I'm excited that we somehow managed to deliver improved adjusted EBITDA and adjusted net income versus 3Q '21 when avocado volume was down 19%.\n\nIf you would have told me that market prices on avocados would decline $20 a case over the course of a month, volume would be off by 19% for the quarter, guacamole and processed products would have had negative gross margin, and we still improved adjusted EBITDA and net income versus the year ago period, then I would have been shocked. This is a great example of why a healthy and profitable prepared segment balances some of the commodity risks that we have in our grown segment. I'm encouraged that in the midst of driving all our change, we improved days sales on hand and receivables, days payable on hand, inventory levels and other balance sheet areas to pay down debt in the quarter. We paid down almost $40 million of debt in the last six months, which is fantastic.\n\nSo actually, I'm really proud of this quarter. I'm disappointed that we didn't deliver a sequential improvement, but proud of the progress we made and our efforts to control what we can control. I'm not satisfied or happy unless we're improving every single day. We have work to do.\n\nBut shareholders have both the management team and an entire organization that are trying to get better each and every day. My promise to you is I will be restlessly discontent until we are delivering sequential quarter-over-quarter improvements in adjusted EBITDA. We just want to get better each and every day. Sometimes the market allows us to do so, but when it doesn't, we still compete, we still fight, and we still work to optimize the market conditions in our favor.\n\nSimply, that's our job. So with that summary, we'll turn it over to questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question is from Ben Bienvenu with Stephens. Please proceed with your question.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nHey, guys. Jim Salera on for Ben. You mentioned the fall in avocado prices. I wanted to ask, how should we be thinking about the supply demand setup as we pivot into the fall? Is the recent falloff in avocado pricing just a function of supply picking back up? Or are you seeing any evidence of any disruption from the consumer side?\n\nBrian Kocher -- President and Chief Executive Officer\n\nWell, first of all, Jim, thanks for dialing in. This is Brian. I do think what we've seen is supply and demand rebalancing. The summer harvest, the summer bloom was significantly more than the prior year.\n\nThat put some pressure on prices, but it also allowed us to reduce our purchase costs. I think one of the great values that you have in our business model is that we're buying and selling on an everyday basis. So when we have inventory and we have a couple of weeks inventory, we're able to move quickly as the market forces change. So we actually got out of some very high-priced inventory, twice as much as it is today over the span of three to four weeks.\n\nAnd we did it in the month of July and somehow still managed to deliver gross profit in July. It wasn't a lot, but we managed to deliver gross profit. And if you think of us for the quarter, we're at the higher end of our range. I think we ended up somewhere around $3.65 a case in terms of gross profit per unit.\n\nWe just didn't have enough sellable units to generate sequential quarter-over-quarter profit improvements. Now, looking forward, I do think you see the summer bloom that was bigger, which has brought some relief on prices. The estimates that we see for Mexico in the coming fall and harvest season continue to increase. So we're using some of that to promote, to go out and drive volume where we can.\n\nI think that our addition of Jalisco in August has allowed us another source to, A, get fruit available for promotion. And B, arbitrage between growing areas if there is a cost advantage in one or the other. So I think the overall supply and demand economics are -- you never want to say normal in a commodity trading environment but are more typical at this time of the year, and therefore, you see acquisition costs in a more typical range, and you see sales price per case in a more typical range.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nGreat. And on the consumer side or demand inspection, I mean, I know prices have come down, but they're still up pretty materially year over year. Have you seen anything just with the consumer feeling inflation pressures everywhere, changing their buying behavior at all?\n\nBrian Kocher -- President and Chief Executive Officer\n\nI think it's really hard for us to see that, Jim, for two reasons. One, we're in a supply constrained environment. So I don't know that we see real demand. We see whatever we have available to sell sells out.\n\nSo it's hard, I think, for us to say really what the consumer is doing or not doing relative to retail price because there's not enough route to gauge elasticity. That's one. Now, on the flip side, and to be transparent, and I think I included this in my prepared remarks, we did see, at the beginning of the quarter, when the prices were at their highest, we saw some retailers who stopped promoting and we saw some that trunk display sizes. So we did see some retailers back off a little bit.\n\nI think that had some things to do with volume. But again, if we had more volume -- or sorry, if we have more demand, we couldn't have sold more because we didn't have more volume. So it's a little bit of a tricky analysis to walk through. But again, I like our model.\n\nIf you look at it now, we're buying the fruit we need now on a daily basis. I don't have to sell fruit coming off my own farm, whether I like it or not, into a bad market, as an example. So there's pluses and minuses, but I like the fact that we're a marketer of fruit. And because of that, we can move with the market quickly and we can keep our overall gross profit per box -- gross profit per carton, we can keep that in our historical range.\n\nAnd I think we've done a really good job about it. I mean think of it this way, Jim. We managed to deliver the same gross margin in this quarter with 19% less volume and negative currency impact. That's pretty impressive versus the same quarter of last year.\n\nSo I think there's some value in our model that you're seeing in the quarter.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nGreat. I appreciate the additional color. If I can sneak one more in. You guys have added a lot of talent to the team as of late.\n\nJust where are you in building out the team? Are you guys almost where you want to be or where you want to be? And then what new ability does it give you now that you're kind of playing with a full deck?\n\nBrian Kocher -- President and Chief Executive Officer\n\nWell, I'm really excited about our team. We are complete. We filled the CFO role with Shawn, who many of you have met over the course of the quarter and some will continue meeting. We filled our general manager and senior VP for our grown division with Danny Dumas.\n\nDanny is a longtime global commodity player. He's been in bananas. He's been in pines. He's been in avocados.\n\nHe knows the game and the system, and so I'm excited about that. And then, we filled the General Manager of our prepared segment with Helen Kurtz, who has not as much experience in produce directly, but Helen has tremendous experience in very tough, tight margin agricultural products within the chicken industry. She's got a lot of brand and CPG experience from her General Mills days, so I'm really excited about the talent that we have. We're onboarding that talent.\n\nSome of them have just a couple of days of experience now, but we've got a really good team. I think the other aspect of this is this was a very structured transition. So we have Rob Wedin, who formally managed our avocado business for years and years and years, who is on a transition plan, a structured transition plan with Danny. We have Ron Araiza, who's been involved in our prepared segment for years and years and years, who has a very structured transition plan with Helen.\n\nSo I like that this is -- we have the assistance of players who have helped deliver results. We have the assistance of them in transitioning our new leaders. So I'm excited about where we are at our team. I'm excited to have sort of a group that's profit-oriented, but also growth-oriented.\n\nWe've got our facility stable. We can produce very high-quality product with high fill rates. We've got the right cost profile. Now, we need people that can help us grow.\n\nAnd I think with Helen and Danny running the P&Ls and Shawn with helping us with providing access to investment where we need, I'm really excited about the leadership team we have in place.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nThat's great. I appreciate the extra time. All the best.\n\nOperator\n\n[Operator instructions] Our next question comes from Ben Klieve with Lake Street Capital Markets. Please proceed with your question.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\n All right. Thanks for taking my questions. First, I have a couple on the kind of processed avocado side. First, I have just kind of a high-level question about kind of the -- how you source your supply for that business and how that's changed throughout Project Uno.\n\nI'm really kind of curious how nimble that process is and the degree to what you build up inventory when prices fall to capitalize on in that kind of environment when prices are high. Can you talk about that part of the business and really how it's changed over the last year?\n\nBrian Kocher -- President and Chief Executive Officer\n\nSure. So first of all, Ben, thanks again for calling in. I appreciate it, and I hope you're doing well. This processed avocado business, we've tried to transition over the course of the last several months.\n\nPredominantly, if you go back a year ago, we were predominantly buying fruit from our own packing house, buying, transitioning fruit from our own packing house that were the remnants of the pack out that -- of our own harvest. And over the course of the last six months in particular, we really tried to diversify that portfolio. So in the old model, you could see basically whatever we are paying for the product we were selling in the market as whole fruit, we would be paying for our processed fruit as well, just as the remainder, a weighted average would be the same. So we've expanded that geographically.\n\nSo we've gone to now Jalisco, and we're sourcing fruit out of Jalisco. We've gone to that to some other states in Mexico. We've sought out volume from other countries, be it Peru or guacamole even when prices -- or sorry, Peru or Guatemala. Even when prices were really high, we were buying partially processed avocado to blend it in with our finished goods product.\n\nSo the whole sourcing environment has changed over the course of the last six months, I would say, Ben, and that's really helped. I think just transparently a couple of other things have helped. One, the overall supply/demand dynamics have changed. We're now buying raw product for our processed business that is roughly 35% of what it was eight weeks ago, nine weeks ago.\n\nAnd we've got some productivity initiatives. So we've got a host of initiatives that are all centered around how do I drive one more pound through the system per day with one less FTE and producing one less pound of shrink when I do it. So we've got a lot of that going. And of course, the price increases have helped now that the input costs have come down.\n\nBut frankly, we've raised prices four times. We just couldn't keep up and the market couldn't bear more price increases, and we tested that to make sure. Hopefully, that helps.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nYes. Brian, that was really helpful. And then, that stimulates a follow-up. I mean this kind of shift in strategy over the last six months to diversify your inputs.\n\nWhat are your expectations for what that can deliver in, I don't know if you can even say the word normalized anymore, but you know what I mean, in a more regular operating environment than you encountered in July. I mean do you think that you can get back to the kind of profitability levels that this company saw in this business in 2019 or somewhere between here and there kind of a realistic target?\n\nShawn Munsell -- Chief Financial Officer\n\nYes. Ben, this is Shawn. I'll take that question. So like Brian said, we're now buying fruit that's probably a third of what we were paying at its peak back in the summer.\n\nAnd it's going to take a few weeks for that to flow through inventory. But when it does, I would expect that in this month, in September, we're going to start to really see gross margins that are consistent with what we'd expect on a historical basis.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nOK. All right. And one more for me and I'll get back in queue.\n\nBrian Kocher -- President and Chief Executive Officer\n\nBen, sorry, just one more thing because you brought it up in your first question. So here's the other thing that we're doing just from a management perspective. Now, that the price of raw product is in a range where if we were -- if we had no inventory, if we had no accumulated inventory, we were selling it today, we'd be at our target margins, right? But the other thing that we're doing is trying to take advantage of capacity. So we're building frozen inventory back up at these raw product cost, not at the raw product cost from eight weeks ago.\n\nAnd I think that's another just important part of how you manage a business, how you manage a P&L, how you manage your kind of the risk as they come down. The pipe is we're building frozen inventory now at today's prices, so that we can smooth some of the challenges that we may face in the future as supply and demand dynamics change.\n\nShawn Munsell -- Chief Financial Officer\n\nYes. And just one more thing to add there, too, Ben, is Brian alluded to, we've got some efficiency projects that we're kicking off that we expect are -- should be installed and operational kind of in early 2023. And that's going to give us a couple of points to lift to -- once they're up and running. So efficiency yield improvements, so we should see some benefit from that in the not-too-distant future.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nGot it. Got it. All helpful color. One more quick one for me, and then it gets to kind of building on something you just said about all the various improvements in place, RFG.\n\nThe sequential gross margin improvement really was pretty dramatic from the second or the third quarter. I think you said from 2% to 8% in that legacy RFG business. Was there anything kind of onetime in nature from -- to lead to that increase? And -- or was that really kind of progression as you expected and now that's kind of the, call it, the new floor for that business maybe heading into the next quarter?\n\nShawn Munsell -- Chief Financial Officer\n\nYes. This is Shawn. There wasn't anything I would say kind of unusual or like nonrecurring in nature there, Ben. We're just making steady progress across the P&L.\n\nI will say the vast majority of the improvement from the second quarter was price related, but we also had some labor and productivity improvements and also starting to see more of the benefits from our transportation and warehousing initiatives as well.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nOK. Very good. I appreciate it.\n\nBrian Kocher -- President and Chief Executive Officer\n\nJust before we leave RFG, I'm really proud of RFG this quarter. Really proud. And then, transparently, I'd say we saw this coming kind of in the June-ish time frame. But this is the culmination -- and I don't want to say culmination, really, it's a cumulative effect, let's say, not culmination because we still have work to do to get to our target margins.\n\nBut this is across the P&L. Shawn mentioned it. I'm not sure that you've got many other -- of your accounts that you're following. I'm not sure that you've got many other of them that are -- have year-over-year savings in transportation.\n\nWe've got savings in transportation. We've got labor productivity. We've got yield enhancements. Sure, we've got raw product material costs.\n\nBut as Shawn mentioned, pricing has been able to offset that. This is just some good old-fashioned leadership grounding. We've got every plant manager who's grinding on this every day. We've got every salesperson who's out there grinding on pricing every day.\n\nWe're working with the customers, too, to make sure that we've got a great solution for them, so I'm really proud. I would say if you would have asked me on this call last quarter, I knew we would improve. I didn't know that we would get to almost 8%, but we see -- we saw it sort of in the middle of June, and then we just kept driving it, so this is really, really significant. Now, the other aspect, the two other things that I'll kind of remind you about.\n\nOne, we still have a ways to go to get to our 10% target margin for this legacy RFG business. And the fact of the matter is the last 25% of improvement is always tougher than the first 75%. But we're here and we're going to take it and grind it every single day. The second thing that I would say is just kind of remember, there is some seasonality to this business.\n\nYou go into the winter months and you go to winter sourcing for fruit. You have enterprising too, but things get a little tougher and dicier. So I don't know that I necessarily say, all right, 8% is the rock, the absolute floor. But we're going to try to continually march to that 10% to 12% coming out of 2023.\n\nIf you remember, that's what we talked about. By the time we come out of 2023, that legacy RFG business will be somewhere in the range of 10% to 12%.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nGot it. Got it. That's always very helpful, and plenty of -- a lot of improvement has been made already. Congratulations to you all on that progress.\n\nI think that does it for me. Thanks for taking my questions. I'll get back in queue.\n\nBrian Kocher -- President and Chief Executive Officer\n\nThanks a lot, Ben.\n\nOperator\n\nThank you. Our next question is from Ben Bienvenu with Stephens. Please proceed with your question.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nJim Salera back on for Ben. I wanted to ask a follow-up on Jalisco. How much -- if you can tell, how much fruit did you pull out of Jalisco in August as you guys got everything kind of up and running?\n\nBrian Kocher -- President and Chief Executive Officer\n\nIt was probably -- it started off slow, Jim. And then, I'd probably say, of our Mexican volume, it got up to about 10%, 12%. I think going forward, for the next month or so, you might see it as high as 25% of our Mexican volume.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nDo you have a target range or target contribution that it should make up kind of like at a go-forward run rate?\n\nBrian Kocher -- President and Chief Executive Officer\n\nNo, I wouldn't think of it that way, Jim, if you bear with me. What we want to think about is selling Mexican fruit into the U.S. market. And whether it comes from Michoacan or Jalisco, that's our opportunity to arbitrage on acquisition price, on efficiency of our packing houses, how does one dilute fixed costs more than the other.\n\nThe transportation to the border is about the same, so that's not an impact. So we're trying to be a little fluid in there. Remember, we make these buy decisions every day, and so we'll place an order. And in fact, I think we probably just placed an order an hour ago for tomorrow's volume.\n\nAnd every day, we're deciding how much from Michoacan, how much from Jalisco and trying to do that in what's the best interest of our business. Remember, in this commodity business, pennies matter, and so we'll fight it out for pennies every single day, and that's what we're doing. So it's hard for me to say that there is a target for Jalisco. What there is a target for is our return in the market.\n\nAnd we've said that consistently. It's in that $3 to $4 per case range in the market. And our opportunity to operate in that range to deliver that range is based upon a wide range of sources, including Peru, including California, including Colombia, including Jalisco, including Michoacan. And so, our job is to make sure we're balancing and arbitraging among all those sources to, A, get the fruit we require.\n\nAnd B, do it at a cost profile that allows us to deliver our targeted margins per case.\n\nOperator\n\nThank you. Our next question is from Mitch Pinheiro with Sturdivant & Co. Please proceed with your question.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nHey, good afternoon. A couple of questions. Just curious, staying on the avocado side. I may have misheard you, but you said you might be volume-challenged in the near term.\n\nI just see the volumes coming in from Mexico and very nicely here in August, is there -- has there been a slowdown, or why would you say that?\n\nShawn Munsell -- Chief Financial Officer\n\nYes. The near-term volume challenge, Mitch, what we're referring to there is just as we're working through kind of the inventory levels as prices are stabilizing and costs are stabilizing, just ensuring that we're managing our margin as we're transitioning to a more kind of normal environment.\n\nBrian Kocher -- President and Chief Executive Officer\n\nMitch, I think the other thing that we also have to transparently face, and we did this, I mentioned this a little bit earlier, we saw during the beginning of the quarter that retailers stopped promotions and shrunk display sizes. And now, we're getting them to ramp promotions back up in large display sizes, so there is a little bit of that that we have to restart the category on and retrain the consumer that that product is available now. So what we are alluding to is that I don't think we can go from 19% down on a volume basis year over year to breakeven or 10% higher year over year, right? There's a ramp-up period that we wanted to make sure that we articulated.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. And then, can you remind me, on the grown side, what percentage of your business is retail versus foodservice? And then if you could talk about any differences in demand or any changes among those channels.\n\nShawn Munsell -- Chief Financial Officer\n\nYes, it's about 60-40 favoring retail.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nAnd, I mean, so how has foodservice performed? I mean we say has there been a volume decline there because of lack of good fruit or because the prices and they're backing off on the menu there? Can you talk a little bit about that?\n\nShawn Munsell -- Chief Financial Officer\n\nYes. If you look at the volume decline that we experienced in the third quarter, Mitch, it was -- we probably saw a little bit more impact on the retail side than we did the foodservice side. And again, for the reasons primarily that Brian cited, kind of a lack of promotions. But to be honest with you, the difference between the two was fairly modest.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. And then, --\n\nBrian Kocher -- President and Chief Executive Officer\n\nMitch, I would say the other aspect of that is, again, we were in a volume-constrained environment. So foodservice can be a little more flexible in terms of size because it's an ingredient for their finished product. So sometimes, they'll chase a better price size of product. But generally, they're trying -- and we're in big Mexican-themed foodservice players as well.\n\nAnd again, they're not going to take guacamole or avocados off the menu, but we've got to work with them to try to get it at the price point.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nRight. And then, on the guacamole side, any differences between foodservice and retail?\n\nShawn Munsell -- Chief Financial Officer\n\nNo, nothing really to speak of there, Mitch.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. Finally, on RFG. It looks like -- I'm just doing the quick math, it looks like sales year over year was up about 14%. Is that about right?\n\nBrian Kocher -- President and Chief Executive Officer\n\nShawn, I didn't think it was 14%. Was it? Maybe.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nYou don't break it out. I was just trying to back into it, but I was doing it quickly, and that's hard for me to do.\n\nShawn Munsell -- Chief Financial Officer\n\nYes, you are -- yes. So sorry, you're trying to do it for RFG itself, the RFG portion of the business.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nYes. Just trying to get a sense -- I'm just basically trying to get a sense for it seems like was it mostly pricing versus volume. I was curious about how that was.\n\nShawn Munsell -- Chief Financial Officer\n\nYes. Your math is about right there. And year-over-year volume is down just a little in RFG. So yes, year over year, when you look at that top line number, that was mostly the impact of pricing.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nAnd what are your conversations like with your customers in the RFG segment now?\n\nBrian Kocher -- President and Chief Executive Officer\n\nWell, I think the good news for us is our customer -- now our discussion with customers is about growth. I mean, if you think about this time last year, RFG was having trouble fulfilling orders, having trouble finding the right profit profile, having trouble getting the right labor mix in the facility. We've stabilized all of our facilities. We're still -- our fill rate over the course of the last quarter was something like 99% or 99.1%.\n\nI mean it's something crazy good for a perishable product. So we're excited about the service. We've stabilized the operation. We mentioned some of the metrics that we talked about in terms of labor productivity, yield improvements, fill rate consistency.\n\nAnd so, now we get a chance to talk to them about how do we work together to grow the category again. So I'm excited about turning from stabilization phase to growth in leverage phase in RFG, formerly known as RFG, let's say.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nRight. So in that business, do you think -- so I understand sort of the seasonality of the business and what that could do to margins in the quarter and maybe the first quarter. But are we -- do you see sort of a stabilization in volume in that business going into the fourth quarter and first quarter of next year?\n\nShawn Munsell -- Chief Financial Officer\n\nYes. I think it's stabilized, probably a little bit of softening, just seasonal softening as we go into the fourth quarter. But yes, otherwise, roughly in line with what we're seeing this quarter. And just one other comment, too, Mitch, going back to your earlier point about the top line.\n\nKeep in mind, that's a combination of price, but there's also some mix benefits that are flowing through as well as we're working through our SKU optimization process. And of course, that's going to be an ongoing process for it. So you're seeing some of those benefits as well. And that bleeds into those conversations that we're having with our customers.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. And then, one more thing. To get to -- from the 8% range in gross margin to a double-digit range, I know it's going to take a lot of work, but I mean how much of that is going to be dependent on just fixed cost leverage, just simple more volume through your facilities? Is it most of it? Half of it? Any way to think about that?\n\nShawn Munsell -- Chief Financial Officer\n\nYes. I'd say that it'd be less than half of that, Mitch. I mean really kind of the path forward for us, if you think about what got us to the 8%, specifically 7.7% in the past quarter and what's going to take us to 10% to 12%, that's going to be a component of it. But frankly, just like the past year, it's going to be a lot -- it's completely across the P&L.\n\nSo we're going to continue to see pricing benefits, more mix benefits, labor optimization, productivity but absolutely pushing more volume to those plans.\n\nBrian Kocher -- President and Chief Executive Officer\n\nMitch, thanks a lot for dialing in. And let me just -- we'll just talk a little bit until -- unless there's another -- until there's another question. But Mitch, I think an important part of thinking about RFG and this volume piece, yes, volume will help and leveraging fixed costs will help. But we have structurally changed the way we've managed this business so significantly.\n\nAnd just to give you an example on labor. In every plant, at every hour of the day, our plant manager knows the labor that they've deployed so far. They know that. They know the productivity they're getting.\n\nAnd they can make on-the-fly line balancing decisions. That didn't exist a year ago. We have a seasonal calendar of sourcing raw products now where 93% of our raw products in the legacy RFG business are now sourced under contract methodology using an online sourcing tool. That didn't exist a year ago.\n\nWe've got a transportation network where 70-odd percent of our transportation spend is under RFP where we built carrier depth and consistency in our carriers. And that didn't exist a year ago. So the point that -- we have launched a training program, a systemwide training program for plant managers, assistant plant managers and line supervisors to tell them exactly how they react when the metrics go one way or another. That didn't exist and wasn't in place a year ago.\n\nSo when I talk about the sustainability of the improvements in RFG, that is not ever meant to say one quarter, we might go backwards a little bit and then go forward a little bit. But the fact of the matter is we put structure in place to manage this business every single hour, every single day. And frankly, that's the only way that I know how to do it is we've just got to grind, and our leaders know it. They're incented to do it.\n\nWe're all incented the same way so that we're all pulling in the same direction as a team. And I'm just -- I want to make sure we get across the sustainability of these improvements. We didn't just get lucky this quarter. Paul, do we have any more questions?\n\nOperator\n\nAt this time, there are no further questions. I'd like to turn the floor back over to Brian Kocher for any closing comments.\n\nBrian Kocher -- President and Chief Executive Officer\n\nOK. Thanks, Paul. Thank you all for dialing in. We appreciate your support.\n\nWe appreciate you giving us a chance to help us explain our business and where we're making the opportunities and where we're driving the results. So thank you very much. We look forward to talking to you next quarter. And again, I appreciate all your support.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJulie Kegley -- Investor Relations\n\nBrian Kocher -- President and Chief Executive Officer\n\nShawn Munsell -- Chief Financial Officer\n\nJim Salera -- Stephens Inc. -- Analyst\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nMore CVGW analysis\n\nAll earnings call transcripts"
}