{
  "companyName": "Markel",
  "companyTicker": "MKL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/markel-mkl-q3-2022-earnings-call-transcript/",
  "content": "Markel (MKL -0.66%)\nQ3 2022 Earnings Call\nNov 02, 2022, 9:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Markel Corporation third quarter 2022 conference call. All participants will be in a listen-only mode. [Operator instructions] After today's presentation, there will be an opportunity to ask questions. [Operator instructions] During the call today, we may make forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nThey are based on current assumptions and opinions concerning a variety of known and unknown risks. Actual results may differ materially from those contained in or suggested by such forward-looking statements. Additional information about factors that could cause actual results to differ materially from those projected in the forward-looking statements is included in our most recent annual report on Form 10-K and quarterly report on Form 10-Q, including under the captions, Risk Factors and Safe Harbor and Cautionary statement. We may also discuss certain non-GAAP financial measures in the call today.\n\nYou may find the most directly comparable GAAP measures and a reconciliation to GAAP for these measures in our most recent Form 10-Q. Our Form 10-K and Form 10-Q can be found on our website at www.markel.com in the, For Investors section. Please note this event is being recorded. I would now like to turn the conference over to Tom Gayner, co-chief executive officer.\n\nPlease go ahead.\n\nTom Gayner -- Co-Chief Executive Officer\n\nThank you, Regina. Good morning. Let me add my welcome to the Markel Corporation third quarter conference call. This is indeed Tom Gayner, and it's my pleasure to welcome you to our quarterly call.\n\nI'm joined this morning by my co-CEO, Richie Whitt; and our CFO, Jeremy Noble. They will update you on our overall financial results and our insurance operations in just a minute. But before they do, and as they say in the news business, don't swallow the headline. Well, here's the headline.\n\nThings are going very well at Markel. I'm delighted to share these results with you full stop. Now recognize that when you look at the headline numbers, that may not be your immediate reaction. So please let me share a few points with you that might help you enjoy the same sense of progress and optimism that I have.\n\nFirst, our insurance operations are solidly profitable and growing at the same time. Richie and Jeremy will give you more numbers and details on this. But from my point of view, during these sorts of underwriting profits and to be growing and to continue to report favorable reserve development in the face of ongoing large-scale natural catastrophes such as Ian and ongoing inflationary pressures, whether CPI flavor or social flavor is fantastic. I am so proud of and grateful for our insurance operations and the results they are posting.\n\nWe've had some bumps along the way in pieces and parts of our insurance operations in the last few years, but I think these results validate the hard work, the hard decisions, the discipline, and the dedication of the people of our insurance operations. I also think these results bode well for the future. Second, our reinsurance operations posted solid profitability in the face of all of the challenging factors I just noted, the ongoing high levels of property catastrophe losses for the industry would normally correlate the tough results in our reinsurance business. We've spoken for the last several years about what we've done to improve our reinsurance results, and I hope these numbers provide you with some assurance that we're on the right track.\n\nMore importantly, I think these reinsurance results speak to something very important about our culture. There's no question that reinsurance results were far from optimal in recent years. As is always the case around every aspect of Markel, we did our best to figure out what was wrong, what we needed to improve, and then we went about the work, the hard work of making things better. As is always the case, we didn't deny there was a problem and we didn't run away from it.\n\nWe just went to work every day and concentrated on making it better. We've sensed internally the things have been better in our reinsurance operations for a while now, but with the time lags involved in insurance accounting, it takes a while for those results to be visible in our financial reporting. Additionally, in which should emphasize the improvement, consider the acid test of the modest impact of Ian on our results. In Sherlock Holmes' terms, Ian was the dog that didn't bite.\n\nI hope that you can now share our confidence that we're on the right track in reinsurance and that it will be a valuable contributor to our overall results going forward. Third, Markel Ventures continues to set new records in revenues and profitability. Markel Ventures provides doses of resiliency, optionality, culture, and cash to the Markel Corporation. The people of Ventures continue to operate in challenging environments of supply chain challenges, tough labor markets, inflationary pressures, and increasing regulatory burdens.\n\nDespite these ongoing challenges, the Ventures teams continue to set new records. I can't thank them enough for their ongoing and unrelenting commitment to excellence. Fourth, our State National and Nephila operations continue to make progress. The performance of State National continues to go from strength to strength.\n\nThere are also two important items of note at Nephila that I hope encourage you. One is that we've received proceeds of over $300 million from the sales of the two MGA operations or part of Nephila. Secondly, as we roll through another difficult year of industry catastrophe losses, the performance of the Nephila funds demonstrates the underwriting process is creating investment results that track expectations. The impact of storms like Ian and other industry losses are developing along the lines expected by our modeling and loss expectation methodology, and that bodes well for the future.\n\nFourth, investments. Wait, what? On the surface, the well-known declines of both equity and bond markets are penalizing current reported returns. That's true. But what does that mean? The answer is it depends.\n\nIf markets were going down, and we had to sell our investments at the same time, that would be awful. If markets were going down and we just stood pat, that would probably be OK but not wonderful. If markets were going down and we were steadily buying more equity securities and bonds with higher interest income and our own stock at lower prices, that would be fantastic. I'm delighted to report to you that our circumstances today are exactly that.\n\nWe're buying. That adds to the overall earning power of Markel over time. Fifth, so far this year, we've repaid $350 million of senior long-term debt, and we repurchased $208 million of Markel stock. That amount almost doubles what we repurchased in the first nine months of last year.\n\nSixth, our recurring, recurring net investment income of the interest income and dividends you receive continue to grow. During the quarter, that line item grew 18% from $91 million to $108 million. I think we can reasonably expect to see ongoing increases in recurring, recurring investment income for the foreseeable future. To summarize, before I turn the call over to Jeremy, I like our hand.\n\nYou, as our shareholders, own a profitable insurance operation that has grown. We're investing those profits at positive long-term rates of return in additional insurance opportunities, publicly traded securities, Ventures operations, and our own shares. You're hungry for good returns from your investment and so are we. You can picture Markel as a pizza.\n\nThe size of the overall pizza is growing, and we're cutting it into fewer slices. Seems to me like the value of each slice is growing. I'm guessing the market will see it that way in the fullness of time. With that, we'll shift away from the talk of pizza, and I'll turn it now to Jeremy to provide more color and details on the financial results.\n\nJeremy?\n\nJeremy Noble -- Chief Financial Officer\n\nThank you, Tom, and good morning, everyone. We often talk of win-win wins and of the importance of being an organization for which others are better off for being associated with. It's events like Ian that remind us of this virtue and where we must follow through. I'm incredibly proud of our associates who are tirelessly supporting our customers and the local communities that have been impacted.\n\nWhether we look to our settling of claims to get people back on their feet with the supply of building materials to help restore, Markel is actively working to improve the situation, and our thoughts continue to be with people of Florida at this time. We remain pleased with the strong performance of our insurance and Markel Ventures operations. We are confident in the quality and durability of our investment portfolio as we, as well as our ability to execute against our operating plans within our insurance and ventures businesses. We continue to find opportunities to allocate capital across our three engines, and we remain focused on building long-term shareholder value.\n\nOverall, it's been a pretty solid first three quarters of the year. Looking first to our underwriting results, gross written premiums surpassed $7.5 billion for the first nine months of 2022 compared to $6.3 billion in 2021, an increase of 19%. Our increased premium volume reflects new business volume, strong policy retention levels, more favorable rates, and expanded product offerings. Our professional liability and general liability product lines continue to lead the way, but we also achieved meaningful growth across many of our other product lines.\n\nOur consolidated combined ratio was 91 for the first nine months of both 2022 and 2021. Our 2022 combined ratio included $70 million of net losses attributed to Hurricane Ian, and $35 million attributed to the Russia-Ukraine conflict, which combined added 2 points to the year-to-date combined ratio. All losses attributed to the Russia-Ukraine conflict were recognized in the first quarter and our initial estimates associated with this event remain unchanged. In 2021, we incurred $182 million or 4 points of net losses from natural catastrophes in the first nine months.\n\nExcluding these loss impacts from both years, our consolidated combined ratio for the first nine months of the year was an 89 compared to 87 for the same period in '21. The increase reflects the impact of less favorable development on prior accident year loss reserves this year compared to last year, partially offset by a lower expense ratio. With regards to prior-year loss reserve development, prior-year loss reserves developed favorably by $204 million in the first nine months of this year compared to $366 million in the first nine months of last year. In 2022, among the reasons we experienced lower favorable development was due to greater-than-anticipated claims settlements and increased claims frequency and severity trends in certain of our professional liability product lines within our Insurance segment.\n\nThe impact of economic and social inflation have created more uncertainty around the ultimate losses that will be incurred to settle claims, particularly on our longer tail product lines such as professional liability and general liability. As a result, we are approaching reductions in prior-year loss reserves cautiously, particularly on more recent accident years. As I've stated last quarter and consistent with our reserving philosophy, we are responding quickly to increased loss reserves following any indication of increased claims frequency or severity in excess of our previous expectations. In instances where claims trends are more favorable than we previously anticipated, we're often waiting to reduce our loss reserves, and we'll evaluate our experience over additional periods of time.\n\nTurning to our investment results. Net investment losses included a net income of $2.2 billion in the first nine months of the year were primarily attributable to a decrease in the fair value of our equity portfolio, driven by significant declines in the public equity markets during the period. This compares to net investment gains of $1.2 billion for the first nine months of last year, attributable to an increase in the fair value of our equity portfolio driven by favorable market value movements. As you've heard us say many times before, we focus on long-term investment performance.\n\nWe continue to maintain our investing discipline, understanding the periodic cost and the equity markets are to be expected and will result in the variability and timing of the investment gains and losses. We will continue to measure investment returns over longer periods of time. At the end of September, the fair value of our equity portfolio included cumulative unrealized holding gains of $3.9 billion. With regards to net investment income, we reported $274 million in the first nine months of this year compared to $284 million in the same period last year.\n\nThe decrease reflects the impact of losses recognized on equity method investments this year compared to income from equity method investments last year. Net investment income on our fixed maturity securities this year was up slightly compared to last year. The impact of higher average holdings and fixed maturity securities this -- in the current year was mostly offset by lower yield compared to the same period a year ago. We're beginning to see the benefit of higher interest rates on our net investment income through recent purchases of higher-yielding fixed-maturity securities.\n\nThat impact will become more meaningful in future periods as lower-yielding securities mature and continue to be replaced with higher-yielding securities. Beginning in the second quarter of this year, the book yield on new purchases began to exceed the average book yield of our portfolio. Net unrealized investment gains decreased $1.3 billion net of taxes during the first nine months of this year, reflecting a decline in the fair value of our fixed maturity portfolio, resulting from increases in interest rates. As a reminder, we typically hold our fixed maturities until immature.\n\nWe generally expect these unrealized losses to reverse in future periods as bonds mature. Our portfolio has an average rating of AAA and there are no current or expected credit losses within the portfolio. Now, I'll cover the results of our Markel Ventures segment. Revenues from Markel Ventures increased 31% to $3.5 billion for the first nine months of 2022 compared to $2.7 billion for the same period last year.\n\nThis increase reflects the contribution of revenues from our December 2021 acquisition of Metromont, and August 2021 acquisition of Buckner, as well as organic growth across many of our other businesses, most notably in our construction services businesses. EBITDA for Markel Ventures was $353 million for the first nine months of this year compared to $304 million during the same period last year. The increase reflects higher revenues and improved operating results across several businesses, as well as the contribution of Metromont. Looking at our consolidated results for the first nine months of this year.\n\nOur year-to-date results demonstrate how well our core operations are navigating the current economic environment and executing at a high level. We reported a net loss to common shareholders of $922 million for the first nine months of this year compared to net income to common shareholders of $1.5 billion for the same period a year ago. This was largely attributed to the year-over-year swing in changes in our public equity portfolio valuation. Comprehensive loss to shareholders for the first nine months was $2.2 billion compared to comprehensive income to shareholders of $1.3 billion in the first nine months of last year.\n\nAgain, this was driven by both fixed maturity and public equity valuations. It's worth highlighting that given the magnitude of our equity portfolio, we believe generally accepted accounting principles, which require that we include unrealized gains and losses on equity securities in net income, create volatility in revenues and net income, which can obscure the strong operating performance of our businesses. Finally, I'll make a few comments on cash flows, capital, and our balance sheet. Net cash provided by operating activities was $1.9 billion in the first nine months of this year compared to $1.6 billion in the same period last year.\n\nOperating cash flows in 2022 reflected strong cash flows from our underwriting operations given the growth in premium volume. Total shareholders' equity stood at $12.3 billion at the end of September compared to $14.7 billion at the end of the year. Again, this decline is driven by declines in both the fixed maturity and public equity valuations, as I previously discussed. July 1, we retired $350 million 4.9% unsecured senior notes.\n\nAnd during the first nine months of 2022, we repurchased 163,000 shares of our stock under our outstanding share repurchase program. With that, I'll turn it over to Richie to talk more about our insurance business.\n\nRichie Whitt -- Co-Chief Executive Officer\n\nThanks, Jeremy, and good morning, everyone. We produced another strong quarter of operating results within our insurance businesses benefiting from reduced volatility within our underwriting operations. This was partially achieved through adjustments in our property catastrophe underwriting strategy and appetite over the past few years. Our combined ratio for the quarter of 93 includes Hurricane Ian, a significant industry catastrophe event.\n\nIan added four points of underwriting loss to our third quarter combined ratio. In previous years, the impact of a catastrophe event of this size would have had a more adverse impact on our underwriting results. We continue to see strong top-line growth across our product lines achieving 19% growth for both the quarter and year-to-date periods within our underwriting operations. Total underwriting premium production passed $7.5 billion for the nine months.\n\nThis exceeds the total underwriting production volume for the full year just two years ago in 2020. While we continue to benefit from mid- to high single-digit rate increases across our underwriting operations, our production growth has also been significantly influenced by new business growth, the development of new products, and the onboarding of new program relationships. Our focus on expense discipline and scaling our operations produced a year-to-date expense ratio of 33%, representing a 2-point improvement from a year ago. Consistent with my comments last quarter and Jeremy's comments, we remain cautious in our approach to recognizing prior-year loss reserve takedowns in keeping with our conservative reserving philosophy.\n\nWhile we are seeing favorable actual versus expected loss trends in many of our product lines in the most recent accident years, we are being cautious about realizing these potential benefits until the impact from various forms of inflation and core processing delays are more fully understood. Now I'll discuss our year-to-date results within our insurance engine, which include our underwriting operations, program services and fronting operations and our insurance-linked securities operations. So, let's dive into the insurance segment first. Gross written premiums and earned premiums in the insurance segment were up 21% for the first nine months of this year.\n\nWe realized 15% or higher premium growth across all our major product lines with the exception of workers' compensation, which while growing continues to face small rate decreases. Premium growth was most notable in our general liability and professional liability product lines. The combined ratio for the first nine months of the year in the insurance segment was 91% compared to 88% last year. The current year combined ratio included $90 million or just under 2 points of net losses related to Hurricane Ian and the Russia-Ukraine war versus $89 million or just over 2 points of net losses last year, related to 2021 catastrophes.\n\nExcluding the impact from these event losses, the combined ratio increased by 3 points due to less favorable development on prior-year losses partially offset by a lower expense ratio due to benefit from higher earned premiums and relatively flat operating expenses. The lower favorable development on prior accident year losses was driven by lower takedowns in our longer-tail product lines, such as our U.S. general liability and professional liability books. As I mentioned earlier, we are taking a cautious approach in our reserving process to realizing prior accident year loss takedowns.\n\nAnd at the same time, we are reacting quickly to pockets of adverse development. We also increased our attritional current accident year loss ratio in the third quarter within these product lines to reflect the claims trends we have been seeing in the past few quarters including responding to general inflationary trends. On a year-to-date basis, our current accident year attritional loss ratio remains down slightly versus the prior year as pricing and underwriting actions are modestly ahead of claims trend. Turning next to our reinsurance segment.\n\nGross written and earned premiums within the segment were up 5% for the first nine months of the year. Premium growth was driven by higher premiums in our general liability and professional liability lines from both new business and higher renewals due in part to more favorable rates along with the impact from favorable premium adjustments in our general liability and credit and surety lines. This growth was partially offset by lower premiums in our property and workers' compensation lines due to nonrenewals. Our property line continues to run off as part of our catastrophe strategy with the transition of our reinsurance property line to Nephila and the decision to discontinue writing retro property business within our underwriting operations.\n\nThe reduction in workers' compensation was due to the nonrenewal of a large quota share treaty in the first quarter. The combined ratio for the first nine months of the year within the reinsurance segment is 93% versus 108% a year ago. The current year combined ratio included $15 million or 2 points of net losses from the Ukraine war compared to $93 million or 12 points of net losses last year related to 2021 catastrophe events. The transition of our reinsurance property lines and the exit of retro reinsurance lines resulted in reduced volatility, which significantly benefited our reinsurance segment's underwriting results.\n\nExcluding the impact from these events, the reinsurance segment combined ratio decreased by 5 points from a year ago, primarily due to favorable development on prior accident year losses this year versus adverse development last year. The segment had 2 points of favorable loss development this year due to favorable loss development in our credit and surety and property product lines, partially offset by the impact from favorable prior-year premium adjustments. Last year, the segment was impacted by 4 points of adverse development, primarily within our property product lines including 3 points of adverse development related to losses attributed to COVID-19. We continue to make progress toward our combined ratio target of 90%.\n\nExcluding cat and specific events, year to date, we're sitting at a 91% versus 93% a year ago. Significant efforts made by Jed Rhoads and our reinsurance team around reunderwriting a reinsurance portfolio are starting to show through in the financial results. As we announced last quarter, Jed is going to be retiring at the end of the year after an incredible 40-plus years in the reinsurance industry. We thank him for all of his contributions to Markel, including successfully repositioning our global reinsurance operations for sustainable, profitable growth.\n\nNext, I'll touch on our program services and other funding operations in our ILS operations, both of which are reported as part of other operations. As a reminder, almost all of the gross written premium within our program services and other fronting operations is ceded. Our program services and other fronting operations continue to grow with total premium production of $2.6 billion this year versus $2.3 billion last year and produced total revenues of $105 million this year, up 18% from a year ago. Margins in this area of our business remained strong, as does our new business pipeline.\n\nWithin our Nephila operations, operating revenue from the year were down versus last year due primarily to the disposition of our Velocity MGA operations in February. We recognized a gain of $107 million in the first quarter of this year associated with that transaction. Further, we finalized the sale of our Volante MGA in October for an estimated cash consideration of $155 million, the gain from which will be recognized in our fourth quarter results. Nephila's assets under management were $7.8 billion as of September 30, 2022.\n\nWhile Hurricane Ian had a significant impact on investor returns, we invested -- the estimated losses were consistent with Nephila's expectations for an event of this magnitude. Nevertheless, the significant Ian loss and investor fatigue around recent cat activity will continue to adversely impact assets under management. I'll end with a few comments about market conditions and outlook as we look to finish the year strong. As I think everyone knows, we are currently transitioning leadership of our insurance engine over to Jeremy Noble.\n\nAnd he and I will be happy to take questions during Q&A. As I noted earlier and as noted on many of our peers' earnings calls, rates continue to gradually moderate in most lines. Exceptions continue to be cat exposed property in lines such as aviation, terrorism, war, and political violence, which has been impacted by the Ukraine war and other large events, including Hurricane Ian. We continue to see strong submissions, new business opportunities, and total premium writings despite uncertain financial markets and fears related to a potential economic slowdown.\n\nInflation in all its forms continues to be a significant focus for us and the industry. As I discussed last quarter, going into '22, we had already baked more inflation into our pricing and loss reserving. During the third quarter, we adopted an even more cautious approach, which impacted both our prior accident year reserve releases and our current accident year loss picks. As has always been our philosophy, we will respond quickly to potential adverse trends and will be slow to recognize positive trends until they can be confirmed.\n\nMost of our products' pricing bases are impacted by inflation, and this helps to some extent to offset claims trend. However, we are not prepared to rely on this to maintain rate adequacy. While overall market conditions remain favorable, we have been disappointed to see more price competition in certain lines of business. We see absolutely no justification for price decreases given all the risk factors we have previously discussed.\n\nWe are going to continue to push for what we believe are must-have rate increases and we are prepared to walk away from business that is not adequately priced. Fortunately, we feel we're well positioned to both act with discipline and grow profitably given our broad product diversification and market-leading capabilities. Interestingly, we find ourselves at the end of the third quarter this year in a remarkably similar position to 2021. We need a strong finish to the year to achieve our profitability goals of 90% combined ratio or better.\n\nWe know our team will continue to work hard in pursuit of this goal. Thank you for your time today. And now I'd like to turn it back over to Tom.\n\nTom Gayner -- Co-Chief Executive Officer\n\nThank you, Richie. I hope that I conveyed my optimism and gratitude for how all three of our engines are firing these days and our overall circumstances at Markel in my opening comments. I think the best I can do at this point is just open the floor for questions. So, with that, Regina?\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] At this time, we'll pause momentarily to assemble our roster. Our first question will come from the line of Mark Hughes with Truist. Please go ahead.\n\nMark Hughes -- Truist Securities -- Analyst\n\nYeah. Thanks. Good morning. I wonder what you can say in terms of signals you're getting about the economy when you look at your insurance operations, also the ventures, you say construction is doing pretty well, and curious whether you're seeing any kind of signs of things may be slowing?\n\nTom Gayner -- Co-Chief Executive Officer\n\nYeah. Thanks, Mark. It is an incredible value to have the windows that we have both through what each individual underwriter would see and what we see through the various businesses that we're in across the economy. And what I'll tell you is it's hard and it's challenging.\n\nAnd every single business is dealing with labor issues, supply issues, and inflationary pressures. But at the same time, we continue to increase prices in response to increased cost, and there's plenty of business to be done. So, it keeps on keeping on.\n\nMark Hughes -- Truist Securities -- Analyst\n\nVery good. I think when you look at the reinsurance segment, obviously, post-property is hardening up. Is that spilling over into other lines? And is that going to create opportunity within reinsurance or insurance in the insurance segment as well?\n\nJeremy Noble -- Chief Financial Officer\n\nHey, Mark, it's Jeremy. Maybe I'll start on that. I think you're right to point out, and property is certainly part of the story. I think marine and aviation lines because this year's events are also part of the story.\n\nSo, we see it if we're on the table relative to our outworks programs, and we see where we're at the table from our inwards programs. The conversations are definitely a little more intense. And I think capacity is a little more scarce, and I think that is creating a little bit of a firming opportunity. So, I would anticipate that, that has broader implications across casualty and specialty lines as well.\n\nSo, we're going to see it learn a lot more, I think, in the next few months. But we've seen a little bit of a gap differential over the last couple of years between house where the primary insurance space is working and the reinsurance space. And I would say it's certainly hardening more right now in the reinsurance space.\n\nMark Hughes -- Truist Securities -- Analyst\n\nDidn't really think about your growth in insurance, the 21% in written this quarter. I hear your description of in pockets of price competition, you've been careful about inflation. You also say the pricing increases are moderating, but you're still seeing -- in looking at the written premium growth that you're seeing a lot of good opportunity. Any way to kind of square all of that? The optimism in the P&L versus the caution in the language and description here?\n\nTom Gayner -- Co-Chief Executive Officer\n\nI think the way to square it is, is your right, Mark, things are good and language in the way we speak, we're inherently conservative people. We always have been, we always will be. So, we never want to take things for granted. We never want to sugarcoat things, but things are pretty good.\n\nJeremy Noble -- Chief Financial Officer\n\nAnd Mark, maybe, it's Jeremy, I'll add to that. I mean I think this is a demonstration of the work that we've been hard at across our insurance operations for quite some time. So, I think we benefit from broad product diversification, global capabilities, strong trading relationships, a multi-distribution platform. We are achieving rate.\n\nWe got new product innovation. So that's allowing us to grow, but what we're laser focused on is growing profitably. So, at the same time, I think we have the ability to act with a high degree of discipline. That squares comments about the importance around rate adequacy, the importance of discipline and the importance of knowing when we got to push away from the table or put the pen down with the opportunity for us to grow at present, as well as what I think that portends for future quarters.\n\nAnd that's what we've been hard at work at.\n\nMark Hughes -- Truist Securities -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nOur next question will come from the line of Mark Dwelle with RBC Capital Markets. Please go ahead.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nYeah. Good morning. Let me start with an accounting question. The $53.4 million of reserve release that is related to CATCo, am I correct understanding that you guys were effectively just a pass-through for that? It passed through one line and then back out through the minority interest.\n\nOr was there any other plus or minus that was caught up somewhere else in the results that may not have been obvious?\n\nJeremy Noble -- Chief Financial Officer\n\nMark, it's Jeremy. Well, you make a great account. So yes, you're exactly right. It's really just geography.\n\nSo that is a straight pass-through any -- we continue to wind down the reserves. We continue to execute computations where we can, where there are savings that passes through to the benefit of the original investors. We see that the sort of the benefit come through as favorable in the other expenses. The offset is a noncontrolling interest kind of below the line.\n\nJust be aware of that.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nRight. OK. And my old accounting professor would be proud that I retained any of them. So anyway, the second question that I have and this may be probably for Jeremy and Richie.\n\nI mean you've talked about your increasing caution on the reserving and on the loss picks. Yet, we've got some pretty decent pricing still, and we obviously have inflation. Can you just talk kind of -- for year-to-date, we're still an improved accident year margin. Can you just talk about kind of the evolution of your thinking on that over the course of the year? And I guess all else equal, I mean, could it -- I guess it could have been better had inflation not been as severe as it's been.\n\nIs that the right way to think?\n\nJeremy Noble -- Chief Financial Officer\n\nYeah, Mark, I'll start and maybe Richie will jump in. I think that is a good way to think. And won't necessarily get into numbers or certainly a line by line of view. But overall, I think we feel that rate and underwriting actions are keeping just ahead of trend.\n\nAnd that expands to our acknowledgment that in an inflationary environment, exposure has an effect of acting like rate to a certain degree as well. So that is why we are incredibly focused on rate adequacy. If we were in an elevated inflationary environment, without a doubt, the results would even be stronger. I think you know us well and Richie touched upon this earlier, we have a very long-standing philosophy with regards to how to approach reserves.\n\nFocused on more likely redundant than deficient, focused on reacting to bad news, if you will, very quickly and taking a much more measured view to good news. That's anywhere over time where we are in a cycle, but I think that's even more so the case now. So, like despite inflationary environment, right, we can take those actions that Richie and I were mentioning. We can still generate favorable prior-year development.\n\nWe can, in fact, maintain or improve our confidence in our loss reserves, and we can still generate certainly on an ex-cat basis, a combined 90 or better, that's a pretty good place, I think, for us to be at this stage.\n\nRichie Whitt -- Co-Chief Executive Officer\n\nYeah. I'll just add a -- just real quickly, Mark, I'll just add. It's been a while since anybody has seen inflationary pressures like the ones we've seen recently. And so, we're having to kind of reeducate underwriters, actuaries, accountants, everybody.\n\nI mean, Tom and I have seen this kind of inflation, but a lot of the rest of the people around here have not. So, it's safety first at Markel, and it always has been that way in terms of the reserves. And we'll we're more than happy to make sure the reserves are at the confidence level that we want. And if that means there's potentially some reserve decreases down the road, that's great.\n\nBut I think that's how we're trying to view this current situation.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nI appreciate those comments. And I guess with that in mind, it kind of raises two maybe follow-up questions directly to that point. So, if you're kind of at conservative plus in terms of thinking about accident year picks and reserving, what are the signposts you're looking for that would move you back to just merely conservative? That would be the first question. And then the second, I mean, as you weigh up the pricing environment now, the inflationary trends that you're seeing, would it still be the case that more likely than not accident year margins would improve next year? Or you're not willing to go that far?\n\nRichie Whitt -- Co-Chief Executive Officer\n\nYeah. I think it's hard to say whether things -- accident market -- margins improve because we got a lot of unknown variables, right? We don't know what the rate increases are going to be next year, and we also don't know what the true rate of inflation is. I know you're going to hate this answer, but the true thing that we need to be able to start potentially reducing our loss picks and increasing prior-year releases is time. We need to see it.\n\nSo, I think it's just a matter -- it's going to be a matter of time. And given current risk factors, I think it will take more time.\n\nTom Gayner -- Co-Chief Executive Officer\n\nYeah. I'll jump in just, Mark, with some formal accounting comments here. You remember the movie, My Cousin Vinny, there was a scene in there where the character that was played by Joe Pesci was hustling some pull and he got into a little bit of a match with some of the locals there, and they wanted to bet. And he said, \"Well, where's your money to back up that bet.\" He asks them to show them the cash of the stakes that they wanted to bet for.\n\nAnd of course, they didn't have it. And it was a recurring risk and they came back and they had a big lot of money and he says, \"Well, how do I know that isn't just a bunch of ones with the 20 wrapped around it and it turns out that's exactly what it was.\" Well, the good news when we're debating and trying to think about how this reserve -- how the reserves might develop over time, remember, we did collect the premiums upfront. We do have the cash for what we're talking about. Now we'll see how they develop over time.\n\nBut we do hold the cash. And we are investing the cash at higher and higher rates of return. So, we continue to operate in the belief that we want our reserves to be more likely to be redundant and efficient. And we have the cash while we're waiting for, as Richard said, time, just to say the claim is settled, it's done, we know.\n\nIn the meantime, economically, we're earning the returns from our capital.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nOK. Thanks for that. I think that's the first in 20 years of doing this. That's the first My Cousin Vinny reference I've ever gotten in response to a question that I've asked.\n\nBut that way, I won't have to ask you whether -- if Markel is a pizza, if you're a New York style or a Chicago style, I think you've shown your colors on that one.\n\nMark Hughes -- Truist Securities -- Analyst\n\nI don't know, but I know what we're eating for lunch now. Thank you. Thanks for those. I'll let others jump in.\n\nOperator\n\n[Operator instructions] Our next question will come from the line of John Fox with Fenimore Asset Management. Please go ahead.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nYes. Good morning, everyone. First, congratulations on the reinsurance results. I have a number of questions for Tom.\n\nTom, you've been holding on to about $2 billion of short-term investments for quite some time and another $3 billion of cash. And there's been no opportunity cost for doing that. But today, there is although short-term rates, you can make a decent return. Can you talk about the opportunity cost today? And would you invest some of that cash and short-term investments and increase the yield going forward?\n\nTom Gayner -- Co-Chief Executive Officer\n\nWell, the good news is, while there's a lot of chatter and conversation about that issue over the last year or so. With hindsight, in retrospect, it looks like a pretty good decision. So, the rates of return on that cash are going up. And we are deploying it, as we talked about in terms of buying equities and repurchasing our own stock.\n\nAnd given the profitability, the capital position, what we'll do is to continue to invest in a methodical and disciplined way. I'm not going to chuck it into the market all at once. We'll do the same thing we always do, just steady, steady, steady, steady, steady, incremental, incremental, incremental, iterate, iterate, iterate to a better and better return. But I have no market forecast, I have no crystal ball.\n\nWell, we are putting them into work.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nYeah. I guess $2 billion of short-term investments, right? Could that be $1.5 billion and $600 million of corporates where you could earn 5%, 6% on pretty short duration? Like are you thinking about that? Or we're getting 4%, 4.5% on short term and that's OK.\n\nTom Gayner -- Co-Chief Executive Officer\n\nYeah. It's not awful, especially compared to what it had.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nOK. That's very clear.\n\nTom Gayner -- Co-Chief Executive Officer\n\nYeah, John, I can recall a conversation with you many, many years ago where you made the comment about Markel that they may not always do what you want them to do, but they will always do what they say they will do. So, you and I are in agreement, and we might pace it a little differently than you would if our roles will reverse, but we're doing the same thing.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nYour answer is very clear. Thank you. The other point on investment income and sometimes on these calls, we get an interesting lecture on account. And I would say that -- and I like your reaction to this.\n\nI think your net investment income is actually doing better than you suggested. If I read the Q correctly, the $108 million of net investment income includes about $5 million of marks from Hagerty.\n\nTom Gayner -- Co-Chief Executive Officer\n\nYeah, I think it's actually more than that. So the equity method investing. And believe me, that's one of those that starts around here with -- I used to be an accountant, and those conversations -- so yes, both -- so for instance, there was one investment that we made probably 10 or 12 years ago. And I cannot recall with precision whether it was $25 million or $50 million, but it was one of those two numbers.\n\nAnd I think we've recognized cumulative gains and losses of well over $100 million each way of gains and losses over time, depending on the mark-to-market that quarter. It's the same thing that happened when we go to credit default swap that we ended up having a wonderful experience with long time ago. The quarterly swings that come through equity method accounting do indeed obscure what's really happening in fundamental economics. So, you're reading the Q right, and that's why I used the new term of recurring, recurring net investment income this year.\n\nI think through the first nine months, the number is about $50 million in total on the equity method things. If you took that out of the mix and with the recurring, recurring net investment income, it is going up at a faster rate than what was reported in this quarter's results.\n\nJeremy Noble -- Chief Financial Officer\n\nJohn, it's Jeremy. Just to piggyback, John, just to piggyback off Tom's comments. All of our equity method investments are included in that line item. So, it's not just Hagerty.\n\nSo, I want to make that point. And then Tom is exactly right. The year-over-year shift is $50 million. So instead of on a nine-month basis being down $10 million, would be up $40 million.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nRight. That's my point, right?\n\nJeremy Noble -- Chief Financial Officer\n\nYeah. Exactly.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nThe recurring investment income from the portfolio is growing and increasing the return on equity. Is that the right way to think about it?\n\nJeremy Noble -- Chief Financial Officer\n\nYes.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nAnd to add insult to injury on the Hagerty piece, it's worth about $0.5 billion more than what's on the financial statements, right?\n\nTom Gayner -- Co-Chief Executive Officer\n\nThat is correct.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nOK. And then --\n\nTom Gayner -- Co-Chief Executive Officer\n\nYeah, a point John, so call it $0.5 billion. The only thing we've ever recognized is our losses.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nRight. OK. And then, Tom, final question for you. On the venture side, if I look at the products, I take the products' revenue and subtract the expenses, it's about a 1% margin, which is, I'm sure, not reflecting a reality.\n\nCould you talk about anything what went on there in the third quarter? Is there anything unusual? Or is that seasonality?\n\nTom Gayner -- Co-Chief Executive Officer\n\nYeah. I don't know. I know one of the things that would be going on in terms of the EBITDA profitability of the book and the set of businesses is to the extent that we have distribution businesses, those are high volume, low margin, but a wonderful return on capital. And the mix is skewing a bit that way at the moment.\n\nBut I have to look at it and think about the exact thing you're asking about, don't know.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nOK. Great. And then, Richie, for you. Typically, ILS has had a big fourth quarter.\n\nThat's been their best quarter for profitability, I guess as things get trued up from the investment year. Do you expect that to happen again this year? Or with the hurricane is that off the table?\n\nRichie Whitt -- Co-Chief Executive Officer\n\nI guess I'd have to say, John, I don't know. The fourth quarter is usually when you look hard at the side pockets and see if they can be released and that releases trapped fees. I don't know where that will stand this year just simply because of -- like you say, Ian, I think there's going to be quite a bit of focus on making sure you get reserves correct for Ian also in terms of this is the cap time that you do capital raising. So, I guess, sorry, the answer is I don't know.\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nOK. That's fine. I appreciate it. Thank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Tom Gayner for any closing remarks.\n\nTom Gayner -- Co-Chief Executive Officer\n\nThank you for joining us. Be well. We'll talk to you again in about another 90 days.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTom Gayner -- Co-Chief Executive Officer\n\nJeremy Noble -- Chief Financial Officer\n\nRichie Whitt -- Co-Chief Executive Officer\n\nMark Hughes -- Truist Securities -- Analyst\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nJohn Fox -- Fenimore Asset Management -- Analyst\n\nMore MKL analysis\n\nAll earnings call transcripts"
}