{
  "companyName": "Cannae Holdings, Inc.",
  "companyTicker": "CNNE",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/cannae-holdings-inc-cnne-q2-2022-earnings-call-tra/",
  "content": "Cannae Holdings, Inc. (CNNE 0.68%)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the Cannae Holdings, Inc. second quarter 2022 financial results conference call. [Operator instructions] As a reminder, this conference call is being recorded, and a replay is available through 11:59 p.m. Eastern on August 15, 2022.\n\nWith that, I would like to turn the call over to Jamie Lillis of Solebury Trout. Please proceed.\n\nJamie Lillis -- Investor Relations\n\nThank you, operator, and all of you for joining us this afternoon. On the call today, we have our chairman, Bill Foley; our chief executive officer, Rick Massey; Cannae's president, David Ducommun; and Bryan Coy, our chief financial officer. Before we begin, I would like to remind listeners that this conference call and the Q&A following our remarks may contain forward-looking statements that involve a number of risks and uncertainties. And statements that are not historical facts, including statements about Cannae's expectations, hopes, intentions or strategies regarding the future are forward-looking statements.\n\nForward-looking statements are based on management's beliefs, as well as assumptions made by and information currently available to management. Because such statements are based on expectations as to the future financial and operating results and are not statements of fact, actual results may differ materially from those projected. The company undertakes no obligation to update any forward-looking statements, whether as a result of new information, future events, or otherwise. The risks and uncertainties, which forward-looking statements are subject to include, but are not limited to, the risks and other factors detailed in our quarterly shareholder letter, which was released this afternoon and in our other filings with the SEC.\n\nToday's remarks will also include references to non-GAAP financial measures. Additional information, including reconciliation between non-GAAP financial information to the GAAP financial information, is provided in our shareholder letter. I would now like to turn the call over to Cannae's chairman, Bill Foley, who will open with a few brief remarks then we'll open the line for your questions. Bill?\n\nBill Foley -- Chairman\n\nYes. Thank you, Jamie. Through the second quarter, we focused on two main themes to prepare for inflation in the rising interest rate cycle. First, we used our excess liquidity to repurchase our shares, which we believe are trading at a meaningful discount to fair value.\n\nSecond, we continue to simplify our portfolio by monetizing investments that were either less immune to an inflationary cycle or that helped optimize our tax position. Overall, we are very pleased with our portfolio companies and their ability to continue to generate growing profits in an inflationary environment. During the quarter, we repurchased 4.8 million Cannae common shares. Year to date, we have repurchased 6.8 million shares, representing approximately 8% of our shares outstanding.\n\nIn total, we have invested $306 million to repurchase approximately 13% of our shares outstanding since we received approval from our board for our repurchase program in 2021, as we continue to believe that our shares are not only undervalued, but so too are the shares of our portfolio companies. At quarter end, we have completely extinguished the 2019 board repurchase authorization and have only 2.7 million shares remaining on our 2021 authorization. As a result, our board has approved a new three-year 10 million share repurchase authorization, which further demonstrates our commitment to repurchase our shares when they are trading significantly below intrinsic value like they are today. In June, AmeriLife announced an investment that values Cannae's stake at a significant premium to our original investment.\n\nAs a reminder, Cannae invested $121 million for a 20% stake in AmeriLife alongside Thomas H. Lee Partners, or THL, in March of 2020. Over the past two years, we have worked in collaboration with THL and the AmeriLife management team to accelerate organic growth and expand through strategic M&A. We are very pleased with the results.\n\nAnd as it led to a strategic investment from Genstar Capital wherein they will take an equal ownership position with THL Partners. This transaction values Cannae's initial investment at $338 million or 2.8 times multiple of our original investment made about two years ago. While we enter our investments from a perspective as a long-term holder, Cannae will monetize a significant portion of our position through two closings anticipated in the second half of this year. Dun & Bradstreet remains our largest investment and one where we remain very involved given the upside potential that we see in the company.\n\nWe continue to work closely with Anthony Jabbour, the CEO, and the DNB leadership team as they execute their organic growth strategy while evaluating accretive tuck-in acquisition opportunities and broader strategic alternatives. To that end, DNB's first-half organic revenue growth on a constant-currency basis was 4.1%, which was in line with our guidance range of 3% to 5%. We believe that delivering and accelerating organic revenue growth is key to driving an improved valuation. We are also pleased that they will begin paying a dividend in September of $0.05 per share per quarter, which will generate approximately $16 million per year in cash flow to Cannae and hopefully improve DNB's trading performance as all of its peers pay a similar dividend and DNB continues to trade well below peer average.\n\nSubsequent to the quarter end, we did sell approximately 9.2 million shares of Dun & Bradstreet to minimize our tax obligations in the second half of this year. We continue to see significant upside in DNB shares. Alight is another important public holding for Cannae and one that continues to perform well, reporting second quarter revenue growth of 6.4% with 90% of their anticipated 2022 revenues now under contract. Importantly, Alight continues to transition to a Business Process as a Service or BPaaS model and recognized 36% year-over-year growth in their BPaaS revenues.\n\nAlight management team continues to execute very well as they add products to their platform and clients to their roster as they transition to a BPaaS model, which we believe is not yet reflected in their valuation. In fact, given the discount to fair value, the board of directors authorized a $100 million share repurchase program. Management provided guidance for the second half of 2022 and reiterated full year guidance, which represents an increase in year-over-year revenue of 6% to 7% and an increase in adjusted EBITDA between 4.7% and 6.6%. In the second quarter, as noted earlier, we aggressively repurchased our shares and further simplified our portfolio.\n\nWe will continue to work with our management teams to ensure that we help them successfully unlock the value that exists within their businesses. We will also look for new private investments like AmeriLife and Sightline where we can take control positions and apply our playbook to unlock substantial value for our shareholders. We are currently interested in several attractive investment opportunities. Lastly, we will be hosting our second annual Cannae Holdings portfolio conference on December 14 and 15 at the Wynn Las Vegas.\n\nLast year's inaugural conference was a constructive two-day event filled with in-depth presentations and quality discussions with full executive management teams of our portfolio companies. And this year will be a continuation of that same format. We believe that this was a great event and look forward to another successful conference in December. We hope all of you can join us in Las Vegas in December.\n\nI'll now turn the call back to the operator to begin our question-and-answer session.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from John Campbell with Stephens. Please proceed.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nHey, guys. Good afternoon.\n\nBill Foley -- Chairman\n\nGood afternoon, John.\n\nRick Massey -- Chief Executive Officer\n\nHey, John.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nHey, congrats on the positive development of AmeriLife, that was nice. It sounds like almost a three times return. You mentioned plans for kind of monetizing that in the back half of this year. Any sense for what that timing looks like? And then maybe, I don't know if it's maybe [inaudible].\n\nBill Foley -- Chairman\n\nYeah, John. Well, it looks like the first -- it's going to be a two-stage process. It looks like the first half of the transaction would be a cash payment will occur late August or early September and the second half, probably about 30 to 45 days later. In our case, we're going to roll about 20% of our overall investment back into continuing position in AmeriLife.\n\nWe feel like we're going to, again, get another double or triple out of this investment over the next couple of three years, but we are going to take a fair amount of cash off the table.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nOK. That's helpful. And then as a reminder, I guess on AmeriLife, that's on the 10% performance fee. Is that right?\n\nBill Foley -- Chairman\n\nI'm sorry, John.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nOn the LTIP, is it on the 10% fee?\n\nBill Foley -- Chairman\n\nAmeriLife is one of our --\n\nRick Massey -- Chief Executive Officer\n\nIt's all under Trasimene, John. This is our Trasimene portfolio.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nGot it. And then back to the Textor and, I guess, the Eagle Football deal, I didn't see any specifics mentioned. So I'm guessing you guys are probably still ironing out some details. It looked like there was a development maybe a couple of weeks ago that maybe the deal was going through, or it was kind of, I guess, information.\n\nBut any sense for what your ultimate commitment is going to be? And then maybe how you're looking from a funding standpoint? And then I know it's probably still too early there, but thoughts on whether you're going to roll that debt to equity over time.\n\nBill Foley -- Chairman\n\nYeah, John. We anticipate it's going to be about a $100 million commitment. If things come together. There's still a lot of loose ends with this transaction that we're trying to pull together.\n\nWe have to ensure that the various football assets that John Textor is involved with, can get a PCAOB audit that there -- and we can get that audit on a timely basis and that they can further fill the balance of the commitment that they need to acquire OL and then contribute other assets into Eagle Football. So it really remains a moving target at this time. We like the idea. We like the concept.\n\nAnd if it proceeds, it will be a roughly $100 million commitment.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nOK. Very helpful. And again, I guess, probably too early, but any sense for I don't know if there's any kind of framework on the returns. I've seen some figures out there, some targets they've put out as far as the revenue growth over time from Lyon in particular.\n\nBut any sense for what the kind of helping frame up the return potential?\n\nBill Foley -- Chairman\n\nYeah. We need to speculate on that, John, right now, really. It's -- I mean, there's so many moving elements with this transaction that it's pretty speculative, really trying to estimate returns at this point.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nOK, understood. We'll keep tabs on it in the future, and I'll get back in the queue. Thanks, guys.\n\nBill Foley -- Chairman\n\nThanks, John.\n\nOperator\n\n[Operator instructions] Our next question comes from Ian Zaffino with Oppenheimer. Please proceed.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nHey, guys. Thank you very much for all the details. Just wanted to ask you on the Dun & Bradstreet at least we sold some of the shares there. What's sort of the motivation of that sale? Maybe kind of your thoughts on the business or confidence in the business and the thesis playing out maybe the way you initially thought the process.\n\nBill Foley -- Chairman\n\nWell, I mean, we really like the investment. We like where the company is going. This -- in particular, the 9.2 million shares that we sold happen to be shares that we acquired in the IPO at a value of around $21.60 or $21.65 and we were in a kind of a tough tax position in terms of having disposed of some Ceridian shares incurring a very large tax bill, and we thought, we just said that we all got together, and we said, we own 88 million shares of this company. It's a significant position.\n\nIf we were going to raise some cash for some other investments, does it make sense to reduce our investment in Dun & Bradstreet and take a tax loss, which, of course, for Trasimene is pretty hurtful because we obviously have to recover that loss before any distributions can be made. But we just felt like it was time to take some money off the table and we raised about $135 million or $140 million with that sale. And that money is currently in the bank. And we did that really to give us a bank role to repurchase our shares from time to time.\n\nWe wanted to make sure we didn't have to go into a line of credit to repurchase shares.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nOK, great. Good. And then also how are you thinking about sources of monetization? Is there anything that you're going to immediately exit or you continue to exit? Just maybe a discussion about that. Thanks.\n\nBill Foley -- Chairman\n\nYeah. We really -- we don't really want to -- we don't want to liquidate any more of our Ceridian shares that we have remaining at this time. We really feel like Ceridian just reported great earnings. It's got a great path to the future.\n\nAnd obviously, there's -- we've been monetizing that investment for a couple of years now. The balance of our portfolio companies, we're really pretty excited about it. And we just feel like they're really not being treated very fairly in the marketplace like a lot of other companies. So with the AmeriLife monetization in the Dun & Bradstreet sale, we're kind of in a good cash position to make a couple of investments but also continue to repurchase shares, which is a pretty high priority in our viewpoint right now.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nAnd if I could squeeze in one more. Bill, your last point about that, when you look at like your buybacks and how aggressive you want to be, are you looking at maybe a spread of the MA base? And if you are like at what point does the spread becomes just so large that you have to act super aggressively or not? Maybe help us understand some of the thinking and the buyback and then how it relates to like the NAV discount in stock?\n\nBill Foley -- Chairman\n\nYeah. So I mean, I think really you kind of saw what happened in the first half when we really kind of stepped up when we bought -- we took out the FNF position, which, frankly, they were going to have to go to market with that position prior to -- I think it was around November 1 of this year due to the five-year window that they had to sell their shares that they got as part of the spinout. And we like that acquisition. That was in the $17.70 range, and we thought that was really a value to our shareholders.\n\nSo we're going to be in the market buying shares back at current levels and even higher and we would get much more aggressive if we again get a pretty stiff downturn in the marketplace, and we got back down below that $20, $19 range. And you see us kind of really piling on at that point.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nOK. And none of that thinking changes, if you're going to get bangs on taxes, just if still that's just half of one of the houses and probably two-and-a-half in the other houses? Thanks.\n\nBill Foley -- Chairman\n\nYeah. Well, we think we have our tax situation pretty much in hand with the sales that we've had in the past -- over this past year. And we don't really feel like we're paying taxes. I mean, because we liquidated Ceridian as an investment.\n\nWe're going to have a tax consequence on AmeriLife for a good portion of that investment. But we feel like we're pretty well-positioned right now relative to looking at inflation, looking at higher interest rates and then looking at our portfolio companies. And a number of them are just sort of immune to inflation and interest rates, they're recurring revenue models and they're kind of all part of our playbook and what we like to look for and what we'd like to invest in, which are companies that can be strong in really good times and be very dependable in time -- when times get a little tougher.\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nUnderstood. Thank you very much for the color.\n\nBill Foley -- Chairman\n\nYou bet.\n\nOperator\n\nOur next question comes from Chris Sakai with Singular Research. Please proceed.\n\nChris Sakai -- Singular Research -- Analyst\n\nHi. Good afternoon. I had a question on where are you seeing the best possible investment rather in either public or private markets and why?\n\nBill Foley -- Chairman\n\nYeah. We're moving now -- we have two SPACs that we have not been deployed. So we continue to look for SPAC opportunities, very difficult in today's environment, in today's market. People that are selling the company are, frankly, not particularly interested in partnering with the SPAC.\n\nSo we've -- and Rick can talk more about this if you'd like to, but we've really been doing lots of screens and looking hard at companies either take private or companies that are private that we can make investments in and or take control of. So Rick, do you want to add anything to that? Because you're the one --\n\nRick Massey -- Chief Executive Officer\n\nNo, that's all. Sorry. Go ahead, please.\n\nBill Foley -- Chairman\n\nNo. That's -- I'm waiting for you.\n\nRick Massey -- Chief Executive Officer\n\nNo. It's -- so if -- sorry. OK. The -- we've got some interesting companies where we've talked to management and you can -- they're all going to be around the bill model, subscription model, pinch point in the economy, very much a utility that if they don't open, the customer doesn't open.\n\nSame model, and we are looking at a handful of those. And some of them will not be surprising if we get them done and maybe a couple of them might be. But we're -- there's a lot of good stuff out there and a lot of people that want to partner with Bill. So --\n\nChris Sakai -- Singular Research -- Analyst\n\nOK. Thanks. And then do you have an idea about how many new acquisitions or investments you've made?\n\nBill Foley -- Chairman\n\nWell, I mean, I can take that. We're trying to look for investments in the $100 million to $300 million range. And it really depends upon monetization of various assets and our buyback program. So our goal is to do two or three of these investments a year and kind of build up our portfolio and not build it up in the way we possibly have in the past through the SPAC acquisitions in the backstopping that we had done with Alight -- Alight and Paysafe.\n\nSo we're -- we've moved away from that model. And the market is -- the market is difficult right now. So we have to navigate the market and navigate inflation and interest rates.\n\nChris Sakai -- Singular Research -- Analyst\n\nOK, great. Thanks for your answers.\n\nOperator\n\nOur next question comes from John Campbell with Stephens. Please proceed.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nHey, guys. Thanks for the extra question. Maybe this is a question for Bryan. This is just a housekeeping question, but it looks like you closed the quarter, $75 million in cash.\n\nI saw on the update letter, I guess, as of August 5, you guys had $190 million. If I add in that DNB monetization, I'm still come up maybe a little bit short. Is there anything to call out that makes up the difference between those two?\n\nBryan Coy -- Chief Financial Officer\n\nPaid management fees at the end of the quarter, but it should have been $75 million, plus like another $127 million on DNB less management fees should come out to exactly what we've got on the balance sheet now.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nOh, OK. I was taking a net with the management fees. OK. Makes sense.\n\nAnd then, Bill, on the Austerlitz 1 and 2, it does sound like -- finding a combination partner is probably a lot harder than it was last year around this time. But -- can you remind us what that process looks like if you don't find a partner? I think there's a two-year maybe time frame on that? And then what the mechanics look like? Is there a return to cash from the trust? What does that look like for you guys?\n\nBill Foley -- Chairman\n\nYes. You're exactly right. What happens after the two-year point, unless we get an extension from our investors, is that that money and trust is returned to the shareholders. And it's too bad because these are a couple of good acquisition candidates that we have in place, and we're working hard to find candidates to merge with.\n\nBut as you can imagine, in this kind of environment, it's difficult. It's not easy. And Rick is working really hard with Duke and Ryan Caswell, and we have several different candidates, but they all are process oriented. And we're working on all of them every day.\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nOK. That's helpful. Thank you, guys.\n\nOperator\n\nThank you. At this time, I would like to turn the call back over to Mr. Foley for closing comments.\n\nBill Foley -- Chairman\n\nThanks, operator, and thank you to everybody who joined our call today. While the future path of the market remains ambiguous, we will remain focused on what we can control, which is driving operational improvements across our portfolio companies through our playbook, buying back our shares given the steep discount to fair value, and finding exceptional investment opportunities in monetizing investments. Overall, we will remain nimble and adept in our approach to the opportunities that we see in the market as we strive to create long-term shareholder value. We look forward to speaking with all of you again on our third quarter 2022 earnings call.\n\nThanks again for your time today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJamie Lillis -- Investor Relations\n\nBill Foley -- Chairman\n\nJohn Campbell -- Stephens Inc. -- Analyst\n\nRick Massey -- Chief Executive Officer\n\nIan Zaffino -- Oppenheimer and Company -- Analyst\n\nChris Sakai -- Singular Research -- Analyst\n\nBryan Coy -- Chief Financial Officer\n\nMore CNNE analysis\n\nAll earnings call transcripts"
}