{
  "companyName": "Anheuser-Busch InBev NV",
  "companyTicker": "BUD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/anheuser-busch-inbev-nv-bud-q3-2022-earnings-call/",
  "content": "Anheuser-Busch InBev NV (BUD -0.56%)\nQ3 2022 Earnings Call\nOct 27, 2022, 9:00 a.m. ET\n\nOperator\n\nWelcome to Anheuser-Busch InBev's third quarter 2022 earnings conference call and webcast. Hosting the call today from AB InBev are Mr. Michel Doukeris, chief executive officer, and Mr. Fernando Tennenbaum, chief financial officer.\n\nTo access the slides accompanying today's call, please visit AB InBev's website at www.ab-inbev.com and click on the Investors tab and the Reports and Results Center page. Today's webcast will be available for on-demand playback later today. [Operator instructions] Some of the information provided during the conference call may contain statements of future expectations and other forward-looking statements. These expectations are based on management's current views and assumptions and involve known and unknown risks and uncertainties.\n\nIt is possible that AB InBev's actual results and financial condition may differ, possibly materially, from the anticipated results and financial condition indicated in these forward-looking statements. For a discussion of some of the risks and important factors that could affect AB InBev's future results, see risk factors in the company's latest annual report on Form 20-F filed with the Securities and Exchange Commission on the 18th of March 2022. AB InBev assumes no obligation to update or revise any forward-looking information provided during the conference call and shall not be liable for any action taken in reliance upon such information. It is now my pleasure to turn the floor over to Mr.\n\nMichel Doukeris. Sir, you may begin.\n\nMichel Doukeris -- Chief Executive Officer\n\nThank you, Jessie, and welcome, everyone to our third quarter 2022 earnings call. It is a great pleasure to be speaking with you all today. Today, Fernando and I will take you through our third quarter operating highlights and provide you with an update on the progress we've made in the execution of our strategic priorities. After that, we'll be happy to answer your questions.\n\nLet's start with our third quarter operating performance. We are very pleased with the continued momentum of our business and the strength of the beer category across our footprint, even in the context of the ongoing dynamic operating environment. Our volume momentum accelerated this quarter, driven by strong consumer demand for our brand portfolio, ongoing digital transformation, and increased investment in our brands. We delivered our best quarterly volume performance this year, with 3.7% volume growth.\n\nRevenue per hectoliter increased by 8%, driven by revenue management initiatives and premiumization across the majority of our markets, resulting in top line growth of 12.1%. EBITDA increased by 6.5%, as our top line growth was partially offset by anticipated transactional effects and commodity headwinds, increased sales and marketing investments in our brands. Normalized EPS was $0.81 and underlying EPS was $0.84. As a result of our performance and continued momentum, we are raising the bottom end of our 2022 EBITDA growth outlook from 4% to 8% to 6% to 8%.\n\nOur medium-term outlook remains unchanged. This quarter, we once again delivered broad-based growth with a top line increase in all five of our regions and volume growth in over 60% of our markets. Our diverse geographic footprint provides a unique combination of growth and reliable cash flow generation, positioning us well to deliver superior value creation. Now let me share some highlights from our key markets.\n\nIn the US, the beer industry remains resilient with volume trends improving throughout the year in all major beer segments, even in the current inflationary environment. Our business delivered another quarter of top line growth and strong cash flow generation. Our above core beer portfolio outperformed the industry, gaining share within the segment for the third quarter in a row, led by Michelob ULTRA, which grew volumes by double-digits. Our STR volumes declined by 1.7%, estimated to be below the industry.\n\nWithin the experience-based ready-to-drink segment, our portfolio continued to outperform the industry, with both Cutwater and NUTRL growing is strong double-digits. We continue to make progress in our commercial strategy with over 40% of our revenues now coming from both core beer and Beyond Beer brands. In Mexico, we accelerated our market share gains and delivered a third consecutive quarter of double-digit top and bottom line growth. Our volumes grew by more than 10%, with growth across all segments of our portfolio, led by both core, which delivered volume growth in the high 20s.\n\nIn Colombia, we delivered double-digit top and high single-digit bottom line growth and continue to expand the beer category, again, reaching all-time high per capita consumption. We delivered volume growth across all segments of our portfolio with our premium and super-premium brands growing volumes in the high teens, reaching all-time high volume and share of our total revenue. Our business in Brazil delivered double-digit top and bottom line growth with EBITDA margin expansion. Our premium and super-premium brands continued to outperform this quarter, delivering high single-digit volume growth.\n\nTotal beer volumes were flat as we cycled a strong performance year-over-year. Digital transformation continues to make progress with over 70% of our BEES customers, now also BEES marketplace buyers and our digital Zé Delivery product reaching 4.3 million monthly active users. In Europe, we grew topline by double-digits, driven by volume growth, revenue management initiatives, and on-premise recovery. Our portfolio continues to premiumize with growth this quarter led by our premium and super-premium brands.\n\nEBITDA declined by mid-single-digits as topline growth was offset by elevated cost pressures and increased sales and marketing investments to support our premium strategy and FIFA World Cup activations. Our business in South Africa grew both top and bottom-line by double-digits this quarter. We delivered growth across all segments of our portfolio, led by over 30% revenue growth in our leading core brand, Carling Black Label. Our premium, super-premium and Beyond Beer portfolios all delivered a double-digit increase in volumes.\n\nWe are investing in capacity expansion to support our growth in South Africa. In China, COVID-19 restrictions continued to disproportionately impact our key regions and sales channels. Underlying consumer demand remains consistent with volumes growing by 3.6%. We continue to invest in our strategy, geographic expansion, premiumization in digital transformation.\n\nIn our priority expansion cities, excluding those impacted by restrictions, Budweiser and our super-premium portfolio grew volume by double-digits. Premiumization of the beer industry in China remains an exciting long-term value creation opportunity. We continue to make progress across our ESG priorities with highlights this quarter, including in recognition of our global water stewardship initiatives we are proud to recently be included on Fortune's Change the World list. We have achieved carbon neutrality at eight facilities to-date and continue to drive deep decarbonization across our value chain.\n\nWe brought together key packaging and raw material suppliers that account for over 50% of our Scope 3 emissions to share best practice and take collective climate action through our global supplier collaboration initiatives called Eclipse. Now let's move on to our strategic pillars. Let's start with Pillar 1 of our strategy, lead and grow the category. Our creative marketing capabilities continue to be recognized.\n\nFollowing our best-ever performance at this year Cannes Lions International Festival of Creativity, we were recently named as the world's most effective marketer in the Global Effie Effectiveness Index for the first time. This combination of best-in-class creative brand-building capabilities and effective marketing are driving strong consumer connections with our brands and enabling our accelerated topline growth. A big congratulations to our teams and partners for this extraordinary achievement. We continue to execute on our five levers to drive category expansion.\n\nAnd by making the category more inclusive, offering superior corporate positions, developing consumption occasions, and expanding our premium and Beyond Beer portfolios. We delivered another quarter of consistent and profitable top line growth. Our global brands continue to drive premiumization across our markets. The combined revenues of Corona, Stella Artois, and Budweiser grew by 12.7% outside of the brands markets, led by Corona with 23.5% growth.\n\nTo illustrate our portfolio development and execution are driving growth, I would like to take you through three examples from our market expansion model. Let me start with an emerging market example, Zambia. In emerging markets like Zambia, our primary objective is to make the category more inclusive by developing superior core propositions, introducing premium and Beyond Beer brands. Over the last five years, we have expanded our portfolio with a broader range of offerings, expanding price in different segments and consumption occasions.\n\nPer capita consumption of the formal beer category has increased by approximately two liters with significant headroom for growth. Whilst still in the early stage of premiumization journey, our both core portfolio has increased its share of our revenue by over 300 basis points to reach approximately 23% today. Category expansion and market share gains have resulted in the consistent growth of our business, increasing volumes at an 8.7% CAGR since 2018. Now let's take a look at one of the key developing markets in our portfolio, Mexico.\n\nBy consistently investing in our portfolio development, we are unlocking the full potential of the beer category. We are now offering a more complete range of brands and packs across core to reach more consumers in more occasions and leading the development of premium and Beyond Beer segments. The development of the business in Mexico is truly remarkable. Beer per capita consumption continues to grow, and our volumes have consistently outperformed the industry, growing at 5.6% CAGR since 2017.\n\nOur core brands continue to lead the industry, while our above core portfolio is leading premiumization. And now moving on to an example from one of our developed markets, the U.S. In the U.S., we are at half time of our 10-year plan to rebalance the portfolio toward the growing segments of the market. Five years ago, the portfolio was over-indexed to declining segments in the industry.\n\nTo date, as we continue to rebalance and enhance our portfolio, we are better positioned across all segments of the market. To accelerate growth, we are focused on our priority mega brands. Within mainstream over the last five years, we stabilized our share, Busch Light is one of the top five share gainers in beer industry since 2019 and has gained share of beer for the last 15 quarters in a row. Busch Light remains the number one brand in volume and brand power.\n\nOur above core portfolio continues to improve performance and is gaining share in the last three quarters. Michelob ULTRA doubled volume in the last five years, becoming the second largest brand in the industry and continues to grow double-digits. In the premium segment, Stella Artois, Kona Big Wave, and Estrella Jalisco are growing volumes in the high single-digits. Within the beer, we now have two of the strongest propositions in the fastest-growing spaces of the category, with Cutwater in NUTRL.\n\nIn 2017, 27% of our revenues came from the both Core and Beyond Beer segments. To-date, these segments make up over 40% and have been key contributors to approximately $800 million in revenue growth over the last five years. As a result of this portfolio rebalancing, our business has now delivered revenue growth in eight of the last nine quarters. As we enter the second half of our 10-year plan, we have a healthier portfolio positioned for growth and expect to engage in a multiyear increase in commercial investments, to accelerate our portfolio rebalancing.\n\nNow let's turn to our second strategic pillar, digitize and monetize our ecosystem. This continues to accelerate, usage and reach, capturing $7.7 billion in GMV this quarter, a 40% increase year-over-year. This is now available in 19 markets, reaching 3.1 million monthly active users and generating over 1.8 million orders per week. In 14 of the 19 markets, our customers are also able to purchase third-party products through this marketplace.\n\nCustomer adoption is increasing and 44% of these customers in these markets are now also this marketplace buyers. Today, we have over 200 partners providing more than 500 brands through the platform, generating September annualized run rate revenue of approximately $850 million. This winning partnership empowers our customers to grow by the benefits of digital inclusion and enables our partners to benefit from our world-class platform and route to market and highly engaged this user base. Now let's talk about direct-to-consumer.\n\nOur digital direct-to-consumer products, Ze Delivery, TaDa, and PerfectDraft are now available in 17 markets and generated over $100 million in revenue and 17 million orders this quarter. With that, I would like to hand it over to Fernando to discuss the third pillar of our strategy, optimizing our business. Fernando?\n\nFernando Tennenbaum -- Chief Financial Officer\n\nThank you, Michel. Good morning, good afternoon, everyone. We aim to maximize value by focusing on three areas; one, optimized resource allocation; two, robust risk management; and three, efficient capital structure. With respect to capital allocation, we aim to maximize long-term value creation by dynamically balancing our priorities.\n\nWe continue to invest in organic growth and support our strategy to lead and grow the category and digitize and monetize our ecosystem. The excess cash generated by our business is then dynamically allocated to our other three capital allocation priorities, deleveraging, selective M&A and return of capital to shareholders. Our debt maturity profile remains well distributed with no bond maturities in 2022 and 2023 and no relevant medium-term refinancing needs. If you look at our debt maturity profile, we have US$2.8 billion of bonds maturing through 2025 and more than sufficient liquidity today to redeem all of these bonds.\n\nOur bond portfolio has an average pre-tax coupon of around 4% and a weighted average maturity of approximately 16 years. Moreover, our debt portfolio does not have any financial covenants and is comprised of a variety of currencies, diversifying our FX risk. 94% of our bonds have a fixed rate, insulated from interest rate volatility and inflation. Now let me take you through the drivers of our underlying EPS for the quarter.\n\nUnderlying EPS was stable at $0.84 per share, $0.01 lower than the third quarter last year. Organic EBITDA growth accounted for a $0.17 per share increase, but was partially offset by $0.12, primarily from translational effects. Higher depreciation and amortization accounted for $0.03. As we continue to deleverage, our net interest expense has reduced contributing a $0.04 improvement.\n\nOther financial results reduced EPS by $0.08, largely due to higher cost of hedging, driven by a higher interest rate environment. I'll now hand it back to Michel for some final comments. Michel?\n\nMichel Doukeris -- Chief Executive Officer\n\nThanks, Fernando. Allow me to take a few minutes to recap my key takeaways for the quarter and how we are continuing to meet the moment. The beer category continues to demonstrate its strength and is gaining share of throat globally. Our business has momentum.\n\nWe delivered our best quarterly volume performance of the year, with growth in over 60% of our markets. This is now present in 19 countries. This marketplace is gaining traction. We finalized run rate revenues of U.S.\n\n$850 million. Our industry-leading portfolio of brands, revenue management capabilities and operational excellence enabled us to navigate the inflationary environment. We continue to execute our strategy and delivered 8% net revenue per hectoliter growth this quarter. Looking ahead to the opportunities to activate demand, I could not be more excited for what we have coming in the fourth quarter.\n\nThis is a unique moment for us as a company and for me as a lifelong football fan and beer water. In less than a month, I will be one of the billions of fans watching the FIFA World Cup Qatar, the largest global sporting event. And we are ready to connect people around the world through our shared passion for football and beer. Budweiser, the official beer of the FIFA World Cup is kicking off its most ambitious global campaign yet.\n\nOur leading core brands, like Brahma in Brazil, Jupiler in Belgium, and Quilmes in Argentina, we'll be leaning into our national King partnerships, supporting local retailers and SaaS. These campaigns will be executed in over 70 countries and 1.2 million points of sales. We will also be creating new consumer experience, such as the biggest digital campaign in our history. We are engaging with more customers through bids and we have launched direct-to-consumer activations through Zé Delivery and TaDa.\n\nI could not be more excited and proud of our team and partners. The future with more cheers is right around the corner. Before I hand it back to Jessie to begin the Q&A session, let me share with you a short video that really brings FIFA and our campaigns to light. [Commercial break]\n\nOperator\n\n[Operator instructions] Our first question is coming from the line of James Edwardes Jones with RBC. Please proceed with your question.\n\nJames Edwardes Jones -- RBC Capital Markets -- Analyst\n\nGood morning and afternoon. Two questions, please. The business has got momentum, Michel, as you're saying. But are you concerned about the wider economic context you're operating in? And is that going to detract from that momentum? And secondly, I suppose one for Fernando please, the proportion of your debt denominator in euros has fallen from 33% the last year and to 25% at the end of September.\n\nIs that purely a reflection of the euros depreciation, or is there anything more than that going on?\n\nMichel Doukeris -- Chief Executive Officer\n\nHey, James, good morning, good afternoon, everybody. I'll take the first one and hand it over to Fernando to complement on the second question. I think there are two parts to this answer. The first one is we must focus on what we can control.\n\nAnd what we can control, what we see is business momentum, and this business momentum has to do with the execution of our strategy and everything that we've been discussing over the last quarters and in our meetings. So we are really focused on the category, balancing well our revenue strategy, investments in our brands and the acceleration of our digital transformation. So we can continue to lead and grow the category. Of course, the consumer confidence, inflationary environment gets us to be carefully balancing each and every piece of our strategy, while we continue to be, again, focused on what we can control, and what we can control is the execution of our strategy.\n\nFernando Tennenbaum -- Chief Financial Officer\n\nAnd James, on your second question, Fernando here. So our debt, it's mostly the euro depreciation. So that's the biggest impact you see there. But probably it's worthwhile calling out the attention because the euro depreciation is probably why you see happening on the balance sheet, and that's the one you see the impact that you've seen on our income statement flowing through the interest line.\n\nWe don't see and there is a huge economic benefit toward highlighting is the rising rate environment, our bonds were trading in the beginning of the year at around 120% of par. And now given the rate environment, they are trading a little bit lower on average than 90% of par. And given that we continue to deleverage and we are buying back bonds, it means that each dollar that we buyback of debt is worth more than $1. And if you apply the math in our whole portfolio, you see that the interest rate component has a much bigger economic benefit, the raising interest rate environment than any FX swings.\n\nJames Edwardes Jones -- RBC Capital Markets -- Analyst\n\nThat's very interesting. Thank you.\n\nOperator\n\nThank you. Our next question is coming from Simon Hales with Citi. Please proceed with your question.\n\nSimon Hales -- Citi -- Analyst\n\nThank you, Michel and Fernando. Two for me as well, please. Obviously, we're getting close to the end of 2022 now. I wonder Fernando, whether you could share any thoughts at all on your outlook for COGS as we move into 2023.\n\nI appreciate you might not want to give any specific inflation guidance on COGS, but maybe a directional steer on 2023 COGS versus 2022 would be helpful? And then secondly, Michel, maybe coming back to the comments you were making at the end around the World Cup. Can you talk a little bit about the phasing perhaps of spend and activations into the World Cup, should we expect to see a big step up in Q4 on marketing spend and SG&A in general as a number of that, or big part of that spend already being felt in Q3 as well in preparation.\n\nFernando Tennenbaum -- Chief Financial Officer\n\nThanks, Simon. Fernando here. So on your first question on COGS, of course, we are not giving any outlook so far. But what we commented on the last earnings call still holds true, which given if we look at the spot rates today, you are likely to still have some pressures next year, but to a lesser extent than the pressures we had this year.\n\nAnd if you want to look around the world, it's not the same magnitude, probably the region that is most impacted next year is going to be Europe. It's disproportionately impacted because of energy costs and because of agricultural barley costs. But what we said in the last quarter still holds through some pressure, but to a lesser extent than the ones that we saw this year. Michel?\n\nMichel Doukeris -- Chief Executive Officer\n\nSimon, good morning, good afternoon. Thanks for the question. I think that on FIFA, maybe getting from the beginning, the main point, I've been talking about this similar challenge and opportunities that we would be facing this year on the operating environment and so far it's been real as well as the opportunities with the comeback of the own trade with marquee events returning. And as you travel around the globe, is being very tough to buy tickets to be able to go to any concert or sport events.\n\nAnd we've been planning and working very hard for FIFA and that's going to be by far the biggest category activation opportunity in the year, the biggest sports event in the year, and we will do this across 70 countries and many of our brands. And in order to do with being heavy upping expenses, so already in the quarter three, but also in the quarter four. So I would say that our sales and marketing this year will be more skewed toward the second half as always happens when we have FIFA years, we concentrate more investments across this big activation, so quarter three, quarter four. But at the same time, it's not only more investments because we last year invested more than our brands and this year, we invest more on our brands as well, but it's becoming more effective.\n\nAnd as we digitally transform as added and sharper creative and focus on the key brands on our portfolio segments, we've been striking a balance of both, not only higher support and more money being invested but in a more efficient way. But directly answer your question, second half, heavier investments than first half in order to be able to support this huge moment and huge category opportunity for beer consumption.\n\nSimon Hales -- Citi -- Analyst\n\nGot it. Very helpful. Thank you.\n\nOperator\n\nThank you. Our next question is coming from the line of Tristan van Strien with Redburn Partners. Please proceed with your question.\n\nTristan van Strien -- Redburn Partners -- Analyst\n\nHi, Michel and Fernando. Two for me as well, please. I think just first to follow-up on the environment. It seems like the consumer is very confident in places like Mexico and Brazil and even mentioned Zambia here and it's reflected in the beer sales, can you just maybe give a bit more content to that? I mean, is there a continent consumer? Are they, kind of, protected from what's happening in the developed world? Is this sustainable? So some views on that as we look over the next few quarters, what you're seeing on the ground? And the second question, just going back to the developed world on the US.\n\nThere have been a few comments, I think, by one of your competitors, one of smaller ones, who is saying that traditional beer, as we know it may never grow again in our lifetime in the US. I would love to hear your view on that, what your thinking is on that? And also, as I look at your slide on the US, I think, it's the first time you've spoken about Kona and Stella Artois, what are you seeing those brands to kind of reinvigorate the beer category? And why you're pushing them as you go into 2023? Thanks.\n\nFernando Tennenbaum -- Chief Financial Officer\n\nHey, Tristan. Good afternoon and thank you for the question. I think that I got here three. I'll try to answer them even though there is some correlation.\n\nI think that on the first and the second, they are somehow interconnected. I think that when we look at the beer category, and I keep on repeating that based on the data that we have and what we are seeing out there, beer category is very resilient, and it's been proving this over the years. You look back in time across all type of economic environment. And even during the pandemic, we discussed at this big time.\n\nThe category is very resilient. And yes, it's true that inflation is a global thing. It is different on a country-by-country, and it's different region-by-region. And you see anywhere like 80% inflation in Argentina to 2% inflation in China.\n\nSo yes, there is global inflation, but the inflation is different market-to-market. Is also true that, the knowledge of consumers and all stakeholders, including the government, central banks to deal with this inflation is being built differently over the years on a country-by-country basis. That's why you see consumer confidence index, different because of the different reality of the inflation and the preparation that people have to deal with that being different on a country-by-country. You are talking about that, but Latin America has been so far a place where both consumer confidence is higher, but inflation is less impact for them.\n\nIt is, for example, to the extremes of what you're seeing in Europe and somehow in North America. And what is very different during this time is that employment is very high. It doesn't matter where you go or at least it's more normal whenever evolves. So consumers are holding stronger evidence.\n\nI think that you can see that our volume in the quarter was the best this year and was broad-based, like 60% of our markets had volume growth, which is very good for a given quarter. We think that if you then pivot and you talk a little bit about the US, the industry in the US is not only resilient, but it is big, is profitable. It continues to premiumize, and it is incredibly dynamic, right? So it's a market that keep on reinventing itself and proposing new ways for consumers to interact and to be with the industry. So much so, you published the other day, and I read your report, the industry continues to be in good shape, growing revenues.\n\nAnd of course, there is a lot of dynamics playing inside the industry, right? One of the dynamics is the emerging beyond space, flavored beverage force category, whatever people call and time to time, there are some different calls around this industry, right? So a year ago or two years ago, people are discussing sales serve becoming like 100% of the image or whatever the number was. You remember that I told more than once that I didn't believe that that would happen. And yes, beyond beer will continue to add consumers and growth to the industry, which is very exciting because they don't bear space, sources from wine sources on spirits and is more similar to the beer industry that we all are part of, and this brings more growth, growth for retailers, growth for wholesalers and growth for the beer players. I think that beer as an industry is incredibly relevant for our wholesalers, for our retailers, and they need to get behind as they do behind the industry and behind the players that invest and work to make this industry a better industry.\n\nIn what I can speak on our behalf as committed as ever investing as always. And we talked about this on the last meeting that we have with our wholesale as we call the EM meeting, and we talked a little bit here as we were showing the examples of the category growth. We are engaging on a multiyear investment increase in the U.S. because we are right at the half time of our 10-year plan.\n\nIn the first five years, we managed to stabilize the Xhaleminstream. We got our above core portfolio to be from 27% to 41% of our revenues. We have today brand that connects with Kona, Estrella Jalisco, Cutwater that position us much better for the growing parts of the industry. So it's about second half going strong, invest more and accelerate growth.\n\nAnd in this scenario, Estrella Jalisco today, fastest growing Mexican brand in the U.S. only present in markets where we started developing the brand such as California, Arizona, and Texas, but with a huge headroom for growth. And Kona is an incredible lifestyle brand as a Jalisco Cutwater that has a lot of space in cementation. We are very happy with the acquisition, the partnership that we have with CBA and Kona is growing double digits, strong.\n\nIt's an incredible brand. People love as much as we love the brand. So beer industry in the U.S. is big, profitable, resilient very relevant for our wholesalers and retailers, and we are fully committed to continue to support them and invest for growth.\n\nTristan van Strien -- Redburn Partners -- Analyst\n\nThank you, Michel. Very clear.\n\nOperator\n\nThank you. Our next question is coming from the line of Mitch Collett with Deutsche Bank. Please proceed with your question.\n\nMitch Collett -- Deutsche Bank -- Analyst\n\nHi, Michel. Hi, Fernando. I've got two questions. So F '22 face quite a few challenges.\n\nYou've had more lockdowns persisting in China, very significant raw material inflation some headwinds in Brazil from the delayed Carnival. But you're now able to guide to EBITDA growth in the top end of your medium-term guidance range. So if you can achieve in the top end of your range given those challenges, how does that make you think about the validity of that range going forward in what might be a more normal year? And then my second question is on the spirits-based RTDs in the US, which I think you were just talking about. But that category is achieving explosive growth, and you seem to be gaining from it with Cutwater and NUTRL, I know you said in the presentation that above is 40% of your U.S.\n\nrevenue. Can you just give us the proportion of your U.S. revenue that is spirits-based RTDs and then perhaps a bit more color on the growth, which I think you said was double-digit? Thank you.\n\nFernando Tennenbaum -- Chief Financial Officer\n\nHi, Mitch, Fernando here. Let me get the first one. Your question on guidance, you're right, there's been a very dynamic year, but it's fair to say that the business continues to have momentum. And when we look at the year-to-date performance, and the momentum that we have in our business, we feel it was appropriate to raise the bottom end of our EBITDA guidance for outlook for this year from 4% to 6% to 8%.\n\nWe also mentioned that our medium-term outlook remains unchanged. And whenever we talk about outlook, it's good to take a step back and understand why we decided to provide an outlook. At the end of the day, when we had our investor seminar last year, we made a clear evolution of our strategy when we move it from more inorganic an organic one. And given that we're moving to an organic strategy, which would require us to invest to lead and grow the beer category.\n\nInvestor event on digital transformation and we do all of that to are dynamically allocating resources to grow and optimize our business while we're still deleveraging. It would be important to give confidence what one would expect as an algorithm for ABI. That's why as providing the outlook. And of course, now we just adjusted the full year 2022 given the momentum and given the performance so far.\n\nFor the medium term, it remains unchanged. And next year, when we get to the full year-end release, we make a decision where we make any different outlook for the year of 2023, but no update so far.\n\nMichel Doukeris -- Chief Executive Officer\n\nYeah, Mitch. Just complementing this answer the Fernando gave to you Anheuser-Busch InBev I think that in a way, each year will be different if it's set us challenge and equal opportunities. And as we put together our strategy, we are really focused in controlling what we can control. And in order to execute this strategy, we need to have investments, and we'll be always balancing the risks and opportunities, while giving certainty to people that their financial discipline will continue to be always there, and that's why we provided this outlook, which as Fernando said, remains unchanged to the midterm.\n\nOn the RTD space, this in a way connects with Tristan's question at the beginning, on the brands and how the market is evolving. So this won't be a space ready-to-drink beverage in the U.S. is a reality. It will be part of the industry will continue to happen, but the manifestation in what beverage types of liquids, it will be always changing a little bit.\n\nright? So we have seen different ways in different type of beverage and liquids there. And I think that at this time, a being the U.S. ABI we are not only well positioned because we got very early into the trend of Cutwater and NUTRL, but we have a good combination of understanding on how this will evolve. The right brands that we've been investing to develop and it's been growing very well.\n\nFor us today, give or take analyzed sales, let's say, $150 million and growing ahead of the industry, high double digits. So very promising is still in the big scheme of things of the U.S. is small to the total revenues that we have, but relevant for the growth giving the speed in which is growing. And again, in the complex cocktail ready-to-drink Cutwater is the leading brand today, and NUTRL, is a leading brand in Canada.\n\nWe are in the need of the rollout in the US, but everything that we see in terms of performance looks very good, and the brand is incredible. So we are very optimistic for what it can bring to us next year and beyond.\n\nMitch Collett -- Deutsche Bank -- Analyst\n\nIt's very helpful. Thank you, guys.\n\nOperator\n\nThank you. Our next question is coming from the line of Brett Cooper with Consumer Edge Research. Please proceed with your question.\n\nBrett Cooper -- Consumer Edge Research -- Analyst\n\nThanks for taking the question. Just a quick one. I was hoping you can help us understand the performance beer category and beer brands specifically in outlets using these marketplace versus those outlets where they're not using it. Thanks.\n\nMichel Doukeris -- Chief Executive Officer\n\nSo let me try to give you a couple of points here on that. So this is in 19 countries. And in these 19 countries, we have a very high adoption so much so that in most of them, we are already above 80%, 90%. Marketplace is today in 14 countries and more than 40% of the customers are now also these Marketplace buyers and the traction is improving, meaning more and more best customers are buying in marketplace.\n\nThe traction is coming as well if you think about the flight. We also get customers to buy and you attract more partners, so today, more than 200 partners have joined us in the different places and they provide more than 500 brands products option for our customers to buy within the Marketplace. And the reality is quite straight forward because this is making us more effective on the point of sales. So we've been able to sell more of our portfolio and the beer category is performing better, where we have this as a tool and when we have Marketplace, you have a more engaged customer.\n\nSo the points of sales, they use more of the two. They have more transactions. They buy more from us being direct first-party type, when we sell the products or when you just commercialize the products and the other companies, third-party delivered. And because they are more engaged, they are performing better, where we have marketplace than where we don't have, then when we don't have this.\n\nSo it's like a flywheel that gets better, the more the customer engages with us, the better our business is with them. And because we are enabling them with digital inclusion what happens is that they have a better portfolio to sell, at the service level from the companies. They can then attract more consumers. And they can grow their business and have a better impact in their communities.\n\nSo we are very excited with this possibility of including the customers digitally and making them more profitable, bigger more successful as business owners.\n\nOperator\n\nThank you. Move on to our next question, which is coming from the line of Laurence Whyatt with Barclays. Please proceed with your question.\n\nLaurence Whyatt -- Barclays -- Analyst\n\nHi, Michel, Fernando. Thanks so much for the question. Two also for me following on Biz. First one, in Brazil, it's one of your more mature markets on Biz, you don't appear to have taken any material market share despite your competitors not having similar platforms.\n\nSo just wondering if there's anything we're missing there or whether that should be expected to happen? And then secondly, you recently started disclosing your Biz in China, going to around 10% now. I think you said -- how do you expect the Chinese market to be any different to the markets you're already in Biz or how is it different? And could you get to similar levels in China as you do in your mature markets? You say sort of 90% of your customers using digital methods? Thank you very much.\n\nFernando Tennenbaum -- Chief Financial Officer\n\nHey, Laurence. Thanks for the question. I'll get the first one. And then, talk a little bit more about China, as I build on the answer for the first question.\n\nSo I think that Biz is all about getting our customers to be more, digital having a better service level, understand better what are the opportunities to make their business grow and try, right? Because we drive when our communities strive and we grow when our customers grow. And this is an enabler for them to get better businesses and to make a more profitable business for themselves. Of course, in doing so, we can get our business as well to perform better with these customers, and this is what you see across all 19 countries where Biz is operating today. You see a more driving environment for the small and medium enterprises.\n\nAnd you see that the beer category is performing better. And therefore, as a consequence, our business is performing better as well. When you think about China, and I have mentioned this before, in one of the calls, answering one of the questions from our colleagues here that I can simplify how Biz is moving globally to you, thinking about three different clusters. The closest number one is what we call the direct distribution operations, where we can think of Brazil, you can think of Mexico, Argentina, mostly and these markets, because we have direct distribution, one, ERP system integration is very quick, and we scaled it up very fast over the last two years.\n\nThe second cluster is the product that we are developing for large key accounts, so we can improve these electronic transactions EDI systems that we have is called Biz link is in the development. And once we get these large accounts to be with a better system, I always compare like the land line phones that we had in the past with the modern iPhones, right? So there is a lot of opportunities to get the EDI system of the big accounts today to be much more modern because they are in place for 20 years. and they didn't change a lot. They don't have the data, they don't have AI, all the possibilities that we have today as we improve them.\n\nAnd then the third wave is the wave of indirect markets. And in the indirect market is where you have a three-tier system, not all 3-tier systems are equal, but you have us, you have the wholesalers and then you have the point of sales. In China, the U.S. they fall into this third wave.\n\nIn China today, we have like 15%, let's say, of our sales already in this, because the ecosystem in China is very different for all technologies tested, we are developing a lot of things in China following the standard product and the same products, algorithms, and AI that we have in the other markets, but building and hosting this in China. And because of the wholesaler system there and the structure of the market, those are the markets that we need to first develop choose places that we go and then roll it out and scale in a stage and way market-by-market for salable wholesaler state-by-state. At the beginning, that is more customization because we need to make the transformation. But our teams, they evolved a lot in the way that they learned and how to roll this fast, and now we are in scaling up mode in China.\n\nThe benefits for the customers will be pretty similar across all markets because it will empower them digitally. We'll give them more tools to manage their business. a superior portfolio and service level. And for us, of course, if this works, so more subside customers.\n\nWe will have a better category. It doesn't matter China, Brazil, US. And if the category is better and the customers are more empowered than growing our business will also benefit and growth. So the model for China, the wave of China is the third wave of the first one.\n\nYes, the benefits and outcomes that we expect are very similar, better for customers, more empowered digitally a better category development vibrant with more tools to activate and as a consequence, a better business for us to be part of.\n\nLaurence Whyatt -- Barclays -- Analyst\n\nThat's all really clear, Michel.\n\nOperator\n\nThank you. Our next question is coming from the line of Rob Ottenstein with Evercore. Please proceed with your question.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nGreat. Thank you very much. Two questions. First, I was surprised about how well Budweiser did globally given the fact that a lot of its sales are in China, and China has been weak.\n\nSo could you please remind us what percentage of Budweiser sales are in the U.S. and outside of the U.S. roughly? And what's driving the global Budweiser growth, so that would be question number one. And then question number two is, there's always this ongoing debate about beer versus spirits, and clearly spirits are doing much better than beer in the US.\n\nCan you talk about what you're seeing now in the rest of the world, and maybe what markets beer is doing better and gaining share. You called out, I think, Colombia, any other markets would be helpful. Thank you.\n\nMichel Doukeris -- Chief Executive Officer\n\nRobert, good morning. Thank you for the questions. I'll try to address both here. Yes, you know that we don't disclose absolute numbers, percentages by country region.\n\nBut definitely, the two largest markets global for Budweiser are the U.S. and China. So you know this correctly. And the brand overall globally is very healthy.\n\nYou see even in the US, the brand power and the share of segment is probably having the last two years, the best performance in more than 20 years. In China, the brand remains very solid, demand when you are outside the lockdowns remain solid. When you get the cities that we are expanding that are not facing any lockdowns, the growth is very healthy, and the brand is growing in other markets across the globe. So you can think about Nigeria.\n\nYou can think about France, the UK, you can think about the Latin American countries where we have the brand. So the brand continues to perform, expand globally and the largest utilization for the year will be actually in the quarter four, because Budweiser is the sponsor of FIFA World Cup, and we are activating 70 countries and is the largest activation for the Budweiser brand yet. So it's going to be a very exciting moment for Budweiser in the quarter four. And we've been discussing this and sharing data with you all IWSR data and Euromonitor data.\n\nAnd beer globally is gaining share of throat. We have many countries, which is true. It's not one or two countries. Beer is gaining share of throat from most spirits, the low-end spirits across many countries.\n\nIn Europe, you see beer gaining share of throat this year from wine is one of the reasons why volumes are growing in Europe despite of all inflation and pressures in the market there. And in the US, what you see today is beer much more stable than what was a few years ago. So we saw during the pandemic and post-pandemic beer growing penetration and participation and the category is more stable. When you add on that, the ready-to-drink beverage, the so-called fourth category, gaining space, and today a lot of the growth for spirits that we are mentioning is coming from the ready-to-drink cocktails.\n\nSo it's good to have Cutwater there, growing double digit. Having neutral there accelerating and growing also ahead of the industry for this segment and excited with the opportunities and headroom you know that we have a very diversified geographical footprint. My view is that in sometime it is underappreciated, but all the growth opportunity in Latin America, in Africa and in Asia that we have not only for volume, but for growth in premium beer, it's incredible. And premium beer is growing faster than premium spirits globally.\n\nThese are fact, again, as much as beer gaining share of growth when you do the apples-and-apples comparison. Premium spirits and premium beers, premium beer is growing ahead of premiums spirits and has even more headroom for growth as Latin America premiumizes as the U.S. continues to premiumize and the rest of the world is almost untapped opportunities for premium beers. So great momentum there for the category, proving to be not only big, profitable, but also resilient its incredible opportunities to continue to premiumize.\n\nSo much so that Corona revenues grew 23.5% this quarter. So a number for us to remember as well on how big the opportunity is for us to continue to premiumize the category globally. Thanks for the question.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nThat's terrific. Thank you.\n\nOperator\n\nThank you. Our final question is coming from the line of Trevor Stirling with Bernstein. Please proceed with your question.\n\nTrevor Stirling -- AllianceBernstein -- Analyst\n\nHi. I've got two questions, please, Michel and Fernando, considering regional performance. The first one is, I think, virtually every region had margin compression of one form or another, but it looked like the margin compression was worst in Middle Americas. And I wonder could you give us some color about why Middle Americas came under such pressure? And same thing in Brazil, I think, beer volumes were flat, but premium was up high single-digits or flow was up mid-single-digit, but was at the economy end of the portfolio that was weak?\n\nFernando Tennenbaum -- Chief Financial Officer\n\nYes, Trevor, if I got the two questions correct there, let me start with the Middle Americas. I think that two-fold on this answer. One as we've been talking about the inflationary costs for next year being overweighted on Europe. As we came from the 2021 to 2022 both the costs and the supply chain disruptions, they were not equal distributed across all markets.\n\nAnd Middle Americas, overall, when you cut from Colombia, all the way up to Mexico is growing a lot. And this growth requires both infrastructure of suppliers as well as time to accommodate all the disruptions that we saw during the COVID period. And because of that the costs there this quarter and over 2022 were more accentuated than other markets. And as we continue to grow, we are accelerating both top-line and bottom-line in a very healthy way, generating very good cash flow growth, while the margins in the short-term are under pressure.\n\nBut you know my answer to that. I like our margins. They have a very clear reason why do they exist is like based on our market positions, the strength of our brands and how efficient our operations are. So we'll continue to grow in Middle Americas and margins tend to revert as all the supply chain disruptions.\n\nAnd as we settle and get more organized with the investments that we've been doing for partners to have the correct supply footprint there. The second one, more in Brazil. I think that in Brazil, the story is very simple. We've been growing volumes and topline in a very strong manner.\n\nLast year, all-time high on the quarter three, four. This year, we are in line with these high numbers. Premium is growing faster than value and core and you see that our core plus propositions and here, namely Spartan is having a terrific, fantastic year in Brazil, growing a lot and leading the growth of the portfolio, while the value part of the portfolio is growing less because the core is also very healthy in Brazil with Brahma performing very well. So it's more like the growth and the performance so far is being led by the core and above.\n\nAnd because we are facing very good industry numbers and our own numbers from last year, the value part of the portfolio is versus last year underperforming.\n\nTrevor Stirling -- AllianceBernstein -- Analyst\n\nUnderstood. Thank you very much, Michel.\n\nMichel Doukeris -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We have reached the end of our question-and-answer session. So I'd now like to pass the floor back over to Mr. Doukeris for any additional closing remarks.\n\nMichel Doukeris -- Chief Executive Officer\n\nHey. Thank you, Jesse, and thank you, everyone, for joining us today and for your time and the other going partnership and support for our business. I hope you have great week, and you are all as excited as I am for FIFA and what's coming in the quarter four. So thank you again.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichel Doukeris -- Chief Executive Officer\n\nFernando Tennenbaum -- Chief Financial Officer\n\nJames Edwardes Jones -- RBC Capital Markets -- Analyst\n\nSimon Hales -- Citi -- Analyst\n\nTristan van Strien -- Redburn Partners -- Analyst\n\nMitch Collett -- Deutsche Bank -- Analyst\n\nBrett Cooper -- Consumer Edge Research -- Analyst\n\nLaurence Whyatt -- Barclays -- Analyst\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nTrevor Stirling -- AllianceBernstein -- Analyst\n\nMore BUD analysis\n\nAll earnings call transcripts"
}