{
  "companyName": "T-Mobile US",
  "companyTicker": "TMUS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/t-mobile-us-tmus-q3-2022-earnings-call-transcript/",
  "content": "T-Mobile US (TMUS 0.43%)\nQ3 2022 Earnings Call\nOct 27, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. [Operator instructions] I would now like to turn the conference over to Mr. Jud Henry, senior vice president and head of investor relations for T-Mobile US. Please go ahead, sir.\n\nJud Henry -- Senior Vice President and Head of Investor Relations\n\nAll right. Welcome to T-Mobile's third-quarter 2022 earnings call. Joining me on the call today are Mike Sievert, our president and CEO; Peter Osvaldik, our CFO; as well as other members of the senior leadership team. During this call, we'll make forward-looking statements, which involve a number of risks and uncertainties that may cause actual results to differ materially from our forward-looking statements.\n\nWe provide a comprehensive list of risk factors in our SEC filings, which I encourage you to review. Our earnings release, investor fact book, and other documents related to our results, as well as reconciliations between GAAP and the non-GAAP results discussed on this call, can be found in the Quarterly Results section of the Investor Relations website. With that, let me turn it over to Mike.\n\nMike Sievert -- President and Chief Executive Officer\n\nOK. Thanks, Jud. Thanks, everybody. Welcome to our third-quarter call.\n\nThanks for tuning in. It is so great to be back to talk about another quarter of outstanding results by this team. Our differentiated strategy is working. Our ongoing focus on delivering the best value while simultaneously capitalizing on our network leadership position has delivered another quarter of industry-leading growth in customers, EBITDA, and cash flow.\n\nAnd we're raising our 2022 guidance for the third consecutive quarter this year. All of this while completing our biggest integration milestone. I am incredibly proud of this team. As we told you when our merger closed, our plan was to expand on our fame as the industry's best value while building and becoming known for having the best network in the country, finally giving customers the ability to have both from one provider for the first time ever.\n\nNow just two and a half years later, we're doing exactly what we planned. Our brand strength for value leadership has never been better. And it's been further aided by our competitors' price increases. And our long-established 5G lead is translating to overall network leadership for the first time and giving customers the beginnings of really a powerful network that they're really noticing.\n\nOur results this quarter are a clear demonstration of how differentiated and sustainable our growth strategy really is. Only T-Mobile has both this unique combination of network and value leadership and multiple large-scale new and underpenetrated segments to tap into. To grow our business, we are also driving innovation where it matters most for customers. Through Magenta MAX, our most popular plan, and the best expression of T-Mobile's 5G network, we're providing features that are meaningful to customers in their daily lives like with the recent addition of Apple TV+ and our Un-carrier move, Coverage Beyond.\n\nWell, we're not just keeping people connected on the ground, but also in the air and when they go abroad. With the launch of Easy Switch and Network Pass, we're making it simple and risk-free to experience our network and make the switch to T-Mobile. It has long been established that T-Mobile is the 5G leader. But with the rapidly growing adoption of 5G by consumers and businesses, we're now seeing that 5G lead translate into overall network leadership.\n\nAnd to back it up, we're beginning to win more third-party recognition for our network leadership from multiple third parties like Ookla, umlaut, and PCMagazine. This is precisely the network evolution that we planned. We knew that 5G leadership would eventually translate into overall network leadership, and that's exactly what is now unfolding. And speaking of network, we just hit our biggest merger integration milestone.\n\nBy the end of Q3, we had successfully decommissioned substantially all targeted Sprint macro sites, more than a year earlier than our original merger plan. And our Ultra Capacity 5G now reaches 250 million Americans. Think about that. Today, we're already where Verizon hopes to be more than two years from now.\n\nAnd we're not stopping. We recognize the importance of coverage to customers, and we will continue to pursue more opportunities to ensure our network is there for them whenever and wherever they need us. This lean and data-informed customer-driven coverage approach will guide us as we enhance and expand our network to even higher levels and in a capital-efficient way using our spectrum resources. We also recognize that there are some places where it's just not practical for any wireless operator to build a terrestrial network.\n\nBut because we want T-Mobile customers to have peace of mind that we have them covered no matter where they go, in Q3, we announced our joint effort with SpaceX to do just that, combining a slice of our mid-band spectrum that's already compatible with existing customer devices with next-gen satellite technology from SpaceX. Our goal is for T-Mobile customers to be connected anywhere in the U.S. where they can see the sky. Overall, this differentiated growth strategy and emerging network leadership produced another quarter of truly differentiated results.\n\nSo, let's get right into them. In Q3, we posted a record 394,000 postpaid account net adds, the highest in company history and the highest reported in the industry again. Winning the switching decisions in this industry and growing share through our core growth strategies I've outlined for you many times is the central growth ambition of our company. And this quarter, we did that better than ever before.\n\nIn addition, our network and value proposition are consistently attracting the industry's best customers, which is contributing to an all-time high in our customer prime mix. And we delivered an industry-best 1.6 million postpaid net additions, more than AT&T and Verizon combined. We had our highest postpaid phone net adds since the merger with an industry-leading 854,000. Our postpaid phone churn of just 0.88% improved eight basis points from last year.\n\nOnce again, we were the only wireless service provider to improve year over year. And our postpaid phone churn, including Sprint, was lower than Verizon's for the second consecutive quarter. And as I said, our multiple growth opportunities are all contributing to this success. Consider smaller markets in rural areas, which include 40% of the U.S.\n\npopulation. At the end of last year, we only had a competitive network and distribution to effectively compete in 30% of those households. Today, thanks to our accelerated network build, we have already surpassed our year-end target to compete in 50% of these households, and we now expect to reach roughly 60% by the end of this year. We also continue to grow in the top 100 markets as we win the prime network seekers who are increasingly recognizing that T-Mobile has the best network for them, an audience we never effectively competed for in the past.\n\nWe achieved share leadership in many of these markets in the past without winning on network. All of that is changing. So, the same advantages in network and value proposition that are driving growth in smaller markets and rural areas where we're underpenetrated and are driving it in the top 100 where we've always been strong. In fact, our net account growth in the quarter was split roughly equally between these two geographic segments.\n\nOK. Let's talk business. We continue to win business customers from incumbents as T-Mobile for Business continues to build momentum, delivering one of our highest-ever postpaid phone net addition quarters in Q3. The impact we're having can be clearly seen in Verizon's business churn, which was up again at the highest levels they've ever reported.\n\nMeanwhile, we added more business accounts and had lower business phone churn than Verizon in the quarter, delivering one of our lowest-ever postpaid phone churn quarters for business. Our 5G network leadership, particularly as it relates to our lead in advanced 5G services, is increasingly enabling us to become a strategic partner for enterprises and for government agencies. OK. Let me briefly touch on high-speed Internet where net additions of 578,000 hit another record high.\n\nAnd once again, we expect to lead the industry in net adds. In fact, I anticipate that T-Mobile had more broadband net additions than AT&T, Verizon, Comcast, and Charter combined for the second quarter in a row. In addition, our high-speed Internet attracted consumers and businesses who are new to T-Mobile at an increasing pace, establishing new relationships that we can grow with additional products and services over time. In just a year and a half since our commercial launch, we now serve more than 2 million customers with Net Promoter Scores more than 30 points higher than cable and even higher than the average fiber provider.\n\nThese results demonstrate that our differentiated growth strategy and our Un-carrier playbook to provide customers with the best value and the best network continues to win, and our differentiation is a particular source of strength in this ever-changing competitive and macroeconomic environment. And importantly, we translated our leading customer growth into industry-leading financial growth in postpaid service revenues, core adjusted EBITDA, and cash flows. This momentum has enabled us to raise our guidance every quarter this year, including today. Finally, as you know, thanks to our strong execution and confidence in the future, our board authorized a substantial share repurchase program and did so earlier than our initial Analyst Day plans to begin in 2023.\n\nI could not be prouder of this team and of these results. OK, Peter, over to you to talk about our key financial highlights and some more information on our guidance.\n\nPeter Osvaldik -- Chief Financial Officer\n\nAll right. Thanks, Mike. It's such a pleasure to watch this team reliably deliver on our commitments, and we did it yet again with another strong quarter in Q3. Our industry-leading growth in postpaid customer accounts resulted in the best postpaid service revenue growth once again, up 7% year over year.\n\nOur disciplined focus on driving profitability translated at strong service revenue growth, combined with our continued execution on merger synergies, into year-over-year core adjusted EBITDA growth of over 11%. That increase in customers and profitability is driving industry-leading operating and free cash flow expansion and further unlocks the massive cash flow potential of our business. These robust operating results also enabled us to achieve two major financial milestones. First, we're extremely proud to have reached an investment-grade rating from all three major agencies, opening access to a much deeper and cost-effective capital pool for the company.\n\nWe also closed our first asset-backed securities issuance related to our equipment receivables, which provides yet another established and attractive capital source as we continue to be opportunistic in optimizing both our capital structure and cost. And second, as Mike mentioned, we commenced the significant share repurchase program in September, and we repurchased 4.9 million shares for a total purchase price of $669 million in Q3. Cumulatively, through October 20, we have repurchased 10.9 million shares for a total purchase price of $1.5 billion. Also, in Q3, we announced the planned sale of our wireline business, which resulted in a pre-tax loss of $1.1 billion that had substantially no cash impact to the quarter.\n\nThis includes the financial liability associated with the commercial take-or-pay arrangement, the impairment to the carrying value of the associated assets, and other cost to sell. The transaction is not expected to have any material financial impact to 2023 based on the expected closing timeline. All right. Let's jump into the details of our increased guidance for 2022.\n\nWe now expect total postpaid net customer additions to be between 6.2 million and 6.4 million, up 150,000 at the midpoint, reflecting both the great execution of our differentiated growth strategy and progress on reducing churn. We continue to expect nearly half of postpaid net adds coming from phones for the full year. Turning to core adjusted EBITDA. We now expect full-year 2022 to be between 26.2 billion and 26.4 billion, up 11% year over year at the midpoint and up 150 million from our prior guidance, driven by our profitable growth in service revenues and increased merger synergies.\n\nCore adjusted EBITDA excludes leasing revenues, which we expect to be between $1.3 billion to $1.4 billion as we continue to transition Sprint customers off device leasing. We now expect merger synergies to be between $5.7 billion to $5.8 billion, up $250 million at the midpoint, primarily as we unlock more network savings driven by accelerated site decommissioning. Merger-related costs, which are not included in core adjusted EBITDA, are expected to be between $4.8 billion and $5 billion before taxes, primarily representing network decommissioning activities. Net cash provided by operating activities, which include payments for merger-related costs, are now expected to be in the range of $16.3 billion to $16.5 billion up 18% year over year at the midpoint and up $250 million from the prior guidance.\n\nTurning to cash capex. We now expect it to be between $13.7 billion and $13.9 billion, which is up $200 million at the midpoint, reflecting the ongoing robust pace of our 5G deployment and success in high-speed Internet where we capitalize the routers. Together, we now expect free cash flow, including payments for merger-related costs, to be in the range of $7.4 billion to $7.6 billion, higher by $50 million at the midpoint. This results in free cash flow increasing by more than 30% over last year, even with the higher levels of investments, and does not assume any material net cash inflows from securitization.\n\nWe now expect our full-year effective tax rate to be between 17% and 19% based on favorability, primarily from nonrecurring benefits we've seen year to date. Additionally, we continue to expect postpaid phone ARPU to be up approximately 2% for the full year driven by continued customer adoption of value-added services, including Magenta MAX. And with greater success in attracting new to T-Mobile customers with high-speed Internet, we now expect full-year postpaid ARPA to be up in the mid- to high 2% range. And with that, I will now turn the call back to Jud to begin the Q&A.\n\nJud Henry -- Senior Vice President and Head of Investor Relations\n\nThanks, Peter. All right. Let's get to your questions. [Operator instructions] Let's start with a question on the phone.\n\nOperator, first question, please.\n\nOperator\n\nThank you. We'll take our first question from Jonathan Chaplin of New Street Research.\n\nJonathan Chaplin -- New Street Research -- Analyst\n\nThanks, guys. Congratulations on a great set of results. I had just a quick question on fixed wireless broadband, actually. It looks like net adds are leveling off pretty much as you described they would last quarter, Mike.\n\nAnd I'm just wondering, you're still expanding your addressable market as you deploy 2.5 gigahertz spectrum. Are you starting to run out of capacity in some of the early markets that you deployed such that the sort of markets open for sale isn't growing anymore? Is that what's causing the leveling off in net adds?\n\nMike Sievert -- President and Chief Executive Officer\n\nNot at all. In fact, our -- the capacity picture is actually more sector by sector than market by market, and that's sort of what makes it different than other models. Just to kind of remind everybody how this works. So, we took the entire country and looked at every sector of every tower and predicted mobile usage for years to come through share-taking and additional mobile usage per device and then looked at each sector, whether or not to approve addresses in that sector.\n\nAnd then once we get enough addresses in that sector, which is very rarely achieved so far, we stop approving addresses in that sector. And so, it's not really a market-by-market basis. And it's also, therefore, not a model that requires us to allocate significant extra capital, meaning we can go after this market very, very cost effectively because the network is substantially complete only for mobile usage. It's just a fantastic model.\n\nWhen we laid that out for people in '21, we said that we saw that particular model getting us to 6 million to 8 million postpaid homes, and that would be about the model. But that doesn't mean we might not go beyond that. We'll have to watch how it all unfolds. And we just really like this run rate.\n\nIt's competitive. It's rapidly growing. I love the fact that the premise of your question is why the slowdown, only as many net adds as AT&T, Verizon, Comcast, and Charter combined. What's going wrong with your model? So, it's just -- it's a fantastic place for us to be.\n\nBut the answer to your question specifically is no. Other than in some particular neighborhoods where we have lots of neighbors all joining on at once, we're not seeing any issues with capacity. And remember, and I'll ask Neville to finish this answer, we're only getting started when it relates to applying the capacity. It's not a finite quantum.\n\nIn fact, right now, we have 120 megahertz, is it, deployed in the mid-band Ultra Capacity, and we're on our way to 200. Maybe you can talk about the journey because it's not a fixed capacity story.\n\nNeville Ray -- President of Technology\n\nYeah. Just build on your comments, Mike. I'd say, Jonathan, the reverse is happening. We're just coming off the back of a tremendous quarter, actually, our busiest quarter since close of the merger with Sprint in terms of how many sites we modernized and upgraded with mid-band 5G.\n\nAnd so, the footprint is expanding, which is tremendous. We're also adding more spectrum across the footprint, both the existing and the new footprint. And that's not just in 2.5 gigahertz now. We're also adding PCS in the 1,900-megahertz band to those sites.\n\nSo, we have more sites and more spectrum coming online as we move through the future months and years for the company. And it's not just that, right? The other great piece is that 5G is becoming more efficient. We're rapidly moving to all SA, all stand-alone. And what does that mean? It means we can leverage and transport all of that home Internet traffic on a pure 5G length.\n\nSo, that's more efficient. It's more spectrally efficient. And from a performance perspective, of course, we get better latency. So, we're still in the early innings of rolling out this mid-band network.\n\nObviously, we have a tremendous leadership position. But in terms of our ability to support the numbers we've talked about by 2025, we're in a good place. And as Mike said, we will continue to work to see if we can beat those opportunities.\n\nJonathan Chaplin -- New Street Research -- Analyst\n\nThanks, guys.\n\nMike Sievert -- President and Chief Executive Officer\n\nOne thing I love about this, just to wrap it up, is that -- I mentioned this in my remarks, but the Net Promoter Scores that we're seeing on this product are just fantastic. And people love this product because it's lower price and because it does exactly what it promises. And for us, it's really, really important that we keep all of that in balance on our journey to millions and millions of homes served. So, great.\n\nThanks, Jonathan.\n\nJonathan Chaplin -- New Street Research -- Analyst\n\nThanks, Mike.\n\nMike Sievert -- President and Chief Executive Officer\n\nAll right. Next question.\n\nOperator\n\nAnd moving on to Craig Moffett of MoffettNathanson SVB Securities.\n\nCraig Moffett -- MoffettNathanson -- Analyst\n\nHi there. Two questions. First, as 5G chipsets become increasingly commonplace and sort of more the norm than the exception, how do you think about telling the story of 5G network advantage in a way that particularly the consumer market sort of internalizes it? What kind of metrics should we be looking at for a sense that your network advantage is really something that is becoming known and resonating with customers? And then second on just a purely more financial note. As you -- for example, as you bought in some previously leased spectrum and that sort of thing, how should we be thinking about the margin trajectory for the business going forward? And where you think service margins can get to longer term?\n\nMike Sievert -- President and Chief Executive Officer\n\nOK. Great. Let's start with the second question about bringing on lease spectrum. What's the margin trajectory? Where can margins get? I'll start with Peter.\n\nPeter Osvaldik -- Chief Financial Officer\n\nYeah. Well, there hasn't been a lot of that yet, Craig. I mean, we announced our transaction with Columbia Capital. That, again, is subject to regulatory approval and would close six months thereafter.\n\nBut again, as I think about the long-term trajectory of this business, we laid out, obviously, our set of mid- and long-term aspirations in Analyst Day, and there are some service revenue margins that are inferred from there. But this has been a question that's come up multiple times in terms of the competitive set and where do we land relative to the competitive set. And the most important thing to look at, because it is what powers the growth of the ability to both return shareholder capital, to invest further in the business, and to continue this flywheel success, is how are you able to translate that service revenue into free cash flow. And that's where we're tremendously proud and excited about the opportunity ahead of us.\n\nAnd you see even with our Analyst Day projections for 2023, even before we get the full run rate cash potential of this business in the later periods, we're projected to convert service revenue into free cash flow as a leader in this industry. And so, that's really what we're laser-focused on. It gets rid of the question of leased fiber versus owned fiber, takes all that noise out of it, and really shows you the value-creation capability of this business.\n\nMike Sievert -- President and Chief Executive Officer\n\nYeah. And just back to the consumer question. I'd be interested if anybody else wants to jump in. Ultimately, consumers and businesses want an available signal.\n\nAnd where they have available signal, they want speed and capacity, and they want that at a great price from a company that will treat them right and love them. And that's the bottom line. Our lead in 5G puts us in a position now that 5G is becoming the norm to be the leader in overall network. And network is one of the top two reasons why people switch.\n\nThey switch either because they're not satisfied with the price or the terms around those prices or they switch because they want a different or more powerful network signal. And more and more, they're learning that T-Mobile is the company that offers that. Remember, all the companies now provide signal just about everywhere people go. The question is, when you are moving around, what kind of signal do you have? When you walk into buildings, are you begging for a Wi-Fi password, or do you have T-Mobile where your signal is probably faster than the Wi-Fi and the building you just walked into? And that kind of thing is habit-forming.\n\nWe're seeing usage move really fast. The most popular plan we have and, as I said, the best expression of our 5G network is Magenta MAX. It's now our most popular plan, and people are using it significantly more than they were using prior plans and certainly more than they were using LTE, like several times more. And so, those are the kinds of things that I think people look to.\n\nIt's applications like gaming. It's media consumption. It's the emergence of new use cases like AR and VR that are the underpinnings of the metaverse. No matter what you believe about how the metaverse might or might not unfold, clearly, more immersive 3D experiences are on their way.\n\nAnd all those things require ultra-high capacity, low latency powerful network signals. And that's what T-Mobile uniquely provides with our 5G advantage. The last thing I'll say, and I know your question was about consumers, is that businesses don't just go on the reputation. They actually go have a look at it.\n\nThey take 100 or so phones from each of the providers and test it for some weeks. And our win share is like it's never been. And so, it really shows you that when they take a hard look at where all their customers go, where their employees go, and they look at it side by side, they come back, and more times than not and certainly more times than the past, it's T-Mobile. So, we're really at the beginnings of, I think, this 5G revolution taking hold.\n\nAnybody want to add to that?\n\nMike Katz -- Chief Marketing Officer\n\nI might just say one or two things to emphasize a couple that you said. 5G is more and more becoming the network. And so, one of the ways that we're measuring our success in 5G is how are we succeeding in overall network perception, how are people perceiving that T-Mobile competes overall in the marketplace against our two main competitors. And I think increasingly, you're seeing us close the perception gap.\n\nYou're also seeing us win awards for overall network leadership that we had never won before, and Neville can double-click into some of those. I think the way that we'll continue to talk about this is coverage in places where customers really care, about, and with our Coverage Beyond move, we've featured coverage both on the ground, the best 5G network, and increasingly, the best network when you're on the ground, covered when you're in the air and covered internationally. And I think you'll start to see more and more of these use cases emerge about experiences that both businesses and consumers can appreciate as we progress over the next couple of years that we'll feature and talk a little bit more about the kinds of experiences that could be unlocked by a leading network. Final words to quantify that for you.\n\nNow that 5G usage is most of the usage and 5G devices are most of the devices, we're seeing our 5G lead take root, not just in reputation and reality, but in quantitative measures. So, for example, the Ookla data that came back said our average customer is experiencing speeds twice as fast as just a year ago, average customer, regardless of device type, and twice as fast as they can get from AT&T or Verizon. And that's very powerful because they noticed that, and they tell other people about it. Did you have a follow-up question? I was just starting to hear you jump in.\n\nCraig Moffett -- MoffettNathanson -- Analyst\n\nNo. Just -- is it an issue of coverage that you can see on a map? Or is your 2.5 gigahertz spectrum more an issue about fewer dead spots because the propagation is going to be better than, say, the C-band?\n\nMike Sievert -- President and Chief Executive Officer\n\nWell, I mean, if you total the people that we reach right now, it's 250 million with Ultra Capacity. And with C-band and other forms of Ultra Wideband, as Verizon calls it, that's where they hope to be by their public disclosures over two years from now. And so, years ago, I said we were two years ahead in this 5G race. And in two years, we'd still be two years ahead.\n\nThat continues to appear to be the case, even though our competitors are now in rapid deployment of their C-band assets. And of course, they are different assets. Ours is underpinned on one 5G network with a 5G stand-alone core by a massive low-band 5G network that reaches 97% of Americans. And that's a huge difference maker as well, and we see it in all kinds of scenarios, including even the resiliency of our network.\n\nWhen issues happen with a storm or something, we can beam in from miles away and save the day with a very high capacity 5G signal on low band. And those things are very important to our customers, they notice.\n\nCraig Moffett -- MoffettNathanson -- Analyst\n\nThat's helpful. Thank you.\n\nMike Sievert -- President and Chief Executive Officer\n\nGreat. Let's keep moving.\n\nOperator\n\nAnd moving on to John Hodulik with UBS.\n\nMike Sievert -- President and Chief Executive Officer\n\nHi, John.\n\nJohn Hodulik -- UBS -- Analyst\n\nGreat. Thanks. Hey, Mike. How are you? Two questions.\n\nFirst, churn and the ARPU. First one on the postpaid churn, 0.88%, obviously, very solid improvement. I mean, in the past, you've talked about the difference between Sprint churn and Magenta turn, and now with everybody sort of on the same network, and I think on the same plan -- or on the T-Mo plans, is there room for continued improvement just given all the improvements you guys just outlined in terms of the network? And then the other one is on the postpaid phone ARPU. I guess where are you in terms of sort of Magenta MAX penetration? And given what I think is still relatively low, do you think that low single-digit ARPU growth can continue as we look into 2023? Thanks.\n\nMike Sievert -- President and Chief Executive Officer\n\nOK. Great. I'm going to go turn to, just so you have a heads up, to Peter and to Jon on ARPU and Magenta MAX. On churn, I'll just personalize it.\n\nI'm not going to be satisfied until we're the lowest. Magenta was the lowest. We're -- right now, we're No. 2 on churn.\n\nI want to be No. 1. And we have the best network and the best value and a team that loves its customers. We should make our way to No.\n\n1. I can't really outlook for you the journey because it's a competitive marketplace. Our competitors aren't standing still. I respect them.\n\nBut I think with our team and our assets and our unique proposition, we should be No. 1. We're not going to probably be unpacking it for you a lot more than that. We used to do the here's the T-Mobile and give you some color on the churn and how many people and Sprint starting to look just like Magenta now, etc., because the premise of your question was accurate.\n\nWe've shut down the Sprint network. We hope the billing migration that happens in '23 will be largely invisible to customers. And so, yes, we have a lot of work to do. We need to get them under commitment.\n\nWe need to get them on the right plans, give them the full Un-carrier benefit. Here's some improvement we can undertake still, but it's one customer base. And we're going to be focused on how do we improve churn for that one customer base, and I won't be satisfied until we're No. 1.\n\nOK. So, turning to ARPU and ARPU development and Magenta MAX and what we're hearing from customers, Peter and Jon.\n\nPeter Osvaldik -- Chief Financial Officer\n\nPerfect. So, I'll let Jon talk about Magenta MAX. But really, I mean, the trajectory of ARPU has just been just such a success this year. And when you think about the history of T-Mobile and even the plans that we had anticipated during Analyst Day when we came out, the ability to have Magenta MAX be such a tailwind and allow us to get to the point where we're increasing ARPU guidance year over year and expecting a 2% increase is just phenomenal.\n\nBut at the same time, as you know, ARPU is very much a mix-driven metric. And one of the reasons why we're so focused on ARPU itself, and just some of the examples are, of course, as you deepen relationships, for example, with our Sprint customers, as we saw migration happen, we had an opportunity to expand relationships. And so, while that second, third, fourth line is obviously a lower ARPU and can impact blended ARPU, it's tremendously accretive from a CLV perspective. So, that's one.\n\nIn business where you're seeing some of the success in business, large enterprise, obviously, has a lower blended ARPU basis than what you typically see, but it's a tremendously CLV accretive business to bring in. Our segmentation approach, 55-plus that's bringing in such a significant amount of prime customers and driving switching is another one where you see ARPU may be mixture differently than what we see on a blended average, but high CLVs. And so, that's part of the reason why you've always heard us focus on ARPA and the strategy to land and continue to expand the relationships, both with more phones, but also beyond the phone, such as with fixed wireless. And that's where we're seeing mid- to high 2% year-over-year increase in ARPA.\n\nSo, that gives me a lot of comfort there. And I do think with ARPU, you're going to see a mixture of things happen. But Magenta MAX has just been such a great tailwind. And I'd love to give Jon the opportunity to brag about it a little.\n\nJon Freier -- President of Consumer Group\n\nYeah. We couldn't be more pleased with what's happened with Magenta MAX. I mean, when you think about all of our new accounts that are joining T-Mobile, we're having north of 60% of our new bands choosing Magenta MAX. And like what Mike said just a few moments ago, it's our most popular plan for not only new customers that are joining but also existing customers who are changing the rate plans.\n\nWe're still under 20% of our total base on Magenta MAX. So, with what Peter was saying just a few moments ago, we still have tailwinds and opportunities still within our base, not only for the business benefits that that represents but also for the incredible consumer benefits that it represents as well. You got to remember, too, that when you look at Magenta MAX, for customers with two lines or more, it's $225 per month in savings and value that consumers get. And when you think about this inflation, pressured budget cycle that so many households are in and you think about what we're doing with Apple TV+ now included on Magenta MAX, Netflix included, all of the Wi-Fi included on airplanes, think about taxes and fees, that's something that we talked about and rolled out some number of years ago, I think at the beginning of 2017.\n\nThat's 15% to 18% of the bill with our competitors that's completely included within our value proposition on the Magenta MAX. So, our customers are loving it. Like Mike said, there's incredible utility, five times more gaming, two and a half times more social media, two times more video, including all those emerging technologies that Mike was referring to just a few moments ago, an augmented reality and virtual reality as well. So, our customers are loving it.\n\nWe have a lot more opportunity still to go within Magenta MAX, but we're feeling great and just could not be more pleased with the overall performance of that particular rate card.\n\nMike Sievert -- President and Chief Executive Officer\n\nOK. Hey, before we go back to the phone, I want to go out to Twitter where we're seeing questions come in. We have a question from Roger Entner and a similar one from @LinkedIn, right? So, I'll go with Roger's version. So, it's a question for Callie Field and TFB.\n\nIn what business sector do you see the most success? Where are you gaining traction? Is it SMB, midsize or large enterprises? And maybe I'll also add to the question, Callie, because all of the competitors said in their calls, business is going fine. Business is going fine. So, what's going on? We just said business is going fine. How can it be going fine for everybody? So maybe if you can answer both.\n\nCallie Field -- President of Business Group\n\nYeah. You know, I -- thanks, Mike. I can't -- and Roger, thanks for the question. Good to hear from you.\n\nYou know, I can't speak too much to AT&T and Verizon, but I do see the TAM expanding. Mike, we see in business this year, mobile subs are expected to grow by 4.6%. A third of all business hubs will have a 5G connection by the end of '22. IoT connections are expected to grow by 16%.\n\nAnd of course, private networks and managed services are supposed to be well over 44% CAGR year over year. We see work-from-home as a category expander, and we see companies that are providing employee lines to have less than 10% attrition. So, this is a benefit that they're coming and talking to us about. And then when we see regulation and some of the environment from the SEC, maintaining and providing secure electronic communications allows us to expand our product portfolio and the way that we're delivering solutions.\n\nSo, there's a lot of really great and interesting opportunity for us. We're having a lot of conversations. And then, Roger, to your question, our revenue in enterprise is up 20% year over year. In SMB, we're seeing double-digit growth quarter over quarter.\n\nIn our offering for business Internet, which is really the only 5G nationwide fixed wireless solution, we've seen double-digit growth quarter over quarter for four quarters in a row. So, in this last particular quarter in automotive and in airlines, those verticals we saw a lot of growth. We signed the deal with VinFast, which is a global EV manufacturer. Ford, we announced a partnership for our Advanced Network Solutions.\n\nWe won with Boeing, Delta, a partnership with our SMRA growth in consumer, let us win in rural America with Tractor Supply, which is America's largest rural retailer where we started with fixed wireless and have the opportunity to land and expand. So, in the public sector as well, Roger, we're seeing great deals with Dallas ISD, Chicago PD, the IRS. So, it really is a pretty exciting time for business. Overall, across several different product categories outside of only voice and [Inaudible].\n\nWe're in SMB, we're continuing to see growth there.\n\nMike Sievert -- President and Chief Executive Officer\n\nSo, two things are happening, right? So, one, we're taking their share. That's just very clearly happening, and that's exactly what we told you would happen because of the superior network and the better value. But secondly, the pressure is a little bit being taken off of our competitors, which I think is a good thing, by the category expansion that Callie just talked about. And we forecasted this for you a while back.\n\nWe told you that we thought, because of this really tight labor pool, that employees -- employers would be looking at all kinds of way to retain employees, and great phone plans are certainly one of those. And this hybrid workplace that companies find themselves in has persisted longer than a lot of people predicted. And now with employees distributed outside the office, employee-sponsored phone plans become a more important piece. And so, you see growth in the sector, which I think takes a little pressure off of the underlying dynamic, which is we're taking their share.\n\nGood. OK. So, let's go back to the phone for the next one.\n\nOperator\n\nThank you. Next, we'll hear from Simon Flannery of Morgan Stanley.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nGreat. Thanks very much. Just continuing on the TAM expansion there, we've had another quarter. It looks like the industry will do over 2 million postpaid phone adds.\n\nCan you just talk to the sustainability of that? And any broader comments on customer behavior, bad debts, day sales outstanding, etc.? We hear a lot of other companies talking about a weaker consumer. That may help you in terms of value-seeking behavior, but any updated thoughts there would be great.\n\nMike Sievert -- President and Chief Executive Officer\n\nGreat. I'll have Peter start it off, and then I have a couple of comments.\n\nPeter Osvaldik -- Chief Financial Officer\n\nYeah. So, let me start with bad debt and consumer behavior. We -- as you know, year over year, certainly, you saw bad debt increase from the more muted pandemic-related commissions. And we're seeing involve churn roughly normalized to prepandemic levels, 2019 levels, which was actually our best year pre pandemic.\n\nAnd it's exactly what we foreshadowed for you in Q2. We did see bad debt sequentially step down, and we do believe Q2 was the high-water mark in terms of percentage of total revenue from a bad debt perspective. So, we're seeing exactly what we anticipated seeing there. Remember, this is a core strength of ours, and we'll continue to work with consumers.\n\nTo your point, is it an opportunity set? Yes, I think that's another thing we've talked about before. And we see continued, as Jon mentioned, really, really strong uptake on our highest-featured rate plan. And we're also seeing, as you see, tremendous uptake on high-speed Internet, both within our current base, but also with new to T-Mobile relationships that then allow us to expand beyond that. So, that's a lot of, I think, what we're seeing very, very optimistic about those trends.\n\nAnd I hope I hit all the questions for you. Is there another one, Simon?\n\nMike Sievert -- President and Chief Executive Officer\n\nThe sustainability of the overall postpaid growth.\n\nPeter Osvaldik -- Chief Financial Officer\n\nYeah. Well, you know, it's another one where we've been saying for the longest time, we do believe, ultimately, the industry growth will normalize. And that was always in our plans. It always continues to be in our plans.\n\nBut remember, the differentiator for us is that not only do we have this tremendous combination of the value proposition and our fame for value and the 5G network leadership that is turning into overall network leadership. But it's also combined -- those two things combined with the tremendous growth opportunities that are, again, differentiated for us that Mike spoke about earlier, network seekers in the top 100, our expansion in smaller markets and rural areas, TFE, and the success that we're continuing to see there. So, for us, we believe we're going to continue to take share because of that combination of value and network and the differentiated growth opportunities despite the fact that we do anticipate the industry will normalize. And the proof as we continue to deliver is in the results.\n\nOur highest-ever postpaid account net adds, a true measure of switching and relationships and the ability to land those and grow those, now in the mid- to high 2% range for ARPA. So, that's kind of how we're thinking about it. I don't know, Mike, if there's anything to add, thoughts.\n\nMike Sievert -- President and Chief Executive Officer\n\nWell, just that, you know, normalization is starting to happen. You see these last couple of quarters, overall postpaid growth was more moderate. And yet our performance is fantastic. And so, it does underscore what Peter said, which is our strategy isn't actually predicated deeply on category expansion.\n\nIt's predicated on share-taking, something we consistently and reliably do quarter after quarter. Now there's -- as I mentioned, there's some pressure being taken off. Prepaid continues to contribute to postpaid but at more modest levels. Business expansion is happening, and that's a newer phenomenon.\n\nAnd by the way, that looks to us to be partly incremental. So, some people are actually carrying two phones around. And so, that's good for the category. And we'll have to see what happens.\n\nBut what's different, of course, about our strategy, as Peter said, is that, unlike our competitors, we have big growing underpenetrated segments where we are positioned to win with the team, the assets, and the value proposition that resonates. And we're proving that that's true quarter in and quarter out. And I think that's one of the things that makes our story a little different.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nMike Sievert -- President and Chief Executive Officer\n\nYou bet. Back to the phone. You got to force us to Twitter, or are you going to bring us -- operator, next question.\n\nOperator\n\nYes, please. If we can move to Twitter.\n\nMike Sievert -- President and Chief Executive Officer\n\nOK. All right. I mean -- all right. So, we do have a couple of questions that are pending.\n\nSo, looking Neville at the network that we've just finished the substantial shutdown of the Sprint network. We now have one integrated network, but we did keep a lot of the Sprint sites. What percentage of them have been converted and upgraded? And also, could you give an update on where we are with VoNR, that's voice over new radio. What that means is voice over 5G kind of like voice over LTE work in the LTE days.\n\nNeville Ray -- President of Technology\n\nYeah. I'll hit these quick, Mike. So, we've talked about how we've effectively completed our network integration. And a big part of that was not just decom, it was incorporating literally thousands upon thousands of Sprint sites into the T-Mobile network, and that's the definition of the term that's used their keep sites.\n\nAnd that work is in the majority now complete, too. So, this last quarter, a lot of decom, a lot of these keep sites were upgraded and brought on air. And so, we've made -- it was just a cracking quarter for us with all the 5G build, too. So, really, really pleased to have the vast majority of all of that work behind us.\n\nAnd now we can move on with continued expansion of coverage and performance in 5G.\n\nMike Sievert -- President and Chief Executive Officer\n\nIt was the single biggest capital deployment quarter of the single biggest year in our business plan for capital. So, you should look more tired than you are.\n\nNeville Ray -- President of Technology\n\nThankfully, I have a great team. Thank you, guys. But yes, I think last quarter, Mike, was the busiest network quarter in the company's history. I don't think we've ever seen the level of delivery and performance on decom, on new sites, on modernization.\n\nIt was a remarkable set of performance characteristics.\n\nMike Sievert -- President and Chief Executive Officer\n\nThat means you're touching the network with upgrades and decommissionings at the highest rate in our history while being the only player with year-over-year churn improvements, eight basis points, and beating Verizon for the second quarter in a row. That -- when you touch a network, there's people -- some people get affected very temporarily. That's powerful that -- and it really shows the planful-ness of the build that we were able to do that substantial of a set of improvements, and yet simultaneously deliver churn improvement, showing that customers are noticing, and they're not just noticing -- pardon our dust, they're noticing improvements.\n\nNeville Ray -- President of Technology\n\nRight. And there was an intense focus from the team on, obviously, churn management, but more importantly, the customer experience throughout that process. And as we moved into '22, we were way, way better executing on the plan we put together some time back. Quickly on Voice over NR.\n\nSo, we always seem to forget to bring voice along with the next generation of technology. We've done it multiple times now. But I see us as in a leadership position globally. We have Voice over NR, so 5G voice live in several markets.\n\nWe continue to test. We continue to optimize. Why is that important? It's important because we want to have all of our traffic, all of that customer experience on a 5G lane. Today, we have to drop our customers down off of that 5G lane onto LTE.\n\nAnd we've talked before about how we see our businesses and all 5G network, and having VoNR and that voice service is critical to executing on that strategy and making sure we have a full 5G network with for stand-alone capability. So, we're making progress, still got work to do. I'm not going to say it's where we want it to be yet, but I'm confident over the next couple of quarters, we will materially expand that footprint.\n\nMike Sievert -- President and Chief Executive Officer\n\nAnd with that stall tactic -- Neville and I can just bro out on network all afternoon while you guys watch, or if the operator is back, we can take a question.\n\nOperator\n\nThank you. And next, we'll go to Michael Rollins with Citi.\n\nMichael Rollins -- Citi -- Analyst\n\nThanks. Good afternoon. Hi. Two questions, if I could.\n\nSo, first, as we're getting closer to 2023 and we look back at the previously issued guidance, can you unpack some of the development in 2022 that can impact those ranges for core EBITDA and free cash flow, whether it's inflation, the pace of synergy realization or the capex intentions after looking at the growth that you've achieved to date? And then just secondly, just as you're looking at the progress for the business model and the network, how are you thinking about fiber these days in a couple of respects, one, more ownership of the fiber to run the network on? And also, on the home broadband front, is that -- does the success of fixed wireless increase your interest to have a fiber pipe into a substantial number of homes and businesses?\n\nMike Sievert -- President and Chief Executive Officer\n\nGreat. Well, let me start with the second one on fiber. It's -- we're in the same place really as we were the last time we talked about this. I think I got asked about this the last time, which is as a management team, we have a fantastic business model and a fantastic business plan, and we are focused on it.\n\nAnd we love our ability to move fast and serve customers as a wireless pure play, and it's been a big source of strength. That said, we are very open-minded about whether our team, our ability to execute, our brand, our in-place 5G network could serve broader markets. And so, we're, of course, interested in adjacencies that would very smartly utilize all of those assets, including our physical and digital distribution capabilities. And so, we're interested, and we haven't drawn any conclusions about it.\n\nAnd I really can't answer whether 5G fixed wireless success makes us more interested or less interested. It could be a little of both for the obvious reason. So, you'll have to stay tuned. We're having a look at -- one of the things that we do is we try to learn.\n\nWe have some partnerships that we're pursuing now called T-FIBER and -- at a very small scale, so we can make sure that we're learning. And then, of course, with our -- surprising to many people, but not to us, consistent with plans, success in 5G, we're also learning a lot about what it takes to be a home broadband operator. I'm very pleased with the Net Promoter Scores that our customers are realizing because many looked at us and said, \"Hey, you guys are pretty good at swinging smartphones and taking care of customers on mobile, but could you do that broadband thing?\" It's different. And we're starting to be able to answer that for ourselves, and we're growing some confidence in that.\n\nSo, no conclusions. We're just a team that hopefully is building trust with you that, a, we like our plan. We're confident in our plan. And if we can find accretive smart ways to augment that plan in a way that makes this a better investment for you, we'll look at those things.\n\nAnd we haven't drawn any conclusions. As it relates to the question about '23 guide, I mean, I'm glad you asked. In a moment we'll just lay -- ask Peter to go ahead and lay it all out for you, a few months early. No, I -- you know, I'll just start and then ask Peter to amplify.\n\nThe short answer is a lot has changed, but nothing has changed. A lot has changed. We laid out those guidelines for 2023 and beyond in the spring of '21, and that was a very different world that we now live in. And it's one of the things that's pretty gratifying for us because as we look ahead in '23, even though so much has changed, and it'll land differently than we thought.\n\nSo, initial thought is, yes, the parameters we laid out for you, although they were incredibly audacious and although they didn't anticipate some of the changes that have hit the market since then, look to us to be on track, including things like the EBITDA range we shared, the revenue range that we shared, the customer aspirations, the cash flow aspirations, and therefore, the share buyback potential in our plan and also the capex outlook. All those things look to us like roughly the right answers, even though so much has changed. And that's one of the things that makes our story so different than the other stories out there in tech and in telecom. Peter?\n\nPeter Osvaldik -- Chief Financial Officer\n\nYeah. You know, as I reflect back on Analyst Day, what we said is there's a lot of opportunity and, to your point, Mike, so much has changed. When we just think about where the macroeconomic situation is now, certainly, I can rattle off a lot of things that have changed since then such as the DISH relationship and our ability to secure a long-term arrangement that while it's under the Analyst Day assumptions, it still secures about three-quarters of that revenue. But we've had so much success in the business as well.\n\nThe share-taking that we anticipated has happened. What we've seen from Magenta MAX as a tailwind from an ARPA and ARPU perspective has been just tremendous. And we talked about how a lot of the inflationary impacts -- well, of course, they're happening on the edges in terms of bad debt, in the macroeconomic environment, and labor. And you saw the moves that we made early on to address labor with our rate changes.\n\nWe've been insulated from a lot of that because, again, I think a lot of the brilliant moves that were done on the part of Neville and team to secure just long-term arrangements with a lot of our large cost categories. So, in a sense, as you said, Mike, so much of the world has changed since then. And there's been so many puts and takes. But the success of this team gives us confidence in achieving those audacious goals that we set out there for '23.\n\nAnd we're looking forward, obviously. This is not the time to update '23 guide. I'd like to. Maybe I can tweet that later.\n\nBut what we'll do is we'll, of course, update you on that at our Q4 call, and looking forward to that.\n\nMichael Rollins -- Citi -- Analyst\n\nThank you. Terrific.\n\nMike Sievert -- President and Chief Executive Officer\n\nThanks, Mike.\n\nOperator\n\nAnd next, we'll go to Brett Feldman with Goldman Sachs.\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nThanks. You guys hear me OK? Thank you, guys.\n\nMike Sievert -- President and Chief Executive Officer\n\nYeah.\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nOK. Great. Kind of a follow-up on network. You nudged up your capex guidance for the year.\n\nYou talked about accelerating the build-out of the 5G network and also the sensitivity to the high-speed Internet routers. And so, the bigger picture question is, from this point forward, now that you've completed the network integration, what are the principal drivers of your network capex? What's it most sensitive to? And to what extent is it going to be increasingly sensitive to your traction with fixed wireless? Or put another way, if you keep putting up over 0.5 million net adds a quarter, does that inevitably mean you're going to have to keep nudging up capex? Or do you think you're at a run rate to support that growth right now? Thanks.\n\nMike Sievert -- President and Chief Executive Officer\n\nYeah, I'll start. No, it doesn't mean that. And because, again, our business plan on fixed wireless is essentially an incremental capital-free plan. Now if we look at -- to the previous question about we're learning and there's opportunity and we're growing increasingly confident, if we look at that fixed wireless space and decide to augment our capital-free business plan with an additional business plan that's burdened with some capital, we'll let you know about that.\n\nWe won't surprise you with that. But that's something we wouldn't completely rule out because we have great assets. We've barely tapped our millimeter wave assets. We have fantastic mid-band.\n\nThe recent auction has given us potential access soon as soon as those licenses are assigned to significant additional mid-band in areas where we actually already have the towers deployed. And that's fascinating. Well, this is the first auction that's like that where our winning bids, when they are assigned, we have already deployed the radios to -- by the end of this year to 13,000 towers, reaching 45 million people. It's like flipping a switch.\n\nNeville is going -- it's not like flipping a switch. But for me, it's like flipping a switch.\n\nNeville Ray -- President of Technology\n\nAlmost.\n\nMike Sievert -- President and Chief Executive Officer\n\nIt's almost immediate because the radios are there, and they're not allowed to transmit into the white spaces that we just want in the auction. So, we're very anxious to see those being assigned. And the FCC did a great job getting this auction done, and I know they'll do a great job getting the process completed. So, that -- so the answer to the fixed wireless and capital is no, unless we see an additional business because to the very first question in the call, it's not something that is predicated on capital or on capacity.\n\nOur core plan is going to add a lot more capacity as Neville moves from that 120 to the 200 he commented about a few minutes ago. Anybody want to add to that?\n\nNeville Ray -- President of Technology\n\nI'll just add quickly. I mean, obviously, the modernization of the network continues on, but we've achieved so much to date. I mean, we're way ahead of our competition. I mean, we're not in -- we're majority complete on our network modernization and the addition of those mid-band radios.\n\nWe still have more to do, and that's going to continue into '23 and '24, and that will continue to open up more opportunity, as we referenced earlier, for fixed wireless. I think the other piece we will continue to make, coverage investments. These networks continue to grow. Customer demands continue to grow.\n\nWe have great growth, as Callie referenced in our business and enterprise space. We need to feed that. We've got work to do still in small-town, rural America. So, our capex profile is feeding both.\n\nIt's all back to delivering that overall best network experience. And it's the combination of 5G. And everything we add on coverage is 5G capable, of course. So, the network, as Mike K.\n\nreferenced earlier on, is all about 5G. And we have a great leadership position, and our plan as we go forward is to extend that.\n\nMike Sievert -- President and Chief Executive Officer\n\nThank you. Terrific. All right. Let's go back to the phone.\n\nThank you. I think this is the last -- is this the last question? You tell me, Jan. Timing-wise, we'll take one more. OK.\n\nGreat. So, we'll go back to the phone. Operator?\n\nOperator\n\nThank you. And that question will come from David Barden with Bank of America.\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys, really appreciate it. Thank you so much. Hey, Mike. Thank you for taking the questions.\n\nSo, I guess two, if I could. I mean, the first would be, I guess, for Peter, which is presupposing we get to this point where T-Mobile shares are over $150 a share. We have these 48.8 million shares that we're going to issue to SoftBank, and you've got this buyback. And you've left a lot of options on the table for how you can use that buyback to use open market operations or structured buybacks.\n\nI was wondering if you could kind of share with the market a little bit of your thinking about how to address that overhang and what the -- what SoftBank's potential selling of those shares could mean for T-Mobile? And then if I could, the second question, Mike, would be -- Verizon advertised at the very beginning of this quarter that they were going to have a big churn bubble and that that would contribute a lot of switchers to the market and that they expect that that's going to change in the fourth quarter. Could you address kind of how you think that \"churn bubble\" affected your performance in the third quarter? And how we should think about the fourth quarter as that unfolds? Thank you.\n\nMike Sievert -- President and Chief Executive Officer\n\nGreat. Well, maybe we'll have Peter start with the first one. I'll just give you a premise on it, which is ever since we wrote this business plan during the merger and then gave you our outlook for what we thought we could accomplish, we've always been assuming that that dilution event is coming because it's only $150 where it would trigger, and that's all the way out to, what, 2025, I think. And so, our minds have always been, yes, that's on its way.\n\nIt's sort of nothing new. I hope we're right about that. But maybe, Peter, you can talk about the question, which is how do we address the overhang, and is there any interplay with the share buyback? And then we'll get to the second piece about share.\n\nPeter Osvaldik -- Chief Financial Officer\n\nYeah. Absolutely. And as you'd expect, Dave, obviously, we consider all of those things. But frankly, there's no serious discussion happening around that now.\n\nAnd that's probably because you'll have to ask SoftBank, but I would assume that they much like we assume that this was going to happen, right? And that delivery on this plan and those audacious goals that we gave out to you would achieve $150 a share. And so, there really are no significant ongoing discussions at the moment around that, probably because that's exactly what SoftBank assumes. And I got to tell you, we're just -- we're so pleased on being able to start that share buyback earlier on the success of the integration progress, the business progresss, as well as achieving core family investment-grade rating and to be able to begin a significant share buyback program early. Now, I will remind you on the SoftBank shares, that 48.8 million, it does come with some restrictions.\n\nYou were asking me about what happens in terms of them selling those shares, and again we hope they'll be long-term holders with us, but that's a question for them. But there are restrictions on their ability to sell those shares. That's part of the agreement between them and DT that's public out there. For example, they can't sell any of those shares at DT is not at 51% ownership at a minimum.\n\nThere's a certain amount they can't sell through the end of '24 no matter what. They have some ability to monetize a portion of those shares, not via sale, but other mechanics that they might employ. But there's some restrictions there that everybody should keep in mind in terms of the SoftBank shares.\n\nMike Sievert -- President and Chief Executive Officer\n\nRight. And then on the churn bubble. Look, I mean, time will tell whether or not what we're seeing in the competitive dynamic is long-term or short-term. I mean, to us, these last few quarters have looked like really consistent competitive mill use.\n\nYes, it's very competitive out there. Yes, our competitors sort of stepped in it by jacking people up with price increases while they're stuck into phone payment plans and surprising them that way. And I do think, by the way, that there's a difference in philosophy between our companies. Our company is absolutely obsessed with the power of our brand.\n\nAnd for a decade now, we have been building fame and trust as the company that puts you first those customers, that gives you the best value, and that changes the rules of this industry in your favor. And our competitors saw inflation as an excuse to go grab some short-term money and said, \"Don't worry, it'll all be over in a few weeks.\" I mean, some people will leave, and there will be a bubble. But then it's all over. And of course, it's not all over.\n\nPeople don't forget that. That's the power of brand. And we've shown that for a decade now what happens when you gain fame as a customer advocate. We're all duking it out on the network side now that T-Mobile has become competitive, and we've got the best 5G, and that's rapidly transforming into the best network.\n\nAnd you could say that perception-wise, there's a lot of similarity these days. It's not even close on value and customer trust and Net Promoter Score. We're up this year. They're down.\n\nOur fame for having the best value was twice theirs. It's not even close, and they made it worse this year. And so, we'll see how that unfolds. Yes, I bet you that there will be some short-term effects that may be the initial onslaught of people leaving because of what they did to their customers might slow down.\n\nBut in terms of the word-of-mouth value and the ability for us to perpetuate our ongoing success built on our fame is the customer advocate, that gets better and better with the passage of time because they're carriers, and we're the Un-carrier.\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nThat's great. Thank you so much, Mike.\n\nMike Sievert -- President and Chief Executive Officer\n\nThanks. OK. Great. And, Jud, is that all the time we got?\n\nJud Henry -- Senior Vice President and Head of Investor Relations\n\nThat is all the time we have today. But again, we really appreciate everybody joining us. If you have any other questions, please reach out to the investor relations or media relations team, and we look forward to speaking with you again soon. Thank you, everyone.\n\nMike Sievert -- President and Chief Executive Officer\n\nThanks, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJud Henry -- Senior Vice President and Head of Investor Relations\n\nMike Sievert -- President and Chief Executive Officer\n\nPeter Osvaldik -- Chief Financial Officer\n\nJonathan Chaplin -- New Street Research -- Analyst\n\nNeville Ray -- President of Technology\n\nCraig Moffett -- MoffettNathanson -- Analyst\n\nMike Katz -- Chief Marketing Officer\n\nJohn Hodulik -- UBS -- Analyst\n\nJon Freier -- President of Consumer Group\n\nCallie Field -- President of Business Group\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nMichael Rollins -- Citi -- Analyst\n\nBrett Feldman -- Goldman Sachs -- Analyst\n\nDavid Barden -- Bank of America Merrill Lynch -- Analyst\n\nMore TMUS analysis\n\nAll earnings call transcripts"
}