{
  "companyName": "Waste Management",
  "companyTicker": "WM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/waste-management-wm-q3-2022-earnings-call-transcri/",
  "content": "Waste Management (WM -1.25%)\nQ3 2022 Earnings Call\nOct 26, 2022, 11:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the WM third quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Ed Egl, Senior director of investor relations.\n\nPlease go ahead.\n\nEd Egl -- Senior Director, Investor Relations\n\nThank you, Katherine. Good morning, everyone, and thank you for joining us for our third quarter 2022 earnings conference call. With me this morning are Jim Fish, president and chief executive officer; John Morris, executive vice president and chief operating officer; and Devina Rankin, executive vice president and chief financial officer. You'll hear prepared comments from each of them today.\n\nJim will cover our high-level financials and provide a strategic update. John will cover an operating overview, and Devina will cover the details of the financials. Before we get started, please note that we have filed a Form 8-K this morning that includes the earnings press release and is available on our website at www.wm.com. The Form 8-K, the press release and the schedules of the press release include important information.\n\nDuring the call, you will hear forward-looking statements, which are based on current expectations, projections or opinions about future periods. All forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially. Some of these risks and uncertainties are discussed in today's press release and in our filings with the SEC, including our most recent Form 10-K. John will discuss our results in the areas of yield and volume, which unless stated otherwise, are more specifically references to internal revenue growth, or IRG, from yield or volume.\n\nDuring the call, Jim, John and Devina will discuss operating EBITDA, which is income from operations before depreciation and amortization. Any comparisons, unless otherwise stated, will be with the third quarter of 2021. Net income, EPS, operating EBITDA margin and SG&A expense results have been adjusted to enhance comparability by excluding certain items that management believes do not reflect our fundamental business performance or results of operations. These adjusted measures, in addition to free cash flow, are non-GAAP measures.\n\nPlease refer to the earnings press release and tables, which can be found on the company's website at www.wm.com for reconciliations to the most comparable GAAP measures and additional information about our use of non-GAAP measures and non-GAAP projections. This call is being recorded and will be available 24 hours a day beginning approximately 1:00 p.m. Eastern Time today. To hear a replay of the call, access the WM website at www.investors.wm.com.\n\nTime sensitive information provided during today's call, which is occurring on October 26, 2022, may no longer be accurate at the time of a replay. Any redistribution, retransmission or rebroadcast of this call in any form without the express written consent of WM is prohibited. Now I'll turn the call over to WM's president and CEO, Jim Fish.\n\nJim Fish -- President and Chief Executive Officer\n\nThanks, Ed, and thank you all for joining us. Our team delivered strong results in the third quarter, growing adjusted operating EBITDA by 11% compared to last year. The outperformance is driven by the strength and resiliency of our collection and disposal business. In a quarter where the preponderance of macroeconomic discussion is centered around signs of a slowing economy, WM's collection and disposal operating EBITDA grew by more than 12% and margins expanded 60 basis points.\n\nCollection and disposal organic revenue growth was 8.8%, elevating quarterly total revenue -- company revenue to above $5 billion for the second consecutive quarter. The growth was delivered -- excuse me, the growth we delivered was driven by delivered steps to grow revenue and efficiently manage costs, which together, position us to overcome inflationary pressures. Our solid results through the first nine months of the year position us well to achieve the updated guidance provided last quarter, even with a recent downturn in recycling commodity prices. An important contributor to our improving trend in operating expenses and overall cost structure is the strategic decision to leverage, through automation, the tight labor market and high attrition.\n\nJohn will touch on this as he discusses our significantly improved turnover in more detail. By the end of 2022, we will have reached almost 1,000 full-time positions in difficult-to-source job categories that we've chosen not to refill, putting us well on our way to reducing our labor dependency by 5,000 to 7,000 jobs. We're pleased to see early benefits from our investments to reduce our cost to serve while also differentiating WM by enhancing the customer experience. Continuing on this discussion of our 2023 and beyond strategy, we're very pleased with our investments we're making in both renewable natural gas and recycling businesses.\n\nOn RNG, we continue to make great progress on building out our new plants as we expect 2023 to be the heaviest capital investment year. We're on track to see meaningful earnings contributions from 2022 and 2023 investments in 2024, with full incremental operating EBITDA contributions coming in 2026, which are conservatively estimated at $400 million. Our recycling business not only provides an important service that our customers want and need, it continues to be a profitable business generating solid returns. We worked hard to adjust our business model over the last several years, and we saw the results of that in the third quarter, particularly in our automated facilities.\n\nOur five fully automated MRFs are now delivering differentiated results relative to our single stream network, with about 30% lower labor costs, 13% lower total operating costs, nearly double the operating EBITDA margin and most importantly, a 40% improvement in key safety metrics. We're on track to complete four automation projects and add one new MRF in 2022. The significant investments that we're making in growing and automating our MRF network are strengthening the business by reducing costs, increasing throughput and improving product quality. As with our R&D investments, 2023 will be the heaviest year of capital spending, and the rebuilding of our single-stream MRFs was the biggest increase in incremental earnings coming in 2024 and 2025 as the majority of the rebuild and new MRFs come online.\n\nAdditionally, as part of our commitment to growing our recycling business, we announced that we are acquiring a controlling interest in Avangard Innovative's U.S. business. The planned acquisition will grow our plastics recycling capabilities by delivering circular solutions for films and clear plastic wrap used commercially. We expect to receive investment returns comparable to our recycling automation investments yet on a more prolonged horizon, given that operations are in the early stages of scaling.\n\nWe plan to provide a more detailed update during our fourth quarter earnings call once the deal closes. Also on the M&A front, we completed more than $200 million of acquisitions in the third quarter, putting us well on our way to our full year expectation of $300 million to $400 million. We closed two nicely sized solid waste tuck-in acquisitions in Indiana and Arizona during the quarter. These acquisitions are a complement to our existing operations that we expect to generate solid returns and earnings contribution in 2023.\n\nAnd finally, I'm pleased to share that earlier this month, we released our 2022 Sustainability Report, providing details on our ESG performance and outlining our new 2030 priorities. These new priorities are strongly linked with our overall company strategy and directly support expansion of our recycling and renewable energy businesses. Even as we celebrate continued progress in our sustainability journey, we're already focused on driving improvements in the future. In closing, I want to thank the entire WM team for their hard work and dedication.\n\nWe're focused on finishing 2022 strong while continuing to progress our investments in recycling, renewable energy and automation to drive growth. I'll now turn the call over to John to discuss our operational results for the quarter.\n\nJohn Morris -- Executive Vice President, Chief Operating Officer\n\nThanks, Jim, and good morning. Exceptional organic revenue growth continued to be a key contributor to our strong results in the third quarter, led by collection and disposal yield of 7.1%. Robust core price across every line of business led to third quarter core price of 8.2%, up 70 basis points from the second quarter. We continue to prioritize customer lifetime value in our pricing strategies, and we maintained third quarter churn of 8.7% when adjusted for steps we took to intentionally shed three large unprofitable contracts.\n\nWe remain focused on disciplined pricing in the fourth quarter, positioning us to achieve our full year revenue growth guidance of about 10%. In the third quarter, volume remained at healthy levels as workday adjusted collection and disposal volume grew by 1.7%, including special waste volume growth of nearly 15%. Commercial volume adjusted for the contract losses I mentioned was 1.4%. We continue to grow volumes as our team's focus on differentiating WM as a preferred service provider.\n\nIn addition, our teams in Florida are rising to the challenges from Hurricane Ian, taking care of their teammates and communities. While there were increased costs from business disruption and property losses in the quarter related to the hurricane, we are well positioned to handle storm volume as clean-up activity ramped up in fourth quarter. We remain focused on controlling operating costs. Adjusted operating expenses were 62.2% of revenue in the third quarter, in line with prior year.\n\nAnd while we still see high single-digit inflation, our operating expenses as a percentage of revenue in the solid waste business improved 70 basis points compared to last year. Over last year, we made significant investments in our people, including proactive wage adjustments, an improved benefit package and increased training. Those investments are paying off as driver turnover improved 410 basis points in the past three months, and sequentially, the rate of increase in labor costs improved more than 400 basis points. Leading repair costs remain elevated and are being impacted by the slowdown in truck deliveries, a tight labor market for technicians and higher cost for parts and third-party services.\n\nThe impact of higher fuel costs increased operating expenses as a percentage of revenue by 50 basis points. This increase was completely offset by the alternative fuel tax credits realized in the third quarter related to the first half of 2022. While cost inflation appears to be easing, the inflationary environment only serves to reinforce our commitment to using technology and automation to reduce our labor dependency across the business and lower our cost to serve. As Jim discussed, we continue to have strong conviction in our recycling business.\n\nWhile global markets drive the value of recycled commodities, the steps we've taken over the past few years to shift around 85% of our third-party volumes to a fee-for-service model provides protection on the downside. So while there is a level of earnings variability, the recycling business is profitable and generate solid returns in any economic environment. Our blended average commodity rate in the third quarter was about $94 per ton. We are assuming a blended commodity value of about $50 per ton for the fourth quarter of 2022, which compares to $132 in the same quarter of 2021.\n\nThese recent commodity market moves, combined with persistent cost inflation, are expected to be about a $50 million year-over-year headwind to operating EBITDA in the fourth quarter. We're very focused not only managing costs in recycling business but also investing in automation across our MRF network to structurally lower the cost of processed material and achieve better quality, which further enhances the protections afforded by our fee-for-service model while providing profitability lift even in the toughest markets. In the renewable energy business, we continue to see strong performance with operating EBITDA in the first nine months growing $24 million. The second of our 17 new RNG plants announced at the beginning of the year is on track for completion at the end of the year and is expected to begin generating revenue in the third quarter following EPA certification to generate RINs credits.\n\nIn closing, we are very pleased with our third quarter results, and we continue to operate our business with notable focus on disciplined cost control and responsible revenue quality improvements. I want to thank the entire WM team for their invaluable contributions to our success. I'll now turn the call over to Devina to discuss our financial results in further detail.\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nThanks, John, and good morning, everyone. As we've seen all year, our team delivered strong results in the third quarter, driven by organic revenue growth, diligent cost management and proactive steps to automate the business. We continue to see improvement in our collection and disposal business as our strategic focuses on fostering a people-first culture and investing in automation are driving nearly tangible results. Adjusted operating EBITDA in the collection and disposal business grew $174 million in the quarter, which contributed to total company operating EBITDA margin expansion of 50 basis points to 28.6%.\n\nPerformance in the collection and disposal business, net of fuels, drove 120 basis points of margin improvement. Operating EBITDA margins also benefited 50 basis points from the passage of the Inflation Reduction Act, which secured alternative fuel tax credits through 2024. These 50 basis points relates to the catch-up adjustment we made in the quarter to recognize the benefits of these credits for the first half of 2022. Partially offsetting these very strong results were headwinds of 50 basis points from recycling commodity prices, 30 basis points from the impact of higher fuel costs, 20 basis points from increased technology and automation investments and 20 basis points from damage to some of our facilities and vehicles caused by Hurricane Ian.\n\nProactive management of SG&A continues to be an important element of our business optimization efforts. In the third quarter, SG&A was 9.2% of revenue, a 50-basis-point improvement over the same period in 2021. Through the first nine months of the year, SG&A was 9.6% of revenue, which is consistent with the full year outlook we provided last quarter. Year to date, cash flow from operations increased more than 4%, driven by operating EBITDA growth of nearly 10%.\n\nCash flow from operations growth is muted relative to operating EBITDA growth due to higher cash taxes, higher bonus payments, a delay in cash benefits from alternative fuel tax credits and some moderation in working capital benefits from last year when we saw significant benefits from our new source to pay system. Through the first nine months of the year, capital expenditures have totaled $1,725,000,000 with just over $1.4 billion of that related to normal course capital to support the business and the remaining $322 million related to the strategic growth of our recycling and renewable energy businesses. As I mentioned in July, we were starting to see some encouraging signs of improvements in truck deliveries, and we're gaining traction on our sustainability investment project. These early indicators continued throughout the third quarter, and we're pleased with the increased pace of capital investment that our teams have secured.\n\nWe currently expect this accelerated rate of capital to continue in the fourth quarter, positioning us to finish the year on plan for capital expenditures. Turning to our 2022 outlook. Our solid operational performance in the first nine months of the year positions us to achieve the guidance we provided last quarter. We continue to expect revenue growth of approximately 10% and adjusted operating EBITDA within the range of $5.5 billion to $5.6 billion, which represents an operating EBITDA margin of 28.1% at the midpoint.\n\nOur operational performance puts us on track to achieve our free cash flow guidance of greater than $2.15 billion. However, in the fourth quarter, we now anticipate making an additional cash tax payment of about $100 million related to a 2017 matter. Considering this payment, we expect 2022 free cash flow of between $2.05 billion and $2.15 billion. When we call all of this together, we're pleased to report results that meet or exceed expectations across all key financial metrics.\n\nCombining this strong performance with the stability and certainty afforded by a healthy balance sheet, business confidence in our ability to deliver on strategic priorities through the uncertain economic backdrop. At the end of the quarter, our leverage ratio was 2.65 times and 19% of our debt portfolio had variable rates. In conclusion, we are very pleased with the company's performance in 2022. We have strong conviction that the investments we are making in growing our sustainability businesses and in using technology and automation to optimize our business are setting us up for future success.\n\nThe team remains hard at work on delivering a strong finish to the year and setting a solid foundation for 2023. With that, Katherine, let's open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Tyler Brown with Raymond James. Your line is open.\n\nTyler Brown -- Raymond James -- Analyst\n\nHey. Good morning, everyone. \n\nJim Fish -- President and Chief Executive Officer\n\nGood morning, Tyler.\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nGood morning, Tyler.\n\nTyler Brown -- Raymond James -- Analyst\n\nHey, Jim. Just to start, I know you guys mentioned that you broadly maintained the guidance for the full year. I think that included the EBITDA of $5.5 billion to $5.6 billion. But obviously, that's a pretty big range with one quarter left.\n\nI know we've got a lot of movement in commodities. We've got a weak Canadian dollar. Are we kind of tracking more toward the low end of that range? Just any help would be appreciated just to kind of tighten up that range.\n\nJim Fish -- President and Chief Executive Officer\n\nI think we're tracking still around the midpoint, Tyler. I mean, it is a fairly broad range of $100 million, but we feel pretty comfortable about the midpoint. Some of it obviously depends on what happens in Florida. But for the year, it's going to be a little bit of a positive.\n\nI mean -- actually, a little bit of a negative. We were $20 million cost for Q3 and Q4 combined is what we expect it to be. And so right now, we're estimating kind of a $15 million benefit. That will change.\n\nAnd so that's going to help determine where we finish within that $5.5 billion to $5.6 billion. So I'd say it's a little bit of a negative. That is based on what we know today, but that number will certainly change. And so that's why we're thinking that the middle of the range is achievable.\n\nTyler Brown -- Raymond James -- Analyst\n\nOK, great. That's very helpful. And then, Devina, I know it's just maybe a little too early to give too much. But when we start thinking about some of the puts and takes on free cash flow next year, number one, can you just kind of remind us what your floating debt mix is? And at current rates, is that a headwind? Two, how do we think about cash taxes in light of this $100 million payment? And three, will some of the incentive comp bonuses be paid, will that be a headwind or a tailwind as we think about '23?\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nYeah, that's a great question, Tyler. And I think in order to frame it the right way, I'd focus on how we finish 2022, and 2022 has been a fantastic free cash flow year for us. And really, we start that and look at it most importantly on EBITDA strength. When I look at what we expected for the year, we were expecting a $300 million to $400 million increase in EBITDA on a year-over-year basis, and we're going to knock that out of the park and finish the year.\n\nWe've already achieved $371 million of EBITDA growth through nine months. And so when you think of the fact that we should deliver another $100 million to $200 million of growth in the fourth quarter, it really does speak to the strength of the year. When we look at the headwinds though for the year ahead, it really is what's creating a little bit of noise in our 2022 free cash flow. Interest and tax is leading the way but there is some working capital noise as well.\n\nOn the interest and taxes line, we now expect a headwind on a year-over-year basis of about $250 million. We started expecting that headwind to be $75 million to $125 million. And when I look ahead, the fourth quarter payment I mentioned relating to the 2017 matter really doesn't do anything to change the trend of cash taxes. But the trend of cash taxes will be impacted by the step change in bonus depreciation.\n\nSo there's a 20% reduction in the amount of benefit from bonus depreciation in the year ahead. That will create some sort of impact. I haven't yet quantified that. We'll give you more color on that in the fourth quarter.\n\nInterest, on the other hand, will be more significant. As I mentioned in my prepared remarks, about 20% of our debt is at floating rate. When I look at that, combined with the rate resets on maturing debt, you've got about $2.2 billion of our debt balances that will be exposed to some rate lease set in the next 12 months. We're currently projecting that could be about $100 million headwind in the year ahead, but more color because, candidly, that number has changed very dramatically in the last three months.\n\nThree months ago, I was looking at a $40 million annualized headwind. So to see that move that much in just a three-month period is quite significant. On the working capital side, through nine months, we've had a headwind of $22 million from not having cash from the alternative fuel tax credits. Right now, we expect that to normalize.\n\nAnd for '22 to '23, there should be no impact from that whatsoever. On the incentive comp side, that's a headwind this year of about $40 million. Incentive compensation is expected to be higher for '22 performance than it was for '21, so there could be an incremental headwind for that in the year ahead, but I don't have specific amounts to share. All in all, what I would say is the below-the-line headwinds are offset substantially by that growth that we're seeing in the EBITDA of the business, particularly from strong solid waste performance.\n\nAnd as we continue to make capital investments in sustainability businesses, there will be noise associated with what that total free cash flow number looks like over the long term. But we expect to see growth in core solid waste performance that track to those long-term trends and even exceed the long-term trends that we've set forth.\n\nTyler Brown -- Raymond James -- Analyst\n\nPerfect. Lots in there. I appreciate that very much. I'm sure there'll be some talk about pricing so I'll go ahead and turn it over.\n\nThanks.\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nThanks, Tyler.\n\nOperator\n\nThank you. And our next question comes from Toni Kaplan with Morgan Stanley. Your line is open.\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nThanks so much. Tyler just teed it up. Why don't we talk about pricing? This year, some of the strongest pricing we've really seen. How are you thinking about pricing in terms of a trajectory into '23? I know some of that's already just based on the inflation this year sort of locked in.\n\nJust how are you thinking about the trajectory there?\n\nJim Fish -- President and Chief Executive Officer\n\nYeah. Good morning, Toni. Obviously, pricing continues to be a key driver for us on the top line. All of the lines of business show really significant price strength.\n\nCommercial yield was approaching 10% at 9.8%, 11% for industrial, 6.3% resi. So -- and then I guess, 6.5% on the industry line. I expect that price will continue to be an important driver of our earnings. We've kind of been using price to combat this inflation issue over the last 12 months, and so most of it is really good cost recovery.\n\nI'd want to get to a point where price is not just cost recovery but also margin expansion. And I think that's going to be the theme for price going forward. We do expect that inflation will start to come back down a bit in 2023. And so I think we were asked the question last quarter, what's the ideal inflation number.\n\nI don't know what the ideal inflation number is, but I said it's not 9%. I know that. And so I think you'll start to see us apply a little bit more price to margin expansion, not just cost recovery, and that's really what it's been. Even with very high price numbers, it's been something that we've had to do in order to cover the cost inflation.\n\nI will say this, I think maybe a piece of our earnings and Devina and John have talked about how good solid waste was, but the piece that might have been the most surprising to us was volume really. If you think about collection and disposal volume being positive 1.7%, and there was a little bit of a headwind in there with the hurricane. But still, 1.7% at a time when everybody is speculating about when is the economy going to turn down was really impressive to us. I looked at our numbers this morning.\n\nSpecial waste was still up 50% last week. So our volume continues to be relatively good and that was the positive part for us. I think you -- when we ask why are we seeing that? I think it's probably two things. So even in the face of really pretty heavy pricing, I think we are seeing us continue to take market share.\n\nAnd I also think you're seeing our service show up better than our competition, which is positive for us.\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nSuper. I wanted to ask also about the commodity basket. I know you talked about it and sized it in the prepared remarks. But could you just remind us, I guess, I know you have in the past had some sort of sharing agreements with customers to mitigate exposure to commodities.\n\nI guess what percentage of contracts have that or however you think about sort of the mitigation of being exposed totally to the price? And I know you have the recycling brokerage business. And does that sort of mitigate you as well? And I guess outside of OCC, which commodities are you most exposed to?\n\nJohn Morris -- Executive Vice President, Chief Operating Officer\n\nSo Toni, on the brokerage piece, we've always said that certainly augments what we do in our -- in the piece of the business that we actually process the material. And that's low margin, no capital, but from a return standpoint, it makes a lot of sense and helps us leverage our ability to move all the materials. So we still feel good about that business. From a marginal standpoint, it actually abates from the margin as prices go down.\n\nOn the traditional side, we've talked about how we protect the business on the downside two ways. One is floor pricing for some of the fiber grades that we have, and that's certainly something we consider when we're talking about the movement in fiber prices and how it affects the overall P&L. The second piece is really what we've done from a fee-for-service model over the last couple of years. And I think the takeaway is, while we're showing some variability and profitability at these prices have taken such a precipitous drop, and it's really mostly the fiber side, the takeaway is the business is still performing well.\n\nWe're still happy with it. It's making money and it's not changed our long-term view of what we're going to do on the recycling business.\n\nJim Fish -- President and Chief Executive Officer\n\nYeah. So maybe I'll add there, and that is to give you a little bit of insight into what we've done with these contracts, just to put this in perspective, if -- when the price drops from $110, and this is our bucket of commodities, drops from $110 to $100, the impact on that is about -- on earnings, it's about $8 million, $8.1 million to be exact. If the price were to drop from $50 to $40, the impact is only about $3 million, a little bit more than, a little maybe $3.5 million. So you can see that as price drops, the negative impact on EBITDA really starts to slow.\n\nAnd that is representative of all the changes we made contractually over the last five years. And to John's point, even with a significant drop-off in price for the third quarter and expecting that in the fourth quarter, too, that we still have the ninth best recycling quarter in our history for Q3. I don't think we would have been saying that five years ago.\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nTerrific. Thank you so much.\n\nOperator\n\nThank you. One moment for our next. Our next question comes from Jerry Revich with Goldman Sachs. Your line is open.\n\nJerry Revich -- Goldman Sachs -- Analyst\n\nYes. Hi. Good morning, everyone. \n\nJim Fish -- President and Chief Executive Officer\n\nGood morning.\n\nJerry Revich -- Goldman Sachs -- Analyst\n\nI'm wondering if we could -- can we talk about how you're thinking about your collection and disposal pricing from here? Just conceptually, do you feel like with the headwinds in recycling, we now need to push pricing more on the collection and disposal part of the business to offset the $100-plus million headwind in EBITDA from recycling into next year? Said another way, do you feel like you've got enough pieces in place to continue to push percent margins as we think about what the next 12 months might look like?\n\nJim Fish -- President and Chief Executive Officer\n\nYeah. I mean, I kind of think of them a little differently. They're such different businesses from a price perspective. I will say this about price in the solid waste business.\n\nI feel like there's room for price increases. Jerry, 15, we went for almost 15 years with kind of nothing. I remember talking about 1% price, 1% volume many, many years ago. So the business really went for quite a long time without getting any price increases.\n\nAnd yet now all we're doing is trying to recover this, as I said, this four-year high inflation. I think in the core business, in the solid waste business, you'll continue to see us use price in a significant way to cover cost but also improve margins. At the same time, as John and I have discussed, taking cost out of the organization, taking advantage of this tight labor markets through attrition, we saw a fair amount of that in '22. We'll see more '23 and '24.\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nI think the other thing I would point out on the margin side, Jerry, is if you look at Q3 of 2022 as a barometer of how we're performing, we talked about solid waste improving on a year-over-year basis by 120 basis points based on where we are today. And the impact from recycling commodity prices being 50 basis points of an offset to that. And we're really happy to say that we delivered 28.6% so I think that's a great indicator of where we're starting '23. And so that's with the headwind of recycling almost fully baked in.\n\nAnd so I think we're set up well with where the pricing levels are today. And then we have continued expectations for price based on the rollover of our index pricing that happened in the first half of '23 that sets us up well there, too.\n\nJerry Revich -- Goldman Sachs -- Analyst\n\nSuper. And can I just shift topics on the landfill gas side? And nice to see 30% of your volumes locked in. I'm wondering, can you just talk about the terms? prior to last week's announcement was talking about the market essentially being in the 20s with attractive escalators for long-term deals. Can you comment on, is that similar to the structure that you're seeing or any additional context you could provide for us on the terms?\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nYeah, it's a great question. And for us, what we're looking at is the mix of business that we'll have over time. And if we look at our expectations for how this portfolio grows, we could see our renewable energy grow 6x from where it is today. And with that level of growth, we've got to look at this as a portfolio.\n\nAnd the step that we took and that you saw the results of in the third quarter to secure some of this pricing over the long term is an indication of our desire to ensure that we're securing returns as we outlined in our initial expectations. So as Jim mentioned, those are certainly conservative outlooks for how we see this business grow. I won't specifically speak to the terms of the contracts that we have in place. But as we have thought about it, these are on the longer end of what we expect to do.\n\nAs we manage this portfolio over time, they're more on the 10-year end where we think that we will also be managing things with three to five-year contracts as the portfolio grows.\n\nJerry Revich -- Goldman Sachs -- Analyst\n\nOK. Super. And lastly, can you just talk about how the voluntary landfill gas purchase market is coming in so non-RIN market? How is the marketplace developing? Obviously, on paper, a lot of folks have commitments to purchase landfill gas. I'm wondering as you're having the conversations, how have the conversations played out versus your expectations on market debt?\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nYeah. That's one of the key points that Tara and her team keep speaking to us about, that this is not just the transportation part of the market, it's the non-transportation part of the market. And people in public utilities and institutions who are looking to decarbonize are seeing the RINs market as an attractive place to help to achieve their goals and objectives, which I think is speaking to the strong demand and outlook for the years ahead. We do expect the other thing that will help bolster some clarity on the outlook for this business will be the EPA setting rule in Q4.\n\nAnd so hopefully, those things working together will give us better visibility as we set our expectations for the earnings contributions of this business in '23 and beyond, which we'll give you color on in the fourth quarter call.\n\nJim Fish -- President and Chief Executive Officer\n\nI think, Jerry, it's important to point out that this big investment that we announced a couple of quarters ago really is only covering 17 new plants. And we have close to 100, and we discussed this with you when we're on the road, 100 landfills that could go into that bucket. Right now, we're really focusing on just 17. So there's a lot of opportunity to grow the business beyond that.\n\nJerry Revich -- Goldman Sachs -- Analyst\n\nSuper appreciate the discussion, and don't worry, we won't put the 100 in our models yet. Thank you.\n\nOperator\n\nThank you. Our next question comes from Noah Kaye with Oppenheimer. Your line is open.\n\nNoah Kaye -- Oppenheimer and Company -- Analyst\n\nThanks for taking the questions. First, just a little bit of housekeeping on the recycling impact in the quarter. Can you maybe help us understand, was there anything in the timing of how quickly the basket dropped in the quarter that impacted your profitability versus, say, a normalized run rate? Because it does seem like the decrementals were a little bit higher maybe in quarter than what you are talking about even for 4Q or on a run rate basis.\n\nJohn Morris -- Executive Vice President, Chief Operating Officer\n\nYeah. I think that was certainly the precipitous drop, particularly in the fiber markets. There's a little bit of lag there so you'd argue there was a little bit of an outsized impact on the quarter. I think what I would point to, Noah, is we looked at the -- not just the sequential but the quarter-over-quarter change in pricing and how that affected the overall EBITDA headwind.\n\nAnd I think what you're seeing is resiliency in the business that we would, to Jim's point, we wouldn't have seen four or five years ago. It's still profitable business. And if you look at kind of the old calculation of what this $10 a ton means, we've certainly separated from that. You can see that in what we did in Q3 and you can see in Q4 going from $130 to $94 produced a $36 million headwind.\n\nAnd for Q4, we're seeing $50 a ton going from $131 to $50 is a $50 million headwind. And as I pointed out, it's still a profitable business. So I think we've achieved a big part of our goal. But specifically on your question, because of the precipitous drop, there's probably a little bit of a lag there.\n\nNoah Kaye -- Oppenheimer and Company -- Analyst\n\nYeah. And I just want to clarify, I think someone earlier talked about a $100 million headwind from where recycling is that today going into 2023, if we just sort of levelize today. Is that math correct? I think Jim had mentioned the decrementals would actually get even better as we get to lower levels here. So if we just take today's basket price and say, OK, here's where we're at for 2022, as we enter 2023, do we have a $100 million headwind or should it be something less?\n\nJohn Morris -- Executive Vice President, Chief Operating Officer\n\nYeah. No, I think -- I don't think it's going to be $100 million. of it is if we had a crystal ball where the price is going to look like and we have a view of what pricing will do. And I think you'll see a little bit of improvement from Q4 to Q1 and then sequentially throughout the year.\n\nThe level of improvement is really what is going to drive that answer. But I don't think even in this environment, it's, I think, quite $100 million.\n\nNoah Kaye -- Oppenheimer and Company -- Analyst\n\nYes. OK, great. And one quick one on pricing and churn, if you don't mind. You talked about kind of continued headroom for pricing.\n\nThat certainly makes a lot of sense. Can you talk a little bit about kind of the current customer discussions and whether you're starting to see any greater pushback on price? It would sort of point to some of the macro concerns that people have been raising.\n\nJohn Morris -- Executive Vice President, Chief Operating Officer\n\nYeah. If you look year-to-date and even quarter over quarter, you can see the improvement that we've made both in core price and yield. But we didn't talk too much about it but it's a good spot. When we look at A, we're still growing volume in commercial, industrial when you take out a little bit of the noise I mentioned in my prepared remarks.\n\nThe residential piece, again, we've got a strategy there that we've employed over the last couple of years. But the other thing we look at is obviously what's going on in Net Promoter Score, customer receptivity, the pricing. We're looking at churn. We're looking at holdbacks, and holdbacks actually improved quarter over quarter.\n\nSo all indications are that the pricing activities we're engaged in. And we've taken a much more strategic look at that over the last handful of years and use some tools that we didn't have a handful of years ago. And I think that's why you're seeing the uplift in pricing performance without really conceding our ability to grow volume and take some share.\n\nNoah Kaye -- Oppenheimer and Company -- Analyst\n\nPerfect. Thanks so much for the color.\n\nOperator\n\nThank you. Our next question comes from Michael Hoffman with Stifel. Your line is open.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nThank you very much. If we could come back to price, has core crossed the lines of business and yields peaked yet? And if not, when do you think you start hitting a peak?\n\nJim Fish -- President and Chief Executive Officer\n\nHas core -- did you ask has core price peaked?\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nYeah, right. Yeah, core price and then the conversion to yield, which, by the way, you had a very good conversion to yield this quarter. It's improved each quarter. So I'm trying to understand the core and yield overall and then that conversion ratio, has it peaked?\n\nJim Fish -- President and Chief Executive Officer\n\nIt's a tough question to answer just because I don't know exactly what happens with inflation. But what we did say is we expect inflation probably starts to come back down, which then would imply that core price has peaked. If inflation went to 15%, which nobody expects, then I would tell you the answer is no. So for now, I think you could say that core price has peaked.\n\nI think the most important aspect though of pricing is the point that we've made a couple of times, which is instead of just recovering costs, we'd love to be able to have a little margin with price. And for most of 2022, it's been kind of fighting this inflation battle with pricing.\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nAnd I think the point make a lot....\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nSorry, Devina. Go ahead, sorry.\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nYour point on the conversion of a core price seller to a yield dollar is a great one. And I think it goes to what John was speaking about just recently on customer receptivity rollbacks turn. And we do really think that all of that is being benefited by was a tough operating environment right now and the hard work that the men and women who pick up the garbage for all of our communities every day are doing. It's a tough labor environment.\n\nOperators are seeing challenges, and we are differentiating our services and continue to be a go-to service provider. And so when price is most affected in translating to yield, it's when we hold on to existing customers. And because our service levels are differentiated and because small competitors are having a hard time meeting the needs because driver availability has been a challenge, we are holding on to more and more of our customers and differentiating ourselves each day. And I think that, that will continue to be a strength for the business in the year ahead.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK. So the segue for me on all of that is your entry price going into '23 basically should reflect your exit price coming out of '22. And then you are all alluding to, there's structurally a point at least to volumes. So we're having conversations as you're somewhere around eight on the top and I'm asking for directional, not guidance, just am I in the right neighborhood? You're eight on the top before you get the M&A rollover, which I would love to hear what your current thought is on your M&A rollover.\n\nAnd then costs start coming down. So I think there is a wider-than-normal spread setting up between where you're going to report a price and where your actual costs are going to play out over the course of the year. And that would lead you to above-average margins. And Devina, you suggested we should start with the 28.6% as sort of a baseline and then it can improve.\n\nIf I do that, looking at this year, I'm having -- you're having above-average margin expansion here in '23. Have I thought about that correctly?\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nI think when you think about the solid waste business in isolation, that is absolutely correct. We have talked about the recycling line of business and the headwind increase and that will be a drag on margin, particularly in the first half of '23. But I think your overall thesis about pricing and exiting '22 and crossing over into the beginning of '23 is the right one. And the flow-through of that to earnings expansion to Jim's point about wanting to see more of that really start to be more than accretive rather than just covering our cost.\n\nI think we'll start to see better traction on that in '23. I'll give you two data points because I think you kind of asked for them in your question, one being the rollover benefit of M&A. It was about $200 million of acquisitions during the quarter. That's $135 million of annualized revenue, so the rollover benefits a little south of $100 million to 2023.\n\nAnd then the other point is on the index pricing. And our index pricing, we look at that, that's the 40% mix. And our current projection is that with the puts and takes between what's CPI-based, which what is fixed and what is capped, we think that, that will be at about five and a half percent in the year ahead, which is pretty consistent with what we were seeing in the back part of this year. So we're pleased that, that gives us strength going into the rollover of overall core price starting in Q1 of '23.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK. So one last piece on that, then what I'm hearing is sales are up, EBITDA are up somewhere in an 8% to 10% zone based on what you just shared. But based on an earlier question about free cash, free cash all-in capital spending, including above-average growth is probably flat to down, given the headwinds?\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nAll-in capital spending is flat to down? Is that what you said or free cash flow?\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nNo, no. All-in free cash flow -- all-in -- free cash flow with all-in capital spending, meaning all gross spending, not just normal growth. You're flat to down.\n\nJim Fish -- President and Chief Executive Officer\n\nLook, I think we'll give a lot more detail here in a couple of months. But to be a surprising but when we come and say free cash flow for 2023 is going to be down all-in versus 2022 because you've got -- as I mentioned in my prepared remarks, we -- the biggest year of capex for these RNG plants and for the rebuilds of the recycling plants is going to be 2023. So we're talking about something in the $1 billion of capex for those versus $500 million, $550 million, I think, is the exact number for this year. So it's going to be $450 million or $500 million of additional capex just for that.\n\nSo if we're looking at free cash flow all-in for 2023, it's going to be down.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK. I think just everybody needed to understand that directionally, just so there are no surprises, right? You're going to have a great sales EBITDA trend. Free cash is what it is for all the growth, and then I'm going to get a real nice bump in that free cash come '25, '26?\n\nJim Fish -- President and Chief Executive Officer\n\nYes, that's right. That's right. One quick to what Devina said about -- she talks about index-based pricing. We've said a lot -- several times that because of the 12-month lookback on a lot of these contracts, the two biggest quarters for adjustment will be Q1 and Q2 of 2023.\n\nSo we are looking forward to that.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nYes, OK. And then last thing on the RNG just so I understand this. You have shared that in '21, you get about $40 million of contribution from that and then you've added new projects in '22. That $24 million improvement is partly spot market rates plus new or is it all new projects?\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nNo. It's some spot market rate increase. As a reminder, RINs pricing in the first half of '22 was really strong above $3. So there was a big piece of that, that was RINs pricing.\n\nThere was some that was electricity and then some was incremental contribution from project development.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nOK. And again, managing expectations, I know the $400 million is a good number, no question on that. But it's really weighted heavily back-ended because the bigger -- two bigger driving projects of this are later in the development cycle. You got a whole bunch of little ones early and then a couple of really big ones later.\n\nThat we should all remember that, right?\n\nJim Fish -- President and Chief Executive Officer\n\nThat's right. Look, 2025, for RNG, this thing really takes off like kind of a space show in 2025 because so many projects are coming online in 2024. And a lot of that capex is being spent in 2023. So if we think about kind of inflows and outflows of cash, we started it basically in '22, maybe a little bit before.\n\nBut '22, the big outflow on the capex side for our two plants is in '23. But these things have -- there's a bit of a lag with respect to construction. So a whole lot of those plants, I think 11 to be exact, come online at some point during 2024. Some of them are -- and they're pretty much spread throughout the year.\n\nSo the big inflows really start in earnest in 2025. And then we get to a full, full run rate in 2026 for RNG. It's a little bit sooner for recycling.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nRight. Got that. And then I realize you're still in budgets, Devina, but you shared with us bonus depreciation change like. How do we think about the effective tax rate for next year? Is it up, down, flat?\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nEffective tax rate, we've guided at around 24 and a half percent generally. I expect it will be a little higher next year. But as we've talked about, I don't have specific.\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nYup, I got it. I just didn't need to directionally tune the model. All right. Thank you very much.\n\nNice job on the price, folks. Keep it up.\n\nOperator\n\nOne moment. Our next question comes from Sean Eastman with KeyBanc. Your line is open.\n\nSean Eastman -- KeyBanc Capital Markets -- Analyst\n\nHi, everyone. Thanks for taking my questions. I wanted to just come back to the sustainability growth investment program, how that translates into EBITDA over the next couple of years. I feel like the discussion with Michael there gave us a good idea on the RNG piece, just as we think about when these projects are kicking in.\n\nBut then if we move over to the kind of recycling automation side, maybe help flesh that part of it out a little bit. And then even beyond the sustainability element, my understanding is there's another automation bucket in terms of more back office elements. And understanding how that kind of EBITDA benefits flows into the model in terms of timing. Anything around this would be very helpful.\n\nJim Fish -- President and Chief Executive Officer\n\nSo I'll take a little bit of it, and then maybe John can add on here, Sean. So you've kind of touched on the strategy there, which is really reducing our labor dependency, taking advantage of the tight labor market and attrition. And so that's one bucket. And we've said that's -- we think that number can be as many as at 5,000 to 7,000 positions, we've gone through what those different buckets are.\n\nSome of them come out of recycling. These rebuilds are worth somewhere between 30% and 40% reduction in labor. Most of that, by the way, is third party because a lot of those are pickers on the line, and that's what those are, in large part, third-party. But as John talked about, third-party has been a pretty big source of inflation in our cost over the last year.\n\nSo there's that bucket. There are -- there's our customer experience bucket. By the way, Sean, our calls are down almost 27% year over year. That's a sign of our improving customer service.\n\nAnd so at the same time, we're -- as we've used technology within customer experience, we're just simply not replacing some of these positions. We've had as high as almost 50% attrition in customer experience. And so while we don't like that number, it's an awfully high number, it makes it challenging for our management teams to kind of staff, this is an opportunity for us to use the technology that we put in place to take advantage of that attrition, and we have done that. So by the end of this year, there will be, as I said, about 1,000 jobs that we won't have chosen to replace.\n\nAnd then that goes from 1,000 up to as many as 5,000 to 7,000. That's kind of bucket one. And then we talked a lot about RNG, as you said, and that kind of gave you a bit of a layout there. With the recycling investments, there's really three forms of earnings uplift there.\n\nAnd the earnings uplift comes from the 30% to 40% reduction in labor. It comes from improved quality at the back end of the plant, and then it comes from increased throughput. So as you add all this technology, optical sorting technology, you really start processing a lot more material. One of our big plants in Wisconsin plans on going from 12,000 tons a month to 18,000 tons a month, so the throughput is going up by almost 50%.\n\nAnd as you look at the rollout of that, as I said in my script, we think that the EBITDA pickup is maybe a year sooner than RNG. We think RNG kind of gets to full run rate by 2026. We think it's probably maybe 2025 for these rebuilds. We're kind of rebuilding as quickly as we can.\n\nFortunately, I haven't seen a lot of pressures, John, on the supply chain side for equipment coming in. At the same time, Sean, we're also building some new plants where we have a need. So there's -- and we are taking a sharp pencil of that in today's low commodity price environment. But there are some markets, even with low commodity prices, where we definitely have a need.\n\nSo I think what you'll see is the big capex coming in '23, the EBITDA continuing to show up in '23, but really the big EBITDA bump will come in '24 or '25.\n\nSean Eastman -- KeyBanc Capital Markets -- Analyst\n\nOK. That was very detailed. I really appreciate that and I'll turn it over there.\n\nOperator\n\nThank you. We have a question from Walter Spracklin with RBC. Your line is open.\n\nWalter Spracklin -- RBC Capital Markets -- Analyst\n\nYeah, thanks so much, operator. Good morning, everyone. So my question is coming back to -- I know, Jim, you and the team were talking about what you've done within your contracts on the recycling side to limit when commodity prices go down. The negative impact on EBITDA kind of contracts as prices go down, which is great.\n\nI'm wondering if there's -- as the industry consolidates, as the desire for recycling goes higher, and Jim, your own comment about getting recycling margins up to more your average margin. And finally, given the increased volatility in your earnings stream associated with commodity prices from recycling and natural gas waste energy conversion, is there anything more you can do with regards to your contracts akin to, say, what a transport company will do with a fuel surcharge and effectively pass the entire price change on to the customers? Is that something you could envision that it will be a pure fee-for-service and you will relinquish or get rid of any of that exposure that you have to commodity prices via some kind of surcharge program that you could adjust in your current pricing? Just curious as to what you're thinking about further changes to contracts that would allow for that.\n\nJohn Morris -- Executive Vice President, Chief Operating Officer\n\nSo Walter, we've talked about that a little bit in general, but I think specifically to your question, that's what you're seeing show up in our results. When you look at the numbers I referenced about Q3 to Q3 and Q4 forecast -- Q4 actual and Q4 forecast, a couple of things. One, that business is still generating healthy margins and great returns. We've talked about returns on the recycling business, not just EBITDA margins.\n\nAnd I think the reason why you're seeing that is because we've kind of repriced, if you will, about 85% of our third-party processing agreement. So we've got a little bit of room to go there. And the way we're doing that, you've heard us talk about the revenue structure, but also this battle against contamination and the phases of revenue levers that we've pulled to make sure that folks look at our processing plants is just at a processing facility, where we're going to get paid the process and we're getting a fair restart on top of that before we really start to engage in what the revenue share is. So while none of us are happy about the drop and how precipitous the drop was, I think what we're all taking inventory of is the fact that our recycling business at our MRFs are still producing good returns, good cash flow and margins.\n\nAnd that's what years of conviction about us, in particular, on the automated capital we're going to invest because that's not really commodity-based. That's really driving down opex and positioning us, I think, your earlier point, to be able to continue to grow that business even in a down environment.\n\nWalter Spracklin -- RBC Capital Markets -- Analyst\n\nPerfect. That's great color. Appreciate it.\n\nOperator\n\nThank you. Our next question comes from Michael Feniger with Bank of America. Your line is open.\n\nMichael Feniger -- Bank of America Merrill Lynch -- Analyst\n\nHey, everyone. Thanks for squeezing me in. Just to clarify, the $50 a ton assumption in Q4, Devina, is that what your basket looks like in October or is that assuming maybe some recovery in November, December to get to that $50 a ton number?\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nIt's a projection of our blend over the three-month period, and there has been basically a continued decline, so we projected that.\n\nMichael Feniger -- Bank of America Merrill Lynch -- Analyst\n\nOK, great. And then just on RINs, like I think they're now at 250. So just so we understand the moving pieces there, this was -- it was flat contribution this quarter. It's been a positive on a year-to-date.\n\nIf RINs stay where they are, Devina and step below the first half of next year, does that mean this is a headwind to EBITDA in 2023 or because of maybe some projects coming on, that offsets that? Just trying to think about the RIN being at 250, and that's below where we saw a very strong RIN in the first half of this year, just to level set what that means for 2023.\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nThat's a great question, and you're thinking about it the right way. Because RINs have come down from the highs we saw in the first half of '22, our current outlook for '23, although preliminary, would be that you could have some EBITDA headwind associated with the market prices. The offset, as Jim's talked about, for earnings growth associated with new plants coming online doesn't really start to materialize in any material fashion until more like 2024. So 2023 still meaningfully construction-oriented, not significant impact from new capacity.\n\nMichael Feniger -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And Jim, a while back, you laid out these targets, revenue growth 4% to 6%, EBITDA growth 5% to 7% with a cost inflation of 3% to 4%. When you look today with the cost inflation, obviously high, what should we kind of be thinking about these ranges and what cost inflation could kind of look like for 2023, since that cost inflation is one of the factors you were talking about that kind of drives your guys' pricing decisions in the open market?\n\nJohn Morris -- Executive Vice President, Chief Operating Officer\n\nYes, Michael, I mean we're going through that exercise right now, looking to see what costs look like for 2023. We have some pretty aggressive goals we've discussed internally. And I think there's 5,000 to 7,000 positions that we will choose not to refill. With technology, that helps us get there.\n\nThe pushback on that on the other side is inflation. And so hopefully, we get a little bit of help from inflation that starts to come down. But we do feel like the business can run at a lower cost structure, whether it's an operating cost structure or an SG&A number. When you heard Devina talk about SG&A number for the quarter, which at 9.2%, I don't know that anybody would have thought about that number for a quarter a few years back.\n\nAnd so it's pretty impressive that we're there. Some of that is attributable to some of these positions that have come out. It's a little bit of kind of both categories, opex and SG&A, where these positions have come out over 2022. But we do think that cost and cost efficiency is going to be a very important part of our strategy going forward.\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nAnd of the three that you articulated, Michael, the most important of those is the EBITDA growth outlook. And if we look at 2022's performance, that traditional range that we guided to of 5% to 7%, we have meaningfully exceeded that in a year where this business grew organically, and it was managing the toughest cost environment that we've ever seen. And so we're really pleased to see EBITDA dollars up 11% in the quarter. So we're revisiting what that long-term range should be.\n\nMichael Feniger -- Bank of America Merrill Lynch -- Analyst\n\nMake sense. Thank you.\n\nOperator\n\nThank you. And our next question comes from Dave Manthey with Baird. Your line is open.\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nYeah, thank you. Sorry, I jumped on the call here a little late. But if you covered these, I can follow up offline. As we're looking down the cost stack here, just a couple of minor questions.\n\nYou may have commented already, but on hiring and retention, what type of labor inflation are you seeing currently kind of on a per person basis before these productivity-related attrition trends and so forth? Can you just talk about that? And then second, wondering about maintenance and repairs. I'm not sure if you manage that top down or bottom up, but are you seeing any delays there because parts or labor shortages? And any kind of update you can provide on the level of routine maintenance activity today.\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nYeah, they're great questions. And basically, from a wage inflation perspective, a year ago, we were at around 11%. We've seen that come down to about 7%, so that's that 400-basis-point improvement that we're talking about. Very happy to see where we are today, and we think the proactive steps we took a year ago are paying dividends today.\n\nOn the repair and maintenance side, I would tell you, we manage it both top down and bottom up. We also side to side. We manage it in every direction, and it's something that we have collaborative approaches on across the business. And it's the toughest cost category for us.\n\nAnd it's got a lot of different factors that result in it being so difficult, one being delayed trucks, and that's one of the places that we really need to see some traction on, and we're working with the manufacturers to be sure that we get the trucks that we planned for when we expect them. The other things that are happening is technicians in the marketplace are very valuable across the transportation space. And so making sure that we are the preferred employer, it has been a priority. We have made investments there and we'll continue to invest in the future.\n\nAside from that, the things that are really driving increases are commodity-based inflationary pressures that we've seen on lube and parts and supplies. And we are seeing some moderation there that gives us some hope that in 2023, there will be some moderations on the high levels we saw in '22.\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nSounds good. Thank you for the detail.\n\nOperator\n\nThank you. And there are no other questions in the queue. I'd like to turn the call back to Mr. Jim Fish for closing remarks.\n\nJim Fish -- President and Chief Executive Officer\n\nOK, thank you. And I do know that some of our Florida team are on the call listening today, and I just want to let them know how proud of them we are during this recovery from Ian, a tough hurricane particularly with the storm surge coming in as much as it did. And we did lose property. We've talked about that.\n\nOur folks lost some property as well. Fortunately, everybody was safe. Everybody on the WM Florida team was safe. And you should all know that we're standing right next to you and standing next to Floridians in general during this recovery.\n\nSo thank you, though, for your efforts throughout this, particularly there in southwest Florida. Thanks again to everyone for joining us today, and we'll talk to you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEd Egl -- Senior Director, Investor Relations\n\nJim Fish -- President and Chief Executive Officer\n\nJohn Morris -- Executive Vice President, Chief Operating Officer\n\nDevina Rankin -- Executive Vice President, Chief Financial Officer\n\nTyler Brown -- Raymond James -- Analyst\n\nToni Kaplan -- Morgan Stanley -- Analyst\n\nJerry Revich -- Goldman Sachs -- Analyst\n\nNoah Kaye -- Oppenheimer and Company -- Analyst\n\nMichael Hoffman -- Stifel Financial Corp. -- Analyst\n\nSean Eastman -- KeyBanc Capital Markets -- Analyst\n\nWalter Spracklin -- RBC Capital Markets -- Analyst\n\nMichael Feniger -- Bank of America Merrill Lynch -- Analyst\n\nDave Manthey -- Robert W. Baird and Company -- Analyst\n\nMore WM analysis\n\nAll earnings call transcripts"
}