{
  "companyName": "Cisco Systems",
  "companyTicker": "CSCO",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/16/cisco-systems-csco-q1-2023-earnings-call-transcrip/",
  "content": "Cisco Systems (CSCO 0.29%)\nQ1 2023 Earnings Call\nNov 16, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to Cisco's first quarter fiscal year 2023 financial results conference call. At the request of Cisco, today's conference is being recorded. If you have any objections, you may disconnect. Now, I would like to introduce Marilyn Mora, head of investor relations.\n\nMa'am, you may begin.\n\nMarilyn Mora -- Head of Investor Relations\n\nWelcome, everyone, to Cisco's first quarter fiscal year 2023 quarterly earnings conference call. This is Marilyn Mora, head of investor relations, and I'm joined by Chuck Robbins, our Chair and CEO; and Scott Herren, our CFO. By now, you should have seen our earnings press release. A corresponding webcast with slides, including supplemental information, will be made available on our website in the investor relations section following the call.\n\nAs is customary in Q1, we have made certain reclassifications to prior period amounts to conform to the current period's presentation. Income statements, full GAAP to non-GAAP reconciliation information, balance sheets, cash flow statements, and other financial information can also be found in the Financial Information section of our investor relations website. Throughout this conference call, we will be referencing both GAAP and non-GAAP financial results and we'll discuss product results in terms of revenue and geographic and customer results in terms of product orders unless stated otherwise. All comparisons made throughout this call will be made on a year-over-year basis.\n\nThe matters we will be discussing today include forward-looking statements, including the guidance we will be providing for the second quarter and full year of fiscal 2023. They are subject to the risks and uncertainties that we discuss in detail in our documents filed with the SEC, specifically the most recent report on Form 10-K, which identify important risk factors that could cause actual results to differ materially from those contained in the forward-looking statements. With respect to guidance, please also see the slides and press release that accompany this call for further details. Cisco will not comment on its financial guidance during the quarter unless it is done through an explicit public disclosure.\n\nWith that, I'll now turn it over to Chuck.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nThank you, Marilyn, and thank you all for joining us today. We are off to a good start in fiscal 2023, delivering strong results, exceeding the top end of our guidance range for both revenue and non-GAAP EPS. We delivered the largest quarterly revenue in our history, driven by excellent execution and the actions our team took to remediate our supply challenges. Given these results, along with the strength of our orders, our visibility, and easing supply constraints, we are raising our full year outlook, which Scott will cover later.\n\nWhile we are proactively managing through an evolving and complex market environment, we remain intensely focused on executing on our strategy, including our transition to more software and subscription-based recurring revenue. We achieved software revenue growth of 5% year over year and software subscription revenue grew 11%. The easing of supply constraints and our ability to deliver hardware is now releasing software subscriptions that were sitting in backlog connecting to unshipped hardware. Our success is also reflected in our ARR, which exceeded $23 billion, increasing 7%, with product ARR growing 12%.\n\nWe also ended the quarter with RPO of nearly $31 billion, up 3% year over year with product RPO up 5%. Over $16 billion of the RPO will be recognized as revenue over the next 12 months, with a backlog that remains elevated at near-record levels. These metrics give us increased visibility and predictability and provide additional confidence in our ability to perform through the current market cycle. It also underscores our unique position, helping customers become more agile and resilient as they continue to navigate a complex set of challenges.\n\nAs I've done in the past, I'd like to provide an update on supply chain before discussing our Q1 results. Like you've heard from others in the industry, we are encouraged by what we are seeing with modest improvement in certain component availability as shortages continue to ease from last quarter. The redesign of many of our products has also helped bring supply stability and more resiliency. Over the last few quarters, you've heard me talk about the actions we've taken to navigate supply constraints.\n\nThese actions are paying off and are contributing to our results. We now have greater visibility in the ramp of our customer product deliveries, which in turn gives us greater confidence in our fiscal 2023 outlook. Now moving to performance highlights in the quarter. We delivered revenues of $13.6 billion, up 6%, and non-GAAP EPS came in at $0.86, our second highest quarterly non-GAAP EPS in the history of the company.\n\nWe also generated $4 billion in operating cash flow and returned over $2 billion to our shareholders. These metrics show we remain committed to operating discipline and our balanced capital allocation priorities. We are continuing to invest in our long-term growth opportunities, while also returning capital to shareholders. In terms of our product orders in the quarter, it's important to note that the year-over-year comparison is against an unusually strong period of 34% growth in Q1 of fiscal year '22.\n\nFrom a geographic perspective, we saw some emerging cautiousness in Europe. This is driven by a dramatic increase in energy costs and market volatility, which is leading customers to assess their overall spend. However, this also presents an opportunity for us as our technologies like IoT, Silicon One, and Power over Ethernet drive a significant reduction in power consumption. To provide a normalized perspective, our Q4 to Q1 sequential growth was just slightly below the normal range over the last six years.\n\nIt's also important to note that this was the second highest Q1 orders in the history of the company. We have strong product revenue momentum in key parts of our business, including secure Agile Networks, security, and optimized application experiences. We also saw record performance from a number of products, including the Catalyst 9000 family, Cisco 8000, Wireless, Meraki, ThousandEyes, and Duo. Networking is becoming increasingly critical to every organization, led by digital transformation, hybrid cloud, AI, and ML workloads.\n\nThis is driving demand for our technologies. As we've discussed, there are also tailwinds to our business such as hybrid work, 400 Gig and Beyond, 5G, WiFi 6, security, and full stack observability. We believe these broader technology transitions will require every customer to rearchitect their network infrastructure, and in turn, fuel long-term growth across our portfolio. As I speak with customers, they tell me that while they are closely watching the economy, they remain focused on making the right investments across their business to increase their agility and drive greater innovation and productivity.\n\nIn our webscale business, demand remains solid, driven by their growing investments with Cisco to build out AI fabric and massively scalable cloud networks. Once again, we saw strong momentum with our Silicon One-based Cisco 8000 routers, we are experiencing robust demand for our 400-gig products and now have nearly 1,200 customers. On a trailing 12-month basis, webscale orders were up double digits or greater for the eighth consecutive quarter. Network capacity demand continues to increase, driven by 5G, IoT, pervasive video, and other technology trends I've mentioned earlier.\n\nWith our commitment to powering next-generation networks, while also driving sustainability, we launched new 800 gig switching platforms built on our Silicon One G100 chip to help meet customers' demand for more programmability, bandwidth, and energy efficiency. Let me now touch on our innovation, as I'm incredibly proud of how our teams have come together to deliver market-leading solutions for our customers. Security and hybrid work are now more critical than ever. We continue to extend our capabilities to enable customers to work more securely anywhere, while reducing cost and complexity.\n\nIn security, we introduced new data loss prevention, firewall, and Zero Trust capabilities across our portfolio. And in collaboration, we announced more than 40 new innovations to power hybrid work and deliver exceptional customer experiences. We're also committed to giving our customers more choice. An example of this is our partnership with Microsoft to bring Microsoft teams to Cisco meeting room devices.\n\nBy doing this, we are driving interoperability and demonstrating our openness to meet our customers' need and provide greater flexibility. To wrap up, we delivered another strong quarter of revenue and non-GAAP earnings growth. The strength of orders, increased visibility, and easing supply situation provides us with enhanced visibility and predictability which underpins the confidence we have in our business and our increased outlook for the year. Our performance this quarter is a testament to our innovation and execution to support our customers during these complex times.\n\nAdditionally, it reinforces Cisco's strength, durability, and discipline in how we manage the business while investing to capture the multiyear growth opportunities ahead. Our portfolio is in great shape and our business model is resilient, with 43% of our revenue now recurring, which is very important as we navigate the current macro environment. The hard work and dedicated commitment of our leadership team and employees over the last few years to transform our business model is reflected in the performance we delivered this quarter. Combined with the strength of our balance sheet and our position in the market, we have an excellent foundation for delivering long-term results.\n\nI will now turn it over to Scott.\n\nScott Herren -- Chief Financial Officer\n\nThanks, Chuck. We started the fiscal year with a strong Q1, reflecting solid execution and disciplined management. We had record total revenue of $13.6 billion, exceeding the high end of our guidance range, driven by product shipment levels above our expectations and continued improvements in component supply. Non-GAAP operating margin was 31.8%, down 150 basis points, in line with our guidance range, primarily driven by higher component costs, as well as logistics costs related to supply constraints.\n\nNon-GAAP net income was $3.5 billion, up 2%, and non-GAAP EPS was $0.86, up 5%, exceeding the high end of our guidance range. Looking at our Q1 revenue in more detail. Total product revenue was $10.2 billion, up 8%, and service revenue was flat at $3.4 billion. Within product revenue, Secure Agile Networks performed well, up 12%.\n\nSwitching revenue grew with double-digit growth in campus switching, driven by growth in our Catalyst 9000 and Meraki offerings. While data center switching modestly declined, we saw solid growth in our Nexus 9000 offering. Enterprise routing declined primarily from the product transition to our Catalyst 8000 series routers along with constrained supply. Wireless had very strong double-digit growth driven, primarily by our WiFi 6 products and Meraki wireless offerings.\n\nInternet for the future was down 5%, driven by declines in cable, optical, and edge. We saw growth in our Cisco 8000 offering and strong double-digit growth in webscale. Collaboration was down 2%, driven by a decline in meetings, partially offset by growth in calling. End-to-end security was up 9%, driven by unified threat management and Zero Trust offerings.\n\nOur Zero Trust portfolio continues to perform well, driven by strong performance in our Duo offering. Optimized application experiences was up 7%, driven by double-digit growth in our SaaS-based offering, ThousandEyes. We continue to make progress on our transformation metrics as we shift our business to more software and subscriptions. We saw strong performance in our ARR of $23.2 billion, which increased 7% with product ARR growth of 12%.\n\nTotal software revenue was $3.9 billion, an increase of 5%, with software subscription revenue up 11%. Eighty-five percent of the software revenue was subscription based, which is up 5 percentage points year over year. We continue to have over $2 billion of software orders in our product backlog. Total subscription revenue was $5.9 billion, an increase of 6%.\n\nTotal subscription revenue represented 43% of Cisco's total revenue. And RPO was up -- was $30.9 billion, up 3%. Product RPO increased 5% and service RPO increased 1%. Total short-term RPO grew to $16.4 billion.\n\nIn terms of orders in Q1, we had the second highest Q1 orders in our history. Although product orders were down 14% for the quarter, it's important to keep in mind that compare against 34% growth from a year ago. We continue to have low cancellation rates, which remain below pre-pandemic levels. Looking at our geographic segments year on year.\n\nThe Americas was down 10%, EMEA was down 23%, and APJC down 10%. In our customer markets, service provider was down 23%, commercial was down 14%, enterprise was down 13%, and public sector was down 7%. Total non-GAAP gross margin came in within our guidance range at 63%, down 150 basis points year over year. Product gross margin was 61%, down 280 basis points, and service gross margin was 68.8%, up 230 basis points.\n\nIn our product gross margin, the decrease was primarily driven by both component costs, as well as higher freight and logistics costs related to supply constraints. This was partially offset by strong positive pricing impact as a result of the actions we took in the prior year, as well as some benefit from product mix. Backlog levels for both our hardware and software continue to far exceed historical levels. As we navigate in a complex supply environment, we were able to increase our shipments this quarter, resulting in about a 10% decrease in total backlog sequentially, which remains at the second highest level we've seen.\n\nJust a reminder, backlog is not included as part of our $30.9 billion in remaining performance obligations. Combined, our significant backlog and RPO continued to provide great visibility to our top line. Shifting to the balance sheet. We ended Q1 with total cash, cash equivalents, and investments of $19.8 billion.\n\nOperating cash flow for the quarter was $5 billion, up 16% year over year. In capital allocation, we returned $2.1 billion to shareholders during the quarter. That was comprised of $1.6 billion for our quarterly cash dividend and approximately $500 million of share repurchases. All of this is in line with our long-term objective of returning a minimum of 50% of free cash flow annually to our shareholders.\n\nWe also ended the quarter with $14.7 billion in stock repurchase authorization. To summarize, we executed well in Q1 in a highly complex environment, delivering better-than-expected top-line growth and non-GAAP profitability. We continue to make progress on our business model shift to more recurring revenue while making strategic investments in innovation to capitalize on our significant growth opportunities. Consistent with that objective, we announced some restructuring actions focused on prioritizing our investments across our highest growth opportunities and rightsizing our real estate footprint to help maximize long-term value for our shareholders.\n\nTurning to our financial guidance for Q2. We expect revenue growth to be in the range of 4.5% to 6.5%. We anticipate non-GAAP gross margins to be in the range of 63% to 64%. Our non-GAAP operating margin is expected to be in the range of 31.5% to 32.5%.\n\nAnd non-GAAP earnings per share is expected to range from $0.84 to $0.86. For fiscal year '23, our guidance is we are raising our expectations for revenue growth to be in the range of 4.5% to 6.5% year on year. This is up from the prior range of 4% to 6% growth. Non-GAAP earnings per share guidance is expected to range from $3.51 to $3.58, also up 4.5% to 6.5% year on year.\n\nIn both our Q2 and full year guidance, we're assuming a non-GAAP effective tax rate of 19%. Our Q2 guidance reflects the increased visibility we have from our significant backlog and the RPO we have built up with our business model transformation, as well as the easing of supply constraints. The full year guidance rolls forward our Q1 overperformance with a prudent view of the remainder of the year. I'll now turn it back to Marilyn so we can move into the Q&A. \n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Scott. Michelle, let's go ahead and queue up the Q&A. \n\nOperator\n\nThank you. Meta Marshall from Morgan Stanley. You may go ahead.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks and congrats on the quarter. Chuck, I was just wondering if you could dive a little bit into more into kind of the commentary that you gave about Europe. And just also kind of what you are seeing in terms of level of activity or level of approvals needed within the U.S., that would be helpful.\n\nThanks.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nThanks, Meta. Yes, we saw -- I think Europe is obviously being impacted by the energy cost. And I think that's just forcing companies to take a look at their P&L as you would have to and where they spend their dollars. And we continue to see it not be quite as cold there.\n\nWe had conversations with some of our team members this week, which is a positive sign. But the other thing that I called out that I think is an important one is that customers are trying to solve this energy cost issue in a very aggressive way. And we have several technology areas that can help them do that, including our Silicon One technology, which powers their networks at much lower power consumption. You've got IoT where we can connect these energy systems and make them more efficient, as well as Power over Ethernet, which actually just reduces the power footprint for our customers.\n\nSo, it does also create some opportunity. I'd say if I go to Asia real quick, you've got -- Asia was actually pretty resilient. They're clearly aware of the economic situation that's going on, but we had five regions last quarter that were positive after big positives a year ago, including India, which grew significantly after significant growth the prior year. So, that was a good sign.\n\nSo, Asia is pretty resilient, it feels like right now. And then in the Americas, I'd say it's a little mixed. We have some customers who are powering forward and other customers who are taking a little cautious outlook. We think by December, we'll have better visibility to the 2023 budgets, which will be helpful.\n\nAnd to your question about more signatures, we have seen our customers have implemented greater signature requirements. But by and large, the deals that we have going are getting signed, they're just taking a little bit longer than we expect.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nNext question, please.\n\nOperator\n\nTal Liani from Bank of America. You may go ahead.\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nHi, guys. Thanks so much. Great quarter, and I see that the numbers are going up, but the question is how much of it is backlog flushed and how much of it is the environment? Meaning, I look at your product growth -- product orders, it's down 14%. Last quarter, it's down 6%.\n\nAnd the question is how is the environment itself? Is the environment weakening from an orders bookings backlog? Is the environment weakening and what we're seeing is acceleration because of supply constraints that are easing? Or is the environment holding up? And maybe you can refer to some kind of some of your big product categories to see how the trends are. Thanks.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah. Thanks, Tal. So, this is a question we expected. So I'm going to give you a little more detail than I probably normally would.\n\nFirst off, the two quarters we just finished in the next quarter, we have massive year-over-year comparisons from prior year. So, as we discussed last time, we think it's more important to look at sequential growth as an indicator. And as I said, we were slightly below our historic quarter-to-quarter range, roughly 1%. So, it wasn't significant, not completely out of line.\n\nCertainly, a little lighter than we would expect normally, but not significant. Enterprise and commercial on a global basis were both within the normal sequential range. Public sector was slightly out of range and service providers is just lumpy. So, the sequential reflection on service provider is not really valid.\n\nSo, demand was not -- it didn't fall off a cliff by any stretch. In fact, U.S. enterprise after -- upper 20s growth in the prior year, they actually posted low single-digit positive growth again. So that was a positive sign.\n\nOur order linearity within the quarter was in line. And remember, it was our second largest Q1 orders ever. So, the only quarter that was bigger was the quarter a year ago. So that's positive.\n\nNow what you're trying to get at, and I think everybody is trying to get at is, is this year being driven by backlog? And then as we go beyond that, everything falls apart. So let me give you some data points on this. Even if our orders are down 10% this year, which is not our forecast, we will still -- we project today that we will end the fiscal year with two to three times our historic year-end normal backlog. That normal backlog is typically $4 billion to $5 billion.\n\nSo, I'm giving you actual numbers here. And then when you couple that with 43% of our revenue now coming from recurring, which is reflected in our RPO, that's what gives us a high degree of confidence and a high degree of visibility in the near term. So hopefully, that helps you as I answer your question, Tal.\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nAll right. Thanks, Tal. Next question.\n\nOperator\n\nDavid Vogt from UBS. You may go ahead.\n\nDavid Vogt -- UBS -- Analyst\n\nThanks, guys, for taking the question. So, Chuck, maybe just as a point of clarification, you talked about the sequential decline. It was a little bit worse than seasonal. But you took down backlog by about 10%, looks like quarter over quarter.\n\nCan you just kind of help square those numbers because that sounds -- if I just say that you did about 13.1% last year in the fourth quarter, you'd be a little bit below [Audio gap]\n\nMarilyn Mora -- Head of Investor Relations\n\nDavid, I think we may have lost you. \n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nHope it wasn't. David, you're there? \n\nDavid Vogt -- UBS -- Analyst\n\nCan you guys hear me? \n\nMarilyn Mora -- Head of Investor Relations\n\nNow we can. \n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nWe lost you there. You got cut off in the middle of your sentence.\n\nDavid Vogt -- UBS -- Analyst\n\nSorry about that. Just can you help square the backlog versus the sequential commentary? If I look at your quarter-over-quarter backlog commentary, that was slightly below seasonal, but it sounds like you took down backlog by about 10%. So, it seems like there's about $600 million or $700 million of revenue that we're going to kind of triangulate on you can kind of talk through that, that would be helpful. Thanks.\n\nScott Herren -- Chief Financial Officer\n\nSure. Yeah. The backlog came down about 10%, leaving us with an ending backlog at the end of Q1. That was the second highest in our history and higher than what we had seen at the end of Q3.\n\nSo, we took a spike up a little more than 10% in Q4 and came back down in Q1. What Chuck was talking about on the sequential is really about the overall product bookings that came in versus where we're standing in backlog. So, the flow through of orders come in, drop in the backlog, that backlog then converts into revenue. The way you got to think about it is less about does the change in backlog convert to revenue growth and more of does the change in backlog convert to build.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nAnd remember, bookings contributed to both backlog and RPO. \n\nDavid Vogt -- UBS -- Analyst\n\nGot it. And maybe just one final thing on profitability. When software comes out of backlog, I would imagine that would have been a tailwind for gross margins in the quarter. Can you kind of quantify what that might have been in the quarter, given obviously, there's some supply chain pressure and logistics pressures on margin?\n\nScott Herren -- Chief Financial Officer\n\nYeah, you said it right. Longer term, the software component continuing to grow and us being able to ship that out of backlog will be a tailwind to margins. Right now, what we're shipping out of backlog is still a lot of aged product. We made great progress, by the way, on our aged backlog during the quarter, but a lot of what we're shipping out still is orders that were received prior to the price increases.\n\nSo, you see two things happening at once. You see the higher cost and the revenue is tied to pre-price increase sales at the same -- which obviously is a headwind to margins. At the same time, we see more software being shipped out which is a tailwind. Then that is it continues to be a pretty significant headwind.\n\n61% product gross margin in the quarter, in line with what we had seen in Q4. The good news is we made good progress on shipping out a lot of that aged backlog. There's still a little bit more to get out in Q2. And so, I expect by the end of the year, margins to expand from where they are now, product margins to expand 50 to 75 basis points.\n\nDavid Vogt -- UBS -- Analyst\n\nGreat. Thanks, Scott.\n\nMarilyn Mora -- Head of Investor Relations\n\nNext question, please.\n\nOperator\n\nIttai Kidron from Oppenheimer. You may go ahead.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThanks. Nice results. Chuck, I want to go back to your answer to Tal's question. It's very clear that with orders down and your ability to fulfill now much more enhanced that the backlog over the next few quarters will just continue to decline.\n\nSo, help us get our hands around what would be a level of decline that would make you worry versus a level of decline that you'd think as a normal pace in going back to historical normal levels. What would be the line in the sand would you say you would say more than this, we probably have an issue, but if it's around X, then it's perfectly normal and reasonable that, that will happen over the next 12, 18 months.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah, Ittai. We've actually modeled out various booking scenarios for the year. and it would have to be significantly worse than what I told you for it to be concerning. Scott, do you have any other comments?\n\nScott Herren -- Chief Financial Officer\n\nNo. I think what you're trying to get at is when do we get back to more seasonal patterns, right? Obviously, seasonality went out the window, both going into the pandemic and then coming out of it with those three consecutive quarters of north of 30% growth. We are beginning to see signs of season out, normal seasonality returning. It's going to be a little complex to see, though, because as supply constraints loosen up.\n\nWe'll be able to reduce lead times. We've already done that for a handful of product lines. And as we do that, of course, now have an effect on just the current period bookings. So, it's going to be a little bit difficult for you to spot those trends over the next as lead times normalize.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nVery good. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks. Next question, please.\n\nOperator\n\nTim Long from Barclays. You may go ahead.\n\nTim Long -- Barclays -- Analyst\n\nThank you. Yeah. Two quick ones, if I could. Maybe, Chuck, on the cloud vertical, could you talk a little bit -- still talking double-digit orders there.\n\nCould you kind of just parse out the deceleration in terms of maybe just normalization of extra quarters of ordering versus potential for -- there's been a lot of talk of normalization of spend by the cloud players next year. If you could kind of parse those two out. And then on the software side, just curious if you can update us. It sounds like a lot of hardware converted, which helped.\n\nCould you talk a little bit about kind of 9K renewals and maybe any of the other stand-alone software offerings that you think could also help that growth number in the next few quarters? Thank you.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah. Two good questions, Tim. So, on the cloud vertical, I think you're calling out the right thing that the normalization of the orders is going to probably occur over the next few quarters. In fact, I wouldn't be surprised to see our trailing fourth quarter rates over the next couple of quarters, maybe even dip negative because of such so much ordering ahead that we've seen.\n\nBut we continue to see real strong demand in general from them. We've done a great deal of long-term planning with them. We have some number of orders that aren't even in book. They don't even show up in bookings yet because they're out past our bookings lead time window.\n\nSo that's positive. So, we continue to see success there. We continue to win franchises, and we feel good about where we are there. On the software side, what I would say is that the 9k renewals are improving.\n\nThey're still not material right now. I think next year, we'll see that occur. What we did announce is the -- this past year is that we are going to manage all of the Catalyst portfolio under the Meraki dashboard, the Meraki platform, and that will be delivered to our customers who have the D&A license and the premium license. So, we think that in itself, we've already started -- we've already launched the monitoring capability there and the management.\n\nWe think we'll even improve our renewals beyond that. But as we said, we had a record quarter for Cat 9K. So, we're real happy with how it's performing. Scott?\n\nScott Herren -- Chief Financial Officer\n\nYeah. What I'd add to that, Tim, is if you're looking at software growth, bear in mind, the software subscription growth, the subscription subset of our total software grew 11%. And it's now 85% of the total. Obviously, with the total only growing 5%, there was a continued decline in perpetual as part of the software license.\n\nIt's now -- or software revenue. It's now 15% of our total. So, I think we're getting to a point where the subscription base is getting significantly larger than what's in perpetual, and that headwind on perpetual will be less of an impact on us going forward.\n\nTim Long -- Barclays -- Analyst\n\nOK. Thank you very much.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Tim. Next question, please.\n\nOperator\n\nPaul Silverstein with Cowen and Company. You may go ahead, sir. \n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nI appreciate you taking the question. At the risk of asking something you can't or will not respond, Scott. I was hoping to ask go back to the margin question. Two related questions.\n\nOne, well, just for clarification, the 50 to 75-basis-point product margin improvement, I assume that's off of the current quarter. Is that the reference point?\n\nScott Herren -- Chief Financial Officer\n\nYeah, 50 to 75 off the current quarter. That's right, by the time we get to Q4.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nAll right. And now for the subsequent question, longer term, and I recognize there's a lot of moving pieces, and it's a tough environment to predict. But longer term, can you get back to or even exceed, be almost 67% growth and 34% operating margin from early '21? Those were -- your gross margin was a 15-year high, your operating margin, you would have to go back to '97, I think the last time you put up that type of number. obviously, you're far off those numbers as has everybody else from what they were doing a year and a half ago, pre-pandemic.\n\nBut where do you think you could get back to long term? And related to that, what are your expectations, your plans are growing opex? I assume you want to drive some degree of leverage in the gross margin. Any thoughts you can share? The opex growth this quarter, I think, it was 4% or 5%. It strikes me with high. But any thoughts in terms of what your thoughts are going forward? \n\nScott Herren -- Chief Financial Officer\n\nSure. Let me take the gross margin piece of that first. There's a couple of moving parts, as you know, Paul, inside the gross margins. One is the backlog, some of which is still sitting at pre-price increase levels.\n\nWe'll get that shipped out as we work our way through that part of the backlog. Obviously, that will be a tailwind. The increasing component of software built into our revenues will be a tailwind. Will it get back to 65%? I think there's -- for that to happen, we'll have to see either further cost reductions on the input side between freight and logistics, which we are beginning to see.\n\nWhile they're up year on year, sequentially, we're beginning to see some signs of easing in freight and logistics costs as well, but we'll have to see that. And we'll have to see a further reduction in component costs and/or a price increase. So, I think it's -- without giving you a quantified number, I think there's a number of moving parts inside there. More tailwinds as we look ahead than there are headwinds on that.\n\nOn the opex side, the part of what you see in this quarter, of course, is that the normalization of our bonus plans. Last year, bonus plan obviously didn't pay out so well. As we go into this year and you normalize that, that's part of the opex growth. We did have a slightly bigger than normal annual merit increase cycle.\n\nThat's driving some of the opex growth as well. I think our focus longer term is -- which you've heard me say, it's balanced profitable growth, right? If you look at our guide for the year, 4.5% to 6.5% growth in the top line, 4.5% to 6.5% on the bottom line. Long term, we talked about 5% to 7% top line, 5% to 7% bottom line. I think that's really the way you need to think about it.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nI appreciate it. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nNext question, please.\n\nOperator\n\nGeorge Notter with Jefferies. You may go ahead.\n\nGeorge Notter -- Jefferies -- Analyst\n\nHi, guys. Thanks very much. I wanted to ask about the impact of foreign exchange. Obviously, U.S.\n\ndollar at 20-year highs. Maybe you can talk about how you're approaching that conversation with customers internationally, are you seeing any diminishment of demand? What's the picture? Thanks a lot.\n\nScott Herren -- Chief Financial Officer\n\nYeah, I'll start with the numbers on that, George. And I'm sure you know this. We sell about 90% of our revenue denominated in USD. So there's not a big translation impact to us for the strength of the dollar.\n\nIt's not insignificant, but it gets offset by the benefit we get on the opex line. So, FX to us from a translation standpoint really hasn't had a material impact. As we look at the -- now you're selling in USD with an elevated exchange rate to the dollar, there's no question that is having a bit of an impact. Certainly, one of the things contributing to what Chuck talked about earlier that we're seeing in Europe, not only are they battling high inflation in their own markets, but that increased cost in local currency to transact has been a bit of a headwind.\n\nBut we've dealt with this. We've sold in USD through the entire history of the company. Not expecting it to be something that has a lasting impact on us.\n\nGeorge Notter -- Jefferies -- Analyst\n\nGreat. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nLet's go ahead and take our next question, please.\n\nOperator\n\nAmit Daryanani from Evercore. You may go ahead, sir.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nThanks for taking my question. Yeah, I guess, maybe the first one, I was hoping you could touch on the service provider market. I think you said orders were down 23%. That seems a bit more severe than the rest of the portfolio.\n\nWhat's happening there in any newly service provider versus web scale would be helpful.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nI couldn't understand the question. \n\nMarilyn Mora -- Head of Investor Relations\n\nCan you repeat the question? \n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nYeah. I'm sorry. So, I was hoping you could talk a bit about the service provider order decline of 23% seems a bit more severe than the rest of the business. And then anything over there between web scale and kind of the traditional service providers would be helpful.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah. Amit, thank you for that. And I think the reality around that one is simply if you go back a year ago, that segment grew 65%. I think that's the fundamental issue.\n\nI don't think there's anything else going on.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nGot it. And I guess maybe if I could just ask you just about the full year guidance. Maybe you folks have lined it, right? And you just did 6% growth against a very difficult compare, and I guess the way to your guide, but on using much of an explanation for the rest of the year despite compares to getting easier. So, I guess, Chuck, it's not just being conservative or are you seeing signs in your backlog or your orders that give you a pause on that business.\n\nIf you could easily compares, I would imagine is got accelerate a bit for the year.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nNo, there's nothing that's giving us pause in that. I mean we guided up the full year in revenue from what had been a guide of 4% to 6% growth of 4.5% to 6.5%. That effectively rolls forward the outperformance that we had in Q1 into the full year. There's no change in the way we're looking at the second half of the year, either plus or minus.\n\nBut it's a prudent view of what we expect in the next three quarters.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nThank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nNext question, please.\n\nOperator\n\nSimon Leopold with Raymond James. You may go ahead, sir.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThank you for taking the question. I wanted to see if there was some way you could characterize your own lead time. So if you had customers placing orders today from Meraki products or campus switches or data center gear, what are the lead times for getting the product for your customers? And how does that compare to the prior quarter and prior year? Thank you.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah, I'll make some comments, and then Scott, if you want to add some color, feel free. The range on the products is very wide right now. We still have a couple of product areas that we have component issues that we're doing some work, and I think we've got probably one more quarter before we start improving those. We've got other products like we have certain firewalls that are down to three-week lead times.\n\nWe have some of the products we've redesigned that I've talked about before. It went from 40 weeks to 12 weeks and will continue to improve. I think we made improvements in roughly half of the portfolio. Half of the product families improved last quarter, and we would expect to continue that progress as we move forward.\n\nSimon Leopold -- Raymond James -- Analyst\n\nAnd just as a quick follow-up. As you're showing improvement, do you see that affecting your ability to maintain or take market share where perhaps you were more vulnerable when the lead times were more extended?\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah. I think the whole market share discussion is reflected in our backlog. I mean, that's the issue. And as we ship it, you will see us -- I think you'll see us over the next 12 months gain market share as we have an outsized backlog that we'll be delivering.\n\nSo, I would expect that to have a positive impact.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThank you very much. thanks.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Simon. Next question.\n\nOperator\n\nJames Fish with Piper Sandler. You may go ahead, sir.\n\nJames Fish -- Piper Sandler -- Analyst\n\nThanks for the question. On the restructuring plan, I know these things are never easy, and we had picked up that the collaboration side we're seeing some layoffs. But what product areas are being most hit? How should we think about the reduction of headcount here overall? What's the strategy to change the direction of some of these growth businesses around that have been kind of struggling to growth? And by that, I really mean the collaboration side. And how much are you guys factoring this kind of impact into the top line here on guide? Thanks.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah. So, we're actually speaking to our employees tomorrow about this. So, I'd be reluctant to go into a lot of detail here until we're able to talk to them. I would say that what we're doing is rightsizing certain businesses.\n\nWe're really focused on resource moving into like in the enterprise networking space, accelerating our platform strategy. We will be making significant investments in security and beefing up our team there and the capacity to continue to innovate there. Those are important areas. And so, if you would understand, I'd prefer to wait and talk to our employees tomorrow about it.\n\nBut you can just assume that we're going to -- we're not actually -- there's nothing that's a lower priority, but we are rightsizing certain businesses. And since you asked about collab, I'll tell you a little bit about what -- we see incredible strength right now in our calling business, our cloud calling business. We see great strength in our cloud contact center business. And the compares on the meeting side are going to start to make that -- give us the ability for that to be a much more favorable component.\n\nSo, we're -- I actually am optimistic over the next 12 months about our collaboration portfolio. The team has done an amazing job. I truly believe that they built the best platform in the business. And when you look at our devices and the interoperability that the team has been driving with the Microsoft interoperability, that is a huge, huge thing when you -- from a customer perspective for us to give them that flexibility.\n\nSo, I think they've done a good job, and I feel pretty good about that business as we go forward. We just need to rightsize some of the opex.\n\nScott Herren -- Chief Financial Officer\n\nAnd James, to be clear, don't think of this as a headcount action that is motivated by cost savings. This really is a rebalancing. As we look across the board, there are areas that we would like to invest in more, Chuck just talked about them. Security, our move to platforms and more cloud-delivered products.\n\nBut we're also going to maintain our financial discipline as we do that. And so, this is about just rebalancing across the board. In a perfect world, you'd have 100% skill match, and you can take the people in the areas or the skills in certain areas and just move them to where we need to invest. And unfortunately, that's not a perfect.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nBut we do have a -- if you look at the number of jobs that we have opened in the areas that we're trying to invest, it is just slightly lower than the number of people that we believe will be impacted. We're going to be working really hard to help match our employees to those roles to the extent there's a skill match. So, we're going to work really hard at that.\n\nJames Fish -- Piper Sandler -- Analyst\n\nIf I could just follow up quickly on that. I appreciate the color there, guys, and understand the sensitivity you guys want to have. In terms of that $600 million hit though, Scott, should we expect that to actually be the net savings as a result? Or is that going to -- the net saving is actually going to be lower because you're kind of repositioning some folks?\n\nScott Herren -- Chief Financial Officer\n\nYeah. It's really not motivated by cost savings. So the net -- by the time we get to the end of the year, our expectation is we have about the same headcount that we had at the beginning of the year. But there's two pieces to this.\n\nOne is what we've been speaking about just now about the headcount impact. There's a second piece of this, that's really about rightsizing our real estate portfolio. And we've got a long tail of small offices distributed around the world that are significantly underutilized, and in fact, unused in some cases. So the second piece of that charge, there will be two elements to it.\n\nOne that's people related, the second piece will be about rightsizing our real estate portfolio. That will generate some savings, not much in fiscal '23, but longer term, that will generate some savings.\n\nJames Fish -- Piper Sandler -- Analyst\n\nWell, thanks, guys.\n\nMarilyn Mora -- Head of Investor Relations\n\nNext question, please.\n\nOperator\n\nSamik Chatterjee with J.P. Morgan. You may go ahead, sir.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks for taking my questions and congrats on the strong print. I guess I just had one. I think if I can go back to the -- Chuck, your comments about seeing hesitation from EMEA customers, a bit more given the macro backdrop there? And you spoke about the opportunities that you see at the same time.\n\nMaybe if you can ask you when you at seeing the hesitation from the customers there? How are you seeing them prioritize across your portfolio? Like when it comes to data center versus campus versus security as they're reevaluating their spend or hesitating investments, like how are they prioritizing within your portfolio and we see areas are getting impacted by that? Thank you.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah, Samik, it's a good question. And I would say -- the first thing I would say is that Gartner recently came out with a survey of executives in our customer base, and they've -- almost half of them said that their technology investments will be the last thing they cut. So that's just a backdrop for, I think, how important customers view their technology investments these days. When we look at where customers are investing, many of them are investing to they're moving forward with their hybrid work investments, right, and creating the infrastructure that they need to deal with this new world.\n\nWe see customers continuing. We saw a recent survey that talked about customers who are balancing their private cloud and public cloud workloads. And so, the whole rearchitecture of the infrastructure to deal with these new traffic patterns is another area. I mentioned in Europe with the power, with the energy costs.\n\nThere's a lot of focus. IoT has just been accelerating over the last two to three years, and we saw another -- I think we had a record bookings quarter in Q1. I believe, it was really strong, where customers are really looking to connect these systems to actually optimize their power consumption and their efficiency. And again, we see a lot of customers who are moving, who are doing greenfield real estate projects that are really focused on reducing -- going to low voltage architectures, which leads them to Power over Ethernet, which leads them to rebuilding their infrastructure.\n\nAnd then you've got cybersecurity and you've got full stack observability. We continue to see 5G build-outs there. Just lots of -- there's a lot of positive tailwinds, notwithstanding the short-term dynamic environment that we're in.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nThank you. \n\nMarilyn Mora -- Head of Investor Relations\n\nThank you. I think we have time for one more question.\n\nOperator\n\nSami Badri with Credit Suisse. You may go ahead, sir.\n\nSami Badri -- Credit Suisse -- Analyst\n\nThank you very much. Chuck, I wanted to go back to a comment you made regarding market share and some of that sitting in the backlog. Now if we assumed that there was nothing in the backlog and all the numbers that you generated were publicly reported through your financial statements, would that show that Cisco actually maintained or increased or even lost market share?\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYou mean if all our backlog was actually shipped and reported? \n\nSami Badri -- Credit Suisse -- Analyst\n\nCorrect. \n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah. I think that will be true. I mean, look, we operate in lots of different markets. So, is it true 100% of the markets, that would be difficult for me to say? But I believe that as we ship out the -- particularly our Secure Agile networks, our enterprise and networking products, that's certainly going to help.\n\nAs we catch up on our data center infrastructure, I think that's going to help. There's also just reporting dynamics that occur. Some of our competitors report certain routing products into data center switching, and we've reported into routing, which makes it difficult to ascertain. So, it's an imperfect science on top of that.\n\nBut I do believe that as we -- as our backlog unwinds and gets back to normal levels over the next 18, 24 months, then I think that you'll see -- I think you will see that dynamic.\n\nSami Badri -- Credit Suisse -- Analyst\n\nGot it. Just to be clear, that is Cisco gain share? I don't know, just to make sure I heard you correctly.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nI think that's right. In certain key areas. I mean, not perhaps across every one, I'd have to go do the analysis. In some of the key ones that I know all of you are worried about, the answer is yes. \n\nScott Herren -- Chief Financial Officer\n\nIn the bigger markets. \n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nIn the bigger markets. \n\nSami Badri -- Credit Suisse -- Analyst\n\nGot it. And then one question just for Scott. So, Scott, maybe you could tell us where in fiscal 1Q of '23 did shipments begin to start accelerating just because we want to kind of understand the trend here going from now through fiscal 4Q and putting into that product gross margin comment into perspective. What I'm really trying to understand is as shipments start to accelerate, how much will software attach to those shipments just so I can understand the glide path here, what happens in some of the other segments outside of just secure network, Agile Networks, et cetera, right? I'm just trying to get this kind of like this pull dynamic that may occur from the other segments related to shipments going out the door.\n\nScott Herren -- Chief Financial Officer\n\nGot it. Yeah, we -- so we talked about the overall backlog reduction at about 10% from Q4 to where we ended Q1. That -- a subset of that, of course, is software. That same percent held pretty much true in software.\n\nSoftware continues to be well over $2 billion of our overall product backlog. But it's about -- it's actually about the same reduction sequentially as we saw in overall backlog. So right around the 10% rate. I think as you look ahead and try to model out the 50 to 75 bps of improvement that I talked about, I think it's going to be probably a little bit heavier in the second half of the year than it will be in the second quarter.\n\nYou saw the guide for the second quarter.\n\nSami Badri -- Credit Suisse -- Analyst\n\nGot it. All right. Thank you very much.\n\nMarilyn Mora -- Head of Investor Relations\n\nI'll turn it over to Chuck for some closing remarks. \n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nThanks, Marilyn, and thank you all for joining us today. I just want to reiterate it, we feel like we had a very strong quarter. Large quarterly revenue in history. As I said earlier, the orders, the visibility, the easing and supply chain gives us the confidence to raise a year, obviously.\n\nWe're very focused. We're managing the business for growth. We are going to go through this process of reinvesting into strategic areas. And the people impact is difficult.\n\nAnd I just want our employees who are listening in today to know that this afternoon, and tomorrow, we'll be communicating about how we're going to go about this. It's always a difficult decision, but we have a lot of opportunity. I'm very optimistic about the future. I'm proud of the teams and what they have accomplished and really excited about the visibility and the confidence that we have in the near term.\n\nSo thanks for joining us, and we look forward to next time. \n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Chuck. This goes the next quarterly earnings conference call, which will reflect our fiscal year 2023 second quarter results will be on Wednesday, February 15, 2023, at 1:30 p.m. Pacific Time, 4:30 p.m. Eastern Time.\n\nThis concludes today's call. If you have any further questions, feel free to contact the Cisco investor relations group. We thank you very much for joining today's call.\n\nOperator\n\nThank you for participating on today's conference call. You would like to listen to the call in its entirety, you may call 800-835-5808. For participants dialing from outside the U.S., please dial 203-369-3353. [Operator signoff]\n\nDuration: 0 minutes\n\nMarilyn Mora -- Head of Investor Relations\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nScott Herren -- Chief Financial Officer\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nDavid Vogt -- UBS -- Analyst\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nTim Long -- Barclays -- Analyst\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nGeorge Notter -- Jefferies -- Analyst\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nJames Fish -- Piper Sandler -- Analyst\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nSami Badri -- Credit Suisse -- Analyst\n\nMore CSCO analysis\n\nAll earnings call transcripts"
}