{
  "companyName": "TDCX Inc.",
  "companyTicker": "TDCX",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/tdcx-inc-tdcx-q2-2022-earnings-call-transcript/",
  "content": "TDCX Inc. (TDCX -3.36%)\nQ2 2022 Earnings Call\nAug 24, 2022, 8:00 a.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Thank you for standing by. Welcome, and thank you for joining the TDCX second quarter 2022 results conference call. [Operator instructions] It's my pleasure and I would now like to turn the conference over to the management.\n\nPlease go ahead.\n\nJason Lim -- Head of Investor Relations\n\nHello, everyone, and welcome to TDCX second quarter 2022 earnings conference call. I'm Jason Lim, the head of investor relations. Allow me to introduce management on the call. We have our executive chairman, founder, and CEO, Mr.\n\nLaurent Junique; our CFO, Mr. Chin Tze Neng; and our EVP of corporate development, Mr. Edward Goh. Before we continue, I'd like to remind you that we will make forward-looking statements, which are subject to risks and uncertainties and may not be realized in the future.\n\nYou should not place reliance on any forward-looking statements. Also, this call includes a discussion of certain non-IFRS financial measures, such as adjusted EBITDA, adjusted EBITDA margins, adjusted net income and adjusted net income margins. For reconciliation of the non-IFRS measures to the closest IFRS measures, please refer to our press release or the Form 6-K, which are available on our website. We have provided a convenient translation for the translation of Singapore dollar into U.S.\n\ndollar. This was done as a rate of to USD 1 to SGD 1.3918. This should not be construed as a representation that the Singapore dollar amount can be converted into USD at this or any other rates. Our management will now share updates on the operating and financial performance.\n\nWith that, let me hand over the call to Laurent. Laurent, please?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nHello, everyone, and welcome to our results briefing for second quarter of 2022. We're happy to deliver another strong set of quality results. Once again, the people of TDCX has put together another outstanding performance and have navigated through the market's overall macroeconomic challenges. I'm so proud of the determination, resolve, and really appreciate the tremendous efforts at TDCX emphasis on competency and building a wonderful working environment for whole has paid off.\n\nI would also like to thank all our clients for their support and keeping their faith in us. And I'm also happy to report that during the quarter, we had our carbon footprint reporting certified by British Standards Institute ISO 14064-1. And so our corporate social responsibility initiated, we just incorporated with TDCX Foundation. Our focus here is on building long-term partnerships to affluent communities in Asia through digital empowerment, specifically with three key fields of digital access, digital literacy and capability in terms of readiness or digital work and small business support.\n\nLet me make cover some highlights of our financial performance. We delivered robust revenue growth in Q2 2022 as revenue 23.3% to USD 117 million or SGD 162 million. This was driven by strong contributions from clients across key verticals, including digital advertising and media, and travel and hospitality and especially from our ex-top five clients who are growing at the fastest pace since listing at twice the pace of our group revenue growth in Q2 2022. Now in terms of revenue contribution from verticals of travel and hospitality, including our airline clients continue its recovery trajectory at about 25% compared to Q2 2021.\n\nOur revenue from travel and hospitality is now higher compared to Q2 2021. We're still from 16% below our peak quarter in this space in 2019, there is still some room for us to grow. And this will be dependent on the output of global and especially Asian travel, the prospect of North Asia travel reopening is an exciting one of course, but this is not confirmed yet, as I speak. On the fintech side, we continue to rise a high percentages year on year and it remain our third largest vertical.\n\nTo recap, we serve payment database, quick exchanges and other things at companies. And as shared before, we're always taking a careful approach to crypto, while we are happy with our progress in this space, the revenue contribution is around 1% before the risk are manageable. We're looking to add more fintech clients and also to continue to bring in a variety of clients across different verticals, such as e-commerces to grow the business. On the digital advertising media vertical, we continue to deliver double-digit percentage growth year on year powered by our strength in the sales and digital marketing service, and the acquisition of new clients.\n\nWe have onboarded the leading short-form video social media platform, and started to contribute in Q2. I shared before. It will take time for any new clients to start contributing meaningfully in terms of group revenue, but we are happy with the progress we've made yet. On our earnings and quality growth 7.04 we press on with our business expansion.\n\nWe maintain our focus on quality growth, adjusted net income, which strips out the performance share plan cost for a like-for-like basis comparison, rose 35.5% year or year to $22 million or SGD 30 million. We continue to deliver our industry-leading profitability with adjusted EBITDA margin of 31% in Q2 2022. And I want to take this opportunity to thank our CFO, Mr. Chin, and his team of incredible professionals for the continuous efforts in cost control and efficient planning.\n\nThe quality of our earnings growth is also shown in the strong cashflow conversions, Q2 2022 net cash from operating activities worth USD 76 million almost doubling year on year. Our CFO will share the results on the numbers in the later section. From the business segment point of view from Q2 2022, we have renamed our content monitoring and moderation services as content, trust and safety services. The change reflects the industry's growing content moderation services are out of the larger group of services and includes other trust and safety-related services and helps enhance our ability to track our performance.\n\nThe content, trust and safety service comprises of content moderation and monitoring. Trust and safety services such as those who ensure authenticity and security of listing as well as data annotation services for machine learning. Our total revenue from Southeast Asia stands at 91% of first half of 2022 revenues. In the latest addition of the internet economy program by Google domestic sales, Southeast Asia now has a total of 430 million internet users, while the Southeast Asian internet economy is expected to reach USD 360 billion by 2025.\n\nHowever, e-commerce, food delivery and digital financial services will have leading footprint which has provided investors with strong exposure on Southeast Asia with fast-growing digital transformation. Our sales team are we allowed in the region of Vietnam are on-track and we aim to launch operations there before the end of the year. The new market adds further flexibility to offer key Southeast Asia languages in a multi-window centralized model as well as a decentralized model. In addition, North Asia is gaining momentum with the contribution of 7% of revenue.\n\nOur expansion in Asia Pacific, Europe and Latin America was strategically planned with the objective positioning ourselves well to emerge stronger amid the changes in the CX outsourcing space. This is even more timely now with the rapid changes in the business environment and I'm confident our team will provide us with a competitive edge going forward. Now on planned wins, we have continued our business development momentum, signing up a total of 25 logos for the first half of 2022, more than triple the deals we signed in the first half of 2021. This includes two Southeast Asian market logos added in Q2 by leading regional airline and one of the largest integrated e-commerce platform.\n\nThis demonstrates our strength once again, in the travel and e-commerce vertical and confirms our leadership in this sector. Our launched client count now stands at 60 as of 30 June 2022, up 40% compared to 43% year ago. Revenue from new economy stood at 93% for the first half of 2022, excluding efforts to reduce our client concentration and our total clients now represent 57% of Q2 2022 revenue compared to 63% in Q2 2021. Now I hand over to Mr.\n\nChin to cover the financial details as well as an update on the guidance.\n\nChin Tze Neng -- Chief Financial Officer\n\nThank you, Laurent. Net earnings per share contributed on our Q2 2022 financial performance. Revenue rose 20.3% to USD 170 million, driven by growth across the omnichannel, CX and sales and digital marketing and digital planning. Adjusted EBITDA, which excludes share-based expense for like-for-like comparison was 23% or USD 36 million while margin remain largely stable 31%.\n\nAdjusted net income, which excludes share-based rose 35.5% to USD 20 million. Net profit for a period rose at a lower 19.6% on a reported basis, we will actually do the evaluation of the performance share plan, which did not exist in the same period last year, as well as higher income tax expense. Next, we share in more details on our Q2 revenue performance by the services that we offer. Revenue from omnichannel sales solutions rose 19% to USD 68 million, due to high business volume driven by expansion of existing campaigns in our feedback and technology verticals.\n\nIn addition, business mortgage for our food, travel and hospitality price benefited from the gradual recovery from the impact of the COVID-19 pandemic, although the recovery has yet to reach pre-pandemic levels. Revenue from sales and digital marketing services increased by 64% to USD 20 million -- due to continuing volume expansion of existing campaign by key digital advertising and media clients. Commencing from Q2 2022 content monitoring and moderation service will be viewed as content, trust and safety. Revenue from trust and safety services that were previously classified on the omnichannel sales solution and other services which can currently be reasonably identified and quantified will now be reported as content, trust and safety services.\n\nIn Q2 2022 revenue from content, trust and safety services rose by 6% to USD 19 million primarily due to an increase in business volume from a client in a travel and hospitality vertical. In Q2 2022, omnichannel sales reached up 69% of our business, while sales and digital marketing is at 24% and content, trust and safety share is 70% respectively. Let me next share some details on our expenses. For Q2 2022 operating costs as a percentage of revenues stood at 27.5%.\n\nExcluding PSP costs on a like-for-like basis, this stood at 25.3% lower than 27.3% for the same period last year -- last year due to lower depreciation expenses. Employee benefit expenses remain the largest portion of our total operating cost base. Our employee benefit expenses increased by 21% to USD 26 million for Q2. Excluding PSP costs on a like-for-like basis employee benefit expense would have increased by 26%, having an revenue growth of 23% assuming to higher risk costs of our platform and the increased competition for talent in the respective markets that we operate in.\n\nOur depreciation expense declined by 8% lastly due to seven of the renovation assets in Singapore, Thailand and Philippines being fully depreciated during the period with no duplicate capital expenditure incurred. All other expenses which include items such as recruitment, transport and telecommunication expenses rose 1% for Q2 2022 lower than our revenue growth, which demonstrates continued focus on proven cost management. Next, let me share some details of our first half 2022 financial performance. Revenue rose 25.1% to USD 226 million, similarly driven by growth in the omnichannel and sales and digital marketing business segment.\n\nAdjusted EBITDA rose 75.2% and USD 70 million with margin stable at 31.1%. Adjusted net income which excludes the impact of share based expense rose by 35.2% and USD 43 million. Net profit for the period stood at a lower 9.5% on a reported basis, we now see the implementation of the common shared lands which did not appear in the same period last year. In terms of performance by services we offer mainly for omnichannel CX solutions rose 21% to USD 132 million due to the higher volume driven by the expansion of existing campaign.\n\nRevenue from sales and digital marketing services improve by 67% to USD 61 million with the expansion of existing campaign about two-thirds in the digital advertising and media vertical. Revenue from the content, trust and safety services rose by 6% to USD 38 million, primarily due to an improvement in business volumes from our client in the travel and hospitality services. In the first half 2022, omnichannel sales went up 69% of our business, while sales and digital marketing stood at 74% and content, trust and safety 17% respectively. Let me share some details on our first half expenses.\n\nThe trend at last year Q2 2022 for first half 2022 operating costs as a percentage of revenues stood at 79.3%. Excluding PSP costs, this stood at 75.7% lower than 77.9% from the same period of 2021 due to lower depreciation expense. Employee benefit expense increased by 35% to USD 150 million for first half and it has increased by 27% excluding PSP cost due to higher wage cost as we faced competitive dynamic of the solid market division. Our depreciation expense declined by 5% largely due to certain renovation assets depreciated.\n\nAll other expenses rose by 4% for first half 2022 lower than our normal curve, which illustrates our continued prudent and efficient cost management. Lastly, let me provide an update on our full year 2022 outlook. We are reintegrating FY 2022 outlook which should be our Q1 results enhancement. Our full year 2022 revenue guidance remain unchanged at USD 675 million.\n\nThis represent revenue growth rate of 20.1% to 21.6% compared to FY 2021. The company's financial information is stated in Singapore dollars. However, we provide the conversion strategy to check eligibility [Inaudible] while not delivering the Singapore dollar currency once the approximate content of the number to U.S. dollar.\n\nAs an approximate use in FX as of June 30, 2022, of $1 million is SGD 1.29 which represents around USD 457 million to USD 455 million. Previously as the approximate rate to effect [Inaudible] March 21, 2022 of USD 1 and SGD 1.2534, which represent around $480 million to $499 million. We note that there is no change to our guidance in terms of Singapore dollars term. We will continue to focus on cost management and employee productivity to maintain our full year 2022 adjusted EBITDA margin to approximately 30% to 32%.\n\nWith that, let me hand over back to Jason.\n\nJason Lim -- Head of Investor Relations\n\nThank you, Mr. Chin, for moving us through the results presentation. We are now ready for Q&A. Before we start, can I just take a request that we'll keep your questions to three at the maximum? Thank you.\n\nOperator, Q&A, please.\n\nOperator\n\n[Operator instructions] We got the first question from Pang Vitt from Goldman Sachs. Please go ahead.\n\nPang Vittayaamnuaykoon -- Goldman Sachs -- Analyst\n\nThank you very much for the opportunity, and taking question from me. Firstly, on the guidance. Can you give us a reason why [Inaudible] to the current guidance? What is the basic assumption for this? What are the revenue level that you can achieve? In particular, while we expect this second half growth to decelerate sharply in third half further if that were to return in travel investment. Certainly, any of the impact on inflation to margin guidance as well, that's question number one.\n\nQuestion number two, we noted a strong local addition in the quarter. So any color you can provide around it, what are the sectors, in what countries you are representing them and what kind of opportunity and what kind of like product and services you are serving? Furthermore, can you also provide any additional colors around how much of the growth that we are seeing now is coming in from new logo with existing customer? So that's question number two. And last question, what is the management's current view around the global slowdown in the global tech space, and that comments around cutting costs, especially for your top social media clients, any further color you can provide? Thank you.\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nHi, Pang. Thank you very much for the question. Laurent Junique is here. So, yes, on the guidance, very clearly, we've really reiterated our guidance for the full year as we have already revised it in the last quarter.\n\nIn retrospect, we were one of the first to go out there and revise guidance. On new information we were having and really quickly transforming macroeconomic and geopolitical landscape at this time, which obviously has not improved much rather than what was expected at the time. Now why did we reiterate our guidance? First of all, the first strong half that we have, the half of the year is a -- So we've very decent results of 25.1% growth in our revenue in the first half. But also, I would like to comment my teams were doing a fantastic job for their operations, and they have done very well throughout this summer as well.\n\nSo they really deliver the results and receive the efficiency of our operations and our management and our business development. So we mentioned about the new logos. In first half, we brought in three times of new logos than in last year, added 25 new logos. So that's helping us to, obviously bring some more growth to the customer.\n\nWe're getting a bit closer every day to the end of the year, we hence have a bit more visibility or visibility can come with a number of possible challenges around attrition, challenges around inflation, challenges around the variability, seasonality, so that you're never completely shielded or protected from what may happen before the end of the year. Nonetheless, we have enough customers at this moment to stick to our guidance. So that was important to reiterate. And the new logo wins, to refer to your second question.\n\nSo additional color here. So we're expecting new logos on the second half -- second quarter, sorry, in 2022 for the first half. You remember that in the first quarter, we won this short-form video platform. And the second quarter, the regional airline from Asia and e-commerce cloud platform that is a very exciting regional player.\n\nWe brought three Fintech companies, one insurance client. So a variety of clients in different sectors and not just new economy as well in the nutrition space. So a variety of logos, so obviously our team has worked very well and has really performed above all these years. And so the confidence is really building in our ability to win new business.\n\nThe engine is working, we started from the beginning we came into this thing with an objective to drive organic growth as our first entry point and we are delivering on that front. So our ability of accelerating the growth from these logos is really starting to pay off. [Inaudible] as well, but they are 65 that have been launched. But there are still 10 in that group that have not been launched yet, so there's some upside moving forward in the coming quarters.\n\nAnd so that's probably the later news. Now your question relating to tech, and how is that impacting us? -- anything not so much a tech sector [Inaudible] maybe businesses or the tech sectors that are impacting ourselves. So as we know we have quite a bit of business in advertising space and we understand that the digital advertising space is filled with pressure. Right now and what we think is going to happen is that possibly depending on the parts of product lines that we work in omnichannel solutions could be under pressure for the digital advertising sector.\n\nBut it's true of the certain digital marketers where as the industry is getting more and more competitive, we think the some of the -- for outsize in digital marketing services and we've seen that in our numbers, it's growing at the fastest pace once again for TDCX. So that's one area that we're watching and watching the impact. And trouble in hospitality sectors are picking up quite significantly as we speak. I think there's also a potential upside here with travel that has not recovered in North Asia, in Japan, and not as much in Asia and China.\n\nWhen that comes and -- is happening, we'll see how it impacts us physically. So that's how we are watching the space. Every time -- back in the face of economic slowdown are somehow more impacted than others and some are benefiting. So I don't want to generalize or I don't want to state a fact and blind everybody -- we do our forecast and we take that into account and justify.\n\nSo that's what I could share.\n\nOperator\n\nThe next question is Varun Ahuja from Credit Suisse.\n\nVarun Ahuja -- Credit Suisse -- Analyst\n\nThanks for the opportunity. Three question. First, could you comment on the visibility that you may have on the business personally? And I think that's unusual stock declines, these are three months visibility, six months visibility. And compared to six months ago, nine months ago, using that as a review, so love to hear how much comfort do you have in the next three to six months in terms of growth in revenue? And if you can, in the same, like, comment about your views on community and stability, but how do you see it progressing during 2022, if they're almost into second half now.\n\nI think market would like to know how you see being 2023? Number two, if you can talk about -- I know you talked about new client addition, which is 25. But if I look at your number of clients is 60, and in December, it was around 52. So there has been a significant churn and my understanding is you have completed that restructuring phase where you've had unprofitable accounts. So it looks very high, given we added 25 and the churn of 17 also.\n\nIs there anything we are missing here, what's happening on that dynamics? Would love to hear on that front. Third, if you can comment little bit on the insight, given how you're looking at it, the cash flow domains fairly and M&A as part of your growth strategy, and even in this environment, the valuations of companies may have come down especially in the private side. So how are you looking at that space that would be helpful? And lastly, just one more quick question. The tax rate has moved up this quarter.\n\nSo, Mr. Chin, if you can comment, how should we think about it, what has happened in this quarter and should we think about over the next few years? Thank you.\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nThank you very much for the question. So regarding the visibility side, if I understand correctly your question. So listen, it's really early for us to tell for the visibility in terms of duration. We used to have maybe six to nine months of visibility.\n\nWe've cut that to three to six months. We're still in good time of the range of vision, I would say, in terms of where our plans are budgeting in a few reasons, one of with the uncertainty that the clients are facing and planning and budgeting and having to adapt to some occasions. The market volatility as well doesn't help very much. We are reentering the budgeting process right now in the month of October.\n\nThere is a window of our clients. So at this point, I think there are clear views as to 2022 year is looking out within that. So it's not unusual. It's quite common at this period of the year that clients are thinking and strategizing and getting involved in these discussions with thinking of ideas and how we are going to make the year and next year and what kind of projects we are going to be working on and what kind of wide ideas that they have.\n\nAnd so this is beginning to happen as we speak -- as it did happen in September. So visibility will hopefully expand next year in terms of better economics. But for now, that's where we are. On the client side that we got, I think, maybe Jason later can talk about some of the very detailed numbers.\n\nBut I think it's a question of calculations in it. You did mention there was a high churn. I want to confirm that the reasons, as you said very, very low churn has not really evolved in any way at first to us. And on the contrary, we have got a very high revenue retention and client retention as usual.\n\nAnd we're adding clients. It's just that in the numbers we've provided, we just mentioned clients are very low. So at this time, those that we've announced, we haven't launched them yet, that's our same area on it. We have enough size and -- But maybe Jason, you'll provide a bit more color here.\n\nJason Lim -- Head of Investor Relations\n\nYes. So in addition, I think, Laurent mentioned 52 clients at December. And although we added '25 for the half year, it doesn't add up into the total. We added 60 because that's still sort of over 10 clients they are not launched yet.\n\nSo the active client, launched client is actually different from the logos that we have. I hope that helps. Let me just have you repeat the sort of -- I think the big question you have is on capital management, like cash flow and capital management. Is that correct?\n\nVarun Ahuja -- Credit Suisse -- Analyst\n\nYes. And it's more on the M&A side. What you would consider to see almost six months since the outlook?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nYes. Absolutely. I can touch on M&A and then maybe later down the road Jason, so he can talk about capital management. So I mean, we have worked very hard on that front.\n\nEdward Goh and his team have reviewed about close to 100 targets if not more. And interesting situations here, some opportunity, and once again I just want to reiterate that we're looking for quality targets. So obviously, the ones that there are a number of acquisition that meet the criteria where we started from day one. Once again, we're looking for targets we know that we can leverage our organic growth, to be a bit picky and choosey and we absolutely are following this direction.\n\nBut we have a nice pipeline, a nice portfolio. But as you know, it takes a bit of time to conclude, but we're quite certain on a number of targets that I hope we'll bring to your attention soon, and that it will be interesting. But it takes time and obviously, we have some cash in the bank that we would use, that will be very useful. And we have big growth targets.\n\nWe want to accelerate our strategy. So that's definitely working well for us at this stage and looking forward to telling you more about it.\n\nVarun Ahuja -- Credit Suisse -- Analyst\n\nThe last question was on the tax side.\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nChin, you want the view on the tax?\n\nChin Tze Neng -- Chief Financial Officer\n\nWhat was the question on tax?\n\nVarun Ahuja -- Credit Suisse -- Analyst\n\nSo this quarter, the effective tax rate looks like 29%. I think the earlier discussion suggests that should meet over to 22%, 23% full year, so anything which is happening there, and how should we think about the tax?\n\nChin Tze Neng -- Chief Financial Officer\n\nThe tax situation for the Malaysian tax that is driven by two manufactures, one is the Malaysian Prosperity Tax that is -- by the government of Malaysia of last year's and also on the budget. And for the quarter of two -- quarter two, we have the Philippines, this is really that we still enjoy the income tax bit for quite a while. We'll have the FX holidays suspended due to the implementation of the -- of this -- we stated that -- on all the deal in the Philippines. We compel with a certain number of workers to be working in office as opposed to the work from home situation, and because in Philippines we're unable to meet the target -- this time getting employees to come back to office, we have to incur these standard tax exposure for the Philippines unit effective from second quarter that was announced by the Philippines government.\n\nAnd these are the two main factors to get higher tax expense for the group.\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nBefore we sort of go to the other question on the line. I think we have a couple of questions on the webcast asking us to clarify some data points during the call, because I think the presentation was a big matter in terms of earnings. So just to clear up the questions, the top two customer concentration now is 57% as of Q2 2022 versus 63% Q2 last year. In terms of the travel and hospitality space stood at 25% versus Q2 last year, this is still some 16% of the highest level peak quarter that we had in 2019.\n\nSo those are some of the data points that we are clearing up. Operator, please next caller, next question on the line.\n\nOperator\n\nThe next question is from Han Tan from HSBC.\n\nHan Tan -- HSBC -- Analyst\n\nMy first question is, I noticed that you allowed contracts of traditional non-tech companies. So how do you think about these contracts over marginal growth? Do you expect these new accounts to be dilutive in terms of margins?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nThank you for the question. Yeah, so I mean, we have a number of clients but the majority still remain very much in the new economy sector. We have a good range of clients who are --and most of the range of our products are in Asia Pacific, who's in the fast-growth region as well. And although these are more traditional economy companies, we believe that there's still nice growth potential due to the fact that we're coming in early in the relationship as well as they are in this fast-growing region.\n\nSo the fact considering that still 93% of our business is the new economy, and 91% of it is in Asia, is not really material at this point. But we've also said that for quite some time as well, we absolutely interested in the new economy sector as well. It's brands and deals that we concern with them where they have a need. So we have an option for potential as well where we can gain market share.\n\nHan Tan -- HSBC -- Analyst\n\nThank you. Just wondering if you could share any -- information, news on any projects? And do you feel like you have some [Inaudible] your revenue guidance? So if there is macro slowdowns in the third quarter, would that impact you negatively?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nYes. I mean, if there's some further slowdowns, we may be impacted, we have revised our guidance in Q1. On the back of the delays, as well as lower visibility for some projects, so yes, some projects have been delayed for us in the past. We see still some slow implementation.\n\nAnd that's something we factored in into the reiteration of our guidance at this point. We've just watched -- and then watching the space over time to see whether this is going to continue to accelerate or reduce. We don't have control, unfortunately over clients' decisions to either accelerate or slow down. I mean, it depends on the sector as well.\n\nI mean, if you look at the travel right now, it's out of slowdown. It's really accelerating and trying to help pushing us and it's nice to watch.\n\nHan Tan -- HSBC -- Analyst\n\nThank you. I think my final question on vendor consolidation, how much of that are you seeing? And might this be a tailwind for growth maybe for the second half of the next year?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nSo you're talking about our competitors consolidating, right?\n\nHan Tan -- HSBC -- Analyst\n\nYes. Are you gaining market share from their consolidation?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nSo I mean, we've seen some mergers and we hear of maybe potential further mergers in the sector. So the business is becoming very, very scale focused and this is something that we had anticipated. That's very much why we're going through the journey we are going through. The first one is expanding globally and having a global footprint is super important to us to remain competitive in the face of growing larger scale competition combined with clients, who are going bigger and more global, who want to contract with bigger global players.\n\nSo TDCX is racing to reach that goal and through ways of any global geographical expansion. And then the second one is the important M&A we are pursuing right now to accelerate that objective. So yes, it's on our list of important strategic items that we want to progress as quickly as possible.\n\nOperator\n\nThe next question is from Jonathan Woo. Please go ahead.\n\nJonathan Woo -- Phillip Securities -- Analyst\n\nThanks for taking my question. The first, I noticed there was almost 10 million benefit from exchange differences from our foreign ops. Maybe could you elaborate a little bit on that? And whether you expect this kind of benefit to continue moving into the second half of the year? And the second question is on share repurchasing. I noticed that you've done about $10 million in share repurchases, while you've got about $20 million in terms of allocation to go, how can we -- maybe give us a little bit of color on that, how can we expect share repurchasing to continue moving forward for the rest of the year, given that there is only about a slightly more than a quarter left? Thanks.\n\nJason Lim -- Head of Investor Relations\n\nJonathan, we are not sure where you have got the 10 million FX benefit. I don't think we have that in our P&L. Could you please tell us, which specific line you are looking at?\n\nJonathan Woo -- Phillip Securities -- Analyst\n\nIt's the line right above the comprehensive income.\n\nJason Lim -- Head of Investor Relations\n\nOther comprehensive income.\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nOh, other comprehensive income. OK. That's the translation effect of the net assets. It would not be currency -- based on currency which are not relating to our business or not relating to the transactional embedded from the profit before tax.\n\nSo that is a translation impact due to the -- currency translation of our net assets of our foreign subsidiaries in all the countries that we operate. So in terms of mainly the Philippines, Malaysia the last year, if I may recall correctly, the bigger amount come from those larger units as opposed to the smaller unit. So that is nothing to do with the FX effects of our transactional level.\n\nChin Tze Neng -- Chief Financial Officer\n\nJonathan, on the question around share buyback, indeed for the last five months since we started the share buyback program, we've been guided by two key principles. First one is sort of valuations and how stacked up against the shares in a product market, but might also on sort of impact around liquidity and float. So the management will continue to monitor based on these two guidelines. And if need to continue to implement this share buyback programs, given that they've announced that $30 million program, and we've deployed around $10 million to date.\n\nOperator\n\nThere are no further questions at this time, and I hand back to the manager for closing comments.\n\nJason Lim -- Head of Investor Relations\n\nI think Franzie, that was a bit premature because I see there's a line on -- there is KC on the line from CIMB.\n\nOperator\n\nYes. KC Ong. Proceed.\n\nKC Ong -- CGS-CIMB Securities -- Analyst\n\nI think just now, you mentioned that most of your recent logo wins are from APAC. But just wondering if we could also be in potentially some logo wins from the Western countries or potentially bigger campaigns, given that some of your peers are mentioning about offshoring trends in the BPO space?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nSorry. Can you repeat the last line, just the very last line?\n\nKC Ong -- CGS-CIMB Securities -- Analyst\n\nJust wondering if management is seeing offering trends, for example, potentially from international internet firms or companies from Western countries, potentially offshoring their BPO services to APAC?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nYes. I think, depending on how you look at offshore, we work for a number and we've on boarded a number of those clients and those clients are quite a lot of Western companies in addition to Asia originated the companies who work on an offshore basis by doing a centralized operation, for example, in Malaysia or to cover multiple countries into one location as opposed to have a decentralized model per country. And then we have a number of clients that we won that are more domestic. So for example, in Japan, we have won one insurance client that's going to be joining us that's pretty domestic.\n\nThe other one is -- another one actually client as well in Japan domestic. So it's a variety -- travel clients that is based in the U.S. to cover -- to offshore in Colombia, for example. So yes, the airline -- the regional airlines, the one central location in Asia, where we are covering all the languages, for example.\n\nSo offshore is still really at the center stage of what we do for the large majority of the work, if I got the question correctly.\n\nJason Lim -- Head of Investor Relations\n\nThanks, KC. So let me just read out a couple of questions that we have from the webcast. For the new customer additions that we are getting, are they at the same margin profile or different margin profile from existing customers?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nYes. So thank you for that question. There are a variety of margin profiles, we have a very strict plan that we apply depending on the strategy that we pursue, and in general, the mix of contract is brought on board on meeting our criteria -- and our financial criteria, absolutely as our CFO is quite picky on that.\n\nJason Lim -- Head of Investor Relations\n\nThank you. Next question from Benjamin, can you share more about wage inflation, some color? And how are we managing wage inflation?\n\nChin Tze Neng -- Chief Financial Officer\n\nYes. Inflation is a factor that is impacting our operation, as well. But on the flip side, I think we are also operating our resources more efficiently than ever before, I think in the case of cost escalation, efficient resources utilization, enhanced productivity on our revenue is pretty crucial to help buffer against all these cost-efficient inflationary factors. And on the flip side, only non-rich always -- we are also keeping some of our earnings ways as possible in the first half year, especially on our capacity side of things.\n\nPrecision is lower to help address and buffer this rich pressure. So, in a nutshell, I think several moving parts help to address our inflation adverse issues.\n\nJason Lim -- Head of Investor Relations\n\nThanks, Mr. Chin. Next question from Julian, the growth of your top two customers seem to have slowed down. Any color on that, please?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nSo the top two client, as you know, quite important to us, our concentration has come down, which is also a good thing. And it's a mixed bag actually, of situations. We think that the -- one of the environment that is kind of challenging in the digital advertising could very well impact us but it's also mitigated by the fact that we are quite strong in sales and digital marketing and we think like I said earlier on that, as the digital advertising market is becoming more and more competitive, our clients have put an appetite for engaging us to do sales and digital marketing. So we see that growing quite significantly.\n\nSo I couldn't possibly call that a slowdown rather a significant increase. So it's probably more of a balancing of the nature of the work we do for those clients that is important, and I'm talking about the digital advertising space in general. And as you know, we've brought in additional funds in the short-form video space. They're starting to -- they've been implemented.\n\nThey're starting to really show up on our P&L. So that's good. The travel and hospitality sector, which is another big sector for TDCX is actually not slowing down, the opposite. We've had the worst years behind us now.\n\nSo it grew 25% year on year versus 22% in Q2 2020. And then -- but it's still behind actually the 2019 numbers. It's probably 16% behind what it used to be a bit higher. So there is room for growth, taking into account again that Asia has not reopened yet and we could be benefiting from that possibility, we just don't know when.\n\nAnd again, the two clients that we have -- we have a [Inaudible] large clients that are now becoming mature and they are developing revenue for us. And then a whole new group of new logos that are bringing accelerated growth into the mix. So the brand overall is turning out quite nicely for us.\n\nJason Lim -- Head of Investor Relations\n\nThank you, Laurent. Next question, again from the webcast, from the [Inaudible]. Any update on the Airbnb?\n\nChin Tze Neng -- Chief Financial Officer\n\nI will add here. Let me take this one. The discussions are still ongoing, and we feel really good about where we are going with this. We hope to really share some further information with you as soon as possible.\n\nObviously, I think, as Laurent just mentioned, on the back half that travel breakdown, very timely, very good. So that even then ties with this strategic client of ours, so still working on that. This very -- I hope to be able to share something with you soon.\n\nJason Lim -- Head of Investor Relations\n\nThanks. I think we have time for just one last question. So last question on the line. Two people asking the same question actually.\n\nHave we been able or are we able to build wage inflation to our new contracts?\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nYes. Actually, we are able to do this and we have some funds to have the cost of living adjustment, but not all. So we cannot every time pass on that cost of living adjustment that we have been successful in quite a number of situation and indications. And the suggestion that we are having is actually maybe to take the opportunity of really this crisis to go back again to our clients in a very systematic manner and really ask for this to happen as a matter of protecting their interest, not just ours as well to retain the employees that show value.\n\nSo thank you for your suggestion. But we have a number of clients who have [Inaudible] in the contract, some don't, and we are able to renegotiate when we're able to, in some cases we're successful, sometimes we're not.\n\nJason Lim -- Head of Investor Relations\n\nI think that's all the time we have on the call today. Thank you for spending time with us for joining us. If you have any follow-on questions, you can reach out to us, reach out to me up for this. And just like to on behalf of management thank you for your time and we are signing off.\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nThank you, everyone.\n\nChin Tze Neng -- Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nJason Lim -- Head of Investor Relations\n\nLaurent Junique -- Founder and Chief Executive Officer\n\nChin Tze Neng -- Chief Financial Officer\n\nPang Vittayaamnuaykoon -- Goldman Sachs -- Analyst\n\nVarun Ahuja -- Credit Suisse -- Analyst\n\nHan Tan -- HSBC -- Analyst\n\nJonathan Woo -- Phillip Securities -- Analyst\n\nKC Ong -- CGS-CIMB Securities -- Analyst\n\nMore TDCX analysis\n\nAll earnings call transcripts"
}