{
  "companyName": "Capital One Financial",
  "companyTicker": "COF",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/capital-one-financial-cof-q3-2022-earnings-call-tr/",
  "content": "Capital One Financial (COF 0.31%)\nQ3 2022 Earnings Call\nOct 27, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the third quarter 2022 Capital One Financial earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Jeff Norris, senior vice president, finance. Please go ahead.\n\nJeff Norris -- Senior Vice President, Finance\n\nThank you very much, Liz, and welcome, everyone, to Capital One's third quarter 2022 earnings conference call. As usual, we are webcasting live over the internet. To access the call on the Internet, please log on to Capital One's website at capitalone.com and follow the links from there. In addition to the press release and financials, we have included a presentation summarizing our third quarter 2022 results.\n\nWith me this evening are Mr. Richard Fairbank, Capital One's chairman and chief executive officer; and Mr. Andrew Young, Capital One's chief financial officer. Rich and Andrew are going to walk you through this presentation.\n\nTo access a copy of the presentation and press release, please go to Capital One's website, click on Investors and click on Quarterly Earnings Release. Please note that this presentation may contain forward-looking statements. Information regarding Capital One's financial performance and any key forward-looking statements contained in today's discussion and the materials speak only as of the particular date or dates indicated in the materials. Capital One does not undertake any obligation to update or revise any of this information, whether as a result of new information, future events, or otherwise.\n\nNumerous factors could cause our actual results to differ materially from those described in forward-looking statements. For more information on these factors, please see the section titled, Forward-Looking Information in the earnings release presentation and the Risk Factors section in our annual and quarterly reports accessible at the Capital One website and filed with the SEC. Now, I'll turn the call over to Andrew.\n\nAndrew Young -- Chief Financial Officer\n\nThanks, Jeff, and good afternoon, everyone. I'll start on Slide 3 of tonight's presentation. In the second quarter, Capital One earned $1.7 billion or $4.20 per diluted common share. On a linked quarter basis, period-end loans grew 3% and average loans grew 5%, largely driven by growth across our domestic card and Commercial businesses.\n\nIn the linked quarter, revenue increased 7%, largely driven by growth in net interest income. The loan growth I just described and NIM expansion, both contributed to the increase in net interest income. I will touch on the NIM more in a moment. Noninterest expense grew 8% in the quarter, driven by an increase in operating expenses.\n\nHigher headcount and the associated compensation costs were the single biggest driver of the linked quarter increase. In addition to compensation expenses, the collective impact of a number of smaller items also drove up Q3 expenses. Provision expense in the quarter was $1.7 billion, driven by net charge-offs of $931 million and a $734 million allowance build. Turning to Slide 4.\n\nI will cover the changes in our allowance in greater detail. The total company's $734 million allowance build in the quarter brings our allowance balance up to $12.2 billion as of September 30. Our total company coverage ratio increased 14 basis points to 4.02%. Turning to Slide 5.\n\nI'll discuss the allowance and coverage across each of our business segments. As you can see in the graph, our allowance coverage ratio increased modestly in each of our segments. In our domestic card business, the allowance balance increased $530 million, bringing our coverage ratio to 6.9%. The $6 billion of loan growth in the quarter drove the majority of the allowance build.\n\nThe impact of continued normalization and a modestly worse corporate economic outlook were partially offset by the release of a portion of our qualitative factors linked to uncertainty in the economy. In our consumer banking segment, the allowance balance increased by $61 million, driving a 9-basis-point increase in coverage to 2.6%. The modestly worse corporate economic outlook I just mentioned, and expectations of credit normalization drove the allowance builds. And finally, the allowance increased by $107 million in our commercial business, resulting in a 9-basis-point increase in coverage to 1.45%.\n\nA combination of the modestly worsening corporate economic outlook, an uptick in criticized loans and loan growth drove the allowance build. Turning to Page 6, I'll discuss liquidity. You can see our preliminary average liquidity coverage ratio during the third quarter was 139%, well above the 100% regulatory requirement. Total liquidity reserves were roughly flat at about $93 billion as our liquidity reserves have largely normalized to pre-pandemic levels.\n\nOur securities portfolio declined by about $8 billion, driven by a combination of the decline in market value from rising rates and the continued planned runoff of the outsized portfolio we built during the pandemic. The decrease in our securities portfolio was primarily offset by higher cash and cash equivalents. Turning to Page 7. I'll cover our net interest margin.\n\nNet interest income in the quarter was $7 billion, up 14% from the year-ago quarter and up 7% from last quarter. Our net interest margin was 6.8% in the third quarter, 45 basis points higher than the year-ago quarter and 26 basis points higher than last quarter. The 26-basis-point linked quarter increase in NIM was driven roughly equally by three factors: first, an extra day to recognize income in the quarter; second, a continued balance sheet shift toward card away from lower-yielding assets; and third, the net benefit of the higher yield of assets relative to higher funding costs. Turning to Slide 8.\n\nI will end by discussing our capital position. Our preliminary common equity Tier 1 capital ratio was 12.2% at the end of the third quarter, up about 10 basis points relative to last quarter. The $1.7 billion of net income in the quarter was mostly offset by growth in risk-weighted assets, dividends, and a little over $300 million in share repurchases. We continue to estimate that our longer-term CET1 capital need is around 11%.\n\nAnd with that, I will turn the call over to Rich. Rich?\n\nRich Fairbank -- Chief Executive Officer\n\nThanks, Andrew, and good evening, everyone. I'll begin on Slide 10 with third quarter results in our credit card business. Year-over-year growth in purchase volume and loans, coupled with strong revenue margin, drove an increase in revenue compared to the third quarter of 2021. Credit card segment results are largely a function of our domestic card results and trends, which are shown on Slide 11.\n\nIn the third quarter, strong year-over-year growth in every top-line metric continued in our domestic card business. Purchase volume for the third quarter was up 16% year over year and up 47% compared to the third quarter of 2019. Ending loan balances increased $22 billion or about 22% year over year. Ending loans grew 5% from the sequential quarter, and revenue was up 21% year over year, driven by the growth in purchase volume and loans as well as strong revenue margin.\n\nStrong credit results continued in the quarter. Both the charge-off rate and the delinquency rate are well below pre-pandemic levels and continue to normalize. The domestic card charge-off rate for the quarter was 2.2%, up 84 basis points year over year. The 30-plus delinquency rate at quarter end was 2.97%, 104 basis points above the prior year.\n\nOn a linked quarter basis, the charge-off rate was down 6 basis points. The delinquency rate was up 62 basis points from the linked quarter. Noninterest expense was up 28% from the third quarter of 2021, including an increase in marketing. Total company marketing expense was $978 million in the quarter.\n\nOur choices in domestic card marketing are the biggest driver of total company marketing trends. In our domestic card business, we continue to lean into marketing to drive resilient growth. We're keeping a close eye on competitor actions and potential marketplace risks. We're seeing the success of our marketing and strong growth in purchase volume, new accounts, and loans across our domestic card business.\n\nAnd strong momentum in our decade-long focus on heavy spenders continued in the third quarter. Heavy spender marketing includes early spend bonuses driven by continued strong account growth and spending as well as investments in franchise enhancements like our travel portal and airport lounges. In the third quarter, our marketing continued to drive strong growth in heavy spender accounts and strong engagement and spend behaviors with both new and existing customers. Our decade-long quest to build our heavy spender franchise has brought with it significantly increased levels of marketing, but the sustained revenue, credit, resilience, and capital benefits of this enduring franchise are compelling, and they're growing.\n\nSlide 12 shows third quarter results for our consumer banking business. In the third quarter, we continued to pull back on growth in auto in response to competitive pricing dynamics. Many auto lenders appear to have reflected rising interest rates in their marginal pricing decisions, but others have not, and they have gained market share and pressured industry margins. We chose to pull back on auto originations, which declined 28% year over year and 20% from the linked quarter.\n\nDriven by the decline in originations, consumer banking loan growth is slower than previous quarters. Third quarter ending loans grew 5% to the year-ago quarter. On a linked-quarter basis, ending loans were essentially flat. Third quarter ending deposits in the consumer bank were up 2% year over year.\n\nConsumer banking deposits were flat compared to the sequential quarter. Consumer banking revenue was up 7% year over year as growth in auto loans was partially offset by the year-over-year decline in auto margins and the effects of our decision to completely eliminate overdraft fees. Noninterest expense was up 13% compared to the third quarter of 2021, driven by continuing investments in the digital capabilities of our auto and retail banking businesses and the increased marketing for our digital national bank. The auto charge-off rate and delinquency rate continued to normalize in the third quarter.\n\nThe charge-off rate for the third quarter was 1.05%, up 87 basis points year over year. The 30-plus delinquency rate was 4.85%, up 120 basis points year over year. On a linked quarter basis, the charge-off rate was up 44 basis points, and the 30-plus delinquency rate was up 38 basis points. Slide 13 shows third quarter results for our commercial banking business.\n\nThird quarter ending loan balances were up 2% from the sequential quarter, driven by growth in selected industry specialties. Average loans were up 7% in the quarter. Ending deposits were up 6% from the second quarter. Average deposits were down 2% in the quarter.\n\nThird quarter revenue was up 12% from the linked quarter. Noninterest expense was also up 12%. Commercial banking credit remained strong in the third quarter. The commercial banking annualized charge-off rate was 5 basis points.\n\nThe criticized performing loan rate was 5.97%, and the criticized nonperforming loan rate was 0.57%. In closing, we continued to drive strong growth in card revenue, purchase volume, and loans in the third quarter. Loan growth in our consumer banking business was slower compared to previous quarters as we pulled back on auto originations, and our commercial banking business posted another growth -- another quarter of strong revenue growth. Credit results remain strong across our businesses.\n\nCharge-off rates and delinquency rates are below pre-pandemic levels and credit continues to normalize. We typically see an increase in operating expense over the second half of the year -- of any year. This year, the timing of some of our investment opportunities drove a larger-than-usual third-quarter increase in operating expense, which was up 11% from the second quarter. We expect that this year's linked quarter increase in fourth quarter operating expense will be smaller than the approximately 7% linked quarter increase we've seen on average over the last five years.\n\nTurning to operating efficiency ratio. Relative to full year 2021, we expect annual operating efficiency ratio to be roughly flat in 2022 and modestly down in 2023. As usual, our operating expense and efficiency expectations exclude any potential adjusting items. Pulling way up, we're in a strong position to deliver compelling long-term shareholder value as modern digital technology continues to transform banking.\n\nWe continue to see opportunities to lean into marketing and resilient asset growth that can deliver sustained revenue annuities. Our growth opportunities are enhanced by our digital transformation. We continue to closely monitor and assess competitive dynamics and economic uncertainty. Powered by our modern digital technology, we're continuously improving our proprietary underwriting, marketing, and product capabilities.\n\nAnd we're managing capital prudently to put ourselves in a position to thrive in a broad range of possible economic scenarios. And now we'll be happy to answer your questions. Jeff? \n\nJeff Norris -- Senior Vice President, Finance\n\nThank you, Rich. We'll now start the Q&A session. Remember, as a courtesy to other investors and analysts who may wish to ask a question, please limit yourself to one question, plus a single follow-up. If you have additional follow-up questions after the Q&A session, investor relations team will be available after the call.\n\nLiz, please start the Q&A.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Kevin Barker with Piper Sandler. Your line is now open.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nGood afternoon. Thanks for taking my questions. I appreciate the comments around credit and how we're still in a normalization, back to pre-pandemic levels, particularly in some key asset classes. But at what point do you say that the year-over-year growth rate and delinquency rates is too fast relative to what you would expect for a typical normalization?\n\nRich Fairbank -- Chief Executive Officer\n\nYeah, Kevin, so thank you for your question. Let me just pull up and just comment on normalization. First of all, the context of where we are because consumer credit remains strong, as you can see from the metrics. And our domestic card losses in the third quarter were about half of pre-pandemic levels.\n\nAnd our delinquencies are -- and we've often said this, unmistakably normalizing. But right now, they remain about 20% below pre-pandemic level. There is not a certain point where we -- we don't look out there and say if the rate of growth of delinquencies exceeds a certain number, then we will pull back. But let me comment, first of all, that we've said for a long time, Kevin, and I know you know this that normalization is bound to happen.\n\nIt would be shocking if it didn't happen. And we've been talking for a bunch of quarters now saying it started, you needed a magnifying glass to see it and we talked about that. And now, of course, you can see it in the numbers, and it's definitely normalizing. What -- the rate at which it's normalizing is, frankly, more gradual than we generally expected, but we didn't really have a road map to know exactly what pace it would normalize.\n\nWe just believe so strongly that it would. So, what we do with -- rather than say there's a certain number that would lead us to make a certain decision. We, of course, look at this with what's happening with every segment and micro segment of our business and how it's performing. We look, for starters, at the back book, and that is normalizing as -- well, frankly, like everything here, more gradually than expected, but still the back book is clearly normalizing as well.\n\nWe then look for other patterns of normalization. And here are some of the patterns that we see, Kevin. It's more pronounced in the front book of new originations than in the existing back book. And by the way, it would be -- that would be shocking if it weren't the case, because 100% of the time in our history, front books normalize faster during periods of change.\n\nAnd we -- so that -- but we confirm again that front books are normalizing faster. It also seems that normalization is more pronounced at the lower end of the market. And of course, those are the populations that improve more and more quickly earlier in the pandemic. Lower-income consumers may also be feeling more pressure from inflation.\n\nSo, these trends shouldn't be surprising. But at the -- at kind of a high level, what we see is very normal and is -- and basically, the way we're leaning into the marketplace is very consistent with what we've been saying for a bunch of quarters now. But what we do at the micro level, at the segment level and the subsegment level is look at the various metrics, both on the back book and on the front book to see what the patterns are, and we're comfortable with what we see in terms of front book vintage curves as a general point and across a vast majority of all the segments that we operate in. We have -- around the edges, we've done a little bit of dialing back in particular pockets where metrics are normalizing a little bit faster.\n\nWe also sort of pull up and say, what are the kinds of -- what are the risks that we would expect to see at a time like this with orthogonal looks through our book. And we brainstorm on what are the risks we could see, we go hunt for them. And in a couple of places, we have seen effects that cause a little bit of trimming around the edges, but the collective amount of trimming in the card business is pretty small relative to the overall scale of our growth. As you know, the -- in the auto business, we have pulled back.\n\nAt the very same time, we're leaning into the card business, we're pulling back in the auto business, but maybe I'll save that for another question.\n\nKevin Barker -- Piper Sandler -- Analyst\n\nOK. And then just a follow-up. I mean, is there anything -- I appreciate all the look at the granular side of the business and what you see within your book on a very micro level. But from a macro level, is there anything that you'd look at that would make you pull back that may not be apparent at the micro level? In particular, I think you made some prepared remarks about changes in the corporate outlook in particular.\n\nThank you.\n\nRich Fairbank -- Chief Executive Officer\n\nSorry, the changes in the corporate -- can you repeat that last part? Changes in corporate outlook. \n\nKevin Barker -- Piper Sandler -- Analyst\n\nI believe in your prepared remarks, you said there were some changes in the corporate outlook that may have affected part of your allowance. Was there anything in particular that stood out that may cause you to pull back when you think about the macroeconomic outlook?\n\nRich Fairbank -- Chief Executive Officer\n\nWell, the -- we, of course, at the whole time we're doing the micro examination one segment at a time. We are looking at the macro trends. It's really striking the level of inflation. And as I've often said, we collectively, everybody on this call, none of us -- and nobody across the business world has really lived something like this since the early '80s.\n\nSo, we're especially looking for effects that might be different this time, Kevin, with respect to inflation and the -- how that can play out. But -- so we're always on the lookout, but the net impression I would want to leave here is very much the same impression that I've left with you the last many quarters here.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur next question comes from Ryan Nash with Goldman Sachs. Your line is now open.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nHey, good evening, everyone.\n\nRich Fairbank -- Chief Executive Officer\n\nHey, Ryan.\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nSo maybe just to start on the cost and efficiency side, Rich. So, it's good to hear that you'll be back on the efficiency improvement journey next year. So, I guess, just a two-part question. You talked about opex ramping less in the fourth quarter.\n\nBut just given the level of marketing spend and how the spend has shifted under the hood in terms of moving up market, should we expect to see less than historical seasonality on the marketing side? And then second, just can you help us with the magnitude of the efficiency improvement into next year? And what is actually driving the improvement? Is it pulling back on hiring or something else? \n\nRich Fairbank -- Chief Executive Officer\n\nSo, I don't think we're here to declare a -- I want to make a comment about marketing seasonality. It's not as -- that's not as much of a physics kind of thing as certain things like credit and delinquency seasonality with consumers. I think -- so I'm not here to declare changes in the pattern of seasonality and marketing. The big driver of our marketing is the opportunities that we see as well as the investment in building businesses like our heavy spender business and our national bank.\n\nWith respect to the drivers of operating efficiency improvement, just kind of pulling up on the journey that you mentioned. We've been focused about this and talking with investors about operating efficiency for years. And we've achieved a 440-basis-point improvement from 2013 through 2021 even as we have invested in a comprehensive transformation of our technology over that same period of time. And we know that investing in technology modernization and driving for efficiency improvements are on a shared path.\n\nTechnology investment helps our revenue growth and helps drive productivity improvements. And beneath the surface of the high level of investment has been significant productivity gains from modernizing our tech stack, eliminating legacy vendor costs, driving customers to digital, and driving more automation in the company. And at the same time, of course, we have continued to lean into this technology journey and the opportunities that it generates and the -- so it's a very shared path. And I think that our guidance for modest improvement in 2023 is a reflection of continued traction in growth and operating productivity while also continuing to invest in future opportunities. \n\nRyan Nash -- Goldman Sachs -- Analyst\n\nGot it. I guess as a follow-up question, maybe one for Andrew. Andrew, you laid out the details of some of the drivers as it pertains to the net interest margin. I fully understand that there's a seasonal component to it in 3Q.\n\nBut can you maybe just talk about the positioning of the balance sheet from a rate perspective? Do you think that you can continue to see the margin drift higher? And maybe just talk about of the drivers as you look out over the course of the next couple of quarters during the rising rate cycle. Thanks.\n\nAndrew Young -- Chief Financial Officer\n\nSure, Ryan. Recall, it's probably helpful to start with a little bit of history here. And you'll recall, our NIM was compressed during the pandemic, largely driven by a balance sheet that was skewed much more toward cash and securities than card loans. And as we progressed over the course of the pandemic, you saw that begin to normalize.\n\nAnd so just by way of evidence, a year ago, our NIM was, I think, 6.35%. I had said in my prepared remarks. And at that point, card was closer to 27%, I think, of our interest-earning assets and cash. And securities was something like 33%.\n\nCards now shifted to be just over 30% and cash and securities are down to 27%. So, I share that to say we're now operating much closer to our pre-pandemic balance sheet mix. And our NIM is roughly in a similar spot to where it was before the pandemic. So, to your question then about rate risk, you can see in our Q, our rate risk disclosures, we're really only slightly asset sensitive at this point.\n\nAnd keep in mind that's relative to forwards. So, the 150-basis-point projected moves over the next couple of months are already sort of embedded in that neutral baseline. And so, as I think about the future, there's a number of things that can impact NIM, not to mention seasonality, but the credit impacts on revenue, competitive pressure on loan margins and deposit pricing. But as we sit here today, I think a lot of the things that we pointed to in the past in terms of balance sheet mix, at least have largely run their course.\n\nSo hopefully, this gives you some sense of the primary forces that play with NIM.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur next question comes from Betsy Graseck with Morgan Stanley. Your line is now open.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nHi, good evening.\n\nRich Fairbank -- Chief Executive Officer\n\nHey, Betsy.\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nJust to follow up on that for the follow-up question. So now that you're back to the pre-pandemic mix of liquidity and loans, how should we think about where the balance sheet projects from here in terms of funding mix and funding stack? And maybe you could speak a little bit to your thoughts on the buyback because I noticed this quarter, it was down a bit, $313 million, down a bit from the prior two quarters, which averaged about $2 billion. So, if you could help us understand how you're going to be funding the loan growth and what kind of mix we should be expecting? Should liquidity go down even more than what it was pre-pandemic? Thanks.\n\nAndrew Young -- Chief Financial Officer\n\nOK. I'll take, I think, what I heard is the first two questions there, Betsy, in NIM and funding, and then I'll turn it over to Rich to talk about buyback. So, on the NIM side and the asset portion of that, I just want to clarify what will drive it from here. I do think if you look back historically, cash and securities were roughly 25% of our balance sheet.\n\nWe're a little bit above that. But given our needs for liquidity and how we use the investment portfolio, I would think that something in that 25% range of the size of the balance sheet is a reasonable assumption for that. Then on the loan side, it really becomes a matter of just marketplace dynamics, what we see as opportunities for growth. And so, whether card is growing more quickly than, say, auto or commercial, its percentage of the rest of the balance sheet could drift up.\n\nBut I don't want to give any indication of how we think that's playing out, and there's certainly not a target that we have in terms of the asset side of the balance sheet. On the funding side, we aim to have a diversified mix of funding that's largely skewed to retail deposits, which, again, historically has been something, I think, around 70% of our overall funding, and we have commercial deposits and brokered CDs and then securitization and wholesale funding, other sources of wholesale funding. And so again, I would say if you look back to pre-pandemic levels over history compared to where we are today, we're kind of back in a relatively similar place there. So I think I heard in your question, not just mix, but how do we fund growth from here in making marginal decisions for funding incremental loan growth.\n\nWe're going to weigh a variety of factors. Our customers' appetite for different deposit products and our ability to build customer relationships with them, the economics of different funding instruments, the duration of funding, or liquidity needs. So, we're going to throw all of that into our decision-making process to figure out how to fund. But I also think it's important to think about those funding choices at the margin.\n\nIt's not just about the liability side. We also have asset growth choices at the margin, too. So we're just going to look at the total integrated economics of both sides of the balance sheet to make those choices. And I'll hand it over to Rich to talk about buybacks.\n\nRich Fairbank -- Chief Executive Officer\n\nThanks, Andrew. Betsy, we -- so with the question with respect to why did you slow down your share repurchase pace this quarter. So we repurchased roughly $300 million of shares during the third quarter. About a year and a half ago, we had a CET1 in the high 14s.\n\nSince then, we've been repurchasing shares and our CET1 ratio has come down into the low 12s. And the pace of our repurchases is, of course, driven by a number of factors, including our actual and forecasted capital earnings, of course, growth, economic conditions, market dynamics. And at this point, there remains some pretty sizable error bars around some of these factors, particularly growth and economic uncertainty. And so it's not lost on us at times like this.\n\nIt's prudent risk management to be conservative with our capital actions. And this is a very dynamic process and under the new SCB rules, we're able to maintain flexibility in our capital decisions.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur next question comes from Sanjay Sakhrani with KBW. Your line is now open.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. Rich, you mentioned you're keeping an eye on your competitors. I'm just wondering if you could just drill down a little bit on that given you've had a lot of fintechs in the space growing. And obviously, it's a very unpredictable next 12 to 18 months.\n\nSo maybe you could just talk about domestic card and auto as well because you mentioned a number of different variables there. Thanks.\n\nRich Fairbank -- Chief Executive Officer\n\nWell, Sanjay, did you want me to talk about competition in those spaces or -- is it a competition-driven question?\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nI guess, competition, but also how it might have an impact on credit as we look forward because you've had some new players underwriting as well.\n\nRich Fairbank -- Chief Executive Officer\n\nRight. So, the -- let's talk about competition in the card business, and then I'll talk about it in the auto business. But generally, in the card business, competition continues to be high, but largely stable and rational over the past few quarters. Now here, I'm really talking about the major -- the banking industry, the classic competitive set within the card business.\n\nBut we certainly have seen marketing levels that have returned to really beyond pre-pandemic levels. So we certainly have an eye on that. On the rewards competition side, there's -- here or there, there are new things that people come out with, but there's generally a stability in that space on APRs in the card business have generally -- the issuers have generally adjusted headline rates along with the change in the prime rate. So there's a kind of a stability in the margins there.\n\nAnd so again, we see a pretty stable competitive environment in the major -- among major card players. A thing that we've mentioned a number of times is concern about the fintechs and their impact on a business like the card business, less so by the fintechs actually running around issuing credit cards, but more by the impact from other credit products like installment loans, buy now pay later loans and others that can affect the portfolio of borrowing that our customers, current and prospective customers might have. So we were pretty concerned and we've talked about it a number of times about the rapidly growing extent of fintech credit extension compounded by the fact no one could measure the size of it because many of these folks like many of the buy-now-pay-later players, for example, not reporting to the credit bureaus. The other thing that caught our eye, of course, all along the way here is virtually every fintech that enters lending enters in the lower side of the market.\n\nThere's virtually no one that enters right at the heaviest vendor side of the market. They just don't have the scale for those thin-margin businesses. And so the fintech accesses to the extent that they're there were logically and inferentially from what we see would be more in the lower end of the market, and that, of course, is something we watch pretty carefully to the best extent that we can see it. Now the one thing that just intuitively is a helpful thing to the cause here is that fintechs have generally struggled.\n\nThey seem to have dialed back quite a bit. So there may be less pressure in that particular space. But another thing to keep our eye out for here is it's not just the amount of volume of marketing or the intensity of competition is the underwriting choices that folks make. Another thing that, Sanjay, that we have had our eye on is basically FICO drift.\n\nAnd you can absolutely see out there the reduction in the size of the subprime population. Now we can all ask ourselves is that really just great news that the size of subprime America has declined, or how much is that a shorter-term impact from all the stimulus, the forbearance, the spending pullbacks, and things that happened during the pandemic? So, we ourselves do our best to try to normalize for those effects in our underwriting. And so, where I would [Audio gap] is to say, I think the competitive risks that exist and that we have seen out there are more in the lower end of the marketplace even with credit cards themselves. If you look at the data, there has been the highest -- there's been more growth in the lower end of the market in terms of just credit card customers than anywhere else.\n\nSo all of this is something we're watching incredibly carefully. And to the earlier question that was asked about how do we do underwriting, we, of course, do everything we can to look at every segment and the -- to look for any changes that we're seeing ultimately in our own performance. We've trimmed around the edges in a few places. But overall, so far, it looks pretty good.\n\nBut partly how we do this, we don't just run around and just let the numbers do the talking. We do a combination of using actually machine learning monitoring-based methodologies to look for early signs of things being off of expectation within our portfolio. And then at the same time, broad strategic logic on what would you expect to happen from this competitive environment, from this credit environment, from this inflationary environment. So that's a window into that side of the business.\n\nOn the auto side of the business, the competition, I don't -- our issue with the competition is really not an underwriting issue at this point. The general risks that we talked about just a couple of minutes ago exist in that space as well on the credit side. But the elephant in the room is the -- really the pricing of auto loans at this point by a number of players. And while that is not directly a credit concern, it lowers the margin in the business, it lowers the buffer of resilience, and so on.\n\nAnd we manage very carefully to trying to keep a maximum amount of resilience in downturns and lower margins lead us to pull back on the least resilient parts of the business.\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. Thanks very much.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur next question comes from Moshe Orenbuch with Credit Suisse. Your line is now open.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nThanks, Rich, you had an earlier question about kind of the change in delinquency rates. And I'm just -- I'm wondering whether if you think that this cycle, there will be a different -- any sort of different relationship in your two major businesses, in card and auto, between the loss rate and delinquency rate better or worse as we go through the next 18 months or so of credit normalization?\n\nRich Fairbank -- Chief Executive Officer\n\nWell, Moshe, as usual, that's a very insightful question. Let me just comment a little bit on -- just a little bit of a calibration of how we think about credit in the card and auto businesses. The first point would be, it's normalizing in both places, but overall, credit has been strong in both our card and our auto business. But there are three effects that are driving faster normalization of auto losses, then of card losses.\n\nAnd the first is that normalization tends to be more pronounced in the front book of new originations. That's a universal thing that applies across our consumer businesses. But because the front book in auto, the front book replaces the portfolio much more quickly. Then in card, overall portfolio losses should normalize more quickly in the auto business.\n\nThe second is that recovery rates are much higher in auto than in card. Now recoveries tend to be lagged relative to charge-offs. But -- so some of the exceptionally strong performance we saw in auto, including the quarter where we actually had negative charge-offs, that was boosted by higher recoveries from earlier charge-offs. Now that we've seen low charge-offs for an extended period in auto, the raw material for future recoveries is coming down, even if the recovery rate stays strong, and this will have a bigger impact in auto than in card.\n\nBut it will be an effect in both businesses, and it's not something that I think gets a lot of airtime out there, but recoveries are definitionally about what's happening with, a, if you will, the back book of recoveries. And in both of our businesses, the back book, which has been the byproduct of the great news over the last few years in terms of credit to back book, there's just less to work with, but it's especially in effect in auto. And finally, auto vehicle values are now normalizing, which is a headwind relative to a year ago and contributes to the pace of credit normalization in that business. And given where used car prices have been going to sort of record levels over the past year, the general direction of that is much more likely to be down rather than up so that also contributes to a difference between those two businesses.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGot it. And as a follow-up, it's good to see the guidance or some form of expectation of an improving efficiency ratio. But as I look at it, it seems like your balance sheet is still asset sensitive. And so to the extent that revenue growth is impacted and positively impacted by margin expansion, I mean, wouldn't one really naturally expect to see that efficiency ratio improve because that doesn't really come with a lot of attendant costs? So I'm just wondering how to think about that.\n\nAnd what's the right way to think about the spend -- kind of like-for-like spending versus revenue growth?\n\nAndrew Young -- Chief Financial Officer\n\nMoshe, let me take the first part of that, and then I'll hand it over to Rich in terms of asset sensitivity. You can see last quarter's Q, and I would expect it will be a fairly similar number this quarter, an up 100-basis-point shock. Last quarter was 70 basis points impact to 12-month NII, which is something like a couple of hundred million dollars of NII. And again, that's a shock relative to forwards.\n\nSo I just want to clarify that when you talk about us being asset sensitive, we've already baked into our baseline the anticipated, call it, 150 basis points of additional Fed moves over the next couple of quarters. So achieving what I just described suggests the shock beyond that. But I think you should walk around with at this point, we are pretty neutral from an asset sensitivity. So I just wanted to clarify that before Rich provides the broader answer.\n\nRich Fairbank -- Chief Executive Officer\n\nYeah, Moshe, the -- I've often said -- and you and I have -- gosh, we've been working together for two or three decades now, Moshe. And I've often said that I know we do a calculation that says this is, on the things that we can measure, this is the impact of, say, a rise in rates. I've often said, it can look good on paper to have a rise in rates, but I for three decades have been rooting against rises in rates because of the sort of unquantifiable other aspects of the business. Now, of course, no one out here is rooting for the kind of inflation that we're seeing and the kind of risk there.\n\nBut I just want to flag that while the math talks about certain benefits that come just a couple kind of obvious, but I think important things that affect many of our metrics in the business. One is the conversation that we just had about the auto business. I think it's -- most businesses in the world, most industries struggle when the cost of goods sold goes up, struggle to get that to make its way into pricing. And the auto business is a classic example of this and particularly since, unlike if you're selling groceries at the store, it's pretty clear what's the cost of goods sold, and therefore, how you might want to price those groceries in this business with the complexity that comes from how any particular auto lender calculates their funds transfer pricing and really effectively what is their margin, that can put pressures in the business.\n\nAnd what we're seeing in auto, the compression in margins, the growth opportunity that we're losing right now, that can sort of swamp the math of Andrew's interest rate calculations. And then, of course, I think the biggest issue is the impact of rising rates on the economy and on potentially credit outcomes. And back to our friend, the operating efficiency ratio, credit impacts make their way into the operating efficiency ratio, of course, through -- well, through the growth in -- through how much growth we can get and also things like the fee and finance charge reserve impacts that come. So, I'm not -- yes, so that's why I think, in many ways, the kind of progress that we continue to hope to achieve over the years an operating efficiency ratio might be more in spite of rather than because of higher rates.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur next question comes from Arren Cyganovich with Citi. Your line is now open.\n\nArren Cyganovich -- Citi -- Analyst\n\nThanks. I was hoping you could talk a little bit about the card acquisitions that you're having today. You're a full spectrum lender, but your, I guess -- I would characterize, I guess, newer in the heavy spend section with your venture ex card. Are you acquiring more of that segment? And then also have you been pulling back at all in maybe revolver nonprime segment recently?\n\nRich Fairbank -- Chief Executive Officer\n\nYeah. So, the -- we have talked a lot about the traction that we're getting at the top of the market in the pursuit of heavy spenders. And I wouldn't call us relatively new player in that business. We're one of the actually pretty significant players in the space, but certainly not the biggest, not even close.\n\nBut I think that the bigger point there is that we continue to see more traction there. And whenever we -- you see metrics about growth in purchase volume, we don't share metrics about what kind of growth rate we're getting at each spender level in the marketplace. But the higher the spender level, the higher -- the even faster growth rate we've been getting. So that's a manifestation of the success we're getting.\n\nAnd it's a -- it's both the byproduct of the investment we're making, but also leads us to continue to lean into those investments. But for all you hear of our enthusiastic comments about the top of the market, I don't want to leave an impression that we are, therefore, less enthusiastic about the opportunity elsewhere. We continue to grow across the credit spectrum. We have several decades of experience in the lower end of the market.\n\nAnd one of the real benefits of our tech transformation has been allowing us to build a lot more sophistication, more data, more machine learning, and other things into the credit underwriting process, and that allows us to be stronger and have more growth opportunities and better credit quality in the -- at the lower end of the market. So the story -- the net impression I want to leave with you is one of very continued success across the spectrum. There are places, however, that we, for a long period of time have been cautious about and frankly, doing our best to minimize. And one of those is high-balance revolvers.\n\nSo high-balance revolvers, which just -- what the term -- we -- that term to us just to clarify that concept is not necessarily what are the balances that any revolver, any customer might have with us, but it's collectively their total bureau balances. And we have been very cautious about booking customers for years now and even more so after the Great Recession, booking customers with a high level of balance -- revolver balances across their -- that consumer's portfolio. It tends to be -- to not go there, ties one hand behind our back a little bit in terms of growth because the growing high-balance revolvers is a good way to grow. And it also tends to be quite profitable business.\n\nBut that is a segment that we have been concerned about the resilience and downturns, and so we've tended to for years now try to deemphasize that. I say deemphasize. No one can fully get out of a segment like that because the -- we can't control whether our own customers turn into high-balance revolvers, but what we can control is whether they enter as high-balance revolvers. So that's a little window into maybe where we go a little more lightly.\n\nArren Cyganovich -- Citi -- Analyst\n\nThank you.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur next question comes from Don Fandetti with Wells Fargo. Your line is now open.\n\nDon Fandetti -- Wells Fargo Securities -- Analyst\n\nHey, Rich. Can you talk a little bit on the move to the public cloud. It's been a bit since we've heard a lot on that. Are you still feeling like it's improving your new product development rollout?\n\nRich Fairbank -- Chief Executive Officer\n\nYeah. Well, Don, we feel great about our move to the public cloud. It's a central part of our technology transformation, probably the most salient part of it, but certainly not the only part. But this transformation has involved a transformation in terms of the tech talent within the company, bringing lots of -- thousands of engineers in-house, bringing more of the tech investment inside the company as opposed to reliance on vendors, so many of them industrywide who are old school legacy vendors and quite expensive at that -- it's involving -- involved transforming how we build software, it's involved going to the cloud, it's involved transforming our data ecosystem, it's involved modernizing all of the applications on which the company is built.\n\nSo there's been a lot to this journey, and we're a decade into it. The benefits are all around us. And our -- it really starts in many ways with benefits in the tech business itself, where our technology teams are moving faster, getting products to market sooner. And our software engineers, it's -- are just way more modern tech stack to work with and automated software delivery methods and can also, to your cloud point, benefit by the tremendous, not just -- well, a tremendous and continuing innovations that are happening on the cloud.\n\nOur customer experiences to continue to get more and more -- just better and better and some of the -- we noticed it in Net Promoter Scores and occasional awards that Capital One wins. The new products, we've been able to innovate things like Capital One Shopping, Virtual Cards, Dealer Navigator, Instant Issuance, many things have been very benefited there. I mentioned earlier the ability to get some transformational improvements on underwriting fraud management and a lot of things behind the scenes that leverage the power of big data and machine learning in real time that has been very beneficial. Our transformation also is changing how we work inside Capital One.\n\nOur new marketing platforms are -- part of the reason that we're investing more these days in marketing is really the power of mass customized, machine learning-driven marketing. So that's been a good thing. And it's also, as I mentioned earlier, had a bunch of benefits in terms of enhancing productivity of the business. And the final thing I would say there, Don, is that the tech transformation is really helping us get more of the thing we needed to start with to make it happen and that was talent.\n\nThe biggest elephant in the room for corporate America who sits on legacy tech stacks is you need lots and lots of very modern, best-in-class tech talent in order to drive that transformation in a world where the scarcest, the tightest, and most competitive labor market I've seen in the history of building Capital One is the competition for really modern tech talent. The transformation requires so much of that talent. And one of our rewards is now as we get on the other side of the canyon and really have a tech stack built like the very modern tech companies, the ability to attract talent is accelerating, and that's part of a virtuous cycle. That is why we did it.\n\nIt's why we went on this journey, and it's something that we see to this very day, and it's also why we continue to invest more in the opportunities that we see.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur next question comes from Rick Shane with J.P. Morgan. Your line is now open.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nHey, guys. It's Rick Shane. I think I just got called on. Andrew, a quick question for you.\n\nWhen we look at the reserve rate on the domestic card portfolio, it ticked up slightly. Most of the build was a function of portfolio growth. Context is year over year, the single biggest increase in delinquencies that we've seen. I'm curious when you think about the factors setting the allowance going forward, have you incorporated the trajectory of how fast delinquencies are increasing? Or is it a function of where delinquencies are now and an economic outlook? And can you capture that sort of rate of change?\n\nAndrew Young -- Chief Financial Officer\n\nSure, Rick. Well, let me just start by talking about the inputs to the allowance, I just think it's important to sort of ground on the mechanics -- the entirety of the mechanics, not just the piece that you called out. So the first factor, of course, is just the size of the balance sheet. The second is really aligned to what you were just talking about, but it's kind of a combination of factors.\n\nAnd that is really our outlook for future losses net of recoveries against that balance sheet. So that starts from a place of looking at what is in the delinquency buckets today, which gives us a really good view of how the next, say, six months or so of losses are going to play out. And then after that period, we have an assumption of continued normalization from those unusually strong levels. And then beyond that horizon, as I think you know, under CECL, there's just an assumption of a gradual revision to historical averages.\n\nAnd then the third point is we apply qualitative factors against all of those expectations to account for uncertainties around economic downsides and inflation-related risks. And so when we think about the allowance going forward, yes, I mean, today's allowance, of course, does incorporate in what is in the delinquency bucket today and what that implies. But as we go forward, the allowance is really going to primarily be determined by just the growth in the balance sheet, and we saw that impact the allowance this quarter. But then secondly, every quarter, we continue to normalize, we are going to be replacing lower loss content of the current quarter with higher loss content of future quarters, which, again, will be informed by how the delinquencies are playing through each successive quarter.\n\nSo there's a number of other modest considerations, but that's really the two big forces at play. And hopefully, that gets to kind of the nature of your question.\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nIt does. And I guess, what I'm really trying to understand is that if we follow the path that you expect in terms of normalization and what's embedded in the reserves today and economic outlook doesn't change, because, again, I realize that's something you can't control. If you follow the expected path, will -- does that mean the allowance stay static? Or do you follow along that path? I think that's what I'm really trying to get to.\n\nAndrew Young -- Chief Financial Officer\n\nWell, you're going to follow along that path because then when we get to a quarter from now, we're going to apply all of those same factors to the allowance at a quarter from now. And the change in the allowance is just going to be the quantum of allowance we have today compared to the quantum of allowance that we would have doing those exact same things a quarter from now.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur next question comes from Bill Carcache with Wolfe Research. Your line is now open.\n\nBill Carcache -- Wolfe Research -- Analyst\n\nThank you. Good evening, Rich and Andrew. Following up on that last question, what level of unemployment would you say is implicit in your allowance? And marrying some of the micro with the macro from the earlier discussion, how does Capital One view the risk that some of the credit normalization trends that you're seeing currently will ultimately be accompanied by some degree of degradation to the extent that the Fed proceeds through the hiking cycle?\n\nAndrew Young -- Chief Financial Officer\n\nWhy don't I take the first one, and I must admit, I'm not quite sure I followed the second. So, if Rich followed that, otherwise, we'll come back to you for clarification. But in terms of unemployment, I'm not going to provide specific metrics or economic assumptions. I will say, though, Bill, we are generally consumers of like industry forecasts as opposed to developing our own.\n\nSo, I think you could look at general consensus expectations for all of the key economic variables and assume that that kind of roughly approximates what underlies our economic views on those variables. And I'm looking at Rich to see if he follows the second part of your question.\n\nRich Fairbank -- Chief Executive Officer\n\nI think so. Bill, I think your question was -- I'm going to put it in different words just to see if I'm saying the same thing. We've got normalization going on right now with an economy that in some ways, certainly employment-wise and some metrics not in a terrible place. And you have normalization -- when normalization meets potentially significant economic worsening coming out of the -- or may be catalyzed by the Fed going through their tightening right now, how do we feel about that? Was that your question?\n\nBill Carcache -- Wolfe Research -- Analyst\n\nYes. \n\nRich Fairbank -- Chief Executive Officer\n\nI'm going to start doing earnings calls by just asking the questions and then answering them. So -- but look, that is a great question. And I think none of us should just be mathematical about normalization. Now I've talked about how the root word in normalization is normal because what is abnormal is that credit ever got to this once-in-a-lifetime place it did during the pandemic.\n\nSo, as I've said, in absolutely normal times, this thing should normalize. So, the way -- so we look at that and say and expect that that should continue. And then we look at the economy in the way that we would always look at that as we've done many times, we've been looking down the gun barrel of a potentially highly uncertain and maybe likely a worse economy. And it's certainly hard to be in the prediction business.\n\nBut what we do is we -- the -- there's a couple of big things that we do as an approach. First of all, we underwrite to an assumption of worsening. We try to make it. So, if things go bad, it's not a surprise that it would be really bad banking to be underwriting to good scenarios.\n\nAnd I know everyone tries to be conservative, but I'm just saying with over three decades in building this company, at the heart of it is underwriting that looks in the rearview mirror of how programs are doing and overlaying a worsening assumption on that because that is -- could happen, and we need to be resilient to that. So, you'll often hear Capital One talking about the word resilient -- resilience. Without a crystal ball about what's going to happen over time, the critical thing is what is the resilience of the loans that we are booking. And we spend a lot of time, for example, in the card business, just looking at the ratio of revenue margin to the charge-off rates and stressing that and all kinds of things.\n\nSo, we underwrite to worsening. That's a very important thing. Secondly, it is the management of credit decisions at the micro level so that we're looking for the earliest indications of where problems can occur. And like I said earlier, that's both -- there's -- let me just give you a little bit of window into that.\n\nWe, of course, have our way that we look at how all our businesses are doing and all of our vintages are doing. We leverage machine learning, though, to also look for aberrations and anomalies that happened faster than they would show up with a report and maybe coming from sources that would not be our standard set of variables by which otherwise, our models would look at the business. And so real-time machine learning-driven monitoring is really important in any environment, but we -- it's really important in an environment like this because we're looking for -- because we expect anomalies to happen, we expect some of our segments to be stressed in even the current environment certainly as things get worse, and so we're on the lookout and we have machine learning to help us. And then as I mentioned earlier, and sorry to be repetitive, but then -- but it's not just letting the machines and the models do the work.\n\nIt's standing back and saying -- gathering people around and saying, let's think of all the things that could go wrong, what do you think will go wrong and what -- where would weaknesses appear. And then based on that intuition, we go hunting for them. And all of the different approaches have been bearing fruit lately on a more modest basis in the card business and a little bit bigger basis in the auto business. And I would expect as the environment gets -- if it gets a whole lot worse from here, we're going to -- there's going to be a lot of active trimming all over the place.\n\nAnd so it's a combination of literally the most micro and analytical of approaches marrying the most intuitive and big picture judgmental approach to managing risk.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur next question comes from Mihir Bhatia with Bank of America. Your line is now open.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nHi, thank you. I think just -- I wanted to ask about the -- I appreciate your comments earlier about you're enthusiastic about all of card lending so full spectrum. But just given the recent focus on the higher spend and the more transactor-type customers, I was wondering if you think that growing that portion a little bit, maybe that portion has been growing at an outsized rate. How is that growth of that subsegment potentially change the card portfolio's performance through the cycle or in a downturn?\n\nRich Fairbank -- Chief Executive Officer\n\nThat is a great question. In fact, let me pull up for a second before I answer your question. We have very gradually across the business, paralleling the move to the top of the market. All across our business, we have been leaning harder into the spender side of the business and just continuing to be most attracted to customers who are there to spend, whose patterns would be more consistent with the spending side of the business even as there is a bunch of revolving.\n\nSo, across our business, there has been a very gradual but purposeful migration for years toward the spender side. So, I'll put that down there. And then the second thing is the avoidance of high-balance revolvers. And then thirdly, the thing you're pointing to the -- importantly, increasing mix of heavy spenders in our business.\n\nThe impact -- I think when a downturn comes, these things that we've been leading into and things we've been avoiding should be, all other things equal, beneficial to the performance of the business in terms of the credit losses themselves, the payment rates that we experienced there during the business. And part of why we have leaned into spenders more is just because all the evidence that we have seen is that it tends to just be pound for pound a more resilient group. So, while it's not a controlled experiment, I think the net effect of these changes will be beneficial to the credit results and, I think, enhance the resilience of the business that we have booked.\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nThank you. And then just if I could ask just about the tech investments that you've been making. Can you talk about just how do they improve your ability to flex expenses as the competitive or macro environment changes? Thanks.\n\nRich Fairbank -- Chief Executive Officer\n\nIronically, I think they may be -- made things a little less flexible to -- on the expense side, let me explain that. An increasing part of our cost structure as a company is our -- is the tech business that we have built. It's got a lot of fixed cost to it. And so that is not -- I wouldn't want to set an expectation that our sort of tech stack and our tech company that we have built is a more variable cost business because if anything, it might be a little more fixed cost business.\n\nNow there, within that, choices on what we invest in and the timing of those always create flexibility. And in stressful times, they're certainly on the investment side within tech can be more flexibility there. But the tech investment though pulling way up has tremendously enhanced Capital One's overall flexibility. Our ability to turn quickly in the marketplace to make credit choices.\n\nIf you look back to the -- when we all went -- when the world went into vertical free fall of uncertainty in the pandemic, just look back at how quickly Capital One turned with respect to some of the pullbacks we did. That would not have been possible in the more legacy world that we lived in before. So, the ability to respond quickly, the ability to create changes in the offerings to consumers, the ability to create, well, flexibility and offerings, flexibility and forbearance, new ways to adapt to the marketplace. Everything about Capital One, the speed of change of managed change is dramatically different from before.\n\nWe also -- and this is probably the most important recession resilience point is the monitoring point I made earlier to have put in place a much more comprehensive real-time monitoring capability with root cause analysis that's much more comprehensive than what we could have done before will allow us to be informed earlier on about things that are happening. And I do want to say I've been asked by a number of investors. Rich, we know you well enough to know how cautious you are about the economy and about downturns and the utmost respect for what -- how risk can play out in these businesses, why are you leaning into the marketing opportunity? And one of the reasons that we're doing that is this substantially improved measurement, monitoring, and speed of response and the level of segmentation and micro segmentation by which we can do that gives us -- allows the sort of paradoxical thing to lean in more than we otherwise might have been able to do.\n\nJeff Norris -- Senior Vice President, Finance\n\nNext question, please.\n\nOperator\n\nOur final question this evening comes from Dominick Gabriele with Oppenheimer. Your line is now open.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nHey, can you hear me? This is Dominick from Oppenheimer.\n\nRich Fairbank -- Chief Executive Officer\n\nYes, Dominick.\n\nAndrew Young -- Chief Financial Officer\n\nYes.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nOK. Sorry. I guess so -- is there any reason, Rich, why you would expect the payment hierarchy among consumer products in which they choose to pay or default, let's say, in times of severe stress, is there any reason why anything you're seeing that would change that hierarchy this cycle around from previous cycles? And then I just have a follow-up. Thank you.\n\nRich Fairbank -- Chief Executive Officer\n\nDominick, that's a great question. I can only sort of speculate here, but the most striking thing about the global financial crisis and Great Recession that -- from a payment hierarchy point of view is what we saw with people literally walking away from their mortgages. And what was really high on the payment hierarchy was auto loans. And we -- and that may be a kind of a more universal resilience point on the auto side because people still have to drive to work.\n\nAnd so that's probably more of a sustaining insight. I think that the -- we got to look at student loans and think about where -- I think we've already observed that's pretty low in the payment hierarchy and trends these days and forgiveness and various things there would probably ensure that's on the lower end. Another one that I would probably just speculate to add to the hierarchy this year is this time around is fintechs. And I think the fintechs who don't report to the credit bureaus may have enjoyed their stealth opportunity to grow, but that's probably not lost on the consumers.\n\nAnd so, I think one of the reasons we've really leaned harder into having spending be the anchor part of a consumer credit card relationship is that it's not only a healthier place to be from the consumer point of view. But I think, counting on that credit card and making sure that you've got that in a downturn, that helps from a payment hierarchy point of view.\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nOK. Great. And then just -- when you just think of -- I just want to go back to the tech investment and spend and how you think about it over the cycle and perhaps even some of the peers that you talked to at conferences. How do you as one of the country's largest banks think about the investment that you put on? And what do you find does have -- what type of economic factors? Is it NIM? Is it NII growth? Changes or the credit growth? Changes that can have you put the brakes on the edges on year-over-year growth and tech investment spend? Thank you so much.\n\nRich Fairbank -- Chief Executive Officer\n\nThank you, Dominick. These are all great questions. We -- in case you haven't noticed, I have a pretty deep conviction about the benefit of these tech investments, and that's not just how I feel, that's how all of us collectively feel here at Capital One. And the benefits of that tech investment are so comprehensive, although the company -- inside this company, we can see them everywhere.\n\nAnd they just so enhance how we work, the ability to manage risk, the ability to serve customers, the ability to create new products, the ability to grow. And so we do -- and because we see such benefits, we are continuing to lean into tech investments. And as I mentioned earlier, there's sort of under the surface quite a bit of productivity gain coming from the tech investment. But on the other hand, at the same time, we're leaning in pretty hard into tech investments such that it's -- the effects are not that dramatic.\n\nIn fact, over close to a decade, there's been a more gradual kind of improvement in operating efficiency. We -- there's always the opportunity if times get really tough to pull back on tech investments, but we are not viewing these like luxury investments and just what to do on a sunny day because they are very materially transforming the opportunities of this company and the ability to manage risk and the ability to weather the very downturn that might motivate that reduction in investment.\n\nJeff Norris -- Senior Vice President, Finance\n\nWell, thank you, everyone, for joining us on the conference call and your continuing interest in Capital One. Remember, the Investor Relations team will be here this evening to answer further questions you may have. Have a good evening, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Norris -- Senior Vice President, Finance\n\nAndrew Young -- Chief Financial Officer\n\nRich Fairbank -- Chief Executive Officer\n\nKevin Barker -- Piper Sandler -- Analyst\n\nRyan Nash -- Goldman Sachs -- Analyst\n\nBetsy Graseck -- Morgan Stanley -- Analyst\n\nSanjay Sakhrani -- Keefe, Bruyette and Woods -- Analyst\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nArren Cyganovich -- Citi -- Analyst\n\nDon Fandetti -- Wells Fargo Securities -- Analyst\n\nRick Shane -- JPMorgan Chase and Company -- Analyst\n\nBill Carcache -- Wolfe Research -- Analyst\n\nMihir Bhatia -- Bank of America Merrill Lynch -- Analyst\n\nDominick Gabriele -- Oppenheimer and Company -- Analyst\n\nMore COF analysis\n\nAll earnings call transcripts"
}