{
  "companyName": "Axsome Therapeutics",
  "companyTicker": "AXSM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/axsome-therapeutics-axsm-q3-2022-earnings-call-tra/",
  "content": "Axsome Therapeutics (AXSM 0.82%)\nQ3 2022 Earnings Call\nNov 07, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Axsome Therapeutics conference call. [Operator instructions] I would now like to turn the conference over to your host, Mark Jacobson, chief operating officer at Axsome Therapeutics. Please go ahead.\n\nMark Jacobson -- Chief Operating Officer\n\nThank you, operator. Good morning, and thank you, all, for joining us on today's conference call. This morning, we issued our earnings press release providing a corporate update and details of the company's financial results for the third quarter of 2022. The release crossed the wire a short time ago and is available on our website at axsome.com.\n\nDuring today's call, we will be making certain forward-looking statements. These statements may include statements regarding, among other things, the efficacy, safety, and intended utilization of our investigational agents; our clinical and nonclinical plan; our plans to present or report additional data; the anticipated conduct and the source of future clinical trials; regulatory plans, future research and development plans; our commercial plans regarding Sunosi, Auvelity, and our pipeline product; revenue projections; and possible intended use of cash and investments. These forward-looking statements are based on current information, assumptions, and expectations that are subject to change and involve risks and uncertainties that may cause actual results to differ materially from those contained in the forward-looking statements. These and other risks are described in our periodic filings made with the Securities and Exchange Commission, including our quarterly and annual reports.\n\nYou are cautioned not to place undue reliance on these forward-looking statements, which are only made as of today's date. And the company disclaims any obligation to update such statements. Joining me on the call today are Dr. Herriot Tabuteau, chief executive officer; Nick Pizzie, chief financial officer; and Lori Englebert, executive vice president of commercial and business development.\n\nHerriot will first provide an overview of the company and then review recent developments and upcoming milestones. Following Herriot, Nick will review our financial results, and Lori will provide a commercial update. We will then open the line for questions. Questions will be taken in the order they are received.\n\nAnd with that, I will turn the call over to Herriot.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nThank you, Mark. Good morning, everyone. And thank you, all, for joining Axsome Therapeutics third quarter 2022 financial results and business update conference call. The past few months have been pivotal and exciting at Axsome.\n\nOur transformation into a commercial stage, fully integrated, and research and development-driven, CNS-focused biopharmaceutical company has accelerated with the commercialization of Sunosi for EDS associated with narcolepsy and obstructive sleep apnea, and now, with the launch of Auvelity for the treatment of MDD in adults. In addition, our broad and differentiated CNS pipeline continues to progress. The third quarter was the first full quarter sales for Sunosi, and the results demonstrate the efficiency of our commercial approach's current and future initiatives. And potential indication expansion for Sunosi bode well for the continued growth of this differentiated product with a significant market potential.\n\nNick will provide more details on our financial performance. We are thrilled to have recently launched Auvelity, making this important new treatment available to the millions of adult patients living with MDD in the U.S. Auvelity is now helping to address a major public health concern, given the current mental health epidemic. While still very early days with only 12 days on the market, Lori will provide some comments on our initial experience.\n\nComplementing our commercial progress, our broad late-stage CNS pipeline continues to progress, setting the stage for potentially continued significant value creation over the near, intermediate, and long term. This pipeline includes AXS-07 for migraine; AXS-07, AXS-05 for Alzheimer's disease agitation; AXS-12 for narcolepsy; AXS-14 for fibromyalgia; as well as ADHD, a potential new indication for solriamfetol, or Sunosi. With regards to AXS-07 for the acute treatment of migraine, we completed a Type A meeting with the FDA in the third quarter. Based on the meeting results, we intend to resubmit the AXS-07 NDA in the third quarter of 2023.\n\nAs a reminder, no additional clinical efficacy or safety trials have been requested by the FDA for resubmission of the NDA. With regards to our Alzheimer's disease agitation program, we recently initiated the ADVANCE-2 study, which is a phase 3 randomized, double-blind, placebo-controlled, multicenter trial to assess the efficacy and safety of AXS-05 for the treatment of Alzheimer's disease agitation. Concurrent with the initiation of the ADVANCE-2 trial, we have concluded the ACCORD randomized withdrawal trial as planned. Top-line results from the ACCORD trial are now on track for the fourth quarter of 2022.\n\nFor AXS-12, our product candidate for the treatment of narcolepsy, enrollment in the SYMPHONY phase 3 trial is progressing, and top-line results continue to be anticipated in the first half of 2023. For AXS-14, our product candidate for the treatment of fibromyalgia, manufacturing and other activities related to the planned submission of an NDA are ongoing. And we expect to submit the NDA for this product in 2023. With regards to solriamfetol, or Sunosi, for the treatment of ADHD, we are preparing to initiate a phase 2/3 multicenter, randomized, double-blind, placebo-controlled trial in this indication in the fourth quarter of this year.\n\nThe Axsome team is, therefore, busy and excited as we prepare to deliver on continued ongoing commercial progress and near and intermediate-term pipeline milestones, which include clinical trial readouts, clinical trial initiations, and NDA filings over the remainder of this year and through 2023. I will now turn the call over to Nick, who will provide a financial update.\n\nNick Pizzie -- Chief Financial Officer\n\nThank you, Herriot. And good morning, everyone. Today, we'll discuss our third quarter results and provide some financial guidance. Total revenue in the third quarter of 2022 consisted of net sales of Sunosi.\n\nSunosi generated U.S. net sales of $16.8 million in the third quarter, which was the first full quarter of sales. As a reminder, the acquisition of Sunosi in the U.S. was completed on May 9th, so there were no Axsome-generated sales in the prior-year comparable period.\n\nWe remain on track to close the ex-U.S. portion in the fourth quarter of 2022. Cost of product sales for the quarter were 1.9 million. R&D expenses were 14.9 million for the third quarter and $13.2 million for the comparable period in 2021.\n\nThe increase was driven by personnel expense and costs associated with ongoing clinical trials. SG&A expenses were 40.9 million for the third quarter and 20.2 million for the comparable period in 2021. The increase was primarily related to a full quarter of commercial activities for Sunosi, prelaunch activities for Auvelity, and personnel expense, along with an increase in noncash stock compensation expense. Net loss was $44.8 million, or $1.07 per share, for the third quarter and net loss of $34.9 million, or $0.93 per share, for the comparable period in 2021.\n\nThe net loss for the current period included 9.2 million of noncash stock compensation expense, compared to 5.7 million in comparable period. We ended the quarter with $227.5 million in cash and equivalents, compared to 86.5 million at December 31, 2021. During the third quarter, we utilize our ATM facility realizing net proceeds of $175 million. As a reminder, with the FDA approval of Auvelity, up to $100 million is immediately available under our $300 million term loan facility.\n\nWe believe that our current cash balance, along with the remaining committed capital from the $300 million term loan facility with Hercules Capital is sufficient to fund anticipated operations into 2025 based on our current operating plan. I will now turn the call over to Lori for a commercial update.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nThank you, Nick. And good morning, everyone. With Sunosi and the very recent launch of Auvelity, we now have two marketed products, both of which address serious conditions. I am excited to provide a commercial update for these two important and differentiated therapies.\n\nI'd first like to start with Sunosi. Q3 represents the first full quarter for Sunosi as an Axsome product. As a reminder, Sunosi is the first and only DNRI for excessive daytime sleepiness in obstructive sleep apnea and narcolepsy and the first and only wake-promoting agent proven to improve wakefulness through nine hours. In the quarter, total Sunosi prescription growth outpaced the wake-promoting or WPA market.\n\nU.S. total prescriptions for Sunosi in the third quarter grew 15% year over year versus the WPA market growing only 1%. Quarter-over-quarter sequential total prescription growth was 3% for Sunosi versus 0% growth for the WPA market. Our digital-centric commercialization, or DCC platform, is performing well and has contributed to increased salesforce productivity for Sunosi that is approximately twice that of prior periods and of the industry average.\n\nThis contemporary integrated omnichannel approach to meaningful customer engagements is also being used for the launch of Auvelity and will be leveraged for the commercialization of future products in our pipeline. The growth potential for Sunosi is substantial, and we continue to estimate peak U.S. sales potential in the current indication alone of 300 million to 500 million. OSA affects an estimated 22 million U.S.\n\nadults, 87% of whom experience EDS. And narcolepsy affects close to 200,000 people in the U.S., all of whom experience EDS. Sunosi currently enjoys only a 2% share of drug-treated OSA patients and a 7% share in drug-treated narcolepsy patients. We expect increased and enhanced promotional and disease education efforts to drive market share growth for Sunosi.\n\nPayer coverage for Sunosi remains broad, with 96% of commercial lives covered and 83% of total lives covered. Turning to Auvelity. We announced the commercial availability of Auvelity on October 20th. It is still very early days.\n\nBut so far, we are very encouraged by the early interest. Our field force is actively engaging healthcare providers to provide comprehensive education on Auvelity. We are proud of the quality of our sales specialists, the vast majority of whom have prior psychiatric medication experience, including antidepressants. Guided by our DCC platform, our field force has already reached more than 15% of our prescriber target list with only 12 days on the market.\n\nWith regards to payer coverage, the commercial channel is expected to be the primary channel for Auvelity. As a rule, new therapies are generally blocked by commercial payers for the first six months after launch, while they perform clinical reviews and decide on formulary placement. Interactions with commercial payers have been active and productive. And we expect some formulary decisions over the next six months.\n\nIn the Medicare and Medicaid channels, antidepressants are a protected class. In order to help ensure that patients have access to and that physicians have an easy experience prescribing Auvelity, we have enabled a comprehensive suite of tools and services in our patient support program, Auvelity on My Side. Our patient support services include a pay no more than $10 per month savings card for eligible patients, samples, and prior authorization support for HCPs, among other tools. Major depressive disorder, or MDD, is a major public health concern, with 21 million U.S.\n\nadults diagnosed in 2020. And recent publications have reported significant increase in prevalence as a result of the pandemic. We are proud to make a reality available to patients living with MDD and their physicians. I will now turn the call back to Mark to lead the Q&A discussion.\n\nMark Jacobson -- Chief Operating Officer\n\nThank you, Lori. Operator, can we please have our first question? And if folks on the line that are asking questions could please be mindful of two to three questions per person, that would be fantastic. And that's just based on the size of the queue that we have. Thank you.\n\nOperator\n\n[Operator instructions] Our first question is coming from Charles Duncan from Cantor Fitzgerald. Your line is now live.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nHi. Yeah. Herriot and team, congrats on a nice quarter. Thanks for taking our questions.\n\nThe first question is along the lines of commercial. And then, I had a pipeline question for Lori for commercial. When you talk about Auvelity, what do you think -- you know, I know it's only been a few days, but what do you think is most attractive to prescribers with regard to the clinical profile? Is it differentiated mechanism or onset or limited side effect or what?\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nHey, Charles. Thanks for the question. It's all of the above. It's -- like I said, our field force has been very, very active since we announced the product availability.\n\nOnly 12 days in the market, you know, their interactions with us have been -- and I just want to make sure everyone's clear, they have been full clinical reviews of Auvelity with 15% of our target list. These are, you know, direct interactions with HCPs. So, it's been really exciting to hear, you know, just how active they are and how engaged physicians are. It's very hard to point to just one thing.\n\nIt varies by physician, obviously, but all of the above are rising to the top.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nOK. We'll look for more color in later quarters. On the pipeline, I guess, on old slides, I -- Herriot, you mentioned the randomized withdrawal study has been concluded, but the double-blind study is advancing or has -- ADVANCE-2 has started. I guess I'm wondering, what kind of feedback have you gotten from the agency with regard to being able to interpret randomized withdrawal? And then, just a quick one, on 07, what is really the gating factors to give you visibility on -- of one year from now being able to resubmit that NDA for 07 in migraine? Thanks.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nThanks for the question, Charles. With regards to the feedback from the FDA on randomized withdrawal studies, so, the if you look at that design, what that design does is it gives -- it provides evidence of whether or not a drug is working relative to control. That's very clear. And products have been approved, not just overall, but also in psychiatry, specifically, with a randomized withdrawal study design.\n\nRandomized withdrawal studies, they do not provide you the same information that parallel group studies provide. And that information would include a treatment effect. And with regards to your question on AXS-07, I'll turn that over to Mark.\n\nMark Jacobson -- Chief Operating Officer\n\nHey, Charles. Good morning. So, just the recap there, why the, you know, approximately one year or 3Q next year. So, FDA asked for a number of things from us with respect to CMC, including stability data on our new batches that had already been made or are being made.\n\nAnd so, you know, just a brief background on stability data, right, that data is used to assess and inform the shelf life of an approved product. And there are various stability protocols that can be run. But typical ICH guidelines are at room temperature and accelerated conditions. And those cannot be sped up.\n\nAnd so, you know, typical times are zero, one month, six months, 12 months, etc. So, it's just going through that process and generating those data.\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nGot it. So, it's really Gantt chart. Appreciate you taking the questions. Nice quarter.\n\nThanks.\n\nOperator\n\nThank you. Next question today is coming from Marc Goodman from SVB Securities. Your line is now live.\n\nMarc Goodman -- SVB Securities -- Analyst\n\nYes. Can we talk about Sunosi a little bit? Just give us a sense of just what's going on behind the scenes with gross-to-net inventory changes. I know this is your first full quarter, but maybe you can talk about the product, just how the gross-to-net have been throughout the year and just your payer coverage and just, you know, physician feedback on the product. Thanks.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYeah. Great, thanks for the question. I think Nick will take the gross-to-net question and comment on what's going on behind the scenes, inventory changes, etc.\n\nNick Pizzie -- Chief Financial Officer\n\nSure. Hey, Marc. Good morning. So, first, your question on gross-to-net.\n\nAs we said on the investor call, we expected gross-to-net to beat around 50%, which is kind of what we're seeing. It's been pretty consistent. And then as it relates to inventory, the sales for the quarter really are -- it's not impacted by any type of inventory build or channel inventory in the channel. Essentially, I guess Q2, the 8.8 million, obviously we had to load the channel to start with.\n\nAnd then, for Q3, I think it's a pretty steady state. So, really no inventory impact from -- during the quarter. Lori?\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nYeah. Hi, Marc. I'll just add on payer coverage. You know, our payer coverage has maintained exactly what it was when we acquired the product back in May.\n\nThere's been no payer coverage changes.\n\nOperator\n\nThank you. Our next question is coming from Joon Lee from Truist Securities. Your line is now live.\n\nJoon Lee -- Truist Securities -- Analyst\n\nHi. Thanks for taking our questions. In addition to Veeva systems, are you supplementing your efforts with services from IQVIA? Our understanding is that due to the ongoing litigation between Veeva and IQVIA, Veeva clients are blocked from certain services provided by IQVIA. Just want to understand the flexibility of your DCC efforts.\n\nAnd on the pipeline, what can we expect in terms of the kinds of data you will share for ACCORD by year end? And are there any material differences between the designs of ADVANCE-1 and 2? Thank you.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nHey, Joon. Thanks for the question. So, yeah. So, let me just recap from DCC how our infrastructure is built, and then I can answer your question around IQVIA.\n\nSo, you know, as we've stated in the past, our DCC platform is really built off of Veeva as foundational, and it is supplemented by several different additional tools analytical, machine-learning AI offerings. IQVIA, the limitation with Veeva and IQVIA, you know, we're not impacted by that at all. We actually use Symphony data. And so they're very interchangeable.\n\nAnd that is what feeds through the Veeva system. So, there's no -- there's really no impact to us in terms of what our offerings look like.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nRight. And then, Joon, with regards to your other two questions, the ACCORD data that's expected by year end will be top-line results from the ACCORD trial. So, we look forward to unblinding that study and reporting to you the results as it will provide additional information with regards to the activity of the product in this patient population. As a reminder, the ADVANCE-1 trial was a very positive study.\n\nAnd while the ACCORD trial, while the powering of that study is going to be reduced because we stopped it in order to initiate the ADVANCE-2 trial. We do think that there is a possibility that the results will provide us information directionally, which could support the activity of the product. With regards to the question on ADVANCE-1 and ADVANCE-2, there are no material differences in terms of the design of those studies. So, they're pretty much identical study designs.\n\nJoon Lee -- Truist Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Next question is coming from Jason Gerberry from Bank of America. Your line is now live.\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning. Thanks for taking my questions. I'm wondering if you can just talk a little bit about Auvelity's insurance mix and how that impacts gross to net in, say, the first six to nine months. I know you guys have been out talking about sort of the challenge with commercial coverage in the early days.\n\nSo, just kind of wondering how you anticipate sort of revenue capture per-script basis. And maybe, Lori, if you can comment on sort of effectively, you know, the Amgen kind of free script model with CGRP antibodies out of the gate. Is that something that you can kind of leverage to get early awareness and utilization of Auvelity in the marketplace? And then, also, just on the DCC program with Sunosi, what's the right amount of time to assess the effectiveness of DCC as it pertains to Sunosi? Thanks.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nHey, Jason. Thanks for the questions. A lot packed in there. So, let me just start from the beginning.\n\nSo, the commercial channel is expected to be our primary channel for Auvelity. And as a rule, new therapies across the board, regardless of therapeutic class, are generally blocked by commercial payers for a period of time after approval, while those payers perform their clinical reviews and decide on formulary placement. This does not mean that patients -- that they will not cover patients during this time, if HCPs fill out the appropriate paperwork. That is one of the reasons why we have a robust prior authorization support system in place, as well as our Auvelity on My Side copay card program for patients to make sure that they have, you know, affordable access to that therapy.\n\nWe have been very active in our communications with commercial payers. Those have been very productive since the announcement of launch -- or the approval and even more so after launch. And we really -- and we do expect some of those formulary decisions to be made over the next six months. And as a reminder, you know, there will be some volume that comes through the Medicare and Medicaid channel that those are -- that is a protected class in those channels.\n\nI'll switch over to your question around, you know, the Amgen playbook of providing free scripts. That is not what we're -- that's not what we're set up to do and/or doing. We are providing a copay card and assistance to patients so that patients are effectively getting drug at a very affordable rate, while their physicians are filling out the appropriate paperwork to inform payers that, you know, we would -- we need and would like to have meaningful coverage. I will -- I believe you then asked the question on DCC and the program with Sunosi, and how we're -- you know, how we can see impacts there.\n\nAs you know, as I mentioned in my prepared remarks, we are already seeing the effects of DCC with the Sunosi field force. We have a field force roughly half the size of prior quarters, and we're maintaining the exact same productivity as those prior quarters. We're really encouraged by this as we continue our relaunch efforts of Sunosi. We are in the process of ensuring that our targets are the appropriate targets to have enough appropriate patients to really drive meaningful growth.\n\nAnd our sales reps are, you know, really highly experienced sales reps with an incredible leadership team. And we see that coupled with, you know, additional focus on disease education and additional promotional spend as our avenue for growth.\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nOK. Great. Thanks.\n\nOperator\n\nThank you. Next question is coming from Joseph Thome from Cowen and Company. Your line is now live.\n\nJoe Thome -- Cowen and Company -- Analyst\n\nHi there. Good morning, and thank you for taking our questions. Maybe a first one just on -- I know it's only been, you know, a couple weeks here, but where is the initial demand coming from and kind of where are these patients at within their treatment journey? And do you expect that to change over time? And now that it already is approved in the U.S., maybe what are your updated thoughts on ex-U.S. approvals or licensing? Thank you.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nYeah. Hey, Joseph. Thanks for the question. So, as you would expect, I mean, you know, again, it's only 12 days on market.\n\nBut what we're seeing in these very early days is exactly what you would expect. So, the scripts are coming primarily from psychiatrist with, you know, a nice handful from PCPs. Where patients are in terms of their treatment journey, it's all over the place. And that is likely supported by the fact that, you know, that the clinical profile of Auvelity has data in a very robust and broad subsets of patient groups.\n\nSo, physicians are really finding patients across the board, you know, if they are a candidate for Auvelity. Right now, it's a little bit too early to tell which lines of therapy we're concentrating in. And I'll turn it over to Nick for the ex-U.S.\n\nNick Pizzie -- Chief Financial Officer\n\nHi, Joe. Yeah, so, I mean for Auvelity right now, as we've always stated, we're always looking for ex-U.S. partners. That's how we've consistently stated.\n\nAnd then, for Sunosi, we'll be -- from an ex-U.S. standpoint, as we stated in our opening comments, we are expecting to close on the ex-U.S. portion of Sunosi this quarter.\n\nJoe Thome -- Cowen and Company -- Analyst\n\nGreat. And then, maybe if I could just sneak one on the pipeline. In terms of AXS-12, is all you need for a regulatory submission this upcoming phase 3 data -- is there any additional CMC work that would need to be completed for this therapy ahead of the NDA submission? Thanks.\n\nMark Jacobson -- Chief Operating Officer\n\nHey, it's Mark. Joe, four AXS-12, there is work that's ongoing for CMC. And just a reminder, that is the API, the custom synthesis process that we oversee and as well as drug products. So, all the work to support registration batches, etc., is under way.\n\nJoe Thome -- Cowen and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Next question is coming from Yatin Suneja from Guggenheim Partners. Your line is now live.\n\nYatin Suneja -- Guggenheim Partners -- Analyst\n\nHey, guys. Thank you for taking my question. Just a couple for me. First one is on the sampling.\n\nCan you just comment on whether you are doing sampling? How are the sampling set up? You know, is it like a weekly pack, two-week pack? And then, maybe also comment on if somebody starts on the sample, how the reimbursement work. So, that's the first part. Second is around how are you recognizing revenues, if you can just tell us what does that entail. And then, finally, the Rx data or the PRx data that's available to the third party, how accurate that is.\n\nShould we use that to help model the launch? Thanks.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nThanks, Yatin, for the question. So, Lori will handle the sampling question and also the data reporting, and Nick will handle the revenue recognition.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nHey, Yatin. Good morning. So, in regards to samples. So, the way that we are distributing samples right now is that HCPs can order the samples online or when their rep comes into the office.\n\nSo, they are electronic samples. They are shipped to them immediately. Typically, when -- you know, it obviously varies by HCP. But most likely, what will happen is that physicians will hand samples to a patient and then hand the script or file the EMR script at the same time through the EMR system.\n\nIn terms of size, it is a two-week bottle.\n\nNick Pizzie -- Chief Financial Officer\n\nGreat. And then, as it relates to the revenue, so we are in a title model. So, as such, once inventory transfers from our warehouse to the distributor, sale is recorded, risk of losses is passed at that point, title is transferred. And then, we are booking associated gross-to-net accruals against those gross sales.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nAnd I'll answer the data reporting side. So, both Symphony and IQVIA, you know, especially in early days, it is very hard for them to predict what the capture rate is in terms of capturing all national scripts. So, there is always a factor applied. We have found that they are both very close to expectations.\n\nWe see no reason why they -- why, you know, their capture rates -- they'll be tweaked and get better over the course of the next coming weeks as data gets reconciled. But it's trending in the right direction.\n\nYatin Suneja -- Guggenheim Partners -- Analyst\n\nGot it. Just one quick, if I may. What about the inventory? How are you managing that? Is that a target, like, you know, you need to be in the two-week range? And just if you can comment, and I'll get back in the queue. Thank you.\n\nNick Pizzie -- Chief Financial Officer\n\nYeah, that's correct. So, with the title model, it's pretty easy to ensure that supply is in the channel. So, there's roughly basically two weeks at any given time that's in the channel. And that's currently how we're seeing it.\n\nOperator\n\nThank you. Next question today is coming from Vikram Purohit from Morgan Stanley. Your line is now live.\n\nVikram Purohit -- Morgan Stanley -- Analyst\n\nHi, good morning. Thanks for taking our questions. We had two, both related to what you've learned about duration of use for Auvelity in the early phase of the launch. So, question one, how many bottles of treatment do you think one prescription currently represents? And how do you think this could evolve once the launch is in more of a steady state? And then, secondly, more broadly, what are your current thoughts on how many bottles of Auvelity per year you think the average patient would use, again, once the launch in kind of a full-blown, steady state? Thanks.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nHey, Vikram. Thanks for the question. We've been on the market 12 days, so it's a little bit early to be able to provide you with any credible answer to the duration of use and also to the duration of use with regards to what the scripts represent. I think it's pretty clear.\n\nBut, Lori, could you maybe clarify?\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nYeah. That's exactly what I would say. It's a little bit too early. But we do -- you know, the PI is very clear on dosing, so we fully intend and expect for, you know, a 30-day script should be two bottles.\n\nAnd, you know, again, it's too early for us to have any data by now.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nBut that's what we -- Lori, that's what we're seeing --\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nThat's exactly what we're seeing.\n\nOperator\n\nThank you. Our next question is coming from Chris Howerton from Jefferies. Your line is now live.\n\nChris Howerton -- Jefferies -- Analyst\n\nGreat. Thank you so much. I just had two quick questions. One was with respect to the Sunosi commercial launch.\n\nCould you give us a sense of the split between OSA and narcolepsy? And I guess the follow up to that, you know, what would be the strategy to maximize revenues in narcolepsy, assuming its success, excuse me, in 12? And then, the second question I had is just a curiosity with respect to the new mechanism that was discovered for Sunosi. Any plans to capitalize on the TAAR1 agonism in any way, or just an interesting finding that you found about the molecule? Thank you.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nGreat. So, Lori, maybe --\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nYeah.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nComment on the split between OSA and narcolepsy in terms of scripts, and then I'll pick the other one.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nSure. Hey, Chris. Yeah. So, right now, the current scripts split is about 70, OSA; 30% narcolepsy.\n\nAnd, you know, we -- the OSA market is a massive market, right, 22 million patients suffer from OSA versus 200,000 in narcolepsy. There's definitely room to grow in both. And, you know, it's a bit premature to talk about how we'll work with 12. But, you know, Sunosi is indicated for EDS in narcolepsy only.\n\nAnd so, we will make sure that the early treatment for narcolepsy is capitalized on since that is usually one of the first symptoms that is present in diagnosis.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nWith regards to your question around Sunosi in narcolepsy versus AXS-12, just one thing to remember is that AXS-12 is being developed for cataplexy in narcolepsy. So, Sunosi is -- the indication is excessive daytime sleepiness in patients with narcolepsy. And no activity has been seen with regards to cataplexy. So, the products are complementary.\n\nAnd as it relates to the new mechanism of action for Sunosi, which is called TAAR1 agonism, so, you know, how could that be important? I think the first thing is the realization that there is this differentiating mechanism for solriamfetol. And, secondly, the TAAR1 mechanism has been shown to be pro-cognitive. So, therefore it does relate to the potential effect of the drug on cognition. And we did announce the results of the SHARP study in patients who were cognitively impaired, you know, with OSA and EDS.\n\nAnd what it showed was a statistically significant and robust effect on cognition with Sunosi as compared to placebo. And, you know, we do also like this mechanism of action as it relates potentially to the indication of ADHD. And as we mentioned, we are on track to initiate a phase 3 trial -- a phase 2/3 trial in ADHD with Sunosi, or solriamfetol, in the fourth quarter, which is this quarter.\n\nChris Howerton -- Jefferies -- Analyst\n\nOK. Thank you so much. Appreciate it.\n\nOperator\n\nThank you. Next question is coming from David Hong from SMBC. Your line is now live.\n\nDavid Hoang -- SMBC Nikko Securities -- Analyst\n\nHey. Thanks so much for taking the questions, and congrats on the quarter. I just had a couple. So, you know, with the ADA indication for AXS-05, can you just remind us again, walk us through the different scenarios that are possible there? So, the ACCORD randomized withdrawal study is positive.\n\nDo you still intend to file for approval based on that data? And then, you know, if it's not, then is the plan that you would need the ADVANCE-2 to support the filing, is there any -- are there any other, you know, alternatives besides those pathways?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo, the way that we are approaching it is that we intend to have ÅDVANCE-2 readout before we file an NDA. We want to ensure that we have a robust package. As you are implying, there are a lot of different factors. And we'll know a lot more once we read out the ACCORD trial.\n\nBut right now, our working assumption is that ADVANCE-2 would serve as the second positive trial for an NDA.\n\nDavid Hoang -- SMBC Nikko Securities -- Analyst\n\nI see. That's helpful. And then, just in terms of the Auvelity launch. I guess, you know, a lot of the -- I think a lot of the prior questions had addressed most of it.\n\nBut in terms of as we get deeper into the launch and have several full quarters under our belt, are there metrics that you plan to report regularly, you know, on earnings calls, be it scripts, numbers of patients treated? And would you provide guidance in terms of, you know, revenues for any of the products?\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nYeah. So, I'll answer the first one, and then I'll kick it over to Nick. But, you know, what we will definitely, you know, report on, obviously, will be scripts, as well as, you know, HCP adoption and writers out -- you know, as we get deeper into the quarters.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYeah. And just to add to that, we would also be reporting on payer coverage because we think that that's obviously relevant and of interest.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nAbsolutely.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nYeah.\n\nNick Pizzie -- Chief Financial Officer\n\nAnd as for revenue guidance, obviously, we're in extremely early days, the embryonic days of the launch right now. So, you know, as we progress and grow and as we see access evolve, you know, we'll be able to have a better sense of, you know, where we expect to land. And so, down the road, potentially, yes. But obviously, way too early to give any sort of guidance or expectations of when guidance would be given.\n\nOperator\n\nThank you. Next question today is coming from Graig Suvannavejh from Mizuho Securities. Your line is alive.\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nGreat. Good morning. Thanks for taking my question, and congrats on the quarter. I know you've had a lot of success with DCC.\n\nBut my question has to do with kind of are there plans in the works right now for thinking about a direct to consumer campaign, just any other color on additional marketing and advertising plans for Auvelity? Thanks.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nYeah. Hi. Thanks for the question. So, you know, coming out of the gate for the launch, we want to make sure that HCPs are very much aware of the products and prepared to prescribe if a patient were to walk into the office and ask for the product.\n\nWe are doing that through very strategic and targeted media spins to HCPs but also to patients. And so, we believe in the early days that, you know, it's important to make sure that we have a very thoughtful approach to how we deploy media to consumers. And that is something that we will continue to expand upon and ramp up as we get deeper and deeper into launch.\n\nOperator\n\nThank you. Next question is coming from Matt Kaplan from Ladenburg Thalmann. Your line is now live.\n\nMatt Kaplan -- Ladenburg Thalmann -- Analyst\n\nHi. Good morning. Just a quick follow-up on your Sunosi ADHD program that you plan to launch later this year. Given the, I guess, impact on cognition that you saw in the SHARP study, are you going to incorporate any of those aspects in the phase 2/3 study for ADHD for Sunosi?\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo, thanks for the question, Matt. We'll be providing details on the exact design of the study once we launch it. And, you know, obviously, we are considering the results from the SHARP study as it might relate to exploration of the product in ADHD. So, you know, there may be something that we could look at or that we might want to look at.\n\nWe'd have to determine how best to do that and whether it makes sense to do that. The measures are different. But obviously, cognition or an increase in concentration is an important part of ADHD.\n\nMatt Kaplan -- Ladenburg Thalmann -- Analyst\n\nGreat. Thanks for taking the question.\n\nOperator\n\nThank you. Next question is coming from Myles Minter from William Blair. Your line is now live.\n\nMyles Minter -- William Blair and Company -- Analyst\n\nHi, everyone. Thanks for taking the questions. Just the first one. Are you aware of any major payers since the Auvelity launch that have progressed through their pay, say, meetings, or at least have them scheduled? And I guess what proportion of covered lives those payers would represent? Thanks.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nHey, Myles. Thanks for the question. Yeah. So, as we mentioned earlier, you know, those discussions are active and progressing.\n\nBut, you know, general rule, they're usually blocked for some period of time right after launch so that they can complete their process. Right now, you know, only the Medicare, Medicaid channel, given that it's a protected class, you know, is covered. But as we mentioned previously, the commercial channel will be the primary channel for Auvelity.\n\nMyles Minter -- William Blair and Company -- Analyst\n\nOK. Cool. And then, quick follow-up, just on the free sampling program, if you give those to patients, do those end patients have to have a clear path to reimbursement after their two-week script is finished. Thanks.\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nNo. So, the samples are up to the physician to provide to the patient. So, the physician is well within his right to provide samples to his patient and, you know, decide when and how to write the script.\n\nMyles Minter -- William Blair and Company -- Analyst\n\nOK. Beautiful. Thank you.\n\nOperator\n\nThank you. Our final question today is coming from Bert Hazlett from BTIG. Your line is now live.\n\nBert Hazlett -- BTIG -- Analyst\n\nThank you for taking the question. One very straightforward, is there upside to the ADVANCE-2 trial timing? Or is 2025 conservative? Thank you, and congratulations on all the progress.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nSo, the timing reflects what is on clinicaltrials.gov. And I think it's too early to decide, you know, how much leeway there could be in that timing. You know, we think that it is, overall, conservative, but it is a placeholder. And as the study gets underway further and as we have more information in terms of, you know, initial enrollment, then that will allow us to provide more granularity on the timing of study readout.\n\nOperator\n\nThank you. We reached the end of our question-and-answer session. I'd like to turn the call back over for any further or closing comments.\n\nHerriot Tabuteau -- Chief Executive Officer\n\nWell, you know, thank you again for joining us on the call today. At Axsome, we are committed to bringing potentially life-changing medicines to people living with serious CNS conditions. With the commercialization of Sunosi, the launch of Auvelity, and our broad late-stage pipeline, the hard work of the Axsome team is translating into tangible and meaningful benefits to patients and their healthcare providers. We look forward to updating you over the coming months on our continued commercial and development pipeline progress.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Jacobson -- Chief Operating Officer\n\nHerriot Tabuteau -- Chief Executive Officer\n\nNick Pizzie -- Chief Financial Officer\n\nLori Englebert -- Senior Vice President, Commercial and Business Development\n\nCharles Duncan -- Cantor Fitzgerald -- Analyst\n\nMarc Goodman -- SVB Securities -- Analyst\n\nJoon Lee -- Truist Securities -- Analyst\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nJoe Thome -- Cowen and Company -- Analyst\n\nYatin Suneja -- Guggenheim Partners -- Analyst\n\nVikram Purohit -- Morgan Stanley -- Analyst\n\nChris Howerton -- Jefferies -- Analyst\n\nDavid Hoang -- SMBC Nikko Securities -- Analyst\n\nGraig Suvannavejh -- Mizuho Securities -- Analyst\n\nMatt Kaplan -- Ladenburg Thalmann -- Analyst\n\nMyles Minter -- William Blair and Company -- Analyst\n\nBert Hazlett -- BTIG -- Analyst\n\nMore AXSM analysis\n\nAll earnings call transcripts"
}