{
  "companyName": "Dada Nexus Limited",
  "companyTicker": "DADA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/dada-nexus-limited-dada-q2-2022-earnings-call-tran/",
  "content": "Dada Nexus Limited (DADA -2.11%)\nQ2 2022 Earnings Call\nAug 22, 2022, 9:30 p.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and thank you for standing by for Dada's second quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. After the management's prepared remarks, there will be a question-and-answer session. As a reminder, today's conference call is being recorded.\n\nI will now turn the meeting over to your host for today's call, Ms. Caroline Dong, head of investor relations for Dada. Please proceed, Caroline.\n\nCaroline Dong -- Head of Investor Relations\n\nThank you, operator. Hello, everyone, and thank you for joining our second quarter 2022 earnings conference call. On the call today from Dada, we have Mr. Philip Kuai, chairman and CEO; Mr.\n\nJeff Huijian He, incoming president; Mr. Beck Chen, CFO; and Mr. Jun Yang, co-founder and CTO. Mr.\n\nKuai will talk about our operations and company highlights, then Mr. Chen will discuss the financials and guidance. They will all be available to answer your questions during the Q&A session that follows. Before we begin, I would like to remind you that this conference call contains forward-looking statements.\n\nPlease refer to our latest safe harbor statement in the earnings press release on our IR website, which applies to this call. Also, during this call, we will discuss certain non-GAAP financial measures. Please also refer to our earnings press release, which contains a reconciliation of non-GAAP measures to the comparable GAAP measures. Finally, please note that unless otherwise stated, all figures mentioned during this conference call are in RMB.\n\nIt's now my pleasure to introduce our chairman and CEO, Mr. Kuai, Philip, please go ahead.\n\nPhilip Kuai -- Chairman and Chief Executive Officer\n\nThank you, Caroline, and thank you all for joining us today. Today, with mixed emotions, I announced my resignation from Dada as chairman of the board and CEO. I would like to take this chance to thank everyone who joined our journey together. I'm inspired and proud of what we have achieved.\n\nI believe this transition will take Dada to the next chapter and we are now more ready than ever before to turn the leads. I'm extremely pleased to announce that Jeff Huijian He, our vice president and my trusted business partner, has been appointed as our president. Jeff has been instrumental in our tremendous growth in the past eight years and our deepened collaboration with JD. Such contribution speaks for itself.\n\nWith demonstrated strategy execution and leadership capabilities, he has won the trust and support from the team and the board. Meanwhile, I'm also thrilled to welcome Mr. Xin, Lijun to join us as the chairman of the board. Under the leadership of Jeff, Jun, and Beck, and with long-standing support from Lijun and JD.com, Dada will be in good hands.\n\nI look forward to the continued strong partnership with JD to create more compelling value for our shareholders and the society. Now let's discuss our second quarter results. We are pleased to announce another strong quarter in which Dada Group maintained record revenue growth with continuously improving operating efficiencies. During the second quarter of 2022, total net revenue increased by 55%, and adjusted net loss margin narrowed by 20 percentage points year over year.\n\nI would like to highlight some general market developments before providing more updates on the two platforms. Beck Chen will then go through our financial results in greater detail. Starting with the current industry and regulatory environment. Dada Group fully embraced employment through consumption policies.\n\nRecently, we supported consumption recovery and employment stability through participation in major government-led promotional events, such as 2022 international consumption season in Shanghai, as well as the pilot program of work-related injury insurance for riders. Meanwhile, as China aims to promote the robust development of the platform economy, Dada Group firmly supports regulatory policies. We will seize the opportunity of high-quality growth to develop our platform in fully compliance with regulations. We believe our innovative and solid business model can play a part in improving the efficiency of resource allocation and facilitating the progress of the domestic economy.\n\nOn the anti-epidemic front, we actively cooperated with local governments in Shanghai, Beijing, and other cities affected by COVID-19 during the second quarter to maintain the local supply of daily necessities. Leveraging our strength as an on-demand retail and delivery platform to fully embrace our social responsibilities. In June, we received an appreciation letter from the Shanghai Municipal Commission of Commerce. Dada Group's significant contribution to the COVID-19 fight in Shanghai was highly valued by the local government.\n\nNext, I would like to provide some updates on our deepen cooperation with JD.com. During the second quarter, the GMV of Shop Now or Xiaoshigou, the unified brands for all on-demand retail services within JD ecosystem more than tripled year over year. For search results optimization, in second quarter, we further expanded Shop Now's merchant base and product offerings to improve the availability of one-hour delivery options in each local grid. As a result, our search exposure rate in JD increased by 3 percentage points compared with the previous quarter.\n\nFor Nearby or Fujin tab, we further roll out this entry point to more cities. So far, Nearby has covered all cities nationwide in which we have launched the Shop Now service. Driven by the improvement in exposure, click-through rate and the conversion rate, the GMV from Nearby tab increased by more than 80% quarter over quarter. Now let me walk you through the operational highlights of our two platforms, JDDJ and Dada Now.\n\nBefore going into business details, I would like to highlight the results of June 18 grand promotion, a major midyear online shopping festival in China. Both JDDJ and Dada Now made breakthroughs in this year's promotion. For JDDJ, GMV on the peak day surpassed RMB 600 million. And GMV during the promotional increased by more than 70% year over year.\n\nFor Dada Now, a number of daily orders delivered exceeded RMB 10 million for two consecutive days. Now let's spend more time on JDDJ, the leading local on-demand retail platform in China. As of the end of June 2022, the number of annual active users on JDDJ increased by 42% year over year to RMB 72.8 million. Retailer empowerment, brand cooperation, and technology innovation continue to be the focus of JDDJ in the second quarter.\n\nI will elaborate on each of the three areas. Firstly, we have continued our efforts to empower retailers. Beginning with the supermarket category, we have now established partnerships with 87 out of the top 100 supermarket chains in China. In addition to onboarding more top 100 supermarket trends, we are also signing up more local original leaders.\n\nMoreover, supermarket category is gaining momentum in Shop Now, thanks to the increase in online traffic and conversion rate, as well as offline customer acquisition. GMV of supermarket merchants in Shop Now channel increased by multiple times year over year. Let's move on to the consumer electronics and home appliance category. Based on our consumer insights at a grid level, we continue to move the right product supplies online.\n\nDuring the second quarter, more than 10,000 consumer electronics and home appliance stores were newly launched on JDDJ. In the smartphone subcategory, as the largest O2O sales platform for Xiaomi product, we established an official partnership with Xiaomi brand in the second quarter. As of now, there are more than 3,000 Xiaomi home stores listed on JDDJ. GMV generated by Mi's Home, the Xiaomi Home stores increased by more than 10 times year over year in the second quarter.\n\nIn the PC and accessories subcategory, we further expanded offerings and penetrated new segments. During the quarter, we formed new partnerships with leading brands, including Canon and Aurora. In the home appliance subcategory, in collaboration with merchants, we enhanced our service capability of integrated delivery, installation, and after-sale service for large home appliance. As a result, the GMV of home appliance subcategory more than doubled on a sequential basis.\n\nIn the mom-and-baby category, we facilitated the cooperation between leading retailer chains and mom-and-baby brands such as Wase and Yili. As a result, GMV of mom-and-baby chains on JDDJ more than tripled year over year. We also work more closely with chains in the liquor category such as JD Liquor Ward, [Inaudible] and 1919 [Inaudible] with GMV of liquor stores more than doubling year over year. In the home and furniture category, we have further penetrated smart home products.\n\nFor example, in the second quarter, JDDJ has established partnerships with more than 10 smart lock chains, [Inaudible], including like [Inaudible] and brought 2,000 smart lock source online, providing users with a convenient wind stop shopping experience, integrating delivery and [Inaudible]. Secondly, we continue to push forward our cooperation with brands. During the quarter, we continued to solidify our leadership in the auto space in terms of both the number of brands we work with and the depth of engagement with the brands. Our online marketing services recorded year-over-year growth exceeding over 80% in the quarter.\n\nIn the second quarter, we further expanded our diversified brand partner base. We strike several new partnerships with food and average brands such as anti-selling and [Inaudible], as well as beverage alcohol brands such as Diageo and [Inaudible]. In addition, we signed up mom-and-baby brands such as Box and pharmaceutical brands such as Changdong. We also saw impressive results from our brand marketing campaigns.\n\nOn June 1, JDDJ teamed up with 11 mom-and-baby brands, including Wase and Huggies to launch a joint marketing campaign aimed as creating a virtual mom-and-baby shop that offers extensive products in good price and available for one-hour delivery. Total GMV of participating brands increased nearly fourfold on a year-over-year basis. On June 17, tapering with JD's June 18 grand promotion that started at 8:00 p.m., we've partnered with 23 brands, including P&G, PepsiCo, and Yihai Kerry to launch a live streaming campaign with the slogan placing orders at 8:00 p.m. and get delivered to your door spot by 9:00 p.m.\n\nOn the day of the live streaming campaign, total GMV of these brands increased by more than three times year over year. Thirdly, we also continued our efforts to empower retailers and brands with innovative technologies. At the end of June, Haibo System, our omnichannel to operating system for retailers has been deployed by more than 200 merchants in around 7,700 retailer stores. In addition, Haibo has successfully penetrated new categories, including like pet stores and the mom-and-baby stores, while serving more supermarkets and convenience stores.\n\nWe continue rolling out new Haibo features to address what merchants need most and help them wherever they see challenges. One example is that we launched a new module, enabling merchants to directly connect to JD's warehouse system through Haibo, once they source supplies from JD. This helps retailers' procurement staff save significant labor hours. As a result, merchants adopting this module saw their procurement efficiency improved by three times.\n\nOur Earth Grid System, or Kunce, which helps brands boost sales by providing them with by grid or by store self data has been welcomed by a growing number of brands. In addition, as Shop Now becomes an increasingly important channel for brand sales growth, we upgraded Kunce's SKU analysis feature to help brands simultaneously monitor the availability of their goods at both JDDJ and Shop Now so that brands can improving the product supply and sales. Our digitized in-store picking service, Dada Picking also made significant progress. Since the establishment of our partnership with Carrefour, we have helped them improve picking fulfillment rate, customer experience and cost efficiency.\n\nFor example, customer compliance rates related with Picking was lower by half three months after stores started utilizing Dada Picking. As a result of the impressive results, we have continued to deepen our collaboration with Carrefour. Now Data Picking covers all of the chain, the O2O stores. Driven by expanded store coverage and increased penetration of Dada Picking in partnering stores, the total number of orders fulfilled by Dada Picking in the second quarter increased bymore than three times year over year.\n\nNow let's move to Dada Now, the leading local on-demand delivery platform in China. While total revenue maintained rapid growth, Dada Now's operating efficiency also improved significantly as we optimize pricing strategy and the merchant portfolio. I will start with our KA or chain merchants' business. Revenue of our on-demand delivery services to KA merchants increased by 45% year on year, while average gross profit per order turned positive.\n\nOur ability to provide integrated fulfillment services consisting of warehousing management picking and delivery, it serves unique advantages. Therefore, we continue to consolidate our leading position in the supermarket KA category. In the second quarter, revenue generated from supermarket KAs increased by over 50% year over year. In addition, we signed up new supermarket chains like Walmart.\n\nIn the restaurant and beverage KA category, revenue generated from beverage KAs maintained rapid growth more than doubling year over year. Moving on to our SME and C2C business. Others for fuel increased by over 30% year over year, while we continue to optimize unit economies significantly year over year. Thanks to our further penetration into lower-tier cities.\n\nOrders fulfilled for SME merchants increased by more than 40% year over year. Lastly, on last mile services. For last-mile delivery, we continue to leverage our flexible cross-sourcing network to ensure the fulfillment of JD Logistics others, especially amid the pandemic and during peak promotional campaigns. For pickup service, orders maintained strong growth momentum, mainly driven by our further penetration into virus picking scenarios.\n\nAnd to wrap up, I would like to say a few words on ESG. As sustainable development plays an increasingly important role in China's economic strategy, we are committed to creating value, integrating social responsibility with corporate strategy, empowering our partners caring for our employees' development and the satisfying consumer needs, so that we can achieve without that bring benefits to the company, our shareholders and the society at large. At the end of June, we released our first ESG report, providing stakeholders with a comprehensive overview of our efforts and progress on ESG issues. Going forward, we will continue to integrate ESG initiatives into our long-term development strategy and actively shoulder our corporate social responsibilities.\n\nWith that, I will now pass the call over to Beck Chen to go over our financials for the quarter. Thank you.\n\nBeck Chen -- Chief Financial Officerg\n\nThanks, Philip. Before we go over the numbers, just a few housekeeping items in advance. We believe year-over-year comparisons are the most useful way to judge our performance. Therefore, our percentage changes I'm going to give will be on that basis.\n\nAnd all figures are in renminbi unless otherwise noted. Total net revenues in the second quarter increased by 55% to 2.3 billion. Net revenue from Dada Now increased by 37% to 816 million, mainly driven by the increases in order volume of intracity delivery services to chain merchants. Net revenues from JDDJ increased by 66% to 1.5 billion, mainly due to the increase in GMV, which was driven by increases in the number of active consumers and average order size.\n\nThe increase in online marketing services revenue as a result of the increasing promotional activities also contributed to the revenue growth of JDDJ. Moving over to the expense side. Operations and support expense costs were 1.4 billion. The increase was primarily due to an increase in rider costs as a result of increasing order volume for intracity delivery services provided to various chain merchants on the Dada Now platform and the retailers on the JDDJ platform.\n\nSelling and marketing expenses were 1.2 billion. The increase was primarily due to the growing absolute dollar amount of incentives to JDDJ consumers, an increase in advertising and marketing expenses to attract new consumers to JDDJ platform and the amortization of the Business Cooperation Agreement arising from share, subscription, transaction with JD.com in February this year. The G&A expenses were 100 million, flat year over year as a result of our expense control measures. R&D expenses rose to 160 million, mainly attributable to the increase in research and development personnel cost as the company continues to strengthen its technology capabilities.\n\nNon-GAAP net loss attributable to ordinary shareholders of Dada was 396 million. Non-GAAP net loss margin was 17%, improving by more than 20 percentage points year over year and 6 percentage points quarter over quarter. In addition, JDDJ's direct margin turned positive during the quarter, making a remarkable milestone in our path to profitability. As of June 30, 2022, the company had 4.35 billion in cash, cash equivalents, restricted cash, and short-term investments, that went to our $70 million share repurchase authorization announced in March 2022.\n\nAs of June 30, 2022, we had repurchased approximately $33 million of ADS and this purchase program. In terms of our outlook for the third quarter of 2022, we expect the total net revenue to be between 2.35 billion and 2.45 billion, representing a year-over-year growth rate of 39% to 45%. In addition, we expect the net loss margin in the third quarter of 2022 to continue to significantly narrow year over year and achieve sequential improvement for thesixth consecutive quarter. This concludes our prepared remarks.\n\nAnd operator, we are now ready to begin the Q&A session. Thank you.\n\nOperator\n\nThank you. [Operator instructions] We will wait for a moment while the question queue assembles. Our first question is from the line of Ronald Keung from Goldman Sachs. Please go ahead.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nThank you. Thank you, Philip, Beck and Caroline. So, I have two questions. First is how should we think about these executive and board changes? Would there be a future CEO role as I think you've now filled the president and chairman roles, respectively, and also see an increase in independent directors? So, is that part of a kind of board change to align with some of the Hong Kong Stock Exchange guidelines? And any comments on eventual listing or dual primary listing in Hong Kong? And my second question is on the encouraging 18 percentage points improvement in net margins if you flagged that back.\n\nSo where have user subsidy rates trended so far? And are we continuing to expect the direct margin breakeven this year and EBIT turnaround by next year?\n\nBeck Chen -- Chief Financial Officerg\n\nOK. So, thank you for the question, Ronald. For the first question, yes, so we have actually net added one independent director. And now actually three out of six directors are independent, which is fully compliant with the potential Hong Kong listing rule.\n\nAnd also right now, four out of six board of directors are female directors, which is -- which are very diversified and they all have very solid international background, and we hope that all those directors will contribute to the growth of the company in the future. Also, we will be proactively pushed forward the Hong Kong listing procedures to protect our shareholders' interests. And also, you want to thank for the contribution of Philip to the company for the past eight years. So, after internal discussion, we are not positioning a CEO role and actually president, Jeff will be executing and be responsible and in charge of the daily operation and report to the board in the future.\n\nAnd about the second question, yes. So actually, our overall subsidies ratio is actually decreased by 20 bps compared to the first quarter. So, in Q2, actually, our consumer incentives decreased to 4.5% as a percentage of JDDJ's GMV. And in the third quarter, we expect the incentive ratios will be decreased more, and they will all be contributing to our direct margin level.\n\nAnd for the whole year, we maintained the forecast that the direct margin will be turning positive. And the company will be turning positive profit in the first half of next year.\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nThank you, Beck, and thanks, Philip.\n\nPhilip Kuai -- Chairman and Chief Executive Officer\n\nThank you, Ronald.\n\nOperator\n\nThank you. Our next question comes from the line of Thomas Chong from Jefferies. Please go ahead.\n\nThomas Chong -- Jefferies -- Analyst\n\nHi, good morning. Thanks, management, for taking my questions. My first question is about the competitive landscape. As we are seeing an increase in loan book entrants entering into the space these days.\n\nFor example, like a short-form video and different payers also launched Xiaoshigou services. How should we think about the competitive advantage of JDDJ? And my second question is about, after the board change how should we think about our cooperation with JD going forward? Should we see accelerating synergies with JD? Thank you.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nOK. So, this is Jeff. So, the first and for most, our positioning as a pure play marketplace and our enabling digitization capacity has enabled us to work more extensively with those -- all those leading merchants and brands. So, which makes us more competitive in the variety, quality, and prices of product supplies.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nYeah. So, as we always tell our partners as a pure marketplace, we never compete with our retail partners. So, we are not engaging in retaining ourselves. So that's why those retailers are more willing to work with us.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nSo even though our competitors are fit to this more, but the impact to our profit -- to assets very limited and our as I said, so our incentive ratios decreased sequentially. So the rationale behind is that the services only drive up the demand, but it needs to be continuously field with high-quality supplies. So partnering with those leading retailers gave us a clear edge on the supply chain front over our peers and so for the long term.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nOK. So, we also enable our retail partners with our capabilities in digitalization. So for example, take Haibo System as an example. So we continue rolling out our new Haibo features to address what merchants need most and help them reduce costs while enhancing the operating efficiencies.\n\nSo as of June 30, it has been deployed in around 7,700 retail chain stores. And another example is our integrated fulfillment solutions consisting of warehousing management picking and delivery. So there is a key difference between the on-demand retail and the food delivery. So this is the picking and the packing in the retail stores.\n\nSo our integrated fulfillment solutions enable retailers to reduce the order picking time while our Dada Picking service helps them mitigate labor shortage through its innovative digitized crowd-sourcing model, which are more and highly valued by our retail partners. And lastly, our Kunce or the Earth Grid System helps brands boost sales by optimizing channel supply down to each like the grade of the area.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nAnd we are also proactively to expand across different categories. So -- and our capabilities in the system and digitization can easily help us to expand from the most complicated supermarket categories to other categories like 3D categories, appliance categories, as we have said before. So this is also clearly the capability of our platform compared to our peer company.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nAnd also, the brand partnership, so apart from the top retailers, we have extensive partnerships with the brands. I think the retail chains on our platform are critical off-line distribution channels to many consumer product brands, we can offer our brand partners integrated marketing service across both online and offline channels and also, as well as digitization tools. So through our collaboration, brands are not only able to generate more sales, but also improve their consumer insights and channel insights. And we can also leverage JD's results to bring more brands onboard and in particular, like the brands in consumer electronics, where JD enjoys strong consumer mind share.\n\nSo -- and our peer is actually lagging us in terms of both number of brands and the depth of the engagement with the brands.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nYes, let's talk about the collaboration with JD. So we continue to deepen our cooperation with JD.com. And during the quarter -- the second quarter of this year, GMV of Shop Now should go more than tripled year over year.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nIn the second quarter, we further expanded Shop Now's merchant base and the product offerings to improve the availability on our delivery options in each local grid. So as a result, our search exposure rate increased by 3 percentage points quarter over quarter.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nSo for Nearby or Fujin tab, we further rolled out these entry points to more cities so far and the Nearby tab has covered all cities nationwide in which we have launched the Shop Now services. and driven by the improvement in exposure, click-through rate, and conversion rate, the GMV from Nearby tab increased by more than 80% quarter over quarter and contributed 10% of Shop Now's GMV.\n\nThomas Chong -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Eddie Leung from Bank of America Merrill Lynch. Please go ahead.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, guys. I have two quick questions. The first one is about consumer behavior. Could you give us an update on your observations of what consumer -- what consumers are doing in the recent months after the opening of Shanghai and mid-inflation, for example, any change in their presence for product categories? And then secondly, could you also remind us of the AOV of JDDJ? I think you mentioned that you have seen AOV continuously going up constantly.\n\nBeck Chen -- Chief Financial Officerg\n\nOK. So Eddie, let me answer the second question first, and I will pass the first to Philip to answer. So the average order value of our JDDJ in the Xiaoshigou platform in Q2 was RMB 225, which is increased by RMB 10 compared to first quarter. And in the long term, we think we will continue to drive up the average order value as we said.\n\nSo we will have more diversified various new categories, products and they are all with higher AOV and contribute positive direct margin to the platform, which will also not only help us to increase the diversity of our products to be offered to the consumers and also contribute to our profit improvement.\n\nPhilip Kuai -- Chairman and Chief Executive Officer\n\nAnd Eddie, I'll give you some update on both the supply side and demand side from short-term and long-term perspectives, our observation. So in short term, we are seeing from the supply side -- sorry, from the supply side, we are working with the key merchants chains with the strong supply chain capabilities, and they're much more resilient to the turbulence. So, therefore, under this challenging environment, the retailers are -- the retailer we have been working with are much stronger to deal with the challenge. At the same time, most of the retailers are facing difficulties to get offline customers in stores.\n\nThat's why they really need to expand O2O business. That's why our partnership with the retailers has been further improved over the last couple of quarters. So that's from the supply side. And from the demand side, we are seeing that people in July, after Shanghai reopened, and the COVID continued to happen in different cities across July and August, it absolutely brings some uncertainties, and we're seeing the confidence of the consumers and their willingness to pay still have some way to recover, and it does have someimpact on our business as well.\n\nSo I think going forward, we're confident and we believe that the demand side will pick up over time while our supply side remained very strong. And for the long term, I think the on-demand retail penetration as a percentage of the local retail is still very low at the single digits. That's why the room for long-term growth is just tremendous. And most of the retailers and the brands believe that O2O is the future, the absolutely No.\n\n1 growth area for the foreseeable future. So we are very much confident.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nThank you, Philip and Beck.\n\nPhilip Kuai -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Alicia Yap from Citigroup. Please go ahead.\n\nAlicia Yap -- Citi -- Analyst\n\nHi. Thank you. Good morning, management. Thanks for taking questions and congrats on the solid results.\n\nI have a follow-up on the competitive landscape for JDDJ. So I think we're also seeing more players, actually more aggressively penetrate to non-supermarket categories that reach JD and Dada actually used to enjoy the synergies and the advantage. So can management comment if you expect the landscape, especially for the non-supermarket category to get more intensified? If so, how would that affect the take rate or even the margins and the volume growth in the coming future? And then a follow-up on that is, what do we expect for the direct margin target for JDDJ in the next -- I mean, in the medium term, which is in two to three years? Thank you.\n\nPhilip Kuai -- Chairman and Chief Executive Officer\n\nHi, Alicia. I'll give you some of my thoughts and see if Jeff and Beck had anything to add. So we are seeing more players coming on board in the non-supermarket category. But more assay followers, as we have been quite successful in expanding in the non-supermarket category, so they're following us without too much of the development.\n\nSo if you break down the so-called non-supermarket category, you will see that the category we're talking about mainly covers like consumer electronics, the mom and baby, parenting, liquors or home appliance. So all those categories had very different consumer mindset comparing to restaurant, food delivery. So this is totally different. It's very remote -- remotely linked for any consumers to think of like buying a smartphone or buying a home appliance from a restaurant food delivery platform.\n\nSo I think that's the key. And for JD, we are very happy, and we're -- I think we're very lucky to deeply collaborate with JD that the consumers come number on JD, they have the strong mindset to buy those category products on JD and with the development of our Shop Now business so we can easily leverage the traffic and the consumer mindset on those categories. I think those are the advantages we enjoy that all of the other players -- it's very difficult for them to build the similar mind share any time soon.\n\nBeck Chen -- Chief Financial Officerg\n\nAnd also, about the take rate and also about the direct margin. So all those new categories, actually, we are -- if we subsidy, we are we were subsiding -- subsidizing much less compared to the supermarket categories, so which means that they all generate positive direct margin to the company. So we are welcoming all those new categories on board. And about the trend of our company's direct -- JDDJ's margin level, we -- and actually, in Q2, our direct margin turned positive to 0.4%.\n\nSo we are expecting the direct margin level to be further increased increasing to 1% or more than 1% in the second half of this year, and we believe it will be keeping to increasing 2023, which is very -- which is very key and essential to the country's overall profit breakeven.\n\nAlicia Yap -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Andre Chang from J.P. Morgan. Please go ahead.\n\nAndre Chang -- JPMorgan Chase and Company -- Analyst\n\nThank you, management for taking my question. I have a follow-up question regarding our cooperation with JD. So now with this infrastructure laid out, right, Shop Now and Nearby tab, the ad load, etc. So I wonder how we will try further growth driven by our corporation JD.\n\nFor example, will there be more ad load? Or like there will be more exposure or ads from different categories beyond electronics, FMCG, etc.? Or we are going to promote more to get more visibility for consumers within JD ecosystem, etc.? So any color for the drivers in the second half and in next year to increase our traffic contribution from JD will be helpful. Thank you.\n\nPhilip Kuai -- Chairman and Chief Executive Officer\n\nHi, Andre. I'll also give you some of my perspectives and see if the rest of the team has anything more to add. So in terms of the driver for growth on JD, I think there are a few key things you're looking at. Number one is the penetration of the user base.\n\nSo we have -- we are fully aligned with JD to increase the penetration of consumer on JD.com. So now the penetration is still at the single digits, while quickly growing. And we are aiming at 50% penetration in the long term. So I think this is the No.\n\n1 driver in short term and in long term. And there are a few things to help us to improve the penetration. For example, like the exposure. So we're getting more and more space if you will, on JD.com.\n\nAnd you're able to see us more and more often everywhere. At the same time, we are expanding geographically and also bringing more and more supply from various categories. So, therefore, when people are searching or browsing products from various categories, now they can see more and more offer because before we don't even have the supply of the products in kind of that new categories. Now as we expand and bring more stores and suppliers on board, the customers are able to see them on JD.com.\n\nSo, all of those help us to improve the exposure and the penetration. In terms of promotion, I don't think it will be a heavy promotion-driven expansion at all. And other than that, we actually can fully leverage all the existing successful promotion on JD already like the June 18 or W11 and so on and so forth. So, JD has a lot of successful promotion and now we can ride together with them.\n\nSo, I think those are the strategies we are looking at.\n\nJeff He -- President\n\n[Foreign language]\n\nUnknown speaker\n\nOK. So I'll further elaborate on the exposure opportunities. So for example, if you -- if a consumer is searching the fresh produce products in the search tab, there will be more exposure to the Shop Now choices. So for the next step, we will dispose -- we will spend to more category products, for example, those heavier products or big bulk products in the supermarkets.\n\nAnd also, we will further increase exposures in different channels like the second picking channels. And also, when the consumers placing the orders. So when they finish and complete orders, there will be a recommendation for them for the Nearby stores. And this is all in the testing procedures.\n\nAnd so we are very confident that we -- as Shop Now and JDDJ will be acquiring more traffic in consumer minds within the JD ecosystem. Thank you, Andre.\n\nOperator\n\nThank you. Our next question comes from the line of Wei Xiong from UBS. Please go ahead.\n\nWei Xiong -- UBS -- Analyst\n\nHi. Thank you, management, for taking my question. My question is around -- I want to follow up on the supply side advantage that you guys mentioned just now. I wonder how do we see the churn rate of merchants, especially on the SME side after the very challenging second quarter? Will that affect our product supply for certain long-tail categories? I understand this may not be an issue with our partnership with the leading supermarket chains, but I do believe we do have a large number of smaller merchants on the platform.\n\nSo just want to hear your thoughts on this. Thank you.\n\nPhilip Kuai -- Chairman and Chief Executive Officer\n\nSure. So for our supply side, so our strategy is to firstly work with the key chains, not only supermarket chains, but also other vertical specialty store chains like consumer electronics, mom and baby, liquor, and so on. So all those KA chains retailers are much more resilient. And all of them are still there, and the business are relatively well.\n\nSo we're not seeing any substantial impact from the supply side. And on the other hand, we're actually happily seeing that almost all of our retailer partners have strengthened the partnership with us because they're seeing more challenges and looking for our help. So I think the partnership between the -- with our retailer has actually got improved, and we are very much confident that we will be able to go in through all the turbulence in any like circumstances.\n\nOperator\n\nThank you. There are no further questions at this time. I will now hand back the conference to Ms. Caroline Dong for closing remarks.\n\nCaroline Dong -- Head of Investor Relations\n\nThank you, operator. In closing, on behalf of Dada's management team, we'd like to thank you for your participation in today's call. If you require any further information, feel free to reach out to us directly. Thank you for joining us today.\n\nThis concludes the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCaroline Dong -- Head of Investor Relations\n\nPhilip Kuai -- Chairman and Chief Executive Officer\n\nBeck Chen -- Chief Financial Officerg\n\nRonald Keung -- Goldman Sachs -- Analyst\n\nThomas Chong -- Jefferies -- Analyst\n\nJeff He -- President\n\nUnknown speaker\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nAlicia Yap -- Citi -- Analyst\n\nAndre Chang -- JPMorgan Chase and Company -- Analyst\n\nWei Xiong -- UBS -- Analyst\n\nMore DADA analysis\n\nAll earnings call transcripts"
}