{
  "companyName": "DoorDash, Inc.",
  "companyTicker": "DASH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/doordash-inc-dash-q3-2022-earnings-call-transcript/",
  "content": "DoorDash, Inc. (DASH -1.53%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by. My name is Heather, and I will be your conference operator today. At this time, I would like to welcome everyone to the Q3 2022 DASH earnings conference call. [Operator instructions] Thank you.\n\nAndy Hargreaves, you may begin your conference.\n\nAndy Hargreaves -- Vice President of Finance and Investor Relations\n\nThanks, Heather. Good afternoon, everyone, and thanks for joining us for our third quarter 2022 earnings call. I'm pleased to be joined today by Cofounder, Chair, and CEO Tony Xu; and CFO Prabir Adarkar. We'll be making forward-looking statements during today's call, including our expectations of our business, the macroeconomic environment, financial position and operating performance, our market and local commerce opportunities, future financial results and guidance, our strategies, and our investment approach.\n\nForward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those described and some such risks are described in our risk factors included in our SEC filings, including our 10-Ks and 10-Qs. You should not rely on our forward-looking statements as predictions of future events. We disclaim any obligation to update any forward-looking statements, except as required by law. During this call, we will discuss certain non-GAAP financial measures Information regarding our non-GAAP financial results, including a reconciliation of such non-GAAP results to the most directly comparable GAAP financial measures, may be found in our letter to shareholders, which is available on our investor relations website.\n\nThese non-GAAP measures should be considered in addition to our GAAP results and are not intended to be a substitute for our GAAP results. Finally, this call in its entirety is being audio webcast on our investor relations website. An audio replay of this call will be available on our website shortly after the call ends. As in previous quarters, we'll go straight to questions.\n\nSo with that, Heather, please open the line to the first question.\n\nOperator\n\n[Operator instructions] OK. And your first question comes from the line of Ross Sandler with Barclays.\n\nRoss Sandler -- Barclays -- Analyst\n\nHey, guys. Congrats on the quarter. Maybe just starting with macro, any color on what you're seeing across either the U.S. or international markets thus far in where are trends holding up pretty well versus possibly slowing down a bit? And then the second question is -- thanks for the chart on contribution margin for the U.S.\n\nrestaurant. That's very helpful. In the letter, you mentioned that the last few quarters, you've been above that 7% level. So could you just talk about what are the biggest drivers of that? Is that higher percent of repeats and getting some marketing efficiency out of that? Or is that driver efficiencies? Any color on what's taking that north of 7%? And are there markets that are in the double digits? Or is there like a natural limit to how high that could get? Thanks a lot.\n\nTony Xu -- Co-Founder, Chairman, and Chief Executive Officer\n\nHey, Ross. It's Tony. I'll start with the first one and answer briefly the second and hand it off to Prabir. On the first question, obviously, we've seen tremendous resilience in the business.\n\nIn the U.S. business, you've seen continued growth north of 25% GOV, on the marketplace revenues north of 30% growth each -- for each of the last five quarters now. And on the flip side, this is in the face of an energy crisis, pretty sticky inflation, and a war in Europe, and so it's sometimes hard to try to square the two. But I think the way that we've been thinking about things is really looking at it from a historical current day and future perspective.\n\nHistorically, in the last 60 years in that time frame. Only two of the last 60 years have we seen a decline in food spend in the U.S., and that's specifically in the restaurant and grocery industries. And so I think even though all of us are wondering how to quantify the macro headwinds. Food is the most resilient category.\n\nI think, historically, that's shown to be true. Current day, what we see in our own business is something largely the same. We also disclosed in the results that we saw our monthly active consumers grow, all-time highs in our DashPass membership program. And so what you're seeing is order rates of those who joined after the pandemic have largely resembled those who joined during the pandemic.\n\nCertainly, you see some softness and impact on the non-DashPass cohorts on a relative basis. But by and large, we're talking about extraordinarily similar types of ordering behavior. So that's what we see kind of currently. So on a go-forward basis, when I kind of square everything, I mean, even as the market leader, sometimes it's hard to remember, but we're still less than 10% of the U.S.\n\nrestaurant industry sales. When you look overseas, we're a much lower percentage than that. And so when I square, I think, the fundamentals, both in terms of the leading industry retention and order frequency in the U.S. business, the industry-leading retention order frequency in the European business, particularly with Volt, who grew at 60% on a euro basis, significantly faster than its peers, and then I square that strong fundamentals with the future potential and runway in these categories, I think that's why you're seeing the resilience as well as what was reflected in our guidance.\n\nOn the second question, I think one of the things that -- and I'll let Prabir kind of talk about some of the details and specifics with respect to the contribution margin disclosure. But I think when I take a step back of what has happened in the last two-and-a-half years, obviously, there was a pandemic. There were a lot of changes in the macro climate as we've seen, particularly '22 versus '21. We've seen regulatory pressures with the likes of Prop 22.\n\nAnd in spite of, I think, all of those ups, downs, sideways with some turns, our business has grown fourfold the U.S. marketplace business. We've gained an extra 14 points of category share even as the market leader heading into the pandemic, and we've kind of extended that lead. And so I think I'm really proud of the team for being able to operate in such volatility.\n\nAnd so how did that happen? Well, I wish there was a silver bullet, but there really isn't. This is a business where you really have to be in the details. Every line item counts, every line item matters, every line item compounds, their interaction affects, and dynamics in between the line items. And it's really measuring and managing all of these inches that, I think, has given us the compound interest and advantage that you've seen now accrue over the last two-and-a-half years.\n\nPrabir Adarkar -- Chief Financial Officer\n\nRoss, it's Prabir. Just to add on to Tony's point. Look, in comparison to other areas of e-commerce, frankly, other consumer tech companies who have been fairly resilient, and I think that's a function of a couple of things, it's the stickiness of the category we operate in, as well as the best-in-class retention with our product. Logically, there is some impact from macro, but that impact seems to be much more limited to less habituated, more occasional customers.\n\nDashPass, on the other hand, is higher retentions we've talked about in the past, and the user behavior for DashPass continues to remain strong. And so all that to say that when you look at our consumer metrics in Q3, as well as now in October, consumer metrics continue to remain strong. Tony pointed to our monthly active users that have grown both year on year and quarter on quarter. Order frequency has grown year on year.\n\nPace of customer acquisition continues to remain strong. And all of that basically establishes a foundation for solid growth, not just in Q4, but into 2023, and that's what we're really seeing in the results. So that's the color that of macro. On your question on the contribution margin, I think your specific question was why our 2022 incremental is higher than the average of 7%.\n\n2021 was impacted by higher DashPass costs due to a more expensive labor market. Today, the labor market has normalized. But in addition, we've actually made certain product improvements that have enhanced the retention of our existing fleet of Dasher and also an incremental supply hours from each Dasher. And a combination of these two things has actually led to a benefit in terms of Dasher all-in cost that includes cost per order, as well as Dasher acquisition costs.\n\nAnd so this benefit in Dasher costs in 2022 has led to higher incrementals this year compared to the general average. Those product improvements will continue benefiting our cost structure. And so you see the impact of that, by the way, in our Q4 EBITDA guidance. And then on your question about other markets above 7% and so on and so forth, I just wanted to remind everyone on what we've said historically, which was we don't operate our business to a target margin, but rather we aim to maximize total profit dollars.\n\nAnd the objective we have in providing the incremental percentages, as well as the progression and contribution profit through all -- through COVID, through COVID reopening, through Prop 22, through inflation and all these factors was really to provide proof points on our execution and to provide visibility into our margin trajectory going forward. And so practically, what that means is we will flex margins that increases total profit dollars.\n\nOperator\n\nYour next question comes from the line of Bernie McTernan. Your line is now open.\n\nBernie McTernan -- Needham and Company\n\nGreat. Thank you for taking the question. On the non-restaurant piece and the drag on profitability, can you rank order, maybe put some percentages around the largest drags on total company profitability, whether it's grocery convenience or international? And then just thinking through maybe what needs to happen to unlock those to be profitable, whether it's scale or technology advancements.\n\nTony Xu -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. Maybe I can start. It's Tony, and then I'll hand it to Prabir on, I think, some of the numbers. I think it starts -- it's important to understand why we're investing in some of these categories.\n\nI mean, the goal of DoorDash was always to build the largest local commerce marketplace and the largest local commerce platform in an effort to make sure that every physical business can be successful as they move into the digital economy. And our investments into both our non-restaurants category, as well as our non-U.S. operations, I think, are really bearing fruit. If you looked at what has transpired in the last couple of years, we effectively have grown a business that was largely 0 in the non-restaurants category into several businesses of billions of dollars of GOV run rate with improving margin economics.\n\nAnd the third-party convenience business is a category leader as well as a variable profit breakeven. As one example, for instance, the earliest business that we started outside the restaurants category. Today, we have over 75,000 partners outside of restaurants, which is more than any other platform in North America, again, from almost a standing start a couple of years ago. And so the way we think about investing again is similar to what Prabir said to the last question around maximizing total long-term cash flow.\n\nAnd as we see projects, we invest according to what stage they're at. And so as long as we're seeing product market fit signals, we'll continue to invest. And if we don't, we'll pull back.\n\nPrabir Adarkar -- Chief Financial Officer\n\nAnd just to add to Tony's comments, Bernie, let me share a couple of data points that give us excitement and conviction around these investments. The first point, which we've made in the past is these markets that were attempting to expand into, whether the new categories or international, these are large trillion-dollar market and even a few points of penetration in these large markets could add massive scale to our business. Second, we're seeing very strong signs of progress. And in some cases, we've been operating in these areas for less than a couple of years.\n\nOur new verticals, our convenience and grocery business is growing over 80% year on year. Our U.S. third-party grocery business is growing over 100% year on year, and that's significantly faster than other companies that operate in this space. Our international business is growing over 50% year on year on a constant-currency basis, and you compare that to other European food delivery players that are showing single-digit year-on-year growth rate.\n\nAnd so our performance is a function of the fact that we've built a product that people like and keep coming back to, i.e., better retention and growing order frequency. And so we like what we see in terms of product market fit. This is exactly the thesis that we had laid out when we made these investments, a little investments in both or investments in our new categories, and they're playing out just as we had originally talked they would. Now in terms of profitability, we wouldn't do any of these things, unless we believe there was a path to attractive unit economics.\n\nAnd as Tony alluded earlier, we measure these things regularly to ensure that the steady progress is being made toward steady-state economics. We're beginning to see early proof points, some of which we cited in the letter. And third-party convenience, we expect to get to a variable profit breakeven by the end of this year. We had committed to this earlier on in the year, and we're on track to deliver on that commitment.\n\nAnd our third-party grocery business will continue to improve margins. Q3 margins are better than Q2. And so these are exciting proof points along the way. And if you look at what we have done in the U.S.\n\nrestaurant business, which we've laid out in great detail in the shareholder letter, it's about repeating those playbooks in these other areas. It's not -- there's no single silver bullet. It's the exact same factors around improving the efficiency of deliveries, optimizing defect rates that ultimately will help these areas get to profitability just like the U.S. business did.\n\nAnd so we have a long way to go, but we continue to improve products. We continue to get more efficient. We believe we can drive outsized growth, along with margin improvement.\n\nBernie McTernan -- Needham and Company\n\nGreat. Thank you, and thanks for all the data in the release. It's really helpful.\n\nOperator\n\nYour next question comes from the line of Deepak Mathivanan, and your line is now open.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGreat. Thanks for taking the question. Tony, a question on investing for the long term. Your philosophy is very clear, and it makes a lot of sense.\n\nBut interest rates have gone up a lot in the last like three to six months. Clearly, that's made the cost of capital for many businesses higher. But as you kind of think about internally for prioritizing projects for higher ROIs or maybe faster payback periods kind of for this new capital environment, how are you sort of approaching this in the context of your investing philosophy? And then second question, maybe for Prabir. The disclosure on U.S.\n\nrestaurant contribution margin is very helpful. But maybe given that it's one of your oldest business, how should we think about the growth of it right now? There's a lot of concern that core U.S. restaurant marketplace is maturing. Maybe you can help address that at least qualitatively, that would be great.\n\nThank you so much.\n\nTony Xu -- Co-Founder, Chairman, and Chief Executive Officer\n\nSure. Hey, Deepak, I'll take the first one. With respect to investing, frankly, in any environment, whether we're talking about a low-interest rate environment or a high-interest environment, we're obviously taking that as one input into how we make investments. But the primary input there's always going to be, are we investing appropriate to the stage of the project? I think it's just as easy to overinvest when \"times\" are good even though you're not seeing the signal that you want to see.\n\nAnd we've been very disciplined about that, whether it's been our entry into other countries or our foray into other categories beyond the restaurant category, our build-out of the advertising business. And then on the flip side, I think sometimes you can not take enough risk, especially when you have a strong, robust, resilient business that gives you the cash flows to invest in some of these other categories. So from where I sit, certainly, we're taking that into account in terms of the cost of capital and making sure that we're operating with discipline, making sure that as we've grown tremendously the company over the last couple of years that we're as efficient as we were heading into the last couple of years. And that takes a lot of discipline, but it also takes a lot of intentional focus to make sure that we're not just investing in people, but we're investing in the systems to allow us to see operating leverage into the future.\n\nAnd so those are the things that we're doing to make sure that we're investing with discipline. But I would still say the primary input, especially as we look into some of these investments into newer areas, whether it's overseas or into other categories or into new business areas, it's really, are we investing appropriate to the stage of the project?\n\nPrabir Adarkar -- Chief Financial Officer\n\nAnd just add one more comment to that, Deepak, which is I'll go back to my comment about the size of these markets, right? These are large trillion-dollar markets, where money can be made. And given a small amount of penetration in these markets, there's a lot of GMV that can convert our free cash flow. And so if you just pencil out the math in the scale of these opportunities and our success with execution historically, the ROI math will work. So to be honest, it what makes the math work is essentially the scale of these opportunities combined with our execution.\n\nOn your question, regarding sort of the U.S. business and growth. I'll point you to a couple of things, which is it's easy to get stuck in the quarter-to-quarter sort of dynamic, and you've got third-party data providers that sometimes provide data with very little basis. But what I will say is the following, which is our level of penetration even in the U.S.\n\nremains small, whether it's a percentage of overall restaurant sales or a percentage of the population that are actually using DoorDash were a small portion of the overall opportunity, and we continue to grow. MAUs have continued to grow, which is a good sign. Even despite the fact that you've had restaurants reopening, cities reopening, people going back into the store, despite that and through that, our business has continued to grow. Whereas in other areas of e-commerce, we've actually seen the growth expectations been taken down.\n\nAnd what that points to is the fact that this is an enduring category. People eat. People eat regardless of what's happening to inflationary pressures and other things. They may modulate their behavior and adjust from which restaurants they're eating at or the number of items in their basket and so on, but they still eat.\n\nAnd you're seeing the resilience of that habit in our numbers. And so the opportunity as we look forward in order to continue increasing the size of the scale of the business is for us to make progress on the fundamentals, which is selection, quality, and affordability. We talked about new categories. Part of the reason we're bringing on new categories is because it's a new use case for those people that perhaps don't want to use DoorDash for restaurants, they can now use it to get the flowers or get their convenience items or get their grocery items or get their liquor delivery.\n\nAnd so a growing number of our new customers now are actually coming to DoorDash to try these new categories, and this is going to unlock the next leg of growth as we continue increasing our penetration of the U.S. population. So hopefully, that provides some perspective on how I think about growth on a go-forward basis.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nVery helpful. Thank you so much.\n\nOperator\n\nYour next question comes from the line of Eric Sheridan. Your line is open.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for taking the question. Maybe two, if I can. First, maybe taking a step back in a bigger-picture question. I understood the changed consumer behavior you're seeing and the long runway on penetration.\n\nWhat impact has lower competitive intensity played in the industry over the last six to eight months? And how do you think that potentially informs elements of some of the more mature markets seeing only two or three players in some instances going after some of the market opportunities where it was just a couple of quarters ago that there was a lot of private capital in the sector looking at all different aspects of delivery and some of that has been more rationalized over the last couple of quarters? That would be number one. And then in markets where you're more of a challenger brand than a market leader as a result of some of the markets you acquired through the Wolt acquisition. Can you help us better understand how you see moving the needle from where your market share position is today to more of a market-leading position in the next couple of years? What are some of the levers you most focused on executing against? Thanks.\n\nTony Xu -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah. Maybe I can start, Eric, and I'll let Prabir chime in here. I think the answer to both of those questions to that it's a very competitive industry out there. And I'm not sure that there's ever been a \"letdown\" in terms of competitive intensity.\n\nAnd that's because, at least from where I sit, I believe the highest form of competition is always growing, and that's really consumer expectations. I think to me, whether we are the market leader or where we are not yet the market leader, it's really about an investment in product quality. Consumers are always going to expect more selection of stores they can order from, greater affordability, better quality of service and superior customer support. And to me, that really at the end of the day is what's going to rate limit our ability to penetrate the large runways that both Prabir and I have discussed, whether it's the restaurant industry, the grocery industry, the retail categories.\n\nAnd that's really what we see. But I wouldn't say that there's been lower competitive intensity in one form or another. I still think that the biggest challenge is making sure that we can get consumers to actually try the product. I also would say that with respect to maybe the premise in the second question, I think there's a common miss out there that Wolt is not a market leader in the majority of its markets when it actually is.\n\nAnd so I do think that some of this might just be where there's some unreliable third-party reporting. But what I would say is both the instruction I give to our U.S. teams or our teams overseas, it's making sure that we continue making sure to invest in the product quality so that we see gains in our retention and order frequency, which only leads us to compound that advantage over time, whether that's as the market leader or whether that's someone just entering the market.\n\nPrabir Adarkar -- Chief Financial Officer\n\nYeah. And just to add one data point to that, Eric. I mean, if you just look at Wolt's performance, we were super proud of the team and what they've built. In Q3, they grew 60% year on year in euro terms.\n\nNow I can't think of an example of another European food delivery company that's going at those rates. And from what I've seen, they're growing single digits year on year. So it's hard to sit here and say that Wolt is not gaining share just given the disparity in growth rates versus relying on third-party data and issues with their approaches and so on. So I rely on the absolute growth rate, which is, in my mind, a pretty reliable proof point around the fact that the Wolt team has created a product and experience that has higher retention, enables growing order frequency, and that's what's allowed them to produce the growth rates that they're posting.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nGreat. Thanks for the color.\n\nOperator\n\nYour next question comes from the line of James Lee. Your line is now open.\n\nJames Lee -- Mizuho Securities -- Analyst\n\nGreat. Thanks for taking my questions. Two here, please. First off, DashPass, I was wondering, is there any flexibility or room to increase your fees given your expanded offering and value proposition to customers? And also on DashMart, can you guys talk about the pace of investments in there in terms of new stores and geographic expansion? Any change in consumer behavior or unit economics to help you to kind of affirm your long-term thinking there? Thanks.\n\nPrabir Adarkar -- Chief Financial Officer\n\nThanks for the question, James. I'll take the first one and then Tony can talk with a second. Just as a general philosophy, we're trying to improve selection quality and affordability. And particularly in the third dimension, affordability means -- to us means reducing friction that's caused by consumer fees, whether it's through DashPass or the non-DashPass product.\n\nIt's trying to reduce fees or commissions on merchants and increase Dasher earnings. So in our case, we don't need to increase DashPass rates as a way of making the unit economics work because even at their current rates, DashPass economics word fine even without taking into account the subscription fee. So I view an increase in subscription fee at DashPass as being something that would actually slow down the pace of DashPass adoption which we've been very happy with so far. It continues to remain the largest paid membership program in the food category.\n\nWe hit record highs in terms of our dashboard subscribers. And the pace of growth in this program has frankly been consistent despite some of the partnerships that other competitors may have entered into or despite the bundled offerings that other competitors may be providing. I mean, despite all of those things, we're seeing DashPass grow. So we like the way it's set up.\n\nWe like the way it's position us for growth. And at least right now, there's no intent to change anything in terms of the fee structure.\n\nTony Xu -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah, James. And if I could, I'll just add a bit to this before heading into the DashMart question, which is -- I think one of the things I'm most proud of the team for accomplishing is that in the last two-and-a-half years, even though we stated in the shareholder letter, all of the growth that we've seen both top and bottom line in our business. What I'm really proud of is that in achieving all of that for the platform, we've been able to increased earnings for Dashers, increased sales for merchants, and reduced fees on a continued basis over the last two-and-a-half years for consumers. And so -- and DashPass certainly has been a big part of that on the consumer front.\n\nBut we've really done this while improving the offerings for each of the audiences that we're lucky to serve. On the DashMart question, I think it's important to start with like what we're doing and why we're doing it. With DashMart, one of the things that we've been studying very closely is why do certain industries get penetrated. Or why do they move from offline to online? Obviously, the restaurant delivery industry, even though, again, it has a large runway for growth, it has reached a certain level of penetration that something, say, grocery delivery or retail delivery or delivery from other types of stores has only reached a fraction of.\n\nAnd one of the things that we've seen so far is that the setup for third-party delivery in a lot of these non-restaurant categories isn't really optimized for delivery. It's really optimized for going inside the store, for browsing. As a result, some of these stores don't even know exactly what's on the shelf. And as a result, what you see in sometimes third-party delivery is a product that is more expensive than what someone would pay inside the store.\n\nThey don't always get exactly what they want when they actually buy it, and it doesn't always show up faster than a consumer can shop on their own. And as a result, you haven't seen that penetration. And so our belief is, in addition to working with all of these fantastic partners who we're really, really privileged to work with, whether it's Sprouts Farmers Markets or Giant Eagle or Loblaws; or in retail categories, people like Dick's Sporting Goods or Sephora, is that we want to start by working with them to really understand how can we bring incremental demand right out of the gate, but we also want to invent the future of the industry. And we believe the future in the industry has to offer a product that is going to be -- give customers exactly what they expect when they order at around the same prices of what they pay in store and certainly with greater convenience than they could do it on their own.\n\nAnd so DashMart is really a part of that, and we're doing that in concert with all of these partners that we've been lucky to team up with. And we're doing that here in the United States, we're doing that overseas, and that's really what DashMart is. It's going to be a very important infrastructural components for the future. Now that said, just like with all investments at DoorDash, it's not just about the long-term strategy of how can we maximize long-term profit dollars.\n\nIt's about how can we also invest with discipline according to the stage of the projects. And so that's what we're doing with DashMarts, too. It's not just what we're doing with the third-party business. We're doing that with DashMarts as well, making sure that we can achieve product market fit.\n\nOnce we see that, we continue investing. And if we keep seeing that grow, we will continue to make those investments. And so far, we like what we see. But there's a long road ahead, right? We've just started the DashMart business really a couple of years ago.\n\nSo we're learning very, very quickly, and we have to keep improving our product quality.\n\nJames Lee -- Mizuho Securities -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nYour next question comes from the line of Youssef Squali. Your line is now open.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nGreat. Thank you very much. Two questions, please. First, maybe just looking at the P&L.\n\nYour market efficiency has gone up tremendously. I think in the last year, I think your sales and marketing as a percentage of revenue dropped by something like 1,000 basis points. So it's down not only on a percentage basis but even on an absolute basis. I was wondering if you can kind of unpack that a little bit for us in terms of where is the efficiency coming from.\n\nIs it better ad rates? Is it maybe less spend on the U.S. restaurant category, where you obviously dominate? Maybe just kind of help us understand the drivers of that. And is that the primary driver for the higher EBITDA expectation for Q4? And second, on the Wolt, maybe just help us understand the acceleration in GOVs there. I think in the letter, you talked about customer acquisition at an all-time high, which is really impressive just all things considered.\n\nSo maybe just help us understand, again, sustainability of that as we go forward and maybe specific countries where you're seeing such a huge performance. Thank you.\n\nPrabir Adarkar -- Chief Financial Officer\n\nSo maybe I'll take both of those questions. And, Tony, chime in if there's anything else to add. So first on the marketing efficiency point, I just want to go back to some of the comments that we had shared when we went public back in the S-1, which is once you've acquired a cohort and the cohort sort of gets into its second, third, fourth year of life, the marketing spend associated with that cohort declines. It declines materially, right? Because there is no \"marketing maintenance spend\" that's required.\n\nAnd so what that means is as our business gets larger and our base of existing consumers gets larger, that provides leverage in sales and marketing. Now more specifically, if you were to tear apart the sales and marketing line and look at CAC versus Dash acquisition cost versus marketing acquisition -- versus merchant acquisition costs. There is leverage on CAC, but particularly in '22 compared to '21, there's been a lot of leverage in terms of our Dash acquisition costs, and that's been driven by product improvements that we've made. We're making it easier to Dash.\n\nDashers are putting more hours into our platform. The retention of our fleet has gone up. And as a result, that means we need to acquire fewer Dashers to perform -- to actually to fulfill the deliveries that are happening on our platform. And so that's provided leverage in addition to the point I made about an increase in the existing base of consumers.\n\nSo that's the response to your marketing efficiency question. When I -- on the Wolt question, it comes down to a couple of factors. I mean, Wolt operates in markets that have 300 million people, right? And these markets are -- have low levels of penetration. In fact, even in the oldest markets, Wolt adoption levels are less than 10%.\n\nSo there's a lot of room for growth just to expand customer acquisition in the markets in which they operate, as well as expand to new cities in those countries in which they operate. So that, coupled with the fact that the retention in the Wolt app is super high and order frequency continues to increase as the macro point that people like eating, people like the convenience of food delivery, and therefore, they only end up increasing the utilization of the product, the combination of these two things has helped them drive the results that you're seeing.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nSuper helpful. Thank you.\n\nOperator\n\nYour next question comes from the line of Doug Anmuth. Your line is now open.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nThanks for taking the questions. I just want to ask if you have any update to your commentary from last quarter, just suggesting a modest increase in '23 EBITDA. And then secondly, two things that come up a lot with investors, higher insurance costs and then also the regulatory environment just given the DOL ruling and Prop 22 status kind of still outstanding. So maybe you could comment on those.\n\nThanks.\n\nPrabir Adarkar -- Chief Financial Officer\n\nSure. Maybe I'll start. And, Tony, you can chime in whenever you want. So on the EBITDA point, so I think we said in our letter, we expect that the U.S.\n\nrestaurant business will continue to grow in 2023 and will increase its contribution profit, both in dollar and margin tops, right? Historically, what's happened is we've taken the majority of those profits and we have reinvested them in these investment areas. We're at a point where these investment areas are getting -- exhibiting margin improvement, and so the investment dollars don't perfectly offset the increase in the contribution profit in the restaurant business, and that's going to create some flow-through impact to EBITDA. So the combination of these two things, which is increasing restaurant profit, coupled with margin improvement in the investment areas, will help us increase annual EBITDA, both in dollar and margin terms in 2023. The only caveat I'll make is we continue to remain in investment mode, and so I'll change this approach if we identify attractive growth opportunities.\n\nBut today, at current trajectory and current portion speed, we expect to increase annual EBITDA. On your question on insurance, actually, when you look at our insurance cost in Q3 versus Q2, as a percentage of our GOV, our insurance costs were flat. So good progress in Q3. I won't declare a winner yet.\n\nWe've got to watch this closely, but there's been no increase at least as a percentage in Q3 relative to Q2.\n\nTony Xu -- Co-Founder, Chairman, and Chief Executive Officer\n\nYeah, Doug, and on the question regarding regulatory and what we're seeing, we're largely seeing pretty much exactly what we would have expected. I mean, I think just to make sure we're on the same fact basis. With respect to, say, the DOL announcement that was made recently, it doesn't change our business model or reclassify drivers. And in many ways, just is an affirmation of President Obama's administration's determination that there are independent contractor workers out there.\n\nAnd that more broadly, they're largely quite supportive of this line of work. And so what we've seen is outside of a handful of cities, and it's been the same count of cities that have, I would say, frankly, perhaps abuse their power and are trying to overregulate the industry, by and large, I think lawmakers, regulators, anyone in policy that we've spoken to has been very productive in terms of making sure that we can serve Dashers together. I mean, again, let's remind everyone what Dashers want. In terms of their activity, the average Dasher, and we're talking about 3 million Dashers every quarter, Dashers are working fewer than 4 hours a week on average, 90% of Dashers work fewer than 10 hours a week.\n\nThis is in the United States. And so what they're saying with their feet is the No. 1 thing they value about the DoorDash platform is really the flexibility that it offers. And then when you look at what they say and we look at -- take Proposition 22 as an example, Dashers preferred -- 87% of Dashers preferred staying as independent contractors.\n\nThe vast majority of voters in California supported Proposition 22. And so I'm optimistic that regulators and policymakers will take this into account and actually reflect what Dashers want, which is that they'd like to see labor laws catch up candidly to the modern-day realities of what the future of work really is, which is people ought to be able to control where they work when they work, and that's really what we see. So we don't really expect any new changes versus what we've said before.\n\nPrabir Adarkar -- Chief Financial Officer\n\nAnd, Doug, just to -- thank you. But just to add to Tony's comments there, obviously, in some cases, this regulation introduces new cost into the system. And our goal in such situations is to try to execute as efficiently as we can and try to optimize the way that cost. But in some situations, the cost might be onerous and cannot be entirely optimized away.\n\nAnd so we have a right and an expectation to able to generate a profit in the markets we operate in. And if those costs are overly onerous, we will act to protect our EBITDA guidance. And so I want to make sure that that's clear.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Brian Nowak. Your line is now open.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking my question. I have one for Tony just on business philosophy and sort of risk management through different macro scenarios. The business is holding on great so far.\n\nBut if we sort of walk into a scenario where in '23, you potentially have a weaker consumer in the U.S. or Europe and maybe your more cash flow generative U.S. business decelerates or has some impact from macro. Can you just sort of put us in that world and talk to us about sort of your investment philosophy in both your more developed businesses, as well as the earlier more developing products, just to ensure you're best positioned to drive these industries post-recovery while also doing the best you can to sort of maintain and improve employee morale, which, in part, probably matters around the stock?\n\nTony Xu -- Co-Founder, Chairman, and Chief Executive Officer\n\nHey, Brian. Yeah, I mean, I think the investment philosophy has been largely consistent with what we've done. And I mean, I think even when I think about the last 10 quarters, basically from when we've become public to where we are now, what we outlined in the S-1, we've kind of just continued marching toward that drumbeat of telling the narrative of how we want to be the local commerce company, both building the largest local commerce marketplace, the largest local commerce platform and how we're making investments in toward doing that. I mean, I think it's important to take note of what has happened in the last two-and-a-half years.\n\nI mean, we went from a one business line company into now five businesses with investments into operations overseas outside of the restaurant category, an ads business, a platform business with products like Dress Drive and storefronts. And so when I think about what we are today, the biggest thing that I've been thinking a lot about is how do we actually make sure we continue to stay disciplined about investing commensurate to the stage of those projects. Now obviously, there's a lot of macro headwinds, as you mentioned, and that have changed in the past year. But for me, all that suggests is just it's going to put pressure on our execution.\n\nBut obviously, if we're not -- if it puts pressure on the consumer, which is, I think, the point that you're going toward and we're not seeing signal in some of these investment areas, then we certainly would pull back, and invest accordingly. And so for me, it's really, again, about keeping that discipline even though we've gone from one business now to five businesses. And just to also put things in perspective just for everyone on the line, a lot of the investment dollars are going into our non-U.S. and our non-restaurants category businesses.\n\nAnd the size of those investments now have built a business that's larger than all of DoorDash just a few years ago. And so we certainly like what we see. But obviously, if we're seeing behavior come down because of macro pressures, we will invest accordingly.\n\nPrabir Adarkar -- Chief Financial Officer\n\nAnd just to add to Tony's comments, Brian. I mean, remember, our core U.S. restaurant business is growing and generates significant cash flow, right? And historically, we've invested the vast majority of this to grow scale in these other areas, into new categories, in international. But these investments are discretionary.\n\nAnd that means that if for one reason or another, we're better served by pulling back on the investment because we're not seeing the right signal in terms of consumer demand because we're not seeing the right improvement in terms of unit economics or whatever, we can alter the pace of the investment. So far, we've been pretty disciplined with capital allocation. You can see that now in the results in terms of the U.S. restaurant business, and the plan is to continue being equally disciplined going forward.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nGreat. Thank you both.\n\nOperator\n\nYour final question comes from the line of Mark Mahaney. Your line is now open.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thanks. Two questions, please. I know somebody already asked you about macro impact on the demand side.\n\nAnything you'd call out on the supply side? Anything about the need for extra side hustle that's maybe led to bring in more Dashers? And then secondly, Prabir, your comments about '23. We always parse your words very carefully. That last quarter, you had said the increased annual EBITDA by a modest amount. And this time, when finishing your answer to the question, just said you would increase annual EBITDA but you didn't use the modest word.\n\nIs there anything to read into that? Sorry to ask you such a precise question, but I just want to make sure we're not missing any nuances. Thank you.\n\nPrabir Adarkar -- Chief Financial Officer\n\nYeah. Maybe I'll take both. So Mark, on the Dasher supply question, this is the point I made sort of through today's conversation around the labor market being more normalized this year than it was last year. And so that's having an impact on, obviously, to some degree, advertising rates but also in terms of supply that's available to become Dashers.\n\nAnd that benefit has been turbocharged by product improvements that have now improved the retention of the fleet and is actually generating incremental supply hours from existing Dashers. And so both of those things means you just don't have -- you don't need to acquire as many new Dasher. So the labor environment -- it's a long story short, the labor environment has resulted in all-in national costs being better today. And that's been -- and because of the product improvement that we've made, we expect that to continue benefiting our cost structure in Q4 as well as 2023, provided there's no shocks of the labor environment.\n\nOn the question around 2023, I'd urge you not to over extrapolate on a word or two. Really, we're not providing quantitative guidance. But what I am trying to share with you is when you think about the underlying dynamics of the business, the reason you didn't see a lot of EBITDA expansion going from '21 into '22 was because the pickup in terms of contribution profit from the U.S. restaurant business was largely soaked up by the investments.\n\nWe're at a point right now where the investments are getting better from a margin perspective, while the U.S. business continues to grow and therefore throws off more dollars and as continuing improvements in the margins, and it's not a perfect offset anymore. It used to be, not anymore. And that's going to generate incremental EBITDA, both in dollar terms and in margin terms.\n\nWe'll come back to you with specific guidance on 2023 in Q4, which is in line with our normal cadence.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thank you, Prabir.\n\nOperator\n\nThere are no further questions at this time. Mr. Andy Hargreaves, I now turn the call back over to you.\n\nAndy Hargreaves -- Vice President of Finance and Investor Relations\n\nGreat. Thank you, everybody, for joining us today. We appreciate both your time today and your support and look forward to talking with many of you soon. Have a good evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAndy Hargreaves -- Vice President of Finance and Investor Relations\n\nRoss Sandler -- Barclays -- Analyst\n\nTony Xu -- Co-Founder, Chairman, and Chief Executive Officer\n\nPrabir Adarkar -- Chief Financial Officer\n\nBernie McTernan -- Needham and Company\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nJames Lee -- Mizuho Securities -- Analyst\n\nYoussef Squali -- Truist Securities -- Analyst\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nMore DASH analysis\n\nAll earnings call transcripts"
}