{
  "companyName": "BJ's Wholesale Club Holdings, Inc.",
  "companyTicker": "BJ",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/bjs-wholesale-club-holdings-inc-bj-q3-2022-earning/",
  "content": "BJ's Wholesale Club Holdings, Inc. (BJ 0.30%)\nQ3 2022 Earnings Call\nNov 17, 2022, 8:30 a.m. ET\n\nOperator\n\nHello everyone, and welcome to the BJ's Wholesale Club Holdings, Inc. third quarter 2022 earnings conference call. My name is Adam, and I'll be coordinating your call today. After the speakers' remarks, there will be a question-and-answer session.\n\n[Operator instructions] I will now pass the call over to your host, Cathy Park. Please go ahead when you're ready.\n\nCathy Park -- Vice President, Investor Relations\n\nGood morning, and thank you for joining BJ's Wholesale Club's third quarter fiscal 2022 earnings conference call. On the call today are Bob Eddy, president and chief executive officer; Laura Felice, chief financial officer; and Bill Werner, executive vice president, strategy and development. Please remember that during this call, we may make forward-looking statements within the meaning of the federal securities laws. These statements are based on our current expectations and involve risks and uncertainties that could cause actual results to differ materially from our expectations described on this call.\n\nPlease see the risk factors sections of our most recent Form 10-K and Form 10-Q filed with the SEC for a description of those risks and uncertainties. Finally, please note that on today's call we will refer to certain non-GAAP financial measures that we believe will provide useful information for investors. The presentation of this information is not intended to be considered in isolation or as a substitute for the financial information presented in accordance with GAAP. Please refer to today's press release posted on our investor relations website for a reconciliation of these non-GAAP financial measures to the most comparable measures prepared in accordance with GAAP.\n\nWith that, I'll turn the call over to Bob.\n\nBob Eddy -- President and Chief Executive Officer\n\nGood morning. Thank you for joining us today. This morning, we reported another quarter of strong results, demonstrating the power of our business model. This was the most profitable third quarter in our history.\n\nOur consistent focus on delivering value to our members, especially when they need it most, has put us in a position of strength. Our member base is growing in both size and quality. We're improving our merchandising to deliver unbeatable value. We're offering more convenience for our members through a great digital experience.\n\nWe're expanding our footprint into new and existing markets and doing it successfully. We have a great team and a competitive strategy and the investments we continue to make position us well for long-term growth and sustainable value creation. In the third quarter, our comp sales were up 9.7% overall and up 5.3%, excluding gas. Our food categories continue to anchor our strength, with comps increasing double digits over last year's performance.\n\nWhen we entered the year, we expected Q3 to be our most challenging quarter from a comp sales perspective given the difficult compare. Our business has exceeded our expectations given the continued strong membership and shopping behaviors. As we've seen all year, traffic growth has been a positive driver of our comp, and sales per member have been greater than last year in each of our income cohorts. I'd like to put Q3 in perspective relative to 2019.\n\nOur third quarter merchandise comp sales were nearly 30% on a three-year stack, which is a sequential acceleration from last quarter's results. The combination of membership growth, higher quality of membership, and our club growth continue to highlight our company as a structural long-term growth story. Adjusted EBITDA grew 19% to $272 million and adjusted EPS grew 9% to $0.99 per share. Finally, another strong gas quarter contributed nicely to our profits.\n\nGas is an emotional purchase for many of our members, so we set our prices to showcase value and drive member loyalty. This led to comp gallon growth of 11% in the third quarter despite the broader market's decline in gas consumption. Our 30% two-year stack in gas gallons highlights a tremendous gain in market share. In addition to the growth in gallons, our business has been more profitable.\n\nGasoline is structurally more profitable than it was a few years ago. And the last several years and this year, in particular, have seen increased levels of volatility. The resulting higher-than-normal profit per gallon has served as a significant tailwind to our business this quarter and this year. We are executing on our strategic priorities, which are growing and retaining members, bringing more value to our members through better merchandising, improving convenience with digital, and expanding our footprint.\n\nThese priorities are key to driving long-term sustainable growth in our business. Let me briefly touch on each. The long-term success of our business is grounded in the strength of our membership. In the third quarter, our membership fee income grew 9% year over year to nearly $100 million.\n\nI'm proud of the progress we've made in growing and retaining our members over the past several years. We've evolved our membership acquisition campaigns to optimize our marketing. We're utilizing digital capabilities to expand our reach. We've gotten smarter about how we leverage data to remain relevant with new and existing members, yielding better renewal rates.\n\nAnd as we enter new markets, we're working to strategically build membership well ahead of our grand openings. Our member count stands at over 6.5 million members, up 6% year over year in the third quarter. Effective acquisition efforts across new and existing clubs, as well as growing digital acquisition, have contributed to the increase. In addition to overall member growth, we are improving the quality of our membership.\n\nOur higher-tier membership penetration in the third quarter was 38%, up roughly four points year over year. Our co-branded credit card program has meaningfully contributed to our higher-tier membership base. In this quarter, we formally announced our transition to Capital One. As we look back, the decision we made to invest in lifetime value by creating the best card value proposition in the club space has paid dividends, with our cardholder base growing over 10 times since we launched the program in 2014.\n\nAs we look to the next leg of growth, I'm excited about our new partnership. Capital One's market-leading customer service and digital experience are widely recognized in the card space, and we're especially thrilled to offer an enhanced value proposition to our members as part of this new program. Our data shows that members with our co-branded card have profoundly better lifetime values driven by renewal rates well above the chain average. As the penetration of these members increases, so does the quality of our membership.\n\nEnsuring a successful transition with Capital One will be one of our highest priorities over the next handful of quarters, and we are confident that this is the right next step for the company as we continue to grow with the best partner in the business. A final point on membership strength, our first-year and tenured renewal rates are improving over last year's levels, and I believe we will achieve another all-time high at year-end. Persistently high levels of inflation are diminishing consumer purchasing power. In the U.S., food-at-home CPI has grown in the double-digit territory year over year for most of this year, and households with waning government aid have been further constrained.\n\nOverall, energy costs, including gas, have come down a touch since summer but are still running higher than last year's levels. As sustained cost pressures continue to weigh on consumers' pockets, we have remained focused on delivering great value to our members. Specifically, we have continued to invest in price, resulting in significant savings for our members. In fact, our internal analysis shows that our pricing positions remain stronger against our competitors in the third quarter compared to the same time last year.\n\nHaving the right value is especially important to us during the holidays. This year, our members who spent $150 or more at our clubs during the first 10 days of November are offered a turkey for free. Consider the savings from this one transaction alone. Our members can save about 25% or more when they shop with us when compared to our supermarket competitors.\n\nThat 25% savings from our members' $150 basket, combined with the free turkey, basically covers a one-year BJ's membership fee. This offer and the examples highlighted in our last two earnings calls, rotisserie chicken and our deli offering, are meant to highlight our outstanding value. We aim to offer our members as many ways as possible to get a return on their membership fee. We are leveraging our competitive advantages to drive market share gains in the near term while investing in initiatives to further optimize assortment and deliver more value to our members in the long run.\n\nOur fresh business, for example, is a major reason why our members shop at our clubs, and we aim to offer the freshest assortment at a compelling price. Bringing our perishable supply chain capabilities in-house was the natural first step in this process. We are now in the early stages of working through everything from sourcing to packaging to supply chain lead times, all the way to marketing and in-club presentation. In addition to our work in fresh, we are leaning into our own brand strategy as our members look to maximize their savings with quality products.\n\nIn the third quarter, our own brand's penetration grew to 24% despite a difficult compare. Our third strategic pillar is driving convenience through digital, and we are generating robust growth in this area led by BOPIC and curbside. In fact, our digitally enabled sales are trending toward 9% of our overall net sales this year, up from 8% last year. Digitally engaged members typically have higher average baskets and shop with us more frequently, which increases the likelihood of membership renewal.\n\nWith the expansion of these offerings, our member experience is more convenient than ever, and we will continue to invest in enhancing our digital efforts. Finally, as you know, we have dramatically accelerated our real estate plans. We've opened seven new clubs this year, including our entry into Indiana in September. Last month, we opened in Greenburgh, New York, and we also opened in New Albany, Ohio a couple of weeks ago, expanding our presence in the state to the Columbus market.\n\nWe're almost set to open our doors in Wayne, New Jersey this weekend, and we have a few more clubs slated to open over the next few months. The clubs that we've opened in the past several years continue to perform better than our initial plans, giving us the confidence to sustain 4% to 5% unit growth in the foreseeable future. Our commitment and ability to bring value to our members remain a powerful advantage in times like these. As a result, we've grown our top line and market share throughout the year while navigating a pressured margin environment.\n\nGas has driven considerable upside to our results, granting us the ability to further invest in our members and our team members. Our grocery business is strong, and we feel good about how we're managing our inventory through the holiday season. There's no doubt that inflation is impacting consumer decisions, and it's looking likely that inflation will continue into next year, albeit at a moderating pace. No matter how the macro ends up playing out, we'll remain true to being there for our members and delivering unbeatable value, which I believe will deepen loyalty, reinforce our brand, and drive long-term growth.\n\nBefore I wrap, I'd like to acknowledge and thank our team members for their dedication in serving our members and the communities in which we operate. I'm especially heartened by the incredible support our team members have provided to those impacted by Hurricane Ian, our emergency response team's work in the days leading up to Ian's landfall, ensuring inventory preparedness, asset security, and the safety of our team members and members. Our clubs were up and running so long as we deemed that safety was not compromised. Our teams worked with our partners to provide essentials such as water, snacks, baby formula, and cleaning supplies to local shelters.\n\nAs they always do, our team members showed up for our members and communities through this crisis. To our team members who are listening in today, thank you for your hard work. Your efforts make a real difference in our company and in our communities. I'll now turn it over to Laura to provide more details on our results and outlook for the rest of the year.\n\nLaura Felice -- Chief Financial Officer\n\nThank you, Bob. Before I begin, I'd like to reiterate Bob's gratitude for our team members across our clubs, club support center, and distribution centers. We are navigating a challenging operating environment, and our continued strength is the result of our team members' hard work. Now, let's dig into our results.\n\nNet sales in the third quarter were $4.7 billion, a 12% increase over the prior year. Third quarter comp sales were 9.7%. Merchandise comp sales, which excludes sales of gasoline, increased by 5.3% and was driven by about equal parts traffic and basket growth. Our two-year stack was up 11%, reflecting a three-year stack of up 29.5%.\n\nThe Q3 effect of inflation was slightly more than last quarter as we passed on a portion of growing input costs while maintaining our strong pricing positions by strategically investing in our key value items. Comps in our grocery, perishables, and sundries division grew by approximately 6% in the third quarter, up 12% on a two-year stack and up 31% on a three-year stack. We grew market share during the quarter, and our overall market share remains well above pre-COVID levels. Our general merchandise and services division comp grew by 3% in the third quarter.\n\nThe growth was led by optical, home improvement, and tires, where we've made tweaks to our offerings to provide greater value. Comps in this division were up 7% and up 21% on a two-year and three-year stack, respectively, as discretionary spending continues to normalize toward a new higher base from the past two years. Our digital offerings have made the member shopping experience more convenient. Digitally enabled sales for the third quarter grew 43% year over year and over 280% on a three-year stack.\n\nOver 80% of our digitally enabled sales are fulfilled by our clubs with services like BOPIC and same-day delivery. Our curbside delivery offering continues to resonate with our members, making up approximately 60% of our BOPIC business. In our gas business, our comp gallons grew by 11% in the third quarter, which performed in line with our expectations of continued market share gains. Our gas margins, on the other hand, trended higher than our expectations and resulted in gas profits that outperformed our internal plans.\n\nMembership fee income, or MFI, grew 9% to $99.5 million in the third quarter and continues to underscore the progress we have made in improving our business. We are pleased with our membership trends, including higher tier penetration, easy renewal, and first-year and tenured renewal rates. Moving on to gross margins, excluding the gasoline business, our merchandise gross margin rate decreased by 30 basis points, primarily due to a higher supply chain costs and inflation, a trend that has remained consistent with prior quarters this year. Let me touch briefly on inventory, where our teams have made significant progress.\n\nWe ended the third quarter with $249 million more inventory on our balance sheet than last year. Excluding the impact of inventory on our books as part of the acquisition of our perishable distribution centers, our inventory increased by $152 million, or 12% year over year, and the growth made up of inflation and new club growth. SG&A expenses for the quarter were $674 million. The year-over-year increase was primarily attributable to increased labor and occupancy costs as a result of new club and gas station openings, as well as $6 million in costs associated with the transition to our new club support center.\n\nOur third quarter adjusted EBITDA grew by 19% to $272 million, reflecting our sales growth and outside gas profits. Finally, adjusted net income for the third quarter was $136 million, or $0.99 per share, and reflected a 9% increase year-over-year growth on a per-share basis. Turning to our capital structure, the current rate environment has slightly altered our near-term thinking around our debt, which is entirely floating rate today. In efforts to partially mitigate our interest expense risk, we paid down $154 million of debt during the quarter, including $100 million of our first lien term loan.\n\nWe ended the third quarter with less than one turn of net leverage and may further reduce our debt if rates continue to rise. We are generating robust free cash flow with $79 million in the third quarter and $333 million year to date. As we allocate our capital going forward, we will continue to be flexible in our approach, but our priority remains growing our business. Investments to support membership, digital, and our real estate growth plan will be funded by these cash flows and enabled by our balance sheet, which remains strong.\n\nWe continue to return excess cash to shareholders through share repurchases, and in the third quarter, we bought back nearly 685,000 shares for approximately $50 million. Let me now touch on our current outlook for the year. As we noted various times in our prepared remarks today, our grocery business remains strong, and we believe we can continue gaining market share because of our intense focus on value. Inflation is still impacting many aspects of our business.\n\nAlthough recently, we have seen some relief in commodities such as chicken, milk, and cheese. And as we head into the winter holidays, we will remain nimble in maintaining our competitive advantages to drive traffic into our clubs and online channels. Starting at the top of the P&L, we now expect our fiscal 2022 comparable club sales, excluding gas, to increase in the 5% to 5.5% range, which continues to imply about 4% to 5% of comp for the fourth quarter. In October, we officially announced our new co-brand partnership with Capital One, which we believe will bring an enhanced value proposition to our members and serve as another catalyst to grow and strengthen our membership base.\n\nThe ultimate benefits of these changes are crystal clear to us. At the same time, we also acknowledge that it will take us multiple quarters to complete the transition, which may temporarily impact our membership KPIs, including higher tier penetration. We will aim to be transparent as possible through this period. For our gas business, in the fourth quarter, we continue to assume gas gallon comp growth in the low-teen range with slightly higher-than-normal profit per gallon.\n\nRecall that our gas profitability was the strongest in the fourth quarter last year. Moving down the P&L, our outlook on margin also remains unchanged in that we still see ongoing but slightly easing merchandise margin pressure, driven by investments in price and elevated supply chain costs. As such, we expect the year-over-year change in merchandise margin rate to remain negative in the fourth quarter but better than the 30-basis-point decrease we delivered in the third quarter. As it relates to interest expense, we expect continued pressure in the fourth quarter, and we'll continue to monitor movements in the rate environment.\n\nTaking all of this into consideration, we now expect our full year EPS to be in the $3.70 to $3.80 range. Before turning it back to Bob, I'd like to reiterate our confidence in the strength of our business and the transformation we have made. As a result of the improvements we've made in membership, footprint expansion, and digital, further amplified by our advantages inherent in the warehouse club model, we believe we are positioned to deliver a solid long-term growth profile. With that, I'll turn it back over to Bob for closing remarks.\n\nBob Eddy -- President and Chief Executive Officer\n\nThanks, Laura. We've made significant progress in strengthening our business, and I believe we are well-positioned today to drive long-term growth by executing on our strategic initiatives and prioritizing value in everything we do. We will continue to allocate our capital toward investments to maximize shareholder value. Our warehouse club model remains a structural advantage, with a growing annuity in the form of membership, lower operational costs, and a foundational focus on great value.\n\nWhen the consumer outlook is uncertain, our members find comfort in being able to stretch their dollars with us. I believe that the reliability and loyalty that we have worked hard to build with our members over the years will remain key to our success, no matter the circumstances. With that, I will now turn it back over to the operator to take your questions.\n\nOperator\n\nThank you. [Operator instructions] And our first question today comes from Mike Baker from D.A. Davidson. Mike, please go ahead.\n\nYour line is open.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nThanks, guys. Great quarter. I just wanted to ask you about your overall view on the consumer heading into the holidays. I guess you've given us guidance, so that helps us.\n\nBut, you know, maybe one way to flesh it out is the pace of sales throughout the third quarter. A lot of retailers are a big drop-off in October. Did you see anything like that? And -- or maybe another way to think about it is, you know, are you seeing consumers just really focus on promotional activity or trade down or anything like that that would give, you know, another sort of opinion on what's going on with the consumer as we head into the holidays. Thanks.\n\nBob Eddy -- President and Chief Executive Officer\n\nHey, Mike. Good morning. Thanks for your question. I think it's a good one overall.\n\nI think our consumer is in a very healthy shape, as we've seen through the entire year. As we talked about in the prepared remarks, our membership statistics are doing great. We're gaining market share for the year. The thing I'm most excited about is as we continue to gain trips as well, as we show our members incredible value.\n\nYou know, the refrain that we've been talking about all year is really throughout the income cohorts that we look at, we've seen more sales and more trips per member as well. So, I think our consumers are very healthy at this point. You know, as you think about the pace through 3Q, certainly, October was lower for us than the preceding two months. A lot of that I think, though, is really the compare to what we had last year.\n\nWe had an incredibly strong October last year. And so, if you look at it on a two-year stack, the months were very equal for us. So, I don't see that October performance this year sort of running into November or 4Q. So, we're very pleased with where our consumer is.\n\nThey're really reacting to the value that we put out there, and hopefully, that continues.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nGreat. Thanks. One more quick follow-up. Just wondering how that turkey offer went.\n\nDid it actually drive new membership growth?\n\nBob Eddy -- President and Chief Executive Officer\n\nSo, it's certainly, you know, had a good reaction. We're still in the period where people are redeeming the offer. So, you didn't get the free turkey on the day that you spent $150. You have to come back.\n\nIt's sort of a bounce-back free turkey offer. And so, we're still in the redemption period. We've got a little ways to go to see how it actually works out. But -- so the number of people that took advantage of the offer, I think, is looking higher than our expectations.\n\nAnd it certainly drove some traffic into our buildings, too.\n\nMike Baker -- D.A. Davidson -- Analyst\n\nYeah. Thanks. It's a great idea and a great offer for consumers. Thanks for the time.\n\nBob Eddy -- President and Chief Executive Officer\n\nYou bet. Thanks.\n\nOperator\n\nThe next question comes from Edward Kelly from Wells Fargo. Edward, please go ahead. Your line is open.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nHi. Good morning, everyone. A nice quarter once again. Bob, you've been, I think, very optimistic around the new co-branded credit card and what that could mean for you over time.\n\nCould you maybe just give us a little bit more color on how we should think about that, you know, both sort of like the upfront benefit that you could see, which I would imagine there are some better economics here, but also, you know, what it does to the member? And then, Laura, you mentioned, you know, the potential impact of member KPIs. Could you just maybe give a little bit more color there in terms of how you are mitigating that risk?\n\nBob Eddy -- President and Chief Executive Officer\n\nEdward, good morning. Thanks for your question. Maybe I'll kick it off and Bill and Laura can fill in. You know, I look at our current co-brand program and see it as a tremendous success.\n\nAs we've talked about, it's grown over tenfold in the years since we launched it. It is a great source of member value. And we think it's the best value prop in the wholesale club space at this point. And it will only get better as we go forward.\n\nAs we talk about it as a team, we think it will be tremendously valuable to our members given we will improve the value prop. And, you know, the question becomes one of lifetime value, right? We are in the value business. We can use this as a vehicle to provide more value to our members. That has shown to come back to us in better purchasing habits and higher renewal rates.\n\nSo, that's the game that we're playing. We'll continue to play it. I think it could be one of the more valuable things we do in the next set of years and looking forward to the transition to our new partner. And maybe I'll hand it over to Bill.\n\nHe's the architect of this program and running the transition, so he can give you a few comments as well.\n\nBill Werner -- Executive Vice President, Strategy and Development\n\nThanks, Bob. Ed, good to speak with you. Now, I'll just echo what Bob said. We made -- yeah, as we think about the co-brand program, we've talked about this with the Street a little bit.\n\nWe made that strategic decision back when we launched the current version of the program to invest all the economics back into the members with the goal of driving lifetime value. And we're really pleased with how that's performed over the last several years. Yeah, as we think about the transition to Cap One, we're not going to come away from that point of view in strategy in terms of investment. It's an unbelievable way for us to give value back to our members.\n\nAnd we'll take some of the enhanced economics and roll them back through the value prop so we can deliver it back to the members. So, we're really excited about Cap One. The team across the board at Cap One is incredible in everything that they do. And as we think how that plays through to the growth of the next program, yeah, we think that there's a substantial like higher from here in terms of the growth with the membership base.\n\nSo, there'll be a little bit -- in terms of the KPI, there'll be a little bit of a slowdown here -- not slow down, but a pause as we shut off acquisition in the coming days on the current program as we work through the transition. So, you'll likely see a pause in the higher-tier membership penetration as we report Q4. And then as we get the program launched in the first half of next year, you'll see then reaccelerate from then as we start acquisition of the new program.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nOK, great. Just a quick follow-up, if I may. You know, Bob, as we think about, you know, 2023, and I know it's still early and the backdrop is uncertain, but, you know, the consensus to me looks a little high, especially given that, you know, you have the fuel margin compare. Could you just maybe, you know, help us with some puts and takes that we should be thinking about for the out year?\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah, sure. Certainly, when we think about next year and the long-term positioning of our company, we're very excited. As we talk about a lot, our membership is growing, that the performance and the quality of our membership is much better than it has been and continues to improve. And what we just talked about with co-brand is just one more lever on that -- on proving that count and quality.\n\nWe're looking for continued market share gains and the flow through from those increased trips that we're seeing here and to renewal rates. And we won't take our eye off the ball from a value perspective either. So, as we go through whatever happens next year from a macroenvironment, I feel like we're well positioned. You know, you point out that we've had an incredible tailwind from a gasoline income perspective.\n\nThat is absolutely true. We've also had headwinds all over the business, most notably in margins this year. Supply chain costs and general merchandise markdowns really impacted our margins throughout the year. And so, I do think it will be tough to lap the gas income that we've seen this year.\n\nIt's been, by far, the most profitable gasoline year we've ever seen. We're continuing to see incredible volatility in gas, which could provide more opportunities to get more income next year. But I have long ago stopped trying to predict what would happen in the gasoline market. So, we've got some work to do to figure out whether we can lap the gas profit.\n\nI do think it'll be tough. I do think some of the margin headwinds that we've seen this year may fall away as well. And so, hopefully, we've got some avenue to get back toward flat from an EPS perspective. I don't know that I would project to get flat with this year at this point.\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nBob Eddy -- President and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nThe next question comes from Robbie Ohmes from Bank of America. Robbie, your line is open. Please go ahead.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning. Thanks for taking my question. Actually, two questions. One was just on the membership fee income, you know, decelerated sequentially.\n\nCan you remind us, you know, what would be driving this sequential growth deceleration and how we should be thinking about that for the fourth quarter? \n\nBob Eddy -- President and Chief Executive Officer\n\nRobbie, thanks for your question. Certainly, you're right. It did decel a little bit. I guess I would tell you we're not worried about it.\n\nWe -- when we started the year, we were thinking about a mid-single digit increase in MFI, and we're up over 10 for the year. So, as we think about that, we're -- we look at it and think we're doing well. A lot of it has to do with the timing from quarter to quarter, when the new clubs come into play, and just general membership flows as well. So, again, nothing to be concerned about there.\n\nI think it's had great performance all year and kind of right where we want it.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nAnd then the other question I'll ask was just general merchandise. I think you guys said the comps were up 7%. Is that right?\n\nBob Eddy -- President and Chief Executive Officer\n\nGeneral merchandise and services.\n\nLaura Felice -- Chief Financial Officer\n\nAnd services.\n\nBob Eddy -- President and Chief Executive Officer\n\nYup. Yup.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nSo, the -- that's a really good, you know, number against -- you know, it wasn't an easy comparison last year. Can you talk a little more about the discretionary side of the business? I know it's, you know, relatively small for you guys, but it sounds like you might be outperforming what other retailers are seeing in discretionary, maybe, you know, what are you seeing in apparel and some of those areas?\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah, I think, you know, largely, we've seen what others have seen, Robbie. So, we saw a very strong performance in our services division. If you think about optical and home improvement and tires and some of those businesses, which shows a healthy consumer, right? Those are not small dollar amount purchases. But we have seen our members be a little bit more choosy about what they're spending on.\n\nAnd, you know, some of the themes that our competitors have talked about with lower apparel sales and the more discretionary items, we definitely saw that in the third quarter. I think some of that is weather related. I always hate to talk about that. But, you know, it's never 75 in Boston in November and it was pretty much the entire front part of the month.\n\nSo, certainly, that's had some part of it as well. And you're seeing some meaningful deflation in some key general merchandise categories like televisions. And finally, the last thing I would say is the holiday season seems like it's going to run a little bit late to us. You know, last year, consumers were here and buying in September and October because they won't be there in November and December.\n\nAnd that seemed like they're back on a normal purchasing pattern this year, at least in our business. And a couple of our competitors have noted that way, too. So, you know, we thought GM did OK in the quarter. We're looking forward to a good performance in the fourth quarter.\n\nBut, you know, we've got a lot of room to go in the last part of the quarter here to bring it home.\n\nLaura Felice -- Chief Financial Officer\n\nHey, Robbie, it's Laura. I just clean up one point on that is that the 7% that I mentioned in the prepared remarks was the two-year stack on GM and services. So, on the quarter, it was 3%, but still positive.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nGot it. That's all super helpful. Thanks so much.\n\nBob Eddy -- President and Chief Executive Officer\n\nThanks, Robbie.\n\nOperator\n\nThe next question comes from Peter Benedict from Baird. Peter, your line is open. Please go ahead.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nHey, good morning, guys. Thanks for taking the question. Maybe I'd like to talk a little bit about the club growth opportunity that you guys see. I know, your 4% or 5% unit growth.\n\nMaybe talk a little more about kind of the new club economics, how they look today maybe compared to where they were historically? I'm curious on your mix of kind of new versus existing market openings. And then longer term, where's the distribution infrastructure? How much can the current -- how many stores can that current infrastructure support? At what point would you guys have to start to invest more in that? That's my first question.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Hey, Peter. Good morning. Thanks for the question.\n\nI'll just take it off and Bill can fill in. We've had a great year this year from a new club perspective. I've got seven in the back already. We open hopefully tomorrow in Wayne, New Jersey.\n\nWe talked about that on the prepared section of the call. And we've got a few more before the end of the year to meet our target. Our pipeline is very healthy at this point. We feel like we're going in the right direction.\n\nAnd all the clubs we've opened in the last few years have outperformed what we thought they would do. So, that gives us a ton of confidence to continue to keep our foot on the gas from a real estate perspective or we've invested behind the capability to move this quickly. As you know, we didn't do that in the past. But that has borne some great openings of late and building a team that is dedicated to making sure those new buildings open on time and in great condition and looking forward to continuing unit growth.\n\nAnd I'll let Bill talk about economics and some of the other points that you asked about.\n\nBill Werner -- Executive Vice President, Strategy and Development\n\nYeah. Hey, Peter, it's Bill. Yeah, the -- in terms of the new versus existing markets, right, as you look at our growth this year, you've seen continued expansion in the Midwest with the build out of Pittsburgh, of Detroit, the push down in Ohio into Columbus, the entry into Indiana for the first time with our club in Noblesville, which is off to an amazing start. So, the balance this year is about 50-50.\n\nAs we look at next year, it'll be similar in terms of new and existing markets. In terms of the performance in the existing markets, it's been extremely strong. As we look back on the openings in clubs like Commack on Long Island, Long Island City, and Newburgh, New York, where we've added density, where we have a strong membership base to begin with, we see really great member behavior in those clubs, where not only are they shopping in the new clubs, but the legacy members that were in those trade areas, they're also shopping at the legacy clubs, as well as the new clubs. So, we've seen really strong incrementality in that performance in the existing markets at levels that we haven't seen in the past.\n\nAnd that's really positive as we think about building out our existing networks into the future. You know, in terms of the investments, it's certainly something that we're looking at. We expanded our perishable distribution facilities last year with an opening of a facility in Kentucky. We're looking forward at the build-out of the dry network as we go forward.\n\nIf you remember, when we went public, we had talked about the ability for the -- our distribution network to support about 100 incremental clubs. And lo and behold, as we've done, you know, 30 stock comp over the last three years, we've used a lot of that capacity pretty quickly, which is a great problem to have. So, the dry side is certainly something that we're looking about going forward. And yeah, I'd be reluctant not to mention the insourcing of our Burris acquisition this year.\n\nThe perishable facilities bring them in-house, gives us great capabilities as we continue to grow our network here forward. So, we feel good about the pipeline for next year. We're working now actively on calendar years '24 and '25, and we feel good about the results of what we're seeing.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nNow, that's super helpful. Thanks. And then just a quick follow-up. I -- just on the general merchandise business, you guys have made some investments in there in personnel.\n\nJust a quick update on what the plan is in terms of trying to drive improved execution in that area over the next couple of years. Thank you.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. So, maybe I'll take that one, Peter. As you know, improving our general merchandise business is one of our key priorities. To me, the entire game, no matter what you're talking about, but most notably here, it starts with talent.\n\nAnd we've made tremendous upgrades in our merchandising team, both with new talent and improving the capabilities of our outstanding talent that was already here to allow us to, over time, improve our general merchandise business. So, whether it's hiring our new chief merchant, Rachael Vegas, not so new anymore, it's about a year at this point; our new head of general merchandise, Dion Evans; and their teams have just done outstanding work to really, you know, start that process of improving our general merchandise business. As you know, a lot of these categories are long lead time categories, and so you really won't see the fruits of their efforts until next year. Probably in the second quarter, you'll see some benefit.\n\nIn Q3 and Q4, you'll really start to see some of the benefits of their decision-making. I can tell you, we would -- as one example, we would not have worked through the general merchandise inventory we had over the summer this year without their help. The quality of the conversations and the execution that we're seeing from the team, as well as the new planning and allocation folks that we brought in, has really just changed the game for us. So, I'm very bullish on our GM prospects over the long term with our team and looking forward to getting into next year so we can see how the members react to what we're doing.\n\nOperator\n\nThe next question comes from Chuck Grom from Gordon Haskett. Chuck, your line is open. Please go ahead.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nGood morning. Bob, can you talk about the balance between flowing through the excess gas profits that you've generated year to date to the bottom line versus taking some of that money and investing in price to showcase value to your customer?\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Thanks, Chuck. It's a great question. So, as you know, we price our gasoline every day to be the best in the market.\n\nAnd, you know, generally, that is on par with our club competitors and better than everybody else. We have a pretty sophisticated pricing model where, you know, we'll look at data on who's on the market every single day, sometimes multiple times a day, and make sure that our prices are the best. We do that because it changes member behavior, right? Gas stations with -- clubs with a gas station perform better than those without. They have more trips, more renewal rate.\n\nAnd that the definition of more changes with the price of gas. So, over the summer, it was even more traffic and more membership benefit. So, we will sort of add gas stations wherever we can at that point. But this year has been an interesting one, to the core of your question, right, where we've made so much money in gasoline.\n\nWe've used that to spend into the beat, if you will. So, we have, you know, made our gas prices a little bit even lower than normal to showcase even more value. And then we've taken that gas profit and invested it in other places in the business. So, think about helping our members through these inflationary times.\n\nInside the business, we've used gas profits to fund investments in price inside the building. We've done a tremendous amount of incremental marketing this year that we've never done before, both trying to incent purchasing behavior, but also acquiring new members as we go. And it's allowed us a tremendous amount of freedom to test things that we've never done before without sort of economic consequences, if you will. And that's been the aim, you know, for years, right? You've heard of both of my predecessors talk about spending into the beat, and it's something we'll continue to do, whether we're beating inside the box or in gas or anywhere we do.\n\nIt's sort of a core part of our strategy and dovetails nicely with when you're trying to show value to the members every day.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nYeah, very smart. My follow-up question is just on the comp, and I'm just wondering if you could maybe unpack the acceleration on a three-year basis from the second quarter to the third quarter, which it looks like it's about 300 basis points? And then looking ahead, if you do, say, a 4.5% comp in the fourth quarter, that implies a real big drop sequentially relative to the third quarter, close to about 1,000 basis points. So, just curious like the decision factors behind that comp assumption for 4Q.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah, it's a good question. Maybe I'll start, and Laura can pile on. You know, we had a tremendous quarter, in our view, in the third quarter, far exceeding what we've -- what we thought. There was a little bit of inflation.\n\nSo, inflation definitely ticked up 3Q over 2Q. Not a tremendous amount, but certainly was there, and it was continued acceleration in our members' purchasing behaviors. You know, when we started this year, we thought 3Q would be negative comp given what happened last year. And I mean that in sort of the EBT funding sense, the kind of government stimulus sense, and the behavior change we saw in 3Q last year was a dramatic pull forward of primarily our sundries business, but some of our -- the rest of our grocery business as well.\n\nAs we've gone through the year, one of the best things that we've seen is the increases in shopping behavior in all of our income cohorts, as I talked about earlier, but most notably at the bottom of the house. You know, in our past data, we've seen a great linkage between increases and decreases in federal EBT budgets and what those folks actually did. So, in times where budgets contracted, their shopping behaviors contracted. We have not seen that this year.\n\nAnd, you know, as I said earlier, the sales per member and trips per member in each of our cohorts has gone up. I think that's a tremendous story about value. I think we have convinced that lower-end consumer of our proposition, and they are using different dollars today than what they get from the government because they believe our value story. They believe that we are saving them money.\n\nAnd we are. So, that, I think, is really the real story behind the third quarter performance. It was over our expectations, for sure. I don't know that that slows down in 4Q.\n\nBut, as our competitors have noted and I talked about earlier, our GM performance was a little bit soft in the third quarter, and you've got a tough market out there, and GM becomes a bigger piece of our business in the fourth quarter. So, you're absolutely correct. The guidance that we've got out there, you know, comps in the four to five range for 4Q would imply a decent decel. I hope that doesn't happen.\n\nWe'll see what we end up with. We're certainly working hard to do what we can from our general merchandise business, and we will capitalize on the great health of our grocery business. That business we have no issues. And it's comping quite nicely.\n\nAnd, you know, our performance has been good here in the opening weeks of 4Q as well. You know, a lot of that is market share, right? We've been gaining market share all year long, both in gas and in our grocery business. And I don't see that, you know, slowing down at all. The other point I might throw out there which factored into our thinking was we're going to start lapping some of the inflation we saw last year.\n\nSo, you're going to have a little bit of a base effect coming on in 4Q. But we are very bullish on our prospects in 4Q. I think we'll do well and hopefully do well in the next year as well.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nGreat. Thanks a lot. Happy Thanksgiving.\n\nBob Eddy -- President and Chief Executive Officer\n\nYou, too.\n\nOperator\n\nThe next question comes from Mark Carden from UBS. Mark, your line is open. Please go ahead.\n\nMark Carden -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my questions. So, to start, just given the current inflationary environment and what your two largest warehouse competitors have done to date, has there been any changes to how you're thinking about the pacing for your next membership fee increase? Thanks.\n\nBob Eddy -- President and Chief Executive Officer\n\nHi, I'm Mark. Thanks for being on the call today and thanks for the question. You know, we haven't given a tremendous amount of thought to a fee increase at this point for two reasons. One, our largest competitor hasn't done it yet, and we would not do it unless they do it.\n\nAnd two, we talked about the co-brand transition. That is the most important thing we will do next year, is get that right. And I don't want to mess that up with a fee increase. And so, I think, at a minimum, we're waiting until both of those two things happen.\n\nAnd, you know, once they do and the sort of the smoke clears, we'll figure out what we will do. You know, the one thing we haven't talked about so far is the dollars per member we're seeing. Already, over the past few years, we've already seen the effect of a fee increase, right? The average dollars per member is well over 60 bucks at this point. It's up about $5 in the last few years.\n\nSo, we've mixed our business up to really look like it has had a fee increase when we haven't changed the sticker price to our members. So, it's sort of an unappreciated thing that we've been able to do over the past few years. And our membership team has done a fantastic job doing that.\n\nMark Carden -- UBS -- Analyst\n\nThat makes sense. And maybe a bit of a follow-up to that. How are you thinking about premium penetration in the current environment? Today, it seems like you have a lot of momentum there. But would you expect shoppers to upgrade less frequently if some of these current economic pressures continue with just getting thicker shock, if the market upgrades any more aggressively? Just how are you thinking about that?\n\nBob Eddy -- President and Chief Executive Officer\n\nI think that comes back to value, and we look to provide outstanding value every day. It also comes to one of the core reasons we're doing the co-brand transition, right? That is -- that has been the fastest-growing part of our premium-tier memberships over the years. And with the new value prop that we'll announce in January, we only expect that to get better. So, as Bill mentioned, we'll probably pause on the growth in Q4 given the federal laws around what we have to do around a card transition, we have to stop acquiring and sort of have to put down our pencils for a little bit.\n\nBut once we get the conversion done, I expect that the excitement around this program will really help us grow premium-tier memberships quite nicely in the future.\n\nMark Carden -- UBS -- Analyst\n\nGreat. Thanks so much and good luck.\n\nBob Eddy -- President and Chief Executive Officer\n\nThanks, Mark.\n\nOperator\n\nThe next question comes from Rupesh Parikh from Oppenheimer. Rupesh, your line is open. Please go ahead.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood morning. Thanks for taking my question and also congrats on a nice quarter. So, just on the food inflation front, as you guys look out for the balance of the year and into next year, it sounds like you expect moderation. Any sense, whether it moderates to, you know, I guess, low-single-digit-type levels or just any thoughts in terms of how you see it playing out at this point?\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Thanks, Rupesh. It's a good question. I'm not sure I have a perfect answer.\n\nWe've certainly seen a ton of inflation this year, as everybody knows. And we have seen a little bit of moderation in the third quarter, as Laura talked about in the prepared remarks. It's really coming in pockets, but I would tell you, on a general basis, we're seeing less inflation today than we were seeing three months ago, for sure. I don't know what happens from here.\n\nYou know, as we talk to our supplier partners, they continue to indicate their desire to raise prices, particularly those with very strong brand names or market shares. And, you know, some of the commodities are still above where they were last year. And I don't know that folks have passed through all of that increase. So, I think, you know, we've got a wait-and-see approach on it.\n\nWe are working proactively with our supplier partners to avoid any further price increases. And I think it's -- as you know, it's bad for that for everybody. So, we'd like to forestall that, but I'm not sure we're going to be successful. And we will continue to do what we've done all year and invest in price, make sure we have the right value.\n\nAnd, you know, we won't let anything stand in the way of that. And I'd be remiss if I didn't thank our merchandising team for what they've done this year. I think they've done an outstanding job managing double-digit inflation in an environment that many of us haven't really lived through in the business sense in the past. So, our team has done well.\n\nWe'll continue to do those things well going forward. And, you know, whether we see, you know, 10 points more inflation or two points more inflation, I think the company is really well set up to grow.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. And then maybe just one follow-up question, in regards to next year, you know, I know you guys have the big headwind related to fuel. Was your commentary earlier that you hope with some of the margin headwinds that you'll be lapping next year that maybe -- between the headwinds and, you know, that may become tailwinds that could help to make, you know, fuel neutral from an EPS perspective? Is that what you were trying to convey earlier?\n\nBob Eddy -- President and Chief Executive Officer\n\nRupesh, I don't think we will be able to get back to flat, right? We've got a tremendous gas tailwind this year. We've got other headwinds this year that we've talked about. And some of them are almost the same thing, right? I think about the cost of diesel fuel running through our supply chain. You know, we've got both headwinds and tailwinds in this year, but the gas income headwind has been bigger than any other tailwinds, right? So, as we think about next year, it looks hard to create that same level of gasoline income next year.\n\nThat doesn't mean we won't have some of these headwinds flipped to tailwinds, right? If diesel goes down, we will have a tremendous tailwind next year from a margin perspective. There are other things under the covers as well that should help. But at this point, as we're modeling next year, we do not see us getting back to our full year EPS that we'll put up this year. I don't think we'll be too far away from it either.\n\nBut I don't see us getting flat at this point.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nOK, great. Thank you for all the color.\n\nBob Eddy -- President and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nThe next question comes from Paul Lejuez from Citi. Paul, your line is open. Please go ahead.\n\nBrandon Cheatham -- Citi -- Analyst\n\nHey, everyone, this is Brandon Cheatham on for Paul. I'd like to go back to the commentary about the, you know, income cohorts. It sounds like your low-income consumer was particularly strong in 3Q. And I think that's a change from the second quarter.\n\nYou know, I think you all said the higher-income consumer was really the bright spot. So, I'm just wondering, you know, did you see kind of an inflection in the lower-income consumer cohort behavior? You know, are you gaining more share of wallet? That's kind of what it sounds like. But any category or anything that you all are doing or communicating that kind of really drove that inflection.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Good morning, Brandon. Thanks for that question. You know, we've seen growth in all of our [Audio gap] this year, as we've talked about.\n\nYou know, the beginning of the year, we were seeing a ton of higher-income folks come into the business or buy more. We are still seeing that. We're also seeing good purchasing behavior out of our lower-income cohorts. And that's been the real story for us, right? In every other down market, we've seen the higher-income cohorts come in and try and search for value.\n\nAnd as I talked about earlier, we're seeing lower-income cohorts sort of trade out or trade down as EBT budgets dried up. That certainly has not happened this year. They have performed very, very well and continue to. And I think they will continue to.\n\nSo, we're very happy with how we see our purchasing behaviors going. Both higher- and lower-income cohorts are showing us very healthy behaviors, and we're looking forward to that continuing. I think the reason why they're scratching after is value, right? We are showing the best pricing that we've ever shown to folks. We're showing better prices than some of our competitors.\n\nAnd people are believing it. We've got some credibility with our members as we continue to prioritize value in everything we do. So, we'll continue to do that, and hopefully, they continue to reward us.\n\nBrandon Cheatham -- Citi -- Analyst\n\nGot it. And one follow up, if I may, on digital sales, you know, seems like a meaningful driver of comp these days. Anything different about how the consumer engages with you? You know, what percentage of your members are shopping with you digitally? And is there anything to call out on the margin side from, you know, the digital sales business? Thanks.\n\nBob Eddy -- President and Chief Executive Officer\n\nYeah. Thanks for bringing that up. We haven't talked about digital all day. It's been a growing part of our business over the years.\n\nIf you remember the longer-term story, you know, four years ago or so, we didn't really have a digital business to speak of, and we've spent a bunch of time building the infrastructure. And lo and behold, now, we're well over $1 billion and sort of [Inaudible] of our business. You know, our members are really reacting to that, most particularly in the BOPIC and curbside parts of our business, where we're really saving them time, right? Our aim is to save people -- so to save people money. You know, we keep going back to value.\n\nBut it's also to save our members time. If I can, you know, have them not spend time walking around our clubs, throwing things in their basket for their routine shops, that's great. We still want to get them in the clubs for their opportunistic shops. But we've not seen that behavior fall off either.\n\nWe have, you know, done things like our express pay products, where you can skip the lines. If you are in our clubs, you check out on your phone. That saves you 10 minutes. It's been pretty popular.\n\nWe've also changed the way that we market and promote from a digital perspective. So, a huge amount of our member acquisition is now coming digital, whereas three or four years ago, I would tell you that was a zero or close to it. And, you know, five years ago, we were worried about the fact that our primary promotional product was paper coupons and, you know, nobody loves paper coupons. So, now, well over two-thirds -- I think maybe three-quarters of our promotion is done digitally.\n\nYou click your coupons on our app or online versus clipping the paper. So, we've made tremendous strides both in product promotion and convenience as we've invested in digital. And we'll continue to do that. The members that engage with us digitally are our best members.\n\nThey shop with us most often. They buy more when they do so. And they -- you know, they really are starting to prove the case to us on the combination of saving people time and money. And, you know, both of those are important parts of the value equation for our members.\n\nSo, we'll continue to make investments in our digital properties. And I believe that our members will reward us for doing that as well.\n\nBrandon Cheatham -- Citi -- Analyst\n\nAppreciate it. Good luck with all that.\n\nThanks, Brandon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCathy Park -- Vice President, Investor Relations\n\nBob Eddy -- President and Chief Executive Officer\n\nLaura Felice -- Chief Financial Officer\n\nMike Baker -- D.A. Davidson -- Analyst\n\nEdward Kelly -- Wells Fargo Securities -- Analyst\n\nBill Werner -- Executive Vice President, Strategy and Development\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nMark Carden -- UBS -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nBrandon Cheatham -- Citi -- Analyst\n\nMore BJ analysis\n\nAll earnings call transcripts"
}