{
  "companyName": "Sleep Number Corp",
  "companyTicker": "SNBR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/sleep-number-corp-snbr-q3-2022-earnings-call-trans/",
  "content": "Sleep Number Corp (SNBR -1.70%)\nQ3 2022 Earnings Call\nOct 26, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to Sleep Number's Q3 2022 earnings conference call. [Operator instructions]. Today's call is being recorded. If anyone has any objections, you may disconnect at this time.\n\nI would like to introduce Dave Schwantes, vice president of finance and investor relations. Thank you. You may begin.\n\nDave Schwantes -- Vice President, Finance and Investor Relations\n\nGood afternoon, and welcome to the Sleep Number Corporation third quarter 2022 earnings conference call. Thank you for joining us. I am Dave Schwantes, vice president of finance and investor relations. With me today are Shelly Ibach, our chair, president and CEO; and David Callen, our chief financial officer.\n\nThis telephone conference is being recorded and will be available on our website at sleepnumber.com. Please refer to the details in our news release to access the replay. Please also refer to our news release for a reconciliation of certain non-GAAP financial measures and supplemental financial information included in the news release or that may be discussed on this call. The primary purpose of this call is to discuss the results of the fiscal period just ended.\n\nHowever, our commentary and responses to your questions may include certain forward-looking statements. These forward-looking statements are subject to a number of risks and uncertainties outlined in our earnings news release and discussed in some detail in our annual report on Form 10-K and other periodic filings with the SEC. The company's actual future results may vary materially. I will now turn the call over to Shelly for her comments.\n\nShelly Ibach -- President and Chief Executive Officer\n\nGood afternoon and thank you for joining our third quarter 2022 earnings call. My SleepIQ score was 77 last night. Our purpose, combined with our culture, individuality and well-being are competitive strengths. They drive high team engagement, best-in-class commitment and effort to perform.\n\nThese attributes are essential in this challenging macro environment. Today, we'll provide an update on how macro and supply challenges are pressuring our 2022 results and the factors causing a shortfall to prior expectations. We'll also describe actions we're taking to reduce cost in this inflationary environment, preserve our balance sheet flexibility, navigate supply constraints and strengthen demand. And I'll highlight how we're sustaining strong brand health and judiciously prioritizing strategic initiatives that will enable us to outperform as the environment improves.\n\nExternal business conditions worsened in the third quarter, which had a direct implication for our results and outlook. Third quarter net sales were $541 million, a decline of 16% from 2021 because of constrained supply of semiconductor chips and consumer sentiment near record lows. Q3 operating profit was $13 million, reflecting significant gross margin pressure with operating expenses down $27 million. Third quarter earnings per diluted share were $0.22 better than we previously guided with the additional pressures.\n\nWe expect the consumer environment to remain challenging for the balance of the year and into 2023. In addition, several years into the pandemic single-threaded global supply chain built for specialization and cost optimization remains fragile and easily destabilized by events as simple as an equipment failure or as significant as the geopolitical shock, COVID lockdown or natural disaster. With global inventory of semiconductors depleted, uneven and interrupted ship flow continues to affect fleet number delivery timelines and volume, operating efficiency and forecast. Based on these ongoing pressures, we have revised our 2022 EPS outlook to $1.50 to $2.\n\nOur strong balance sheet enables us to operate effectively through this volatility while also maintaining our long-term focus. Additionally, we are taking deliberate steps to reduce further cost and preserve future financial flexibility in this operating environment. David will provide more financial details in his remarks, but first, I'll share the actions we are taking to improve demand as we navigate the constrained and uneven flow of semiconductor chips from our supplier. Our demand in Q3 was down 16%, which was lower than expected as consumers purchase closer to need, [inaudible] an elongated consideration and favor extraordinary value.\n\nWe also believe that operating without our full assortment of products and long lead times are hampering demand. In this environment, our actions have produced mixed results. For example, we had strong results over the Labor Day weekend when consumer needs were the highest, but experienced weaker-than-expected results both before and after the holiday. Here is what we have learned.\n\nOur econometric model continues to be an important tool. It suggests that the low consumer sentiment and mattress category variables indicate a 15% headwind. While the consumer is understandably cautious in the current economic environment, our brand health remains very strong, and our customer loyalty is stellar. Digital traffic is near prior year levels, down 2%, but the consumer is slow to take additional steps leading to purchase.\n\nTherefore, we've focused on actions such as significant value offers, referral and repeat sales and communicating our strong health and wellness benefits to drive potential customers deeper into the purchase funnel. Because we have not been able to procure enough semiconductor chips, one of our headwinds is our inability to offer customers our good and better assortment of FlexFit adjustable smart bases. As the macro environment has deteriorated, we took shortage implications on our product offerings and the delivery timing limitations have had an adverse impact on the efficiency and effectiveness of our demand actions. With our balance short- and long-term focus and guided by our purpose, we continue to prioritize life-changing Sleep innovations that position us to generate renewed demand growth once conditions improve.\n\nOn October 4, we introduced the greatest innovation in our history, the Climate360 smart bed, which we presold to our smart sleeper community. While Climate360 represents, as expected, a small part of our overall portfolio, we're really excited to see the early sales of the smart bed. Climate360 addresses being too hot or too cold during sleep with active cooling and heating. This is meaningful as 80% of couples say one of them sleeps too hot or too cold.\n\nIn addition to warming your feet to help you fall asleep faster, this innovative smart bed uses ambient air to create a personalized microclimate. It is designed to work with your body's natural sleep cycles to balance your temperature for deeper, better sleep. Remaining focused on innovation that improves quality sleep even as we take deliberate actions to address near-term weakness in demand is what sustains our strong brand health and smart sleeper engagement. We have almost 2.4 million active smart sleepers engaging with our smart beds, representing over two billion sleep sessions and more than 17 billion hours of longitudinal sleep data.\n\nOur monthly average user engagement with the sleep health features of our smart bed remains near all-time highs. With Climate360, we implemented our new smart bed platform with technology that will support our entirely new portfolio. We expect to fully transition to this new smart bed platform starting in Q2 2023. Importantly, our newest smart beds are designed with fewer components.\n\nAnd they utilize newer, more readily available semiconductor chips. These innovations are critical to our ability to move beyond the persistent supply chain disruptions caused by current chip inventory issues while also driving demand. Our teams are tenacious in their pursuit of solutions that improve demand, margin and supply. With the expected chip flow in December and into 2023, we plan to restore our good and better assortment of FlexFit smart -- excuse me, FlexFit smart adjustable bases in January.\n\nBy the end of this year, we will achieve a major milestone with the completion of our multiyear journey to 100% preassembled smart beds. Next year, we will continue to improve rapid recovery when there are changes to customer orders and advance efforts to reduce the supply chain inefficiency. Improving our gross margin rate is a key initiative for 2023 and beyond. Our purpose to improve the health and well-being of society through higher-quality sleep inspires our team every day, to navigate the difficult business conditions precipitated by the current macro environment.\n\nTheir adaptability, resourcefulness and unrelenting persistence are remarkable and greatly appreciated. We continue to prioritize actions to navigate the current external challenges while pursuing significant, strategic long-term opportunities. We are strengthening our brand and competitive moats, delivering compelling value to consumers, pioneering new life-changing sleep innovations and advancing our potential for future profitable growth as the economy recovers. Now David will provide additional detail on the third quarter and outlook for the remainder of the year.\n\nDavid Callen -- Chief Financial Officer\n\nThank you, Shelly. Macro pressures intensified in Q3 on all three fronts: demand, chip supply and COGS input costs. As a result, we further reduced our 2022 EPS expectations to a range of $1.50 to $2. Specifically, demand [inaudible] in Q3 to down 16% versus last year, despite a solid Labor Day.\n\nCurrent performance reflects a more reluctant consumer with a strong preference for value offerings, which negatively affected mix and margin. We now expect Q4 demand to be down mid-teens year over year and have reflected this in our updated EPS guidance. Chip supply expectations for Q4 also worsened. About 15,000 ships from one supplier are now expected to come too late to support Q4 deliveries, which will be constrained to about 90,000 to 95,000 smart beds.\n\nAs a result of the assumed changes in demand and ship supply, we now expect less backlog benefit in 2022 back half net sales. While our backlog is primarily dependent on the timing and volumes of demand and supply, it is also subject to disruptions like weather and labor availability. Our revised guidance assumes back half net sales approximately $80 million less than our previous call assumption with about half each from lower demand and less backlog service. COGS input costs were also higher than expected as we prioritized customer experience and value.\n\nThis results in expedited freight to pull forward chip receipts to the earliest possible date, brokerage part premiums, unfavorable mix and inefficient operations from uneven ship flow. As a result, gross margin in the back half of 2022 is expected to be about 56% or 200 basis points lower than the first half and our previous expectations. As we wrap up a challenging 2022, we are reducing operating expenses of about $150 million versus plans across all areas of the business. About 40% of these reductions are variable costs, primarily in selling, media and financing.\n\nAbout 30% come from structural reductions and suspension of lower ROI initiatives, and about 30% are from lower companywide incentive program costs. Specific actions include the pausing of lower priority strategic brand support, significant reduction in professional services and consulting work, outsourced staffing and targeted resource support cost reductions across the business. We are working additional contingencies as we continue to consider further cost reductions in this uncertain environment. Let's take a deeper look into our Q3 financial results.\n\nSemiconductor chip supply constrained Q3 deliveries for the fourth consecutive quarter. This, combined with 16% lower year-over-year demand, resulted in net sales of $541 million, a 16% year-over-year decline. However, the 106,000 smart beds delivered in the quarter was 5,000 more than our internal forecast though our ARU was seven percentage points below our internal forecast. Our third quarter gross margin of 56.1% was down 490 basis points versus the prior year.\n\nThis is the result of 17% lower delivered smart bed volume, inefficient chip flow and lower mix. Grappling with both insufficient and uneven ship flow as we prioritized customer experience, drove elevated use of air freight, systemwide expediting costs, inefficient labor utilization and high-cost brokerage electronic parts to fill supply gaps. Clearly, we are not satisfied with our margins this year. Over time, we expect to drive demand and margin with our game-changing new innovations, claw back about 30% of the $160 million to $170 million of annualized input cost pressures and be more efficient through our move to 100% fully preassembled beds and level-loaded operations enabled by improved chip supply and flow.\n\nOperating expenses of $290 million were down $27 million versus the prior year and 60 basis points better than forecast as a percent of net sales while absorbing unfavorable customer financing costs and less efficient media. Selling, G&A and R&D costs were all favorable to forecast due to spending controls and lower incentive compensation. Innovation initiatives are on track, including the on-time launch of our Climate360 smart bed and preparation for our latest upgrades to our full line of 360 smart beds in the first half next year. Net operating profit of $13 million in Q3 was 2.3% of net sales as cost controls partially offset the pressures on cost and sales from disruptive chip supply.\n\nOur $0.22 of Q3 earnings per share exceeded our guidance for breakeven profits as expense controls and higher-than-expected smart bed deliveries more than offset higher-than-expected COGS pressures. We generated $80 million in cash from operations year-to-date despite the macro pressures on our business. At the end of Q3, we had more than $410 million of liquidity available under our credit facility. After four consecutive quarters of disrupted chip supply, we ended Q3 with debt leverage of 3.99x EBITDAR.\n\nWhile our forecast and revised guidance indicate our leverage will remain below 4.5 times EBITDAR, we proactively increased our leverage covenant to five times through the first half of 2023. This facility amendment provides additional cushion to navigate current disruptions and was prudent given continued macro uncertainties. We are building our financial plans for 2023 and will provide insights on our fourth quarter earnings call. In the meantime, here are some top-of-mind broad assumptions as we contemplate next year.\n\nWe are taking actions on cost and liquidity to ensure we thrive on the other side of current macro constraints on the business. Consumer sentiment is likely to be pressured at least through the first half of next year. We expect improved chip supply next year based on our move to new products and early data exchanges with key third tier chip suppliers. Pursuit of sleep-improving innovations continues to be a top priority.\n\nWe expect to introduce our new line of 360 smart beds late in the first half, progressing the opportunity for sleep health and wellness insights based on sleep data available nowhere else. And while we are taking actions to improve performance and margins while reducing cost structure, incentive comp program costs and interest costs will be headwinds in 2023. Our long-term strategic initiatives are intact to enable breakthrough growth and profits as macro pressures subside. We continue to aggressively navigate near-term risks as we pursue long-term opportunities to drive outsized performance as we improve lives with proven quality sleep solutions.\n\nOperator, please open the line for questions.\n\nOperator\n\n[Operator instructions]. Your first question comes from the line of Brad Thomas from KeyBanc Capital Markets. Your line is open.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nHi. Good afternoon. Thanks for all the detail and thanks for taking my question. I wanted to first start off with just a question around the backlog and hoping you could provide a little more color around where that is today in dollars.\n\nI think if my notes are accurate, you were at about $110 million last quarter. So just wondering where you are today, what the guidance range contemplates in terms of where you'll be at the end of the year? Thanks.\n\nDavid Callen -- Chief Financial Officer\n\nSure, Brad. Glad to provide additional color. We ended this quarter with about $100 million of net sales equivalent excess backlog. Where we go from here is dependent as I've tried to communicate on a number of factors, primarily the timing and volume of sales and the timing and volume of deliveries.\n\nAnd -- but can also be affected by things like weather, as we saw with Hurricane Ian in Q3 had a little bit of an effect on deliveries in Florida. And then labor availability is always -- it can be a constraint as well. But that's how we're thinking about it right now, and we'll keep you updated as we go through the year.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nAnd then, David, could you just remind me, that's the net unusual elevation in level versus a normal backlog. So, whatever you end this year at, there's still the potential that you have more that could be a benefit to sales in 2023 by that magnitude. Is that right?\n\nDavid Callen -- Chief Financial Officer\n\nYes, that's exactly right, Brad. And on the previous call -- on the last call, we had indicated that we have -- we were expecting an improvement in our flow and total chips available for Q4 that would help us with about 15% to 20% more deliveries in Q4 than in Q3. That didn't happen. And so, as a result, we're expecting less backlog benefit in the fourth quarter or in the back half in total.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nGreat. Real estate, sitting here with the demand trends tracking where they're tracking. Can you talk a little bit about what you're doing in terms of lease signings and how you're thinking about 2023 at this point?\n\nDavid Callen -- Chief Financial Officer\n\nWell, we are, as always, very happy with our market expansion initiatives. And the payback on our store investments continue to be very, very fast. And we still are finding great opportunities in the marketplace. We haven't put together our full plan for 2023 at this point, Brad.\n\nWe'll provide you some additional insights on the Q4 call. We are, of course, being appropriately conservative in the sense that we want to drive as much business through existing stores as we can. And -- because comp sales are always more profitable than new store sales. But at the same time, that's a lever that we'll continue to invest in as one of our growth drivers over the long term.\n\nAgain, I'll provide you more specific insights for next year on the Q4 call.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thanks, David. I'll turn it over to others.\n\nDavid Callen -- Chief Financial Officer\n\nThanks, Brad.\n\nOperator\n\nYour next question comes from the line of Peter Keith from Piper Sandler. Your line is open.\n\nMatt Egger -- Piper Sandler -- Analyst\n\nHi. This is Matt Egger on for Peter. Two quick ones for me. I'm just curious if there's been any change or increase in either cancellations or conversion rate? And then secondly, I think you've talked about the plan to transition from the free -- the subscription model with your SleepIQ.\n\nJust curious what that will look like from -- maybe from the consumer perspective?\n\nDavid Callen -- Chief Financial Officer\n\nSo, I can do my best to tackle some of this, but I think you were breaking up a little bit on the last question, but I think I got it. But the first one about cancels and conversion, we have not seen any meaningful change in our cancel rates despite having longer-than-normal lead times and wait periods for our customers to get their life-changing smart beds. But that's something that we watch really carefully on an ongoing basis. Conversion rates continue to be very high.\n\nConsumers are doing a lot of research before they ever come into our stores. And our teams are great at getting them into some amazing products. And then on your comment about the subscription model, that's not something that we have rolled out yet at all. It's something that we have hinted that our future technologies give us insights that might enable something like that, but that's not something we're providing any guidance for at this point.\n\nMatt Egger -- Piper Sandler -- Analyst\n\nYes. Appreciate it. I guess I was just curious what that might look like if you decided to go down that route?\n\nShelly Ibach -- President and Chief Executive Officer\n\nSure. Well, you may be referring to us moving to our new platform, which enables broader capabilities, including diagnostics and monitoring. And that opens the door for a subscription in different ways. And so that's a future opportunity for us for sure.\n\nMatt Egger -- Piper Sandler -- Analyst\n\nThanks again.\n\nOperator\n\nYour next question comes from the line of Bobby Griffin from Raymond James. Line is open.\n\nBobby Griffin -- Raymond James -- Analyst\n\nGood afternoon. Thanks for taking my questions. Hey, everyone. David, I guess the first question is just you guys overdelivered on units versus the internal guide by 5,000, 6,000 or so, but then we're hearing that the chip constrains got worse.\n\nSo just help me connect that aspect of overdelivering versus the guide on units to us probably implies things got a little better. But just going forward, it looks like it didn't, can you help connect that?\n\nDavid Callen -- Chief Financial Officer\n\nAbsolutely, Bobby. So, there are two different things we're talking about. It's relative to what we were expecting in terms of smart bed deliveries in the third quarter. We got about 5,000 more beds delivered in the quarter than what we had thought we were going to be able to get out.\n\nAnd that's the slight improvement in the third quarter. And I'll just take a second to just emphasize, and that drove $0.22 of earnings, which is a pretty remarkable reminder that the leverage of this business model when we get just a small incremental benefit of more units through the model, just how much more profitable it gets because I had guided -- provided color that we were expecting to be about breakeven for the quarter. So just keeping that in mind. Now let's turn to Q4 expectations.\n\nAs I said on my Q2 call comments, we were expecting enough chips and the flow of those chips, the timing of that flow of chips to be early enough in the quarter to get 15% to 20% more deliveries out the door in Q4. The reality has turned that that's not going to happen, that the chips that we're getting are coming too late in the quarter, about 15,000 of them, in fact, are coming too late in December for us to be able to get all the deliveries out the door that we were expecting previously. So that's what we were talking about the -- we got a slight improvement in Q3 and worse outlook for Q4.\n\nShelly Ibach -- President and Chief Executive Officer\n\nAnd Bobby, for -- being in the situation of having no inventory of chips, the flow of chips is everything. And we're -- we have worked 24/7 on trying to get incremental improvements, even the smallest improvement. And we made some headway, but not the headway we needed to. Now sitting where we are, it's backloaded in the fourth quarter.\n\nIt does set us up, and we'll actually have enough chips to be able to bring back the FlexFit 1 and the FlexFit 2. And those two SKUs, good and better in this environment, are really important for our smart bed system that focuses on snore and temperature benefits, etc., and also support our FlexTop, which is a really important SKU as well. So, we'll have them heading into Q1. And the commitments we have for flow in Q1 opens up the pathway for us to level load and not have the kind of inefficiencies that we have right now in the fourth quarter, which is driving this change in guidance.\n\nI mean, chips are impacting the supply, the cost and the demand right now. And we really look forward to getting beyond having this be such a barrier for us and have it been the important aspect of innovation that it was designed to be. It's still in the long run, having smart beds and having the capabilities that we do for our future. It's where we're going to deliver the superior shareholder returns, and we're very confident in that path.\n\nAnd we're also confident in our ability to work through the current situation. We're experienced as a management team. We know how to do this. We'll handle it, and we look forward to being in a different environment and being able to benefit from all the innovative work that we've done.\n\nBobby Griffin -- Raymond James -- Analyst\n\nThank you, Shelly, I appreciate that. And I guess lastly for me, and it's kind of a two-part question, but it relates together. David, like, if we look at this year -- and we want to try to level set the model for next year ourselves on a unit basis. The backlog, while it's still an excess, did go down this year.\n\nSo, like should we strip out some units and say like, hey, this year benefited from [inaudible] backlog delivery then kind of go from there to particular demand next year? Or how should we think about this year's unit number? And then what does the guide imply excess backlog in that this year? Is that $100 million? Is it in at $75 million or if you hit your guide it stays at $100 million?\n\nDavid Callen -- Chief Financial Officer\n\nWell, predicting backlog is always a challenge. And if you go back in time in the wayback machine, Bobby, we never even talked about backlog. We've been doing it since Q3 last year because of the supply challenges that we've been living with. But nonetheless, I would -- to answer your question directly, I'm not prepared to give you guidance for next year.\n\nI would say that there -- we still do expect in the current guidance to get some benefit from excess backlog in this year. It's meaningfully less than what it was before. As I highlighted, I'm expecting in the back half, about $80 million less net sales. And half of that is coming from -- and I'm talking about in the back half, half of that is coming from less backlog service.\n\nSo, as you recall on the Q2 call, I think I highlighted that we were -- we had gone from $150 million of excess backlog and net sales equivalent excess backlog down to $110 million. So, we had about $40 million in the first half and something less than what we had thought for the back half. So, we're carrying some of that access backlog into 2023. And we'll provide some additional color on '23 on the Q4 call.\n\nBobby Griffin -- Raymond James -- Analyst\n\nOK. Thank you, David. Thank you, Sean. I'll jump back in.\n\nThat's a lot. All right. Thank you.\n\nOperator\n\nYour next question comes from the line of Seth Basham from Wedbush Securities. Your line is open.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot and good afternoon. My question is really around the demand trends and the outlook. If you could give us some more color on what you think drove better demand over Labor Day? And why it has since deteriorated? And then how you're thinking about demand growth in '23, that would be great.\n\nShelly Ibach -- President and Chief Executive Officer\n\nYes. Seth, one of the behaviors that we have seen from the consumer in this difficult, low-sentiment environment is the purchase is closer to need. So, I think that really played out for the Labor Day event because we saw weakness before and then on plan of long weekend, which those are the biggest days and then weakness afterwards. So, the customer certainly purchased close to need.\n\nAnd then we also have had the various interest rate hikes on both ends of the Labor Day. And we see pressure on the consumer sentiment with that inflationary behavior and worry. And a lot of -- the traffic to the brand is less than 2% of prior year, but she's not coming through the purchase funnel, not -- she's not getting all the way to store traffic and purchase. There's just a much more -- much smaller base of customers doing so.\n\nAnd when we do have that deeper funnel interaction, we're driving the conversion. But this has been a really difficult environment. And then we have some additional pressures with having smart beds and having the longer lead time as well as not having our good and better FlexFit assortment with that kind of consumer environment has been difficult. And again, looking forward to bringing them back into the line in January and being able to benefit from our smart system as designed.\n\nDavid Callen -- Chief Financial Officer\n\nAnd the end of your question was about demand for 2023. We're not providing official guidance. I did provide you a couple of points that we're excited about our innovations that we're bring to bear. We're also talking about eliminating some of these headaches from the chip supply, hopefully, in 2023 with some improved chip flow and total supply.\n\nAnd -- but at the same time, we believe that the consumer sentiment will be pressured at least in the first half next year. So, we're taking all of those things into account, and we'll give you some specific color on the Q4 call.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. And just a follow-up on the demand in the quarter, third quarter, with consumers shifting their focus more to value, are you sure that your demand was meaningfully pressured by long lead times on the high-end adjustable basis?\n\nShelly Ibach -- President and Chief Executive Officer\n\nWell, I -- I mean, I think it's a factor. I'm not attributing all of it to that. And the long lead times have been across the line. Right now, we're at two to three weeks.\n\nSo, it's more balanced for sure. And the FlexFit 1 and the FlexFit 2 bases are important, absolutely, to our assortment. And we've seen a change since the consumer sentiment dropped by not having them in our assortment. And we had to take them out of the assortment almost a year ago.\n\nAnd we were -- the demand wasn't as impacted as it has been since the sentiment dropped so low.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. OK. One last follow-up question for David, just in terms of the balance sheet, looking at the changes you made to the credit line agreement with the covenant moving up to 5% for leverage. What else changed in that agreement? Did you guys have to accrue a higher interest rate for that line or anything else?\n\nDavid Callen -- Chief Financial Officer\n\nWe do -- if we -- if the leverage goes above 4.5%, I think there's an additional gradiation in the interest rate table. That's -- I think it's 50 basis points higher interest rate. [inaudible] if you go above 4.5 times leverage. The others were additional considerations for things like administrative elements.\n\nWe changed to SOFR from LIBOR, and we made an allowance for share repurchases to cover tax withholdings for employees that are acting on option exercises, stuff like that. So, it's a de minimis amount of shares that are covered for the sake of our employees -- our team members. Those are about those big primary things. There's also a placeholder bucket that we put in place for the potential if we were to go after an acquisition, we want to make sure that we had a placeholder in there for that.\n\nThank you.\n\nShelly Ibach -- President and Chief Executive Officer\n\nSeth, one other add on the demand that may be helpful in Q3 is the category, the mattress category was quite pressured on organic search down 16%. So, the category was certainly pressured. We had stronger digital traffic to our brand, but you can see the entire category did.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nUnderstood. Thanks again.\n\nShelly Ibach -- President and Chief Executive Officer\n\nThanks, Seth.\n\nOperator\n\n[Operator instructions]. Your next question comes from the line of Atul Maheswari from UBS. Your line is open.\n\nMichael Lasser -- UBS -- Analyst\n\nThis is actually Michael Lasser on behalf of Atul Maheswari. My first question is on the supply chain piece. Many -- there's been many indications that the global supply chain has been improving as of late, especially for those that have been negatively impacted by it. Why do you think your impact from the supply chain is getting worse when others are getting better?\n\nDavid Callen -- Chief Financial Officer\n\nWell, Michael, I think what we are talking about is limited to one specific thing that is semiconductor chips. The supply of virtually everything else we -- the components that we need for our product, we have ample supply for. Supply of semiconductor chips continues to be a problem for most everybody that I'm reading about anyway. And our supplier isn't our direct supplier, they're a third-tier supplier.\n\nAnd so, we've established relationships with them. We are exchanging data on a regular basis, having regular multiple calls per week with a third-tier supplier because this has been so important. And frankly, they've been a good partner. They're trying to help us, but they're managing their way through some challenging things as well.\n\nWe are starting to see some slight improvements. We got 5,000 more beds delivered in Q3, for example. And as Shelly highlighted, we are going to get some solid chip deliveries in late in Q4 that's going to enable us to bring back a couple of important elements of our product offering starting next year. And we're saying that we see 2023 chip supply being better than what we've been dealing with here in '22.\n\nSo, I hope that frames it up for you, Michael. I think broadly, our supply chain is in pretty great shape. It's really focused on this chip supply problem that we've been dealing with.\n\nShelly Ibach -- President and Chief Executive Officer\n\nYes. I'll maybe add a couple of points, Michael. The allocation that we expected of semiconductor chips is largely on for this year. But the flow, the disruptive flow where we have inefficiency and we have gap between receipt of chips is very costly, and that has extended lead times and it has all kinds of implications and shifts delivery of units from one quarter to another.\n\nSo, it's all about the flow. And the semiconductor industry remains very fragile because it doesn't have inventory in the entire system. So, when a very small event happens like a production of an equipment failure, it could be a 10-day delay, which can result in three-month delay throughout the entire global supply chain. So, it's certainly much bigger than us.\n\nWe're a part of it because we have smart beds. And yes, [inaudible] are in a similar position.\n\nMichael Lasser -- UBS -- Analyst\n\nMy follow-up question is how does the experience of this quarter, the next quarter, the last quarter, how does that influence the long-term margin outlook for Sleep Number between 2015 and 2019? The company relatively had a 5% to 6% operating margin. Could it be lower than that because you are probably experiencing some customer disappointment, and you may have to spend a little bit more in order to win these customers back? And so, while you eventually experience the flow-through on incremental sales, it's going to take a while to get there?\n\nDavid Callen -- Chief Financial Officer\n\nWell, Michael, your premise is mistaken. Let's just start there. Our customer loyalty and brand love has been very strong according to the metrics and what we're hearing and seeing. Aside from that, just to get to your answer or to your question, we're not satisfied with where our margins are, either gross margins or NOP.\n\nFrankly, it started when we started to have these massive influxes of input cost inflation. We've called it 160 to 170 basis points -- or basis points of pressure -- excuse me, $160 million, $170 million worth of pressure annualized. And we've said that we think about 30% of those, we will be able to claw back at some point in the future. We've taken steps to offset the dollar impact of that with about, call it, $180 million worth of pricing increases on a gross basis.\n\nBut even when you do that, Michael, and you look at the math, that puts pressure of nearly 400 basis points at the gross margin line and call it, 200 basis points at the operating profit line on a rate basis, it protects the dollars but hurts your rate. Eventually, when we have full regular flow of our chip supply and consumer sentiment isn't at or near record lows, we'll continue to drive innovations and performance that delivers superior shareholder value. We are excited about where the future is. As Shelly highlighted, the innovations we're launching right now with the Climate360, the new platform that supports our new 360 beds next year, those set the stage for some pretty incredible health and wellness opportunities as we go into the future as well, which will help us drive even better operating profit rates going forward.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much. And good luck.\n\nDavid Callen -- Chief Financial Officer\n\nThank you very much.\n\nShelly Ibach -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThere are no further questions at this time. I would like to turn the call back over to the company for closing remarks.\n\nDave Schwantes -- Vice President, Finance and Investor Relations\n\nThank you for joining us today. We'll be releasing our fourth quarter results in February. Sleep well and dream big.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDave Schwantes -- Vice President, Finance and Investor Relations\n\nShelly Ibach -- President and Chief Executive Officer\n\nDavid Callen -- Chief Financial Officer\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nMatt Egger -- Piper Sandler -- Analyst\n\nBobby Griffin -- Raymond James -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nMore SNBR analysis\n\nAll earnings call transcripts"
}