{
  "companyName": "Lightspeed Commerce",
  "companyTicker": "LSPD",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/lightspeed-commerce-lspd-q2-2023-earnings-call-tra/",
  "content": "Lightspeed Commerce (LSPD -0.35%)\nQ2 2023 Earnings Call\nNov 03, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Chris, and I'll be your conference operator today. At this time, I'd like to welcome everyone to the Lightspeed second-quarter 2023 earnings call. [Operator instructions] Thank you.\n\nGus Papageorgiou, head of investor relations. You may begin. \n\nGus Papageorgiou -- Head of Investor Relations\n\nThank you, operator. And good morning, everyone. Welcome to Lightspeed's fiscal Q2 2023 conference call. Joining me today are JP Chauvet, Lightspeed's chief executive officer; Brandon Nussey, Lightspeed's chief operating officer; and Asha Bakshani, our chief financial officer.\n\nAfter prepared remarks, we will open it up for your questions. We will make forward-looking statements on our call today that are subject to risks and uncertainties that could cause actual results to differ materially from those projected. Certain material factors and assumptions were applied in respect of conclusions, forecasts, and projections contained in these statements. We undertake no obligation to update these statements, except as required by law.\n\nYou should carefully review these factors, assumptions, risks, and uncertainties in our earnings press release issued earlier today, our second-quarter 2023 results presentation available on our website, as well as in our filings with U.S. and Canadian securities regulators. Also, our commentary today will include adjusted financial measures, which are non-IFRS measures and ratios. These should be considered as a supplement to and not a substitute for IFRS financial measures.\n\nReconciliations between the two can be found in our earnings press release, which is available on our website, on sedar.com, and on the SEC's EDGAR system. And finally, note that because we report in U.S. dollars, all amounts discussed today are in U.S. dollars unless otherwise indicated.\n\nBefore I turn it over to JP, I would like to remind everyone that we will be hosting our Capital Markets Day on November 15 here at our headquarters in Montreal. For investors that would like to attend, please register by visiting the Investor Relations section of our website. With that, I will now turn the call over to JP. \n\nJP Chauvet -- President\n\nThank you, Gus. And welcome, everyone. Thank you for joining us this morning. Lightspeed reported another strong quarter today.\n\nWe delivered revenue of $184 million, ahead of our past outlook of $178 million to $183 million. Overall organic software and transaction-based revenue grew by 35%. Our GPV grew 86%, much higher than our GTV growth of 18%. And what's more, our total ARPU grew 25% to $337 per location, excluding Ecwid.\n\nOn a constant currency basis, revenue was $187.2 million representing 41% growth year over year, and our GTV was $23.8 billion representing 26% growth. Our efforts of upselling our customers on software and payments helped us deliver strong revenue performance this quarter, and we continue to see success in our target market of complex SMBs, especially among higher GTV customers. Our customer base continues to shift toward larger, more established customers that can use more of our software modules along with payments. These more complex high GTV customers tend to generate higher ARPU and show lower churn and are more likely to take advantage of Lightspeed's advanced inventory management capabilities.\n\nI believe that the results for the quarter show that our strategy of focusing on the quality over quantity of customers is working. In the quarter, we signed several multi-locations and marquee customers, including L'Osteria. With 130 restaurants in Germany and expanding across Europe, L'Osteria offers authentic Italian cuisine to its many customers. They have signed for our flagship product, Lightspeed Restaurant with Payments, in all of their German locations and will soon be rolling out to European countries.\n\nSpa L'Occitane, a five-star resort and spa in France, will adopt our flagship Lightspeed Restaurants and Payments. The Consulate, a French casual fine dining restaurant in Manhattan's Upper West Side, chose Lightspeed for our robust analytics and reporting capabilities; and Anheuser-Busch InBev selected our headless e-commerce solution to their mobile offering to merchants across their Southern American operations. A California food retailer with 53 locations will be using our flagship Lightspeed retail offering along with payments. Although the macro environment impacted our business, it encourages me to see that in the areas that we control, we are performing well.\n\nOur new flagship products are being strongly received by customers globally. Payments adoption continues to increase, and our go-to-market teams are showing very good progress at both upselling our existing customers and focusing on adding the right new customers to the Lightspeed family. The macroenvironment does present its challenges, but it also presents opportunities. Our customers are facing unprecedented conditions.\n\nInflation is putting upward pressure on price and squeezing profit margins. Staff shortages are making it harder to operate a business and properly serve customers. The threat of a recession is making consumers more cautious about their spending habits, and the omnichannel expectations consumers developed during the COVID pandemic made operating a small business more complicated than ever. Meanwhile, many in the SMEs are still stuck with dated legacy systems, incapable of addressing the challenges they face.\n\nI believe this presents a unique moment in time for Lightspeed. Given the various challenges pressures on SMB customers, the only way out is to leverage technology. The Lightspeed cloud-based commerce platform can help SMBs to operate with fewer employees by automating time-consuming and mundane tasks, better manage their inventory, understand which menu items drive profitability and repeat business, serve customers through in-store and online channels, and accept and process payments in person or online. But to continue to help our customers, we, as a business, need to execute effectively.\n\nThis means meeting our short-term and long-term goals. Between now and the end of our fiscal year, I have three key goals. The first is to finish integrating our acquisitions into one company with one brand and two core product offerings globally, a project we have internally labeled as One Lightspeed. The second is to drive payments adoption across as many customers and new and existing as possible.\n\nAnd the last is to position the company to reach profitability. Reaching our goal of One Lightspeed is very important to me in this organization. We are currently selling various platforms in various markets around the world. This adds unnecessary complexity and cost to our organization and hinders our go-to-market momentum.\n\nBy the end of our fiscal year, we expect to largely be selling only two flagship products globally, Lightspeed Retail and Lightspeed Restaurant, which we believe are the most powerful, modern, and comprehensive offerings in the market today. Being a unified company with two flagship offerings lets us reduce our complexity, improve our go-to-market momentum, and deliver stronger financial performance. Payments will also continue to be a priority. Although I'm encouraged by our progress since launching this offering three years ago, there is still much more to do.\n\nPayments is now available in all of our major markets, and we're doing very well at selling it to new customers. Our focus now is to get as many of our existing customers on to payments as possible. We've launched several initiatives to make it happen, and I personally continue to motivate the teams to advance our payments offering to more and more customers. Finally, as an organization, we continue to strive toward profitability.\n\nEven with the macroeconomic environment presenting its challenges, we remain focused on profitable growth. By upselling our customers, expanding payments, and adding the right customers to the Lightspeed family, we believe we can improve our unit economics, which is a foundation for reaching profitability. We will continue to invest in our business, but reaching profitability will remain a priority for this company. I'll now turn it over to Brandon and Asha to go into more details, and we'll wrap it up before we go into Q&A. \n\nBrandon Nussey -- Chief Operating Officer\n\nThanks, JP. I'll speak briefly about some of our main operational focuses at this time. As you heard from JP, adoption of payments remains one of our top priorities, and we made good progress there again this quarter. Payments provides us with a more complete customer experience, is an important driver for our path to profitability, and is a major growth area for us.\n\nWe are fortunate, particularly during challenging times in the market to have the white space we do within our existing base of customers. Our GPV in the quarter was $3.7 billion, up 86% from the prior year. But with over $20 billion in total GTV this quarter, we still have significant opportunities ahead. As many of you know, we first launched payments to our retail customers in North America.\n\nWe now have our payment solutions available in our international markets and across most of our products. And as I mentioned last quarter, with that now in place, we are doubling down on our efforts to increase adoption of Lightspeed payments. The results have been encouraging so far. This quarter, we saw the number of payment sales in hospitality outpaced our more mature retail product vertical, and we saw our markets outside of North America represent close to half of our total payment wins this quarter.\n\nThis is encouraging early progress and is a main contributor to our increased amount of GPV. We continue to believe that the timing is right for this initiative with uncertainty looming for our customers. Having payments and point of sale together and a streamlined workflow becomes more compelling to them, helping them save time and money and freeing them up to focus elsewhere. Payments also helps us unlock other financial services opportunities.\n\nOne of those is Lightspeed Capital. While still modest in overall dollars, Lightspeed Capital has been growing nicely, and we are seeing this as a valuable part of our portfolio. We now have made capital available to eligible customers in both our retail and hospitality verticals in the United States, Canada, and Australia, with more markets to follow. Total revenue and gross profit from Lightspeed Capital is up more than 200% year over year, with the number and amount of advances made in the quarter more than doubling year over year.\n\nAt the end of the quarter, over $12 million in advances were outstanding with minimal default losses from customers incurred to date, reflective of our quality customer base. We expect to see Lightspeed Capital continue its growth path, and we'll continue to manage this sensibly with the current market context in mind. Finally, we are closely managing our operating expenses. It's clear that the macroeconomic environment is impacting our end markets.\n\nAnd while we remain confident in our business model and long-term prospects, prudent management of our operating expenses is important during these times. We have taken and will continue to take a very disciplined approach to opex, ensuring that our spend is directed at only the highest ROI areas. We have already adjusted hiring plans to this effect across the business. We are seeing the synergies from recent acquisitions and have been able to reduce our spending in areas such as G&A, infrastructure, and other areas of overhead.\n\nAnd as we get closer to having one brand with our flagship offerings available in all of our markets globally, we'll see other synergies unlocked as well. As you'll hear from Asha, we remain committed to our path to profitability despite these uncertain times in our end markets, and we'll ensure we manage our expenses accordingly. I'll now pass it over to Asha to take you through the quarter's numbers and our outlook. \n\nAsha Bakshani -- Chief Financial Officer\n\nThanks, Brandon. Lightspeed delivered another strong quarter with revenue and adjusted EBITDA loss above previously established outlook, with revenue of $183.7 million growing 38% from Q2 last year and 41% on a constant currency basis. Software and payments organic revenue growth was 35% year over year, within our targeted range. We exceeded our adjusted EBITDA outlook with an adjusted EBITDA loss of $8.5 million, ahead of our previously established outlook of $10 million.\n\nAs you heard from Brandon, we're also very pleased with how well payments uptake has been going, and our GPV grew 86% year over year to $3.7 billion. We are laser-focused on improving our EBITDA margins as we continue to find efficiencies in our business, and we are happy with our progress there. But these are challenging times for our end markets and for our merchants. There's a lot happening in the macro environment, and I would like to provide some clarity on the main things we have on our minds as we look ahead.\n\nFirst is our GTV. Overall GTV grew 18% to $22.3 billion or $23.8 billion on a constant currency basis, representing a 26% year-over-year increase, which is very positive despite shifts we are seeing in consumer spending. Our overall omnichannel retail GTV grew by 21% in the quarter, significantly higher than the forecasted worldwide retail sales. This reflects both the growth in our customer base as well as the impact of higher GTV customers coming to Lightspeed.\n\nWhat we see on a customer-by-customer basis on several of the verticals we serve, however, is average volume shrinking in many cases from prior year levels as consumer spending shifts. This is out of our control but something we are mindful of as we look ahead. In hospitality, GTV growth was impacted by deteriorating foreign exchange rates in the quarter, resulting in overall hospitality GTV growth of 16%. And although we have managed through this softness in average GTV per merchant thus far, with the important holiday shopping and dining season approaching, there is a lot of uncertainty at the macro level, and that is keeping us cautious as we go into the second half of our fiscal year.\n\nOur commitment remains to stay focused on growing our GTV with high-value customers as that is what we control. And to date, this has served us well. Second is customer location. The numbers I discuss here exclude Ecwid.\n\nWe have spoken at length about how we are prioritizing higher value, higher GTV customer locations in our go-to-market approach. Within our customer base, we expect these customers to churn less, drive higher ARPU, and benefit the broader Lightspeed strategy. We are seeing evidence of new customers coming on board with subscription ARPU that is higher than our average existing customer. We are, of course, striving to grow our customer base, and this remains a priority.\n\nBut as we've said before, we are valuing quality over quantity even more so in this environment. We are also mindful that as uncertainty increases, our discipline on how we manage operating expenditures come into focus. We are fortunate to have a lot of white space within our existing customer base to grow our revenues. As a primary example, gross payment volume as a percentage of GPV is only at 17% at the end of our second quarter.\n\nOur highest ROI sales and marketing spend is with our existing base of customers. As a result of both the uncertain environment and the highest ROI for us being upselling our base, our go-to-market focus has shifted with the current backdrop to prioritizing high-value GTV customers from a net new perspective and growing our ARPU within our base, primarily through attaching payments. The result is a quarter where overall net new location count grew by about 1,000 this quarter, lower than previous quarters. However, the mix of customers was favorable.\n\nIn the quarter, the number of customer locations processing more than $500,000 in annual GTV grew by approximately 25% from a year ago, which is more than double the growth of our overall customer location growth. In addition, the number of customer locations processing over $1 million in annual GTV grew by approximately 30% from a year ago. More information on this can be found in our second quarter 2023 results presentation available on our website. On this GTV cohort of customers, the average churn we see is less than half of our overall customer location churn.\n\nAs a result, we have focused on high-value customers, and this mix has been changing for us. Our strong GPV growth of 86% year over year and better-than-expected adjusted EBITDA performance are both evident that this deliberate shift in strategy to focus on upselling payments to our base is working. The result is in our overall base of customers, we are seeing lower-value customers being replaced by much higher-value customers. That is a great dynamic for Lightspeed and is being reflected through our ARPU and GTV per customer location trends.\n\nThird is foreign exchange. We are a global company with approximately half of our customer locations outside of North America, excluding Ecwid. This global footprint is something we are proud of and is a big asset of ours that provides us with diversification. However, we deal with FX fluctuations as a result.\n\nAnd of course, those swings have been very significant of late. We can't predict where they will go in the future, but we are assuming that they don't recover to their prior levels anytime soon. We do hedge our foreign exchange exposure from a cash flow perspective in Canada, where much of our opex lies as that helps ensure our cash flows and EBITDA are more predictable. Revenues, however, are recorded in their base currency, and therefore, the portion of our revenue that is denominated in non-U.S.\n\ndollars is worth considerably less today. We estimate the impact was approximately $3.5 million in the current quarter. And when we extrapolate the current rates, the full year is affected by $10 million to $15 million. This, too, is out of our control, but we must plan accordingly.\n\nWe ended the quarter with approximately $863 million in cash. Our cash decreased by approximately $52 million in the quarter as we voluntarily paid off the outstanding balance on our acquisition facility of $30 million. Aside from the loan payback, the largest uses of cash outside of normal course operations were working capital movements, including the growth of our merchant cash advance business Brandon spoke of, which we fund from our own cash balances today. As we move on to outlook, no matter how confident we feel about our business model and prospects, we cannot ignore the backdrop and its impact on our business I outlined above.\n\nWith macro uncertainty looming, it does cause us to exercise a heightened level of caution, especially as we go into the very important holiday season. For the full fiscal year, on a constant currency basis, we expect our revenue to be in the range of $740 million to $750 million, within our previously established range, though more toward the lower end. Incorporating the impact of new FX rates, we now expect our reported revenue in the range of $730 million to $740 million, replacing our previous outlook. For the third quarter, on a constant currency basis, we expect our revenue to be in the range of $189 million to $194 million.\n\nIncorporating the impact of new foreign exchange rate, we expect our reported revenue in the range of $185 million to $190 million. As a reminder, in the third quarter of our previous fiscal year, we had a one-time catch-up from one of our payment partners of $5.5 million. Despite the lower revenue, we are managing the company with discipline and remain focused on our highest ROI activities while the uncertainty persists. As a result, we expect an adjusted EBITDA loss of approximately $40 million, still within our previously established outlook of $35 million to $40 million.\n\nFor Q3, we are expecting adjusted EBITDA loss to be approximately $9 million. We remain committed to our path to profitability. With that, I'll hand it over to JP for closing remarks. \n\nJP Chauvet -- President\n\nThanks, Asha. Before we go into Q&A, I want to welcome a new member to our senior executive team, Ryan Tabone. Ryan is our chief product and technology officer and comes to us after 15 years at Google. He has extensive experience in cloud-based platforms as well as the world of payments and financial services, and I'm looking forward to the impact he will make on Lightspeed.\n\nI also want to highlight that JD Saint-Martin has been promoted to president. JD was most recently our chief revenue officer and will now take on additional responsibility with all of our industry general managers reporting into him directly. This change will help streamline our executive team, placing the accountability for the performance of each vertical with the same individual who is responsible for our go-to-market and customer success. As I look at our senior executive team, I'm confident we have the right leaders in place to execute our goals and continue to grow the company.\n\nAnd with that, we will take your questions. \n\nOperator\n\n[Operator instructions] Our first question is from Tim Chiodo with Credit Suisse. Your line is open.\n\nTim Chiodo -- Credit Suisse -- Analyst\n\nGreat. Thanks for taking my questions. So the first part, the 500,000-plus locations growing 25%, that's a very encouraging stat. For the modeling purposes, though, I'm sure we're going at the beginning of the question.\n\nFor the 1,000 location growth addition to this quarter, is that the new run rate we should be thinking about until some of the churn from, call it, ShopKeep and Gastrofix start to subside? Should we be thinking about roughly up one sort of quarter over quarter? And then in terms of the sales team additions, was that a contributor to the strong growth in the 500,000-plus locations? And if you could give a little bit of an update on how large that team is given -- I believe you started hiring them about a year ago. \n\nJP Chauvet -- President\n\nYeah. Good morning. JP here. I'll take this question.\n\nSo I think maybe just if we step back, as you know, we've since I've been CEO, we've been explaining that not all merchants are equal. And we were very clear on the fact that we want to focus on the larger GMV customers because those are the ones who are way less prone to churn. Churn is almost half, actually more than half of those -- on that segment of customers, and so what we're naturally seeing is that the 200,000 and under customers are churning. And we're not attracting them, not focusing on them, and we are really focused on the larger GMV customers.\n\nIt's also a part of our path to profitability is to really focus on attracting the right customers that are not gonna churn and are not gonna buy the entire portfolio over time. So again, we wanted to disclose a little bit more just to give you some visibility here. We have our Investor Day, we'll also be sharing more data at that point. And I think for me, when we look internally at forecasting, we do not look at locations.\n\nWe -- what we focus on is maximizing every dollar of marketing spend to get the best return, and that means any way you look at it going for more established customers in the SMB space. \n\nOperator\n\nThe next question is from Josh Beck with KeyBanc. Your line is open.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nThank you for taking the question. Yeah. Maybe following up a little bit along the lines of adding these larger customers. When you think about the go-to-market motion, I imagine it implies a little bit more of an outbound force.\n\nSo are we gonna be in a period here where hiring is taking place, but maybe the productivity has not hit in, so it's maybe a little bit of a trough before you start heading back upwards with respect to the customer acquisition efficiency? \n\nJP Chauvet -- President\n\nYes. So maybe we have -- just answering also the first question, we have been hiring outbound reps. And so really, the way we look at it is we have a certain amount of dollars that we already spend to attract customers. And here, instead of spending everything on marketing and getting inbound, we have now started hiring teams that are doing outbound and getting deals from that motion.\n\nWhat has been very encouraging to us is that the cost of acquisition, and if you look at LTV over CAC, has been as good and even better when we look at the outbound motion versus the inbound. So we are doubling down on this. And frankly, we are very happy with the results that we're getting there. This being said, there are many open positions right now at Lightspeed for -- in go-to market and mainly focusing on outbound reps. \n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nVery helpful. And then you've obviously had a lot of momentum driving payments penetration. It certainly seems like there's a very strong product market fit. When we do think about some of the macro uncertainty, is this an area that you feel like you can, in some ways, double down and have a very company-specific driver to really kind of offset what could be otherwise a pretty choppy macro environment? \n\nJP Chauvet -- President\n\nYeah. You're absolutely right. So when we look at this, what is really important to us is path to profitability. And when you look at path to profitability, there's really two big vectors.\n\nThe first one is we need to do way more with payments and double down on upselling our base. As you know, there's still a lot of white space there. And the second thing we need to do is be very cautious on the profile of customers that we attract because we do -- I mean the worst case scenario is going after numbers, and landing customers are gonna churn because of business figures. So we wanna go with the more established.\n\nAnd I think those 2 sequences put-together mean that we'll probably have fewer stores, but we will have better revenues and will drive toward profitability with this. \n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nSuper helpful. Thanks, JP. \n\nOperator\n\nThe next question is from Dan Perlin with RBC. Your line is open.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nThanks. Good morning. I wanted to follow up on the concept around helping your clients kind of get to this macro time through technology, and the question there is really around the pricing environment for you. Are you willing to take advantage of kind of pricing here to gain some share to ultimately help these customers through this environment? And then I'm thinking, in particular, are you willing to offer up discounting around software in order to secure payments as you start to move upstream into some of those larger clients that you have a longer-term kind of LPV?\n\nJP Chauvet -- President\n\nYeah. So we are -- I mean that's always been kind of the trick in the book is the big difference between Lightspeed and maybe other merchants is we have a full commerce platform. So we have many modules, and we have payments. So in the context of a downturn, what we are going to be doing is actually going to our existing customers and say, \"Hey, we could do way more than what you're doing now, and we're gonna be willing to discount to get more customers on payments using more modules.\" And then with regards to new customers, we're really gonna be focused on unit economics and ensuring that we're going to go after the more established that are not gonna fail.\n\nAnd I think that's really the two sequences there. I think when you look at the market, there is a lot of pressure on the merchants right now. You have inflation, which means that they cannot hire as many people as they used to. If not, they will not -- our customers do not strike profits.\n\nYou have the scarcity of hiring. They're having difficulty hiring people. You have now a recession looming. And so there's a lot of pressure points, and the only way out for our merchants is really to do more with less.\n\nAnd when you look at Lightspeed, everything we do is around automation, automation with accounting systems, automation with payments, automation with delivery networks, and order ahead. So we don't think that the legacy platforms that are -- the majority of the market today are serving these markets well. And we think that in the context of all the pressure points on our merchants, the only way out is gonna be to adopt technologies like ours. But we don't wanna go after every merchant in the context of our path to profitability and difficulties ahead.\n\nWe wanna be sure we go off to the more established merchants. \n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nYeah. No, that's great. And that actually kind of dovetails into my second question, which is, as you're pivoting to going up to larger merchants, higher-value merchants, I'm wondering if you could just outline maybe what are some of the key attributes, right? Because it's not obviously just volume, it's the type of complexity. Is it gonna take you into different verticals maybe that you haven't been in the past? Just anything there would be super helpful.\n\nThank you.\n\nJP Chauvet -- President\n\nYeah Just -- I know you probably all heard me say this many times, but I'd likely we're not interested in small, medium, large coffees or small, medium, large T-shirts. We really wanna go with established. And what does that mean? And just answering your question, it's always the same logic, is volume of inventory. The more you have inventory, the more complex your business is because you cannot manage your inventory with your eyes, you need platforms to work with your suppliers.\n\nThe other big vector here is multi-location. As soon as you have two locations and you need to transfer inventory and you need to deal with your suppliers and you need to deal with your online presence, that's where we shine. So I think generally speaking, our platform is significantly better than anybody in the market as you go into more complex vendors, and there's a very strong correlation between complexity vendor and higher GMV. So I think all of this to say that this is very much the strategy of Lightspeed.\n\nThere's no big change. We just wanna be sure that we as we go into more difficult times and as we have this very strong view on path to profitability, we just need to be cautious on really attracting the right profile of customers that are gonna stay with us and that will find an entire -- that will find a lot of value in our solution set. \n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nThat's great. Thank you.\n\nOperator\n\nThe next question is from Thanos Moschopoulos with BMO Capital Markets. Your line is now open.\n\nThanos Moschopoulos -- BMO Capital Markets -- Analyst\n\nHi. Good morning. Can you speak to the near-term trajectory you anticipate for your third-party payment referral revenue? Obviously, there's a seasonal cyclical components. But just overall, should that revenue stream be up year over year in the near term given the renegotiation of referral fees? Or is it starting to come down as you shed some of the noncore customers and convert some customers to Lightspeed Payments? \n\nBrandon Nussey -- Chief Operating Officer\n\nHey, Thanos. No, that's coming down, has been coming down, and will continue to go down. \n\nThanos Moschopoulos -- BMO Capital Markets -- Analyst\n\nOK. And on the payments penetration, we saw about 150, 200 basis-point sequential uptake, something similar to the prior quarter. Is that the sort of trajectory you'd anticipate going forward? Or could there be a seasonal element as well, where we'll be heading into December quarter, people are more reluctant to change equipment provider? \n\nBrandon Nussey -- Chief Operating Officer\n\nNo, we're pretty focused. We're working hard on this. Again, the key metric we track and monitor is the GPV. The penetration rate is a little volatile quarter to quarter depending on what's going on in the underlying customer base.\n\nSo when it comes to GPV, though, we're really, really focused on how do we ensure we sell it well at the outset, so attach rates on new coming in, and how do we onboard and drive more payments into our existing base. We've undertaken a whole bunch of initiatives internally around how we optimize each step of that journey. And we're seeing some good progress so far. More to do.\n\nBut now with payments available basically across the world for us, we're pushing on this as a very key component of our business plans right now. \n\nThanos Moschopoulos -- BMO Capital Markets -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThe next question is from Andrew Jeffrey with Truist Securities. Everybody's open.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nGood morning, everybody. Thanks for taking the question. JP, I have a competitive question, especially given Lightspeed's significant rest-of-world positioning and the shift to unified products. Can you just comment on how you think the company competes? I'm thinking particularly in restaurants, rest of world versus in the U.S., where there's a clearly established sort of next-gen cloud player.\n\nAnd if you think rest of world is an area where Lightspeed is better positioned to reach ubiquity and ultimate scale compared to the U.S. or if you think you can be equally competitive globally. \n\nJP Chauvet -- President\n\nNo. Look, we're -- actually, one of the big highlights for me in the quarter is the progress of the new platforms. So as you know, we have the strategy between now and the end of the year, which is One Lightspeed, which is really focused on we need one core platform for retail, one core platform for hospitality globally. This is where I feel the strongest.\n\nThe new platforms are extremely competitive and create more value than anyone, even the established players in the U.S. And maybe just a data point here that's really interesting. The majority of our deals this quarter were on the new platforms globally, so that's a very big step for us. And in the U.S., it's actually higher when you look at September, which is the last month of the quarter versus the last month of last quarter.\n\nSo we're getting some real traction and real progress. On the retail front, I'm really, really bullish on our new product, which is Lightspeed Retail X. That platform, especially with our headless capabilities, our workflows, I mean everything there is just fabulous, and we're feeling really good about the U.S. market on that.\n\nAnd for Kei, just addressing, which is our restaurant product, just addressing the U.S., we are starting to see some strong traction in the U.S., mainly with our outbound reach. And again, we're not trying to be everything for everyone. We wanna go with the more established table service, high-end Michelin star. Because if you look at how hospitality works, if you start at the top, there is a ripple effect all the way down.\n\nBut there, as you know, there is a big strategy for us to compete in the U.S. also, and we're very happy with that progress.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nOK. I look forward to hearing more about that at the analyst day, too. And then with regard to the effort to penetrate installed base, which makes a ton of sense, especially given the low -- relatively low payments attached, can you just speak to sales cycles? I can imagine sales cycles for new customers, especially larger customers have elongated in this environment. Is the same true in the installed base? Or is there a notable difference, I guess? \n\nJP Chauvet -- President\n\nYeah. No, so look, we are -- it's very clear for us that we need to dedicate teams that are going to be upselling the base, and so there's a lot of recruitment going on there. There's a lot of new hires that are joining likely there. We need to increase penetration.\n\nAnd for us, the best cycle there, again, is to go and talk to the customer and say, \"Hey, you're paying a couple of hundred bucks a month. If you pay -- if you use like payments, we give you a discount on the software and to attach payments.\" And so we have all the strategies in place there, and we're happy with the sequence. I think what's very interesting, when you look at the three blocks for payments for us, attach rates for new customers is remaining very strong and is not lowered, so we're doing better there, especially in Europe now. Brandon mentioned, 50% of all our deals now are outside of the U.S.\n\nin terms of payments, so that's really strong news. And then the second thing is we need to look at strategies to just attach payments more when people are renewing. And finally, the third one is to be very, very focused on the outreach to go after the higher GMV customers, who are not on Lightspeed Payments and ensure that they move over to our payment platform. So all those sequences are working well, and that's why we're seeing pretty high growth on GPV, which is the volume of customers who are on Lightspeed Payments.\n\nAnd you can expect that to continue because, of course, this is the most important step in our path to becoming a profitable company. \n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nYeah, for sure. Appreciate that. Thank you. \n\nOperator\n\nThe next question is from Andrew Bauch with SMBC Nikko Securities. Your line is open.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nHey, good morning. Thanks for taking the question. I had one near-term question that on a longer-term thematic question. So starting with the near term.\n\nJust thinking through the third quarter dynamics, I remember this time last year, there was better GTV trends in segments without payments versus those with payments and partially due to Omicron. So just trying to think through some of the dynamics that we should be keeping in mind with regards to those comps and the locations that have higher payments penetration as we end the end of the calendar year here. \n\nBrandon Nussey -- Chief Operating Officer\n\nYeah. I mean there's obviously a lot going on in the macro. We have 2 primary businesses, as you all know. We got the retail customer cohorts, and we got the hospitality.\n\nRetail, we do a lot with consumer discretionary categories, specialty retail, sporting goods, home improvement categories, all of those. And we are seeing signs of consumer discretionary spending stress in some of those markets. I think as Asha mentioned in our prepared remarks, we're actually seeing same-store basis like average GMV per customer in those segments actually decline year over year. So that dynamic, it's difficult to predict as we look ahead into the holiday season.\n\nThough, as you heard from Asha, we have to remain cautious on that for sure. Hospitality, we certainly saw a resurgence in hospitality in the quarter as economies opened up and consumer started to travel again. As a reminder, our hospitality business is, for the most part, outside of North America. We're good in Europe and places like Australia as well.\n\nWe did see some of that slowdown in the back part of the quarter as well, and I think we'll remain cautious on how that plays out in the upcoming holiday period as well. I think that's the only prudent thing to do. We'll focus on the things we can control, which is, as JP has been emphasizing, attracting the right types of customers into our customer base and, of course, making sure we take advantage of the white space that exists across our customer base.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nNo, that's helpful color, Brandon. JP, you mentioned a real focus on bringing these three assets together and creating One Lightspeed. Just trying to think through a little bit clear. What does that kind of unlock when these three assets are fully integrated and fully combined in your go-to market? And when do you kind of anticipate that? And are there any other financial implications that we should be considering when those -- that integration is all done?\n\nJP Chauvet -- President\n\nYeah, I think we've been very clear. So the endpoint of this at the end of this fiscal year, this is for me, I view this as a transition year into one. The -- why one? I mean it's getting all our developers working on one platform will make us go much faster. It will bring a ton of simplicity in terms of go-to market.\n\nBecause right now, there are markets where we're still selling both products, so it just makes it much more complex for nothing. And then there's, of course, a ton of cost synergies. If I have only one support team, one onboarding team for one product globally, if I only have one system for one CRM. I mean right now, there's a lot of unnecessary complexity, which we have planned for.\n\nBut as we get to one and one brand with one product in each category, it's just gonna make this business so much simpler. And so here, for us, then it will just help us double down and accelerate with less noise and less structural costs, if you will. \n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nNo, it makes a lot of sense. Thank you.\n\nOperator\n\nThe next question is from Eugene Simuni with MoffettNathanson. Your line is open.\n\nEugene Simuni -- MoffetNathanson -- Analyst\n\nThank you. Good morning, guys. So we're very clear that you guys are shifting or reemphasizing the strategy of the shift to larger customers, and you also made it clear that it sounds like LTV is very attractive with these customers. There's just a couple of questions and maybe unit economics of these customers.\n\nSo one, only yields, let's say, payment yields in payments, larger customers usually mean lower yields. Is that how you think about it over the longer term? Just help us think how the unit economics of the business might evolve. \n\nBrandon Nussey -- Chief Operating Officer\n\nYeah, just to zoom out quickly, the advantage of bringing on larger customers and their impact on LTV, ultimately, at the end of the day, what we're looking to do is grow the amount of commerce that flows through our network, and you're seeing that show up in our aggregate GTV. And then grow our net take rate on that commerce, and you've seen that progress over time as well. So as larger customers come on vis-a-vis a smaller customer, we might get slightly worse payment acceptance rates from them. But that's kind of the micros.\n\nAs you zoom out and you think about really what we're trying to build and what we've been successful building, it's -- we've now -- I think our trailing 12 months of GTV is $83 billion or so. And as we've been growing that successfully, we've been taking in a larger and larger portion of the amount of that. That turns into revenue and gross profit for us, and that's core to the strategy. So yeah, just to answer your question very directly, it might look different on a customer-by-customer basis.\n\nBut in the big picture, it's all healthy for us. \n\nEugene Simuni -- MoffetNathanson -- Analyst\n\nGot it. OK. That's helpful. Yeah.\n\nAnd then a big picture question here, high profile, higher with wide coming onto the team. It's great to see. Just curious, what are the top couple of R&D priorities that Lightspeed has that maybe why you're able to stay ahead and that we might see bear fruit over the years to come?\n\nJP Chauvet -- President\n\nYeah. So I'll maybe take this one. The immediate No.1 priority for Ryan is -- and first question you have for me is what is success between now and the end of the year is like one product globally in each category. That is extra ultra-competitive, and so that's the No.\n\n1. And we -- for me, I look at it, we can see the end of the tunnel. We are almost there, but now we need to just finalize. I wanna be sure that next year, there's only one product globally for each category.\n\nSo I think that's priority No. 1. Priority No. 2 is what we're doing upstream.\n\nWe've been talking about the B2B network. And here, we have now launched this in beta in a number of categories. And here, why is this important? Because this is how we're gonna help our customers. We need to look at how they work with suppliers, and we talked about this, and we'll be talking about this again at the Investor Day.\n\nBut this is really important. We need to now go from a beta to a released product, and we need to start going category by category and creating value because this creates value for everybody. And really, it is a flywheel if we can do this right. That's the second.\n\nAnd then the third for me is big data and financial services, where we -- I mean as we aggregate data, we are the largest set of off-line data in the world. We're normalizing this across all stores. There's so much we can do with that data. And of course, financial services is one of them.\n\nOf course, helping stores understand what they should be putting in inventory because we know the consumer. And I think ultimately, we're in a really strong position to develop many new products that are around data and this aggregate view on data that we have that nobody else has. So those are the three big priorities and really excited to have such a high-profile candidate decide to join Lightspeed over any of the other options and really looking forward to the evolution here for our product road maps. \n\nEugene Simuni -- MoffetNathanson -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThe next question is from Josh Baer with Morgan Stanley. Your line is open.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thanks for the question. Wanted to talk a little bit about software subscription ARPU trend. It seems like the mix shift toward the higher GTV customer locations would also benefit on the software side and ability to adopt more modules, not just transaction revenue.\n\nNot really seeing that this quarter with subscription ARPU. I think flat quarter over quarter. Talk through some of the dynamics there and where the priority lies as far as selling more modules into the customer base. \n\nAsha Bakshani -- Chief Financial Officer\n\nJosh, thanks for your question. So the first thing we have to keep in mind is foreign exchange headwinds in the quarter does impact our subscription revenue line more than our transaction-based revenue line, particularly because our transaction-based revenue is more mature in the U.S., so the majority of that revenue is in U.S. dollars. So that is impacting the subscription ARPU in the quarter.\n\nIn addition to that, as we sign the customers, you should definitely see the impact in subscription revenue, but that impact is still marginal compared to the impact on transaction-based revenue. If you think about ARPU of a larger customer, although it's significantly higher than an average customer, it's still pretty insignificant compared to the ARPU that we would get on $1 million of GTV customer. And so you will see the impact on subscription be much smaller than the impact on transaction-based revenue just because of the magnitude of the numbers. \n\nJP Chauvet -- President\n\nYeah. And maybe if I could just add. The conversation becomes more of a net take rate conversation and a net take rate based on the revenues of the customers, and I think there's a lot of improvement there. But I do think that payments and software are blended.\n\nAnd really, ultimately, when our salespeople look at this, we need to get a good net take rate from those customers, and we need to grow the net take rate on those customers. So I think that's more how we're looking at it, which is a blended net take rate of software and payments and financial services. \n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGot it. Helpful perspective. Thanks.\n\nOperator\n\nThe next question is from Daniel Chan with TD Securities. Your line is open.\n\nDaniel Chan -- TD Securities -- Analyst\n\nHi, good morning. Brandon, you really talked about the Lightspeed Capital business like it's still very early days and still has a lot of potential. Just can you kind of frame that up for us? Where is that business currently relative to its potential? And what are your plans to ramp that up over the short term? Thank you. \n\nBrandon Nussey -- Chief Operating Officer\n\nYeah. So we launched this shortly after the acquisition of ShopKeep. They had a more mature offering in this space. You may recall -- and the executive team from ShopKeep had some good experience in this.\n\nWe, like we've approached many things, kind of took this one step at a time. Just got used to this business model and started to try different tactics to make sure we understood what we were -- how this would work. And now we're at a point where this product is ready for us to start to think about scaling it a lot more broadly. Now we've opened this up to some international markets, as I spoke about.\n\nSo we've got this now in Canada, the U.S. and Australia, and we've opened it up to more of our underlying product offerings as well. And so we are seeing growth rates really start to move in the right direction here. Revenues are up more than 200%, and a number of advances as well that we've done.\n\nOf course, we're not blind to the macro situation, but that's the advantage of this customer base we have as well. We're a little more established, a little less prone to default risk. So far, that experience has been very minimal, very manageable. So we really like what we see here, and I think there's a lot of potential still to be had, and we're just getting going on it to your point. \n\nDaniel Chan -- TD Securities -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Matt Coad with Autonomous Research. Your line is open.\n\nMatt Coad -- Autonomous Research -- Analyst\n\nHey. Good morning, guys. Thanks for taking my question. Just one for me on the gross margin.\n\nIt's been in the 46% range the past couple of quarters. Could you talk about like anything in terms of maybe like funding mix that impact the net take rate or expectations around hardware losses going further? \n\nAsha Bakshani -- Chief Financial Officer\n\nSo we can start with hardware. You heard from us last quarter that we were gonna improve that margin line, and we have seen some improvement in that margin line. However, in hospitality, U.S. in particular, we're seeing very good uptake of our flagship product in the quarter, as you heard from JP.\n\nAnd we do continue to heavily discount hardware to increase sales velocity in that vertical in that region, and we will continue to need to do so as we continue our focus in hospitality U.S. We are, however, managing discounting in our other verticals in our region to continue to improve this margin line. So we do expect to see improvement in that margin line. But given the growth we're expecting in hospitality U.S., we expect that margin improvement to be gradual.\n\nIn addition to hardware, the other factors impacting the overall gross margin is transaction-based revenue. And as you heard from Brandon earlier, as our -- more and more of our customers take Lightspeed Payments, that does come with a lower gross margin percent than the integrated payment partner residuals that we get. And so those two factors together do result in an overall gross margin that is lower, gross margin percent that is lower, but we are really focused on growing our gross margin dollars, which you heard from JP, that increase in net take rate that we get from our customer on a combined basis. From an operating efficiency perspective, we are focused on reducing support costs, reducing infrastructure costs.\n\nAll of these things will help the gross margin percent, and we have been successful, and we continue to undertake those initiatives to improve our margin percent. \n\nMatt Coad -- Autonomous Research -- Analyst\n\nSuper helpful, Asha. Really appreciate it. Just one more on locations, and I know you guys have talked a lot about locations growth already on this call. But I was hoping you could kind of like break it up in the three buckets for us like gross location, location growth, voluntary churn, and involuntary churn just from bankruptcies.\n\nKind of like break it up into like those three buckets for this quarter and then how you're thinking about the next couple of quarters going forward. \n\nBrandon Nussey -- Chief Operating Officer\n\nJust in terms of churn, we put a slide on our investor website in the investor deck to just outline the cohorts and what we're seeing. So we are seeing to -- JP's earlier comments, if you look at that sub-200,000 GTV bucket, that's actually what is the headwind in the location count overall statistic. That's actually declining year over year. Majority of that should be how you characterize the buckets, but that will be business failure churn for the most part in that bucket.\n\nAnd that's in part why we're privileging the more established end of the customer spectrum. We see that as soon as the merchant crosses 500,000, churn drops significantly. And furthermore, once you get into the 1 million plus, drops even further. So that's overall what we're seeing in churn.\n\nAnd then as the gross adds, I think you heard from JP earlier, it's more about are we growing our aggregate GTV and is that GTV turning into profitable revenue for us, that's our focus right now more so than a specific number of locations. And I think you're seeing the progress both in terms of GTV growing, our ARPU growing, and ultimately, the leverage we're seeing down in the adjusted EBITDA line and some of the ratios there. So it's all working in tandem there. \n\nMatt Coad -- Autonomous Research -- Analyst\n\nThanks, guys. \n\nGus Papageorgiou -- Head of Investor Relations\n\nChris, I think we'll take one last question. \n\nOperator\n\nOK. Our last question is from Richard Tse with National Bank Financial. Your line is open.\n\nRichard Tse -- National Bank Financial -- Analyst\n\nHey, thank you for taking my question here. With respect to the direct sales reps, I'm trying to understand how that sales force is organized. Are they sort of regionally focused, meaning that you're sort of having certain people in all geographies? Are they kind of located more centrally and they kind of fly in these regions? Just trying to understand how that operationally works. \n\nJP Chauvet -- President\n\nYes. So it's a typical outbound motion. So -- but maybe let's just start, we are concentrating the effort in metropolitan areas, and really it's a tandem of some -- of an outbound rep basically just cold calling and a rep with foot on the ground who's then gonna go and visit the customer. So it's a dual, call it, team.\n\nAnd yes, I think what's very interesting to us is we are targeting the more established restaurants, and what we are seeing is better unit economics for that kind of model. So that's why if you go to our website that I think there's something like 82 job openings for salespeople generally speaking, and a lot of those are gonna be or focusing on upselling the customers with payments and financial services or the outbound motion in hospitality in the U.S. \n\nRichard Tse -- National Bank Financial -- Analyst\n\nOK. And just a quick one, if I might. You used to sort of share with us the average number of modules taken on by your merchants, obviously, a big product offering as payments. Can you give us a sense of sort of the next most popular modules? Or are they sort of the omnichannel sort of module? Or is it something else so we can kind of get a feel for where that stands today? Thanks.\n\nJP Chauvet -- President\n\nYes. So No.2 is by far the omnichannel. So headless commerce now if you're in retail or all of order head and delivery if you're in hospitality. So that is, by far, the second.\n\nAnd then the third one is our advanced analytics engine, and that is a very big differentiator for our competition in the U.S. in hospitality. Nobody does what we do in terms of analytics and giving some data of how the restaurants do better. And on the retail front, also, we have a very strong advanced analytics engine.\n\nRichard Tse -- National Bank Financial -- Analyst\n\nOK. Great. Thank you. \n\nGus Papageorgiou -- Head of Investor Relations\n\nI think we're gonna wrap it up here. So I'd like to thank everybody for joining us today. I remind everyone that we will be hosting our Capital Markets Day here in Montreal on November 15 with a reception on the 14. We hope to see as many of you here at our head offices as possible.\n\nSo thanks again for joining everyone today, and have a great day. \n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGus Papageorgiou -- Head of Investor Relations\n\nJP Chauvet -- President\n\nBrandon Nussey -- Chief Operating Officer\n\nAsha Bakshani -- Chief Financial Officer\n\nTim Chiodo -- Credit Suisse -- Analyst\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nThanos Moschopoulos -- BMO Capital Markets -- Analyst\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nEugene Simuni -- MoffetNathanson -- Analyst\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nDaniel Chan -- TD Securities -- Analyst\n\nMatt Coad -- Autonomous Research -- Analyst\n\nRichard Tse -- National Bank Financial -- Analyst\n\nMore LSPD analysis\n\nAll earnings call transcripts"
}