{
  "companyName": "Genworth Financial",
  "companyTicker": "GNW",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/genworth-financial-gnw-q3-2022-earnings-call-trans/",
  "content": "Genworth Financial (GNW)\nQ3 2022 Earnings Call\nNov 02, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to Genworth Financial's third quarter 2022 earnings conference call. My name is Karen, and I will be your coordinator today. [Operator instructions] As a reminder, the conference is being recorded for replay purposes. [Operator instructions] I would now like to turn the presentation over to Sarah Crews, director of investor relations.\n\nPlease go ahead.\n\nSarah Crews -- Director, Investor Relations\n\nThank you, operator. Good morning, and welcome to Genworth third quarter 2022 earnings call. Today, you will hear from our president and chief executive officer, Tom McInerney; followed by Dan Sheehan, our chief financial officer and chief investment officer. The slide presentation that accompanies this call is available in the Investor Relations section of the Genworth website, investor.genworth.com.\n\nOur earnings release and financial supplement can also be found there, and we encourage you to review these materials. Following our prepared remarks, we will open the call up for a question-and-answer period. In addition to our speakers, Brian Haendiges, president of our U.S. life insurance segment; and Jerome Upton, deputy chief financial officer and controller, will also be available to take your questions.\n\nDuring the call this morning, we may make various forward-looking statements. Our actual results may differ materially from such statements. We advise you to read the cautionary notes regarding forward-looking statements in our earnings release and related presentation as well as the risk factors of our most recent annual report on Form 10-K as filed with the SEC. This morning's discussion also includes non-GAAP financial measures that we believe may be meaningful to investors.\n\nIn our financial supplement, earnings release and investor materials, non-GAAP measures have been reconciled to GAAP where required in accordance with SEC rules. Also, references to statutory results are estimates due to the timing of the filing of the statutory statements. And now I'll turn the call over to our president and CEO, Tom McInerney.\n\nTom McInerney -- President and Chief Executive Officer\n\nThank you, Sarah. Good morning, everyone, and thank you for joining our third-quarter earnings call. Genworth delivered another quarter of solid operating performance despite a challenging macroeconomic environment, reflecting good momentum in our businesses and continued progress against our strategy to deliver long-term growth and shareholder value. U.S.\n\nGAAP net income was $104 million for the third quarter, while adjusted operating income was $159 million or $0.31 per share. These results were again led by Enact, which reported $156 million in adjusted operating income to Genworth. U.S. Life reported adjusted operating income of $11 million, driven by LTC and fixed annuities, partially offset by losses in life insurance.\n\nEnact continues to deliver strong performance, driven by execution of its cycle-tested growth and risk management strategy. Since the next IPO, Genworth has received approximately $200 million in dividends from enact, including $19 million in the third quarter. As you know, our shareholders benefit from Genworth's ownership of Enact through its significant free cash flow and resulting dividends, which have enabled us to advance our strategic priorities, including debt reduction, share buybacks and the continued development of our long-term growth strategy. Enact executed an additional excess of loss reinsurance transaction to strengthen its capital position in September.\n\nEnact strong capital levels, including PMIERs sufficiency of 174%, robust balance sheet and access to capital puts it in an excellent position with enhanced financial flexibility. We continue to expect a special dividend from Enact in the fourth quarter as Enact announced yesterday. U.S. Life companies had combined pre-tax statutory income of approximately $10 million in the third quarter, which has improved versus the prior quarter, driven by smaller equity market declines, which require us to increase statutory reserves and our closed block variable annuity business.\n\nGenworth Life Insurance Company, or GLIC, estimated RBC ratio was approximately 285% as of quarter end. Our final statutory results will be available with our third-quarter statutory filings later this month. On a U.S. GAAP basis, the Life businesses and runoff together had adjusted operating income of $20 million in the third quarter.\n\nEffective January 1, 2023, we will implement LDTI and long-duration targeted improvements, the new GAAP accounting standard impacting our U.S. life insurance companies. Our actuarial and controllership teams are focused on the implementation and our progress remains on track. It is important to remember that the impact of LDTI is noneconomic.\n\nIt will have no impact on our cash flows, statutory accounting, capital position, capital returns or business strategy for our U.S. life insurance companies. Dan will go into more detail regarding our current estimates for some of the expected initial impacts for our LTC business. Regarding longer-term cash flow, I want to provide an update around AXA's case against Santander and potential recoveries in the case.\n\nAs a reminder to investors, Genworth is not a party to the case, but we will share any recoveries from AXA from Santander through a judgment or settlement. Based on developments to date, we anticipate that our trial will begin in 2024. However, we do not anticipate the trial date to be set until mid-2023. It is premature to accurately estimate the amount of potential recoveries.\n\nHowever, if AXA is successful in claims against Santander, we are optimistic that we will be able to recover a significant portion of the approximately $830 million that Genworth has paid to AXA as part of our settlement agreement. As we look ahead to the fourth quarter and beyond, Genworth remains prepared to navigate ongoing economic uncertainty due to our well-positioned investment portfolio, very low debt-to-capital ratio modest annual debt service obligations and expected cash flows from Enact. Our continuing execution against our strategic priorities reinforces that positioning. Genworth achieved a critical milestone in September when we paid off our remaining 2024 senior notes, marking the achievement of our long-term holding company debt target of $1 billion or less.\n\nGenworth's holding company debt is now $900 million. This important achievement results from over $3 billion of debt retired since I joined the company in 2013. I am incredibly proud of the work our entire Genworth team has done in achieving this goal particularly given the challenges with Qlik's legacy LTC business and the challenging pandemic and market backdrop in recent years. As a result of this multiyear effort, we have very manageable interest expense obligations moving forward our pro forma cash flow coverage, inclusive of intercompany tax payments is approximately five times.\n\nMost importantly, our strong parent company balance sheet and significant free cash flow from Enact will allow Genworth to step up capital return to shareholders going forward. Turning to our legacy LTC portfolio. We continue to execute against our multiyear rate action plan or RAV, our most effective tool that we are deploying to bring our legacy LTC portfolio to economic breakeven on a go-forward basis. We have achieved $200 million in annual premium rate increase approvals year to date through the third quarter.\n\nThis brings our cumulative progress against the MYRAP program to $21 billion on a net present value basis since 2012. We continue to build a new entrepreneurial management team in our global care solutions business. New hires include chief technology officer and the head of our preferred provider network. We are preparing to launch our new, less capital-intensive LTC service, navigation and vice business in the first half of 2023.\n\nInitially, we will focus on the most attractive target markets and new digital technology enhancements. The new business will include a digital platform where those in need of long-term care can search for and compare that our local care options bolstered by a preferred network of quality senior care providers offering more attractive pricing. We will continue to take a consumer-driven design approach refined experience based on learnings as we expand the business going forward. Over time, we plan to expand this offering across the U.S.\n\nmarket to meet the long-term care navigation and vice needs of the more than 7 million baby boomers as they approach their peak LTC claim years. Our goal is to create a single unified experience, utilizing our 40-plus years of LTC insurance and claims-paying experience along with the care navigation and health assessment capabilities from our CareScout subsidiary to address the needs of the aging their families and caretakers to enable more dignified connected and fulfilling aging journey. This is important work for our customers, and I'm happy that we're able to leverage what we've learned over four decades of managing Genworth's LTC insurance business to help not only our policyholders, but all Americans who may need long-term care. We are pleased with the progress we continue to make and look forward to sharing further updates in the near future.\n\nTurning to Genworth's capital allocation strategy. Given our positive free cash flow outlook, balance sheet improvements and continued strong operating performance. Our board authorized a share repurchase program of up to $350 million in May of this year. As of October 31, 2022, Genworth has repurchased $59 million worth of outstanding shares at an average price slightly below $3.90 per share.\n\nAs previously mentioned, the onshore repurchases and as we work to build significant excess cash, the board will evaluate and consider implementing a quarterly dividend to Genworth shareholders. With that, I'll turn the call over to Dan.\n\nDan Sheehan -- Chief Financial Officer and Chief Investment Officer\n\nThank you, Tom, and good morning, everyone. In the third quarter, we further improved our financial strength delivering solid results while reducing debt. As a result, we've entered the fourth quarter with a greater level of flexibility, which enables us to advance our objectives to invest in growth and return capital to shareholders as we continue to navigate this economic environment. Starting with our strategic achievements, we completed the redemption of $152 million of our 2024 debt maturity, bringing our debt outstanding to $900 million and achieving our strategic priority of $1 billion or less.\n\nOur remaining debt is long dated with the next maturity not due until 2034. This achievement is an important milestone for Genworth and a testament to our disciplined capital planning and execution against our strategic priorities. It also strengthens our ability to drive value for shareholders and will enable us to increase the pace of share repurchases as we accumulate excess cash. Through the end of October, we've repurchased $59 million of Genworth stock, representing approximately 15 million shares at an average price of $3.89 per share.\n\nThere's approximately $291 million remaining on our authorization. As we've executed on our strategy, our team has delivered solid operating performance, which I'll review at a high level, beginning on Slide 5. Third quarter net income was $104 million, and adjusted operating income was $159 million or $0.31 per diluted share. This compares to the prior quarter's net income of $181 million and adjusted operating income of $176 million or $0.34 per diluted share.\n\nResults in the current quarter were led by Enact with $156 million of adjusted operating income. Results from our U.S. Life Insurance and runoff segments totaled $20 million of adjusted operating income and corporate and other activities, which comprises our holding company debt service, reported a $17 million adjusted operating loss. Turning to Slide 6.\n\nEnact hosted its earnings call earlier this morning and provided a thorough update, so I will focus on the key highlights of its quarterly performance. Insurance in force increased 9% year over year to $242 billion driven by new insurance written and higher persistency. For Enact, continued rising rates will drive higher persistency and a meaningful benefit to the portfolio yield due to the shorter duration of the mortgage insurance portfolio. Moving to Slide 7.\n\nCurrent quarter results reflected a favorable $80 million pre-tax net reserve release which drove a loss ratio of negative 17%. The reserve release was primarily from favorable cures on COVID-19-related delinquencies. The estimated PMIERs sufficiency ratio of 174% or approximately $2.2 billion above published requirements remained strong and was up first quarter, driven primarily by the execution of a new excess of loss reinsurance transaction, business cash flows and lower delinquencies. A quarterly dividend payment of $0.14 per share generated $19 million to Genworth.\n\nThe quarterly dividend from Enact, along with its announcement to pay a special dividend this December is positive for Genworth. I'm very pleased with the NAC performance, the strength of its portfolio and balance sheet and its commitment to return capital to shareholders as exemplified by the authorization of a share repurchase program announced yesterday. Genworth will participate in a share repurchase program to maintain our current ownership of approximately 82%. Returns of capital from Enact will enable Genworth to invest in future growth, and return capital to our shareholders.\n\nI'll now cover our U.S. life insurance segment results, starting on Slide 8. The segment reported adjusted operating income of $11 million, reflecting adjusted operating income of $25 million from LTC and $19 million from fixed annuities partially offset by an adjusted operating loss of $33 million in life. In our LTC business, adjusted operating income was $25 million, compared to $34 million in the prior quarter and $133 million in the prior year.\n\nCurrent quarter results reflected continued strong earnings from in-force rate actions and unfavorable impacts from new claims benefit utilization and claim terminations as the effect of the COVID-19 pandemic aside. Net investment income of $497 million was higher than the prior quarter, driven by limited partnership income, which was up sequentially, but lower than the prior year. Income from bond calls and commercial mortgage loan prepayments was also lower than the prior year, given the significantly higher rate environment. This higher interest rate environment allows us to invest at attractive new money rates, which will benefit the portfolio over time.\n\nActive claim mortality counts can be seen on Slide 9. During the quarter, we reduced our previously established COVID-19 mortality reserve by $11 million pre-tax, bringing the remaining balance to $99 million. The elevated mortality we've seen since the second quarter of 2022 with the onset of the pandemic was lower in the current quarter compared to last year, which is consistent with COVID-19 mortality trends in our life business and nationwide. As shown on the right-hand side of the slide, we saw a higher level of new active claims in the first nine months of the year compared to 2021, an indication that new claim incidence is trending back to its historic levels, although still below 2019 levels.\n\nNew claim severity continued to increase in the current quarter as expected, given the aging of the block. Our newer blocks of business, which are beginning to enter into their claim years have higher daily benefit amounts and inflation coverage than the older LTC blocks. Also contributing to higher new claim severity is a shift in the claims mix away from home care that people gravitated to during the pandemic, back to higher-cost facility-based care. We continue to make significant progress in addressing risk in our legacy LTC portfolio through the multiyear rate action plan, as you can see on Slides 10 through 12.\n\nDuring the first 9 months of 2022, we received LTC in-force rate action approvals impacting $610 million of annualized in-force premiums with a weighted average increase of 33%. The resulting $200 million in incremental annual premium increases brings the total net present value from achieved LTC rate actions to $21 billion since 2012, up approximately $1.4 billion since year end. Reserve releases resulting from benefit reductions decreased from the prior year as the implementation of the Choice 1 legal settlement was materially completed in the second quarter. While the Choice 1 legal settlement implementation is materially complete, the second LTC legal settlement related to PCS 1 and 2 policies began on August 1 and covers approximately 15% of our LTC block.\n\nGiven the 90-day policyholder election window, we expect meaningful financial impacts to begin in the fourth quarter. Policyholder notification in the election window is based on the policyholder anniversary date. Therefore, the majority of the impacts will be in 2023 settlement related to our Choice 2 policies is still pending with the final court approval hearing scheduled later this month on November 17. This settlement represents 35% of our LTC block as Choice 2 is our largest LTC block of business.\n\nDependent on the outcome of the legal proceedings, we expect to begin implementing this third settlement in 2023. Although these two other settlement agreements are similar to the first legal settlement for our Choice 1 policies, final results will ultimately depend on policyholder election rates and the types of elections chosen. However, based on our experience with the Choice 1 settlement, we believe that overall, the settlements are favorable to both the policyholders and Genworth and will reduce our tail risk on our LTC block. Turning to Slide 13 and our life insurance product.\n\nWe reported an adjusted operating loss of $33 million compared to operating losses of $34 million in the prior quarter and $68 million in the prior year. The key driver of the improvement seen in the current quarter was lower mortality compared to the prior year as impacts from the pandemic continued to subside. COVID-19 claims accounted for only $6 million of the loss, which was significantly lower than the prior year. In the current quarter, total term deferred acquisition cost or DAC amortization was $24 million after tax, which was higher than the prior quarter and prior year primarily from term lapses as the 20-year term block issued in 2002 entered the post-level premium period.\n\nWe recorded a $10 million after-tax charge for DAC recoverability testing in our universal life insurance products related to continued runoff of the block and unfavorable mortality experience, compared to $12 million in the prior quarter and $30 million in the prior year. Regarding fixed annuities, adjusted operating income was $19 million compared to $21 million in the prior quarter and $28 million in the prior year, reflecting lower net spreads from lower bond calls and commercial mortgage loan prepayments and as well as continued block runoff. Our Runoff segment comprised mainly of variable annuity products reported adjusted operating income of $9 million for the current quarter, compared to $2 million in the prior quarter and $11 million in the prior year. Current quarter results were impacted by equity market performance, which was unfavorable compared to the prior year, but less unfavorable than they were in the prior quarter.\n\nAs indicated on Slide 14, we're estimating the consolidated risk-based capital ratio for Genworth Life Insurance Company, or GLIC, to be 285% at September 30, a slight decline from 290% at June 30 and 289% at year end. The statutory balance sheet of the U.S. Life companies has strengthened materially over the last few years with significant improvements in our capital and surplus balance. In the fourth quarter, we will complete assumption reviews of all of our U.S.\n\nlife insurance products, including our annual review of LTC claim reserve and active life reserve assumptions, as well as complete our loss recognition and cash flow testing. The data used in our 2022 assumption updates will generally not include data after 2019, as we do not have sufficient information around the longer-term effects of the pandemic, which is consistent with our approach last year. Based on the preliminary work done to date, our assumptions appear to be holding up in the aggregate, and we do not currently anticipate significant assumption changes or resulting significant financial impacts from these reviews. But this is only a preliminary review as our assumption reviews are not yet complete, and we also continue our efforts to work cooperatively with the relevant state insurance regulators in order to secure LTC rate actions included in our assumptions.\n\nWe will provide an update of our results on our fourth-quarter earnings call. As we look toward the end of the year, I wanted to provide an update on the adoption of the new GAAP accounting standard, long-duration targeted improvements or LDTI, impacting our life insurance companies. We will adopt this new standard on January 1, 2023, which will require us to represent certain financial information beginning on January 1, 2021, otherwise known as the transition date. This new standard does not impact Enact.\n\nAnd as Tom and I have mentioned before, it will not impact our cash flows, economic value or statutory accounting and related capital levels for our life insurance companies. While work is still underway, I wanted to share more about how we expect LDTI to impact our U.S. GAAP equity position as of the January 1, 2021 transition date. The most significant impact to equity will be from our LTC business, and we expect a decrease in the accumulated other comprehensive income, or AOCI, given the very long duration of the product.\n\nThe decrease is primarily due to the requirement to remeasure our insurance liabilities using a single A-rated bond rate as the discount rate. The single A bond rate as of the January 1, 2021 transition date was materially lower than our discount rate of over 5% under the existing guidance. We currently estimate a net after-tax decrease in AOCI for our LTC liabilities of approximately $12 billion to $13 billion as of the January 1, 2021 transition date, largely from the change in the discount rate. However, it's worth pointing out that with the adoption of LDTI, our insurance liabilities, especially for LTC will be more sensitive to movements in interest rates.\n\nFor example, if the transition date adjustment use current rates and held everything else constant, the $12 billion to $13 billion reduction in AOCI would have more than reversed and the change in AOCI for LTC would have been positive. This illustrates the volatility in our U.S. GAAP AOCI that will likely occur in future periods as the discount rate fluctuates and reinforces why we've increased our statutory disclosures. As I mentioned, we do have more work to do on other components of the new accounting guidance, such as impacts on retained earnings and our life insurance and annuity products Therefore, we have not yet determined the full impact on our U.S.\n\nGAAP equity position after adoption of this new guidance in 2023. We remain focused on implementing this major accounting change for the first quarter of 2023 and we'll provide an update on our fourth-quarter earnings call. Rounding out our results for the quarter, we reported an adjusted operating loss in corporate and other activities of $17 million, compared to a $14 million adjusted operating loss in the prior quarter and $1 million of adjusted operating income in the prior year. Results in the prior year included a nonrecurring tax benefit of $21 million from a reduction in uncertain tax positions.\n\nCurrent quarter results reflected lower interest expense compared to the prior year from the holding company debt reduction. Turning to the holding company on Slide 15. We ended the quarter with $145 million of cash and liquid assets. Key cash activity included an inflow of $64 million from intercompany tax payments and the $19 million dividend from Enact as well as the outflow for the 2024 debt redemption of $154 million, which included $2 million in the make-whole premium.\n\nAs mentioned last quarter, we do not anticipate paying federal taxes in 2022, but anticipate we'll begin to, at some point in 2023 when our corporate deferred tax assets are exhausted. We continue to expect full year 2022 net intercompany tax payments to the holding company of $200 million to $250 million. Year to date, we've received approximately $185 million. I'll close where I began regarding how we're positioned from a capital perspective by reaching our holding company debt target we're now in a position to be able to meet the financial conditions for removing the restrictions placed on Enact by the government-sponsored enterprises or GSEs.\n\nWe expect to fully meet Genworth's leverage ratio condition by the end of this year which in turn should lift restrictions on Enact by early 2023. We view this as a positive development for Enact and Genworth as majority owner as Enact will no longer be subject to more stringent capital requirements than its peer group. On an ongoing basis, we expect the regular quarterly dividends from Enact to cover our debt service costs and public company expenses. Expected future proceeds from the special dividend from Enact, which will be approximately $150 million in December, will provide greater cash flow available to deploy toward growth and shareholder return initiatives.\n\nAs we think about our capital allocation strategy going forward, our first priority remains investments in growth, namely our long-term care advice and service offerings, which are less capital intensive than insurance offerings. Secondly, we'll be in a better position to increase the pace of share repurchases as we accumulate excess cash, which we've begun doing already in the fourth quarter with an incremental $25 million of common stock repurchased in October at an average price of $4 per share. We continue to believe our stock is trading below intrinsic value and that repurchases are an effective way to capitalize on that disconnect while returning value to Genworth shareholders. Genworth has had three consecutive quarters of solid performance and will end the year and head into 2023 with greater financial flexibility.\n\nI'm proud of the accomplishments we've made this year particularly on our strategic priorities of achieving our debt target, maximizing the value of Enact to Genworth shareholders and returning capital to shareholders. Now let's open up the line for questions.\n\nOperator\n\n[Operator instructions] We will take our first question from Ryan Krueger with KBW.\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nI had a couple of questions on long-term care. My first one was you had mentioned seeing some higher claim severity as people start moving away from home care and back into higher-cost facilities. I was curious, is this more -- is this just more similar to what pre-pandemic behavior was? Or can you give any perspective on how it looks more compared to the pre-pandemic levels?\n\nTom McInerney -- President and Chief Executive Officer\n\nRyan, I'll ask Brian Haendiges to answer that one.\n\nBrian Haendiges -- President, US Life Insurance\n\nYes. Ryan, thanks for asking. So I would say, first, we don't look at our assumptions or behavior in isolation. We look at everything in aggregate.\n\nAnd as Dan mentioned a few minutes ago, as we look at all those assumptions in concert, we feel like we're in pretty good shape and will not likely need a change. We still have to go through our process. It's pretty robust. We have a lot of meetings during the course of the year to make sure that we understand the assumptions, but -- and we'll come back in the fourth quarter and be clear.\n\nBut it doesn't look like we're likely to have any pressure at the end of the year. For severity, I think you're seeing a little bit of a return after the pandemic to other situations. So if people had they were taking care of somebody in the house. They're not able to do it.\n\nThey're moving back into facilities. So we're seeing a little bit of that. But we would view that as more temporary than longer term.\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. And then somewhat related question. Can you just talk about how healthcare inflation is impacting long-term care experience and what you're seeing so far in terms of that impact on your claims?\n\nTom McInerney -- President and Chief Executive Officer\n\nYes. It's a very similar answer there. Again, we look at everything in concert, and we look at everything together. We feel like the assumptions are holding up pretty well.\n\nI think over the short term, we have seen some inflation as the rest of the country has with everything. But when we look at inflation in particular, just as with all our assumptions, we look over the long term. We've got obligations over the next 20, 30, 40, 50 years. So we have to look over that longer term.\n\nAnd over that long term, we believe that, again, everything holds together nicely. And on top of that, there are offsets to inflation. So for example, when inflation is up interest rates tend to be up, and that's a good guide that offsets the bad guide that comes with inflation.\n\nOperator\n\n[Operator instructions] We'll take our next question from Tom Slattery with Morgan Stanley.\n\nTom Slattery -- Morgan Stanley -- Analyst\n\nCongratulations on all the progress that you've made in the past few years. I had a question on capital allocation. The interest payments on the $600 million floating rate bond that you have, have moved from last year, about $12 million a year, with rates rising, they're now up to close to $40 million a year. So it's been a dramatic increase in the interest payments that you're obligated to make on that $600 million floating rate bond.\n\nSo my question is, have you considered open market purchases of that bond since it's trading at such a big discount? And would open market purchases make sense to reduce that interest payment and improve the --\n\nTom McInerney -- President and Chief Executive Officer\n\nThere is a challenge with the 34 data and what the covenants are. But, Dan, if you want to just give some of the background on that.\n\nDan Sheehan -- Chief Financial Officer and Chief Investment Officer\n\nYes. So thanks, Tom. A couple of points I would make on that. First of all, it's a very attractive long-term financing for us and has some equity benefit as well.\n\nBut the rate on that is which will switch over to SOFA approximately plus 200. So in the long run, our view on rates is that this is a temporary blip and that over the next 10, 20, 30 years, we'll see rates normalize, and that financing will continue to be very attractive to us. And even at current levels, it's reasonable financing for us. So it's not creating any type of strain.\n\nOn top of that, the fact that we've eliminated frequently in the debt puts us in a position where that debt service, even though it's elevated versus the rate lows a few years ago is still well covered just by the Enact dividend. And so it creates no sense of urgency from our perspective. We think the level of debt that we have is the right level for the company today. But as you might expect, we're always looking at the debt that we have remaining and thinking about the ways to optimize that through time.\n\nSo that's something we'll certainly consider. But near term, our priority really was taking care of the near-term debt and taking care of the 24s and getting all that behind us. And we sit right now, I think, in a very comfortable place.\n\nTom McInerney -- President and Chief Executive Officer\n\nDan, do you want to just comment on in order to repurchase the 66 in the open market. We have a covenant, we have to redeem the 34th first.\n\nDan Sheehan -- Chief Financial Officer and Chief Investment Officer\n\nVery practically speaking. I mean, first of all, as a rule, I mean, we generally wouldn't be looking to replace the longest-duration debt first. Most companies will chip away at the near-term securities. But in our particular case, we have covenants in the 2034 debt, which do not allow us to pay down the 2066 hybrid until we either retire the 2034 or reduce the outstanding balance below $100 million.\n\nSo right now, should we choose to, we would be restricted by that covenant. There are lots of ways to deal with that. But like I said, the next maturity we have is until 2034, and we've got a lot of time to sort that out.\n\nOperator\n\n[Operator instructions] Ladies and gentlemen, as there are -- it looks like we've had one additional question queue up, just one moment. We'll take our next question from Anthony Steinmetz with Shawnee Capital.\n\nAnthony Steinmetz -- Shawnee Capital -- Analyst\n\nGood quarter. I just had a question about the long term or the MYRAP goal, the $28.7 billion. Is that the correct number? Is the $28.7 billion is the goal you guys are trying to hit?\n\nTom McInerney -- President and Chief Executive Officer\n\nAnthony, that's right. That's the current estimate based on the review that we did at the end of 2021.\n\nAnthony Steinmetz -- Shawnee Capital -- Analyst\n\nOK. My question is, given the interest rate environment, how is that going to impact that estimate? And any color around how susceptible that is to change? And what are some of the key factors and that would impact that number?\n\nTom McInerney -- President and Chief Executive Officer\n\nSo, Anthony, good question. part of the answer is how long interest rates will stay up as they've obviously increased in the last 12 months or so. And as Brian said earlier, the assumption is really long-term assumptions, what do we think the interest rates will be over the next 20, 30, 40 years. So I think where we are today, we would -- we're not changing our long-term interest assumption.\n\nWe'll continue to follow it. Should the case B, that interest rates stay higher for longer, there's a significant benefit to us because we've got overall about $32 billion of statutory reserves. And obviously, if you earn higher interest rates for the longer term, that benefits the overall book of business and getting to breakeven sooner. So higher interest rates, if we assume for the long run, they'll be higher, that obviously benefits and would reduce the gap that we have.\n\nWe do have some disclosures in the 10-K and 10-Q around interest rates and what a long-term change would mean in terms of that net present value amount that we need.\n\nAnthony Steinmetz -- Shawnee Capital -- Analyst\n\nOK. And just one follow-up. With regard to peak claim years, I think it's in the 10-K or -- my understanding, it's around 2031. Is that 1 claim years you guys estimate to be?\n\nTom McInerney -- President and Chief Executive Officer\n\nSo, Anthony, I think that's right. And I would say our largest book, and Dan talked a little bit about Choice 2 in the settlement. The Choice 2 block is the largest over 300,000 policies. Their average age is 72.\n\nAnd while peak claim years are somewhere in the 83%, 85% range. So looking at that, it's about another 10 to 12 years for Choice 2 being our largest block that will obviously have an impact. The second largest block is Choice 1, the about 220,000 policies, I think. So those two together are more than half the book.\n\nAnd the average age for the Choice 1 policyholders is 76. And so again, 83, 85, so you are 7 to 10 years away. And so that's why we say, as those 2 blocks age, the other blocks will age, of course, but because those are the most significant, that puts us around 20, 30, 20, 32 as the peak claim years.\n\nOperator\n\n[Operator instructions] Ladies and gentlemen, as there are no further questions, I will now turn the call back over to Mr. McInerney for closing comments.\n\nTom McInerney -- President and Chief Executive Officer\n\nThank you very much, Karen, and thank you to all of you for joining the call today. We're very proud of the progress we've made on our long-term value-creation strategy. We look forward to updating you as we achieve new milestones and bring new care solutions and services to market to fuel future growth for Genworth. In closing, I would be remiss not to mention that November is National long-term care awareness fund.\n\nThis important observant serves to highlight the long-term care needs of Americans over the age of 65. As we begin the next chapter of our story with our new global care solutions business, we're focused on learning from our experiences over the last 40-plus years. And the data that comes with that to help people understand and plan for the care they want and may need. We look forward to continuing to empower our existing policyholders, but also new customers and their families to navigate the aging journey with confidence.\n\nThank you for your questions. And with that, I'll turn the call back over to Karen.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSarah Crews -- Director, Investor Relations\n\nTom McInerney -- President and Chief Executive Officer\n\nDan Sheehan -- Chief Financial Officer and Chief Investment Officer\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nBrian Haendiges -- President, US Life Insurance\n\nTom Slattery -- Morgan Stanley -- Analyst\n\nAnthony Steinmetz -- Shawnee Capital -- Analyst\n\nMore GNW analysis\n\nAll earnings call transcripts"
}