{
  "companyName": "DocuSign",
  "companyTicker": "DOCU",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/09/docusign-docu-q3-2023-earnings-call-transcript/",
  "content": "DocuSign (DOCU -0.59%)\nQ3 2023 Earnings Call\nDec 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Thank you for joining DocuSign's third-quarter fiscal year '23 earnings conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\nAs a reminder, this call is being recorded and will be available for replay from the Investor Relations section of the website following the call. [Operator instructions] I will now pass the call over to Heather Harwood, head of investor relations. Please go ahead.\n\nHeather Harwood -- Head of Investor Relations\n\nThank you, operator. Good afternoon, and welcome to the DocuSign Q3 2023 earnings call. I'm Heather Harwood, DocuSign's head of investor relations. Joining me on the call today are DocuSign's CEO, Allan Thygesen; and our CFO, Cynthia Gaylor.\n\nThe press release announcing our third-quarter results was issued earlier today and is posted on our Investor Relations website. Now, let me remind everyone that some of our statements on today's call are forward-looking. We believe our assumptions and expectations related to these forward-looking statements are reasonable, but they are subject to known and unknown risks and uncertainties that may cause our actual results or performance to be materially different. In particular, our expectations regarding the pace of digital transformation and factors affecting customer demand are based on our best estimates at this time and are therefore subject to change.\n\nPlease read and consider the risk factors in our filings with the SEC, together with the content of this call. These forward-looking statements are based on our assumptions and expectations to date. And except as required by law, we assume no obligation to update these statements in light of future events or new information. During this call, we will present GAAP and non-GAAP financial measures.\n\nIn addition, we provide non-GAAP weighted average share count and information regarding free cash flows and billings. These non-GAAP measures are not intended to be considered in isolation from, a substitute for, or superior to our GAAP results. We encourage you to consider all measures when analyzing our performance. For information regarding our non-GAAP financial information, the most directly comparable GAAP measures and a quantitative reconciliation of those figures, please refer to today's earnings press release, which can be found on our website at investor.docusign.com.\n\nI'd now like to turn the call over to Allan. Allan?\n\nAllan Thygesen -- Chief Executive Officer\n\nThanks, Heather, and good afternoon, everyone. I'm happy to be here for my first earnings call as DocuSign's CEO. I'd like to begin by thanking Maggie Wilderotter for leading the team as interim CEO. Maggie set the stage for a smooth and seamless transition, and we're grateful to her for her leadership and for her continued stewardship as our board chair.\n\nThere are three main points I'd like you to take away from today's call. First, we delivered solid third-quarter results, exceeding the key operating metrics we laid out last quarter despite the continued macro headwinds. Our results are a reflection, I think, of the continued signs of stabilization across the business. I'd like to commend our team for their unwavering commitment despite the considerable distraction.\n\nSecond, as the global leader in the e-signature category, DocuSign is expanding across broader agreement-related workflows. We have challenges to address, but we have an exceptionally strong foundation and meaningful competitive advantage, which leads me to my third point. I believe our future is bright. Along with the team, I'm personally energized by the opportunity and the work that lies ahead.\n\nI'm confident in our progress, and I believe we are unequivocally well positioned for the long term. Now, before I move on to discuss the future of our business, I want to share what compelled me to join DocuSign. I followed the company for many years, and like our over 1 billion users, I find our value proposition distinctive and invaluable. We've built a powerful brand that's recognized by decision-makers well before we even engage with them.\n\nThat combination of affinity that DocuSign has with customers and users and our untapped market potential is very rare in the enterprise software space. Now, DocuSign created and built the e-signature category, yet agreement processes are still at the early stages of moving from pen to paper to more automated ways of working. In fact, I believe we're just at the beginning of revolutionizing how businesses initiate, negotiate, and manage agreements, and we will leave that as we did for e-signature. We provide solutions for customers of all sizes, industries and functions.\n\nDuring my almost 12 years at Google, I first led the global SMB and mid-market business and then the enterprise business in the Americas, including managing our relationships with our largest global partners. I've experienced firsthand how exceptionally powerful a broad, diversified customer base can be, and I'm excited to bring that experience to DocuSign. For my first 60 days, I've focused on gaining a deeper understanding of our business, meeting with employees across the company, as well as spending time with customers and partners. Through these conversations, I've started to identify some critical areas in which we can improve to strengthen our value proposition in addition to scaling the business by streamlining and creating efficiencies.\n\nI continue to see customers embrace and expand with our core e-signature offering. For example, this past quarter, one of the U.K.'s largest healthcare providers expanded their use of e-signature. They began the journey as a customer during the pandemic, and they've now migrated their entire patient onboarding process and adopted our products across their HR, legal, joint ventures, and other departments. Key criteria in the recent competitive selection process included privacy and security of their customer data and the ability to utilize the advanced workflow features we offer.\n\nNotwithstanding our considerable strengths, I believe it's important to acknowledge where we have not executed as well. It's clear we did not pivot quickly enough, and we were slow to make changes. As we experienced tremendous growth during the pandemic, we did not scale the team properly. We lost some innovation velocity.\n\nWe didn't fully address the changing market dynamics nor mature our operations and systems sufficiently. We understand those gaps, and we're committed to moving forward with more transparency. I think the good news is that the future is in our own hands. So, let me turn to our focus going forward.\n\nWe are committed to broadening the category. That starts with a more clearly defined product road map that leverages our core e-signature strength and our ambition of delivering easier, smarter, trusted agreements. We see opportunities beyond the replacement of paper signatures to deliver innovative new experiences and integrate more deeply with partner applications. If you think about it, many use cases don't require editing or completion of the static, unstructured, highly formatted traditional agreement.\n\nInstead, I think data capture for agreements should happen through digital forms on the web or in an app. The agreements themselves should be dynamically generated, and the metadata should be automatically captured to enable personalization for future interactions. With our new web forms offering, which is currently in early beta, we're enabling our customers to transition from a PDF-centric experience to guided web-native experiences. We're also continuing to innovate on the CLM front, further solidifying our vision, customer validation, and execution within the CLM space.\n\nMost recently, DocuSign was named the leader in the Gartner 2022 Magic Quadrant for CLM for the third consecutive year. We play the highest of all vendors on the ability to execute access and second highest on the completeness of vision access. These products directly support each other. We're encouraged by how existing e-signature customers continue to embrace our CLM capabilities to enhance and speed their workflows.\n\nFor example, this past quarter, we expanded our relationship with one of the largest ride-sharing organizations. Our team identified key areas of expansion using our signature and CLM product to support their evolving business needs. They expanded their e-signature footprint and are now more streamlined in their internal processes, thanks to our CLM offering. Over the next few quarters, we'll expand our work here and augment the road map to broaden the power of managing workflows throughout the agreement life cycle.\n\nWhile we're not seeing dramatic shifts recently in the competitive landscape, it is important to recognize that today's market is more competitive, particularly for the basic sign use cases, which further highlights the importance of an innovative and differentiated product portfolio like DocuSign's. I want to touch on our plans to improve operations and sales productivity. While we are continuing to lead with innovation, we are staying hyper-focused on making the customer experience more seamless and integrated, particularly with our go-to-market motion. I think that starts with bolstering our self-service mill initiatives.\n\nI was deeply involved in enabling self-serving for every stage of the order cycle for customers at -- of all sizes at Google, and I know the power of a frictionless experience. I'm confident we can achieve both improved customer experiences and greater go-to-market efficiency as we move in this direction. We already have over 1 million customers who self-serve. The inbound traffic to our website continues to grow, and we have a highly recognized and trusted brand.\n\nSo, we have a lot to work with. We also want to create stronger efficiencies in our direct, sales, and field efforts and strengthen our partner ecosystem. So, I'm pleased that sales attrition is continuing to moderate, and we're seeing stabilization in the field. Moving forward, we're focused on improving funnel conversion, consolidating and streamlining our teams, strengthening our focus on customer success and retention, and implementing new incentive structures, all with the goal of driving efficiency and accountability.\n\nWe're also leaning in on simplifying our pricing and packaging strategy, recently began rolling out new product bundles to enable customers to more easily access useful and differentiated productivity features, which in turn further the customer ROI and improve retention and being the customer a richer experience. We know that customers who use more than three features are more likely to expand their footprint with us, and that will be critical for more profitable growth at scale. We already have an industry-leading partner ecosystem. This represents a significant opportunity to expand customer value and distribution reach through our network of ISVs, resellers, system integrators, and developers.\n\nBy reimagining how we engage that ecosystem, we expect to create a platform that will see stronger revenue contribution from our partners and help unlock and fuel international expansion opportunities in particular. I personally visited customers and teams in four of our key European markets last week, which reaffirmed that one of our most significant growth opportunities will come from international markets. During the trip, I had the pleasure to meet with one of the world's leading communications carriers. They've been a customer for seven years now.\n\nOur account team identified key areas to drive growth with expanded use cases which accelerated adoption, which in turn led to an early renewal expansion. So, we're excited to grow our footprint in their ecosystem as they continue to leverage our products to digitize their customer experience and reduce operating expenses while helping to create a more sustainable future. Lastly, internally, our operational focus has been on streamlining our processes, upgrading our internal systems, and modernizing more of our own workflows to improve efficiency and scalability. As an example, we just closed our first quarter on our new ERP system, which has been a key dependency for automating more of our operations.\n\nIn summary, I believe we're acting with urgency to recalibrate the business and leverage our strong foundation to adapt to the evolving business landscape and the changing and challenging macro environment. These efforts will take time, and they represent a continued evolution for DocuSign. However, I am fully confident that the opportunity is here for DocuSign and is within our reach with a clear strategy, focus, and execution. Thank you for your time today.\n\nI'm thrilled to be leading DocuSign, and I'm committed to being transparent with all of you about our progress as we move forward. Now, I'll hand it over to Cynthia, who will take you through our Q3 financial results and outlook. Cynthia.\n\nCynthia Gaylor -- Chief Financial Officer\n\nExcellent. Thanks, Allan, and good afternoon, everyone. We delivered solid Q3 results, delivering on the top and bottom line. We continue to expand our customer base and remain focused on progress against our key priorities as we execute against our long-term strategy.\n\nAs the macro becomes more challenging, we are seeing softening demand trends materialize, including smaller deal sizes and expansions with increased customer scrutiny on priorities and budgets in some cases. On the other hand, we are still seeing healthy results as customers recognize DocuSign offers high-ROI applications that are easy to use, efficient, and cost-effective. Let me now review our Q3 results. Total revenue increased 18% year over year to $645 million, and subscription revenue grew 18% year over year to $624 million.\n\nThe continued strengthening of the U.S. dollar resulted in a couple-point headwind to total revenue growth in the quarter in line with our previous expectations. The impact was not material to our results. Our international revenue grew 23% year over year to reach $157 million in the third quarter, representing 24% of our total revenue.\n\nThird-quarter billings grew 17% year over year to $659 million as our installed base continued to expand. The strength in billings growth was partially driven by early renewals, particularly renewals from Q4. As a reminder, quarter-to-quarter billings can fluctuate due to the timing and completion of deals, including timing of renewals and expansions. Customer growth remained strong as we added approximately 42,000 new customers during the quarter, bringing our total installed base to 1.32 million customers worldwide at the end of Q3, a 19% increase compared to a year ago.\n\nThis includes the addition of approximately 10,000 direct customers to reach a total direct customer base of 202,000, a 26% increase over last year. We also saw a 34% year-over-year increase in customers with an annualized contract value greater than $300,000, reaching a total of 1,052 customers. These results demonstrate progress against our key initiatives. However, we continue to see the effects of a more challenging macro environment.\n\nReal estate and financial service verticals continue to see headwind. So, even within these sectors, we see pockets of expansion with customers for specific use cases. Expansion use cases underscore our product differentiation and value for our customers as we continue to invest in innovation around broader agreement workflows. As it relates to verticals, we are also encouraged by relative strength in our manufacturing, retail, business services and technology sectors, highlighting the important benefit of our diversified customer base.\n\nAnd while the global slowdown presented challenges more generally, we saw varying degrees of strength and weakness across all regions and segments. Dollar net retention was 108% for the quarter. We continue to see more muted buying patterns and slower expansion rates from customers in the current climate. We expect buying patterns to remain cautious in the near term, resulting in dollar net retention continuing to trend downward for the remainder of the year.\n\nTotal non-GAAP gross margin for the quarter was 83%, compared to 82% last year. Q3 non-GAAP operating profit reached $147 million, compared with $122 million last year. Non-GAAP operating margin was 23% from 22% last year. Non-GAAP net income for Q3 was $118 million, compared with $121 million in the third quarter of last year.\n\nAs noted on our Q1 call this year, we introduced a non-GAAP tax rate within our non-GAAP net income calculation as we reached consistent non-GAAP profits for the prior three years. We're using a non-GAAP tax rate of 20% for fiscal '23. Q3 non-GAAP EPS was $0.57. In September, we announced a restructuring plan, which included a workforce reduction in response to the changing environment.\n\nThis was not an easy decision but was an important step for the health of the business. Our GAAP results include $28 million in Q3 restructuring-related expenses. As we take a long-term view of the opportunity ahead, we will evaluate the best ways to reinvest capital into areas that accelerate initiatives and present the strongest return. We are committed to making progress in a sustainable way toward our long-term target margin.\n\nWe ended Q3 with 7,522 employees compared to 7,056 last year. The restructuring process is well underway, and we expect to be substantially completed by the end of the fiscal year. The workforce reductions, coupled with more disciplined spending and cost containment throughout the company, drove strong Q3 non-GAAP operating margin. While we are pleased with the Q3 margin, we delayed some spend in the quarter, and we'll continue to evaluate the most critical areas for investment.\n\nOperating cash flow in the third quarter was $53 million, representing an 8% margin. Free cash flow was $36 million or a 6% margin. As we mentioned on our Q2 earnings call, during the third quarter, we implemented a new ERP, a foundational system for our company. The go-live was successful with smooth implementation and no material disruptions to our core processes.\n\nAs noted on our last call, the timing of cash collections and payments were impacted by the ERP transition, as we anticipated, and some were pushed from Q3 to Q4. We also incurred one-time cash expenses in Q3 related to the restructuring. On a more normalized basis, excluding the impact from the restructuring and our ERP implementation, our operating cash flow margin would have been approximately 14%, and our free cash flow margin would have been approximately 12%. This compares with operating cash flow of $105 million or a 19% margin and free cash flow of $90 million or 17% margin for the same period last year.\n\nWe expect lower restructuring cash payments to benefit fourth-quarter cash flows relative to Q3. We exited Q3 with more than $1.1 billion in cash, cash equivalents, restricted cash, and investments. Turning to our share repurchase program, we repurchased approximately 740,000 shares during the quarter for approximately $38 million, which demonstrates our confidence in the durability of our business and in the opportunities ahead. As of the end of Q3, we had approximately $137 million in remaining buyback capacity.\n\nWe remain committed to opportunistically return capital to our shareholders. With that, let me turn to our Q4 and fiscal '23 guidance. For the fourth quarter and fiscal year '23, we anticipate total revenue of $637 million to $641 million in Q4, or a growth of 10% year over year, and $2.493 billion to $2.497 billion for fiscal '23, or growth of 18% to 19% year over year. Of this, we expect subscription revenue of $624 million to $628 million in Q4, or growth of 11% year over year, and $2.423 billion to $2.427 billion for fiscal '23, or growth of 19% year over year.\n\nFor billings, we expect $705 million to $715 million in Q4, or growth of 5% to 7% year over year, and $2.626 billion to $2.636 billion for fiscal '23, or growth of 11% to 12% year over year. We expect non-GAAP gross margin to be 82% to 83% for Q4 and 81% to 82% for fiscal '23. We expect non-GAAP operating margin to reach 20% to 22% for Q4 and 18% to 20% for fiscal '23. We expect to see a de minimis amount of interest and other income.\n\nWe expect non-GAAP fully diluted weighted average shares outstanding of 205 million to 210 million for both Q4 and fiscal '23. Looking ahead, we are in the early stages of planning for next year and focused on executing across our critical priorities to finish the year strong. While we will not be formally providing guidance for next year, we would like to share a preliminary outlook for fiscal '24 informed by what we are seeing across the business and in the broader macro environment. We currently expect a slower start to the fiscal year.\n\nFor total revenue, we would expect high single-digit growth during fiscal '24. For billings, we would expect low single-digit growth for next year. We're committed to maintaining our disciplined approach to expenses, carefully addressing and prioritizing strategic investments that will drive our sustainable growth at scale. As a result, we expect to operate at the lower end of our long-term target operating margin range of 20% to 25% in fiscal '24.\n\nIn closing, we delivered a solid Q3 despite a challenging operating environment. To drive growth, we'll continue to invest thoughtfully and closely monitor the returns on our investments, pivot as needed, and evaluate opportunities to drive growth, efficiency, and profitability at scale. Our Q3 results are a meaningful indicator of the strength of our business and the customer value proposition we deliver that allows us to delight our customers in a meaningful way. We are thrilled to welcome Allan to DocuSign and want to take a moment to also thank our team for their exceptional work and focus during this time of transition.\n\nWhile we know it will take time for our progress to be fully reflected in our financial results, we are committed to advancing the business and executing against our long-term strategy while delivering sustainable growth at scale. We look forward to updating you on our progress. Thank you again for joining us. And with that, operator, let's please now open up the call for questions.\n\nOperator\n\nAnd at this time, we'll be conducting a question-and-answer session. [Operator instructions] And our first question comes from the line of Tyler Radke with Citi. Please proceed with your question.\n\nTyler Radke -- Citi -- Analyst\n\nYes, thanks for taking the question, and welcome aboard, Allan. I wanted to ask you. You made some comments just around broadening the category, integrating with partner applications. Maybe talk about where you see the most low-hanging fruit.\n\nAnd, you know, as you look at the business, I mean, clearly, this is a business that has gone from high-growth into more low-growth mode as you're looking at the outlook. But where do you kind of see the medium-term opportunity here in terms of where you can get back to if you accomplish all your strategic initiatives? And then I have a quick follow-up for Cynthia.\n\nAllan Thygesen -- Chief Executive Officer\n\nYeah. Thanks for that. So, the first thing I would say is if you think about all the steps in the agreement workflow, we did an excellent job nailing the specific use case of signing an agreement. But all of the other steps, I think, remain -- there remains plenty of opportunity to revamp that.\n\nAnd so, as I alluded to in my prepared comments, we're excited about the opportunity, for example, to redefine what an agreement looks like. It doesn't have to be this highly formatted document. It's something you can enter on a web page. We already have clients who do this with us.\n\nMobile carriers have people sign up through DocuSign, but it looks like a web interface. And a variety of health organizations use our new functionality to do this for patients. So, once they've gone through it once, they can pre-fill the agreements and sign-ins for future. So, I think this functionality around helping people both create the agreement and, in a sense, negotiate and complete them online is a significant opportunity.\n\nLooking on the personalization side, you can imagine, we do this today with Salesforce and a variety of other platforms. Reps can send out documents that are personalized and tailored to the customer based on data that's already in the system, again, a way of integrating directly with third-party applications and leveraging the simplicity and power of DocuSign. Post agreement, I think the CLM space hold tremendous promise for DocuSign, both in terms of extracting more value, more business value from agreements, as well as on the risk and compliance side. And I've had a number of meetings with large enterprises that are excited about both of those use cases.\n\nSo, I feel like there's actually quite a bit of breadth there, and we're just at the early stages of delivering against that opportunity.\n\nTyler Radke -- Citi -- Analyst\n\nGreat. And Cynthia, you talked about some early renewals in the quarter. And I guess I'm wondering, since the Q4 guidance was kind of in line with the prior implied guide. Was the early renewals kind of the -- driving most of that upside that you saw in the quarter? And if you could kind of just unpack what you think drove those early renewals.\n\nWas it customers kind of consuming ahead of contracts that they renegotiated down post-pandemic? And if that's the case, do you still think there could be some more of that as you look out in the coming quarters? Thank you.\n\nCynthia Gaylor -- Chief Financial Officer\n\nThank you. So, we were -- we were super pleased with where the billings number came out. It did come out better than we were expecting, and it was driven, you know, primarily by early renewals. And when you look at kind of the customer dynamic there, I would say a few things as we have dug into it.\n\nOne is it's mainly -- we have a certain level of early renewals in every quarter. We had more early renewals coming in from Q4 into Q3 this quarter than we normally would have from a Q plus 1. And it's really driven by where customers are in their usage of the product and capacity. And what we were seeing was there were more customers at capacity who were looking to expand or increase their usage with add-on products.\n\nAnd so, that was leading to early renewals because they were at capacity on their subscription. And so, those were brought in a quarter earlier than the renewal would have come due. And so, I think to commend our sales team, taking deals off the table as they come due in the quarter is great. And, you know, we feel good about where we are for Q4.\n\nWe're not anticipating that dynamic. We will have early renewals as we always do, but that level is kind of baked into the guide now for Q4.\n\nTyler Radke -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Josh Baer with Morgan Stanley. Please proceed with your question.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Congrats on a really strong quarter, and welcome, Allan. Wanted to ask you about a comment you made around increasing competition for the core signature use cases. Was wondering how much of your business would you say fits in that category.\n\nAnd then more broadly, as you've been digging in on the space, just wondering for your take or your view on the competitive landscape and DocuSign's positioning. Thanks.\n\nAllan Thygesen -- Chief Executive Officer\n\nYeah. So, first of all, I think at the highest level from a category perspective, we feel good that, fundamentally, helping businesses close agreements electronically, it's both a cost and productivity saving and a better customer experience. And so, we think that's relatively resilient from a macro perspective. In terms of the competitive landscape, we do see some competition at the low end.\n\nI would see sort of generic e-signature without much of the value-add that I think we excel at. And so we've got to become a little bit more engaged competitively in that space without damaging our value and premium positioning. And so, we're looking at ways to do that. But the vast majority of our products -- of our revenue come from customers who appreciate the value that DocuSign delivers.\n\nI'll just give you a couple of examples. We know from a variety of surveys that customers see that when they send agreements with DocuSign, people tend to sign faster. They're more likely to sign, they're more satisfied. There's a more positive brand halo.\n\nAll of that feeds into a premium positioning. In addition to that, we tend to do very well on helping with the internal workflows in the companies that adopt DocuSign, which creates cost savings and efficiencies. So, I feel pretty bullish that we can maintain our position. But it's absolutely true at the low end, it's super high-volume commodity e-signature, there's more competition.\n\nAnd we need to be more agile in responding to that, and we're working on that as we speak.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Appreciate it.\n\nOperator\n\nOur next question comes from the line of Michael Turrin with Wells Fargo. Please proceed with your question.\n\nAustin Williams -- Wells Fargo Securities -- Analyst\n\nHey, great. This is Austin Williams on for Michael Turrin. I just wanted to go back to the expansion rate. It looked like the expansion ticked down a touch here.\n\nIs there anything you would call out as it relates to those expansions and how we should think about that settling in from here?\n\nCynthia Gaylor -- Chief Financial Officer\n\nThat was on the dollar net retention number? You broke up a little bit.\n\nAustin Williams -- Wells Fargo Securities -- Analyst\n\nYes.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. So, on last quarter's call, we talked about kind of that trend line. And as I said in my prepared remarks, we would continue to expect the trend line to push downward in Q4. You know, I think what's embedded in that number is mainly expansion rates are moderating, and so the growth and expansion is declining.\n\nAs a reminder, that's a -- it's a dollar net retention number. So, it's based on our book of business. The book of business is quite large, so it takes larger dollars and larger rate of expansion to move the number up. And just given some of the dynamics we've been talking about the last few quarters around expansion rates and deal sizes contracting, we would expect to see continued pressure on that particular metric for Q4.\n\nOperator\n\nAnd our next question comes from the line of Brad Sills with Bank of America. Please proceed with your question.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nWonderful. Thanks for taking my questions, and welcome, Allan. I wanted to ask a question on Agreement Cloud. As the company starts to transition over the longer term, I understand toward a more workflow-oriented business.\n\nToday, we think of e-signature as transactional. Do you think there's a different go-to-market that's required here to really materially move the needle and gain some traction there? You talked about some SI efforts there, global SIs, etc. I assume they would play a role there. But any thoughts on that? Thank you.\n\nAllan Thygesen -- Chief Executive Officer\n\nYes. So, a couple of points there. I think from a customer segment perspective, we have a very nicely balanced book of business now across SMB, mid-market, and enterprise. A lot of our enterprise adoption has been departmental level historic, but we're negotiating more enterprise-level agreements.\n\nI think we need to continue to evolve our sophistication and readiness there. We've brought in some leaders with great experience there, but I think we're still coming up the curve in terms of being fully ready to being a broad enter platform supplier, if you will. So, that would be my -- the main point I'd make on that. In terms of the other parts of the business, I think the CLM business is already very much an enterprise play.\n\nAnd as we've rolled that out, we've seen a lot of our larger deals, you know, have a significant CLM element. So, we're pushing hard on that. I think that is still a relatively early stage market opportunity. As you noted, there's -- it's so complicated and there's so much customization on a vertical- or company-specific basis that, inevitably, there's a strong service element to that.\n\nWhile we will have a base level of services, we absolutely need third-party partners like the big SIs and others. And they're very eager. In fact, we have a lot of inbound interest to partner with DocuSign in creating combined solutions to address those needs. So, I'm bullish on that, but I want to maintain DocuSign's focus as a SaaS software company with necessary customer success and professional services elements and then augment that with the ecosystem of ISVs and SIs and others to present solutions to enterprises that have more complicated needs.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat to hear. Thanks, Allan. And then one for you, Cynthia, if I may, please. Just on the guidance for next year, low single-digit billings growth.\n\nThis quarter, you saw, it looks like 19%. Obviously, you had some deals pulled into Q3, but, you know, good results in comparison to kind of the guide. So, just what are you factoring in for next year? Is it a worsening macro? You talked about some elongating sales cycles and perhaps deal size compression. Are you just assuming that, that environment sustains here? Any color on just what's factored into that next year outlook? Thank you.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah, sure. So, we're not technically guiding to next year. We're kind of giving you our best view of what we're seeing. And, again, in the spirit of of being transparent, we did want to provide some direction to what we're seeing as we look into Q4 and next year.\n\nYou know, the embedded assumption there, I guess, when you look at Q3, it was 17%. Q4 is, I think, 6%. And so, we're certainly seeing kind of a more challenging macro environment and some softening trends materialize. And I talked about kind of smaller deal sizes, smaller expansions, and expansions at a slower rate.\n\nSo, I think those things in particular between the macro and then what we're just seeing with customer behavior on the softening trends of expansions. Customers are still expanding, but they're just expanding at a lower rate, and that puts pressure on the growth rate. You know, I'd also say in the macro, there's just more scrutiny by customers on spend and budgets. So, we're not modeling material degradation there or material improvement.\n\nSo, we're kind of assuming just kind of a softening macro environment that we're currently seeing.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Cynthia.\n\nOperator\n\nOur next question comes from the line of Mark Murphy with JPMorgan. Please proceed with your question.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nYes, thank you very much, and I'll add my congrats. Allan, I'm interested in how commonly do you sense that some of your customers might have overprovisioned themselves with DocuSign capacity during the pandemic. And maybe now, they've been drawing down some of that e-signature inventory in a manner that maybe it could position them to run out of the excess capacity. It sounded like you actually might have seen a little bit of that here in Q3 and where they might be able to reengage on new purchases.\n\nMaybe it's in the back half of next year or somewhere out beyond that.\n\nAllan Thygesen -- Chief Executive Officer\n\nI do think that we're we're on the tail end of that part of the cycle as we've -- significantly lapping COVID as a broad phenomenon and the stance the companies took at that time. At the same time, of course, some of our customers saw very inflated volumes during COVID and during a very low interest rate environment. You're familiar with the government loan scenario. I think the mortgage and real estate volumes, which just simply lower now even if they have completely exhausted their pre-bought envelope allotments.\n\nSo, I think I'd like to be cautiously optimistic along the lines that you note. But I think there's that counteracting factor of some of the things that were the most volatile, whether it was the most prebuying, are probably also people who are now in a different demand environment, if that makes sense.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nOK. Yes. Understood. And just as a quick follow-up, how are you viewing the partnership between DocuSign and Microsoft, how that might evolve over time? Because I think there's a viewpoint out there that Microsoft is conspicuously absent from this market in some ways in that perhaps they could end up offering e-signature as part of Office 365.\n\nAnd I'm just wondering if you see any opportunity to be involved there or perhaps if you see some other angles to that relationship.\n\nAllan Thygesen -- Chief Executive Officer\n\nYeah. I mean there's a lot of pieces to that. First, I'd just say, look, we're really excited about our evolving partnership with Microsoft. As you know, we entered into a large strategic partnership deal with them earlier this year.\n\nThey are -- and we've delivered a number of really, I think, exciting new integrations with Microsoft, with Teams, with SharePoint, Build, and others. So, I'm -- and we have -- I think we're still just scratching the surface of what we're capable of in terms of integration with a variety of Microsoft platforms. So, I -- look, I expect that Microsoft and Google will have some basic e-signature capability embedded in their office suites. But I don't really think that that's the core value that we provide.\n\nWe provide a lot of richness and workflow around signature that goes well beyond what I think the core office suites will supply. And I don't -- I don't feel that that is the biggest competitive risk that we face. I think we're very pleased with the progress of the partnership with Microsoft and with the other software suppliers. I think most of them view us as the best-of-breed partner for them, and we want to capitalize on that.\n\nAnd, of course, they're a huge partner for us with our amalgamation to Azure. So, that's a whole separate topic.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Jake Roberge with William Blair. Please proceed with your question.\n\nJake Roberge -- William Blair -- Analyst\n\nHey, thanks for taking my questions, and congrats on the great quarter. So, given signature usage from existing customers and the incremental new logo next year may be impacted as a result of the macro, how do you expect your expansion motion, so thinking about CLM, notary or premium pricing, insurer capabilities like ID verification to perform next year?\n\nAllan Thygesen -- Chief Executive Officer\n\nWell, I think -- on the one hand, I think you will see us expand the number of products that we have that we can offer across the entire agreement workflow, as I outlined earlier. And at the same time, I think if we make it too complicated and itemize the buy too much, we make it harder to buy and we don't necessarily include some of the features that truly differentiate us from low-end competitors. And so, one of the big pushes this quarter that I initiated was a better bundling mechanism to bring together some of these features so that we make -- as well as an initial onboarding for new clients to make sure they get off to the right start and that they are using not just the core e-signature capability but some of the other features you allude to. And, you know, the early signs of that are promising.\n\nSo, we are, at the same time, I think packaging more of the features that directly relate to e-signature and making sure that we're fully selling that bundle of features and expanding our footprint to other aspects of agreement workflow that we recharge for separately.\n\nJake Roberge -- William Blair -- Analyst\n\nGreat, thanks. And then, Cynthia, if you could just add any commentary on the linearity of demand trends month-to-month throughout the quarter and into November. Did anything change over the last months leading into Q4 as it relates to demand or usage of your products?\n\nCynthia Gaylor -- Chief Financial Officer\n\nYes. I would say there hasn't been material changes from exiting Q3 into Q4, and that kind of informed some of our macro comments. I would say and just maybe reiterate what we said on last quarter's call, we have been seeing a little bit of shift in linearity in the quarter itself between the months. And so, I would say that continued in Q3 in month three.\n\nWe saw softer linearity leaving the quarter than entering the quarter than we had historically -- than we have historically seen in the kind of those quarter linearity trends -- intra-quarter.\n\nJake Roberge -- William Blair -- Analyst\n\nThat's helpful commentary. Thanks, again, for taking my questions, and congrats on the great results.\n\nOperator\n\nOur next question comes from the line of Rishi Jaluria with RBC. Please proceed with your question.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks so much for taking my questions. Allan, welcome aboard and very much looking forward to working with you. Two questions, if I may, just on the kind of preliminary outlook or framework or whatever we want to call it for next year.\n\nReally appreciate the color, a helpful way of thinking about things. I guess, just for starters, if we think about low single-digit billings growth for next year, I'm sure there's some sort of cadence there in terms of maybe lower in the first half, higher in the second half, just given the macro picture. When we think about that, I mean, that kind of implies that calendar year '24, FY '25 will be mid-single digits growth. And I know it's way too early to start talking guidance for that.\n\nBut maybe more importantly, what would need to be done to bridge that gap from that baseline that you're talking about based on the billings guidance to a growth rate that you'd be happy with? Because I can't imagine you'd be happy with -- given the market opportunity and everything, with mid- to high single digits growth. So, maybe, can you walk through what from an execution and market opportunity standpoint needs to happen to get that growth rate, you know, to where you'd want it to be? And then I've got a follow-up.\n\nAllan Thygesen -- Chief Executive Officer\n\nYeah. I think, first of all, we set aside macro, which obviously weighed heavily on us as we looked out to 2024. And you don't want to presume that the economy is necessarily going to get better. So, that is embedded in our forecast.\n\nBut looking beyond that, I think the key -- the key levers for us are we got to get our digital motion to work much better, and that's a huge focus and investment area for us now. We think we can capture more business that way. But until we can really prove that to ourselves, we're certainly not going to put it in our guidance. And similarly, I think we have a series of product initiatives that will roll out over the next two, three quarters that I think will dramatically broaden our footprint.\n\nBut, again, until we have a little bit more solidity there, it would be imprudent to include that in even a preliminary outlook. So, I think we have -- our international opportunity is another one where we'll be doing some significant investing in 2024. That market is at a much earlier stage of evolution, and we have significant headroom there. So, I think there's a number of areas where we hope to see significant upside.\n\nObviously, I didn't join to run a low or mid-single-digit revenue company. So, I'm pushing very hard to get us to a different place, and we're -- we hope to have a lot of news to report on that over the next few quarters.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. And I might just add that.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nFantastic. Sorry, go ahead.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. Sorry, I might just add to that. The -- our fiscal '24 is calendar '23, right? So, that's -- it's an outlook, it's not a guide. Ninety days from now, we'll give a more specific guide, so we'll be able to give you more detail there.\n\nUnderstand what you're talking about in terms of calendar '23 into calendar '24. As we said, we would expect the first half of next year to be kind of -- get off to a slower start, and that's partly macro and it's partly the initiatives that Allan was talking about. We are going to take some time to gain traction. And so, the scenario where, I guess, calendar '24 could be better would mean that macro has probably gotten better, and then some of the initiatives are starting to take off.\n\nAnd you start seeing that in the back half of next year because that can spill into the following year. I would just say, though, our -- when we give guidance and we give outlook, and you all have been following the company for quite some time, there are opportunities and there are risks. And, you know, we've, I think, balanced those things in kind of what we're telling you in the spirit of the '24 is really to provide transparency to what we're currently seeing, but it's still balancing those opportunities and risks. So, I just want to make sure that you all understand that.\n\nAllan Thygesen -- Chief Executive Officer\n\nYes. I mean, I think what I would just add to that. Cynthia is exactly right. What we're giving you now is an extrapolation of our current trends.\n\nWe have a lot of levers that we're pulling, and we hope to be able to update you on those over the course of the next several calls. We're bullish on long-term prospects. We think we have a lot of headroom and are very well positioned.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAll right. Fantastic. Really helpful, both of you. Thank you.\n\nAnd then just kind of a quick follow-up. If we think about the margin, not guidance, for next year, you're talking about the low end to about 20%. I guess, you know, given that you also have all these cost savings that you've been working at generating over the past quarter, two quarters, a 9% rip. I imagine that a lot of the upside that you're getting from those cost savings, you're reinvesting in the area.\n\nSo, maybe can you walk us through why would margins not be higher? And if it is, in fact, you're just reinvesting in other areas, what are kind of those top investment priorities that's getting that margin to 20%, again, in spite of the cost-cutting focus and the 9% rip? Thank you.\n\nCynthia Gaylor -- Chief Financial Officer\n\nSure. I'll talk about the margin, and then Allan can talk about some of the investments. So, on the margin, our long-term target margin has been 20% to 25%. So, we're expecting to be at the lower end of that into next year -- would be what we'd expect.\n\nSo, we would get some uplift from the restructuring that we've done and are in the process of completing. But we -- as you said, we would be reinvesting in the business. And, you know, it's -- a lot of it is around things like international, the go-to-market initiatives, and R&D in particular. And those pieces, I think, are going to be really important.\n\nAllan Thygesen -- Chief Executive Officer\n\nYeah. Just to add to what Cynthia was saying, look, I think our go-to-market motion needs to become more efficient. We need to grow into -- we've made some adjustments. We need to grow into the infrastructure that we have and do a lot more on the digital side, as I've alluded to.\n\nSo, that's an area where I would hope to see our metrics continue to improve. I'd say I feel differently about our R&D investment. You know, we are, frankly, below many of our SaaS peers in terms of our divestment-relative revenue. And I think we have a -- a lot of ideas, a lot of opportunity here.\n\nAnd I think we -- to the extent that we invest sort of beyond baseline, that will probably where the bulk of it goes.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAll right. Wonderful. Thank you so much.\n\nOperator\n\nAnd our next question comes from the line of Kirk Materne with Evercore ISI. Please proceed with your question.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nHi, there. Thanks very much. Allan, maybe following on to your last comment on the go-to-market. Have most of those changes been put in place, I guess, to date? Obviously, some of those it's difficult to do that as you're trying to close up a fiscal year.\n\nOr are you waiting to sort of instrument some changes, perhaps on the direct side, as we get into the beginning of next year? I was just trying to get a sense on if there's still some -- I assume there's always going to be some tweaking, but have some of the more fundamental changes been established? Or is that something that you're still waiting on doing once you close out this fiscal year?\n\nAllan Thygesen -- Chief Executive Officer\n\nNo. We're not planning any broad efforts risk type of structures along the lines of what we did for the whole company last quarter. We're going to continue to tweak. I mean, I think the market environment is dynamic.\n\nWe're going to continue to move resources around as I alluded to. And individual functions and departments in the go-to-market function elsewhere, I think we'll see some prioritization or deprioritization. But I'm not looking to do anything at the macro companywide level.I do expect that we will get significantly more productive and efficient in our go-to-market motion and that's a hugely for us. In addition to the digital side, we've had an all-hands-on-deck effort to remove friction internally and to just realign and combine functions.\n\nWe were overly segmented, I believe. And so there was just a lot of work to get our field operation organization in a better state. I think Steve Shute, our president of fields has done a very nice job pulling that together, bringing in senior leaders. And I think we're much better poised to grow with the resources that we have today than we were six months ago.\n\nAnd some of those initiatives that I alluded to on the self-serve side will obviously bear more fruit in the next few quarters.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThat's really helpful. And then, Cynthia, really quickly, you brought up, obviously, in the cash flow discussion the ERP implementation. Are there any other big systems that need to be sort of upgraded given you guys have scaled so quickly? Or is that sort of the biggest one that was outstanding? Just trying to get a sense if that's another area -- your potential spend for you all next year.\n\nCynthia Gaylor -- Chief Financial Officer\n\nYeah. I mean, we need to continue to invest in our systems and more automation. But I would say ERP has been a multiyear endeavor, you know, that started before I even joined the company. So, it's a big milestone for the company that will enable a lot of other automation to happen.\n\nSo, we'll continue to invest there, but I wouldn't expect another project as large as that project and cross-functional in the near term.\n\nAllan Thygesen -- Chief Executive Officer\n\nYeah. I agree with that. Just to add to that, I think -- I don't think there's anything huge to talk about from an investment perspective. But just for color, this company feels like it has one of every SaaS product that's been backed by the venture industry in the last 10 years, certainly.\n\nSo, we need to dramatically clean that up and get to a much smaller number of anchor tools. In addition to our ERP system, the other big focus this year has been on our Salesforce implementation, which obviously is a core platform. I think we're in much better shape now than we were at the beginning of the year. And there's a couple of other areas where I think we have opportunity to dramatically simplify and consolidate, and that will help everyone become more productive.\n\nBut it's not going to have not going to be able a magnitude that Cynthia went through with the ERP project.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThat's super helpful. Thank you all.\n\nOperator\n\nAnd we have reached the end of the question-and-answer session. I'll now turn the call back over to Allan Thygesen for closing remarks.\n\nAllan Thygesen -- Chief Executive Officer\n\nThank you. Well, thank you all for joining to hear more about where we're headed. I'm excited to be on this call with all of you and to be leading this incredible iconic company. In closing, we believe we delivered a solid Q3, and we're focused on delivering an exciting product road map and improving the efficiency of our go-to-market to drive growth and profitability.\n\nMy first two months have affirmed DocuSign's tremendous headroom, strong customer relationships, and world-class talent. I'd like to thank our employees, our customers, and our partners for their warm welcome and the insights and dedication they've shared. I look forward to updating all of you as we make progress. Thank you for joining.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHeather Harwood -- Head of Investor Relations\n\nAllan Thygesen -- Chief Executive Officer\n\nCynthia Gaylor -- Chief Financial Officer\n\nTyler Radke -- Citi -- Analyst\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nAustin Williams -- Wells Fargo Securities -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nJake Roberge -- William Blair -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nMore DOCU analysis\n\nAll earnings call transcripts"
}