{
  "companyName": "Esports Technologies, Inc.",
  "companyTicker": "EBET",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/esports-technologies-inc-ebet-q3-2022-earnings-cal/",
  "content": "Esports Technologies, Inc. (EBET 21.78%)\nQ3 2022 Earnings Call\nAug 15, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to eBET's third quarter results webcast. Today we have CEO, Aaron Speach; CFO, Jim Purcell; and CMO, Mark Thorne. During the course of this call, statements made that are not statements or historical fact constitute forward-looking statements are subject to risks, uncertainties, and other factors that could cause our actual results to differ materially from those contemplated in these forward-looking statements. Forward-looking statements are based on management's current assumptions and expectations of future events and trends which may affect eBET's business strategy, operations, or financial performance. Existing and prospective investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of today's date.\n\nFor more information, please refer to the risks, uncertainties, and other factors discussed in eBET's SEC filings. All cautionary statements that are made during this call or applicable to any forward-looking statements that are made whenever they appear. You should carefully consider the risks, uncertainties, and other factors discussed in eBET's SEC filings. eBET undertakes no obligation to update any estimate projections or forward-looking statements.\n\nAaron Speach -- Founder and Chief Executive Officer\n\nWelcome, everyone. We thank you for listening to our Q3 call, and we're very excited to update you on our company's performance over the last quarter. The team and I have made huge steps this last quarter to adapt to the market conditions, and in doing so we made the decision to go through a major restructuring. This restructuring involved transitioning away from unprofitable areas of the company as well as optimizing marketing spend in our core markets around the world. Through these two changes, we are proud to say that we are on a run rate in the month of August to be EBITDA positive, and we have reduced the two major sources of cash burn on the company.\n\nThe first change we made was to scale back marketing in the UK, as the cost per customer in the UK was increasingly challenging. We made the decision to cut down the spend by almost $1 million a month in order to only spend in sectors and with affiliates that provided a responsible ROI. With a major focus on our CRM acquisition, we have been able to maintain much of the revenue that would normally be lost in a move like this. Our CRM team has been doing a stellar job of reactivating old accounts and keeping players on our site longer.\n\nThe other major change we made to the company was restructuring how we move forward with e-sports. We made the decision to cut the projects on the roadmap that were not producing revenue. In doing so, we brought our headcount to under 40 and properly right-size the company. We still believe in e-sports and Gogawi is still a brand we are looking to grow globally and believe in its future potential, and the e-sports market keeps growing and the audience moves into different wage brackets. This restructuring has been monumental for us and has almost immediately, in just two short months, taken us from a cash burn of approximately $1.3 million per month to a positive run rate of EBITDA. We have done this despite the euro struggling significantly against the dollar.\n\nNow I want to preview a bit of our innovation. We are very excited about Crypto Derby and can't wait to show off that product next year. Crypto Derby is a unique wagering system that will allow a player to wager on cryptocurrencies as if they were horses. It is a full parimutuel product that pits 12 cryptos against each other on a racetrack, and whichever crypto has the best two minute price increase wins the race.\n\nAnd we order all the horses first to 12th, which will allow players to bet on exactus, trifectus, and perfectus. Just like in real horse racing. The product is B2B focused and we can't wait to get it into as many online casino platforms as possible. And we also see huge potential for it in the land- based casinos as well. As you can see, we are still moving full speed ahead on innovation and Mark will give a bit more detail.\n\nBut just to preview a few more, we have our Karamba redesigned, which is set to come out on fiscal Q1 next year. We believe this will have tremendous impact on our conversion rates as well as customer retention. And then we also have our e-affiliates platform launching fiscal Q1 of next year. And this will modernize the tools our partners and affiliates get. We expect this to help us close more affiliates as well as get existing affiliates to send more traffic in 2023.\n\nThese key pieces of tech will help us grow this business in the coming years. But immediately we have two major avenues of growth we are focusing on. We are still actively pursuing acquisitions and feel that market consolidation is inevitable. We are also expecting to grow through new markets next year and expect to receive both our Netherlands and Ontario licenses in fiscal Q1 2023. Netherlands has a total addressable market or TAM of over 13 million people.\n\nThe Netherlands is one of the wealthiest countries per capita and is seen as a fantastic casino and sports betting market. Similarly, Ontario has a TAM of over 11 million people. Ontario has a fantastic per capita income as well. We also have historical data in Ontario, and we believe we would be able to activate those customers in a ROI-friendly manner. We are extremely excited about this new path we have taken and the strides to become profitable have paid off.\n\nI am now going to hand it over to Jim to cover the financials in more depth. Take it away, Jim.\n\nJim Purcell -- Chief Financial Officer\n\nThank you, Aaron, and welcome to everyone listening. During the three months ended June 30th, 2020, our third fiscal quarter, we recorded revenue of $18.2 million and gross margin of $7.2 million. Our revenues increased dramatically when compared to the same period the prior year, but down about 4% quarter-on-quarter. Revenue in the current quarter was impacted by the strength of the US dollar, market adjustment to Germany, and increased competition in the UK and other markets. Our solid revenue performance is even more impressive when you consider the appreciating dollar.\n\nDuring the current quarter, the U.S. dollars appreciate by 5% compared to the previous quarter. Our businesses are primarily located in Europe, and we earn revenue in the currency in a major place, which is primarily the euro and to a lesser extent the British pound. As reported, our revenue in U.S.\n\ndollars, a strong dollar negative impacts our reported revenue. Despite the currency headwinds, we continue employed in marketing strategies to improve our business in the competitive markets. Finally, our revenue performance will improve once we obtain market access to the Netherlands as expected. We now expect to enter the market in calendar year 2023. As the earnings explained subsequent quarter, and we've taken significant measures to improve the profitability of our business in the short term. We ended the quarter with a cash position $6.9 million, down from $7.1 million at the prior quarter end.\n\nDuring the quarter, we completed $3.5 million equity raise, and we continue to manage our cash and working capital very closely. Our adjusted EBITDA for the quarter was a negative 4.0 million, an improvement of 700,000 when compared to the prior quarter. To be clear, our adjusted EBITDA is calculated by starting from our loss from operations of 7.0 million and adding back non stock compensation cost of 1.1 million and depreciation amortization cost of 1.9 million. We expect our EBIT to be significantly improved in Q4 2022 and throughout fiscal 2023. With that, I'll hand it back over to Aaron.\n\nThanks.\n\nAaron Speach -- Founder and Chief Executive Officer\n\nThank you for breaking that down for us, Jim. Now I'm going to hand it over to Mark to discuss the restructuring and the marketing initiatives. Take it away, Mark.\n\nMark Thorne -- Chief Marketing Officer\n\nThank you, Aaron. Let me elaborate a bit on the restructuring plan Aaron discussed. Subsequent to quarter end, we have made significant progress in improving the profitability of the business and expect to make additional strides. The focus on iGaming has resulted in a reinvigorated company structure that has empowered our outstanding people to be laser focused on the success and growth of our iGaming business. We believe our revamped structure will assist all areas of our business, from our business intelligence unit to our revamped technology and design unit to deliver better results.\n\nIn parallel, the acquisition, SEO, and affiliation teams have a clear remit they can follow through and execute on. From a marketing perspective, we employed a two-pronged approach with acquisition and retention strategies. On the acquisition front, we are focused on improving our profitability metrics and implementing these across all acquisition channels for all brands, verticals, and markets. The initial results have allowed us to cut marketing spend that did not adhere to our new return on advertising parameters.\n\nSpend smarter, not harder, is our key guiding principle. The initial reward results the team have been able to achieve are fantastic. Since June 2022, we have reduced marketing spend by over $1 million per month, lower the cost per acquisition of each customer to levels that are in line with our profitability objectives, maintained new player value, and the amount of the first deposit. These efforts and results have been helpful to the swift turnaround and business performance.\n\nA fundamental second pillar that is no less important consists of our marketing strategies focus on retention and CRM. With a clear focus on reactivating and activating customers acquired over the past two quarters, this team has been exceeding our expectations in reactivating these customers bringing them back to our brands. Similarly, converting registered, non depositing customers into new depositing customers is expected to accelerate in the upcoming quarter. A refresh of our brand offers and promotions are also expected to improve our churn rates, as well as maintaining our first time customer conversion rate. All three of these activities are being constantly monitor to ensure bonus costs are kept under full control.\n\nThe efforts of both team above are paying dividends, and our initial results have resulted in a significant reduction in marketing spend optimization of applied marketing spend, better than expected customer reactivation and activation, all of which is reflected in the reduced marketing spend to revenue ratio. Regarding the company's products and brands, there are some significant updates. Karamba, our largest brand, was successfully launched in Brazil. A market with a huge addressable market and potential. We expect the Karamba brand to be well-received in Brazil and South America in general.\n\nWe expect to sustainably scale up acquisition in Brazil, employing a multi brand and multi vertical strategy, as we will also be launching Hopa.com in Brazil in the upcoming quarter. We expect Karamba to be well prepared for this new, exciting market with all the casino content favorite in the region, as well as providing all the leading payment methods customers expect, such as PIX and Boleto. Brazil could become a very interesting additional revenue stream for the business. Obtaining new licenses is key to our growth plans. As such, license applications are in process with the MGA, as well as for Karamba in Ontario and the Netherlands. Both Ontario and the Netherlands are similar in demographics, though different in a regulatory sense.\n\nThe business is ready to start operating in Ontario, both from a product perspective, but also from an acquisition perspective with affiliates and media partners in the jurisdiction. Karamba has historically performed well in Canada as a whole, and this was recognized recently at the SiGMA North America Awards, where we brought home the award for casino operator of the year 2022. In the next two quarters, we have several product -- projects in the pipeline, which will further support marketing and the wider business. Karamba, our largest and most established casino and sports brand, is undergoing an extensive rebrand and site redesign. This will reinvigorate the brand, not only in our current core markets, but also in our expansion and licensing ambitions for the brand. The new Karamba will reflect the modern nature of a successful online casino and sportsbook.\n\nWith a cleaner and more sophisticated approach. yet without losing the fun and entertainment core components of the brand that our customers love. The new Karamba will be rolled out in most of our markets during Q1 of our next fiscal year. The project will also form the basis for transitioning our other brands to this more up-to-date technology throughout 2023.\n\nEaffiliates, our new, only one affiliate and partner management platform, will also be rolled out to the same time. Built on best in class technology, the new platform will provide affiliates and partners with a one stop solution for maximizing our relationships. Eaffiliates will be the focal point for managing marketing and traffic for Karamba, Hopa, BetTarget, Griffon Casino, GenerationVIP, Scratch2Cash, and Gogawi. As part of our long term strategy with innovation in iGaming, we will also be working on an advanced casino lobby management technology platform, which will allow us to optimize game content presentation and location across all of our online casinos. This project is expected to be rolled out in phases, be completed by Q3 of the next fiscal year.\n\nIt has been a busy but rewarding and successful quarter, and we are all excited about the future. Back to you, Aaron.\n\nAaron Speach -- Founder and Chief Executive Officer\n\nThank you, Mark. And thank you all for joining our Q3 conference call. We're very excited about our Q4, and we'll hope you all join us on our year-end review. Thank you so much and have a great day.\n\nDuration: 0 minutes\n\nAaron Speach -- Founder and Chief Executive Officer\n\nJim Purcell -- Chief Financial Officer\n\nMark Thorne -- Chief Marketing Officer\n\nMore EBET analysis\n\nAll earnings call transcripts"
}