{
  "companyName": "Wynn Resorts",
  "companyTicker": "WYNN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/wynn-resorts-wynn-q3-2022-earnings-call-transcript/",
  "content": "Wynn Resorts (WYNN 1.49%)\nQ3 2022 Earnings Call\nNov 09, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the Wynn Resorts third quarter 2022 earnings call. [Operator instructions] This call is being recorded. If you have any objections, you may disconnect at this time. And I will now turn the line over to Julie Cameron-Doe, chief financial officer.\n\nPlease go ahead.\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nThank you, operator, and good afternoon, everyone. On the call with me today are Craig Billings and Brian Gullbrants in Las Vegas. Also on the line are Ian Coughlan, Linda Chen, Frederic Luvisutto, and Jenny Holaday. I want to remind you that we may make forward-looking statements under safe harbor federal securities laws, and those statements may or may not come true.\n\nI will now turn the call over to Craig Billings.\n\nCraig Billings -- Chief Executive Officer\n\nThanks, Julie. Good afternoon, everyone, and thanks for joining us today. Before I get into the quarter, I'd like to thank the cast, crew and producers of awakening, our news show in Las Vegas, which successfully opened on Monday. The show is yet another example of our willingness to innovate and push the envelope to drive the forward.\n\nI'm incredibly proud of the team behind the shelf. I'll kick off in Las Vegas, where the team turned in a third quarter record of $196 million of EBITDA or approximately $207 million adjusted for lower-than-normal holds. We saw broad-based strength across casino, hotel, food and beverage and retail, all well above third quarter 2021 levels despite the difficult year-over-year comps. The comparison to third quarter 2019 is even more impressive with our EBITDA more than doubling on a 36% increase in revenue.\n\nOur investment in people, facilities and programming and our team's deep sense of ownership continue to elevate in Las Vegas above our peers. This quarter once again highlights the benefit of that deliberate investment strategy. Looking ahead, encouraged that the strength we have experienced over the past several quarters has continued into the fourth quarter. In fact, our EBITDA during October was an all-time monthly record for the property.\n\nSimilarly, our forward-looking indicators also remain quite strong despite well-known macro concerns as room bookings are pacing at or above pre-COVID levels on substantially higher ADRs. Near term, we expect the normal seasonal pattern to hold during the remainder of Q4, with some of the usual softness surrounding Thanksgiving, followed by a strong close to the year in the latter half of December. Turning to Boston, like Vegas, Encore had a strong quarter, generating $61 million of EBITDA. We saw strength across the casino with record gross gaming revenue and on the non-gaming side with record hotel revenue driven by strength in both ADR and occupancy.\n\nThese trends have continued into Q4, with EBITDA per day in October, consistent with the third quarter levels. Looking ahead, we remain excited about sports betting in the Commonwealth, which is expected to kick off early next year. Our retail sports book there will soon be a significant opportunity for customer acquisition. We also continue to finalize our plans for our upcoming development project across the street from the property that will add incremental parking, food and beverage and entertainment amenities.\n\nIn Macau, the market continues to be challenging with marketwide GGR in the third quarter, only reaching approximately 8% of the third quarter of 2019 levels, and our results have reflected that. Our team has done a fantastic job controlling costs in a very challenging operating environment through a combination of decreases in payroll and fixed opex. As a result, despite the nearly two-week closure of casinos in the market in July, our overall EBITDA loss in the third quarter was $66 million, which was a meaningful improvement from a loss of $90 million in the second quarter even after adjusting for a $7 million bad debt credit that benefited the results in the third quarter. More recently, we did see some encouraging pockets of demand during the October holiday period, particularly in our direct VIP business, where turnover was actually slightly above the comparable 2019 holiday period.\n\nAnd in our retail business, where tenant sales reached 74% of 2019 levels. This once again highlights the strong demand for Macau's unique tourism offering during periods when the market is accessible. The authority in Macau continued to advance the concession process according to the preestablished timeline. We were pleased to submit our concession tender application in September and the government is currently reviewing the proposals with decisions expected to be made by year-end.\n\nLong term, we remain excited about the prospects from Macau with so much pent-up demand for travel and tourism in Asia. At Wynn Interactive, our overall EBITDA burn rate declined to $18 million in Q3 from $21 million in the second quarter of 2022 on the back of strong cost controls and improved marketing efficiency. We are looking forward to the potential for a significant catalyst for in Massachusetts. Lastly, we're advancing quickly on our planning for Wynn Marjan, our integrated resort in the UAE.\n\nWe're in the late stages of programming for the resort. Given the pristine beach setting and the somewhat nature of a man-made island, we have incredible canvas with which to work and design something truly unique. I expect we will share renderings, programming and plans more publicly in early 2023. I also expect we will be driving piles for the foundation of the property by the middle of next year.\n\nWe look forward to sharing more details with you about this exciting project in due course. With that, I'll turn it back to Julie to run through some additional details on the quarter.\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nThank you, Craig. In Las Vegas, we generated a third quarter record of $195.8 million in adjusted property EBITDA on $544.4 million of operating revenue during the quarter. Lower-than-normal hold negatively impacted EBITDA by about $12 million in Q3. Our hotel occupancy was 88.8% in the quarter, up 580 basis points year over year and up 90 basis points versus Q3 2019.\n\nImportantly, we've stayed true to our luxury brand and continue to compete on quality of product and service experience. With our overall ADR reaching $426 during Q3 2022, up 8.7% versus Q3 2021 and 39% above Q3 2019 levels. Our other non-gaming businesses broad-based strength across food and beverage and retail, which were up nicely year over year and also well above pre-pandemic levels. In the casino, our Q3 2022 slot handle increased 31.6% year over year and was 72.2% above Q3 2019 levels.\n\nSimilarly, our table drop were up 12.5% year over year, and was 32.4% above Q3 2019 levels despite still suppressed international play during the quarter due to COVID-related travel challenges. The team in Vegas has done a great job of controlling costs without negatively the guest experience, delivering adjusted property EBITDA margin of 36% in the quarter. On a hold-normalized basis, our EBITDA margin was up approximately 1,300 basis points compared to Q3 2019. Opex, excluding gaming tax per day was $3.6 million in Q3 2022, up 10% compared to Q3 2019 levels, but well below the 36% increase in revenue due to lower head and broad-based cost efficiencies in areas that do not impact the guest experience.\n\nWe remain committed to maintaining a cost structure that appropriately balances margins and our service standards. In Boston, we generated adjusted property EBITDA of $61.1 million in Q3 2022 with EBITDA margin of 28.9%. We saw broadband across casino and nongaming during the quarter. In the casino, we generated $184 million of GGR, a property with strength in both tables and slots.\n\nOur nongaming revenue grew 33% year over year, with particular strength in the hotel, driven by 97% occupancy and a $398 ADR. We stayed very disciplined on the cost side with opex, excluding gaming tax per day of approximately $1.1 million in Q3 2022. This was a decrease of over 10% compared to $1.3 million per day in Q4 2019 and broadly in line with Q2 2022. As we've discussed on prior calls, the year over year EBITDA and opex were impacted by a combination of contractual labor agreements, which added around $45,000 per day to our opex base beginning late in Q2 2022, along with a onetime benefit of $3 million in Q3 of last year.\n\nWe're well positioned to drive strong operating leverage as we continue to grow the top line over time. Our Macau operation delivered an EBITDA loss of $65.6 million in the quarter on $115.6 million of operating revenue as the COVID situation in the region has continued to suppress visitation. As Craig noted, while the business has remained challenging, we experienced some encouraging buckets of demand during the October Golden Week holiday period, particularly in our direct VIP and retail businesses. Our opex, excluding gaming tax, was approximately $1.6 million per day in Q3, a sequential decrease compared to $1.9 million per day in Q2 2022.\n\nThe team has done a great job remaining declined on costs in a difficult operating environment. Longer term, we're well positioned to drive strong operating leverage as the business recovers over time. Turning to Wynn Interactive, our EBITDA burn rate improved to $17.7 million in Q3 2022, $1 million in Q2 2022, primarily driven by improved marketing efficiency and disciplined opex control. Moving on to the balance sheet.\n\nOur liquidity position remains very strong with global cash and revolver availability of approximately $2.8 billion as of September 30. This was comprised of $997 million of total cash and available liquidity in Macau and $1.8 billion in the U.S. These numbers exclude the undrawn $500 million intercompany revolving credit facility when resorts entered into with Wynn Macau. Our previously announced sale leaseback transaction for the real estate of Encore Boston Harbor remains on track to close before the end of the year.\n\nPro forma for the transaction, we have approximately $4.4 billion of consolidated global cash and liquidity. Importantly, the combination of very strong performance in Las Vegas and Boston, with the properties generating trailing 12-month EBITDA of over $1 billion, together with our robust liquidity creates a very healthy pro forma leverage profile in the U.S. Finally, our capex in the quarter was $87 million, primarily related to the awakening at Wynn Las Vegas and course maintenance. With that, we will now open up the call to Q&A.\n\nOperator\n\n[Operator Instructions] Our first question comes from Carlo Santarelli with Deutsche Bank. You may go ahead.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nHey, Greg. Hey, Julie. I just wanted to kind of talk a little bit about what both of you mentioned as it pertain to the uptick that you're seeing in Macau. How much of that at this point do you think you could perhaps -- and I understand it's kind of direct VIP, so a smaller number of players can really move the needle.\n\nBut how much of a change have you seen since the visa policies were tweaked a little bit? And with respect to the comments you made on nongaming, is there potentially something that's kind of brewing that's swiftening the pace a little bit of the return of customers?\n\nCraig Billings -- Chief Executive Officer\n\nHey, Carlo. Sure, I'll start, and then I'll ask Ian to comment. I think on the latter portion of your question, with Hong Kong being accessible, I think you've seen pretty reasonable retail sales in Macau, given it's more accessible than Hong Kong. And I think that's just a natural -- that's just a natural outcome of accessibility.\n\nWith respect to your -- the former part of your question, I mean it's like squeezing air in a balloon, right? The demand has to go somewhere. And so, we weren't surprised to see an uptick in direct VIP growth in light of the market having no junkets. So I don't think either one of them were surprising to us. We've seen it before.\n\nOver the course of the past year, when there have been pockets of demand. Ian, would you add anything to that?\n\nIan Coughlan -- President, Wynn Macau\n\nI'd just like to clarify that for EVs is they haven't really gotten moving yet, and they reopened on the 1st of November. So it wouldn't have had an effect on October activity. So the activity that we saw in our VIP area and premium is linked to a certain extent to returning former junket players. We also saw a Chinese New Year.\n\nSo we believe it's our premium positioning in the market and the facility and services that we offer make us attractive to those players, and there will be a return of them in the future.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nGreat. And while you're there, is it possible that we will hear something? I know you guys certainly said by year-end as it pertains to the granting of the concessions. Is it possible that between here and there, seven, eight weeks away, that we will hear some contingent licenses being handed out?\n\nCraig Billings -- Chief Executive Officer\n\nSorry. Anything is possible, Carlo, but the pre-established timeline has been year-end.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nGreat. And then, Craig, while I have you -- I know you mentioned a little bit of development on the UAE and obviously, some ground break next year with more color in the first quarter of '13. But could you talk a little bit about the progress in your learnings maybe at this stage, anything incremental you could share on that front?\n\nCraig Billings -- Chief Executive Officer\n\nYes, sure. I think I mentioned on a previous call that the more time we spend over there, and I was just over there recently, the more we believe in the non-gaming elements of that market. It's a tremendous non-gaming leisure and luxury market. And as I mentioned in my prepared remarks, we're in the pretty late stages now of programming.\n\nSo essentially determining what we're going to build, not how it's going to look per se. And given that it's a man-made island without any existing development, it's an incredibly flexible location on which to plan. For example, if you want to move a beach, you move a beach. So it's a really exciting project.\n\nAnd we've sought to maximize the relationship of the facility to its surroundings, particularly in the non-gaming amenities like food and beverage wellness and really take advantage of such a unique location. Meanwhile, the casino component, where at least for some period of time, we will be operating on our own, which makes it quite exciting is shaping up to be somewhat larger than Wynn Las Vegas, but with numerous pockets of energy and compression. And so, striking that balance is important. When you think about a market like that where you for some period of time, will be the only operator, you certainly don't want to underbuild the casino, but you want to maintain that sense of energy.\n\nSo I think the property is going to be a stunner, and we look forward to sharing more in early 2023.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nGreat. Thank you, both.\n\nCraig Billings -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. The next question is from Joe Greff with J.P. Morgan. Good afternoon, everyone.\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nGood afternoon, everyone. I was hoping you can talk about Las Vegas, Craig, and a way that's going to be a little bit different than how you and your peers talked about trends up until recently, specifically about programming. Can you discuss maybe in this way, that would be helpful as we try to ascertain the sustainability of currently strong trends. Can you talk about how many programming events do you have for the first half of next year versus the first half of this year if visibility stretches out for the full year of next year? And can you compare that to full year of '22? Is there a general rule of thumb relating to incremental revenues of an average programming event?\n\nCraig Billings -- Chief Executive Officer\n\nSure. Look, I think this Las Vegas programming for in some form or fashion. And I think as we emerge from COVID, we were, in many cases, a better location in terms of accessibility, openness, etc., etc., then some of our adjacent markets, particularly California, I think the trend toward programming and the willingness of a higher value customer to pop over to Las Vegas for a particular event increased meaningfully. And so, what I think -- and by the way, at the same time, you obviously had a number of sports teams that had emerged in Las Vegas, notably the who drive a tremendous amount of visitation.\n\nAnd so, I think in general, the town has become quite good at really looking at every weekend or every two weeks is an opportunity to program something. The journey for us, I think, is slightly different, right? We don't think of programming is purely transactional. Who are we going to plug into a particular theater on a particular day. For us, it's more holistic.\n\nHow can we leverage all of the assets that we have in this building, including the golf course, which we've used to great sucess with the match with the recent show that we drummed up and originated here. And so, how do we use the property as a stage? We think about that all the time now. And so, I don't have a heuristic for you, where I can quote to you x number of events per year. Because really, we're focused on it every single week.\n\nBut it's certainly -- it more than just revenue to the property, right? It is -- it makes you the CNBC spot. And that's important because marketing is no longer about billboards. It's about television commercials. It's about content.\n\nAnd so, we've been incredibly good at creating content. And it doesn't hurt that during the pandemic, we continue to invest in this property and invest in our people. And so, we're firing on every single cylinder here, and I think it shows in the numbers and programming is a piece of it.\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nGreat. And then, Craig, my second question relates to a topic that you might be limited in fully entering. We also for filing 13G filing last week. So my questions are, one, have you had any conversations with them.\n\nObviously, you talk with investors in respective shareholders all the time. Two, what has he communicated to the reason for his sizable stake in Wynn, and can you share that?\n\nCraig Billings -- Chief Executive Officer\n\nWell, I guess what I can say is kudos to him because he's done quite well. Since he appears to have started acquiring in the second quarter when the stock was excessively cheap. It's actually right around when we were buying back some stock as well that we reported in our second quarter Q. Based on what we've seen watching our share register as we do constantly, sometime in Q2 began seeing accumulations really by certain banks that have traditionally been associated with derivative transactions like total return swaps, things like that.\n\nAnd we watch those banks established positions in our stock, and we were well aware of them. All in all, I think it's just a great recognition of the value in our equity, but there's not much more to say beyond that.\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nCraig Billings -- Chief Executive Officer\n\nThanks, Joe.\n\nOperator\n\nThank you. The next question is from Shaun Kelley with Bank of America.  You may go ahead.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nHi, good afternoon. Thanks for taking my questions. Craig, just wanted to go a little deeper on Las Vegas. We talked about sort of the top line side a little bit the outlook there.\n\nCan we talk about sort of labor and opex trends, I think hold notwithstanding in the quarter? Operating expenses were up a little bit. Can you just help us think about the puts and takes here as some of the non-gaming mix continues to come back, some of the group in banquet and catering stuff, the show comes in and has a bigger contribution. Can you help us think about sort of the balance of those as we move into next year, and we're starting to lap a really strong margin and rate -- average daily rate performance in '22. I'm sure there's a different impact for dollars than for margins.\n\nSo maybe help us think about some of that as we look out next year.\n\nCraig Billings -- Chief Executive Officer\n\nYes, sure. I'll turn that one over to Brian.\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nSure. Thanks, Shaun. Our team has really been incredibly disciplined over this last year and even before that coming out of the pandemic with respect to opex. We've driven real strong revenues.\n\nThe EBIT and EBITDA margin, as you can see, has been quite strong and in comparison to Q3 '19, amazing performance. So I think this has all been done by us really balancing the revenue, in our cost base and most importantly, our brand and really being conscious of that. There's an impact from seasonality of where we're at. Our hold, obviously, was a little down this last quarter in labor being very well controlled by the team.\n\nAnd I think that we can continue to see margin expansion versus '19 at almost any given revenue level. But the team has really been balanced on focusing on the revenue, the cost base and our brand, and we've seen great growth. As far as ADR, we've seen very little resistance, as you're filing, I'm sure you are. We've leveraged as much we pushed as hard as we can and kudos to our revenue team and sales team, they're absolutely crushing it.\n\nWe are seeing incredible records on our side for ADRs. And that's not just on the transient side. We're seeing that in group across every segment.\n\nCraig Billings -- Chief Executive Officer\n\nAnd I would just add to that. As you know, Shaun, we don't target margin in any particular quarter, right? We target prudent management of our resources in order to deliver an experience that is consistent with brand. We learned a lot during COVID, a lot. We are more nimble than we have ever been with respect to opex.\n\nAnd so, we're running the business with less people. We're delivering on the brand promise, as well as or better than we have historically, and that's how we manage the business.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nGreat. And for my follow-up, maybe for Ian. Just obviously, the channel did open, I believe, on November 1. Has there been any notable change or anything you could just say about traffic levels because that's obviously material area that has been shut down for a very long period of time at this point.\n\nAnd if not, are there some counterbalancing forces we need to be aware of? I know there have been a decent number of lockdowns and COVID outbreaks that also could have some impact here. So just what are you seeing on the ground?\n\nCraig Billings -- Chief Executive Officer\n\nIan, you want to take on?\n\nIan Coughlan -- President, Wynn Macau\n\nWe're very impressed with the government's reaction to the recent outbreak in Macau. When we had an outbreak in the summer, and we had a casino closure, there was a six-week cycle of closure and recovery. And the government has managed to turn it around in two weeks this time. So we are starting to see a buildup in occupancy this coming weekend.\n\nSo we're coming out of our recent outbreak, and I believe we will see the EVs as trickle in, in the next couple of weeks and then pick up pace in the coming months.\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nThank you very much.\n\nCraig Billings -- Chief Executive Officer\n\nThanks, Shaun.\n\nOperator\n\nThank you. The next question is from David Katz with Jefferies. You may go ahead.\n\nCassandra Lee -- Jefferies -- Analyst\n\nHi. This is Cassandra on behalf of David. Can we talk about digital wagering. I think some operators talked about October being close to breakeven or even EBITDA positive.\n\nCan you provide any update or incremental clarity on when you think the business may profit?\n\nCraig Billings -- Chief Executive Officer\n\nSure. So look, in the long term, we think about this business, as I've said on prior calls, we think about it really over the longer term. And in particular, iCasino, where we've had pretty success and our brand has real currency. As we've said before, what we aren't -- and I think we were the first to say so.\n\nWhat we aren't willing to do is burn billions of dollars between now and then, and we've done that. If you look at our results for Q3 year over year, we had almost the same total handle in both Q3 2022 and Q3 2021 on a 90% reduction in marketing spend and an 80% reduction in burn. Because our initial customer cohorts continue to play with us, generating revenue, and we're being very thoughtful with respect to user acquisition promos. With Massachusetts coming up, I would expect a modest uptick in UA, but nothing earth shattering because we have a sizable database there.\n\nAnd we're highly likely to have retail sports betting without mobile for a while. So the goals at this point are to launch Massachusetts, and as you said, achieved breakeven and then grow as the market does, particularly in iGaming, where again, our brand has currency, and we can ultimately drive the best digital customers to win Las Vegas and Encore Boston Harbor. So we're not calling the EBITDA breakeven point yet. But I mean, if you look at our numbers, we're getting pretty close.\n\nCassandra Lee -- Jefferies -- Analyst\n\nGreat. And for the follow-up. Has there been any updated thoughts on the excess land you have in Las Vegas? What are some kind of strategies that could activate the value there?\n\nCraig Billings -- Chief Executive Officer\n\nLook, we're focused -- the type of design and development that we do, you can't spread yourself too thin. So we're very focused right now on the UAE and getting that right. It's a tremendous, very high return opportunity for us we expect. And so, that's really the focus of our design and development efforts at the moment.\n\nCassandra Lee -- Jefferies -- Analyst\n\nGot it. Thanks for taking my question.\n\nOperator\n\nThe next question is from Dan Politzer with Wells Fargo. You may go ahead.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nhey Good afternoon, everyone. So in Las Vegas, you talked a little bit about the programming benefits and going forward, how should we should be thinking about that. As you think about -- along with that, the group and convention business coming back and into 2023 and the occupancy uplift, is it fair to give you guys that full five points credit going forward starting next year? Or is that something that's going to be phased in more gradually?\n\nCraig Billings -- Chief Executive Officer\n\nAgain, we don't really talk about forward guidance, so I can't translate it into basis points. What I would say in general is that you're right, the group and convention business during the earlier portion of this year was a little bit thinner or certainly concentrated in very specific pockets. And over the course of really the past one month, one and a half months or so, we've seen the business come back more fully. So that certainly is an occupancy tailwind, but quantifying it at this point, we don't do that.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nUnderstood. And then, in terms of capital allocation, you're set to receive the proceeds from the Encore Boston sale leaseback in the fourth quarter. Did that change your thinking in terms of allocating capital or in terms of how much you're buying back in terms of stock or maybe even a special dividend?\n\nCraig Billings -- Chief Executive Officer\n\nWell, the recurring dividend is really the cornerstone of our strategy, and it always has been and certainly was pre-COVID. Our U.S. business is generating very, very healthy cash flow. And our high ROIC development projects, UAE, the development we're doing adjacent to Boston, the press has reported that we're interested in New York, those are well funded given particularly the cash infusion that you just referenced.\n\nThe resumption of recurring dividend really hinges on the recovery of Macau. So I think it's a little too early to be talking about significant changes in capital allocation policy, pending the return of Macau, which hopefully is over the next several quarters. So stay tuned.\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nAll right. Thanks so much.\n\nOperator\n\nThank you. The next question is from Robin Farley with UBS. You may go ahead.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thanks. Can you kind of remind us what your interest level is in the potential New York side at this point?\n\nCraig Billings -- Chief Executive Officer\n\nYes. I mean, we -- sure, Robin. So we are all about gateway cities, marquee developments, battleship assets. And so, yes, we're always interested in locations like New York.\n\nThe is in the details, of course, when it comes to what the upfront license payment ends up being, what the tax rate ends up being, what the detailed regulations end up being. But yes, of course, we're interested in New York as has been reported in the press.\n\nRobin Farley -- UBS -- Analyst\n\nBut you wouldn't necessarily give any more detail in terms of like potential location timing expectation?\n\nCraig Billings -- Chief Executive Officer\n\nI think it's been reported that we are working with which is Hudson Yards.\n\nRobin Farley -- UBS -- Analyst\n\nRight. and anything in terms of your timing expectations?\n\nCraig Billings -- Chief Executive Officer\n\nIt's really dependent on the process. The RFP has yet to drop.\n\nRobin Farley -- UBS -- Analyst\n\nYeah. OK. Thank you.\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nThank you, operator. We'll take one last question.\n\nRobin Farley -- UBS -- Analyst\n\nOur final question is from Brandt Montour with Barclays. You may go ahead.\n\nBrandt Montour -- Barclays -- Analyst\n\nHey, good afternoon. Thanks for taking my question. So your margin story was really, really good here this quarter, and you gave a stat on opex per day, growth from '19 of up 10%. And I was curious if we could look at that number on a CAGR basis and sort of get any comfortability around your ability to manage to that growth rate? Or if -- and I guess what I'm getting at is inflation picking up going to sort of impact that going forward.\n\nCraig Billings -- Chief Executive Officer\n\nWell, look, I'll take this one, Julie. So first, you have to think back to our experience during COVID and kind of work forward. So as we emerge from COVID, we were forced actually to become much more disciplined in terms of how we looked at costs. Now we have always delivered the best guest experience in the business.\n\nAnd the challenge that we had was making sure that we continue to do that, but frankly, on a lower FTE count. And we've carried that on. So we're down FTEs relative to '19, even in this quarter and even in last quarter, when we printed nearly $240 million in EBITDA. So when you look at our opex per day now, a lot of it is variable and directly related to revenue.\n\nTo your point on inflation, inflation works two ways in our business. right? The price of a hotel room can be adjusted every minute of every day. And that's one of the benefits of a business like ours. And so, we feel good about our ability to manage labor costs.\n\nNow we have a portion of our business that's and that's true of everybody -- all the major players other than one up and down the strip. And so, that's an important consideration. But we're not staying up at night doing about the cost of labor And in fact, a vast majority or a large number of positions in our building are tipped and folks that are tipped, where else do they want to work, you want to be here. So we feel great about our margins.\n\nAgain, we don't manage quarter-to-quarter to a particular margin we manage our FTEs with discipline, and we try to maximize the revenue and maximize our delivery on the brand promise.\n\nBrandt Montour -- Barclays -- Analyst\n\nExcellent. And then, just as a quick follow-up. When you talk to your internal sales folks who are on the phone every day with the planners at large corporate clients, do you get the sense that there's any unevenness across different corporate sectors, i.e., tech, where people over there sort of looking at '23 gatherings and things that we're thinking about planning and potentially hitting the pause button just given the macro?\n\nCraig Billings -- Chief Executive Officer\n\nBrian, do you want to take that?\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nSure. Thanks, Craig. Brent, I think it's something that's real telling from an industry standpoint is to really just look at the large CES back in 2020 did over 170,000; and in '22, it did 44,000. So certainly, that is an international component -- or strong international component to that business, as well as in the tech industry.\n\nBut then if you look at that just happened this last month, a couple of weeks ago, they had over 130,000. So we're having the most solid year we've ever had. We are going to have our best year ever in group in both room nights and revenue, and we're pacing ahead of that 423. And that's despite January and February having a real soft January and February with Omicron.\n\nSo I think we're well positioned. There are certain industries that are performing better than others, and we're seeing that both at wind and across the city.\n\nCraig Billings -- Chief Executive Officer\n\nWe've been more than able to fade any minor fallout that we've seen from tech, mortgage, etc., etc..\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nYes. We've had a couple of cancellations, but it's nothing out of the norm. In fact, it's kind of below what we would normally see. So I think we're quite comfortable with where we're pacing.\n\nWe're pacing ahead of where we should be, and we are very encouraged by what we're seeing for '23.\n\nBrandt Montour -- Barclays -- Analyst\n\nGreat color. Thanks so much.\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nWith that, we will now close the call. Thank you, operator, and thank you, everyone, for your interest, and we look forward to talking to you again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJulie Cameron-Doe -- Chief Financial Officer\n\nCraig Billings -- Chief Executive Officer\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nIan Coughlan -- President, Wynn Macau\n\nJoe Greff -- JPMorgan Chase and Company -- Analyst\n\nShaun Kelley -- Bank of America Merrill Lynch -- Analyst\n\nBrian Gullbrants -- President, Wynn Las Vegas\n\nCassandra Lee -- Jefferies -- Analyst\n\nDan Politzer -- Wells Fargo Securities -- Analyst\n\nRobin Farley -- UBS -- Analyst\n\nBrandt Montour -- Barclays -- Analyst\n\nMore WYNN analysis\n\nAll earnings call transcripts"
}