{
  "companyName": "Meritage Homes",
  "companyTicker": "MTH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/meritage-homes-mth-q3-2022-earnings-call-transcrip/",
  "content": "Meritage Homes (MTH -0.24%)\nQ3 2022 Earnings Call\nOct 27, 2022, 11:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to the Meritage Homes third quarter 2022 analyst call. [Operator instructions] Please note, this conference is being recorded. I will now turn the conference over to our host, Emily Tadano, vice president of investor relations and ESG. Thank you.\n\nYou may begin.\n\nEmily Tadano -- Vice President, Investor Relations\n\nThank you so much. Good morning, and welcome to our analyst call to discuss our third quarter 2022 results. We issued the earnings release yesterday after the market closed. You can find it, along with the slides we'll refer to during this call, on our website at investors.meritagehomes.com or by selecting the Investor Relations link at the bottom of our home page.\n\nPlease refer to Slide 2, cautioning you that our statements during this call, as well as in the earnings release and accompanying slides, contain forward-looking statements. Those and any other projections represent the current opinions of management, which are subject to change at any time, and we assume no obligation to update them. Any forward-looking statements are inherently uncertain. Our actual results may be materially different than our expectations due to a wide variety of risk factors, which we have identified and listed on this slide, as well as in our earnings release and most recent filings with the Securities and Exchange Commission, specifically our 2021 annual report on Form 10-K and subsequent quarterly reports on Forms 10-Q, which contain a more detailed discussion of those risks.\n\nWe have also provided a reconciliation of certain non-GAAP financial measures referred to in our earnings release as compared to their closest related GAAP measures. With us today to discuss our results are Phillippe Lord, CEO; and Hilla Sferruzza, executive vice president and CFO of Meritage Homes. Steve Hilton, our executive chairman, is under the weather today and unable to attend but will be back on for next quarter's earnings call. We expect today's call to last about an hour.\n\nA replay will be available on our website within approximately two hours after we conclude and will remain active through November 10. I'll now turn it over to Mr. Lord. Phillippe?\n\nPhillippe Lord -- Chief Executive Officer\n\nThank you, Emily. Welcome to everyone participating in our call. In Steve's absence today, I will briefly discuss current market trends, as well as our quarterly operating performance. Hilla will provide a more detailed financial overview of the third quarter and forward-looking guidance for the quarter of -- fourth quarter of 2022.\n\nSlide 4. After Hurricane Ian hit Florida at the end of September, we are grateful to share that all of our employees and homeowners are safe. Our hearts go out to the many families who were displaced. Through our Meritage Care Foundation provided financial support to the hurricane relief efforts to help those in need.\n\nNone of the homes in our communities were damaged by the hurricanes or flood waters. However, about 150 closings in Florida that were slated for late September, did not close in Q3 and will push out to Q4. Given the current delays of municipalities, utilities, and supply chain post Hurricane Ian, some late Q4 scheduled closings may also get pushed into Q1 of 2023. Our sales teams are back in their communities as soon as local municipalities allow them to return, and we do not anticipate a material impact to our Q4 quarterly sales pace from Hurricane Ian.\n\nI also wanted to share that in September, we released our 2021 ESG report, which included our inaugural Task Force on Climate-related Financial Disclosures, or TCFD report. We joined the approximately 3,900 other institutions to become an official TCFD supporter this quarter and are excited to continue to make progress in our ESG journey. Expanding on another ESG milestone, in the third quarter, we were proud to be the recipient of the 2022 Environmental Protection Agencies Indoor airPLUS Leader Award, for continuing to build double-certified homes in third geographies under the EPA ENERGY STAR and Indoor airPLUS home certification programs. Now turning to our perspective on the current market environment.\n\nThe weaker conditions that started last quarter continued into Q3. The rapid and steep increases in mortgage rates and the expectations of further significant rate hikes to come coupled with inflation and uncertainty in economy, as well as elevated cycle times, all drove the meaningful deterioration in customer demand. While favorable homebuyer demographics and an undersupplied overall housing inventory still exist, we expect them to be overshadowed in the short run as the lack of consumer confidence and tightened affordability are influencing fine decisions. We anticipate weaker demand in the near term as future economic conditions remain murky and consumers take time to adjust to the new mortgage interest rate environment, which will include ongoing rate increases.\n\nGiven the macro backdrop, our sales order volume of 2,310 homes was 33% lower than prior year. Our absorption pace was 2.7 per month, compared to prior year of 5.0 per month and our target of three to four net sales per month. This quarter, our cancellation rate was 30%, which was above our historical average in the mid-teens. A majority of the cancellations during the quarter were due to elongated cycle times overall [inaudible] driven by consumer psychology, economic concerns, and changes in personal financial conditions of our existing buyers.\n\nAvailable inventory, both resell and new continue to be a priority providers, and we saw cancellation spikes in our markets where there are other move-in ready alternatives. Given that about 60% of our backlog at September 30, '22 was comprised of sales prior to Q3 with a higher all-in ASP, we have proactively offered our existing buyers price concessions where needed to narrow the spread between new and prior home prices. However, we continue to expect heightened cancellation rates in the near future until our older backlog closes out. In the third quarter of 2022, our gross sales declined 14% year over year, and our absorption pace on gross sales was 3.8 per month, which confirms there is underlying demand today.\n\nWith only approximately 300 completed homes to sell across all of our communities this quarter, we believe our growth sales were impacted by the lack of available homes that are ready to close within the next 45 to 60 days. With move-in ready inventory drawing the highest demand, we look to capture incremental volume with more completed or near-completed inventory available over the next few quarters. Even with this difficult housing market, our pre-existing backlog allowed us to achieve our highest quarterly home closing revenue of $1.6 billion this quarter despite the persistent labor and supply chain challenges. Our elevated homebuilding gross margin of 28.7% and lowest quarterly SDA -- SG&A leverage of 8.1% led to our record high quarterly diluted EPS of $7.10.\n\nWhile we are proud of the efforts of all of our team members in achieving the exceptional Q3 performance, we also know that these results mostly reflect closings of homes sold in a different sales environment, and that based on current trends will not be indicative of near-term quarterly operations. And now that mortgage interest rates are 7% before additional rate hike, we anticipate further deterioration of buyer confidence, which will impact both new customers and those already in our backlog, further challenging demand in the market. Even so, we continue to execute on what we have been committed to and have revived for fine for several years, both our strategy of pre-starting 100% of our entry-level homes and our streamline operations. To gain leverage and drive profitability, we plan to continue to prioritize pace over price.\n\nIn the current environment, we are utilizing everything in our incentive toolkit, including mortgage rate loss, rate buydowns, increased incentives, and true base price reductions based on the needs of each community. In many of our markets, we have supplemented these offerings by being more aggressive with increased broker commissions. We are pushing to find the optimal mix of incentives for each of our communities to get back to a goal of three to four net sales per month. Normalized size so that we can find the market clearing point.\n\nHilla will cover the details to our land portfolio later, but I wanted to speak to our land strategy. This quarter, we conducted a deep dive in our land pipeline in every market to determine which deals no longer achieve our risk-return profile in today's housing environment, recognizing we'll likely need less loss under control in a slowing market. We have pulled back significantly on new deals over the last few quarters as we have all the land the need for the next couple of years and are only considering exceptional opportunities. We've recently sourced deals we've been engaging with our land sellers to work through closing time line extensions.\n\nMany are giving us additional time as market conditions continue to evolve. With a strong land pipeline, we can take our time to gauge demand over the next several quarters before we commit to any additional land acquisitions. In cases where we cannot work through an extension, we are comfortable terminating our land option. We are also reunderwriting all controlled deals scheduled to close in the balance of this year and early 2023 and are taking a much more conservative view to assure these deals still underwrite today.\n\nIf these deals are no longer feasible at the land prices in the original contracts, we will negotiate with land sellers for a price reduction or walk away from the lots on deposits and due diligence costs. In Q3, we terminated our lowest-performing land deals, which resulted in $8.8 million in write-offs of such walkaway costs. Now turning to Slide 5 to share our operational statistics. Despite the elongated cycle times, our third quarter closings of 3,487 homes were 12% greater than prior year, reflecting our efforts to successfully navigate the supply chain disruptions.\n\nEntry level was 84% of closings, up from 78% in the prior year. The third quarter 2022 sales force of 2,310 homes was comprised of 88% entry-level homes, up from 84% in the third quarter last year. As I mentioned earlier, our Q3 sales orders were down 33% due to an acceleration of cancellations despite a 25% year-over-year increase in analyst communities. Our cancellation rate in Q3 of 30% increased from 10% in Q3 2021 and 13% in Q2 2022.\n\nOur third quarter 2022 average absorption pace was 2.7% per month, which was down from 5.0 per month in the prior year. Moving to regional level trends on Slide 6. Consistent with the rest of the builder industry, we experienced softer conditions and a year-over-year decline in order volume in all of our regions during the third quarter. However, our 2.7 net sales per month pace this quarter does not tell the whole story.\n\nOverall, our East region outperformed our other two regions with an average absorption pace of 3.8 per month during Q3. Almost all of our markets in this region maintain our target pace as a result of the relative affordability of those markets. Except for Austin and the growing pains we have experienced there, Texas also performed relatively well in line with the current market conditions. Excluding Austin, this region achieved an absorption pace of 3.2 per month during Q3.\n\nThe story really changes in our West region, which represents more than a third of our total average community count. The region struggled in the third quarter, as demonstrated by the 1.5 net sales per month pace, which [inaudible] our company's net sales per month averages. We believe market performance in this region weakened significantly as a result of home price appreciation over the last few years, materially exceeding the growth of local household income and some of those [inaudible] regional supply chain delays in the U.S. Let's review each region in a bit more detail.\n\nOur West region experienced the highest regional percentage of cancellations this quarter. ASPs ran hot over the last two years, mainly in Arizona and Colorado impacted affordability and buyer confidence. We had the largest percent of cancellations in Colorado this quarter due to the significant supply chain issues at times pushing our closings by a full quarter or two. We continue to work with municipalities and our subcontractors to manage through these issues.\n\nArizona also experienced more acute supply chain challenge and won the longest cycle times in all the markets, which led to elevated cancellations with an average absorption pace of 1.4 per month in Q3, consumers in this market were sidelined contemporarily pulled out the market or pivoted to readily available inventory. In the short term, our Western markets proved more vulnerable to buyer [inaudible] this quarter, driven by both real and perceived tightened affordability but we remain committed to having readily available homes, adjusting prices more aggressively, and offering a full range [inaudible] to overcome these concerns and get us back on target pace. With sales holding up best in the eastern part of the country, our East region group order ASP year over year and also had a small year-over-year decline in order volume. Our Florida market remains strong, representing 44% of the region's orders this quarter despite the impact of Hurricane Ian at the end of September.\n\nRelative affordability and extreme loan housing inventory in Florida resulted in a strong absorption pace of 5.0 net sales per month and a 12% year-over-year increase in ASPs on order. South Carolina was the only market to grow order volume this quarter. It's 37% year-over-year increase resulted from a significant community count ramp-up over the last four quarters and ongoing relative affordability in the market. The story in Texas was different across our markets in the region.\n\nDemand held up in Dallas and San Antonio. Meanwhile, office struggled with persistent material delays and labor shortages, resulting in one of the longest cycle times in all of our markets, which led to greater cancellations. Houston continued to face fear competition from other builders. We do believe there's still high demand in these markets, but we need to sharpen our pencil to find the right incentives to better manage our cancellations.\n\nIn the near-term changing conditions in many of our markets make it challenging to actively predict order demand going forward. However, we believe that favorable fundamentals in all of our markets will enable the right combination of competitive centers to drive demand and regain sales momentum. Now turning to Slide 7. We moderated our starts this quarter, starting approximately 2,700 homes in the first -- third quarter, compared to over 5,000 homes in Q2 2022 to align with our slower absorption volume.\n\nWe've spoken about our commitment to our strategy to maintain enough movement-ready inventory that aligns with our sales pace, not our maturity numbers, and demonstrated that execution this quarter. We ended the period with nearly 4,700 spec homes in inventory or an average of 17 per community as compared to approximately 2,800 specs or an average of 11.7% in the third quarter of 2021. This is in line with our optimal level of four to six months' supply. Although the elongated cycle time stemming from supply chain issues leaves us at a disadvantage as we have very limited available finished inventory in that count.\n\nSimilar to last year, 75% of our home closings this quarter came from previously started inventory. At September 30, 2022, we had fully approximately 300 completed homes to sell. Our 6% complete homes is up a bit from prior quarter, but still not where we want to be due to elongated production time lines and supply chain disruptions. Our goal is to get back to a typical run rate of one-third completed available inventory.\n\nOur Q3 cycle time hasn't changed since the start of the year. We recognize that things generally are worsening, but we are still approximately six to eight weeks of additional time from our pre-COVID construction schedules. Front-end trades like [inaudible] are starting to find additional capacity given the industry pullback and starts. That can trade like appliances, flooring, countertops, and cabinets are still challenged.\n\nThe entire market is also struggling with the lack of transformers needed to electrify homes, and we continue to monitor this nationwide issue as we look for potential alternative solutions. However, with overall capacity we've seen, we are working with our trades and partners to secure cost savings and cycle time reductions in all of our markets. We ended the third quarter with a backlog of approximately 6,100 units as our conversion rate declined from 57% last year to 48% this year. When the supply chain stabilizes, we anticipate cycle times will shorten and backlog conversion rates will improve.\n\nI will now turn it over to Hilla to provide additional analysis of our financial results. Hilla?\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nThank you, Phillippe. Before we dig into the Q3 financial results, we wanted to give a brief BFR update. In Q3 of 2022, a higher percentage of our sales came from BFR. Over the last 12 months, we have strengthened our relationships with both national and regional BFR operators.\n\nWe were able to more heavily lean into these relationships this quarter as we doubled up and presold both Q3 and Q4 volume. While we believe in the continued long-term resiliency of our BFR business, we anticipate slower near-term BFR volume as these operators are also adjusting and adapting to the changing dynamics in the rental markets. Now let's turn to Slide 8 and cover our Q3 financial results in more detail. Home closing revenue grew 25% year over year to $1.6 billion in the third quarter of 2022 due to 12% greater home closing volume and 12% higher ASPs compared to prior year, as stronger pricing over the past several quarters worked its way through the P&L.\n\nOur third quarter 2022 home closing gross margin was 28.7% and the 100 bp deterioration from 29.7% a year ago, mainly resulted from greater incentives, $8.8 million in write-offs for option deposits and diligence costs and to a lesser extent, higher direct costs. In the third quarter of last year, we had about $900,000 of write-offs for terminated land deals. Excluding these write-offs, home closing gross margins were 29.3% in Q3 2022 and 29.8% in Q3 2021. We anticipate ongoing elevated incentives will flow through Q4 margins and into 2023, which will outweigh the savings in 2023 from lower lumber costs.\n\nAlthough we are not projecting any other labor or commodity cost reductions at this time, we believe direct costs will eventually align with reduced production volumes, partially offsetting the incentives and price concessions. SG&A as a percentage of home closing revenue was 8.1% for the current quarter, a 120 bps improvement over prior year. In addition to lower commission expense as a percentage of home closing revenue from sales in prior quarters, our higher revenue allowed us to better leverage our SG&A. We have seen marketing costs start to pick up this quarter and will likely continue to do so given the evolving market conditions, along with increased broker commissions.\n\nThe third quarter of 2022's effective income tax rate was 20.3%, compared to 23.3% in the prior year. The 2022 rate reflects $13.1 million and energy tax credits that came from qualifying homes we delivered in the first nine months of 2022 as the inflation reduction as passed in August of this year, retroactively extended the energy tax credit to the beginning of the year. The 2021 rate similarly benefited from the 2019 taxpayer certainty and Disaster Tax Release Act. Overall, pricing power, improved overhead leverage, and a catch-up of tax credits, combined with the lower outstanding share count, led to a 35% year-over-year increase in third quarter 2022 diluted EPS to $7.10.\n\nThe highlight is a few of the September 2022 year-to-date results, compared to 2021, orders were down 5%, closings were up 3%, and our home closing revenue increased 17% to $4.2 billion, primarily driven by higher ASP. This pricing power translated to a 270 bps increase in home closing gross margin to 30.1%, while SG&A as a percentage of home closing revenue improved 110 bps to 8.3%. And both from cost savings and increased leverage. We generated a 46% increase in net income, earning $19.65 year-to-date diluted EPS.\n\nTurning to Page 9. We believe we have ample liquidity and a healthy balance sheet to manage through this changing environment. At September 30, 2022, nothing was drawn on our credit facility, and our net debt to cap was 18.9%, which is below our maximum internal thresholds of high 20s. Our next debt maturity is in 2025.\n\nOur cash balance was $299 million at September 30, 2022, compared to $618 million at December 31, 2021, and primarily as a result of increased inventory spend as we work to bring our started home closer to completion. During the quarter, we focused on our liquidity and did not repurchase any shares. At September 30, 2022, $244.1 million remains available to repurchase under our authorized share repurchase program. As we move into the next few quarters and generate higher positive cash flow from slower land acquisition and development spend we anticipate growing our cash position to maintain maximum flexibility in the uncertain environment while considering other opportunities, including incremental share repurchases and a potential early repayment of debt.\n\nSince we frequently get questions about how impairments are calculated. As a reminder, our impairment assessment of real estate assets is conducted at least annually on a community-by-community basis or more frequently if needed. We record impairment when the cash forecasted to be generated from the sale of homes in a community is not expected to cover the cost of that community. Even at today's moderating prices and higher direct costs, we do not have any impaired communities.\n\nWe do not anticipate broad-based impairments in the near term, barring further material ASP declines. On to Slide 10. After landing at 300 communities during the last quarter, we dropped temporarily to $2.75 as of September 30, 2022. During the third quarter, we grew community count 17% year over year.\n\nFor the last two years, we had new communities come online with such strong interest list that we can open with our completed models or available inventory. In the current market, we are strategically waiting to open certain communities until they're fully ready while we're also delay in others due to factors outside of our control, like the national transformer shortage. In Q3, we opened only 11 new communities, compared to 49 in Q2. While we had a dip in Q3 community count, we expect to increase again over the next two quarters.\n\nWe are forecasting to end the year just below 300 communities and then be back to our 300 community count target during the spring selling season. With the current uncertainty around the pace of demand, we are only putting under control exceptional land yields early in for our newer markets, we added about 1,800 new lots under control this quarter, less than 20% of the gross lots we put under control in Q3 of 2021. As mentioned, we walked away from approximately 5,200 lots this quarter, with a corresponding write-off of $8.8 million. These terminated lots related to $470 million in future land and development spend that we will not be incurring.\n\nOn a year-to-date basis, the $11.6 million of walkaway charges from terminated land deals represented about 10% of the total exposure related to our capitalized costs as we only have about $110 million remaining of deposits and due diligence costs associated with our entire portfolio of controlled but not on at September 30, 2020, which includes future phases of existing communities. All in, this $110 million makes up less than 2% of our total assets. During the third quarter, we spent about $380 million on land acquisition and development down from $526 million in the third quarter of 2021. As we've been reducing our land acquisitions, our land spend is leaning more heavily toward development of our own lots.\n\nSince maintaining 300 communities requires much less capital than growing to 300, we expect to spend significantly less than the $2 billion we initially projected for this year. At September 30, 2022, we had 66,348 lots under control, which reflects a reduction of 3,419 lots, compared to 69,767 lots at September 30, 2021. Based on trailing 12-month closings, we had 5-point year supply loss, which is just slightly above our target of four to five years. However, with approximately 60% of our portfolio sourced from land secured in 2020 and the first half of 2021 when land prices were cheaper, we're comfortable with this balance, and we'll continue to evaluate our future land over the next several quarters.\n\nAbout 69% of our total lot inventory at September 30, 2022, was owned and 31% was optioned. At September 30, 2021, we had a 64% owned inventory and a 36% option lot position. Finally, turning to Slide 11. We continue to monitor and evaluate shifting market conditions.\n\nFor the fourth quarter of 2022, we're projecting total closings to be between 4,300 and 4,700 units, home closing revenue of $1.85 billion to $2.10 billion, home closing gross margin around 25%, an effective tax rate of approximately 23.5% and diluted EPS in the range of $6.50 to $7.40. We are forecasting full year 2022 land acquisition and development spend to be around $1.5 billion, notably lower than the $2 billion we initially anticipated. We are working through our next budget cycle at this time and expect to be able to provide additional guidance on our next quarter's call. Directionally, our future gross margins will be materially impacted by aggressive incentive action, as well as increasing costs for rate locks and buydown in a rising interest rate environment.\n\nHowever, long term, we believe our normalized margins will settle to roughly 200 bps above our historical average of 20% as a result of operating leverage in more streamlined operations. With that, I'll turn it back over to Phillippe.\n\nPhillippe Lord -- Chief Executive Officer\n\nThank you, Hilla. To summarize on Slide 12. At Meritage, we are executing our strategy of pre-starting 100% of our entry-level homes and focus on what we can control to navigate the changing environment. By prioritizing pace we are committed to finding the market clearing price in each geography to get back -- to get us back to our target of three to four net sales per month even as aggressive incentives and price reductions will impact our future home closing gross margin.\n\nI continue to find ways to manage the ongoing supply chain issues. Our team is working hard to close out our backlog and have more move-in-ready inventory available. And by rationalizing our land portfolio, as well as pulling back our new land deals, we are limiting new investments to opportunistic new land deals only. Lastly, as good stewards of capital, we are managing to strong balance sheet liquidity.\n\nWe are constantly monitoring to the evolving market conditions and remain dynamic and flexible. Our resilient business model allow us to gain market share and maximize our profitability in a smaller market. With that, I will now turn the call over to the operator for instructions on the Q&A. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Stephen Kim with Evercore ISI. Please state your question.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nYeah. Thanks very much, guys. Good results in a tough quarter, tough environment. Thanks for all the detail that you provided.\n\nI guess my first question relates to the interplay of incentives and the costs that you described that you touched on when you describe what you think your margin is going to do next year. And I think that it was really helpful to hear you say that you think your long-term gross margin is going to settle out, call it, let's say, around 22%, if I heard you correctly. Next year, given the moving pieces with lumber coming down significantly, your cost negotiations, etc., but also the incentives you see today, if rates sort of stay where they are, let's call it a 7% environment, do you think you're going to dip below that 22%? Or because of your land basis and various other things, do you think that you'll actually be probably a little bit above that longer term and then sort of drift down to a 22% in the out-years?\n\nPhillippe Lord -- Chief Executive Officer\n\nThanks, Stephen, for that question. I mean, the first thing we just don't know yet. I mean, the market dynamics are constantly changing, we're still looking for interest rate stability, which will then lead to price discovery, which will lead to stabilize absorptions and consumer confidence. So we're still way early in it, it's hard to know where pricing is going to go, what incentives are going to be needed to move the inventory.\n\nThat being said, we do feel very strongly about our input and feel like they give us the ability to outperform as incentives continue to become a material part of the equation. The piece that we also don't understand is just what costs are going to do. At this point, we're not seeing a lot of cost relief even as it starts beginning to pull back if we're able to get our costs down as we continue to start homes and try to gain market share, that can help -- that can be a tailwind. So it's just really difficult to tell right now.\n\nIncentives are moving all over the place, price rollbacks are moving all over the place. And to be able to forecast what next year is going to look like as we sit here today is extremely difficult.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nNo doubt. And I appreciate the difficulty there. As we think about your commentary about gross margins, the first thing I wanted to clarify is, are you anticipating or incorporating in that number additional lot option walkaways? And then secondarily, as you're experiencing a more difficult environment at rapidly changing environment, did you have significant amounts of incentives at the closing table, or are incentives discounts and other accommodations in the closing table? Or was that fairly limited in the quarter?\n\nPhillippe Lord -- Chief Executive Officer\n\nI'd say that's fairly limited. If we have to go back we kind of reset our backlog. It's been mostly around getting them into a rate that makes sense for them versus renegotiating the price, although there was a little bit of that going on. And then as we look out into our future margins, we're not modeling any walk away.\n\nBut each quarter, we're looking at everything that's getting ready to close everything that we're getting ready to spend more money on and sort of rationalizing that. So I think there will be more, but we're not putting that in our guidance.\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nYeah. Just to clarify, we're at 5.1% unit supply of land, and 4% to 5% is our happy place. So we're a little bit above that. So we're really just monitoring what sales are going to do over the next couple of quarters to know if we need to release some additional pressure on the land pipeline or if we're OK where we are.\n\nStephen Kim -- Evercore ISI -- Analyst\n\nGreat. Thanks very much, guys.\n\nOperator\n\nOur next question comes from Truman Patterson with Wolfe Research. Please state your question.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nHey, good morning, everyone, and thanks for taking my questions. First, Hilla, in the prepared commentary, I don't think that I heard this, but could you give like kind of third quarter incentive levels, including base pricing adjustments for orders? And then also, I'm hoping you could just go across your markets and discuss which regions or states you're seeing the highest level of incentives and potentially quantify those. I'm really thinking about the Western markets in particular.\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah, Truman. This is Phillippe. I'll take that, and then I'll have Hilla jump in. So the first question was what have we done with incentives and pricing.\n\nWe don't really look at those things differently by the way. We're a spec builder. So at the end of the day, we're just looking at the net price and what we've rolled the net price back, whether it came in the form of incentive or came in the form of price rollback. But I'd say anywhere from 50 -- high mid-teens and some of the more challenged communities to something really, really quite normal as you move East, just sort of on the margin.\n\nSo if you look at the Western markets, again, community by community because we have some communities where we really haven't had to do anything in other communities where we had to do more meaningful, we may have rolled back net pricing high teens. As you work your way to taxes with the exception of Houston and Austin, it's been more high single digits, 10%. And then Austin and Houston, maybe back into those high teens, especially Houston, where we've had to roll back pricing to really compete with the competition, and then as you roll East, things have been relatively normal. Sometimes just kind of normal incentives to move things, normal adjustments in pricing to move things.\n\nAnd we really haven't seen a need to do much more than that. So hopefully, that answered your question. Hilla, do you have anything to add to that?\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nNo. I think that covers it all.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nOK, OK. Perfect. And then I appreciate that color. We think of kind of incentives or price cuts is one and the same as well.\n\nBut I'm hoping you can help us understand what sort of incentives you all find most beneficial in stimulating buyer demand. Are you seeing today that pure base price cuts are more effective, rate buydowns, locks, etc.? Just trying to understand what you all are seeing move the buyer.\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah. I mean, I'm not trying to phone in your question, but it's market by market, right? I mean, in certain markets, it's really just about getting a rate combination that works for that buyer as rates have escalated. So we've just had to kind of buy down rates to help those folks with their payment. In other markets, it's been kind of a combination of all of it.\n\nMaybe some rate buydowns, maybe some closing cost support, and then maybe an adjustment in net pricing. And then I think as we move West, it's kind of become about the price. You got to solve for the payment and then you can go solve for the products and they're sort of one and the same, but the price matters more in the West right now because there's been a lot of price cuts by our competitors. So buyers really want to know that they're buying a home price stats competitive with the market, and they're not finding at the top of the market, they're buying where the market is today.\n\nSo certainly in the West, price rollbacks have been the most effective in the last like 60 days. Prior to that, it was all about rates. It was all about closing costs and maybe some marginal incentives. But recently in the West, it's become about price.\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nWe really look at it as you need a price cut to get people in the door. They want to feel like you're reacting appropriately to what's happening in the market. But then they want the rate lock, buydown to get the month of payment to be where you want it to be. So it's a little bit of a balancing act between the two based on demographics in each market.\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah. And again, just to reinforce we're just -- we're a spec builder. So the price of one with the price of the home. We don't break out lot premiums and options.\n\nIt's the price of the home, it's your closing costs and it's your rate. Those are the three components of getting a buyer into the home.\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nPerfect. Thank you, all, for the time.\n\nPhillippe Lord -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. Our next question comes from Alan Ratner with Zelman & Associates. Please state your question.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nHey, guys. Good morning. Thanks, as always, for all the great information. Phillippe, I'm just curious, have you been surprised by how quickly prices have reset? I mean, I think if we go back three, six months ago, a common theme we heard from most builders was inventories incredibly tight and the industry is quite disciplined this time around.\n\nIt just seems like when you're talking about high teens price adjustments in a matter of three or so months, that seems like it's much more significant in terms of the rapidity than we've seen in prior downturns before. So I'm curious if the magnitude and the quickness of it has surprised you guys at all.\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah, absolutely. First of all, I just want to make sure that I clarify, but the high teens is mostly a West region kind of scenario we haven't really had to do that elsewhere, except maybe a little bit in Houston communities. But what surprised me is how fast rates have gone up. I couldn't really imagine a scenario where mortgage rates have done, what they have done over the last four months.\n\nSo that's created the scenario where it's really created the perfect storm for pricing happen to roll back as materially as it has to solve for the lack of consumer confidence, the lack of the uncertainty in the economy, and the rate and the payment that people are comfortable with. So that's what's created this environment. So am I surprised that when rates double, prices have to roll back this meaningfully, no. What surprised me is how fast rates have gone up.\n\nAnd I think pricing is going to have to reset in that environment, it's what the Fed has created for us in our industry. So no, I'm not that surprised given where rates are.\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nAnd just to clarify, the mid-teens -- low mid-teens incentives or all-in reduction, that includes what we're offering on the rate lock. So that is included in that and represent in many cases, a material portion of that reduction. It reduces price because it's what we're giving the buyers, even though we're not actually we do see the base house price. So just to clarify, it's not a true reduction in base house price that's visible in the marketplace to other consumers.\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah. But the consumer today is pretty shaken. And at this point, if they're going to buy a home, they got to be confident that they're getting in at a price that they don't feel like they're going to lose equity on over the next year or two. And it's about the price.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nGot it. That makes sense. And certainly appreciate the move-in rates here, was a lot greater as well than anticipated. Hilla, I'd love to circle back to the comments that you made on impairments and kind of the stress test there.\n\nAnd kind of tie that into a little bit the price adjustments you've made out West. So I'm presuming a lot of these markets that have seen the greatest price adjustments also are coming off of the highest starting point gross margin perspective, just given how much price appreciation there had been there. But I guess if we're assuming those communities might have peaked out at gross margins somewhere in the 30s, and we've already seen kind of mid-teens adjustments and absorptions are still lagging kind of your three to four target rate. Why isn't there more concern about those projects being impaired in the near term?\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nThat's a fair question. The math is almost right. So there's quite a bit, quite a few of these communities that are experiencing the most severe incentive need actually were north of 30, so they're coming down even at 12%, 13%, 14%, they're kind of coming back down to normal and that assumes no cost base. There are some cost saves that are occurring out there today.\n\nThere's going to be more as the lower cost number rolls through our financial statement. So it's a combination of those two that are still keeping those communities certainly lower than where we have been in the last couple of quarters, but not yet in the impairment territory danger zone. Is there a likelihood that maybe a couple of them may fall into it? Maybe, you always have cats and dogs in your portfolio. We have it in the last few years.\n\nBut beyond that, every other year, we certainly do. But again, barring something really, really material like another 15% or 20% price reduction from today's prices that are already reflecting those decreases, it's hard to model a scenario where you're having kind of wholesale impairments similar to what we had in the last cycle.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nGot it. That's helpful. And if I could just squeeze in one other related question on that point though, because you mentioned it would need another 15% or so. I guess the question now becomes, what is the elasticity there? Because if you've kind of put out a 3% to 4% target where you want to be, and these regions were in the 1% to 2%, this range this quarter, is there a number in your mind that you could discount today in a market like Arizona or California and get to that 3% to 4% level? Or is it just simply a matter of the consumer adjusting to the new reality and it almost doesn't matter what price is offered, you're not going to get that level?\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah. Again, it's just -- it's all predicated on what rates do. If rates stabilize and they're certainly around rates, I think we have plenty of room to find that. And in fact, the adjustments we've made recently that really are in that low teens, high teens in the West, we've seen pretty strong response on the gross sales side.\n\n. Now we're still working through cancellations in our backlog due to the cycle time issues and as prices are moving, buyers are less confident in the home they bought six months ago. But yes, we're finding a reasonable rate with the incentives we put in the market or I guess I should say the price adjustments we put in the market, our growth sales are -- we're pretty optimistic about what our gross sales look like.\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean, just to clarify, we're not going to be ridiculous in our quest to find three to four net sales per month but there's no elasticity in certain markets. There shows no elasticity in the market. But we -- right now, we're not seeing indications that that's the fact pattern.\n\nBut if that is, we can certainly slow down our expectations for certain markets and accelerate them from others. But as Phillippe mentioned, our gross sales are showing that there is demand, the cancellations that are coming in from some older inventory where there's a little bit of fear in the market that's causing that. But at today's pricing, there's a healthy demand that we're still seeing in almost all of our communities.\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nGreat. Thanks for all the time and color. Appreciate it.\n\nOperator\n\nOur next question comes from Mike Rehaut with J.P. Morgan. Please state your question.\n\nMike Rehaut -- JPMorgan Chase and Company -- Analyst\n\nThanks. Good morning, everyone. Thanks for taking my questions. Wanted to just get a better sense of some of the trends around sales pace during the quarter.\n\nAnd obviously, you talked about the 2.7 for the quarter overall. Where did that end? And when you think about the adjustments that you've made throughout the quarter, are you expecting for that to improve a little bit in the fourth quarter? In other words, are those adjustments giving you some additional traction, or to the earlier question around demand elasticity or lack thereof, are you going to be satisfied with the lower pace going into the fourth quarter as well?\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah. We're not going to tell you anything different than what you've already heard from our competitors and us, we saw a similar trend throughout the quarter. Dealt a little bit better in August because rates kind of stabilized and rates went crazy again in September, pulled back. October was kind of felt like we're not in October.\n\nSo October is kind of feeling about the same. We're not expecting a much better Q4 based on what we're seeing today. Again, I think we think that rates really have to stabilize before we start to say that we're going to see meaningful improvement in the demand environment. Certainly, the things we're doing around pricing, and other stuff is helping driving some more traffic to more interest in our product.\n\nBut the cancellations are still moving around quite a bit on us. It's kind of unpredictable at this point. So it's just kind of hard to say in the short term what to expect. Q4 is traditionally a slow time in housing in general, even when things are normal and good.\n\nSo I think we're all under the impression that it will be the spring before we really know what true demand looks like.\n\nMike Rehaut -- JPMorgan Chase and Company -- Analyst\n\nNo, that's very helpful. I guess, secondly, kind of just shifting to net pricing and gross margins, if you could also try and give us a sense of, I mean, you guys were obviously one of the first to incentivize the backlog, given the rate locks to a good portion and the backlog maybe even ahead of your peers. I was just trying to get a sense of where kind of on average, incentives/base price reductions stood at quarter end versus the beginning of the quarter. And when you think about the impact of where you stand today on those higher levels of incentive/base price reductions.\n\nWhen you think about the impact on gross margins, it would suggest that first quarter gross margins might be lower than fourth quarter. I guess what I'm trying to get at is aside from the beginning and end point of whatever percent price adjustment you had to make what are the gross margins on the orders that you're taking in today relative to the fourth quarter guide?\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nYeah. So we're not giving guidance into 2023 just quite yet. But obviously, you can see that this quarter is the first quarter that's really meaningfully reflecting the rate loss and some of the other incentives that we offer. So there was a decline clearly from Q2 to Q3.\n\nAnd then we guided to a 25% all-in margin for Q4. So there's a further pullback from the 29.3% that we had this quarter without the walkaway charges down to 25%, that's fairly material. You're going to continue to see we gave directional guidance in 2023 that we expect a higher incentives and the higher rate lock costs and rate buydown cost to flow through the numbers in 2023. We don't have alive visibility on that in totality because we're still working through those numbers.\n\nAnd as our competitors choose to take certain price actions, sometimes it necessitates adjustments on our end as well. So while we know what our numbers are today as other folks in nearby communities choose to take other actions. We may have to go back to our backlog and take incremental actions to save cancellations. So it's very difficult for us to provide an expectation of a margin, although directionally, it's likely lower, although Q4 is 25% does reflect the full composition of the start of our rate locks.\n\nIf you guys recall, at the end of Q1, we mentioned that we bought rate locks for everything, including through the end of 2022. We're really seeing that come in full force in that in that 25% margin. So we'll have more to share on our next call directionally lower, although you are starting to see the incentives and the rate lock flowing through the guidance we've already given for Q4.\n\nMike Rehaut -- JPMorgan Chase and Company -- Analyst\n\nGreat. One last quick one, if I could. You mentioned the BFR contribution or sales to BFR in 3Q. And I believe you said 4Q.\n\nI was hoping you could break that out. And what we've heard from the BFR community is that, by and large, those participants are -- have shifted to the sidelines as well in the hopes of you're getting homes at a lower price than today, perhaps similar to consumers. So I just wanted to get a sense of what that contribution to orders were during the second -- the third quarter, what you expect it to be in the fourth quarter? And if you're seeing any type of similar actions, maybe not for the back half of this year, but potential pullback in that demand in '23.\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nYeah. As I said -- Fair question. We don't give out specific numbers or percentages, although we did presell Q4 volume for BFR into Q3. So the numbers are a little higher than where we typically run.\n\nOur long-term goal is high single digit, low double digit. We're not quite there yet. We agree there is a pullback. A lot of the operators have said, hey, we need to kind of assess the market, it's really just affecting the rental operators now what was affecting us maybe six months ago.\n\nSo there a little bit of a pause, trying to figure out how their new underwriting looks, although many have indicated to us that they're back in the game for 2023. Their capital allocations are full for the current year are mostly full for the current year, but they do expect additional volume in 2023 that -- one exceptional say there is when you're selling entire communities you've already kind of precontracted and you have a consistent cadence. So there's some of that volume that's just ongoing because the negotiated prices make sense and the operators taking an entire community from you. So you will still continue to see some volume, although we definitely agree with what you're hearing out there that is going to be slower in Q4 and then a little bit of uncertain into 2023, although it's not going to dry up completely.\n\nMike Rehaut -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks so much.\n\nOperator\n\nOur next question comes from Carl Reichardt with BTIG. Please state your question.\n\nCarl Reichardt -- BTIG -- Analyst\n\nThanks for all the helpful detail. I wanted to ask about finished specs, Phillippe. Is the relative shortage compared to what you like, a function of customers stopping up product as it gets close to finish stage or more related to the difficulty in the supply chain? And then as you get to the spring selling season, ideally, what percentage of your available product would you like to be finished or very near-finished versus what it might be?\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah. Thanks for the question. So it's definitely 100% a result of the supply chain issues. When do you have finished specs, we're able to move them -- and we just haven't been able to reduce our cycle times and get enough finished specs in the market.\n\nAnd I think with the slower demand environment, it's created an opportunity for us to do that. We typically like a third of our specs by community to be moving ready in the next 30 days for those folks that are moving out of apartments and ready moving now. We like a third of them to be within 45- to 60-day window and then a third of them to be a little further out. So as you think about 300 communities, if we're looking for three to four per month, we want somewhere between 3,700 specs and 4,200 specs across those communities, and we'd want a third to be moving-ready.\n\nSo close to 1,000, maybe a little bit higher than that and then a third of those to be slightly further out than the third that we just started and are 90 to 120 days out. So that's how we think about it. If demand is lower, obviously, that would be a lower number. If demand is stronger, it would be a higher number.\n\nI think we're still seeing some communities out there that are doing more than four months, so we have more specs there. We're seeing some communities that are doing a little bit less than three months, so we have less specs there, but that's really how we think about it.\n\nCarl Reichardt -- BTIG -- Analyst\n\nOK. And then are you seeing consumers even talk or think about arms today? I know the spreads versus 30 years aren't necessarily terrific, but I'm curious what their attitude is toward the potential for utilizing adjustable-rate mortgages to get into the houses.\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nThere's definitely an increased interest in the seven-year arms. It's the 71 now, reset for 76. I guess it resets every six months, so there's definitely an interest. You can get those at the affordable prices.\n\nYou can get your monthly payment down to a reasonable amount with the average American staying in their home 6.9 years. Seven-year arm feels pretty good. Most of our entry-level buyers will stay in home just about that time, hopefully, during that time, if they choose to stay there longer, it will be a refinance opportunity. So the seven-year arms are definitely coming back in popularity.\n\nCarl Reichardt -- BTIG -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from John Lovallo with UBS. Please state your question.\n\nJohn Lovallo -- UBS -- Analyst\n\nGood morning. Actually, good afternoon, guys. I appreciate you taking my questions. The first one is, where was the land concentrated that you guys walked away from? I imagine it was out West, but were there particular markets where it was really focused?\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah. That's a great question. It actually was -- it was kind of across the board where it was concentrated in stuff -- was in stuff that we controlled recently, right? Stuff that we may have tied up in the back half of last year or early this year when things were still looking pretty good. I think anything that we tied up in that time period, it's tough to rationalize today.\n\nSo that's where it was concentrated. It wasn't in any specific region, probably equally distributed across all three.\n\nJohn Lovallo -- UBS -- Analyst\n\nOK. That makes sense. And then Hilla, one of your comments about being a little bit more conservative with cash, makes sense. But how much cash or total liquidity do you think you would need before exploring some of those other options like repurchasing and repurchasing shares? And what would sort of be the pecking order for allocating that capital?\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nYeah. It's a lot a number because we want a lot of cash. So we definitely are focused on making sure we have a hefty war chest just in case, right? You don't know what the world is going to look like in the next couple of quarters, we think it's going to stabilize, but we don't know. So it's better to be overprepared in this situation.\n\nWe do think that we're going to start to be fairly cash flow positive over the next couple of quarters here as we pull back on land acquisition and development spend. You really start to be accretive as those units that were nearing completion on the spec inventory start to convert to cash. So we expect that to happen in the near term. Priority is likely, first, jumping back into the market with share repurchases.\n\nAnd then looking at our 2025 notes, our nearest maturity, the other two notes are still at really, really attractive rates. The 25% is also an attractive rate. But if we can reduce our interest expense and help our net debt to cap, that's also very attractive to us. So that's kind of the order of priority.\n\nPhillippe Lord -- Chief Executive Officer\n\nYeah. I would just amplify what she just said. I mean, it's -- you can't have too much right now. And we don't know if this is going to be a one-year deal or a multiyear deal, still too early to tell.\n\nBut if it's a multiyear deal, we have to deal with that 2025 maturity, so we're planning for a multiyear right now until we know it's not.\n\nJohn Lovallo -- UBS -- Analyst\n\nMakes sense. Thanks a lot, guys.\n\nOperator\n\nOur next question comes from Dan Oppenheim with Credit Suisse. Please state your question.\n\nDan Oppenheim -- Credit Suisse -- Analyst\n\nThanks very much. Wondering a bit more in terms of just the thoughts in terms of the specs given the comments about the sort of expectation of a further deterioration in buyer confidence, just with the 17 specs that you have per community now, where do you see that sort of going over the course of the fourth quarter, sort of where we get into sort of a little better in terms of demand on a seasonal basis, sort of toughness in current environment, but just wondering how you're thinking about that in terms of where the spec level will likely end this year and such?\n\nPhillippe Lord -- Chief Executive Officer\n\nWell, we hope to move some specs this quarter, for sure. And I think we slowed down our starts dramatically in Q3. So we feel like this is the right number. I think I just went through the math where we have 300 communities if we're expecting three to four a month, and we can get our cycle times back to something more manageable, then nine to 12 specs per subdivision feels like the right number, and that kind of gets you to somewhere around -- somewhere between 3,000 and 4,000 specs, depending on how the market is.\n\nSo that's going to be kind of our target as we roll into spring. We want to make sure we have a lot of finished inventory because we really think buyers are focused on moving in quickly, locking in the rate, and closing versus waiting. It's also, obviously, in our opinion, way more effective at managing margins and costs and securing the trade capacity out there in a tight labor market. So we slowed it down dramatically.\n\nI think we're going to try to move some of this inventory in Q4 and Q1 to get it down to that target rate of nine to 12 per subdivision, which is somewhere between 3,000 and 4,000 specs depending on how the demand is. We want more in spring. Obviously, we have more as we roll into the spring unless as we roll into the winter just to manage the seasonality.\n\nDan Oppenheim -- Credit Suisse -- Analyst\n\nYup, makes sense. And I guess then in terms of the market share goals and where you'd like to be in terms of that with the pace over price I guess in, we've seen some other builders sort of pulling back and sort of -- you certainly started fewer homes here in an environment like this where it's more uncertain. What about sort of just tolerating a lower pace of absorption for some time, not having what you described as sort of the fierce competition from -- in Houston and such and sort of then staying in terms of this overall tight supply environment?\n\nPhillippe Lord -- Chief Executive Officer\n\nNo. That's not our strategy. We drive pace and then the margin -- we take out the margin and the cost that we need to be profitable. Our entire business strategy is built around achieving that three to four per community.\n\nWe have to find the price to do that and then work our cost structure, etc. We don't -- when we slow down pace, we can't get the cost structure that we need to be profitable. We can't get our cycle times where they need to be. So we have to drive that pace.\n\nWe're an entry-level builder. Our ASPs are lower, so the best return for our shareholders is to achieve that three to four net sales per month and figure out where the margins are afterwards.\n\nDan Oppenheim -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nAnd ladies and gentlemen, that's all the time we have for questions. I'll now hand the floor back to Phillippe Lord for closing remarks.\n\nPhillippe Lord -- Chief Executive Officer\n\nThank you, operator. I'd like to just thank everyone who joined the call and your continued interest in Meritage Homes. I hope you have a great rest of your day and a great weekend. So thank you.\n\nBye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEmily Tadano -- Vice President, Investor Relations\n\nPhillippe Lord -- Chief Executive Officer\n\nHilla Sferruzza -- Executive Vice President and Chief Financial Officer\n\nStephen Kim -- Evercore ISI -- Analyst\n\nTruman Patterson -- Wolfe Research -- Analyst\n\nAlan Ratner -- Zelman and Associates -- Analyst\n\nMike Rehaut -- JPMorgan Chase and Company -- Analyst\n\nCarl Reichardt -- BTIG -- Analyst\n\nJohn Lovallo -- UBS -- Analyst\n\nDan Oppenheim -- Credit Suisse -- Analyst\n\nMore MTH analysis\n\nAll earnings call transcripts"
}