{
  "companyName": "22nd Century Group",
  "companyTicker": "XXII",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/22nd-century-group-xxii-q3-2022-earnings-call-tran/",
  "content": "22nd Century Group (XXII 3.01%)\nQ3 2022 Earnings Call\nNov 08, 2022, 10:00 a.m. ET\n\nOperator\n\nWelcome to the 22nd Century Group's third quarter 2022 conference call and webcast. [Operator instructions] It is now my pleasure to turn the floor over to your host, Mei Kuo, director of communications and investor relations. Please begin.\n\nMei Kuo -- Director, Communications and Investor Relations\n\nThank you, Rob. Good morning, and welcome to 22nd Century's third quarter earnings conference call. Joining me today are Jim Mish, our chief executive officer; Hugh Kinsman, our chief financial officer; and John Miller, president of our tobacco business. Earlier today, we issued a press release announcing our results for the third quarter 2022.\n\nThe release earnings presentation and 10-Q are available in the Investors section of our website at xxiicentury.com, under the Events subheading. We'll start today's call with prepared remarks from Jim, John, and Hugh before moving into a Q&A session. As a reminder, those joining by webcast can submit questions through the online interface, which we may include during the Q&A section of today's call, time permitting. Some of the statements made today are forward-looking.\n\nForward-looking statements are subject to risks, uncertainties, and other factors that may cause actual results to differ materially from those contemplated by these statements. Additional information regarding these factors can be found in our annual, quarterly, and other reports filed with the SEC. During today's call, we may discuss non-GAAP financial measures, including adjusted EBITDA, which redefine as earnings before interest taxes, depreciation, and amortization, as adjusted for certain noncash and nonoperating expenses. For more details on these measures, please refer to our press release issued earlier today.\n\nAnd with that, I'll turn the call over to Jim beginning from Slide 3.\n\nJim Mish -- Chief Executive Officer\n\nThanks, Mei. Good morning, everyone, and happy Election Day. I've spoken at a number of recent conferences, so I'm going to keep my opening comments brief, and we can get to the details quickly. I will say it's been an incredible few months since our last quarterly update.\n\nAnd there are more exciting topics to discuss than we can fit into our call today. We're going to focus our time on commercial activities of our rapidly expanding U.S. tobacco business and our global scale hemp/cannabis ingredients and CDMO business. I'm joined today by John Miller, president of the tobacco business unit; and Hugh Kinsman, our CFO.\n\nFirst, since our last call, we have aggressively expanded our exceptional VLN pilot results by moving into a multi-state commercial launch, designed specifically to leverage our awareness, education, and trial approach. We've advanced from our Chicago pilot, to expanding across Illinois, to our first statewide multi-partner launch in Colorado, and now announced three additional statewide launches to complete the Four Corners region. This is just the beginning as we intend to grow our presence in now up to 18 states over the next 12 months and take a notable share in these markets. John will detail this more in a moment, but I can't be more excited about our prospects.\n\nWe have an unstoppable expansion blueprint driven by consumer interest. We can reach a 1% share milestone quickly where we decide to go. We have a plan to cover over 50% of the addressable market within 12 months. Second, we have now integrated GVB Biopharma, a top-shelf ingredient and CDMO provider in the hemp/cannabis-derived ingredient space.\n\nThis catapulted us into a fully commercialized and growing hemp/cannabis business with increasing margins, and we're moving quickly to complete certifications that will further differentiate our products and make us the dominant global supplier of hemp-derived ingredients. I'll come back to this detail after John. Finally, our financial results are driving long-term growth, margin expansion, operating leverage, and cash generation. Our balance sheet is fully funded to support our existing business plans, and we're closely monitoring our investments to rapidly drive share, scale, and financial returns in our commercial pursuits.\n\nThe turn in the slide illustrates the quickly developing revenue scale in our business that will ultimately drive us to cash positive flows as we complete this carefully planned commercial launch and investments. With that, I'll let John dive into the incredible work he and his team are doing in the tobacco business. John?\n\nJohn Miller -- Head, Nicotine Business\n\nThanks, Jim. And good morning, everyone. It's definitely an exciting time at 22nd Century, and we are moving rapidly to bring an incredibly disruptive product to market. Starting on Slide 5, our Chicago pilot with Circle K generated exceptional results in a very short time, especially when compared against normal industry expectations for' a new product launch.\n\nWe also tested a range of offers designed to drive increased share through trial and repeat purchases. With that data, we have sharpened and refined our launch plans for our multi-state rollout. We are now fully immersed in our commercial push into the $80 billion U.S. retail tobacco market.\n\nCapturing even a very small percentage of this market will be transformative for 22nd Century and our revenue line. Phase 3 includes not just adding states but also bringing new partners to execute the distribution, training, stocking, and ground support for our growing list of retail sites. This allows for efficient management of overhead while covering entire states with full service retail programs and support for VLN's rollout. Some of our new partners have authorized VLN not only bring potentially hundreds or thousands of store locations, but also represent an accelerated opportunity in the next state where that chain has a presence.\n\nIn short, our retail launch efforts become efficient, faster, and more productive, as we move forward by leveraging a frictionless go-where-we-go partnership approach. Moving to Slide 6, let me illustrate that a bit. Our current five states represent about 7% of the total U.S. retail cigarette market, or about $5.7 billion at the register.\n\nJust getting a 1% share would be approximately 3.8 million packs of VLN on an annual basis. What's more, three of these five states have favorable MRTP excise tax structures that can further leverage components of our launch programs for adult consumers and our commercial partners. We started with Circle K in Illinois, a fantastic partner who has fully supported our mission. They also supported our expansion in Colorado, where we added Eagle Rock and Creager Mercantile to distribute VLN to even more stores across the convenience, grocery, pharmacy, and other channels.\n\nAs new retail partners come on board via our sales and marketing programs, those accounts can go where we go in the other Four Corner states where we are launching right now. As an example, Circle K, in addition to Illinois and Colorado, also authorized VLN to be sold in all their New Mexico stores. But this is just a starting point, as we rapidly expand VLN's availability, grow our market share, and increase revenue throughout the next 12 months by securing distribution in a total of 12 to 18 states. Let me share with you what that can look like on Slide 7.\n\nThe U.S. cigarette market is concentrated, and we have adapted our accelerated launch plans to take advantage of this concentration. Getting in to just 18 states can provide access to more than half the total U.S. cigarette market.\n\nThat's access to more than $39 billion in cigarette sales in the highlighted 18 states. You can see on the map that our five current states, Illinois, Colorado, Utah, Arizona, and New Mexico, include three states that offer the MRTP excise tax benefits. These are color-coded light green. Five other states have passed MRTP tax program with similar benefits, Michigan, Washington, North Carolina, Kentucky, and Connecticut.\n\nAnd more states have proposed MRTP legislation. The MRTP states are compelling market opportunities in their own right. But connecting them with adjoining states allows us to create large regional markets and extend the reach and benefit of our marketing, PR, and awareness investments. We'll choose which states and in what order as we continue to move ahead.\n\nBut understand that we will continue to deploy our model of distribution partnerships, awareness campaigns, and education efforts with retail partners who share in our commitment to improving public health as we build share and revenue. Let's move over to Slide 8. I want to get a little more granular and help you understand that we can focus our marketing investment in ways to be even more efficient by looking at key market and population centers within the states. For example, in Colorado, where we are actively in the launch phase, there are 64 counties statewide, but the top 10 counties are home to more than 82% of the population and almost 79% of the state's cigarette volume.\n\nBy targeting much of our marketing spend and consumer engagement efforts in just 11 of 64 counties could give us access to 80% of the state's cigarette purchases. While at the same time, we'll deploy an appropriate amount of resources in the other 53 counties that are less populated. This enables us to focus our marketing spend and maximize return on investment on our launches. Finally, on this slide, as we discovered in Chicago, a tobacco cigarette that is FDA-authorized to help you smoke less is truly newsworthy.\n\nDuring the Chicago pilot, we earned significant coverage that helped adult smokers learn about VLN and how it helps them smoke less. This has been proven yet again in Colorado, with more than 15 segments focusing on VLN having been aired on Colorado television news stations. Slide 9 shows how all this comes together in our Four Corners efforts. With an adult population of more than 13 million and a total retail cigarette market valued in excess of $3 billion, we will target more than 7,000 key stores across dozens of retail brands.\n\nWe'll secure both traditional partnerships, like Smoker Friendly, and nontraditional partnerships, like Eagle Rock and Creager Mercantile, who want to join us in our mission to reduce the harms of smoking. Where it is available, we will use favorable excise tax legislation to drive market adoption and incentivize our partners to maximize the VLN opportunity. Of course, our success in ramping up volume mean we had to scale our tobacco growing and manufacturing capabilities, which we address on Slide 11 -- Slide 10, excuse me. We previously announced a record planting season and an expansion of our manufacturing capacity by 25% as we ready for volume increases.\n\nBut it's more than that. We're diversifying our growing locations to include the Southern hemisphere and working to continually improve our planting results and products. For example, our recent VLN 2.0 tobacco harvest demonstrated a 30% improvement in yield, enhanced lead quality, improved disease resistance, reduced nutrient requirements, and improved stability across growing locations and environments. In other words, our leaf inventory is scaling quickly, generating higher yields, and improving in quality.\n\nWe are prepared to drive manufacturing volumes to meet any level of market demand needed. This is especially important, given the increasing movement by regulators at the state and federal level to deploy new policies that can favor or reduce nicotine content products, illustrated on Slide 11. Most notably, we have talked extensively about the federal regulations, including a proposed ban on menthol products and even a reduced nicotine content mandate. But state and local governments are not waiting for federal action.\n\nAs noted by the current eight states with MRTP-reduced excise tax statutes, we believe that our VLN Menthol King cigarettes could be the only combustible menthol cigarette on the market exempt from the menthol ban, which was specifically contemplated as part of our MRTP authorization. But even more, the science shows that a reduced nicotine mandate would help all smokers more easily quit smoking or migrate to less toxic products. As we currently have the only product that meets this standard with the clinical data to back it, 22nd Century's research cigarettes continue to fuel numerous independent scientific studies to validate the enormous public health benefit identified by the FDA that would be achieved by implementing a nicotine standard. We believe it is only a matter of time on these fronts, and we are ready to help smokers leverage these policy opportunities to truly smoke less.\n\nWe are moving quickly and plan to continue our accelerated rollout in order to get VLN into the hands of as many adult smokers as possible. I'll now pass you back to Jim for an update on our hemp/cannabis franchise. Jim?\n\nJim Mish -- Chief Executive Officer\n\nThanks, John. It's been an amazing third quarter for tobacco progress, and we're just getting started. And I just have to pause for a second and just repeat some magic words: unstoppable expansion blueprint, driven by consumer interest. It's just an amazing progress that John and the team are making.\n\nLet's turn to Slide 13 now as we focus for a few minutes on our commercial progress in hemp/cannabis. You've seen this slide before, discussing how GVB completes our capabilities from the most fundamental elements of plant genetics and receptor science, all the way through to white label products on the retail shelf for purchase. We stand alone in the world with this level of breadth of expertise. More importantly, GVB is already the world's largest hemp/cannabis ingredients merchant market supplier, with the lowest cost, largest scale, and highest quality.\n\nThis platform is a tremendous growth opportunity with minimal investment, a process that we are undertaking at a lightning pace. It all starts with the assets we acquire, fully integrated manufacturing chain that slides right in to our plant science platform. It starts with a world-class extraction facility in Prineville, Oregon that will start out at 5,000 kilos per month capacity and grow quickly with our investment program already underway, with an expected output capacity of 15,000 kilos per month in 2023. As this facility scales, it will displace a majority of our third-party crude purchases in the market.\n\nWe will then take that crude material into our 30,000-square-foot crude refinement facility, where we expect to see a substantial increase in gross margins as Prineville expands, producing global-leading quality cannabinoid isolates and distillates. From there, our 40,000-square-foot manufacturing site will produce an extensive variety of white label products for our customers in the nutraceutical consumer products and pharmaceutical industries. The acquisition gives us a strong revenue position in hemp/cannabis, a growth platform as an industry leader, and a pathway to increase our gross margin profile and accelerate our path to profitability in hemp/cannabis. Slide 15 brings it together to show how we take our hemp/cannabis business to the next level of global leadership.\n\nFirst, our Prineville crude extraction facility will enable us to buy biomass and produce our own crude rather than buying crude on the open market. This is a massive cost reduction and will enable us to quickly scale gross margin on our operations as this facility scales up. We are ultimately targeting a 50% increase in our gross margins from the current levels as a result of this relatively modest investment, while also increasing scale and quality even further. Second, FDA is moving steadily toward establishing novel food product standards for the CBD industry in 2023, including both quality standards, key to certifications, and daily recommendations for intake that will unlock a massive consumer goods and nutraceutical market.\n\nIn addition to our leading role as the world's largest producer of these active ingredients, we're now acting to secure the product and the facility standards that will enable us to become the dominant supplier to these brands. This includes pharmaceutical-grade certifications for both of our facilities of core cannabinoid APIs. In other words, this puts us in the pole position in an exponentially growing global consumer market and also reinforces our CDMO capabilities, where we have exciting news to come soon. Moving to Slide 16, we target that by the end of second quarter next year, we have a full drug master file audit complete, giving pharmaceutical-grade certification to enable us to supply cannabinoids into clinical pharmaceutical activities, one of the highest certifications in the world.\n\nIt will also give us the edge as a leading global ingredient supplier. We believe that we can generate double-digit growth in this business, expand gross margins, and take the business unit to cash positive in 2023, helping self-fund our growth efforts across our corporate platform. While a lot of attention is understandably focused on our rapid expanding tobacco business, our hemp/cannabis products are also scaling fast and have tremendous opportunities for margin expansion and cash flow in the near term. Those are a lot of words.\n\nAnd I just want to summarize one more time because it's an exciting perspective in cannabis. We are already the world's largest merchant marketer of hemp/cannabis ingredients. We already have the lowest cost, largest scale, and highest purity. Now, the new extraction only adds to these three differentiators and allows new certifications that lead to global dominance.\n\nAnd timing is perfect, as the FDA advances to novel food regulations in 2023 that unleashes a massive market opportunity. And with that, let me turn it over to Hugh to discuss the financials.\n\nHugh Kinsman -- Chief Financial Officer\n\nThank you, Jim, and good morning to everyone. Starting off on Slide 18 with the third quarter financial results, net sales increased by 149% quarter over quarter to 19.4 million, which reflects the addition of a full quarter of GVB revenue and record tobacco CMO manufacturing sales. We continue to experience significant customer demand for our tobacco and hemp/cannabis products, including higher CMO cigarette volume from new customers in addition to the acceleration of VLN product sales. Gross profit increased slightly quarter over quarter to 619,000, as improved gross margin from CMO manufacturing was offset by lower margin from hemp/cannabis sales reflecting certain nonrecurring charges.\n\nAnd I'll explain gross profit further on Slide 19 and 20. Moving to Slide 19, tobacco revenue for the third quarter increased to a record 11.5 million from 7.8 million, an increase of 48%. Gross profit margin on tobacco sales increased to 5.5% through a combination of strong unit sales growth and improved product mix from higher margin CMO and VLN cigarette sales. We expect continued gross profit margin expansion to be achieved with the accelerated launch of VLN.\n\nMoving to Slide 20, for hemp/cannabis, which reflects a full quarter of GVB's operations, revenue grew 25% to 7.8 million for the third quarter. This revenue growth reflects an increase in unit sales of over 80% due to strong demand for the company's premium quality bulk ingredient. And excluding certain nonrecurring charges and the impact of purchase price accounting, GVB's pro forma gross margin was 8.1% in the third quarter. GVB's gross profit margin is typically 15% to 20% and will expand as the company becomes more vertically integrated with the addition of the new Prineville, Oregon extraction facility in 2023.\n\nSlide 21 illustrates the updated third quarter GVB acquisition purchase price accounting in more detail. And as a footnote from our third quarter Form 10-Q explained, the allocation reflects estimated fair values as of the date of the acquisition, which are determined using significant estimates and assumptions. We have substantially completed the valuation procedures required to allocate the purchase price in areas, such as property equipment, intangible assets, deferred taxes, and goodwill. However, further changes may occur in the future, which may be material.\n\nAnd last for me, on Slide 22, you'll see a few key highlights from our balance sheet. Another note, the total assets of more than 140 million includes a 44 million of goodwill and intangibles from the GVB acquisition. The strength of our balance sheet, including quarter-end cash balance of 44 million, will support our near-term strategic initiatives, primarily the accelerated launch of VLN. I know that many of you are focused on our cash position and how we're using it to continue our steady progress toward profitability.\n\nThe company is selectively deploying capital to accelerate the launch of VLN, expand tobacco manufacturing operations, invest in GVB's production capacity, and increase inventory levels to meet growing demand for both hemp/cannabis and tobacco products. 22nd Century's cash requirements are anticipated to decrease, a slightly higher sales volume for VLN products for fiscal 2023, and continued organic growth of GVB's operations. And in fact, GVB is on pace to becoming a cash-generating business in 2023 due to the investments we are now making to meet market demand. And as a result, the company has adequate liquidity from the current balance sheet to complete its strategic initiatives.\n\nAnd with that, I'll pass it back to Jim.\n\nJim Mish -- Chief Executive Officer\n\nThank you. It's an exciting time for 22nd Century as we accelerate our U.S. VLN launch with several major national C-store and pharmacy chains, placing our VLN products in front of customers. With our exceptional pilot exceeding our internal expectations and a massive market opportunity, even a relatively small share of that market is transformational to us as John described and as you've recently heard me describe in recent conferences.\n\nWith the proposed menthol ban moving ahead, as it should, plus state actions in advance of federal policies, there has never been a better time for a disruptive, reduced nicotine content product. We're ready to go, not just on our innovation tobacco products, but also on our hemp/cannabis products and new GVB platform that doubles our revenues now that is fully integrated and enhances our path to profitability as we plan to capture and leverage all the synergies of our two businesses in the months ahead. We built the framework and foundation, and we are now in full execution mode and focusing on business fundamentals to advance to the next phase of our strategy and maximize the full potential of 22nd Century. And with that, operator, please open the call for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Vivien Azer. Please proceed with your question.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Good morning. Lots of great detail on your aspirations to further expand VLN. Jim, you noted a target for 12 to 18 states over the next 12 months.\n\nObviously, a reasonably wide range in terms of incremental volume penetration to as high as 53% at the upper end of that. What are going to be some of the key factors that inform, you know, whether you hit 12 states as opposed to 18? Thanks.\n\nJim Mish -- Chief Executive Officer\n\nYeah. Hi, Vivien. And I'll let John comment on this as well, but I'll give you my perspective. Because we were -- even a few weeks ago, we were targeting 12 to 15.\n\nThat number has gone up to add on three more state. That takes us over the 50% mark. It really is driven by supply chain. We want to make sure we're not ahead of ourselves on the supply chain based on growth cycles and, you know, the timing of the shelves.\n\nI think that's really the major driver. We're -- you know, we're going to move as aggressively as we can to the full 18 as quickly as we can. But we are making sure that we keep our supply chain all the way back through the ag side in mind as we continue on here because we certainly don't want to face any stock-out situations once we do launch. But I'll ask John also to chime in on that commentary.\n\nJohn Miller -- Head, Nicotine Business\n\nYeah. Thanks, Jim. And good morning, Vivien. Good question, too, about, you know, how do we come to the 12 to 18 states? There's no doubt that there's certainly analytical work that's been done on choosing the 18 states, and really, as Jim has been very transparent in the past, you know, changing the conversation to what we're trying to achieve through these states.\n\nWhat have we taken from the pilot? What have we learned? How do we then implement that in a very pragmatic geographical approach to the business? And the 12 to 18 states, you know, that you saw on the map that we showed represented about 53% of the total cigarette market. And, you know, in the beginning, or I should say maybe in the last call, there was a lot of questions about a national launch and how do we get nationally when our team was internally working on exactly what does that mean to have the sort of scope, scale, and presence to make an impact in the market. And this is where we've begun, right? You started in Illinois, you moved to Colorado. The Four Corners approach gives access east, west, north.\n\nAgain, expanding through the pilot program in the Midwest, understanding the opportunities in southeast, taking advantage of MRTP taxes in Connecticut, and potentially in the tri-state area. So, it's a very pragmatic approach of how we get to meaningful levels in the best way possible, doing the analysis and research that shows this is where the opportunities are, this is where the consumers are, and these are our partners who can get us there. Hope that answers your question.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nYeah, it sure does. That's really helpful. And so, as we kind of think about, you know, modeling the tobacco opportunity on a go-forward basis, you know, clearly, there are going to be two components to revenue realization. One is selling into new states and then the other being, you know, repeat in, you know, quasi-legacy states, albeit nascent, where it does seem like you have plans to bring on incremental points of sale to deepen your penetration geographically as well.\n\nDo you think that the sequential growth that we saw in terms of absolute revenues between 2Q and 3Q is a good framework to keep in mind as we model the opportunity going forward, at least over the next, call it, three to five quarters? Thanks.\n\nJim Mish -- Chief Executive Officer\n\nHugh, would that be on the --\n\nHugh Kinsman -- Chief Financial Officer\n\nYup. Hi. Good morning, Vivien. Very good question.\n\nI think, you know, part of it, we had a big step-up because we had a full quarter this quarter for GVB revenue. So, I think when you're thinking in terms of, you know, modeling, let's just take tobacco operations, you know, some of that was just a significant increase in our CMO manufacturing. We expect that to continue going forward. But VLN will start growing into -- the velocity of the VLN sales will start to accelerate going into the end of this year, the fiscal period, and then go starting in Q1 2023.\n\nSo, for purposes of modeling, keeping kind of the growth rate incremental quarter over quarter, which would be, you know, steady, if you will, which would be comprised of CMO revenue. And then I would start [Inaudible] amount of growth for VLN as we continue to accelerate the rollout strategy.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nThat's super helpful. Thank you so much.\n\nHugh Kinsman -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Aaron Grey with Alliance Global Partners. Please proceed with your question.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nHi. Good morning. Thanks for the questions, and thanks for the detail. So, a question I have on VLN.\n\nSince you expanded some of the new markets, obviously, you know, in Chicago and Illinois, you had a great partner in Circle K, helped in terms of, you know, displays and shelf placement. So, just wanted to get some more color in terms of, as you go to Colorado and these other states, obviously, you're going to have Circle K there. But as you learn a little bit more on distribution, can you talk about how you're looking to ensure that you have, you know, similar shelf placement, at displays, at retail to kind of reach that, you know, 1%-plus that you got in Chicago and in these other markets? Thank you.\n\nJohn Miller -- Head, Nicotine Business\n\nThanks, Aaron, for the question. And, you know, it's a good point to start talking about what the retail environment looks like. And quite honestly, in Colorado, we have a very, very similar program with Circle K that we had in Illinois. And as I mentioned in our opening remarks, we've also expanded Circle K -- with Circle K into New Mexico.\n\nAnd again, that's a lot of the strategy, right? How do you take the learnings and how do you take, you know, all the things that we tested and can take out of a pilot and then move that into a much, much broader array of stores? So, certainly, in Colorado, they basically mirrored what we've done in Illinois to a large degree, and then rolled that right into New Mexico. So, that -- you know, those learnings, those things we've learned about -- you know, and if we -- we call it, you know, trial, education, awareness -- excuse me, awareness, education, trial. Get that right. All those things that we learned on how we get through that three-step process to trial and adoption, those are the things that we're explaining to retailers that they're, you know, working with us to achieve.\n\nAnd this -- this isn't like a challenging discussion. I mean, when people understand exactly what we're doing and they understand sort of the difference in VLN versus a traditional cigarette and what we're trying to achieve with this brand when they see it and understand what we tested and, now, what we're, you know, putting into market, it makes total sense. So, you know, to get that awareness campaign going, what does it take? What does it take to make the consumers become aware of it, to educate them on what the product does, to get them to try it, to come back and repeat -- have a repeat purchase? All of those things are now factored into our retail programing, which is exactly why we're doing this approach to how we're going in a geographical, pragmatic way. This -- I've said it, you know, multiple times, this is not a traditional cigarette launch.\n\nThis is not, you know, just a line extension of Marlboro or another very well-known CPG brand. This is a product consumers have to know what it is and what it does. All of that is tied in to what we're doing. And our partners are understanding that.\n\nA lot of, you know, the learnings that came out of the pilot also include the global legal approach. And we're not going to our retail partners and saying, \"Give me every store on day one.\" There are brands that do that. For this brand, you can't do that. This brand is, again, the sort of pragmatic approach, going deep into markets, understanding where the consumers are, which is the example in Colorado.\n\nIt's 10 or 11 counties, which we really have to execute in to get to 80% of the volume, to do that deep approach into the market. And the retailers are understanding this. And the go-where-we-go makes sense to them because we know what we have to do to be successful in the market.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nGreat. Thanks for that. That's actually helpful color. I'm glad to hear that retailers have been receptive.\n\nSo, second question for me, I want to talk about GVB a bit. You know, now that it's been under the company umbrella for a bit, going back to when the acquisition was made, you guys talked about, you know, revenues being 48 million, you know, for the year 2022, you know, gross margins of 44. Obviously, you know, if you look at the filings, it looks like, year to date, hadn't been close. January 1 you're at 23 million, so below that mark on the sales.\n\nAnd you talked about the gross margins, 15 to 20. You know, last quarter you had mentioned 20 to 25. So, just the high level, I want to, you know, maybe take some learnings. Maybe there's some more noise from the acquisition once, you know, you got under the hood than you had previously expected.\n\nSo, we'd love to get more color in terms of, you know, how you see the acquisition now, you know, a couple of months, post-acquiring, versus maybe some thoughts you had initially. Thanks.\n\nJim Mish -- Chief Executive Officer\n\nYeah, sure I can. I can sort it out, and then I'll ask, Hugh, to chime in as well. I think, you know, the thoughts at this point post-acquisition are -- is that, you know, it's everything we anticipated and more. We certainly knew we were going to go through the, you know, typical quarter of integration, which we did here in Q3.\n\nAnd that, you know, that takes effort across all different functions, including the commercial side, you know, getting everything tied out. So, we were expecting, you know, perhaps a softer Q3 on the on the volume side and then kind of a back-build going into Q4 into '23, which is exactly what's happening really both on the ingredients side and the cannabinoids themselves, and also very much so on the CDMO side, which was really in a fledgling position when we finished the acquisition back in May. So, everything's coming along very nicely across the integration. We got through that Q3.\n\nAnd now the ramp-up really is looking promising, both on the ingredients and the CDMO side. And as I said before, what really will unleash the CBD market, not only in the U.S., but there are -- Europe is looking at the FDA to set their safety guidelines on CBD. And that will open up not only the U.S. consumer product space now in legitimate terms with safety considerations around it and quality specifications around it, but that will very likely be adopted into the European theater, which is very much larger, just based on population.\n\nSo, it's really living up to everything we thought. You know, we spent, perhaps, a bit more time on the integration within Q3, but already in Q4. We're back on to the pattern that we hope for. And we really got a truly top-shelf ingredients and CDMO assets and a phenomenal team that's highly energized.\n\nSo, we couldn't be happier with it, and it really did fill out the foundation. But I'm not sure if I missed anything, Hugh, from your perspective on the financial side.\n\nHugh Kinsman -- Chief Financial Officer\n\nNo, I completely agree, Jim. I think it's important to mention that, you know, just the backlog for the demand we have for specialty ingredients is significant going forward. So, that's a compelling revenue growth, in addition to some of our white label contracts, which should be coming along in fiscal 2023. And with that and the Prineville extraction facility coming online, we will continue margin expansion as well.\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nGreat to hear that helpful detail. And I'll jump back into the queue.\n\nOperator\n\nOur next question comes from the line of Brian Wright with Roth Capital Partners. Please proceed with your question.\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nThanks. Good morning. I wanted to start out with -- when I look at the VLN map with the 18 states and in the press release, you kind of talked about focusing on the federal MRTP states. But then you look at, you know, the competing factor of adjacencies -- state adjacencies.\n\nI mean Texas just is like, you know, flashing their neon red kind of to me. But I don't want to -- you know, just want to think about kind of, you know, priorities for next states. And any kind of color there, you know, what your kind of response to that kind of analysis, for lack of a better word.\n\nJim Mish -- Chief Executive Officer\n\nJohn, you want to cover that?\n\nJohn Miller -- Head, Nicotine Business\n\nI'm sorry. Sorry, Brian. My phone cut out for a second. Did you say that Texas was flashing in red?\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nYeah. Yeah, as far like, you know, it's so close to the Four Corner states, and that's a big state. I know it's not MRTP, but it just kind of seems like, you know, that would be a high next priority.\n\nJohn Miller -- Head, Nicotine Business\n\nRight. So, if you look at the state with the -- if we look at the map with the 18 states, the light green states are the MRTP states, and then the -- I think we labeled the perspective priority launch states. And Texas is one of those dark green states. The difference in the map is we're just trying to show where the MRTP states were as opposed to our priority states.\n\nSo, the dark green states are definitely priority states. Texas is definitely dark green. So, yes, absolutely, 100%. Texas, the No.\n\n1 cigarette state in the country is a natural opportunity for us as we develop out and pivot around the MRTP states. And your initial observations correct, right? The MRTP states, you know, we have eight of them. And then, how do we build sort of a regional market around them. In the southwest, we're calling it, you know, you have the Four Corners, then Texas, and then the southeast.\n\nYou have North Carolina to the north. Florida is the No. 3 state for cigarette consumption. So, there is a natural connection there.\n\nAlso, Georgia and Texas, both had MRTP legislation initiated last year. So, again, you know, what's the opportunity there, that passes at some point in their future. And then, obviously in the Midwest, you have Kentucky and Michigan, MRTP states, right around Illinois. So, I mean, that became a natural Midwest area, also high propensity of adult smokers in those areas.\n\nSo, I hope that answers.\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nGreat. Yeah. No, it does. Thank you so much.\n\nThank you. If I could have just one follow-up. On the GVB side, just, you know, wanted to understand kind of a little bit more about the drug master file submission to the FDA, and as far as -- is there a timing around that and/or just maybe a little more on that process and what's involved in that process?\n\nJim Mish -- Chief Executive Officer\n\nYeah, I can handle that, Brian. Thanks for the question. Yeah, the submission we're scheduling for Q1, that does two things for us in essence. Number one, it opens up the door to supply ethical into the ethical pharmaceutical industry for clinical trials.\n\nAnd no one can do that at the moment with naturally derived product. So, that opens up, you know, that space. And it also then establishes, you know, really the highest level of quality, obviously, the lowest level of impurities to our to our isolate. And that really sets the stage to keeping up with the FDA's movement on the novel food safety standards.\n\nThe first thing they'll do is establish an upper threshold. Nobody knows for sure exactly what that's going to be, but I've heard numbers anywhere from 25 milligrams per day up, to 100 milligrams per day that would service the nutraceutical market. That's the first thing that they'll do in '23. Right behind that, they will establish the highest quality specifications.\n\nAnd they'll be looking to, you know, what's plausible in the marketplace and looking for people to work with them, which we already are, to establish those quality, purity guidelines, and, also, specifically what impurities are in there and the stabilization of it. So, we'll derive advantage off of that via the DMF filing at the same time. So, it really helps us on pharmaceutical and simultaneously helps us on novel food, meaning food, beverage, nutraceutical products. And as I said, we've heard very strongly that the FDA is really taking the lead on a global basis to establish these specifications.\n\nAnd, more than likely, the external European markets, Asian markets, the Canadian markets will look to them to establish similar guidelines and expand and reboot, in essence, the CPG market. So, that's the timing and that's really the value to us right along with our mission, which is we want to have the absolute lowest cost, the absolute largest scale, and continue to push the absolute highest levels of certification. And certainly, pharma-grade CBD and other cannabinoids is where you need to go, and the DMF is part of that process.\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nGreat. Thank you so much.\n\nJim Mish -- Chief Executive Officer\n\nSure.\n\nOperator\n\nOur next question comes from Jim McIlree with Dawson James. Please proceed with your question.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nYeah. Thank you and good morning. Just wanted to follow up on a question Vivien was asking about the contract manufacturing revenues in Q3. Do I understand this correctly that the quarter-to-quarter change in tobacco revenues of about 1.5 million was mostly contract revenue.\n\nHugh Kinsman -- Chief Financial Officer\n\nJim, it's Hugh. Yes, that's correct. It's mostly contract revenue.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nAll right. Great. Great. Thank you.\n\nHugh, you talk -- this 15% to 20% gross margin for GVB, I just -- I also want to understand exactly what you're saying. You're saying that that is what it would be on a normal basis without all of the new manufacturing plants that you have coming online. Is that right? And so, that 15 to 20 is probably going to be seen beginning Q4. And then as these additional plants come online, we should see an increase as 2023 progresses.\n\nIs that a good way to look at it?\n\nHugh Kinsman -- Chief Financial Officer\n\nThat's exactly right, Jim. I mean, 15% to 20% is your typical gross margin, especially, you know, just in a steady state. That percentage will start to increase over time as we layer on the -- fully integrate the Prineville facility. So, those will be the right assumptions going forward.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nGreat. And then, my last question is on operating expenses for the quarter. In the Q, it talked about accelerated stock comp accounting for an additional 1.9 million and strategic consulting accounting for an additional 1.7 million. How transitory or permanent are both of those expense levels, when we're looking at Q4 in 2023?\n\nHugh Kinsman -- Chief Financial Officer\n\nThe stock compensation is -- the majority of that is onetime due to an acceleration of payment for a reorganization, if you will. And the consulting, it may not be quite that level, but there'll be some of that going forward just because of the way we're building up our IP portfolio on a go-forward basis.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nSo, the strategic consulting is mostly on the IP side, and I assumed it was for the deal and rollout. It's mostly IP is what you're saying?\n\nHugh Kinsman -- Chief Financial Officer\n\nYeah, it's mostly IP. But there is some of that consulting really to VLN, and it's definitely related to our IP development for our receptor science and plant genetics.\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nGot it. Got it. All right. Fantastic.\n\nThat's it for me. Thanks a lot.\n\nHugh Kinsman -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question is from Alex Fuhrman with Craig-Hallum. Please proceed with your question.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks very much for taking my question. I'm curious, you know, now that you've been in a couple of different states that have different tax treatments for your VLN product, A, has there been a clear indication of which kind of ways of passing on that pricing have the biggest impact, whether that's just a bigger margin for the retailer or passing that savings on to the consumer. I'm curious if you've had enough experience in different jurisdictions to really have a sense of is that helping to move the needle for demand, or how that's playing out?\n\nJohn Miller -- Head, Nicotine Business\n\nYeah. Alex, good question. The retail pricing aspect of VLN was something we looked very closely at. There's no doubt that there -- especially in the pilot, you know, we saw multiple price points.\n\nFor example, when you get into, you know, Cook County in the city of Chicago. I mean, there were some stores that we had three different tax stamps on the packs. So, we were able to look at and do some research on what is the proper retail pricing to at least launch VLN. And what we learned through the actual retail programing and then the research projects we did was that the consumers weren't necessarily looking for a bargain or a deal and that they were willing to pay, you know, in line with, you know, let's say a top tier product in Marlboro or Camel.\n\nAnd if we price that, that they were OK. Now, all consumers love offers, right, and some kind of deals. Perfect. So, you know, we've put that into all of our programing as well.\n\nYou know, certainly under the trade and marketing side of our business. Using the MRTP as you kind of referenced in Colorado. So, you have the base case, which is we know the consumers, if this provides a solution they're looking for, are willing to pay for it. But also understanding that, you know, they want to have an offer when available.\n\nWhen you go into an MRTP state, it gives us the flexibility then of using, let's say, that tax savings to, you know, again, awareness, education, trial. How do we drive awareness, education, and trial? And what we started in Colorado was, you know, continuing doing what we knew we needed to do in terms of pricing, in terms of promoting at the right appropriate levels, but also taking some of that money and driving awareness, education, and trial. So, it -- and if you think about it, it's about -- it's just as an example of $6.50 a carton in Colorado. If someone's looking for a way to, you know, get off highly addictive cigarettes or, you know, smoke less or whatever they're trying to achieve through this brand, is $0.65 the difference? And we found out that it -- it isn't necessarily.\n\nBut when they know more about it and when they're aware of it, that's what's going to, you know, drive, you know, trial, obviously, return purchases. Now, we've continued, like I say, to factor all that in. We have some, you know -- we have a very, you know, great trade marketing program going in Colorado. And for example, we have Circle K as, you know, one very sophisticated retailer, but we also have Smoker Friendly, which is a very sophisticated retailer in a different channel.\n\nYou know, Smoker Friendly is primarily a discount tobacco channel. And they have incredible systems. So, they're able to do these promotions and they're able to do, you know, specific carton pricing in different areas. And we've tied into all the systems.\n\nSo, it isn't a straight black-and-white answer that says the MRTP gives you a lower retail. It becomes part of a holistic program, as I mentioned in my comments, that, you know, benefit the consumer, you know, trade partners, and everyone else sort of involved in the ecosystem of getting VLN into the consumer's hands. Hope that answer your question.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nIt sure does. Yeah. No, that's really helpful. And then, if I could just ask a second on the VLN 2.0 tobacco.\n\nIt seems like you're seeing a lot of success with that crop here. Is the idea that this is going to be, you know, the bulk of the VLN cigarettes in the future are going to be using this VLN 2.0? And can you talk to us a little bit about, is it more about, you know, improved taste and texture, or better yields and lower costs? Just would love to hear more about the success you're seeing there with the second-generation product.\n\nJohn Miller -- Head, Nicotine Business\n\nSure. And I can talk to, you know, specific parts of this. You know, in a lot of ways, what we're seeing with VLN 2.0 and helping is also our sustainability on the brand. You know, Calvin Treat is our chief science officer, has done a remarkable job, along with our teams, of being able to grow more sustainable products.\n\nAnd as you heard in my opening comments, you know, this is a product that has better yield, less nutrients. It's just becoming a better product, the more they started -- you know, the more experience they have in growing it. Obviously, it will be part of the products we have. You know, make it, again, more sustainable, less disease-resistant.\n\nThere's just a tremendous amount of science into how this will help the product. I don't know, Jim, if you have something else you want to add to that. But in general, it's just going to make it overall more sustainable, a better product.\n\nJim Mish -- Chief Executive Officer\n\nYeah. I mean, the only thing I can add to that is, you know, we're viewing this that we want to have year-round growth both Northern Hemisphere and Southern Hemisphere, which we're doing across all these varietals where we have IP and then can blend as we desire. Again, the feedback is already very good on the product. But this gives us the latitude, both on the supply chain and on the next-generation products as well.\n\nSo, you know, that's really what the driver is.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nThat's really helpful. Thank you very much.\n\nJim Mish -- Chief Executive Officer\n\nSure.\n\nOperator\n\nWe've reached the end of the question-and-answer session. I'd now like to turn the call back over to James Mish for closing remarks.\n\nJim Mish -- Chief Executive Officer\n\nThank you. And thanks again to everyone for joining us today. All I'll say is please stay tuned shortly for our next updates as we continue to expand our VLN launch in the U.S. and move ahead on our cannabinoid opportunities, utilizing the GVB platform.\n\nYou'll be hearing from us very soon, and look forward to talking to you all next quarter as well. Thank you, and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMei Kuo -- Director, Communications and Investor Relations\n\nJim Mish -- Chief Executive Officer\n\nJohn Miller -- Head, Nicotine Business\n\nHugh Kinsman -- Chief Financial Officer\n\nVivien Azer -- Cowen and Company -- Analyst\n\nAaron Grey -- Alliance Global Partners -- Analyst\n\nBrian Wright -- ROTH Capital Partners -- Analyst\n\nJim McIlree -- Dawson James Securities -- Analyst\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nMore XXII analysis\n\nAll earnings call transcripts"
}