{
  "companyName": "Exelixis",
  "companyTicker": "EXEL",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/exelixis-exel-q2-2022-earnings-call-transcript/",
  "content": "Exelixis (EXEL 2.43%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Exelixis second quarter 2022 financial results conference call. My name is Sarah, and I'll be your operator for today. As a reminder, this call is being recorded for replay purposes. I would now like to turn the call over to your host for today, Ms.\n\nSusan Hubbard, executive vice president of public affairs and investor relations. Please proceed.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThank you, Sarah, and thank you all for joining us for the Exelixis second quarter 2022 financial results conference call. Joining me on today's call are Mike Morrissey, our president and CEO; Chris Senner, our chief financial officer; P.J. Haley, our executive vice president of commercial; Vicki Goodman, our chief medical officer; and Peter Lamb, our chief scientific officer, who will together review our progress for the second quarter 2022 ended June 30th, 2022. During the call today, we will refer to financial measures not calculated according to generally accepting accounting principles.\n\nPlease refer to today's press release, which is posted on our website for an explanation of our reasons for using such non-GAAP measures as well as tables deriving these measures from our GAAP results. During the course of this presentation, we will be making forward-looking statements regarding future events and the future performance of the company. This includes statements about possible developments regarding discovery, product development, regulatory, commercial, financial, and strategic matters. Actual events or results could, of course, differ materially.\n\nWe refer you to the documents we file from time to time with the SEC, which under the heading Risk Factors, identify important factors that could cause actual results to differ materially from those expressed by the company verbally and in writing today, including, without limitation, risks and uncertainties related to product commercial success, market competition, regulatory review and approval processes, conducting clinical trials, compliance with applicable regulatory requirements, our dependence on collaboration partners and the level of cost associated with discovery, product development, business development, and commercialization activities. Now with that, I will turn the call over to Mike.\n\nMike Morrissey -- President and Chief Executive Officer\n\nAll right. Thank you, Susan, and thanks to everyone for joining us on the call today. Exelixis had a strong second quarter 2022 across all components of our business. We saw continued growth of the cabozantinib franchise, both in the U.S.\n\nand globally, while advancing a diversified pipeline of clinical and discovery programs to build the Exelixis product portfolio of the future. Key highlights from Q2 include: first, we saw a strong performance of the cabozantinib business with significant growth in demand and revenue in the U.S. Cabometyx maintained its status as the leading TKI for RCC. The cabo franchise grew 22% year over year compared to 2Q 2021, marking its seventh consecutive quarter of growth.\n\nImportantly, global cabozantinib franchise net product revenues generated by Exelixis and its partners were almost $500 million in Q2 2022; second, our emerging bicoastal development team is focused on advancing the Exelixis development pipeline to potential new cabo indications and our growing pipeline of clinical compounds, including XL092, XB002, XL102 and XL114. Important developments during the quarter include positive top-line results for COSMIC-313 and the initiation of the pivotal trial program for XL092 with STELLAR-303; third, our discovery activities focused both on small molecule and biologic programs continues to advance with two new collaborations to support our biologics discovery activities. With that, please see our press release issued an hour ago for our second quarter financial results and an extensive list of corporate milestones achieved in the quarter. I'll now turn the call over to Chris.\n\nChris Senner -- Chief Financial Officer\n\nThanks, Mike. For the second quarter of 2022, the company reported total revenues of approximately $419 million, which included cabozantinib franchise net product revenues of $347 million. Cabometyx net product revenues were $339.2 million and included approximately $17 million in clinical trial sales. Gross to net for the cabozantinib franchise in the second quarter of 2022 was 28.2%, which is lower than the gross to net we experienced in the first quarter of 2022.\n\nThis decrease in gross to net deductions in the second quarter of 2022 is primarily related to lower Medicare Part D and co-pay assistance expenses. Our trade inventory weeks on hand remained relatively flat when compared to the first quarter of 2022. Total revenues also included approximately $72 million in collaboration revenues and includes approximately $26 million of milestone revenues earned from Ipsen. Following the approval of the differentiated thyroid cancer indication in Europe and Canada.\n\nOur total operating expenses for the second quarter of 2022 were approximately $336 million, compared to $273 million in first quarter 2022. R&D expense was the primary driver of the increase in total operating expenses, which was primarily related to the $25 million upfront payment for the option and license agreement we entered into in June with BioInvent International. Provision for income taxes for the second quarter of 2022 was approximately $18 million, compared to approximately $17 million for the first quarter of 2022. The company reported GAAP net income of approximately $71 million or $0.22 per share on a fully diluted basis for the second quarter 2022.\n\nThe company also reported non-GAAP net income of approximately $90 million or $0.28 per share on a fully diluted basis. Non-GAAP net income excludes the impact of approximately $19 million of stock-based compensation expense net of the related income tax effect. Cash and investments for the second -- for the quarter ended June 30, 2022, was approximately $2 billion. This level of cash and investments supported by our ongoing cash flow from operations provides Exelixis with the flexibility to invest in internal discovery activities and also allows us to pursue external business development opportunities to expand our pipeline.\n\nAnd finally, we are reiterating our full year 2022 financial guidance, which is detailed on Slide 12 of our earnings presentation. And with that, I'll turn the call over to P.J.\n\nP.J. Haley -- Executive Vice President of Commercial\n\nThank you, Chris. The second quarter of 2022 was a strong quarter for cabozantinib as we continued to build on the significant momentum of the franchise. The team continues to execute at a high level, which has resulted in Cabometyx continuing to be the No. 1 prescribed TKI in RCC.\n\nFurthermore, Cabometyx total prescriptions, or TRx, have now grown for seven consecutive quarters. Demand growth is being driven primarily by the long duration of therapy for patients on Cabometyx in combination with nivolumab in the first-line setting. Prescription trends remained strong in Q2 2022. Year over year, TRx growth in Q2 2022 was 29% relative to Q2 2021.\n\nGiven the clinical data from the CheckMate 9ER study, we anticipate these first-line combination patients to receive therapy for approximately a year and a half on average, thus driving a significantly longer treatment duration for Cabometyx. We're encouraged by the fact that in our data, we see a near doubling of the amount of new patient starts at the 40-milligram dose in Q2 2022 since the CheckMate 9ER launch in January 2021. It's further indication that the combination uptake in the first-line setting is robust. Turning to the TKI market basket of Cabometyx, Inlyta, Sutent, Votrient and Lenvima, cabo TRx market share has increased every quarter since Q1 2021, and share in Q2 2022 was 37%.\n\nAs we've discussed previously, the first-line RCC market is very competitive, and we are pleased with the performance of Cabometyx in combination with nivolumab in the setting. Furthermore, we're still not seeing any significant competitive impact on our market share. Uptake in the first line is broad across clinical risk groups and practice settings and prescriber experience to date continues to be very positive. We believe all of this taken together with the momentum in the business positions Cabometyx for continued growth in the second half of 2022.\n\nTurning to other settings. We are pleased that the Cabometyx second-line RCC business remained strong and was stable in Q2, while growth continued in the first-line setting. In HCC, our business grew in Q2 and Cabometyx continues to be the most prescribed TKI in the second-line setting for patients treated with immunotherapy-containing regimens in the first line. With regards to second-line DTC, we continue to be pleased with the launch, and this indication continues to provide growth for the brand.\n\nLooking beyond the six current U.S. indications for cabozantinib, we are planning for the numerous life cycle expansion opportunities as they begin to have top-line data readouts in the second half of this year. We look forward to having the opportunity, pending data and approval to bring Cabometyx to many more patients in need of additional treatment options. Our team remains highly focused and motivated to compete every day to bring the benefit of Cabometyx to all eligible patients as we continue to build the franchise and serve patients.\n\nAnd with that, I'll turn the call over to Vicki.\n\nVicki Goodman -- Chief Medical Officer\n\nThanks, P.J. Good afternoon. Today, I will provide a brief update on the progress of our clinical-stage pipeline as well as our East Coast expansion in the Greater Philadelphia region. I'll begin with an update on our cabozantinib registrational trial.\n\nIn early July, we reported positive top-line results for COSMIC-313, evaluating cabozantinib in combination with nivolumab and ipilimumab in intermediate and poor risk renal cell carcinoma. In the primary analysis of progression-free survival, cabozantinib in combination with nivolumab and ipilimumab significantly reduced the risk of disease progression or death compared with the combination of nivolumab and ipilimumab, with a hazard ratio of 0.73 and p-value of 0.01. A prespecified interim analysis for the secondary endpoint of overall survival did not demonstrate a significant benefit for the cabozantinib arm compared to the nivolumab and ipilimumab control arm, and therefore, the trial will continue to the next analysis of overall survival. The safety profile observed in the trial was reflective of the known safety profiles for each single agent as well as the combination regimen used in this study and no new safety signals were identified.\n\nWe intend to discuss the results with the FDA to determine next steps toward a potential regulatory submission. I would now like to share a brief update on CONTACT-01. The Phase 3 pivotal study evaluating cabozantinib in combination with atezolizumab versus docetaxel in patients with metastatic non-small cell lung cancer who have been previously treated with an immune checkpoint inhibitor and platinum-containing chemotherapy. The independent data monitoring committee for the study conducted a preplanned interim analysis and recommended that the study remained blinded and continue to the final analysis for overall survival, which is expected to occur before the end of 2022.\n\nWe are also expecting a readout of the progression-free survival endpoint for CONTACT-03 of cabozantinib in combination with atezolizumab in PD-1 experienced renal cell carcinoma in the second half of this year. For CONTACT-02, our Phase 3 study in combination with atezolizumab in metastatic castrate-resistant prostate cancer, we are now projecting that enrollment will be completed in the first half of next year. We continue to make progress on our pipeline molecules. In June, we initiated the first Phase 3 study of XL092, our next-generation tyrosine kinase inhibitor, in non-MSI-high colorectal cancer.\n\nXL092 is also being explored in combination with several checkpoint inhibitors and IO combinations and additional registrational studies are planned. We also continue to explore additional potential combination opportunities with novel agents and have made progress with several partners to bring novel combinations into the clinic. XB002, our first antibody drug conjugate, which targets tissue factor without interfering with the coagulation pathway in preclinical models, continues in dose escalation. Thus far, it has been well tolerated with no bleeding events observed.\n\nWe expect to move into the multi-cohort dose expansion phase later this year. Dose escalation has also been initiated for the combination of XB002 with nivolumab. A Phase 1 study of XL102, our oral CDK7 inhibitor, is expected to move into both single agent and combination expansion cohorts after completion of ongoing dose escalation and determination of a Phase 2 dose. Turning now to our plans for upcoming data presentations.\n\nAn abstract for the COSMIC-313 top-line data has been submitted to a major medical conference, and we are awaiting a decision from that conference about acceptance of that abstract. In addition, an abstract for the XL092 Phase 1 study was accepted for a poster at the upcoming European Society of Medical Oncology meeting. The poster will include data from the monotherapy and atezolizumab combination dose escalation cohorts in heavily pretreated solid tumors and will focus primarily on the safety and pharmacokinetics which led to a recommended Phase 2 dose. Preliminary activity across multiple doses and tumor types will also be presented.\n\nWe also expect to provide Phase 1 clinical updates for XB002 and XL102 later this year. Finally, with regard to our Philadelphia area campus, we expect to move this month into our intermediate-term space in King of Prussia, which can hold approximately 140 office-based employees. Taking advantage of the broad talent base in the Greater Philadelphia area, we are now hiring for roles both inside and outside of development, including two executive-level roles to build out a leadership presence on both coasts. We have also identified a long-term build-to-suit space of over 200,000 square feet of mixed office and lab space close to our intermediate-term offices in King of Prussia.\n\nI'm pleased by the progress we are making to create a bi-coastal presence across two biotechnology hubs operating as one team, focused on the singular mission of developing medicines to improve the lives of patients with cancer. With that, I'll turn it over to Peter for a discovery update.\n\nPeter Lamb -- Chief Scientific Officer\n\nThank you, Vicki. I'll provide an update on developments in the Exelixis preclinical pipeline. We are building a broad pipeline derived from both internal and collaboration efforts with over 10 programs in progress, giving us the possibility of advancing up to 5 compounds into preclinical development in 2022, with additional programs on track for 2023. Late last year, we advanced XB010, a novel ADC targeting 5T4 into preclinical development, and we have now advanced our first bispecific XB014 targeting PD-L1 and CD47 into preclinical development as well.\n\nAs you can see on the pipeline slide, the preclinical pipeline is a balanced mix of small molecules and biotherapeutics, which is reflective of how we see our clinical pipeline evolving in the future. We are continuing to accelerate the expansion of our pipeline, both through growing internal capabilities and through business development activities. We have significant efforts on the business development front aimed at providing us access to novel targets, capabilities and technologies that complement and accelerate our ongoing biotherapeutics and small molecule strategies. We recently concluded two deals that exemplified this approach.\n\nFirst, we are pleased to have entered into a collaboration with BioInvent to identify novel targets and antibodies using their first platform. BioInvent has significant antibody discovery and immuno-oncology expertise, and their platform uses primary human tumor material as a starting point for parallel tumor-specific target identification and antibody discovery. Under the agreement, we can select three targets to license upon identification of development candidates against those targets. At that point, we're responsible for all future development and have advanced the antibodies as stand-alone or use them to make ADCs or bispecifics.\n\nThis is an investment in our longer-term biotherapeutics platform and is aimed at allowing us to broaden the target space we are addressing. We're continuing to look for additional partnerships that will add further biological novelty to our pipeline. We've also recently announced a deal with Ryvu for access to their proprietary STING agonists, which we intend to use to construct novel immunostimulatory ADCs, expanding our portfolio of payloads beyond cytotoxics. We believe that this provides an exciting opportunity for tumor-targeted stimulation of innate immunity with potential for being combined with a variety of antitumor and immune checkpoint therapies.\n\nWe're continuing to look for additional opportunities to expand our access to antibodies and payloads to support future pipeline growth. Finally, we're actively assessing late preclinical and early clinical assets with the aim of identifying multiple opportunities to invest in. Failure rates for oncology drugs remain high, and as such, we currently prefer a strategy of making multiple investments before clinical proof of concept rather than making more substantial investments based on inadequate or inconclusive data. We look forward to providing additional updates on these BD discussions as they come to fruition.\n\nI'll now turn the call back over to Mike.\n\nMike Morrissey -- President and Chief Executive Officer\n\nAll right. Thanks, Peter. As you heard on the call today, the EXEL team continued to execute across all components of our business in the second quarter with significant progress across our pipeline, clinical development, and commercial activities. As we enter the second half of 2022, we're excited about the potential for the multiple growth drivers ahead of us, as we continue to move the business forward and most importantly, enable Exelixis to help many more cancer patients.\n\nI'll close by thanking the Exelixis team for their individual and collective efforts to support our broad range of discovery, development and commercial activities, both here in Alameda and in our growing Exelixis East presence. We have the vision, determination and resources to become a multiproduct enterprise and expand our reach to serve cancer patients across the globe. We look forward to updating you on our progress in the future. Thank you for your continued support and interest in Exelixis, and we're now happy to open the call for questions.\n\nOperator\n\nThank you. [Operator Instructions] Your first question comes from the line of Asthika Goonewardene with Truist. Please proceed.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nThis is [Inaudible] on for Asthika. First of all, congrats on the quarter. Just had some questions here on XL102. Are you guys still going to do the expansion cohorts in HR-positive breast cancer? And when can we expect enrollment to open in that? Secondly, with respect to gross to net, it seems like quarter-over-quarter your discounts were pretty flat while your gross product revenues grew.\n\nHow do you see that evolving in the second half? Is there anything different from your previous expectations? And thirdly, with -- in the 10-Q, I saw that Teva seems to have filed an ANDA amendment, and they're going to -- are you guys are going to potentially file a suit against them? Would that be a separate suit? Or would that be rolled into the current suit against Teva? Thank you.\n\nMike Morrissey -- President and Chief Executive Officer\n\nYes. Thanks for the questions. Why don't we start with Vicki on the first one? Chris can take the second one, and I'll answer the third one.\n\nVicki Goodman -- Chief Medical Officer\n\nSure. So with respect to XL102, as I mentioned, we're currently in the dose escalation phase. And once we reach a recommended Phase 2 dose, we'd be able to move on into dose expansion. So we'll take some time to complete the escalation as well as evaluate that data.\n\nOur plans for dose expansion have not changed at this point.\n\nChris Senner -- Chief Financial Officer\n\nYes. Thanks, Mike. So this is Chris Senner. So from a gross to net perspective, last quarter -- so first quarter this year, gross to net was 30.8%.\n\nWe came down to 28.2% this quarter, and that was driven, as I said, mostly around Medicare Part D and lower co-pay assistance for commercial patients. As I said on the last quarter call, we're thinking that gross to net for the year is going to be in the 29% range as we see it today.\n\nMike Morrissey -- President and Chief Executive Officer\n\nThanks. And in regard to your question around the Teva ANDA, I can't really provide more update today on that. So thanks for the question.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nThank you so much.\n\nOperator\n\nYour next question comes from the line of Jason Gerberry with Bank of America. Please proceed.\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking my question. Actually my -- the answer could be a little more expounded upon than the last one. But just there was an update that there's a new patent in dispute that pertains to one of your formulation patents that haven't been asserted earlier on in litigation? And just curious if that's in any way connected to the the deficiency in the generic application regarding some impurities presumably around form of cabozantinib? So -- and if you can't get into too many details, just curious, would that patent operate under a separate litigation track than the other two tracks? I'm just kind of curious, how complex the overall MSN litigation case has gotten?\n\nMike Morrissey -- President and Chief Executive Officer\n\nYeah. Jason, it's Mike. Thanks for the questions. All fair questions.\n\nI'm not going to be able to say much more. You're correct about the third newest Orange book addition and Paragraph 4, back and forth that's happening right now. So we're looking through all those details. And as that becomes clarified, it will show up in the public domain, you'll be able to see what's happening, OK? Can't really provide more updates.\n\nBut thanks for the question.\n\nOperator\n\nYour next question comes from the line of Michael Schmidt with Guggenheim. Please proceed.\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nHey, guys. Thanks for taking my questions. I had a few on Cabometyx. Maybe first, if you could comment on market dynamics in the first-line RCC setting? Where does that growing TRx share? Where is it coming from? Are you still taking share from Sutent predominantly or perhaps from some of the other combinations and the Lenvima is also growing at the moment? I'm just curious how you see that playing out longer term in first-line RCC.\n\nA question on COSMIC-313. We were just wondering what the relevance of this OS analysis is just given that other drug, for example, the JAVELIN regimen did actually obtain approval just based on PFS without OS being? And then lastly, on CONTACT-01, we're just curious what your expectation is how the control arm will perform here in lung cancer post checkpoint and chemotherapy, and is perhaps the relevant historic comp? Thanks so much.\n\nMike Morrissey -- President and Chief Executive Officer\n\nOK. Thanks, Michael. Why don't we start with P.J. for the first question and then Vicki can follow up with the next two?\n\nP.J. Haley -- Executive Vice President of Commercial\n\nPerfect. Thanks, Michael. It's P.J. Yes, as you mentioned with regards to the market dynamics in first-line RCC, we're certainly pleased with the growth we've seen, as we talked about seven quarters in a row of prescription growth.\n\nAnd Q2 this year over Q2 last year, TRx growth of 29%, we're certainly pleased with and 6% quarter over quarter. So I think what's happening in the marketplace is the data and the messages really resonating with physicians. As I mentioned in the prepared remarks, physician experience continues to be positive as physicians get more experience with Cabometyx and nivo in the first-line setting. Certainly, our data and the messages of overall survival balanced with a good toxicity profile and quality of life really resonates there.\n\nSo we continue to take share from multiple TKIs. And I think we're really well-positioned going forward to continue to take share as well as continuing to get that growth, as I mentioned in my prepared remarks, from just the duration of therapy for those patients, which were in the trial, the PFS is in the ballpark of a year and a half. So I think we're benefiting from all those dynamics.\n\nMike Morrissey -- President and Chief Executive Officer\n\nOK. Thanks, P.J. Vicki?\n\nVicki Goodman -- Chief Medical Officer\n\nYes. So COSMIC-313, I think it's important to remember for this trial that we studied the triplet combination of Cabometyx in combination with nivolumab and ipilimumab versus nivolumab and ipilimumab in poor and intermediate-risk patients where nivo and ipi have already demonstrated a survival benefit, right? So this is the first Phase 3 clinical trial to go up against a modern standard of care in renal cell carcinoma. So the primary endpoint here is progression-free survival, and we've clearly demonstrated a benefit in PFS. The OS, as you might imagine, is immature, the median OS with nivo and ipi in this particular patient population is approximately four years.\n\nSo we do expect some -- for it to be some time before the data mature. And with these data in hand, we do plan to approach the FDA to have a conversation about a potential regulatory submission based on the progression-free survival data. With respect to CONTACT-01, as you noted, this is a patient population in non-small cell lung cancer of patients who have already received the checkpoint inhibitor and patent-based chemotherapy. So they have relatively few therapeutic options and often receive single-impacting chemotherapy.\n\nThe expected survival in this setting is less than a year for these patients. And so there really are -- there really is a need for additional treatment options that can improve upon that overall survival.\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nThank you.\n\nMike Morrissey -- President and Chief Executive Officer\n\nAll right. Thank you.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nOK. Operator, will take the next question when you're ready.\n\nOperator\n\nThe next question comes from the line of Andy Hsieh with William Blair. Please proceed.\n\nAndy Hsieh -- William Blair -- Analyst\n\nGreat. Yeah. Congratulations on the stellar quarter from the cabozantinib franchise, achieving over $2 billion annualized sales globally and also the 313 win. I have a question regarding the Senate bill.\n\nI'm just curious if you have any thoughts regarding the short-term impact from Medicare exposure? And potentially, longer term, as you think about portfolio diversification, any sort of push and pull that you expect as you plan on expanding the pipeline? The second question I have is for Peter. I am very curious about the BioInvent deal. I'm just curious about from a drug development standpoint, what potential blind spots can you uncover by using primary tissues versus just kind of cell lines? And I have a follow-up.\n\nMike Morrissey -- President and Chief Executive Officer\n\nAll right. Well, Andy, well, thanks for the questions. I'll take the first one. Peter can wax poetic on the second one, I'm sure, for as much time as we've got.\n\nIn terms of the Inflation Reduction Act and the drug pricing part of that, again, it's been a pretty interesting weekend to watch all the pushes and pulls. Certainly, it will get to, I think, signed by the end of next week is the, I think, the timeline. At a high level, let me say the following because we're doing a lot of work. It's pretty complicated.\n\nThere's about 200 pages of drug pricing info in an 800-page bill. So we're doing a lot of math right now to be able to understand things both quantitatively and temporarily. So I think we'll have more -- probably more data in a few weeks in terms of how that looks. I would say at a high level, it really doesn't impact us that much as the company as we are today.\n\nWe fall into that small company, if you will, clinical category with a single product in terms of the criteria that are outlined and the draft [Inaudible] bill. So we don't anticipate much impact on our business. But as you said, I think very eloquently, we aspire to do more and have more and be more as we go forward, be a multiproduct company covering both small molecules and biologics, and that diversity of modalities certainly plays well with the proposed wording of the bill as well as just in terms of being able to help more patients. So certainly, in the longer term, there might be issues.\n\nWe think we can navigate all those issues as we go forward, but we're certainly pleased to be able to see, at least in terms of short, midterm impact to be minimal probably at best. Peter?\n\nPeter Lamb -- Chief Scientific Officer\n\nYes. Andy, thanks for the question on BioInvent. I'm certainly very happy to have done that deal. And as you correctly pointed out, the starting point for their target ID and validation efforts is primary human tumor material.\n\nSo I think it has a number of key advantages versus certainly cell lines, but even animal model. I mean, it is the most relevant tissue that you can get, if you're thinking ultimately of trying to treat cancer patients. So you know you're starting from a point of some relevant, especially if you can look across multiple samples, which they can do. Secondly, I think this is super important, of course, in the biopsies that they're starting from and the tumor material they're starting from, it's not just cancer cells, right? So you are all looking at the true tumor microenvironment, including stromal cells and also crucially immune cells of various different subtypes.\n\nSo all those are in there. In terms of target expression, of course, regulation target expression can often be very complicated. It can depend on the local growth factor, cytokine for example. Often when you take things out of their normal in vivo setting and try and culture them, you lose all of that.\n\nSo it's really, I think, very strong to be able to start from that primary material. I think the second aspect of the collaboration that we found compelling was the way that they look for targets is really -- is the same as the way you get antibody. So they basically pan the human tumor material with their in-house antibody library and look for what sticks and then there's a big deep convolution process which determines what cell types is it sticking to, if it's just something that's expressed on a lot of normal tissues. So obviously, the process heretofore things which are specifically in human tumor tissue.\n\nAnd then since you have an antibody, you can then ask, does it do anything functionally, does it kill tumor cells as it activated immune cells, for example? So I think those two components together make it a very powerful platform, and we're excited to be working with them.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nAndy, did you have a follow-up?\n\nAndy Hsieh -- William Blair -- Analyst\n\nI do, I do. So this might not be kind of a fair question. It's a [Inaudible]. There's a lot of kind of political development going on across the oncology field.\n\nFRESCO-2 in CRC, there's been some news about RCC adjuvant, HCC, Lenvima combination. I'm just curious if Vicki can kind of opine on all the recent developments in the oncology space? And how that could change maybe your confidence level and strategic position for XL092?\n\nVicki Goodman -- Chief Medical Officer\n\nYeah. Thanks for the question. So well, I wouldn't comment on data sets that I haven't seen from competitors. I will say, obviously, drug development is not a sure bet.\n\nI think that when we look at 092, I think there's a couple of reasons for having confidence. One is, it has a very similar kinase profile to cabozantinib. It has a shorter half-life as it was designed to in order to potentially make the management of adverse events more manageable with temporary interruptions. And then I think the ability to combine with any number of additional combination agents.\n\nSo as I mentioned in my prepared remarks, combining with a variety of different IO agents, both checkpoint inhibitors, including PD-1 as well as potentially novel agents, really gives us a broad number of possibilities, and we are leveraging the cabozantinib data that we've seen, given the similar kinase profile to really consider where to go next with the perfect example of that is the CRC program where you saw the data at ASCO-GI earlier this year from both COSMIC-021 as well as from an IST that really provided the background data and confidence to move forward in that tumor type. And so you'll be seeing additional Phase 3 trials where we will be leveraging the cabozantinib data and activity that we've seen, particularly with combination approaches to move forward with additional registrational programs.\n\nAndy Hsieh -- William Blair -- Analyst\n\nThat's very helpful. Thank you so much.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThank you, Andy.\n\nOperator\n\nYour next question comes from the line of Jay Olson with Oppenheimer.\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nHey. Congrats on the quarter and thank you for taking the questions. Can you talk about the feedback that you've received from KOLs on the COSMIC-313 top-line results? And any lessons you learned that you plan to apply to triplet regimens with XL092 in other tumor types? And then separately, we had a question on the factors that drove you to maintain your revenue guidance. And any comments you can share on cabo sales trends going into the second half of the year? Thank you.\n\nMike Morrissey -- President and Chief Executive Officer\n\nJay, it's Mike. It's probably a little bit early to be commenting on feedback we're getting on 313. Again, as Vicki mentioned in her prepared remarks, I'm hoping to have that data presentation sometime this year. So maybe we can come back to that question once the data is out, and we can speak more freely about the totality of the data that's available, OK? In terms of guidance, I'll pass it over to Chris.\n\nChris Senner -- Chief Financial Officer\n\nThanks, Mike. So from a revenue perspective, yes, we're maintaining the guidance level for product revenue of $1.325 billion to $1.425 billion. And right now, based on what we've done year to date at $657 million. So if you annualize that, that's in the lower end of the range.\n\nBut we continue to see growth. We've seen growth in Q1, we've seen growth in Q2, and that's our expectation for growth in the second half of this year to meet that revenue guidance number.\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nGreat. Thanks for taking the questions.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nYou bet. Thank you, Jay.\n\nOperator\n\nYour next question comes from the line of Akash Tewari with Jefferies. Please proceed.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nHi, everyone. This is [Inaudible] for Akash. We have a couple of questions, if we may. So the first question is about XB002.\n\nSo from the poster, it seems the main improvement in XB002 is related to neutral [Inaudible] and also [Inaudible], however, we are seeing that around 20% patients in Tivdak pivotal cervical cancer trial had ocular AE that leads to dose reduction, and there are 5% of patients discontinue the treatment. So how much confidence do you have that you will be able to dose [Inaudible] two mgs per kg and get around IO toxicity? The second one is about cabo. So do you still feel comfortable with the run rate of $1.5 billion cabo sales by the year-end? Also, what makes you feel confident about cabo's growth post 2022 and beyond, given the COSMIC-313 data and also competition from other treatments in the space? Thank you.\n\nPeter Lamb -- Chief Scientific Officer\n\nIt's Peter. Thanks for the question on XB002. In comparison to Tivdak, there are a number of differentiating factors with XB002 that we feel are compelling. I mean I think it's a great example of taking a target which has clinical validation, as shown by the Tivdak data and then kind of building on that experience.\n\nSo just to run through them. First, obviously, the antibody is not the same, binds to a different epitope on tissue factor. It was very carefully selected such that the epitope does not interfere with Factor VII binding and therefore does not interfere with coagulation at all, and we've shown that in multiple preclinical models, both in vitro and in vivo. So fairly confident that, that's going to translate clinically.\n\nThe second major point of differentiation is really around the link of payload. XB002 uses the ZymeLink linker payload from Zymeworks. That is a modified oral statin. So it's not the standard MMAE that has been so prevalently used.\n\nIt's fairly heavily modified and has a different linker. And these were carefully optimized for a number of parameters -- kind of biophysical parameters, but also especially for the stability of the linker with that bond to the antibody. And certainly, again, both preclinically, we've kind of recapitulated that with 002. On dosing, we see very low levels of free circulating payload while still maintaining good levels of intact ADC.\n\nObviously, as we get increasing levels of free circulating payload, that's something that can contribute to multiple AEs. And so we think, for example, the reduced neutropenia that was commented on in the preclinical models may be a consequence of that. So I think the promise of 002 is maybe the ability, as you pointed out, to dose higher than has been achievable with Tivdak, either from mg/kg but ultimately from an actual plasma exposure point of view and then see if that leads to an increased efficacy with a good therapeutic index. So we'll see how the results for now.\n\nMike Morrissey -- President and Chief Executive Officer\n\nOn the other questions -- Mike, yes, we're certainly vectoring in the direction of that $1.5 billion run rate by the end of the year. So we've got two more quarters to go, but we certainly, I think, we're off to a good start in Q1 and Q2 of 2022. So obviously, stay tuned for the next updates as we go on throughout the year. In terms of longer-term growth potential for cabo, obviously, a lot of that is dependent upon how the CONTACT trials work out.\n\nObviously, we need positive data to be able to drive revenue growth. Certainly, the RCC effort, as P.J. and team have talked about today, have gone really well. And certainly, we're excited about 313, at least that top-line data.\n\nWe need to see where that goes in terms of discussions with the FDA. But again, good data, but gets the opportunity for top-line growth, and that's the business that we're in. So stay tuned.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nThank you.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThank you, [Inaudible]\n\nOperator\n\nYour next question comes from the line of Yaron Werber with Cowen. Please proceed.\n\nYaron Werber -- Cowen and Company -- Analyst\n\nGood afternoon, everybody. So I have a couple of questions. The first one, just maybe as a follow-up to the last one. When we look at seasonality for cabo, it looks like at least the last two years sort of Q3 is a little weaker and then Q4 has a really strong kind of bounce back and enter the year.\n\nAre you expecting sort of similar seasonality? Or was that more of a COVID issue? And then secondly, with respect to CONTACT-01, I know you probably can't say a lot, but can you give us any flavor at all as to what was the interim analysis bar for . It sounds like you passed futility. So just confirm there was a futility look. And then finally, Ipsen is guiding to CONTACT-02 data next year in prostate, and I think you're guiding to completing enrollment in the first half.\n\nSo I just want to make sure if you continue enrollment in the first half, does it sound like you're on track for data by the end of the year? Thank you.\n\nMike Morrissey -- President and Chief Executive Officer\n\nOK. So I'll take the first question, and Vicki can address the next two. Yes, you're on -- fair question about Q3. Obviously, that's the quarter we're in, and we don't really comment on what's happening in the current quarter.\n\nSo you're certainly to go back, look at prior years and draw your own conclusions, but we're not going to comment on that. So thank you. Vicki?\n\nVicki Goodman -- Chief Medical Officer\n\nYes. And so I believe in CONTACT-01, the non-small cell study, where you're asking about the OS analysis. So this is a Roche run trial that we're partnering with Roche. And per their process, the IDMC met to review an interim analysis of overall survival and recommended that the trial be blinded and continue on to the final analysis.\n\nSo we expect to see the final analysis data before the end of the year. And we look forward to sharing those data at a medical conference when we receive them and certainly include details of the specifics of the trial design. I apologize, I missed your second question for me.\n\nYaron Werber -- Cowen and Company -- Analyst\n\nYes. And so CONTACT-02 in prostate, Ipsen is guiding to data by the end of -- data next year. And I think you're guiding for completing enrollment in the first half. So it sounds like would you complete enrollment in first half, you'll have data by the end of the year? Just want to make sure it's consistent.\n\nThank you.\n\nVicki Goodman -- Chief Medical Officer\n\nOK. Thanks. So yes, so we're -- we are focused on completing enrollment right now. And we do anticipate that, that will be in the first half of next year.\n\nI think we'll have a better sense of our projection for when the events are coming in and the timing of the analysis once we complete enrollment.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Peter Lawson with Barclays. Please proceed.\n\nPeter Lawson -- Barclays -- Analyst\n\nGreat. Thanks so much for taking the question. Chris, I guess just thoughts on the use of cash and thoughts on potential M&A and asset crisis. Any kind of commentary around that would be great.\n\nChris Senner -- Chief Financial Officer\n\nAll right, Peter. Thanks, it's Chris. So yes, I mean, we have $2 billion. And as I mentioned in the prepared remarks, we feel that that's an asset that we can utilize to continue to build out our development in our discovery organizations.\n\nBut also in parallel to that, our business development efforts, and we're continuing to evaluate assets, just because they're less expensive doesn't mean they look better. We're -- science is where we're headed with this. And so we're going to continue with the science and then obviously, the economics fall out of that. But we're out there hunting and looking for assets that can help us expand our pipeline.\n\nPeter Lawson -- Barclays -- Analyst\n\nGotcha. And do you -- do you feel asset prices have got to a reasonable level?\n\nChris Senner -- Chief Financial Officer\n\nYes. I mean, Peter, they've come down, but I mean, it's all relative. It's all relative to the value that you see based on the data that you're seeing and the opportunity in the market. So it's a relative number.\n\nSo we're continuing to look.\n\nPeter Lawson -- Barclays -- Analyst\n\nGotcha. Thank you. And then, I guess, for Vicki, just on XL102. Just -- what we should expect for the second half data set for 102? And how many patients and tumor types and cohorts, etc.?\n\nVicki Goodman -- Chief Medical Officer\n\nYes. So we have submitted an abstract for XL102 with the hopes of sharing data later this year at a medical conference. I think in terms of the details, that will obviously be shared at the time that the abstract is published and ultimately with the presentation at the conference. It is a dose escalation, looking across multiple cohorts and multiple tumor types.\n\nAnd so that is what you would expect to see at that time.\n\nPeter Lawson -- Barclays -- Analyst\n\nOK. Thanks so much for taking the questions.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nYou bet, Peter. Thank you.\n\nOperator\n\nYour next question comes from the line of Gregory Renza with RBC Capital Markets. Please proceed.\n\nSudan Loganathan -- RBC Capital Markets -- Analyst\n\nThis is [Inaudible] for Greg Renza. Thanks for taking my question and congrats on the great quarter. So first, I wanted to touch on the ASCO 2022 data that you guys presented for cabo combinations with pembrolizumab, specifically in the head and neck sarcomas and non-small cell lung cancer. And you see indications -- just how do you view that combination going forward? And could we get some insight into potential registration trials and how that may be formulated? And then secondly, I just wanted to give you guys the opportunity again to really talk about the BD activity that you have embarked on recently, seems like it's very active and with multiple different targets and multiple different technologies.\n\nI'm just very curious on if there's any specific technologies there that you're most excited about? Or if you are diversifying in the sense of looking into liquid cancers and solid tumors? Just looking for any clarity that you have on that aspect as well. Thank you.\n\nMike Morrissey -- President and Chief Executive Officer\n\nOK. Vicki, do you want to take the first part?\n\nVicki Goodman -- Chief Medical Officer\n\nSure. So with regard to the cabozantinib plus pembrolizumab data that were presented at ASCO. So this was from an investigator-sponsored trial in recurrent head and neck cancer. Certainly, interesting data.\n\nAs we've said before, we're looking to leverage data from our cabozantinib development program to move forward with XL092 as quickly as possible given the similar kinase profile. Again, I think checkpoint inhibitor combinations are certainly of interest to us given the potential immune modulation and what we've seen in terms of activity for checkpoint inhibitor combinations with the tyrosine kinase inhibitors. So we're going to continue to leverage those learnings as we develop additional registrational trials. So for now, stay tuned.\n\nPeter Lamb -- Chief Scientific Officer\n\nYes. This is Peter. So with respect to ongoing BD activities, you're correct, yes, very active right now. We're looking at a pretty broad spectrum of things just to provide a bit more color.\n\nWe have obviously are building a fairly substantial internal small molecule discovery capability. That said, I think there is a lot of interesting approaches and technologies out there that enables one to take on a broader range of targets than the traditional small molecule kind of targets that have been out there previously, such as kinases. So we're always looking at those, essentially seeking to complement what we can do internally and then broaden the range of targets that we can take on. Likewise, on the biotherapeutics front, for us, that's much more being done through a network of collaborations.\n\nSo again, we continue to look at collaborations that will give us access to a broader range of targets, antibodies, payloads and platforms potentially as well. And then coupled with that, of course, we've been very actively looking at a wide range of both small molecules and biotherapeutics or either in late preclinical development or early clinical development with the aim of potentially optioning or licensing those. So yes, lots going on, so stay tuned.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nOperator, next question.\n\nOperator\n\nYour next question comes from the line of Etzer Darout with BMO Capital Markets. Please proceed.\n\nEtzer Darout -- BMO Capital Markets -- Analyst\n\nGreat. Thanks for taking the question and Congress in the quarter Just a question on XL092 presentation at ESMO. If you could -- maybe just speak to us a little bit about sort of where maybe we should be focused on in the data set? And maybe will we start to sort of glean into the profile that led to the initiation of the CRC trial with atezolizumab? Just want to get a sense of sort of what your expectations are on the data set and how we should be thinking about that data set as it's presented. Thank you.\n\nVicki Goodman -- Chief Medical Officer\n\nOK. So with respect to XL092, I'll say we're pleased that ESMO has accepted our abstract for a poster. As I mentioned earlier, these are going to be data from dose escalation cohorts that supported the recommended Phase 2 dose, both for the monotherapy for XL092 and for XL092 in combination with atezolizumab. So predominantly focused on safety data and pharmacokinetics that supported the dose that we're moving forward with, both for the monotherapy and the combination.\n\nThere will be preliminary data looking at activity, of course, across multiple doses and multiple tumor types. But I think that it will give you a sense of the general activity profile of the molecule, and we look forward to sharing more details in the ESMO poster.\n\nEtzer Darout -- BMO Capital Markets -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nYour next question comes from the line of Chris Shibutani with Goldman Sachs. Please proceed.\n\nStephen Grambling -- Goldman Sachs -- Analyst\n\nHi. Good afternoon. This is Stephen on for Chris. I have a couple related to the reconciliation bill and potential for price negotiations.\n\nCan you just remind us about the split of patients reimbursed through commercial payers versus government payers? And then how is your team thinking or modeling the Cabometyx loss of exclusivity? Any thoughts there would be helpful. Thank you.\n\nChris Senner -- Chief Financial Officer\n\nThank you. This is Chris Senner. So from a business perspective -- from a proportion of business perspective, commercial versus government payer, we're -- from a government payer perspective, we're in that 40% range. It depends on the quarter, obviously, and the stream of patients, but we're in that 40% range.\n\nIt could be higher, it could be lower depending on the quarter. But that's the way we've seen it historically.\n\nMike Morrissey -- President and Chief Executive Officer\n\nYes. It's Mike. In terms of long-range planning, all the work that we've done to date focuses on cabo LOE of 2030.\n\nStephen Grambling -- Goldman Sachs -- Analyst\n\nOK. Thank you very much.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nThank you, Stephen.\n\nOperator\n\nYour next question comes from the line of Andy Hsieh with William Blair. Please proceed.\n\nAndy Hsieh -- William Blair -- Analyst\n\nThanks for the follow-up. So for Peter, I'm just curious if you can elaborate on a new XB014 program? Obviously, it's modulating the two more exciting checkpoints. I just wanted to know about the design considerations. Are you trying to achieve induced proximity across two distinct cell types? Or is there something more going on there? And it goes without saying that investors and also maybe clinicians are interested in the strategy that you employed to potentially reduce red blood cell binding.\n\nSo I don't know if you are willing to kind of comment on that as well. Thanks.\n\nPeter Lamb -- Chief Scientific Officer\n\nYes. Sure, Andy. So yes, you're correct, XB014 essentially has the bispecific that has [Inaudible] targeting the well-known PD-L1, PD-1 T-cell checkpoints, the other the CD47 macrophage checkpoint. There always been a lot of recent interest in the latter and a lot has been learned, I think, from the initial clinical experiences with a number of those agents, including the fact that anemia and thrombocytopenia or some of the major AEs that are seen.\n\nWe've very carefully designed XB014, taking those data into account. In brief, we've got a tight binding PD-L1 side, but we've very -- we've detuned the CD47 side a little bit. So what we see is kind of minimal binding to red blood cells, but we still get avid binding to tumor cells because of the PD-L1 arm bringing the CD47 arm down. So it's [Inaudible] effect essentially.\n\nAnd yes, we would expect that there's going to be a proximity effect there as well in terms of bringing macrophages into play. And finally, because of the design of the molecule, we're able to have a wild-type IgG1 Fc in there, which normally you have to silence because of the red blood cell binding. And of course, having that will then synergize somewhat with the CD47 checkpoint. So one of those things are incorporated.\n\nWe think it's an interesting and reasonably unique profile. So we're excited to be taking it forward.\n\nAndy Hsieh -- William Blair -- Analyst\n\nGreat. Look forward to the data from -- generated from that program.\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nGreat, Andy. Thank you very much for the question.\n\nOperator\n\nAt this time, there are no further questions. And so I will turn the call over to today's host, Susan Hubbard. Ms. Hubbard?\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nYeah. Thank you. And thank you all for joining us today. We certainly welcome your follow-up calls with any additional questions you may have that we were unable to address during today's call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSusan Hubbard -- Executive Vice President of Public Affairs and Investor Relations\n\nMike Morrissey -- President and Chief Executive Officer\n\nChris Senner -- Chief Financial Officer\n\nP.J. Haley -- Executive Vice President of Commercial\n\nVicki Goodman -- Chief Medical Officer\n\nPeter Lamb -- Chief Scientific Officer\n\nUnknown speaker -- Truist Securities -- Analyst\n\nJason Gerberry -- Bank of America Merrill Lynch -- Analyst\n\nMichael Schmidt -- Guggenheim Partners -- Analyst\n\nAndy Hsieh -- William Blair -- Analyst\n\nJay Olson -- Oppenheimer and Company -- Analyst\n\nYaron Werber -- Cowen and Company -- Analyst\n\nPeter Lawson -- Barclays -- Analyst\n\nSudan Loganathan -- RBC Capital Markets -- Analyst\n\nEtzer Darout -- BMO Capital Markets -- Analyst\n\nStephen Grambling -- Goldman Sachs -- Analyst\n\nMore EXEL analysis\n\nAll earnings call transcripts"
}