{
  "companyName": "Citi Trends",
  "companyTicker": "CTRN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/citi-trends-ctrn-q2-2022-earnings-call-transcript/",
  "content": "Citi Trends (CTRN -2.07%)\nQ2 2022 Earnings Call\nAug 24, 2022, 9:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to the Citi Trends second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded, Wednesday, August 24, 2022. I would now like to turn the conference over to Nitza McKee, senior associate. Please go ahead.\n\nNitza McKee -- Senior Associate\n\nThanks, Rita, and good morning, everyone. Thank you for joining us on Citi Trends second quarter 2022 earnings call. On our call today is our chief executive officer, David Makuen; and chief financial officer, Heather Plutino. Our earnings release was sent out this morning at 6:45 AM Eastern Time.\n\nIf you have not received a copy of the release, it's available on the company's website under the investor relations section at www.cititrends.com. You should be aware that prepared remarks today made during this call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Management may make additional forward-looking statements in response to your questions. These statements do not guarantee future performance.\n\nTherefore, you should not place undue reliance on these statements. We refer you to the company's most recent report on Form 10-K and other subsequent filings with the Securities and Exchange Commission for a more detailed discussion of the factors that can cause actual results to differ materially from those described in the forward-looking statements. I will now turn the call over to our chief executive officer, David Makuen. David?\n\nDavid Makuen -- Chief Executive Officer\n\nThank you, Nitza. Good morning, everyone, and thanks for joining us today on our second quarter fiscal 2022 earnings call. Before I provide an overview of our second quarter performance and the strategic direction we are taking the business in the near-term as a result of the current challenging macro environment, it's important that we provide you with a high-level view of our customer base. After that, Heather Plutino, our chief financial officer, will then elaborate on our financial results and a few other items related to our outlook.\n\nTo begin, let me be fully transparent, our customers are facing one of the most challenging economic environments in history, inflationary pressures across their household necessities, including rent, utilities, food and gas are outpacing their wage growth. Our lowest income household bracket those with an annual household income of $25,000 and below, accounting for approximately 50% of our customer base have been hardest hit from these extreme macro pressures. I have personally visited many neighborhoods and talked to many customers and associates to learn just how much pressure they are feeling. Even though tough times persist, what's most important to share is that our customers believe that our store experience is more engaging than ever, and our city crew delivers on our purpose each and every day by welcoming their existing and new customers, like a friend, helping them show up for whatever comes their way.\n\nWith this backdrop acknowledged, what we are clearly seeing is a decline in the number of discretionary shopping visits. But when they do visit Citi Trends stores, our conversion rates are extremely strong and have been consistent week to week since the beginning of the year, plus our average basket size is holding up nicely compared to last year's record stimulus aided spending levels. Given these trends, we are confident that our customers remain loyal to the Citi Trends brand and our assortments for the entire family continue to resonate. Having said this, we are committed to doing better and controlling what we can to meet the needs of the valued customer, which our model does quite well.\n\nOur buy team, in particular, is on their toes, chasing extreme value trends across our six cities or categories. Hard at work, they have identified opportunities to capture more market share, particularly in our ladies and footwear cities by adapting to changing consumer trends. Additionally, we continue to play offense by introducing new or expanded assortments that I had mentioned previously, including the continued rollout of our Q line, adding more everyday essentials to the mix, building a ladies missy size and assortment and capitalizing on the strength of our casual men's business. Overall, we remain hyper-focused on driving healthy sales, managing inventories and maximizing margin to improve our operating profit.\n\nOn the expense side, our number one priority is to lower our SG&A expenses to align with the lower sales expectations. As the second quarter unfolded, we couldn't adjust expenses overnight, but we aggressively created a plan and have already taken action to rightsize our expense structure and build efficiencies across our business functions, assuming a lower sales base brought on by primarily macro conditions. Let me assure you, we are taking swift and aggressive actions on approximately $10 million in expense savings for the second half of 2022 or about 7% of total SG&A expense, including a 10% staff reduction. We wish the very best to be associates impacted by this difficult decision and truly appreciate their contributions.\n\nOverall, we are controlling what we can control, and we are on track to significantly reduce SG&A deleverage versus both 2021 and 2019 during the second half. Before I turn it over to Heather, I want to highlight a few metrics about our business during the second quarter and year to date. Comparable transactions versus the prior year sequentially improved 510 basis points from Q1 to Q2. Our average basket contracted only slightly by 5% against last year's outsized growth of 35% compared to Q2 of 2019.\n\nWe maintained a high gross margin at 38.1% for the quarter and 38.6% for the first half. Our inventory remained in excellent shape with an average in-store dollar decline of 13% compared to 2019 and a 26% decline on a unit basis. We ended the quarter with no debt, $28 million in cash and $103 million in liquidity. With that, I'll turn the call over to Heather, our new CFO, who I am extremely pleased to have a member of our leadership team.\n\nShe will discuss our second quarter results in detail as well as our updated guidance for the balance of the year. Heather?\n\nHeather Plutino -- Chief Financial Officer\n\nThanks, David, and good morning, everyone. I'm very honored to be part of the Citi Trends leadership team. And as you can imagine, it's been a busy and productive two months since I joined in late June. I've been immersed in getting to know the business, meeting our corporate, stores and distribution center teams, as well as our customers.\n\nI have quickly gained great admiration for the Citi Trends business model with its unique value proposition, servicing the apparel, accessories and home needs of African-American and Latina family and its deep commitment to making a difference in the neighborhoods we serve. I'm excited to take on the CFO role and will leverage my background and experience in retail to identify opportunities to further transform the business model as, I believe the potential for growth remains significant. Now turning to our results in the second quarter and the first half of the year. As David mentioned, the macro environment remained difficult throughout the quarter with persisting headwinds from extreme inflationary pressures impacting all of our customers, but most notably our lowest household income cohort.\n\nThe impact from inflation has been deeper and longer lasting than we expected. Importantly, our teams have remained nimble and focused delivering strong margin in the quarter and working tirelessly to right-size our expense base. Our balance sheet is healthy and we ended the quarter with ample cash, well-managed inventory and our $75 million revolving line of credit remains unused. In addition, as mentioned in our earnings release, we expect to close a sale leaseback transaction in our Roland, Oklahoma distribution center in September adding $36 million of cash to our balance sheet all of which positions us well to continue to navigate this dynamic operating environment, while remaining focused on our strategic initiatives.\n\nNow, let's turn to specifics of our Q2 financial results. As mentioned in our earnings release, we are comparing select operating results for the second quarter and first half of 2022 and relative to the same periods in 2019, in order to provide a more normalized comparison of performance. Total sales for the second quarter were $185 million, a decrease of 22% versus Q2 '21 or an increase of 1% versus Q2, 2019. Comparable sales decreased 25% compared to last year, lapping a 26% increase in Q2, 2021 versus Q2, 2019, representing a three-year staff of 1%.\n\nSales in the quarter were approximately 90% of first quarter 2022 sales, consistent with pre-pandemic historical results. Absolute transactions and conversion in the second quarter remained stable and consistent with Q1. Importantly, as David mentioned, our year-to-date average basket size contracted only 5% compared to the first half of 2021, a period impacted by unprecedented government stimulus assistance. Gross margin was 38.1% in the quarter compared to 40.8% in Q2, 2021 and 37.3% in Q2 2019.\n\nOur strong gross margin results are reflective of our disciplined inventory management and product assortments that continue to strongly resonate with our core customers. With regard to the supply chain environment, we have successfully navigated inbound and outbound freight headwinds, resulting in substantial cost mitigation, with only a 20 basis point increase in Q2 2022 versus Q2 2021. While SG&A expense dollars declined 9.2% versus Q2 2021, the softer top line resulted in outsized pressure on our SG&A rate. We experienced SG&A expense deleverage of 520 basis points versus Q2 2021 to a rate of 37% of sales.\n\nAs David noted, the management team has been working to aggressively lower our expenses aligned to our revised sales expectations and we look forward to reducing SG&A deleverage versus last year by more than 50% for the second half of the year. Operating loss was $3.3 million in the quarter compared to operating income of $0.2 million in Q2 2019. Net income was a loss of $2.5 million in Q2 2022 compared to net income of $0.4 million in Q2 2019. Second quarter EBITDA was $1.9 million compared to $4.8 million in Q2 2019.\n\nAnd finally, 2022 diluted loss per share was $0.31 compared to diluted earnings per share of $0.03 in Q2 2019 or $0.06 on an adjusted basis. Now, I'll turn to some brief highlights from the first half of 2022. Total sales for the first half were $393.2 million, a decrease of 25% to prior year and a 1% increase to 2019. Comparable sales declined by 27% versus 2021, on top of a 30% increase in 2021 sales versus 2019, a three-year stack of 3%.\n\nGross margin in the first half was 38.6% versus 41.8% in 2021 and 37.4% in 2019. EBITDA in the first half of 2022, adjusted for the gain on the sale of a distribution center, was $12.1 million versus $65.1 million in 2021 and versus $19.6 million in 2019, as adjusted. Year to date, earnings per diluted share of $3.34, $0.12 as adjusted for the first quarter sale-leaseback transaction, compared to $4.63 in the first half of 2021 and $0.68 in 2019 or $0.76, as adjusted. Turning to our balance sheet.\n\nTotal inventory at quarter end increased 26% to Q2 2021 and 8% to Q2 2019. Excluding packaway goods, inventory increased 8% versus Q2 2021 and decreased 4% versus Q2 2019. Average in-store inventory increased only 3% in dollars versus last year, a decrease of 4% in units. Average in-store inventory decreased 13% in dollars versus Q2 2019, a 26% decrease in units.\n\nWe are comfortable with our level of inventory and thank the team for their continued commitment to agile, disciplined inventory management. As it relates to our buyback program, year-to-date, we repurchased approximately 331,000 shares at an aggregate cost of $10 million, leaving approximately $50 million remaining on a program. We ended the quarter in a strong capital position with $27.9 million of cash and no debt. Capital allocation remains a primary focus of our board of directors and in light of the dynamic macro environment, we are carefully evaluating our cash and investments to ensure we maintain adequate liquidity.\n\nNow, turning to our guidance for the balance of the year. In light of the challenging macro backdrop, we have revised our outlook for the year and have pivoted quickly to managing and aligning our expense structure to a more normalized sales environment based on predictable historic trends. Our updated guidance including the impact of the sale leaseback of the Roland distribution center is as follows. We expect low single-digit increase in second half total sales compared to first half total sales.\n\nFor the full year, this represents an 8% to 10% decline from the midpoint of previous guidance of $870 million. We anticipate gross margin in the high 30s to low 40s range for the second half. We expect significantly less SG&A deleverage versus prior year in the second half compared to the first half due to aggressive expense reduction net of incremental lease expense from sale-leaseback transactions. Finally, as David mentioned, we are prudently reducing our capital expenditures by approximately $10 million to ensure we have additional liquidity to chase opportunities as they arise, resulting in 2022 capital expenditures of approximately $22 million for the year.\n\nWith these factors, we expect second half operating income to be approximately in line with the results from the second half of 2019. Year-end cash balance is expected to be approximately $85 million to $100 million, including the proceeds from the Roland sale-leaseback transaction. In summary, Q2 proved to be a challenging quarter with meaningful inflationary headwinds impacting our customers' discretionary spending. As we expect this uncertain selling environment to persist through the balance of the year, we will continue to aggressively and diligently manage inventory, control expenses, and fortress the balance sheet.\n\nRegarding the topline, I can assure you that we are getting better every day and delivering the right trends at the right value across our 617 stores. I look forward to updating you on our strategic progress on our next call. With that, I will turn the call back to David for closing comments. David?\n\nDavid Makuen -- Chief Executive Officer\n\nThanks, Heather. Before we wrap up, let me close the loop on the health of our core customers. As we have seen across our 76-year history, it shows us time and time again that when macro challenges subside, our customers return to Citi Trends. Citi Trends customer is local, loyal and resilient, and we will remain dedicated to our neighborhood to serve the entire family for their apparel, home and accessories needs in both tough times and good times, all anchored by our Citi life purpose to live bold, live proud and respect all.\n\nAs the rest of the year unfolds, we are in the process of deploying our Citi reimagination plan across our buy and move, sell and support functions by being hyper focused on areas we have consistently acted on and shared with you. They are as follows: Number one, our products, continuing to broaden the appeal of Citi Trends to new multicultural lower-income households in search of trend-right apparel, home and accessories at prices that don't break the bank; number two, our fleet, continuing to upgrade our customer experience via our CTx remodel program and by providing better tools to our store management teams to increase sales productivity; number three, our infrastructure, including important investments in our buy and move functions that will contribute to a smarter, faster and data-centric customer and associate solution; number four, our balance sheet, along the strength of Citi Trends, our focus is on the here and now and applying fresh and innovative thinking to managing opex, working capital and cash usage; and last but not least, number five, making a difference. Whether it's paying out our customers lay away when they are a bit short or pitching in for families in need during these tough times, we will ensure we never loose our focus in supporting our customers and associates in the neighborhoods in which they have. We continue to believe there is significant wide space to expand the Citi Trends brand, and we look forward to reestablishing growth once the operating environment fully normalizes.\n\nWe have confidence in our customer who we know to be resilient and loyal will allow us to return to a position of growth in time. As always, I want to thank the entire Citi Trends team, all the women and men that are the face of our brand, creators of our culture and drivers of our customer engagement and their hard work and endless efforts in making a difference in the neighborhood we serve never goes unnoticed. Their passion to live our purpose is shining bright and will carry us into the future. We are now ready to take your questions.\n\nRita, back to you.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Jeremy Hamblin with Craig-Hallum Capital Group. Please proceed with your question.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nThanks for taking the question. So I wanted to start by asking about kind of the store growth. And I know that there's remodels happening to the CTX format, etc. But with your capex budget getting cut to $22 million, wanted to get a sense for the remainder of the year openings.\n\nAnd then really in the context of how to think about FY 2023, given how challenging the environment is currently for your customer, does this reset your thinking on a go-forward basis to a much lower store growth?\n\nDavid Makuen -- Chief Executive Officer\n\nGood morning, Jeremy. Thanks for joining us. And let me take a crack at your store growth question. First off, on fiscal 2022.\n\nAs you're aware, we have trimmed our store growth assumptions from the beginning of the year to be a bit more prudent in this environment and also to be able to continue to open successful new stores. As we look at the rest of the year, we are going to slow our growth a bit here. We'll probably kind of end up in the range of about 15-ish new stores as we close the year out. We've had some difficulty in, I'll call it, the supply chain of new stores, largely driven by landlord and billing delays, things outside of our control, which has pushed some stores later.\n\nAnd then part of it is reflected in our slightly more conservative capex spend to allow for some liquidity in this year to chase opportunities as noted on the call. When it comes to 2023, it's too early to comment. We have tons of great stores in the pipeline for 2023, and we're in the midst, as you can imagine, of working through our here and now plans so that we can deliver the second half as indicated in the call today. And then we'll get hard after what 2023 looks like in early to mid fall.\n\nSo more to come on what that looks like, but too early to predict.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nOK. And then in terms of the change to sales guidance and I think when we compare versus 2019 now, the picture becomes a little clear that we've just reverted to similar levels. But I did want to get a sense in terms of your more recent trends kind of the cadence of sales over the last couple of months and here in the first month of Q3, have you seen any improvement, or is this just kind of stabilized at a lower level than you had expected. And that's what you're anticipating on a go-forward basis given that you guidance does imply for slightly better back half of the year results.\n\nBut I wanted to get a sense for what you're seeing currently.\n\nDavid Makuen -- Chief Executive Officer\n\nSure, Jeremy, happy to add a little bit of color on that. Good question about kind of the expense and how we're thinking about the second half. With regards to the year-to-date trends, as we mentioned in one of our comments in the call, absolute transactions and our convergence have been extraordinarily consistent. And so I think the good news is as you look at the pressures and how it impacts our lower income segments, silver lining in a way we've held.\n\nSo I would be worried [Inaudible] the way Q1, Q2 unfolded. It's been really consistent not a lot of big ups or big downs. And so, we believe, as you heard in the call, this idea of having a loyal resilient customer and those that have the means to come back on a regular basis and shop relatively frequently, which is a hallmark of the brand has definitely been the case. We're just seeing an absolute lower level of footsteps in the door given the pressures on the -- in particular, the low-income bracket of our total target audience.\n\nAs we look at the second half, we have definitely chosen after a lot of rigor and analysis as best we can and as you know, it's hard to predict through these times. We've sort of indicated, as you could tell on the guide that it's going to kind of maintain that stable level. We're not sure as most retailers aren't -- whether it will improve drastically or not. But we've got a little bit of improvement built in there, which we think is prudent given what we're seeing in a little bit of early Q3 read.\n\nBut overall, it's a stable trend as supported by strong conversion, strong basket, strong [Inaudible] all the right metrics, filling the right levels of performance, but it's just that with that pressure on-track number of people coming in the door. Does that make sense?\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nYeah. No, that's helpful for sure. OK. Last one and then I'll hop out of the queue.\n\nBut in terms of the sale-leaseback transaction, when taken in combination with what was done with the first DC, clearly, you guys you're going to have very strong cash balance by the end of the year. Wanted to get a sense for taking the two transactions in total, what is the annual rent cost that is going to be added by having those kind of sold DCs, so that we can kind of think about that on an FY '23 basis? I assume that all of those dollars flow through your SG&A line. Could you confirm?\n\nHeather Plutino -- Chief Financial Officer\n\nSure. I'll hop in and take that. On an annualized basis, Jeremy, the rent expense for the two distribution center leases, is just shy of $8 million. You can think about it as a 1% on an SG&A rate basis, assuming $800 million of sales.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nOK, got it. And so does that imply then the total -- so in terms of the expense cuts that you've had, I don't know how much of that's coming out of the stores versus the DC versus corporate. But I think that would imply that actually your levels are lower, your staffing levels are lower than 2019, given the $8 million increase in your rent expense. Is that a pretty fair assumption?\n\nHeather Plutino -- Chief Financial Officer\n\nThere's so many puts and takes in that, Jeremy. I'd say Yes. It's -- there is, I would call it, consistent with 2019 from a headcount perspective. There is -- if you think about stores and DCs, we've been dealing with wage rate increases overtime.\n\nSo we've offset that with improved productivity. And then as we mentioned, we are aggressively attacking our expense structure in the second half of the year, which is really across the board, right? There's -- the headcount changes, like David mentioned, that we're into everything from what do we spend on pen and paper to how do we improve -- further improve productivity in DCs and the stores. So it's really -- it's across the board.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nGot it. Well, best wishes on the second half of the year and definitely been dealt a tough hand. Thanks for taking the questions.\n\nHeather Plutino -- Chief Financial Officer\n\nThanks, Jeremy.\n\nDavid Makuen -- Chief Executive Officer\n\nThanks, Jeremy.\n\nOperator\n\nThank you. Our next question comes from the line of Dana Telsey of Telsey Advisory Group. Please proceed with your question.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood morning, everyone, and welcome, Heather.\n\nHeather Plutino -- Chief Financial Officer\n\nThanks.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nDavid, as you mentioned about the consumer cohorts and 50% of the consumers having household incomes of 25,000 and below, what are you seeing in purchase patterns? Is there differences in terms of the income levels given that your basket size is holding up and you're getting high conversion. And on the merchandise assortment, anything being tweaked in terms of price and value that you're on categories sell-through that you're seeing? And then I have a follow-up.\n\nDavid Makuen -- Chief Executive Officer\n\nHi, Dana. Thanks for joining. Great, great questions. In terms of the cohort specificity, it's interesting.\n\nWe're not seeing tremendous differences in their baskets. However, there has been a slight skew toward more of the essential centric basket among the lower income cohort, e.g., they are picking up more of what's in our expanded Q line, think soaps and lotions and HBA and even some things like batteries and such. So we're seeing a slight skew in their basket, which makes sense to us, especially as we've grown that business and sought to create a bit more of a one-stop local neighborhood store where you can get far more than apparel. And then, I would say that, the higher income cohort is -- and we'll frame that as sort of the 40 to 50 caterers.\n\nWe're seeing quite a bit of new customer influx in that income cohort and they are showing a little to no resilience to our higher AURs in primarily the apparel cities. And that's as you know, from the last couple of years, be driven by, in most cases, changes in our quality trend, features and benefits, embellishments and so forth and thereby enabling us to capture a bit higher AUR. So it's almost like there's two ends of the spectrum, the lower income cohort, enjoying some of the very new assortment enhancements that we've been making over the last year and then the higher income cohort loving what trends we're putting down. And I would probably give a big shut out to the guy.\n\nOur guy, as I mentioned, the strength of our men's casual business is -- he's just locking with us, and we're enjoying his loyalty and a pretty big increase in his dedication and devotion from his wallet to us. So that's -- it's a little bit about the cohorts. And then on pricing and category mix and so forth. The good news is, well over 60% of our unit mix is well under $10 in our store.\n\nSo we have never, through these last two and a half interesting and different years than we could have predicted really wavered from being extreme value. And so that unit factor that I shared with you is pretty powerful and even a big portion of those 60% is under $7. So that's great to see that our merchants are maintaining a strict adherence to the value equation, especially during these tough times. So that's kind of from a pricing standpoint.\n\nAnd then on the category mix front, it's been really nice to watch the box present a slightly different look from a category mix standpoint. And I'll point out a couple of things, some of which I already mentioned. But the expansion of our Q line is not to be missed. It's significant.\n\nIt's creating incremental sales in the box, offsetting some softness throughout the rest of the box. We're seeing a distinct set of indicators as we continue to test and roll our more, I'll call it, multicultural positioning out to the marketplace. As you remember, we've talked about adding more of a Latinx friendly assortment to the box. We have not stopped out at all.\n\nIn fact, we're playing offense in that area, and we're appealing to more and more multicultural customers within our current fleet that's been around for a while and also within new stores built in the last two to three years. So that's another example of what's working. So there are many great pockets. I'll give you a fun one.\n\nWe never carry wide with shoes and that business will be pretty significant for us this fiscal year because we got our arms around doing that and our customers responded and drove based on having a shoe that will fit her a bit better for the outfit she's purchasing from Citi Trends. So those are some examples. And like during the call, we're playing offense despite a lower sales expectation, we're fortunate enough to be able to have a liquidity and a great team to chase the right trends. And then I'll give a nod to what I said during the call of doing better in footwear and ladies, we think we have distinct opportunities to expand our footwear usage occasions that we kind of paused a bit during the pandemic years, and we're ready to roar back into some usage occasions that we have not been a part of, so to speak.\n\nAnd then on the ladies front, it's really been a master class in catching up with and responding to the most current trends. example, where to work and a slight change we're seeing in kind of the casualization of apparel that's different from what we saw during the pandemic year. So all that's in motion, and we're seeing really good traction.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGreat. And then CTX, I know that's been a big topic in the performance of those stores have outperformed others. As you think about CTX currently, given the inflation pressure environment, is there still a difference? And then just my other two are on the SG&A reduction path, where are we? And any outlook in terms of what you're thinking about either 2023 or what other buckets of SG&A to evaluate? And same thing on inventory, given that obviously, you have some pack-away, how you're thinking of inventory levels as we go through the year? Thank you.\n\nDavid Makuen -- Chief Executive Officer\n\nAbsolutely. Good questions. I'll take the CTX question, and then I'll turn it over to Heather for SG&A and inventory. But quickly on CTX, we are so pleased with the results that we've seen year to date.\n\nSo no real differences even despite continued macro pressures, these stores that we've completed a Rockin Roland, we couldn't be more pleased with how they present the brand, how our associates get so excited about showing up to work every day to serve a host of new and existing customers who continue to say, what do you do with my old City Trends, but I love the new ones. So we're seeing and hearing just great feedback, and we're going to do a handful more this year because of the strong performance we've seen year to date. Heather, do you want to speak to SG&A and inventory?\n\nHeather Plutino -- Chief Financial Officer\n\nSure. So Dana, your question was where are we, right?\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nYes.\n\nHeather Plutino -- Chief Financial Officer\n\nSo as we mentioned, yeah, we have $10 million of cost reductions in the second half of the year. We've captured call it about 40% of that and are in line of sight for the remainder piece, right? So we are working hard, diligently aggressively, can't pepper enough words in here to capture the other $6 million. And it's been identified where we're going to find those savings, just going after it and banking it in the P&L. We will absolutely get it done.\n\nWhat I will tell you, when we think about FY 2023, about half of the $10 million I would put in the category of restructure, right? So changing program, changing organizational structure, changing services, etc., etc. 10% I'd put in the volume-related category, and then there's some one-time in there, right? So if we think about it going into 2023, I just would keep all of that in mind, right? There are some one-time items that will reset in 2023, but we are firmly dedicated in making sure that we continue to lever SG&A into the New Year. Your question on inventory and how to think about -- I think your question was how to think about packaway going forward.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nYes.\n\nHeather Plutino -- Chief Financial Officer\n\nSo we do -- yeah, we do have an amount of packaway sitting in the DCs that we are very excited to start releasing in September in support of fall and holiday sales. So we'll start to see that amount come down pretty dramatically over the balance of the year.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGot it. Thank you.\n\nHeather Plutino -- Chief Financial Officer\n\nYou bet.\n\nOperator\n\nThank you. Our next question comes from the line of Chuck Grom with Gordon Haskett. Please proceed with your question.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey. Thanks a lot. And congrats Heather on the new responsibilities. My question is on the guidance, I'm curious if the expected gain on the Roland DC is included in your second half EBIT assumption, which I believe is for -- is to be equal to the second half of 2019?\n\nHeather Plutino -- Chief Financial Officer\n\nYeah. Great question. So I'm going to hop right in on that, David. That statement that we will be in line with 2019 is exclusive of the gain on the sale lease back transaction.\n\nThat said, it does include the impact of the lease expense.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. So it excludes the gain. And any sense on what you think the gain will be? I know the proceeds are going to be about $36 million?\n\nHeather Plutino -- Chief Financial Officer\n\nWe're still working that number, Chuck. I think it's still little early to share that.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK, great. And then just on the second quarter, David, you said that things were consistent, but there's a lot of volatility in gas prices throughout the quarter, particularly in the back half of July and when prices came down, just curious if the business changed at all? And as you think about those pressures that you highlighted, do you feel like that the plan is getting passed from higher gas prices to now higher utility prices and food. Any sense for when you walk your stores and talk to your customer?\n\nDavid Makuen -- Chief Executive Officer\n\nHi, Chuck, yes, good question. You had probably recall in the last earnings call, we talked about speaking to our customers and associates in a couple of informal focus groups and what we heard then was gas by far was the biggest concern followed by rent, utilities and actually food was in kind of fourth place. We kind of refresh some of that data as we saw the gas prices come down most recently. And the good news is we saw a pretty good, at least qualitative correlation in terms of, \"Oh, gosh, what a release, gas prices coming down in some of our midsized markets, where we do a lot of volume and where we saw it kind of or hurt, I should say, in most of the -- these gas prices are just really hurting us.\n\nSo quickly on that point, when the gas prices came down, we did feel both relief based on talking to customers and associates and there's a lot going on, when they were coming down because it's sort of during back-to-school and some paydays steps. But overall, we did see some interesting sales response and traffic response to or during the time period of gas prices coming down, I think we're cautiously optimistic that, that could be a nice little tailwind provided they stay down. Then we asked, of course, what's coming down? What else's bother you, any updates from the last time we spoke to you? And food definitely rose. I think the reality of food wasn't easing up much at all.\n\nIf maybe, it was even gone up a little bit in our neighborhoods in the grocery stores they shop in, which is typically are passing on price aggressively to the consumer. We heard food rise in there kind of importance slips. So there's some gives and takes there. But having the number one reason that was given, the modular come down, definitely is a good sign and a good development.\n\nSo I think we're going to cautiously serve that over the rest of the quarter and the half year and see how it shakes out.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Great. And then I think...\n\nDavid Makuen -- Chief Executive Officer\n\nYes -- question, but let me know if I didn't.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nYes. I just didn't know if there was also some benefit from state tax holidays this year. I think across the country, roughly 50% more days than last year. I don't know if you saw maybe more amplification of the state tax holiday benefit this year.\n\nI don't know if you've had a chance to look at that data yet.\n\nDavid Makuen -- Chief Executive Officer\n\nGreat question. Yes, we have. We have seen some positive impact from more days and in some cases, earlier days than prior years. So as we've looked at our cut three cohorts of back-to-school time period, grouping early back-to-school mid, late is how we call them.\n\nWe've seen some early and mid tax free holidays produced some nice gains as compared to 2019 and help the 2021 high, so to speak. So we're liking what we're seeing during those days.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Great. And then my last question just firstly, how you arrived at the back half -- it looks like you're sort of extrapolating the three-year geo stacks from the second quarter of roughly down 5.6 into the back half of the year. Is that sort of how you got there, even though it sounds like August might be a little bit better on the top line than what the second quarter run rate was?\n\nDavid Makuen -- Chief Executive Officer\n\nIt is how we got there, Chuck, maybe mixed with the dose of what has been our traditional quarter-to-quarter builds or debuilds prior to the pandemic that -- kind of few bunch of datapoints into the blender and got to the relationship that I'm sure you're kind of back into in terms of absolute volume compared to two, compared to one and Q4 as well. But those relationships, we believe, for the rest of this year, given the uncertain environment we're operating will kind of largely hold up, kind of Q2 -- kind of in a more stabilized way than the Q1 volume mapped extraordinarily well to history. So we use some of that in addition to the geometric stuff to get to this.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK, great. Thanks very much for the color.\n\nDavid Makuen -- Chief Executive Officer\n\nThanks, Chuck. Have a great one.\n\nOperator\n\nThank you. Our last question comes from the line of John Lawrence with Benchmark. Please proceed with your question.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nGood morning and welcome, Heather.\n\nHeather Plutino -- Chief Financial Officer\n\nThanks, John.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nDavid, could you start off just a little bit by reminding us of the process of attracting the new merchandise? I know you talked about being able to free up cash to get the available deals. Remind us how that process works. And have you been able to get that or is it just more of an effort of just getting more steps in the door rather than the newness and the freshness of a new deal?\n\nDavid Makuen -- Chief Executive Officer\n\nHi, John. Nice to hear from you. Great question. Both are important, right? We're aiming to develop the most engaging assortment of the greatest values for our customers.\n\nBut we're also trying to entice and combat this headwind of lower traffic. I would tell you the priority, given our maniacal focus on expense conservation. The priority has been on really buying the right stuff at the right time for the right customer. More so, than putting incremental dollars into market such.\n\nWe just don't have that luxury yet. So back to what we've been focusing on. I take you back to the beginning of the year highlight that our merchants during the supply chain disruption period of late '21 and early '22, we're all aware of. They drove into those marketplaces progressively to pick up very attractive goods meant to sell later in the year.\n\nSo as Heather commented on, we're possessing some really nice hacker inventory that built during November, December, January and now we're literally starting August, and that'll take place through November, December to deliver back to school, fall on holiday. And that's so germane to our model because what's in that pack-away are really great values and a mix of product that we don't always get our hands on right, given our model, these are kind of opportunistic buys. So that's one part of our process and it's literally coming out of our buildings as we speak, going into our 600 plus stores and we're liking what we're seeing. And then the rest of their days, so to speak are really spent on identifying the right trends that we can get across men's, women's, kids, accessories, home footwear and the like and making sure we latter back to our customer.\n\nAnd the customer is nicely evolving for us. Meaning, we're including more than our lifeblood African-American communities, and we're adding more and more apparel at home, etc., that appeal to a broader audience, namely Latinx customers that we have, so many in our current communities and neighborhoods and that we're so pleased to serve, but we can serve them better. So this rarely falls under -- kind of back to your question, the process. We're evolving our process pretty rapidly.\n\nI would tell you, we're ahead of schedule and we are going after it with full vigor to broaden the appeal of the brand as we buy the good, suitable for now, really two large audiences, African-American and Latinx populations. So we're excited about that. And as we move forward, we're pretty excited about what we have for the rest of that pool for fall and then holiday and gift giving, roundout the year. So that's how it works mechanically.\n\nAnd I think, we'll see some good things going forward. I hope that answers your question.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nGreat. Thanks. And one last longer-term question. Just strategic.\n\nI know you started right before the pandemic. You've built the team up, all of that. And now macro conditions sort of dictate making some changes. How do you balance that looking long term versus short term, as far as cutting into the muscle of the business or -- and sort of -- I'm sure, you've thought about that, but just sort of a deeper dive there, just a little bit.\n\nDavid Makuen -- Chief Executive Officer\n\nSure. Happy to add some color on that. I'll start by saying, it was a very, very difficult decision. We, in general, are not a bloated organization.\n\nWe, in general, have very defined role. We have not a ton of layers. We all work very collaboratively to give a culture that supports contributions from all levels. So it was very difficult to study and make very hard decisions about which roles would be eliminated.\n\nThe overall picture, though, John, is definitely a picture of balancing both the individuals that we really need for this business to pick, but also recognizing that we're evolving how we work. We're also evolving what we provide to our teams in the form of data, technology and automation to name a few. So some of what we're going through is a product of, as you've heard us speak about, investing in data and technology, for example, that will make certain functions more efficient and productive. And unfortunately, it may require a few less people, which is tough on the people front.\n\nBut nonetheless, will enable us to operate that particular function with less headcount over time. So where we are today is doing the appropriate rightsizing for a smaller business space. And then, of course, as we look to the future and return to a position of growth over time, we'll evaluate and monitor. And we'll also have a much better handle on how effective our systems and improvements in infrastructure are and we're nothing but optimistic about those improvements as we've done a couple already this year with huge success, and we're already seeing benefits associated with them that allow us to be more productive.\n\nSo short winded, it would be -- we're balancing it. You're absolutely right, we're being cautious. But at the same point, we had no choice but to take certain actions to right-size our expense structure.\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nRight. Thanks for that. Good luck in the second half.\n\nDavid Makuen -- Chief Executive Officer\n\nThanks, John. Talk to you later.\n\nOperator\n\nThank you. Mr. Makuen, I will now turn the call back to you. Please continue with your presentation or closing remarks.\n\nDavid Makuen -- Chief Executive Officer\n\nThanks so much, Rita. Thanks, everybody for joining. Have a great rest of your summer. Talk to you next time.\n\nBye bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNitza McKee -- Senior Associate\n\nDavid Makuen -- Chief Executive Officer\n\nHeather Plutino -- Chief Financial Officer\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nJohn Lawrence -- The Benchmark Company -- Analyst\n\nMore CTRN analysis\n\nAll earnings call transcripts"
}