{
  "companyName": "Dave & Buster's Entertainment",
  "companyTicker": "PLAY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/07/dave-busters-entertainment-play-q3-2022-earnings-c/",
  "content": "Dave & Buster's Entertainment (PLAY 1.05%)\nQ3 2022 Earnings Call\nDec 06, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Dave & Buster's Entertainment, Inc. third-quarter 2022 conference call. All participants will be in a listen-only mode. [Operator instructions] After today's presentation, there will be an opportunity to ask question.\n\n[Operator instructions] Please note that this event is being recorded. I would now like to turn the conference over to Mr. Cory Hatton, vice president of investor relations and treasurer. Please go ahead, sir.\n\nCory Hatton -- Vice President, Investor Relations and Treasurer\n\nThank you, operator, and welcome to everyone on the line. Leading today's call is our chief executive officer, Chris Morris; and Michael Quartieri, our chief financial officer. After our prepared remarks, we will be happy to take your questions. This call is being recorded on behalf of Dave & Buster's Entertainment, Inc.\n\nand is copyrighted. Before we begin the discussion on our company's results, I'd like to call your attention to the fact that in our remarks and our responses to questions, certain items may be discussed, which are not entirely based on historical fact. Any of these items should be considered forward-looking statements relating to future events within the meaning of the Private Securities Litigation Reform Act of 1995. All such forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ from those anticipated.\n\nInformation on the various risk factors and uncertainties have been published in our filings with the SEC which are available on our website. In addition, our remarks today will include references to financial measures that are not defined under generally accepted accounting principles. Investors should review the reconciliation of these non-GAAP measures to the comparable GAAP measure contained in our earnings announcement released this afternoon, which is also available on our website. Also, pro forma financials including Main Event for the trailing four quarters ended October 30, 2022, are available at the bottom of the Events and Presentations section of our IR website.\n\nNow, I will turn the call over to Chris.\n\nChris Morris -- Chief Executive Officer\n\nOK. Thank you, Cory, and good afternoon, everyone, and thank you for joining our call today. We are pleased to report strong financial results for the third quarter, which are clearly indicative of the progress we are making on our growth strategy. We delivered record revenue for the quarter, driven by double-digit comparable sales growth, which, in turn, led to record adjusted EBITDA for the quarter despite the challenging macro and inflationary environment.\n\nI want to recognize the outstanding effort of our teams, both in the field and here in our support center, that produced these record results as we continue the work of integration to become a more efficient organization. Since our last analyst call, our team has been focused on three key work streams: one, effectively managing the merger integration; two, long-term strategic planning; and three, managing sales and profitability in the near term to offset the ongoing inflationary pressure in our business. I'm pleased to say we are ahead of schedule and exceeding expectations in all three areas. As it relates to our merger integration, our team's excellence in execution has accelerated the pace of realizing the anticipated benefits.\n\nTo date, over $17 million of annualized synergies were implemented and we continue to be confident in our $25 million target. The pace of implementing these synergies has accelerated as we swiftly addressed all redundant staffing, continued to combine our purchasing power to offset inflation, and moved toward combining the best-in-class systems across both brands. We are moving aggressively to fully capture synergy opportunities implementing superior operating initiatives and leveraging the scale of our combined operations. Secondly, our teams have been aggressively focused on developing our long-term strategic plan to further cement the Dave & Buster's and Main Event brands as undeniable leaders in location-based entertainment and add meaningful long-term shareholder value.\n\nBased on a thorough strategic review of the business, anchored and deep consumer research, and spending considerable time learning directly from our operators, our core brand position for our Dave & Buster's brand going forward will bring greater focus to executing adult occasions aged 21 to 39 who are visiting our locations to have a great time with their squad. These crew connectors, as we like to call them, are energized by social situations and in-the-know on culture and social trends happening at the time. Over the months and years to come, this refined brand positioning will guide our marketing strategy, entertainment innovation pipeline, food and beverage offering, store design and layout, and tech-enabled hospitality model. This long-term holistic approach to managing the business anchored in strategic planning and operational execution led to the successful reinvigoration of the Main Event brand, and we're excited to apply the same approach to the larger Dave & Buster's enterprise.\n\nWe look forward to sharing more details with you at our Investor Day in the early part of next year. Lastly, our teams have been focused on mitigating inflationary pressures with thoughtful pricing and increased operating efficiencies. Despite ongoing inflationary cost pressure in the business, we have made great progress and continue to find opportunities to manage our cost and increase our profitability. In addition to the work on cost controls, we are very pleased with the top-line momentum throughout our portfolio.\n\nAs indicated by our third quarter results, guests continue to visit and spend at healthy rates. On the marketing front, in Q3, we launched our National Where Winners Watch Football campaign, featuring Kansas City Chiefs great Travis Kelce, designed to drive awareness of Dave & Buster's as a great football viewing destination, which contributed to our strong Q3 performance. In November, we recently completed our Eat & Play Combo promotion at Dave & Buster's. We've had tremendous success with our local focus on World Cup Watch activations and are excited about the launch of our Impossible Holiday Hangout contest, which will bring together four friends from around the country to spend the holiday together at Dave & Buster's in Kansas City.\n\nAs we head into Q4, our Special Event sales teams and operating teams are aggressively focused on delivering a strong holiday banquet season. We are optimistic that the upcoming holiday season will provide additional momentum as we enter the New Year as our Special Events business has nearly recovered to pre-COVID levels. We are excited about the future of this organization. We have two industry-leading brands in Dave & Buster's and Main Event.\n\nThese brands have exceptional business models, strong assets, and talented teams. Bringing these brands together under one umbrella presents our company with exceptional growth opportunities, which will benefit all stakeholders. We have a clear line of sight on the strategic opportunities ahead for the Dave & Buster's brand and a world-class management team with a proven track record of superior execution. We believe there is meaningful upside potential for this company and our stakeholders, and we are working diligently to realize that potential.\n\nLet me take a minute to recap a few growth initiatives that have me excited about the opportunity in front of us. The continued development and rollout of our improved hospitality-based service model, the brand awareness work that's driving innovation of our product offering, and in turn, how we approach the refresh program for our stores. The continued recovery of our Special Event business, our development pipeline of new stores for both brands our progress on developing our international franchisee network, the tenacity of our teams to identify and implement our synergy opportunities. And last but certainly not least, the proven capabilities of the executive management team which gives me confidence in our ability to succeed.\n\nTo put it succinctly, everywhere we look, we are seeing significant growth opportunities, and we are poised to unlock long-term shareholder value. So, now with that, let me turn the call over to Mike to review our Q3 results.\n\nMike Quartieri -- Chief Financial Officer\n\nThanks, Chris. We're pleased with our financial results for the third quarter and encouraged by the trends continuing into the fourth quarter. Amidst considerable economic uncertainty, we remain focused on successfully managing our newly combined business, which generated record revenue of $481 million and produced a record $90 million of adjusted EBITDA in the third quarter, which I'll remind you is holistically our seasonally softest quarter of the fiscal year. We produced an 18.7% adjusted EBITDA margin in the third quarter, which represents a 320-basis-point improvement above the 15.5% margin of the third quarter of 2019.\n\nWe continue to be laser-focused on optimizing our cost structure and unlocking our synergy target of $25 million from the combination with Main Event. With regards to pro forma comparable store sales figures, I'd like to direct you to the supplemental schedule titled December 2022 supplemental pro forma financial data posted in the Events and Presentations section on our IR website. I'd like to highlight that the strong comp sales figures in the third quarter of 13.3% versus 2021 and 17.5% comp versus 2019 on a consolidated basis. Notably, our SMB business has continued to improve with our tailored new menu offerings and SMB represents an increasing mix of our total revenue versus the prior-year period.\n\nAdditionally, our Special Events business continues to provide tremendous upside as it continues to normalize the pre-pandemic levels with the pro forma combined comps down only 6.7% this quarter versus 2019 in comparison to last quarter when it was comping down 13.4% versus 2019. We generated $68 million in operating cash flow during the quarter, contributing to an ending cash balance of $108 million for total liquidity of almost $600 million when combined with the undrawn revolving credit facility. We ended the quarter with a net total leverage ratio of 2.2 times. Turning to capital spending.\n\nWe invested a total of $64 million in capital additions and opened three new Dave & Buster stores: one in Lynnwood, Washington; one in Long Beach, California; and the other in Bakersfield, California. We plan to open one new Dave & Buster's branded store and two Main Event branded stores in the fourth quarter of fiscal '22. Finally, let me update you on comparable store sales through the first five weeks of the quarter. Pro forma combined comparable store sales has increased 3.1% compared to the same period in 2021 and 9.2% compared to the same period in 2019.\n\nWe estimate that the calendar shift of the holiday season as it specifically relates to our special events business in '22 versus 2019 for this five-week period represents a temporary negative 3% overall comp headwind and which will reverse in the remaining weeks of December. To summarize, we are excited about the strong execution in our business, our progress capturing synergies the numerous growth opportunities for us to pursue and the talent and experience of our team to drive growth despite the challenging macroeconomic environment. We remain focused on closely managing costs and capital spending to ensure we strategically unlock the maximum value of these two great brands and deliver the highest returns possible for our shareholders. Now, operator, please open up the line for questions.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] And the first question will come from Andy Barish with Jefferies. Please go ahead.\n\nAndy Barish -- Jefferies -- Analyst\n\nYes. Hey, guys. Happy holidays. Just a couple of thoughts on the top line if you could.\n\nWere you pleased with Eat & Play in November, I guess, firstly? And then secondly, can you talk to us about sort of the importance of December for the quarter and any quantification maybe on how we should think about sort of seasonality versus the 3Q as you kind of look at average unit volumes?\n\nChris Morris -- Chief Executive Officer\n\nHey, Andy, this is Chris. I'll start and let Q kind of fill in some additional color. In terms of Eat & Play, what I'd tell you is that we're pleased with the trends in our business on top line, and that includes the month of November. When we look at our entire arsenal of marketing activities, the ones that I walk you through, first, the NFL campaign, we felt that did a very nice job bringing awareness to the sports viewing.\n\nWe continue to see nice sales results on the weekends, which we think is a combination of, first, the campaign, we believe was successful. And secondly, our operators are very keenly focused on maximizing throughput on the weekend, and so we think that that helps. The Eat & Play Combo in November, we're pleased with. As we look at really trying to understand the contribution that promotion had, the data is a little murky.\n\nBut overall, we're pleased that we did it. We have no regrets. The thing I'll tell you about that particular platform is it's part of -- it's one of those promotions that is identifiable to the D&B experience. And over time, there's a lot of brand equity, a lot of promotional equity in that particular campaign.\n\nAnd so, I would look to see us to continue to do it. But we'll -- going forward, we'll be very selective when we do it as opposed to kind of an always-on type of promotion, but no regrets at all in November. And then as Q walked you through, as we think through our Q4 sales performance, overall, we're pleased. When you make the adjustments for the timing there's still considerable momentum in this business on both brands.\n\nAnd the December period is a very important period, as you mentioned, because of the majority of our sales during that period for the Main Event brand and a significant portion of the sales for the Dave & Buster's brand comes from Special Events. And our teams are laser-focused on maximizing the opportunity on Special Events. It's been a couple of years since that demand has been there. The demand is back, and we intend to optimize that.\n\nAnd so, we've got the teams focused. We're selling and our operators are ready to execute -- and we -- at this point in time, we are approaching pre-Covid levels, which we're very pleased about.\n\nMike Quartieri -- Chief Financial Officer\n\nYes. Andy, just one other thought. Just on the timing and what you see in the first five weeks. So, if you think about our Special Events business, the peak of that takes place in the three-week period leading up to the Christmas holiday, and so in 2022, this peak consists of the week of December 5, the current week that we're in, the 12th and the 19th.\n\nBut if you go back and look at 2019, the Christmas holiday was on a Tuesday, Wednesday, which caused that three-week period to push forward. So, the weeks were really December 2, 9th, and 16th. So, the difference between just December 2 versus December 5 in this period is significant to us, and that's what's causing about a 3% headwind in our comp store sales for just this five-week period. We'll get the benefit of that on the back end as we get closer to that Christmas holiday week, we'll pick up that extra piece of business at that point.\n\nAnd so, overall, for the month of December, when you take this noise out between the five weeks in the full quarter, we're extremely pleased with the level of work that we're seeing by our sales team and what we think we will experience from the Special Events business as a whole for the month of December.\n\nAndy Barish -- Jefferies -- Analyst\n\nThank you very much.\n\nOperator\n\nThe next question will come from Jake Bartlett with Truist Securities. Please go ahead.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nThank you. This is Jake. I had a question on -- just so we can understand the trends. I think you're reporting same-store sales just for Dave & Buster's because the Main Event stores, I don't think are considered comp base, and then you're giving us pro forma.\n\nThe guidance is in pro forma, but I think you're going to be reporting just the same-store sales for Dave & Busters if I got that right. Can you give us what the quarter-to-date was for Dave & Buster's as it relates to the 13.6% versus '19 that you reported in the third quarter?\n\nMike Quartieri -- Chief Financial Officer\n\nYes. I think just for perspective purposes, when we look and we manage the business, we're managing it as one consolidated entity. We have one management team in place. We do look at both brands as having a slightly different offering but the way we allocate the resources accordingly, we put both in that same vein.\n\nSo, from our perspective, what we're trying to do is get to a point where we are commenting on the consolidated business as a whole because we are redeploying assets between both brands accordingly on a daily basis.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nOK. And just -- I'm trying to think about the trends here. And it looks like just as we -- the first five weeks of the third quarter, for Dave & Buster's alone, I think that's all you provided at the time was 17.6% and then you reported 13.6% guidance is for -- even on a consolidated basis, significant deceleration -- or not guidance but the quarter-to-date, even when we're making that three-point adjustment to 12% versus the 17.5%. There does seem to be a deceleration going on.\n\nYou know, I guess, you know your thoughts on what's driving that. The Eat & Play, when you ran in April, drove a really massive and pretty -- really strong result in same-store sales, doesn't seem to be repeating. What do you think is driving the -- it seems like what it looks like is decelerating momentum.\n\nMike Quartieri -- Chief Financial Officer\n\nWell, I think I've taken the point. If you're looking versus '21, you do have the impact of the delta variant coming to a close kind of the end of October, which November had a nice bump. If you recall during our earnings call a year ago when we commented on November, we had comp store sales at Dave & Busters, which was 14-plus percent for that month alone on the walk-in business. So, from a '21 perspective, we are lapping that at this point in time.\n\nWhen you look at the balance of the year in that '21 period, then omicron hit, and the business fell off dramatically. So, we do expect to have a much easier comp for the December, January period as we go forward.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nWell, I was talking versus '19. You started the third quarter at 17.6% and then it was 13.6% for the quarter and now it's closer to 12% consolidated. So, there's a deceleration versus '19. Is there -- what do you think is driving that?\n\nMike Quartieri -- Chief Financial Officer\n\nI would just look at just overall trends in the business. I think from a back-to-school perspective, there are economic issues that are out there, although we don't see it as much. I mean, to talk about comp store sales at the levels that we are versus '19, I think it's still a remarkable component of this business that shows the strength of the overall business in itself.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nAgreed. And just one question on the -- as we think about the quarter-to-date and then we think about I believe the comment was that -- or maybe you can confirm that you expect the Special Events business to be above '19 levels, so kind of no longer a drag. But should we think of the whole quarter -- if demand kind of levels remain the same, we would think about the quarters being higher than the quarter-to-date just as you consider the lift that you have, I think, probably some visibility on for the Special Events. Should we think about the quarter as higher than what the quarter-to-date is just given that dynamic?\n\nChris Morris -- Chief Executive Officer\n\nThe short answer is yes. I mean, if you look at quarter-to-date sales, just adjusting for the holiday mismatch, which as Mike said, we expect that mismatch to recover as we move into December, that alone would tell you that we expect the quarter-to-date number to end up better than the five weeks. But then you factor that into just the strength in the business, the focus on Special Events, the pacing that we're on right now to deliver on Special Events, we feel great. We feel great about the business.\n\nWe feel great about the trends and excited that we're in a position to end the year on a really high note.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nGreat. Thanks a lot. Appreciate it.\n\nMike Quartieri -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nYour next question will come from Andrew Strelzik with BMO Capital Markets. Please go ahead.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nHey, good afternoon. Thanks for taking the questions. My first one, I was curious if you think there's any reason to believe recognizing kind of that the overall momentum of the business is still strong, that there has been a touch of a slowdown. Do you think there's any reason to believe that you're seeing any pushback from some of the pricing or some of the pricing adjustments at the game level maybe that you made, do you have kind of any metrics or data points that you're watching to gauge that?\n\nChris Morris -- Chief Executive Officer\n\nYes. So, we certainly have the metrics to anytime we raise prices, that's something that we take very seriously. And so, we're always going back and doing the postmortem analysis. We're not seeing -- we're not seeing any pushback or negative reaction or change in consumer behavior related to the price increases.\n\nSo, in fact, we still feel like that there is room in some aspects of our business to continue to raise prices. So, nothing there. I guess I would just point you back to the comments that we've been making is that there's still -- the underlying trends in this business are still very good. \n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nSure.\n\nChris Morris -- Chief Executive Officer\n\nAnd so, we still feel good about that.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nOK. Great. And then on the synergies and the integration, what exactly do you have left to do there? And you talked about the $17 million annualized, I believe. How much of the $25 million do you actually expect to realize this year on a reported basis?\n\nMike Quartieri -- Chief Financial Officer\n\nOK. So, first part of your question, what's left to do? I'll kind of walk you through what's been done and where we're headed. So, immediate actions that were taken at the end of Q2 were really around the head count where we got rid of the duplicative nature of you don't need two chief financial officers. You don't need two CEOs and the like.\n\nSo, those decisions were made quickly and implemented swiftly. The next phase that you're seeing right now, which gave us the confidence to up the ante from $20 million to $25 million is really around our supply chain where we've been able to combine the purchasing power of both brands, renegotiate contracts. That work is now done, and we're now entering the next phase of that component, which is around taking certain contracts out to bid. And so, that RFP process takes a little bit longer, much more demanding on the procurement team rather than just looking at contracts, consolidating and eliminating the one that's least favorable for us.\n\nThe next phase, which I call the more longer toll step forward, is really around more systems-related and more foundational structural items that we need to make changes to -- consolidating, whether it's the POS system, back-office accounting systems, HR systems, combining 401(k) plans. It's that type of work that's in process. And that's the long lead time that takes the 18 to 24 months that we quoted previously when we started this process. As far as what we think we're going to experience or see come through, I think it's at least like directionally about $6 million coming through in that period.\n\nA lot of that is what we're seeing in our food and beverage costing, which is helping to offset a lot of the inflationary factors that we've seen before.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nOK. Perfect. Extremely helpful. And if I could just squeeze one last quick one in here.\n\nYou gave the update on 4Q openings. Is there any change in the way you're thinking about the '23 store openings? Or I just didn't hear an update to that. Thanks.\n\nMike Quartieri -- Chief Financial Officer\n\nNo, not at this time. We are very mindful of the timing as it relates to any supply chain issues, getting governmental approvals at the local level for permitting, and things to that effect. So, the 15 to 17 that we've talked about earlier in the last quarter is still in place, but we'll be providing more details and updates when we get to our Investor Day coming up in the April time frame.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nGreat. Thank you very much.\n\nMike Quartieri -- Chief Financial Officer\n\nYou're welcome.\n\nChris Morris -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question will come from Brian Vaccaro with Raymond James. Please go ahead.\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nHi. Thanks, and good evening. I just wanted to circle back to the comps and some of the combined versus brand trends. I mean, the two brands have obviously been generating very different levels of AUVs versus 2019.\n\nAnd I think it's important to try to maintain at least a little perspective, at least in the near term on how the two businesses are trending because one was up 30% and 40% and one was up, say, 10%, what have you on the DB side. So, I guess just in the spirit of reducing the risk of any confusion, could you provide any breakdown between the quarter-to-date comp, D&B and Main Event, and maybe give us some perspective on average weekly sales, understanding there's Special Events moving around? But just to try to keep us all on the same page, given the moving pieces here.\n\nMike Quartieri -- Chief Financial Officer\n\nYes. Look, I'll give it to you the best that I can. So, if you're looking at the quarter-to-date from an average weekly sales perspective. And again, we're working with both brands.\n\nIt's about $183,000. That is comparable to what we've seen previously. It's the same kind of basic $184,000 that you saw in Q3. So, the weekly average of what we're seeing is fairly consistent with that level of, call it, differentiation or split between the Main Event in the Dave & Buster's brand that you saw back in Q3 that we showed in the detail to help everybody get their arms around what Main Event is and to help you guys with your modeling perspective.\n\nNow, if you -- I'll add on to, if you're looking at the consolidated average weekly sales for '21 for both brands, on a consolidated basis, that would be about $177,000. And if you're looking back to 2019, that number is about $171,000. So, there is meaningful growth in the quarter during that period, just between -- the different brands are, I would say, sticking in line with the trajectories that we saw previously.\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nOK. Perhaps you'd be willing to maybe -- OK, we'll stay to the combined. So, versus '19, Europe, I think you said 17.5% on a combined three-year comp in the third -- in this quarter you just reported, and that's slowed to say, maybe in the 12% now if you make the Special Events adjustment. Has the -- so you've moderated, let's say, underlying by, call it, 500 basis points.\n\nI don't know if you'd agree with that high level, but around 500 bps versus '19. Is one brand decelerating more than the other? Can you provide any qualitative perspective on Main Event versus D&B that three-year trend, one versus the other?\n\nChris Morris -- Chief Executive Officer\n\nYes. So, there's no noticeable difference between the trends. This is -- what you're seeing is just last quarter, we provided the details for Main Event to aid investors and analysts in the modeling since Main Event was not public before. Now, rolling into the Dave & Buster's, we thought it was necessary to provide that detail so you could adjust.\n\nAnd then going forward, I appreciate where you're coming from, wanting more detail. But going forward, this is the disclosures that we've elected to pursue, and it's reflective of how, as Q said -- or as Mike said, it's reflective of how we're managing the business. Main Event is 20% of our business. We don't want to get into providing granular data.\n\nWe don't provide that across any different regions. And we're focused on managing the entire enterprise, and this is how we're looking at the business, and this is how we want to communicate the business. To the extent that there ever is a material shift between the two brands, and it's -- and we deem that it's necessary to talk about that, then we will do so. just as we have done in the past.\n\nSo, the trends heading into five weeks for Q4, proportionately between the two brands is comparable to where we've been. This just -- but this is the disclosure that we're going with going forward.\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nOK. Understood. Fair enough. My follow-up, I guess, is on the margin front.\n\nAnd I guess I'll take the other opex line here. Saw quite a bit of leverage on the other opex line, I guess, versus our expectations or compared to what you saw in last quarter if we're trying to base it out a little bit. Can you just kind of, at a high level, move through some of the puts and takes? I know sometimes, there are swings in marketing, swings in R&M and other spend levels that might show up in that line. Mike, any help on sort of the puts and takes on that line in the quarter would be very helpful.\n\nThank you.\n\nMike Quartieri -- Chief Financial Officer\n\nYes. I think from a puts-and-takes perspective, I think we continue to see higher costs around this area. Two components of that. Part of it is external janitorial services.\n\nAs we -- as we've talked about before, as we reopened post pandemic, finding labor was difficult, so we did a lot of outsourcing at that point. As we are seeing today a recovery in the labor market where we've got 12% more job applicants for positions today than we saw a year ago, we are able to now start going back on a strategic basis and looking and evaluating whether those costs are better off in-house versus external. So, there is that piece of business that's going. We continue to see higher costs around security.\n\nWage inflation there has not come down. When you're asked to include security from the local municipality because of certain areas that they have cut back on, that is a cost that we're absorbing, and we want to do that because we take the safety of our customers, first and foremost, as one of the most important table stakes they have in choosing to come to a Dave & Buster's or a Main Event. We also look at things from a repairs and maintenance perspective. We are looking through -- if you kind of go back post pandemic, there was a lot of deferred maintenance in the building.\n\nSo, some people have come back, and we have made a little bit more of investment there on the R&M side from an expense perspective. Now the recovery aspects of what's offsetting some of that is the utility costs that we spoke about before, it was a very hot summer that we all had extreme higher energy costs that we had to deal with, not only from the usage but also from a rate perspective, that utilization is obviously coming down as we get to the cooler months of the wintertime. And so, those are pretty much the four puts and takes that we have.\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nAppreciate that. I'll pass it along. Thank you.\n\nMike Quartieri -- Chief Financial Officer\n\nYou got it.\n\nOperator\n\nThe next question will come from Jeff Farmer with Gordon Haskett. Please go ahead.\n\nJeff Farmer -- Gordon Haskett -- Analyst\n\nThanks. I have a couple of questions for you guys. So, can you just update us on what you're seeing from the lower-income consumer? How large is this cohort for you guys? And how are they behaving?\n\nChris Morris -- Chief Executive Officer\n\nSure. I'll take that. We're constantly trying to understand our business, understand the trends, and certainly understanding how our guest profiles are impacting our business. And there's really nothing noteworthy there.\n\nThere's still strength in our business across all demos. We're not seeing -- we haven't seen a disproportionate shift in trends on a lower-end consumer.\n\nJeff Farmer -- Gordon Haskett -- Analyst\n\nOK. And then just really two modeling ones. The first is simple, which is which -- what interest rate should we be using in the model, considering the movement in rates out there? And then you guys were talking about 25% commodity inflation last time we heard from you. What's the update there?\n\nMike Quartieri -- Chief Financial Officer\n\nLet me start off with commodity inflation. So, if you're looking at 21%, I should say, versus 21%. In Q2, we were up 17%. In Q3, we're only up 9%.\n\nAnd a lot of piece of that is the work that we've been doing around our synergies and really driving home on the renegotiation of contracts and combined purchasing power to lower our commodity costs at that point. When you look at our interest rate Remember, we've got the 7.625 notes that are outstanding. And when you're looking at LIBOR -- or sorry, LIBOR -- SOFR, where at SOFR plus 500 is the term loan. So, you could just look at the forward yield curve for SOFR for the next year, and that will give you your interest rate.\n\nJeff Farmer -- Gordon Haskett -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question will come from Sharon Zackfia with William Blair. Please go ahead.\n\nSharon Zackfia -- William Blair -- Analyst\n\nHi. Good afternoon. I guess the question on the spend per card. I know that it's been quite elevated kind of in the early innings coming out of the pandemic for Dave & Buster's.\n\nHow has that been trending now as we've gotten to maybe a more normalized pandemic status with the consumer?\n\nMike Quartieri -- Chief Financial Officer\n\nYes. We are at a same consistent level of what we saw coming out of the pandemic. So, if you look at it over the last year, we've seen no decline in the average transaction value of the Power Card at the kiosks.\n\nSharon Zackfia -- William Blair -- Analyst\n\nRight. And then on the EBITDA margin, I know you've been targeting 200 basis points over '19. I want to confirm that that's also a target for the fourth quarter. And then beyond kind of this current quarter, I assume we're not going to be talking about 2019 anymore.\n\nI think things become a little bit more apples-to-apples when we get into 2023. I'm just curious on the Dave & Buster's business. Given that you guys have fresh eyes on the business, there had been a lot of volatility pre-pandemic with comps negative. I mean, what do you consider a win for Dave & Buster's? Is it slightly positive comps, mid-single? Like what's the winning scenario here as you think about Dave & Buster's and more of a kind of steady-state environment, when we're not talking about the consumer still getting back to normal patterns?\n\nMike Quartieri -- Chief Financial Officer\n\nWell, I'll handle the first part of your question in regards to margin. Yes, I'm getting pretty tired of talking about 2019 levels as well. But as you do look back to '21, you still see whether it's the delta variant or the omicron variant, it just makes for a noisy comparison. So, that's why we've been providing '21 and '19.\n\nThe 200-basis-point commitment that was given a year-plus ago, we still remain committed that that's what we'll be able to achieve on this Q4 period.\n\nChris Morris -- Chief Executive Officer\n\nAnd then, Sharon, in terms of defining the win, look, we're here to grow this business. We want to -- we're maniacal about growing our business through just a very sharp focus on the guest experience and driving revenue through the way we manage, the way we manage our business and manage the throughput and focus on guest satisfaction. And so, really, I guess what defines winning is just the magnitude of the growth. We want to grow as much as possible.\n\nin all areas of the business. So, starting -- we're very focused on growing our guest counts and maximizing our revenue opportunity. So, we want to grow our check and we want to do it in a way where it's very profitable, and we flow dollars to the bottom line and maximize EBITDA, and open as many stores as we can in the future. So, I don't know exactly how to answer your question.\n\nI can tell you that we're -- we believe right now we are winning. We're pleased with the results that we're seeing in the fourth quarter. And as we look through the noise of this holiday mismatch and what we're seeing on Special Events coming into December, we're in a winning position right now. And so, it's really just in terms of -- we always want more.\n\nAnd so, as we move forward, this is a team that is completely focused on maximizing every single growth opportunity but doing it the right way to lead to sustainable results. Hopefully, that answers your question.\n\nSharon Zackfia -- William Blair -- Analyst\n\nYes. I suspect you'll tell us more when you have the Analyst Day, so thanks.\n\nChris Morris -- Chief Executive Officer\n\nYes.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Mr. Chris Morris, chief executive officer, for any closing remarks. Please go ahead.\n\nChris Morris -- Chief Executive Officer\n\nAll right. Thank you, operator. In closing, we'd like to again commend our team for the exceptional results they continue to produce at our stores across the country and for all the hard work being done at our Dallas support center to integrate the Main Event business and optimize the infrastructure to support the bright future of these two phenomenal brands. Thank you for joining.\n\nWe look forward to keeping you apprised of our continued progress on growth initiatives, and we look forward to hosting you at our Investor Day in the early part of the year. So, happy holidays, everybody. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCory Hatton -- Vice President, Investor Relations and Treasurer\n\nChris Morris -- Chief Executive Officer\n\nMike Quartieri -- Chief Financial Officer\n\nAndy Barish -- Jefferies -- Analyst\n\nJake Bartlett -- Truist Securities -- Analyst\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nJeff Farmer -- Gordon Haskett -- Analyst\n\nSharon Zackfia -- William Blair -- Analyst\n\nMore PLAY analysis\n\nAll earnings call transcripts"
}