{
  "companyName": "CymaBay Therapeutics Inc.",
  "companyTicker": "CBAY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/cymabay-therapeutics-inc-cbay-q2-2022-earnings-cal/",
  "content": "CymaBay Therapeutics Inc. (CBAY 3.64%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the CymaBay second quarter 2022 financial results and business update conference call. [Operator instructions] Please be advised that the call will be recorded at the company's request. It is also being webcast live on the Investors section at the CymaBay website at www.cymabay.com. Now I would like to turn the call over to Mr.\n\nPaul Quinlan, general counsel at CymaBay. Mr. Quinlan, please proceed.\n\nPaul Quinlan -- General Counsel\n\nThank you, operator, and good afternoon, everyone. I hope that you've had a chance to review the press release we issued announcing our second quarter 2022 financial results and business updates. You can access that release on our website under the Investors tab. Joining me on the call today are Sujal Shah, chief executive officer; Chuck McWherter, chief scientific officer; Dennis Kim, chief medical officer; Lewis Stuart, chief commercial officer; and Dan Menold, VP, finance.\n\nFollowing our prepared remarks, we will open the call for Q&A. Before we begin, I'd like to remind everyone that statements made during this conference call, including the Q&A session relating to CymaBay's expected future performance, business prospects, events or plans, including clinical plans, regulatory approvals, funding and repayment schedules, anticipated time lines and data release date, cash runway and planning for commercialization are forward-looking statements as defined under the Private Securities Litigation Reform Act of 1995. Although the company believes that the expectations reflected in such forward-looking statements are based on reasonable assumptions. Actual outcomes and results are subject to risks and uncertainties and could differ materially from those forecast due to the impact of many factors.\n\nThe company assumes no obligation to update or supplement any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law. Participants are directed to the cautionary statements set forth in today's press release, as well as the risk factors set forth in CymaBay's quarterly and annual reports filed with the SEC for factors that could cause actual results to differ materially from those anticipated in the forward-looking statements. This conference call is the property of CymaBay, and any recording or rebroadcast is expressly prohibited without the written consent of CymaBay. At this time, I'd like to turn the call over to Sujal.\n\nSujal Shah -- Chief Executive Officer\n\nThank you, Paul. Good afternoon, and thank you for joining us today. I'm excited to start our call today, highlighting the achievement of a significant milestone in the development of seladelpar for patients with the rare autoimmune liver disease, primary biliary cholangitis, or PBC. Last week, we announced the completion of enrollment in RESPONSE, our global phase 3 registration study evaluating seladelpar in PBC patients who have had an inadequate response to or are intolerant to first-line treatment ursodeoxycholic acid.\n\nAs a result of the tireless efforts of our team here at CymaBay, the commitment of our patients and their family members, the expertise of our investigators and their staff and the support of our investors, we have been able to bring seladelpar a step closer to our goal of improving the lives of patients with PBC. We believe our development program for seladelpar is one of the most robust ever conducted in patients with PBC with over 600 participants, including over 325 currently receiving treatment in our ongoing studies. We have explored a broad range of doses between two and 200 milligrams and have studied a wide spectrum of patients, including non-cirrhotic and compensated cirrhotic with and without portal hypertension. Our current experience includes patients who have been on treatment for between three months and up to three years.\n\nToday, I'll ask our chief medical officer, Dr. Dennis Kim, to provide an overview of our progress in RESPONSE, as well as across the entire PBC development program. Over the years, a key element of our development program has been to publish and present our findings at major medical meetings. Since beginning development in PBC in 2015, we have consistently shared data with the medical community and today, our Chief Scientific Officer, Dr.\n\nChuck McWherter, will review some of our most recent data presented at the International Liver Congress sponsored by EASL this past June. Finally, as we look forward to completing RESPONSE, and reporting top line results from the trial in the third quarter of 2023, we will continue our pre-commercial work to identify strategies that maximize the impact seladelpar can have in PBC. Our Chief Commercial Officer, Lewis Stuart, will briefly discuss the work that is ongoing and that will be expanded on during a virtual investor event we are planning to hold in September. Before taking questions, we will wrap up our prepared remarks with our VP of Finance, Dan Menold, reviewing our financials for the past quarter.\n\nLet me first turn the call over to Dennis.\n\nDennis Kim -- Chief Financial Officer\n\nThanks, Sujal. It's my privilege to discuss the progress we have made in our phase 3 development program for seladelpar in PBC. The completion of patient enrollment in RESPONSE is an important milestone that enables us to set time lines and plan with more granularity for completion of full study conduct, data analysis availability of high-level efficacy and safety results and transition to putting together a high-quality NDA for potential marketing approval of seladelpar as a novel treatment option for patients living with PBC. On our relative study enrollment completion, we executed an extensive screening effort at more than 150 active sites in more than 20 countries.\n\nUltimately, we concluded enrollment with a total of 193 patients randomized. Patient recruitment and enrollment is always one of the most challenging operational aspects of any clinical trial, but the RESPONSE study had some additional challenges related to the worldwide pandemic, which started several months prior to initiating RESPONSE. COVID-related challenges such as workplace shutdowns, diversion of clinical and hospital resources to address COVID infections, labor shortages, and some patients' resistance to participate in clinical trials, among other COVID-related factors required us to go further, dig deeper and get creative with patient recruitment strategy. Other similar studies being sponsored by our competitors targeting a comparable PBC patient profile were also being conducted in parallel to response and the geopolitical strains in Russia and Ukraine posed additional hurdles to overcome.\n\nTo meet these challenges, we expanded our footprint with respect to the number of study sites, countries and patient recruitment partners. We sought to build new relationship with high potential investigators in regions of the world we have not previously conducted trials, an intensified focus on engaging those preexisting relationships and study sites, we knew had potential to perform well. Our rich experience in working previously across various PBC clinical studies with many of the same PBC experts, principal investigators, allied health professionals and patient advocacy groups served us well in being able to leverage these relationships to meet the challenges. Indeed, as Sujal mentioned, our seladelpar clinical program represents the most robust and rigorous data set for drug candidate in development in PBC to date.\n\nWe have gathered clinical data across more than 600 patients with PBC through our phase 2 and phase 3 studies with greater than 100 patients and greater than 50 patients having had at least one year and two year of seladelpar treatment experience, respectively. In our ongoing open-label extension study ASSURE, there are currently more than 150 patients being dosed every day with seladelpar. With 193 patients randomized in the RESPONSE study will be our flagship data set, supported by the consistent efficacy and safety results we've observed from our prior trials. This gives us additional confidence in being able to deliver life-changing therapeutic options to those living with PBC.\n\nThrough these data collection and experiences working with various stakeholders in the field of PBC, we're able to glean important and encouraging information and sentiments from our partners. The ongoing ASSURE study is a significant differentiating feature of our program. All patients are receiving open-label seladelpar on a daily basis, which will add significant amounts of long-term efficacy data for biochemical response and pruritus in addition to creating large safety data set. The Data Safety Monitoring Board for RESPONSE has allowed us to continue without any changes.\n\nThe feedback from our investigators on their clinical experience in these studies have been overwhelmingly positive. Many of these investigators were also involved in our prior studies, including our first phase 3 study, ENHANCE, which showed encouraging efficacy and safety results at three and six months. As a reminder, 10 milligrams of daily seladelpar treatment in our prior open-label phase 2 and long-term extension study demonstrated consistent, sustained and progressive improvements in alkaline phosphatase in the range of approximately 50% reduction after two years of treatment with 79% of patients achieving the composite end point of alpha less than 1.67 times recorded normal, greater than equal to a 15% reduction in a fast and total bilirubin is less than equal to upper limit of normal range. We also previously reported progressive improvements in liver transaminases and in LDL-cholesterol over a two-year period.\n\nSimilarly, in ENHANCE, 10 milligrams of seladelpar daily over three months resulted in 78% of patients achieving the primary composite end point and more than 25% of patients achieving normalization of alkaline phosphatase from a mean baseline of approximately 290 units per liter. These biochemical results were accompanied by an improvement in measures of pruritus an important and meaningful symptom of PBC, many patients experienced and are hampered by every day. Importantly, seladelpar appeared to be faced and well tolerated across these prior studies. With attention now focused on our current studies, we anticipate sharing top line data for RESPONSE in Q3 of 2023.\n\nI'll now hand the call over to Chuck to share highlights of some of the most recent presentations we made at EASL in June. Chuck?\n\nChuck McWherter -- Chief Scientific Officer\n\nThank you, Dennis. We believe that our science is not complete until it's been communicated to the scientific and medical community and ultimately then published in peer-reviewed journals. It was at the liver meeting in 2016 that we presented the results of our first study of seladelpar in patients with PBC. And this was followed soon after by their publication in the Lancet Gastroenterology & Hepatology, one of the premier journals for liver disease.\n\nSince 2016, we presented research on seladelpar at every AASLD and EASL meeting with 33 presentations made to date, six of which have been selected for late-breaking presentations, and nearly a third having been oral presentation. This year, we published the results of the 52-week phase 2 study of seladelpar in PBC in the Journal of Hepatology, one of the foremost journals in the therapeutic area. A secondary analysis reporting improvements in pruritus, sleep and fatigue was published in Liver International, another journal known for publishing results at the forefront of hepatology. This past June, we continued our commitment to sharing results with three presentations at the EASL-sponsored International Liver Congress in London.\n\nThe first presentation was a poster describing research led by Prof. Bettina Hansen, the leader of the global PBC study group, the group best known for proposing blood test for alkaline phosphatase and bilirubin levels that are used as surrogates by FDA and EMA as end points for approval in PBC. The poster titled seladelpar treatment of patients with primary biliary cholangitis for two years improves the GLOBE PBC score and predicts improved transplant-free survival, utilized the validated risk assessment tool called the GLOBE score. It examined treatment response to seladelpar over a two-year time period in 50 patients with PBC.\n\nThe patients were selected based on having an incomplete response or intolerance to frontline therapy with UDCA. The main result was that the addition of seladelpar led to a predicted reduced risk for liver transplantation or death with a hazard ratio of 0.66 compared to no prior treatment with seladelpar. The improvement in GLOBE score and predicted survival did not depend on a patient's age. However, an analysis of subpopulations of higher-risk patients by GLOBE score revealed that patients while of all ages improved.\n\nThe younger patients at high risk tended to have greater improvements. This suggested the potential for greater impact by treating earlier in disease with seladelpar. In an oral presentation by our collaborator, Prof. Bernd Schnabl, professor of medicine at the University of California San Diego, he described an elegant set of studies establishing that seladelpar acts through PPAR delta to suppress bile acid synthesis by upregulation of FGF21 in hepatocytes.\n\nThis explains the ability of seladelpar to suppress toxic bile acids that accumulate in the liver because of cholestasis. Importantly, his research established that the suppression of bile acid synthesis is via an entirely different pathway than that of FXR agonists, such as Ocaliva, which is the only second-line treatment for PBC approved today. FGF19 released by intestinal cells must then travel to the liver to exert its effects on bile acid suppression. The involvement of FGF21 may be one of several reasons why the seladelpar mechanism seems to have the ability to produce favorable biochemical responses associated with improvement in cholestasis.\n\nThe last presentation was a poster from the CymaBay research team, examining the effect of seladelpar on fibrosis and mouse livers, subsequent to injury caused by repeated low-dose treatment with carbon tetrachloride. Our approach was to allow fibrosis to become established for five weeks before initiating treatment for three weeks with seladelpar or vehicle. However, unlike some other fibrosis models, we continue to administer the carbon tetrachloride insult throughout the subsequent three-week treatment period. Seladelpar, unlike comparator FXR or THR beta agonist was able to reduce fibrosis in the face of continued injury.\n\nMolecular analysis using RNA seq methods was able to establish that seladelpar treatment changes the signature of genes associated with injury and fibrosis. This is the third animal model in which we have seen that seladelpar was able to reduce levels of established fibrosis. And we believe that this is consistent with seladelpar's effects on fibrosis that were observed in patients with NASH. We continue to utilize cutting-edge methods to examine the translation of effects of seladelpar on gene transcription to understand its pharmacology in patients.\n\nAs you can appreciate, we are committed to sharing results of our clinical and mechanistic research, and we expect to participate in the AASLD meeting this fall and other major medical meetings going forward. As we advance seladelpar through late stages of development, we are also committed to understanding strategies to maximize the number of patients that may benefit from treatment. I'll hand the call now to our chief commercial officer, Lewis Stuart, to discuss our early pre-commercial plans. Lewis?\n\nLewis Stuart -- Chief Commercial Officer\n\nThank you, Chuck. With our clinical team focused on RESPONSE, our lean commercial team worked diligently throughout last year to conduct a global PBC market assessment with a specific focus on the U.S., Canada, Europe, Japan and China. Throughout our primary research, we were gratified by the reception from healthcare providers who reviewed the seladelpar target product profile. The strong preference for seladelpar as a next-generation PBC treatment has been consistent across all targeted global geographies.\n\nIt is clear from our market research and expert advisors that there remains significant unmet needs for enhanced biochemical response and symptom improvement of PBC. Beginning in 2022, our focus turned to several U.S.-based pre-commercial initiatives designed to inform our go-to-market strategy. We began by mapping out the estimated 25,000 to 30,000 patients in the U.S. that we believe make up the second line U.S.\n\nmarket. Our analysis demonstrates an immediate opportunity in non-cirrhotic patients that have an incomplete response to UDCA and/or have discontinued treatment with the obeticholic acid, which make up nearly 60% of the second-line target population. In addition, we estimate there are up to another 15,000 cirrhotic patients on first-line treatment whereby over half experienced a partial to incomplete response to UDCA and could be a distinct population for seladelpar second-line therapy, particularly given the black box warnings for obeticholic acid in this population. Another important consideration across the spectrum of both UDCA complete and incomplete responders are the over 15,000 patients who experienced moderate to severe pruritus and may look to seladelpar for symptom improvement.\n\nOverall, our segmentation analysis shows seladelpar's product profile could be a preferred choice for the great majority of these distinct patient segments. In the second quarter, we conducted patient-centered research, examining their journey with PBC. And we're encouraged by both patients and the families active engagement in their overall care. Furthermore, we are excited about the overall knowledge of PBC patients and their willingness to learn about new potential treatments.\n\nAs expected, they were very descriptive of the symptoms they endure, providing distinct details regarding the severe pruritus, fatigue and/or brain fall that is such a significant part of their everyday life. Along with their healthcare provider, they consistently monitor key biochemical markers and are constantly anxious about their overall liver health. At CymaBay, we believe that we can provide patient and caregiver education, add to the conversation around quality of life issues and become a trusted source of information alongside the great work of advocacy groups like the PBCiers, PBC Foundation, Canadian PBC Group and others, we have engaged with globally. This past quarter, we also conducted a market access landscape evaluation along with primary market research with payers to identify both opportunities and barriers across the spectrum of health plans, examining both commercial and government coverage.\n\nWe will utilize these initial findings to inform seladelpar's value proposition and overall payer and patient support services strategy. Lastly, as Sujal briefly highlighted, we're planning to hold a virtual Investor Day on September 22, where we'll be providing a more detailed review of the global market opportunity for seladelpar. Included in this agenda will be a clinical review by Dr. Kris Kowdley, one of the foremost global experts on the treatment of PBC.\n\nWe're excited to share more with you on the commercial planning work we continue to conduct and we'll keep you informed of details about the event in the coming weeks. I'd like to now turn the call over to Dan Menold, Vice President of Finance, for a review of our financials in the second quarter. Dan?\n\nDan Menold -- Vice President, Finance\n\nThank you, Lewis. As others on the team have highlighted, during the second quarter, we continued to make additional enrollment progress in our ASSURE study. And last week, we announced completion of enrollment of 193 patients in the RESPONSE study thus achieving a key milestone in our PBC development plan. We also continue to advance other required clinical activities associated with our RESPONSE, ASSURE and other NDA-enabling clinical studies, which are necessary to complete our late-stage development of seladelpar in PBC.\n\nAnd finally, we made progress in manufacturing development, as well as in medical affairs and commercial, where we continue efforts to plan for a potential future launch of seladelpar in PBC. Turning to a brief review of our second quarter financial position and operating results. Our cash, cash equivalents and investments totaled $170.8 million as of June 30, 2022. We believe this cash on hand is sufficient to fund our current operating plan through 2023.\n\nOur net loss for the quarters ended June 30, 2022 and 2021, was $27.1 million and $23.2 million or $0.31 and $0.34 per share, respectively. Net loss for the six months ended June 30, 2022 and 2021, was $54.9 million and $40.8 million or $0.62 and $0.59 per share, respectively. Net loss was higher in the quarter and six months ended June 30, 2022, compared to the corresponding periods in 2021, largely due to an increase in clinical trial operating expenses associated with the ongoing late-stage development of seladelpar in PBC, as well as an increase in nonoperating interest expense accretion related to the Abingworth development financing arrangement. In particular, our operating cost increases were primarily driven by an expansion of our clinical site activation, patient enrollment and other clinical trial activities associated with RESPONSE and ASSURE, our two active global late-stage clinical trials in PBC and higher employee compensation associated with the hiring of additional personnel to support the overall PBC development program.\n\nWe expect our operating expenses to increase in the future as we continue to execute on our clinical development, manufacturing and commercial readiness plans for PBC. Let me now hand the call back to Sujal.\n\nSujal Shah -- Chief Executive Officer\n\nThank you, Dan. In addition to our primary focus with seladelpar in PBC, the phase 2a proof of pharmacology study of MBX-2982 continued to enroll patients in the second quarter. Challenges related to the COVID-19 pandemic continued to impact the pace of enrollment in this study, but we believe our partners who are fully funding and conducting this trial can drive toward completing enrollment by the end of this year. As a reminder, MBX-2982 is a GPR 119 agonist discovered and developed by CymaBay.\n\nAnd although this trial is being fully funded by the Leona M. and Harry B. Helmsley Charitable Trust, we retain all rights to MBX-2982. The product concept being investigated for MBX-2982 in the current study is as an agent to potentially prevent or minimize hypoglycemia in patients with type 1 diabetes.\n\nIn addition to safety and tolerability, the primary goal of the study is to evaluate the levels of counterregulatory glucagon release under conditions of low blood sugar. We look forward to providing more updates on the progress of this study in the coming months. It's been another eventful quarter at CymaBay, in which we are proud of accomplishing key milestones and more importantly, excited about the news flow that lies ahead. We believe the potential for seladelpar to meaningfully improve the lives of patients with PBC represents one of the most compelling and derisked late-stage opportunities in our industry.\n\nOur goal has always been to put seladelpar in the hands of as many patients that may benefit globally should we be successful at completing the development program and registering seladelpar. As part of this, we continue to evaluate alternatives to partner with parties in geographies outside the U.S. where there would be an opportunity to significantly create additional value. Seladelpar remains one of the only late-stage opportunities in this area that remains fully unencumbered.\n\nWith a strong balance sheet, high-quality investors, experienced internal teams and partnerships with the best experts in PBC around the world, we couldn't be in a better position to continue creating value for all of our stakeholders, including patients who we are focused on every day. We're now happy to take questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Yasmeen Rahimi with Piper Sandler. Please proceed with your question.\n\nYasmeen Rahimi -- Piper Sandler -- Analyst\n\nHi, team. Congratulations again on the enrollment completion. A number of questions for you. Maybe the first question is are you able to shed some light whether you have had a chance to look at the baseline demographics from RESPONSE? And maybe help us understand how much is aligned with the ENHANCE study? That's question one.\n\nQuestion two is maybe a reminder on the powering assumption of the RESPONSE study. And then the third question is, have you started to interact with the FDA in regards to what a post-marketing requirement may look like? I know we have seen from competitor trials that placebo-controlled studies and post-marketing might not be feasible. And thank you so much for taking our questions.\n\nSujal Shah -- Chief Executive Officer\n\nThank you, Yas. Appreciate the questions. I'll start off and perhaps ask the team to elaborate on some of these points. I think first of all, with respect to RESPONSE.\n\nWe've talked at length in the past about how this is largely, I'd like to say a rinse and repeat of what we fully enrolled and enhanced and executed in the ENHANCE prior phase 3 study. We're really looking at the same patient population, the same optimal 10-milligram dose of seladelpar and the same primary and same two key secondary end points Of course, on a blinded fashion, we have the ability to see some of the high-level baseline demographics. I simply tell you guys, I mean, we wouldn't expect to see anything really all that different from what we've seen in over 100 patients enrolled in our prior phase 2 open-label study, as well as the 265 patients that we enrolled in ENHANCE. So you would see likely very comparable alkaline phosphatase levels in particular at baseline.\n\nAnd again, I think the overall demographics would be very consistent with what we've seen before. I know your second question has to do with -- in terms of a reminder around RESPONSE powering. I think when you look at the ENHANCE data in particular that we shared three months data, on the primary composite end point used to register Ocaliva, that would be the registration end point for seladelpar, particularly, this is the end point in which in order to be a responder. A patient has to drop their alkaline phosphatase level below 1.67 times the upper limit of normal, with at least a 15% drop in alkaline phosphatase and normal bilirubin.\n\nAnd as you may recall, the data that we've previously presented at medical meetings, within even just three months of treatment, we saw that 10 milligrams of seladelpar resulted in about a 78% response rate on that primary end point versus about 12.5% for those patients in placebo, and that included just about 55 patients per arm. So on the primary end point, that p-value was less than 0.0001. And so it's a long-winded way for me to tell you that on the primary end point with 193 patients randomized in RESPONSE 2:1, seladelpar 10 milligrams to placebo, we are highly overpowered to demonstrate that type of an effect [Inaudible] on the key secondary end point with respect to alkaline phosphatase normalization so well over 90% in each of those cases. Our target initially for 180 patients in RESPONSE was largely built around some of the assumptions relative to how many patients would moderate to severe itch.\n\nWe believe, we would be able to enroll in the RESPONSE phase 3 study. And so the 180 target largely fills an assumption around 80% -- at least 80% powering to show a 20% benefit or two-point benefit on the impact of seladelpar on the numerical rating scale for worst imaginable itch in the 24-hour prior period. Again, that key secondary end point is largely what drove the total target in terms of patients in RESPONSE. Finally, Yasmeen, I think you've asked us a little bit about our dialogue with the agency with respect to phase 4 outcome study.\n\nOf course, approval on this primary end point in RESPONSE as a surrogate end point is based on Subpart H approval, and so we do have to commit to a phase 4 outcome study. We've had, in fact, years of dialogue with the agency around various types of study designs. You talked a little bit about others in the field, having challenges recruiting patients into what ultimately can be long-term placebo-controlled trials in order to evaluate and have enough events to demonstrate this clinical benefit. Our dialogue with the agency has really centered around more novel approaches than what we've seen with other sponsors.\n\nThat dialogue continues today. And at the point in time in which we complete that dialogue with the agency, we'll share that publicly, as we approach completion of the phase 3 development program and eventually initiation of a phase 4 outcome study. I will say, Yasmeen, that we, as sponsors also recognize the importance of continuing to generate real-world data, registry data around the effects of our potential treatment alternatives for patients with PBC versus those that are not on our treatment, and we've seen others at least generate that data set, very hard to see if that data set alone is enough for full approval. I think it's important and incumbent upon sponsors like CymaBay to really devote time and resources to generating data sets that can potentially point to these outcome results, multiple different strategies on behalf of patients as that's a key commitment to regulators.\n\nYasmeen Rahimi -- Piper Sandler -- Analyst\n\nThank you so much, Sujal. And again, I cannot be so beyond happy for you on enrollment completion as we're getting closer and closer each month to the data. So thank you again for taking my questions.\n\nSujal Shah -- Chief Executive Officer\n\nAbsolutely. Yes. Absolutely. Thank you, Yas.\n\nOperator\n\nOur next question comes from the line of Steve Seedhouse with Raymond James. Please proceed with your question.\n\nSteve Seedhouse -- Raymond James -- Analyst\n\nThank you. Good afternoon. I wanted to ask -- I appreciate the rundown of the market research you guys have been doing. It's very helpful.\n\nI wanted to just ask about in RESPONSE, are you comfortable with the sort of sampling you have of the different market segments you outlined and able to generate an update in each of those ultimately to service a label or detailing to those segments of the market.\n\nSujal Shah -- Chief Executive Officer\n\nYeah, sure. I'll start off, and I'm going to ask Lewis to actually provide some additional color. I think, Steve, clearly, the first objective is in the patient population with the most significant unmet need. The second-line setting, of course, are patients who are largely incomplete or inadequate responders to UDCA effectively highlighting alkaline phosphatase levels, biomarkers of cholestasis that are associated with greater risk of progression population, of course, included in our RESPONSE study are those that have alkaline phosphatase levels above 1.67 times the upper limit of normal, as you well know.\n\nThat clearly is a strategy to get seladelpar again on the market potentially for these patients and most significant unmet need. What we do see more broadly is an impact of reducing as a point estimate, the percent reduction in alkaline phosphatase in patients, almost independent of baseline levels of alkaline phosphatase. So the types of effects we see in these patients that have alk phos above 1.67 times the upper limit of normal, we would expect to see similar percent reductions for those patients that still have elevation above the upper limits of normal that might feed in to how we think about future opportunities to expand the addressable patient population. And perhaps, Lewis, I can ask you to add any additional color.\n\nLewis Stuart -- Chief Commercial Officer\n\nYeah. I think as I mentioned before, one of the critical areas that we focus on, certainly is about chemical response, but we would also sort of focus on two other critical segments I mentioned. I think that notion of being able to address both non-cirrhotic and cirrhotic patients and being able to have to support that, I think, will be a very important differentiator. And then probably the most important areas that we know patients really discussed consistently is this issue around pruritus or quality of life.\n\nAnd I think this opportunity to adjust symptom improvement will be a really important consideration as well.\n\nSteve Seedhouse -- Raymond James -- Analyst\n\nAnd what about the -- what about patients that have discontinued OCA in the marketplace? It sounds like you've done research on that, and it's a very significant chunk of patients. So are you going to have significant data from RESPONSE to speak to those previously exposed to or not OCA? And are these like even prespecified subgroup analyses for instance, of the study?\n\nSujal Shah -- Chief Executive Officer\n\nYeah. Another great question, Steve. So in our experience, even in our prior phase 3 study, ENHANCE, we did have patients that discontinued treatment with OCA, obeticholic acid. We expect and know that we have patients even in RESPONSE that have discontinued treatment with OCA as well.\n\nSo we'll continue to gather that data and actually have opportunities to share more of it. As you know, we typically only share data sets when there's a meaningful proportion of patients that can actually provide some potential conclusion around that impact. But again, we've seen meaningful responses in patients in seladelpar, even those that not only are inadequate responders to UDCA but those that have also discontinued prior treatments such as OCA.\n\nLewis Stuart -- Chief Commercial Officer\n\nAnd just to add in terms of numbers, certainly, the manufacturer for OCA has already stated that their penetration in the general marketplace for second line is about 30% to 35%. We have seen, of course, with that 35% a great number of patients who discontinued therapy with OCA. And we've looked at those numbers, we think that probably there's about another 5,000 to 7,000 patients that might benefit from seladelpar immediately who have actually discontinued therapy. So we believe that is a very important segment for consideration upon immediate approval.\n\nSteve Seedhouse -- Raymond James -- Analyst\n\nYeah. Yeah. OK. Last question, I just wanted to check in on the number of volunteers for biopsies in the study? Are you satisfied that you have enough to check the box with the FDA there? I know that was a feature of this study.\n\nSujal Shah -- Chief Executive Officer\n\nYeah. Thank you, Steve. We do believe that we have a good proportion of patients that have volunteered for biopsy in this trial based on our prior discussions with the agency.\n\nSteve Seedhouse -- Raymond James -- Analyst\n\nPerfect. Thanks so much for taking the questions.\n\nSujal Shah -- Chief Executive Officer\n\nAbsolutely. Thank you.\n\nOperator\n\nOur next question comes from the line of Ed Arce with H.C. Wainwright. Please proceed with your question.\n\nThomas Yip -- H.C. Wainwright -- Analyst\n\nHello, everyone. This is Thomas Yip asking a couple of questions for Ed. First, congratulations on the RESPONSE studies to complete enrollment. So first question regarding the RESPONSE study.\n\nCompared to what you have seen in ENHANCE, what are your expectations for RESPONSE study in regards to the primary composite end point and also for key secondary end points such as ALT [Inaudible] and also a pruritus?\n\nSujal Shah -- Chief Executive Officer\n\nYeah. Thank you for that question, Thomas. I think one thing to highlight is in our prior experience, not only in the ENHANCE first phase 3 study conducted, but again, also in our phase 2 open-label study that included just north of 100 patients enrolled. We've seen a very consistent response on percent decrease in alkaline phosphatase on the actual magnitude of alkaline phosphatase reduction and how those reductions actually translate to the primary composite end point.\n\nSo if you recall in our open-label phase 2 study, in fact, through 12 months of treatment, we saw just under 80% of patients actually meet that primary end point, very consistent with what we saw at three months in ENHANCE. We're gratified that even as we've shared some data sets for patients that have gone beyond one year of treatment we continue to see, in fact, improvements in alkaline phosphatase reductions, and in particular, even normalization of alkaline phosphatase going from about 40% to 50% -- 30% -- I'm sorry, to 40% between year one and year two. So we've seen a very consistent continued response across our prior studies. And we'll see what we see, of course, in RESPONSE, as I highlighted, it really is the same patient population we've studied in these prior trials.\n\nIt's why we think this program is particularly derisked at this stage expectation would be to see something similar to what we've seen in the past.\n\nThomas Yip -- H.C. Wainwright -- Analyst\n\nGreat. Thanks for that, Sujal. And perhaps another question from us for the ASSURE long-term study, can you discuss what's the rough percentage of patients are for RESPONSE? And also so far what's the median and the longest driven duration of patients in the study?\n\nSujal Shah -- Chief Executive Officer\n\nYeah. Let me ask Chuck to give you some color, particularly on the second part of that question.\n\nChuck McWherter -- Chief Scientific Officer\n\nYeah. Well, thank you, Thomas. So ASSURE began its enrollment basically in February of last year. So the first patients to come in had come from our legacy studies, the low dose study that we published in the Journal of Hepatology, as well as from ENHANCE.\n\nSo those patients have been accruing throughout that period right up to date. And the lion's share, almost all of the patients so far are coming from those legacy studies. As you know, we announced that we began enrollment in RESPONSE basically in April of last year. And so we do now have a handful of patients who have completed the first year of treatment and are rolling over into the ASSURE study.\n\nWe would expect, based upon our prior experience, we had really good patient retention and quite a significant amount of interest to participate in extension studies. And so we would expect to really most of those patients in RESPONSE to come into ASSURE. So in total, this means that we're looking at a very large data set with a considerable amount of treatment experience by the time we take the data cut to submit for an NDA. And we think that's really going to be helpful to regulators that need to reach a decision based upon safety but also the efficacy, the biochemical response, the durability and looking at the symptom release as well.\n\nThomas Yip -- H.C. Wainwright -- Analyst\n\nFantastic. Thank you again for the questions, and we look forward to the readout next year.\n\nOperator\n\nOur next question comes from the line of Kristen Kluska with Cantor Fitzgerald. Please proceed with your question.\n\nKristen Kluska -- Cantor Fitzgerald -- Analyst\n\nHi. Good afternoon, everybody. Thanks for taking my question. And let me also add my congrats on achieving the full enrollment in RESPONSE.\n\nSo I saw a real publication from the study that suggested that pruritus was observed in more patients than previously thought with PBC, over 80%. So I know you're talking about some market metrics for patients who either don't respond or have tolerability issues with other therapies. But in light of some of these statistics, how are you thinking about being an upfront second-line drug?\n\nChuck McWherter -- Chief Scientific Officer\n\nWell, maybe I'll start and then Lewis can take a crack at it from the perspective of a market. I think I do agree that we continually get feedback about the importance of pruritus in the population. Just to share a little bit related to your question, our team visited over 70 clinical sites in terms of trying to help with recruitment for RESPONSE. And I can tell you that time and again, anecdotally, we had significant comments from investigators, from study coordinators in particular, from physicians' assistants, nurse practitioners that are involved in the study, about their patients and the need for something to address pruritus.\n\nAnd I think you're seeing this increasingly in the literature that you alluded to, and you may have heard some of the recent roundtable symposia at EASL, as well as at AASLD, where leading experts really began the discussion about the importance for physicians who are the target audience for these presentations to pay more attention to symptoms. One of the issues really relates to patients that are reluctant to talk about something that can only be shared by the way they feel. There's nothing currently that can be measured directly. It's only a symptom and not a sign.\n\nAnd this can be very discouraging for patients. So I think -- and I'll turn it over to Lewis, I think it represents a real opportunity for us to highlight that and kind of help with the entire field to change that dialogue because seladelpar initially seems to have a really nice effect on pruritus. And so that's something that will be important to understand and to take advantage of.\n\nLewis Stuart -- Chief Commercial Officer\n\nAnd Chuck couldn't be more profound in this description as we tapped in and interviewed a number of patients during our patient journey work. We spent a considerable amount of time listening to them describe how really, really difficult their daily life is in really managing these symptoms, whether that be pruritus, whether it be sleep disturbance, not being able to sleep particularly at nighttime where the pruritus really becomes a exacerbated. And then, of course, the fatigue that either is an inherent part of certainly their disease, whether they're just not getting a lot of sleep because of the itching and are very, very tired to say. When we look at the numbers, if you go back whether you are a complete responder, whether you're a partial responder, whether you're an incomplete responder, all of those patients, whether they're on UDCA or a combination therapy, so many of them really suffer from this moderate to severe pruritus.\n\nI would also point out, of course, that cirrhotic patients also have these symptoms as well. So it is a considerable issue. And we're very, very encouraged by what seladelpar could do to really support this particular population.\n\nSujal Shah -- Chief Executive Officer\n\nAnd Kris, the only other thing that I would add is that we are incredibly encouraged that seladelpar as a potential treatment alternative has this effect on biochemical markers of disease that may, in fact, improve longer-term outcomes for patients, as well as this impact on improving clinical symptoms. Of course, there are various other approaches being studied toward specifically addressing itch or pruritus in PBC patients. The real opportunity here with seladelpar is to have a single agent in a very simple manner for both treating physicians, of course, as well as patients taking a singular treatment alternative that actually does both can be quite compelling, we believe.\n\nKristen Kluska -- Cantor Fitzgerald -- Analyst\n\nOK. Thanks. I appreciate that. And on your recent conferences this year, you took your data and cut it in a lot of different ways, showing that the results are consistent across different parameters.\n\nSo I'm curious from a physician perspective and the audience you've presented in front of if there's any component in particular that have really stood out to them that you think are going to be instrumental should this be approved in your commercial conversations. Thanks again.\n\nChuck McWherter -- Chief Scientific Officer\n\nWell, thank you, Kristen. I would maybe highlight the ability to achieve in a biochemical response safely across different stages of disease. And this has been, as I mentioned in the study visits, site visits rather, that is something that's been mentioned time and time again, and that's anecdotal, of course. But really, the ability to see it in not just patients without cirrhosis but those patients who have compensated cirrhosis or compensated cirrhosis is portal hypertension.\n\nAnd that latter category now, of course, has been excluded from the approved second-line therapy. It's no longer available. That is something that I think is -- has the potential to be an attractive feature. Because if you think about it, patients progress and they progress at different rates with different risk factors, it would certainly be comforting to know that you can use it in a patient without cirrhosis, if their disease did progress, you wouldn't be getting into dangerous territory.\n\nSo we think that's something that's going to be really important to document. We've got a good data set so far. And of course, we will seek to confirm that with response, which also allowed for patients with compensated cirrhosis.\n\nSujal Shah -- Chief Executive Officer\n\nAnd perhaps, Kristen, and I'll ask Dennis to add any of his thoughts having also been with us at EASL, most recently, along with us at our ad boards in terms of impact and responses from many of them the medical community.\n\nDennis Kim -- Chief Financial Officer\n\nSure. Thanks, Sujal. Yeah, I think, obviously, biochemical response, efficacy response, as well as pruritus improvement are very important features of the drug and is well perceived by the prescribers and physicians. The other side of the coin, of course, is safety and tolerability.\n\nAnd I think that's been probably not something that's been talked about very often, but probably something that we need to emphasize because this is something that patients worry about, as well as positioned not only with respect to tolerability and not having knowing side effects or debilitating side effects, but also with respect to patients who can have decompensating events such as cirrhosis or other complications of cirrhosis. And there seems to be a little bit of a halo effect in that that we've studied cirrhotic patients in the past, and we're continuing to study these patients. And it appears so far that the drug is being well tolerated in these patient groups. Prescribers recognize that these are sick patients, they can have decompensating -- decompensation events at any given moment.\n\nSo they don't want to use a drug that could add to that risk, I think we have a drug in seladelpar that can mitigate some of these risks. We'll see if the data supports that. But I think that's another factor that prescribers appreciate and worry about that I think, hopefully, we can meet with our database.\n\nKristen Kluska -- Cantor Fitzgerald -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Mayank Mamtani from B. Riley Securities. Please proceed with your question.\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nGood afternoon, team. Thanks for taking our questions, and congrats on fully enrolling RESPONSE. So just maybe a quick follow-up for Dennis. Could you comment on the RESPONSE screening failure rate.\n\nI was just curious how much of those are so intolerable or inadequate responders aren't meeting this clinical trial criteria of alphas, bilirubin composite. Could you just comment on that? And then I have a follow-up for Chuck.\n\nDennis Kim -- Chief Financial Officer\n\nSure. So our screen failure rate has been very consistent from our prior experience. As you can imagine, there are a huge list of inclusion exclusion criteria for any of the studies. The RESPONSE study design was almost identical to that of ENHANCE.\n\nSo we predicted going in what our screening failure rate would be. And it turned out to be pretty much online with what we actually saw. It's not inconsistent with general other clinical trials that you may see. They range from anywhere from 40% to 60% screen failure rate, sometimes it can go up to 75%, 80% depending on the inclusion exclusion criteria and how much demand there is for these type of co-morbidities and biochemical responses or biochemical status.\n\nSo lab results, of course, are usually the most common cost for exclusion -- meeting exclusion. And that's what we saw in this RESPONSE screening effort as well. So that's very consistent with what we've seen in the past and consistent with other trials that we've -- we've conducted.\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nGot it. Thank you. And Chuck, coming away from the EASL data sets, how much of this antifibrotic component do you intend to study further. I also asked -- I mean I'm asking for a couple of reasons.\n\nObviously, your comments on cirrhotic population from a safety standpoint is interesting, but also getting to that outcome component and converting the accelerated approval to full approval, is there an evaluation more you could do to understand how good of an antifibrotic drug this is given your NASH results.\n\nChuck McWherter -- Chief Scientific Officer\n\nYeah. Thanks for that question. I think that's really important. We're trying to build upon what [Inaudible] science, what we learned in the NASH study and take that and apply.\n\nA little bit different, of course. We do have biopsy in this study, and we may learn a bit there around effects on fibrosis, but it's a relatively short term. It's a year. And of course, there won't be not every patient will have a biopsy.\n\nThere is an emerging approach though, that was just recently published in the Journal of Hepatology that's getting increasing attention, which looks at liver stiffness using fibroscan methodology, which is basically transient elastography that's been correlated with histological stage of disease. So this is a paper coming -- led by Christophe Corpechot. And we're including fibroscan measurements in both RESPONSE and ASSURE. And we're very interested in understanding how these might be used in clinical research as potential markers for outcomes, perhaps it's not currently the case, but in the future, it might be that regulators might consider them, but also in medical practice, the fibroscan technology is more and more being widely available.\n\nIt's really part of general practices, large GI practices, obviously university or academic medical centers, but even suburban hospitals and the like. And it's also being extensively used in NASH. So we're able to kind of ride the tailwinds for its wide availability. We think that looking at liver stiffness has to infer effects on fibrosis, either lack of progression, looking at serial measurements or even, hopefully, regression could be a wave of the future and that could be important for a drug like seladelpar that has anti-fibrotic effects.\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nThank you. And my final question is about the open-label hepatic impairment study you're running. Can you just provide us update on that? And just confirm, are you just exploring the 10 mg dose level? Or are you doing lower doses of that?\n\nSujal Shah -- Chief Executive Officer\n\nYeah. Let me ask Dennis to provide you some additional color here. This is obviously a study, as you mentioned, hepatic impairment study in patients with PBC so that we can better understand, particularly safety but also efficacy in more advanced patients. And these are those patients that have either Child-Pugh A compensated cirrhosis and a small subset of patients with Child-Pugh B and C decompensated cirrhosis.\n\nAnd so perhaps I'll let Dennis give you just some high level on this, Mayank. This is an ongoing study. So at the point at which we complete the trial, we'd share updates in terms of data from the trial. But Dennis, perhaps you can give a little bit more color around the trial itself.\n\nDennis Kim -- Chief Financial Officer\n\nSure. Thanks for the question, and thanks also, Sujal, for the preamble. Your -- Sujal is exactly right. These are the patients that we're looking for in the study.\n\nIt's an ongoing study, which -- for which we don't really make too much detailed comments. Suffice to say these patients are rare patients because especially CPB patients and then CPA patients with portal hypertension are also fairly rare. We are making progress in recruiting patients into the study and activating additional study sites. We do have a fairly long time line before we have to complete the study.\n\nSo we are planning to be able to include this database into the NDA. We are testing 10-milligram dose, but we remain -- we maintain the flexibility of going to a lower dose. If we see rate of metabolism and pharmacokinetic exposure in patients with advanced cirrhosis, which would require a lowering of the doses. So we do have that flexibility, and we'll let you know how that goes once we finish the study.\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nThanks for taking our questions, Sujal.\n\nSujal Shah -- Chief Executive Officer\n\nThank you, Mayank.\n\nOperator\n\nOur next question comes from the line of Patrick Dolezal with LifeSci. Please proceed with your question.\n\nCory Jubinville -- LifeSci Capital -- Analyst\n\nHi. This is Cory on for Patrick. Congrats on the enrollment, and thanks for taking our questions. So first one from us.\n\nYou recently had some great data regarding seladelpar's effect on GLOBE score. Obviously, seladelpar has a strong potential for a differentiated label in regard to pruritus. But is there eventually an opportunity for a label that might include outcomes for GLOBE score in -- to what degree do regulators and clinicians give credence to GLOBE given that it's a predictive metric?\n\nChuck McWherter -- Chief Scientific Officer\n\nYeah. Thank you, Cory. So the GLOBE score is a continuous measure of risk that's been validated to predict outcomes. This is based on work from the global PBC study group.\n\nIt includes the elements that go into it are age and then laboratory parameters, which would be alkaline phosphatase, bilirubin, platelets and albumin levels. And those are all liver parameters to really speak to the health of the liver overall. And so the value of it in clinical research, it's typically used in medical practice. There's a web page, you can go to and a physician can just input the parameters based on the laboratory results and get an idea of what's going on with the patient, maybe look at these measures serially.\n\nSo it's typically used to kind of be a PBC specific risk assessment so that the attending physician can make some medical judgments about anything that needs to be done, any adjustments to treatment. The way that we're using it is a variable to examine treatment response. And it has several advantages, I think, over the categorical variables, the ones that, for example, regulators are using right now, you either respond or you don't respond and that doesn't really give a lot of granularity. It's very much a blend interest -- instrument, especially in clinical research.\n\nSo having a continuous variable allows for finer gradations and judging risk and also for examining treatment differences between two groups. So that's another powerful measure. I think that at the moment, as far as our program is concerned, we're using a precedented end point, FDA and EMA accept it, we're not going to change that at this. The GLOBE score is an exploratory parameter.\n\nWe can use it to tease out differences, for example, between post-hoc analysis between subsets.\n\nCory Jubinville -- LifeSci Capital -- Analyst\n\nAny regions or sites that are particularly enriched or deficient for patients?\n\nSujal Shah -- Chief Executive Officer\n\nThat's a good question, Cory. Perhaps I'll just answer that one and if there's anything I missed, Dennis can add on to it. Not dissimilar from ENHANCE, first of all, a majority of patients of course, come from the U.S. given the site distribution and the number of sites we have in the U.S.\n\nBut I actually think we had very good representation globally. In Europe, in Asia, as well as in particular, in this case, South America. And so there were certainly some countries in which we saw more of a contribution in enhanced countries. In fact, in RESPONSE that may, in fact, have been impacted more so by COVID restrictions across the 15 months that we are enrolling RESPONSE.\n\nThose restrictions perhaps were lighter in some other regions. And we continue to build in terms of relationships. There are many overlapping sites from our prior ENHANCE study, but there are many new sites relationships and partners that we build even with respect to RESPONSE. And so I think we actually had very good distribution across all of those regions, in particular, Europe, Asia, and particularly South America in addition to, again, the majority of patients coming from the U.S.\n\nCory Jubinville -- LifeSci Capital -- Analyst\n\nExcellent. That's all we have. Congrats again, and thanks for taking our questions.\n\nSujal Shah -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Thomas Smith with SVB Securities. Please proceed with your question.\n\nMike Kratky -- SVB Securities -- Analyst\n\nYeah. Hi, everyone. This is Mike on for Tom. Thanks for taking our question.\n\nAs you start to think about the transition to commercial operations, what kind of information do you hope to present in September at your upcoming virtual Investor Day, specifically on some of the initial learnings that you found and what metrics you expect to track as you move forward with the launch?\n\nLewis Stuart -- Chief Commercial Officer\n\nYeah. Thank you for the question. Yeah, we're looking forward to September. I think one of the things we want to try to do is take a bit more of a global view all the planning that we've done and share some of the data that we have on both U.S., ex U.S.\n\ngeographies. We also are examining the payer landscape here in the U.S. already done some work in Europe. We'll share a little bit of that too.\n\nYou want to just talk a bit about both the commercial and government coverage landscape here and what we can expect around those issues. And I think the other thing I'll say is we're hoping that our go-to-market strategy formation that will stand up here in the second half of the year. We'll go also to inform both not just our commercial -- pre-commercial work but also obviously our medical affairs focus as well. So I think the way we'll look to measure and evaluate things here will have a lot to do with our engagement with KOLs and how we go about engaging payers here in the pre-commercial setting to really begin to articulate a value proposition.\n\nSo more to come on a lot of that, but we're really going to getting into a bit more detail here in the next few weeks.\n\nMike Kratky -- SVB Securities -- Analyst\n\nUnderstood. Thanks very much for all the color.\n\nSujal Shah -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThere are no further questions in the queue. I'd like to hand the call back to management for closing remarks.\n\nSujal Shah -- Chief Executive Officer\n\nThank you, operator. As we look ahead to the remainder of the year, we'll continue to focus on execution of RESPONSE and all of the ongoing active studies being conducted to prepare ourselves for future regulatory submissions. So the efficacy and safety data in our ongoing studies reflect what we have observed in our prior phase 2 and phase 3 studies. We believe seladelpar as we've mentioned, has the potential to significantly improve the lives of patients with PBC.\n\nI think, it bears repeating. We continue to believe our development program remains one of the most robust and derisked in this indication today. We see many opportunities ahead of us to unlock near-term and long-term value from seladelpar in PBC and look forward to sharing future updates as we make progress. We look forward to sharing more about our story and this opportunity during our virtual Investor Day on September 22 that Lewis spoke about.\n\nI'd like to thank everyone once again for joining our call today, and we look forward to speaking to you again very soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPaul Quinlan -- General Counsel\n\nSujal Shah -- Chief Executive Officer\n\nDennis Kim -- Chief Financial Officer\n\nChuck McWherter -- Chief Scientific Officer\n\nLewis Stuart -- Chief Commercial Officer\n\nDan Menold -- Vice President, Finance\n\nYasmeen Rahimi -- Piper Sandler -- Analyst\n\nSteve Seedhouse -- Raymond James -- Analyst\n\nThomas Yip -- H.C. Wainwright -- Analyst\n\nKristen Kluska -- Cantor Fitzgerald -- Analyst\n\nMayank Mamtani -- B. Riley Securities -- Analyst\n\nCory Jubinville -- LifeSci Capital -- Analyst\n\nMike Kratky -- SVB Securities -- Analyst\n\nMore CBAY analysis\n\nAll earnings call transcripts"
}