{
  "companyName": "CarMax",
  "companyTicker": "KMX",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/22/carmax-kmx-q3-2023-earnings-call-transcript/",
  "content": "CarMax (KMX -0.60%)\nQ3 2023 Earnings Call\nDec 22, 2022, 9:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to the third-quarter fiscal year 2023 CarMax earnings release conference call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session.\n\nPlease be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, David Lowenstein, AVP, investor relations. Please go ahead.\n\nDavid Lowenstein -- Assistant Vice President, Investor Relations\n\nThank you, Ashley. Good morning, everyone. Thank you for joining our fiscal 2023 third-quarter earnings conference call. I'm here today with Bill Nash, our president and CEO; and Enrique Mayor-Mora, our executive vice president and CFO; and Jon Daniels, our senior vice president, CarMax Auto finance operations.\n\nLet me remind you, our statements today that are not statements of historical fact, including statements regarding the company's future business plans, prospects, and financial performance are forward-looking statements we make pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements are based on our current knowledge, expectations and assumptions and are subject to substantial risks and uncertainties that could cause actual results to differ materially from our expectations. In providing projections and other forward-looking statements, we disclaim any intent or obligation to update them. For additional information on important factors that could affect these expectations, please see our Form 8-K filed with the SEC this morning and our annual report on Form 10-K for the fiscal year ended February 28, 2022, previously filed with the SEC.\n\nShould you have any follow-up questions after the call, please feel free to contact our investor relations department at 804-747-0422 extension 7865. Lastly, let me thank you in advance for asking only one question and getting back in the queue for more follow-ups. Bill.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you, David. Good morning, everyone, and thanks for joining us. Our third-quarter results reflect the continuation of widespread pressures across the used car industry. Vehicle affordability remained challenging due to macro factors stemming from broad inflation, climbing interest rates, and continued low consumer confidence.\n\nIn addition, persistent and steep depreciation impacted wholesale values throughout the quarter. In response, we have been taking deliberate steps to support our business for both the short term and for the long run. We are leveraging our strongest assets, our associates, our experience, and our culture to manage through this cycle. Actions that we took during the quarter include further reducing SG&A, selling a higher mix of older, lower-priced vehicles, slowing buys in light of the steep market depreciation, maintaining used saleable inventory units while driving down total inventory dollars more than 25% year over year, raising CAFs consumer rates to help offset rising cost of funds, pausing share buyback to give us capital flexibility, and slowing our planned store growth for next fiscal year to five locations while maintaining our ability to open more locations if market conditions change.\n\nIn the near term, we are prioritizing initiatives that unlock operational efficiencies and create better experiences for our associates and our customers. While we continue to selectively invest in initiatives that have the potential to activate new capabilities, we have slowed the pace of those investments. We believe these steps will enable us to come out of this cycle leaner and more effective while positioning us for future growth. We will provide more details on these actions later during today's call.\n\nAnd now, on to our results. For the third quarter of FY '23, our diversified business model delivered total sales of $6.5 billion, down 24% compared with last year's third quarter, driven by lower retail and wholesale volume. In our retail business, total unit sales in the third quarter declined 20.8% and used unit comps were down 22.4% versus the third quarter last year when we achieved a 15.8% used unit comp. In addition to the macro factors that I mentioned previously, we believe our performance was impacted by transitory competitive responses to the current environment.\n\nExternal title data indicates that we gained market share on a year-to-date basis through October, though we've seen some recent loss of share. As we have said before, we are focused on profitable market share gains that can be sustained for the long term. Through expansive price elasticity testing, we determined that holding margins during the quarter was the right profitability play. Third-quarter retail gross profit per used unit was $2,237 which is consistent with last year's third quarter.\n\nWholesale unit sales were down 36.7% versus the third quarter last year, driven by rapidly changing market conditions, which included about $2,000 of depreciation. This is incremental to approximately $2,500 of depreciation experienced during the second quarter. Wholesale performance was also impacted as we continue to reallocate some older vehicles from wholesale to retail to meet consumer demand for lower-priced vehicles. Wholesale gross profit per unit was $966, down from a third quarter record of $1,131 a year ago.\n\nRecall, last year, prices appreciated approximately $2,500 during the quarter, which was a margin tailwind. Just as we are doing in retail, we will continue to focus on maximizing total wholesale margin profitability. We bought approximately 238,000 vehicles from consumers and dealers during the third quarter, down 40% versus last year's period. Our volume was impacted by steep depreciation and our deliberate decision to slow buys in reaction to the depreciation.\n\nWe purchased approximately 224,000 cars from consumers in the quarter with about half of those buys coming through our online instant appraisal experience. We also sourced about 14,000 vehicles through Max offer, our digital appraisal product for dealers, up 16% from last year's third quarter. Our self-sufficiency remained above 70% during the quarter. In regard to our third-quarter online metrics, approximately 12% of retail unit sales were online, up from 9% in the prior year's quarter.\n\nApproximately 52% of retail unit sales were omni sales this quarter down from 57% in the prior year's quarter. Our wholesale auctions remain virtual, so 100% of wholesale sales, which represent 18% of total revenue are considered online transactions. Total revenue resulting from online transactions was approximately 28%, down from 30% during last year's third quarter. CarMax Auto Finance or CAF delivered income of 152 million, down from 166 million during the same period last year.\n\nJon will provide more detail on consumer financing, the loan loss provision, and cash contribution in a few moments. At this point, I'd like to turn the call over to Enrique, who will provide more information on our third quarter financial performance and the steps we've taken to further align our business to the current sales environment. Enrique.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nThanks, Bill. Good morning, everyone. Third-quarter net earnings per diluted share was $0.24, down from $1.63 a year ago. Total gross profit was $577 million, down 31% from last year's third quarter.\n\nUsed retail margin of $403 million and wholesale vehicle margin of $115 million declined 21% and 46%, respectively. The year-over-year decreases were driven by lower volume across used and wholesale and lower wholesale margin per unit. As Bill noted, we continue to face depreciation and have been adjusting accordingly to better position ourselves to manage through the current environment. Other gross profit was $59 million, down 49% from last year's third quarter.\n\nThis decrease was driven primarily by the effect of lower retail unit sales on service and EPP. Service results declined $37 million as lower sales and secondarily, our decision to maintain technician staffing levels drove some deleveraging. Technicians are among the most in-demand associates in the industry and the retention will position us strongly to quickly grow inventory when we exit the current cycle. EPP fell by 14% or $15 million, reflecting the decline in sales that was partially offset by stronger margins and a favorable year-over-year return reserve adjustment.\n\nPenetration was stable at approximately 60%. Third-party finance fees were relatively flat over last year's third quarter with lower volume and fee generating Tier 2, offset by lower Tier 3 volume for which we pay a fee. On the SG&A front, expenses for the third quarter were $592 million, up 3% from the prior year's quarter, reflecting a slowdown from the year-over-year increases of 19% during the first quarter and 16% during the second quarter of this year. In the prior year's third quarter, we received a $23 million settlement from a class action lawsuit.\n\nAdjusting for that settlement, SG&A actually would have declined 1% year over year this quarter. SG&A as a percent of gross profit was materially pressured as compared to the third quarter last year due primarily to the 31% decrease in total gross margin dollars compared to last year's quarter. The change in SG&A dollars over the last year was mainly due to the following factors: first, a $41 million increase in other overhead primarily driven by cycling over last year's legal settlement. We also continue to invest, although at a reduced pace in our technology platforms and strategic and growth initiatives; second, an $18 million reduction in compensation and benefits, including a $16 million decrease in share-based compensation; and third, a $17 million reduction in advertising.\n\nDuring the quarter, we continued to take steps to better align our expenses to our sales. This included further reducing staffing through attrition in our stores and CECs, limiting hiring and contractor utilization in our corporate offices, and continuing to align our marketing spend to sales. While our advertising expense was lower year over year, our investment on a per unit basis remains consistent with last year's third quarter. We remain focused on reducing expenses and anticipate continued progress in the fourth quarter.\n\nRegarding capital structure. Our first priority is to fund the business. Given third-quarter performance and continued market uncertainties, we are taking a conservative approach to our capital structure. While our adjusted debt-to-capital ratio was below our 35% to 45% targeted range, we are managing our net leverage to maintain the flexibility that allows us to efficiently access the capital markets for both CAF and CarMax as a whole.\n\nIn keeping with this goal of maintaining flexibility, we took the following steps this quarter in addition to the SG&A actions I spoke to. First, we paused our share buybacks. Our $2.45 billion authorization remains in place as does our commitment to return capital back to shareholders over time. Second, we slowed the velocity of our capex spend.\n\nWe expect capex will end the fiscal year at approximately $450 million versus our previous $500 million estimate. As Bill mentioned, we have also conservatively planned store growth for five new locations in fiscal year 2024. Our liquidity remains very strong. We ended the quarter with over $680 million in cash on the balance sheet and no draw on our $2 billion revolver.\n\nNow, I'd like to turn the call over to Jon.\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nThanks, Enrique, and good morning, everyone. In the third quarter, the strength and stability of our credit platform provided approvals to over 95% of the consumers who applied for credit during their shopping journey. CarMax Auto Finance originated $2.1 billion within the quarter, resulting in a penetration of 44.4% net of three-day payoffs, up from 42.2% realized in the same quarter last year and 41.2% in Q2. The weighted average contract rate charged to new customers was 9.8%, which was higher than the 8.3% in last year's third quarter and the 9.4% seen in Q2.\n\nWe continue to leverage our scalable testing environments and nimble underwriting infrastructure to strategically pass along a portion of the increased funding costs to consumers while still increasing share of the finance contracts. Tier 2 penetration in the quarter was 20.5%, in line with historical levels, but down from last year's 22.2%. Tier 3 financed 6.1% of used unit sales, compared to 6.5% a year ago. Our lenders continue to make their own independent lending decisions in this challenging environment, and we remain pleased with the competitive offers they are collectively able to provide to our customers.\n\nCash income for the quarter was $152 million, a decrease of 8.3% or $14 million from the same period last year. Our loan loss provision was $86 million, resulting in an ending reserve balance of $491 million. This is compared to a provision of $76 million in last year's Q3. The current quarter's reserve of $491 million is 2.95% of managed receivables, up slightly from 2.92% at the end of this year's second quarter.\n\nThis sequential three-basis-point adjustment in the reserved receivables ratio comes primarily from the continued addition of Tier 2 and Tier 3 receivables into the overall portfolio as seen in previous quarters. All in all, we were pleased with the credit performance within our portfolio during the quarter, and we believe we are appropriately reserved for future losses. Further, we continue to be in a strong position to leverage our unique credit platform to operate our Tier 1 business within our targeted loss range of 2% to 2.5%. Within the quarter, total interest margin dollars were flat to last year at $277 million, modestly supported by a $5 million benefit from our hedging strategy.\n\nThe corresponding margin to receivables rate, 6.7% was down 54 basis points year over year as receivables with historically low funding costs were offset by the receivables impacted by the more recent Fed moves. Regarding advancements in our broader credit technology, during the third quarter, we successfully completed the nationwide rollout of finance-based shopping, our multi-lender prequalification product, and we continue to see a high level of engagement with this experience. As a reminder, this gives customers the ability to digitally receive quick credit decisions across our entire inventory via our simple online application with no impact to credit scores. This also allows consumers to quickly and easily secure financing at any point in their shopping journey.\n\nLike the rest of the business, CAF is also focused on driving efficiencies. We are already seeing benefits from the modern, more nimble receivable servicing system that we launched a year ago. Consumer finance is a highly regulated and ever-changing space, and our new system allows us to adapt more easily to these necessary changes. A recent example is California's upcoming regulatory change that requires added disclosure and refund requirements related to the cancellation of the GAP waiver product.\n\nWith our old system, the implementation would have been lengthy and onerous, and we likely would have temporarily suspended the product in the state while we made the changes. However, with our new, more agile technology, we are able to incorporate these requirements without interrupting. This is just one example of our early wins resulting from our new system, and we have a clear line of sight to many more in the near and midterm. Now, I'll turn the call back over to Bill.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you, Jon, and thank you, Enrique. As I mentioned at the start of today's call, we're taking steps to support our business by prioritizing projects that unlock operating efficiencies and create better experiences for our associates and customers. It starts with making our omnichannel experience faster, simpler and more seamless. Some examples include we are enhancing online features to help customers feel more confident in completing key transaction steps on their own and make it easier to go back and forth between assisted health and self-progression.\n\nWe're also making it simple for consumers to opt in to express pickup through self-progression. Excuse me. This delivery option offers customers the ability to complete their transaction at one of our stores in as little as 30 minutes and represents a win-win opportunity. Our research shows that customers love this experience when utilized, and it will enable us to lower our costs over time.\n\nOur final example is that we are working to seamlessly integrate our finance-based shopping product into our stores and customer experience centers so that all consumers can enjoy this experience, not just those who shop online. At the same time, we are adding additional lenders to the platform to expand the breadth and depth of offers available to our customers. As we evolve our omnichannel experience, we are also updating our operating models to drive efficiency gains in our stores. For example, in our business offices, we have launched self-check-in capabilities for appraisal customers and have also enhanced e-sign functionality to better enable self-progression.\n\nAdditionally, we are testing an improved digital customer queue to better manage appointments as well as new software to improve title speed and visibility. We anticipate these tools will enable us to reduce associate time spent per customer and shorten customer transaction times. Our associates are key to providing an exceptional customer experience, and we are focused on leveraging their skills in the most value-added manner. We will also continue to selectively invest in key projects that have the potential to deliver new capabilities while lowering our costs.\n\nExamples include: First, we're updating Max offer, our appraisal product for dealers, which is available in approximately 50 markets. Many of our dealers are still on the initial version, which does not provide instant offers and requires them to take instant vehicle pictures. We are rolling out a new product, which offers a fully digital instant offer experience to all dealers. We believe this will well position us to grow our dealer buys more efficiently and support higher volume over time.\n\nSecond, we are leveraging technology to enhance our logistics capability. We move approximately 2 million vehicles each year. We estimate that our internal logistics operation drives about a 20% cost advantage over third-party providers and improves our speed, predictability, and control of moves. Enhancements to our transportation management system will enable us to consolidate loads, increase our mix of full loads, and reduce the truck volume in and out of our stores.\n\nThis will support our ability to keep our costs low as we complete moves even faster and more efficiently. Third, we are continuing to upgrade our auction experience. During the third quarter, we scaled our modernized vehicle detail page to 50% of dealers. This page is mobile-friendly, provides more relevant data to our dealers, and improve search and filter functionality.\n\nIt is also the springboard that we will use to launch capabilities we believe will further enhance our wholesale business, including AI-enhanced condition reports and proxy bidding. We are confident that our focused initiatives will drive efficiencies and grow our business over the long term. In closing, we have spent almost 30 years building a diversified business that can profitably navigate the ups and downs of the used car industry. We have a strong balance sheet and access to capital.\n\nOur experience in inventory and margin management is the strength and we will continue to be thoughtful and manage our expenses pulling levers as necessary. While we're not able to predict how long the industry will remain challenged, we believe the pressures are transitory and that we are well positioned to manage through them and emerge an even stronger company. I want to thank our associates for everything that they're doing to support each other, our customers and our business our foundation remains strong, and we're excited about the future of our diversified business model. With that, we'll be happy to take your questions.\n\nAshley.\n\nOperator\n\nCertainly. [Operator instructions] And your first question comes from the line of Brian Nagel with Oppenheimer. Your line is open.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nThanks for taking the questions.\n\nBill Nash -- President and Chief Executive Officer\n\nGood morning, Brian.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHappy holidays.\n\nBill Nash -- President and Chief Executive Officer\n\nYou too.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nSo, I guess the question I have just with regard to sales. And maybe, Bill, if you could discuss a bit more just the trend of sales through the quarter, so we understand better how the business is performing here. And then also, you mentioned in your comments that you saw a market share declines, if you will, I guess, later in the period. It sounds like that was as a result of others taking more aggressive actions on price.\n\nYou can elaborate further there. Who's doing -- what cohort of your competition is doing that? And how long should it -- how long would you expect that dynamic to persist? And then I guess a follow-up to that, as you look at your business, and CarMax has historically been very, very good at managing inventories, but if you're starting to see now others take more aggressive action on price and you've held the line on margin, could there be percolating issues within your inventory?\n\nBill Nash -- President and Chief Executive Officer\n\nAll right. There's a lot in there, Brian. So, let me start with sales during the quarter. The last time we spoke, it was middle of September.\n\nLatter part of September, we talked about sales being down in the mid-teens. It actually got a little softer by the end of September, and it continued -- we continue to see even more softness in October and November. I'll save you from having to get back into the queue because I'm sure your next question is, well, how is December panning out? December is actually running about where the quarter -- the third quarter ran on average, so it's a little bit better than November, but I would just remind you that we're also going to be -- we're comping over a little bit of easier performance, obviously, than we were from the third quarter that we will be doing in the fourth quarter. As far as market share, giving you some detail on market share declines.\n\nYear to date, like you said, we've still got -- we still have gains in share. We did see declines most recently in September and October, which is the latest title data that we have. But this speaks to why I always hesitate talking about market share on the short-term basis because sometimes there are some temporary pressures. And we saw competitors lowering prices and margins to move inventory, which I'll be honest with you, it's not surprising.\n\nI mean, we saw the -- a very similar play back in the '08, '09 recession. It's also the reason that we did much more expansive pricing elasticity testing. And through those tests, we're confident that even though we would have sold more cars if we had lowered the prices, we actually would have we made less money. And as I said in my opening remarks and what I've always said is we're always -- what we're going after is profitable long-term market share gains.\n\nAnd I think we've got a great track and record on that. I think your other question was just who's getting that. Look, it's -- this is a highly dispersed business, lots and lots of players out there. I can't point to any of them.\n\nI just know that widespread pressures of folks trying to move their inventory and get rid of it.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nThanks, Bill.\n\nBill Nash -- President and Chief Executive Officer\n\nSure. Ashley.\n\nOperator\n\nYes. So, we'll take our next question from Rajat Gupta with JPMorgan. Please go ahead.\n\nRajat Gupta -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks. Thanks for taking the questions. Maybe firstly, just on retail GPU.\n\nObviously, very well managed again this quarter. You talked about the fact that you're not discounting as much as some of your competitors. But at some point, you have to move the inventory that you have. It seems like it's aging and it's getting older on the lot.\n\nSo, like what gives ultimately? I mean, would you have to consider the discounting at some point to move their inventory out the door if not this quarter, maybe the next quarter? So, how do you manage that transition, and how should we think about the implications to Retail GPU maybe in the next quarter or two through that pricing position? And I have a follow-up. Thanks.\n\nBill Nash -- President and Chief Executive Officer\n\nYes. So, Rajat, great question. This is where I think we really shine when it comes to inventory management. I'm really pleased.\n\nIf you notice -- I talked about how much our total inventory has gone down, but we're able to maintain saleable units. And that's because the team did a phenomenal job really cleaning up the stuff that we had, whether we're waiting on parts, missing titles. We really worked hard to clean up a lot. So, to your point, the aging inventory, it's one of the reasons why you didn't see more movement in our ASPs, our average selling prices, given the depreciation.\n\nThe team did a phenomenal job working through that, getting it out there. And then with our sophisticated price testing, we just realized, look, there's no sense and given this away. And so, again, we feel like we put ourselves in a really good position going forward. And I think what you'll see going forward is your retail average selling prices are going to come down a lot more than what you've seen up to this point.\n\nSo, we feel good about retail GPU. Obviously, we'll continue to test the elasticity as we go forward. But if elasticity holds, I think, you know, you'll see us continue to have robust retail GPUs.\n\nRajat Gupta -- JPMorgan Chase and Company -- Analyst\n\nGot it. And maybe like the other gross profit line. If I look at the volumes that you did three years ago, very similar to the volumes that you have today, really slightly lower today. And that other gross profit was 94 million and it's now 59 million despite your third-party financing fees actually better.\n\nSo, why is that like down almost 50% on a similar level of volume? I mean, is there any opportunity to reduce the cost there? I know you mentioned that you want to retain the technicians, but how long are we going to see this kind of run rate before it can recouple to what you had in the past? [Inaudible] the question.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYes. Specifically with the other margin, it's -- what you really need to do is look within the service business. And this quarter, a couple of things. Number one, was just with sales volumes being where they were down 20% year over year, that places a fair bit of deleverage pressure on the service business.\n\nThat's number one. But number 2, of almost equal importance this quarter, about $15 million year over year was our decision -- the correct decision is to hold on to technicians, right? It's a very difficult position to staff. It is of utmost importance that we retain and we recruit the technicians because when we come out of the cycle, we want to be in a position where we can actually ramp up our inventory quickly faster than our competitors. But that being said, it is an investment that flows through that service line.\n\nAnd again, this quarter, it was roughly $15 million given the current sales levels. But it's absolutely the right decision for the medium term and for definitely for the longer term. That was the biggest pressure this quarter, Rajat.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. Rajat, the only thing I would add is, obviously, you're comparing it to a few years ago. We have a lot more production capacity now because we have more technicians. We have more space.\n\nSo, that's feeding into it as well.\n\nRajat Gupta -- JPMorgan Chase and Company -- Analyst\n\nJust to follow up, so what's your view on the cycle recovery? I mean, like are you anticipating things like rebound at some point next year? Or, I mean, what kind of conviction do you have on that? Like so -- just so that you might have to take some of these type not actions more aggressively. Just curious on the thought process there.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. Look, Rajat, your guess is as far as what's going to happen next year is as good as mine. I think what we're trying to do is put ourselves in a position that regardless of what happens in the upcoming quarters, we'll flex up. Or if we need to pull additional levers, we'll pull additional leverage.\n\nSo, we're just trying to give ourselves flexibility at this point.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYeah. I mean we are laser focused on what we can control, and that's what we're taking actions on. And so, you can take a look at our SG&A and how we bent the curve there. You can take a look at service.\n\nYes, it's up. But, again, there's -- the reason it's up is that we're investing in our technicians because we know, and we're going to get through the cycle. And when we emerge from it, we want to be in a really strong position and reduce cars quickly.\n\nRajat Gupta -- JPMorgan Chase and Company -- Analyst\n\nGot it. Great. Thanks for taking the questions.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe'll take our next question from John Healy with Northcoast Research. Please go ahead.\n\nJohn Healy -- Northcoast Research -- Analyst\n\nThank you for taking my question. Just wanted to ask for a little bit more color on the SG&A cadence. I appreciate the comp cadence, but I was just wondering if you could help us think about the actions you took in Q3 and, you know, maybe the run rate and really. I don't know if we can think about an SG&A to gross kind of level for the next couple of quarters.\n\nOr just help us understand kind of what might be reasonable for you guys just because there's been a lot of growth, SG&A, and now it sounds like you're calibrating that back. So, anything you could provide there would be helpful.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYeah. Great. Thank you, John. Yes, like I said in my prepared remarks, we have significantly bent the curve on our SG&A go back to the first half of the year as a whole, it was up 16% to 17% year over year.\n\nWe've bent that down to 3% year-over-year growth this quarter. But again, when you back out the $23 million settlement, that we received last year in the third quarter, you're really looking at a slight decrease in overall SG&A. So, pretty material change in the curve. We would expect that to carry forward into the fourth quarter and into next year.\n\nAnd why is that? It's because it's the actions we've been talking about, right? There's really kind of two groups of actions. Number one is on the more variable perspective. We've been lowering our headcount, lowering our staffing from an attrition basis in our stores. So, that actually takes a little bit more time, right, because you're managing it through attrition, but we believe it's the right thing to do from a culture standpoint.\n\nAnd that has been bleeding down really since the second quarter when we start talking about it. We expect that will carry forward to the fourth quarter and into next year. The second piece is really taking a look at our fixed costs and actively managing there as well. So, I've talked about looking at our usage of contractors in the corporate home office, we've pulled back there, right? And we've also essentially paused our hiring in the corporate office.\n\nWe are still hiring backfills kind of key positions that we have as well, kind of strategic positions as well. But materially so, we've kind of paused our corporate overhead hiring as well. So, we've taken strong actions. We believe they are appropriate actions for the marketplace that we're operating in.\n\nIf we need to take further actions, we would do that as well if required, but we believe we're strongly positioned right now. And to answer your question about like the cadence, I would expect the fourth quarter to look similar to the third quarter once you back out the settlement from last year.\n\nJohn Healy -- Northcoast Research -- Analyst\n\nAnd when you say roughly similar to the Q3, would that be in terms of dollars, or would that be in terms of kind of SG&A type gross?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYes. So, it's more of a year-over-year SG&A and how that's moving. It's not to gross. I think the challenge, John, with the leverage ratio, the SG&A to gross profit is we can control SG&A, and I believe we've been doing that effectively.\n\nThe challenge is the gross profit number. So, depending on where that gross profit number ends up and sharp movements quarter to quarter make it really difficult to manage that leverage ratio. So, in terms of -- as I mentioned earlier, we'll control what we can control, and that's what we're focused on. We're focused on that SG&A line.\n\nSo, I would -- my comments are specifically about SG&A growth year over year in the quarter.\n\nJohn Healy -- Northcoast Research -- Analyst\n\nPerfect. Thank you. And just one follow-up question just about the gross profit per unit levels. I feel like you've kind of already answered this, but I just wanted to ask it maybe in a different way.\n\nHypothetically, if ASPs fall another 5% to 10% over the next couple of quarters, either given market conditions or just changing of mix, are you guys still confident that the $2,000 to $2,200 GPU level is achievable even in that scenario? So, I just wanted to ask that more directly.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. Look, I think we feel very comfortable where we're running the retail GPUs. We'll continue to monitor the test. But look, I expect ASPs to continue to fall, which I think overall for the industry is a good thing to help drive some gap between new and late-model use.\n\nSo, we feel comfortable with where our GPUs are, and we'll continue to test.\n\nJohn Healy -- Northcoast Research -- Analyst\n\nAppreciate it. Thank you, guys.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe'll take our next question from Daniel Imbro with Stephens, Inc. Please go ahead.\n\nDaniel Imbro -- Stephens, Inc. -- Analyst\n\nThanks. Good morning. Thanks for taking our questions. I want to follow up on a question on expenses.\n\nEnrique, can you just provide some more color around really what the biggest inflationary drivers are in that other overhead cost line? I think you pulled back, you said on some of the labor in the CECs, and it's still up $40 million year over year. So, is any of that one-time increase? And then just taking a step back on expenses, I think even last quarter, we talked about one of the reasons that you want to reduce headcount too quickly is the need to hire back and that gets harder next year. But now it sounds like we're expecting a softer backdrop for the next 12-plus months. So, I guess, why not reduce expenses or headcount more quickly across other parts of the enterprise? Thanks.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYes. And what I'd say there is that we did. And so, as sales got more challenged third quarter, we went deeper into the staffing levels in the field. And so, it's still through attrition, so it is take a little bit longer.\n\nBut at the same time, we did lower our staffing targets to reflect the current sales environment. So, I'd tell you, we did go deeper into managing those expenses. And in regards to your first question, I think you're asking about the other expense line and what goes in there because it was a 41% increase if you just look at the release, right? That is primarily because we're comping over the $23 million settlement that we had last year. If you back that out, you're looking at less than half of that of an increase.\n\nAnd what that really is attributed to is our investments in technology and product, right? And that's what that's attributed to. What I'd tell you, though, as well, if you compare it to prior quarters, there's a reduction in the pace of that investment from a year-over-year standpoint. And so, we've been pulling back there as well. You also see that manifested in our capex guidance for this year.\n\nWe've taken that down from 500 million to 450 million. The largest chunk of that decrease really comes from kind of slowing down in some of those projects. In addition to just slowing down some of the capacity initiatives that we have out there in terms of growing our capacity. With lower volume, you know, we're just slowing down some of those investments.\n\nBill Nash -- President and Chief Executive Officer\n\nAnd, Daniel, the only thing I would add there is, look, we're -- and our culture is one that's a people-first mindset. Our people are the reason for our success. And that's the reason we've chosen to allow attrition to get us to where we need to be. We'll, obviously, continue to monitor the situation, but we're very comfortable with allowing attrition to get us to where we need to be.\n\nDaniel Imbro -- Stephens, Inc. -- Analyst\n\nGot it. I'll stick with one question. Hop back in the queue for a follow-up. Thanks.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nThank you.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We'll take our next question from John Murphy with Bank of America. Please go ahead.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nGood morning, guys. I just wanted to focus sort of on the supply side here just for a second. I mean, when we think about the one to six-year-old car fleet, that's going to continue to probably strengthen for the next couple of years. Competition is more focused on them, Bill, as you mentioned, in the dealer.\n\nSo, it seems like the available one to six-year-old car fleet is supply is going to continue to shrink. But certainly, what's available to you and other folks in the secondary market, but you've kind of mentioned going lower in the age and price spectrum to drive volume, and you've shown an ability to kind of manage that fairly well. So, I'm just curious how fast you can move on that to potentially drive volume back up here, lower price points, but higher grosses, and maybe better returns just on the capital employed.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. Thanks for the question, John. You know, it's interesting because we're kind of living a very similar life to what we did after the '08 and '09 recession. You remember where you come out of that, and you have less newer cars, and it kind of has to work its way through.\n\nI'd tell you, we're in a better position today than we were back there just because our self-sufficiency is so high. And, you know, we'll be able to sell what consumers are looking for, and we're going to be able to get that really in a better way than we could after '08, '09 because our self-sufficiency is so high. In my opening comments, one of the reasons our buys were down so far obviously, depreciation was the biggest lever, but there's also -- we made some decisions just to slow down buys. And so, there were retail cars that we purposely did not buy because of the risk of those cars in a highly depreciating type of market.\n\nSo, again, I'm very comfortable with where we are, and I think we're better positioned than we were in '08 and '09, and I think we did a phenomenal job in '08 and '09 navigating that period.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nBut maybe to follow up on that, Bill. I mean, how fast can you move on this to drive comps positive? I mean we understand the kind of the headwinds in sort of what was traditionally your core. I mean, this is obvious, you know it. I mean, you're going after it.\n\nI mean, when do you kind of just push and just increase maybe materially the penetration of these older vehicles to drive the volumes higher? Because I mean, the one thing that -- it's very admirable is that the variable GPU -- the focus on GPUs, which is a variable cost analysis, but you do have these fixed costs that are high, particularly as Enrique was talking about these technicians. So, you got to cover costs at some point, not -- and I mean, when can you do this? I mean, it's something you're stating to do, but you're not doing it.\n\nBill Nash -- President and Chief Executive Officer\n\nWell, when you talk about penetration of the older vehicles, look, the penetration and how much we put out there is driven by the consumer demand. And not everybody wants an older, higher-mileage type of vehicle that's less expensive. So, again, that's all driven by demand. And as we see consumers continue to demand that, we'll continue to put that out.\n\nBut again, not everybody is -- not everyone is looking for that.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nOK. So -- I mean it's really a supply -- I mean it's getting to the supply of the core product more than into push holder?\n\nBill Nash -- President and Chief Executive Officer\n\nWell, I think it's just more -- it's a bigger issue. It's just -- you have to go back to vehicle affordability. It's just keeping a lot of people on the sidelines right now. And it's not only vehicle affordability.\n\nThat's the line share, but you also have rising interest rates. If I look at CAF payments, just Tier 1 payment, just as an example, the monthly payment, which is the biggest factor on whether someone's going to decide to buy a car or not, it's up $150 year over year with the majority of that being driven by the vehicle price with a smaller piece being driven by the interest rates. And I think you've got that, which is obviously keeping people on the sidelines, not to mention just the overall inflationary pressures. And I think what we're trying to do is make sure that we've got the right amount of inventory, the right mix of inventory out there to meet the consumer demand and be very thoughtful about our margins in order to cover the costs and the way that we're taking a people-first mindset on how we approach the business.\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nOK. All right. Thank you very much. \n\nBill Nash -- President and Chief Executive Officer\n\nThanks, John.\n\nOperator\n\nAnd our next question comes from Seth Basham with Wedbush Securities. Please go ahead.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot, and good morning. Just to clarify, for this sales environment with comps continuing to trend down 20%, do you still expect SG&A to be flat to up year over year in the fourth quarter and going forward?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nNo. I mentioned that you need to back out the $23 million we got last year in the third quarter. And so, we would expect to be down year over year in the fourth quarter. Now, I guess it's a little bit tricky, Seth.\n\nAs you know, like quarter to quarter, things can happen, but our expectation is that we would be down year over year in the fourth quarter.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nOK. And how -- again, how much down? And when you think about the 20% decline persisting, when do you decide to get more aggressive on SG&A?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYeah. We're not going to provide guidance on how much down in the fourth quarter because, again, there's some variability quarter to quarter. But what I'd tell you is our expectation is that it will be down year over year. And if you look at the kind of the trend that we've been managing to, I think we've been focused on SG&A, and we've been pulling the right levers so far.\n\nNow, if business doesn't pick up and deteriorates, we have other levers we can pull, right? But for the time being, we believe we pulled the right levers. And we'll continue to manage the business prudently as we always do.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. And my follow-up question is just on the wholesale business. The wholesale to retail ratio in terms of units sold declined sharply to 66% this quarter. Would you consider this the new normal?\n\nBill Nash -- President and Chief Executive Officer\n\nNo. I consider this what you would see in a highly depreciating market. When prices are going down a lot like they have been and consumers have been told for the last year that it's the best time to sell their car, they can get more than they could have ever gotten before, there's a disconnect there. And so, as prices come down, it always drives our buy rate down.\n\nThe other thing I would just add to that is that we stepped back our appraisal advertising just given the volatility of the market. So, no, I don't consider this the new norm.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThank you, guys.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nAnd our next question comes from Sharon Zackfia with William Blair. Please go ahead.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nHi. Good morning.\n\nBill Nash -- President and Chief Executive Officer\n\nGood morning.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nGood morning. Following up on the SG&A question, I guess, is there a way to contextualize how much you've taken out year to date of SG&A and what that run rate is now in the fourth quarter because I'm assuming that those initiatives continued in the third quarter and into the fourth quarter?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYes. I think the better way to think about it, Sharon, or the best way to think about it is just the cadence, the year-over-year cadence that we've had because just always seasonality that occurs, right, quarter to quarter in our business, and that also impacts SG&A. But if you -- again, if you go back to the first half of the year, Q1, we grew SG&A 19% up year over year in the first quarter. In the second quarter, it was up 16% year over year.\n\nThis quarter, if you back out legal settlement that we got last year, we are down 1%. So, that's a significant decrease in the pace of SG&A. And so, we are focused on it. We are managing to the current environment.\n\nright? We think we're doing so appropriately. Now, if the business continues to be challenged, there's other things we can do. But for the time being, we've taken some pretty material steps to manage our SG&A.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nYeah. I think part of the confusion is the -- it sounds as if you're expecting SG&A to be down similarly like down 1% in the fiscal fourth quarter year over year, but it also sounds as if you're continuing to proactively manage SG&A. So, I think a lot of us are trying to reconcile that in our heads as to why we wouldn't see SG&A down a bit more year over year than what you saw in the third quarter, if that makes sense.\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYes. Well, we expect to continue to see SG&A kind of to go down. I think on an individual quarter, it gets a little bit challenging to give you a number that we're managing to. Many things can happen in the quarter.\n\nBut what I'd tell you is thematically and practically, we expect to continue to manage our SG&A down from a year-over-year basis.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nOK. Maybe separately, I mean, how should we think about SG&A on a full-year basis for next year? You've got a lot of moving parts. You kind of have to keep your muscle intact for a potential rebound, but at the same time, you're dealing with a very difficult macro climate. So, as we think about next year, particularly with the curtailment and the unit openings, I mean, how are you viewing SG&A dollar growth?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYeah. The way we're looking at SG&A is, you know, we've given guidance in the past, like, hey, we need 5% to 8% gross profit growth to lever. I think in this kind of environment, right, in this kind of macro backdrop, that kind of guidance is less important than what I'm about to say. So, we are actually managing, and our goal is to get to the mid-70% SG&A to gross profit, right? That is our first step on the way to improving our SG&A.\n\nNow, we're going to need gross profit growth there, right? But that is our first step. Over time, we have talked about having an operating model that's more efficient than what it used to be, and we still expect that. That's going to be over time, though. Omni transformation, and you can take a look at other retailers that have gone through it, it takes time to get to a better and more efficient operating model.\n\nBut we expect to get back to where we used to be. It's just going to take time. Our first step is to get to the mid-70% SG&A to gross profit, right? But again, we're going to need gross profit support to get there. In the meantime, we're going to continue to manage our SG&A appropriately for the market, and that's what we do.\n\nAnd you can see that's exactly what we did in the third quarter. We expect to carry that forward into the fourth quarter and into next year. And we'll be set [Inaudible]\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. And I think, Sharon, we'll also have a lot more visibility after the fourth quarter to really be able to tell you more depending on how the business does between now and then.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nOK. Thank you.\n\nBill Nash -- President and Chief Executive Officer\n\nThanks, Sharon.\n\nOperator\n\n[Operator instructions] We'll go next to Craig Kennison with Baird. Please go ahead.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nHey, good morning. Thanks for taking my question. And I'll try to hit the SG&A topic in a different way. But, you know, there's been a change in the competitive landscape, and I think it's been to your favor.\n\nAnd I'm wondering if philosophically, you could make a change in how aggressive you are with respect to SG&A, given that winning in this market may not be a sprint anymore but might truly be a marathon and allow you to throttle back more aggressively than just low single-digit percentage cuts.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. Craig, I think I think about it a little bit differently. I think similar to you, look, we have competitors that are, you know, obviously struggling. I don't think now is the time where given our financial strength, where we should be pulling back a whole bunch on SG&A.\n\nWe have pulled considerably back. But at the same time, as I talked about in my opening remarks, we also want to make sure that we're continuing to build for the future. And I think what everybody needs to remember is we don't operate this business on a quarter-to-quarter basis. We operate the business for the success over the long term, and there are some things that we're spending on that will absolutely help us in the longer term.\n\nDoes it -- does it give us a headwind for EPS right now? Absolutely. But is it the right decision for the company long term? Absolutely. So, again, I think, really, my thoughts around your question is we're going to continue to walk this fine line. We want to continue to build out the muscle.\n\nWe want to continue to fund near-term efficiencies, which we will do. And we'll continue to manage the business with a long-term view versus just a quarter-to-quarter view.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nAnd maybe just to follow-up. I mean, obviously, the stock is under significant pressure. It feels like you have the long-term philosophy, but not enough shareholders are on board with it. Is there something you can do to improve the messaging or the guidance provided to maybe reduce the amount of surprise with which your results are met?\n\nBill Nash -- President and Chief Executive Officer\n\nYeah. Well, I think the surprise is coming from macro factors to Enrique's point that we really -- those are things that you can't control. And so, what you need to focus on is what you can control. And, obviously, I think our long-term messaging is still more intact than ever.\n\nYeah, we've got some pain here in the short term. But guess what? We've seen pain before in the short term. We've seen -- if you look at market share, for example, which is a proxy for how I think success is going, if you look at market share, we've historically -- we've gained market shares. I mean even in the time where the '08, '09, we lost a little market share in the near term, but then we quickly got it back and then some more.\n\nEven if you look in the last few years, when you look back at like FY '20 when we started really rolling out our online capabilities, we saw a step-up in market share gains. Unfortunately, we went into COVID. We gave a little bit back. But the following year, we got that back plus more.\n\nNow, we're in a recessionary period. So, again, I think everybody just needs to kind of keep a perspective of what we're going after long term. And yes, the short term can be a little noisy, but the long-term message is still intact.\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nGreat. Thanks so much.\n\nBill Nash -- President and Chief Executive Officer\n\nThanks, Craig.\n\nOperator\n\nWe'll take our next question from Michael Montani with Evercore. Please go ahead.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nHey, good morning. Thanks for taking the question. Just wanted to ask a little bit more on the credit side for Jon. If you could give us some incremental color you had mentioned 2 to 2.5 is kind of normal for Tier 1.\n\nSo, what would the equivalent kind of loss ratio expectations be for Tier 2 and Tier 3? And then by way of follow-up would be, can you give some incremental color around delinquency trends and roll rates, if possible at all, by tier would be very helpful.\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nSure. Yes, right on. Thanks for the question. The 2% to 2.5% is again our targeted range.\n\nI think we've done a great job staying within there. You know, we've been in the Tier 3 business for -- since 2014. I think we've historically quoted it's basically 1% of our receivables initially. It's not 2% and, obviously, substantially higher loss rates.\n\nI think we've put often 10% of our losses when it was 1%. So, you're seeing maybe a 10 times, tenfold loss rate difference there in the Tier 3. Tier 2 is somewhere in between. It depends on where we choose to play there.\n\nThere's obviously a wide spectrum. So, hopefully, that gives you some color on how to expect losses provisioning whatever around the different buckets. Overall, macro factors and delinquencies and losses impacting our portfolio. I think it's very clear delinquencies are on the rise in the industry.\n\nThere's no doubt. You can see that within our ABS deals. We've mentioned that historically, there's certainly seeing pressure in the consumer. I think we've done a really, really strong job at working with that consumer.\n\nAnd while they might go 30, 35 days past due, helping them find solutions such that it doesn't go into a charge-off status. So, we continue to fight that good fight and work with our consumers. As Bill mentioned, obviously, monthly payments are up. I think we've done a nice job of being responsible on our lending to our consumers and helping them through it.\n\nAnd ultimately, we reserved accordingly expecting all of this. So, I think we're in a good position from a reserve standpoint. We'll watch the credit environment and the consumer very carefully. And hopefully, that answers your questions.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nMaybe can you just contrast a little bit the current delinquency experience you're seeing vis-a-vis, you know, what was happening in '07 and '08?\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nSure. Yeah. I think what you're seeing historically is -- I would say, in '07 and '08, you absolutely saw an impact across the entire credit spectrum substantially. I think what we've identified is we're seeing a little more pressure on maybe the lower credit consumer the Tier 3 into the Tier 2, maybe even the lower side of our Tier 1 space.\n\nSo, I see that definitely different. And again, I think that we're seeing delinquency pressure that hint of a challenge for the consumer, but it really is not manifesting itself into loss. Again, we're going to watch it carefully, and we'll see what happens. But you absolutely saw more of an impact across the credit spectrum and into the loss side in '08, '09.\n\nAnd again, I think that's a very different environment. We can all agree with that. The labor pressures back then versus now income for the workers. So, we'll see where it translates.\n\nBut I think those are the fundamental differences we've seen.\n\nMichael Montani -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nWe'll take our next question from Chris Bottiglieri with BNP. Please go ahead. Your line is open.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nHey, guys. Thanks for taking the question. I wanted to talk about your path to your target SG&A to gross. It sounds like it's gross profit dependent to some level, but some of the gross profit levers like service and used volumes I think are out of your control.\n\nI think it's probably fair to say. The wholesale took a pretty big step down this quarter, but you've driven significant improvement there. So, I guess my point is like where do you see the gross profit improvement coming from? Is there any reason I think that wholesale could rebound imminently?\n\nBill Nash -- President and Chief Executive Officer\n\nI think to Enrique's point earlier, it is a two-piece equation we're controlling the expense side, the gross profit. We're going to need the business to come back. We're going to need it to come back some. I think wholesale gross profit, obviously, we made some good improvement there.\n\nRetail. Actually, wholesale and retail GPUs, I think, are both strong now. It's about getting some of the volume back. I think wholesale, I'm hopeful we can grow that a little bit more.\n\nLike I said, we did some things this quarter that probably slowed that down a little bit. But I think that's where it's going to be dependent. That's going to -- that will carry some weight.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nGotcha. OK. Then a question on cash quickly. The penetration is up a ton despite like a pretty large rate hike.\n\nI'd imagine like you've been more in terms of quicker to res rates the bring your own financing jumped a bit too as well in Tier 2 and Tier 3 decline. You're also adding new partners on to the Tier 2, Tier 3 network, if I heard that correctly. So, can you talk about what you're seeing in an aggregate -- are the Tier 2 and Tier 3 tightening credit at the margin? Does your new instant appraisal tool that you add, and it sounds like it includes the partners more? Will that help drive penetration of Tier 2, 3? Just any thoughts there would be helpful.\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nYeah. All right. Let me take them sequentially here. So, just to remark on overall penetration.\n\nYes, as we mentioned in the prepared remarks, CAF penetration is up in tandem with actually us raising rates. I think that's something we're really pleased about. We know that generally, you're going to lag the market. Again, we're competing with credit unions at the higher end, but I think we've done a fantastic job at raising rates 40 basis points sequentially, 150 basis points year over year, and still capture that penetration.\n\nSo, we're pleased with that. You see the Tier 2 penetration down from last year and the Tier 3 penetration down. I think that's a combination of two things. You absolutely see the consumer challenge there.\n\nAs Bill mentioned, you're still seeing affordability issue there. But yes, absolutely, as we mentioned, lenders are being very -- what they need to do to operate independently and pull back where they need to. And I think there's the benefit of our platform. You've got a number of lenders that are going to work together to figure out what's best for them but collectively provides a good credit offer in the long run.\n\nSo, I think that's -- you definitely see pullback there. Chris, last part of your question, I think you mentioned instant -- not instant appraisal tool, but our pre-qual tool, just to clarify there, we mentioned that we're continuing to add lenders on to that tool. Again, we think it's a best-in-class tool. It requires a lot of nimbleness from our lenders.\n\nThey're all coming on board. Are we seeing engagement there? Yes, I don't know that that's necessarily driving a ton into the penetration story, albeit that tool does bring a better credit quality consumer to the application process. But -- so, does that answer your questions? What else have I missed?\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nNo. I think you got my laundry list, and thanks for correcting my misspoken -- yeah. That's what I meant was the instant -- sorry, I said it again. The financing penetration tool.\n\nThank you.\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nOK. Thanks, Chris.\n\nOperator\n\nOK. We'll take our next question from Chris Pierce with Needham. Please go ahead.\n\nChris Pierce -- Needham and Company -- Analyst\n\nGood morning. I just wanted to kind of get some color around -- you talked about competitors acting aggressively to preference units versus price where you guys kind of do the opposite. Is that positive because it means the industry is moving back to normal? Or is it a short-term negative because they're going to have fresher inventory that's going to lower your unit numbers? I'm just kind of wondering how to think about that and how that's kind of trended in the past. You've talked about seeing this before.\n\nBill Nash -- President and Chief Executive Officer\n\nYes. Yes, Chris. So, I think what you're saying is there's competitors out there that just aren't -- weren't moving any inventory, and depreciation has been very steep. And so, what they're doing is they're trying to move some of that inventory.\n\nWe've seen this in the past. In a lot of cases, it's not sustainable over the long term because you're just not making the money that you need to, but you're trying to get units moved. So, it's, again, the reason why we did the expensive price test. We wanted to see what's the elasticity.\n\nAnd we did price test both up and down. So, we did price test down. We also did price tests up just to kind of better understand it, which again, just gives us confidence that we made the right decision from a profitability standpoint.\n\nChris Pierce -- Needham and Company -- Analyst\n\nOK, thank you.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd we'll take our final question from David Whiston with Morningstar. Please go ahead.\n\nDavid Whiston -- Morningstar -- Analyst\n\nThanks. Good morning. It looks like you had a really great free cash flow generation quarter from an inventory reduction. And I'm just curious, I guess, one, can you -- how much longer can you reduce your inventory to get that free cash flow benefit you still have adequate vehicle inventory to sell? And then you paid off the revolver with some of that free cash flow.\n\nDo you also want to pay off that June '24 term loan to get some more balance sheet health and would you have that cash on hand?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nYeah. I think in this kind of environment, you know, I think having some cash on hand isn't a bad thing. And we absolutely use the really effective management of inventory. Like Bill talked about, we decreased our overall inventory year over year, but we actually increased our saleable inventory.\n\nSo, that's some impressive work by the teams to work through our WIP. And so, that was really good news. We used that cash basically, as you mentioned, to pay down the revolver this quarter, take it down to zero. We have no tap on our revolver, and at the same time, sit on some cash.\n\nI just think, David, in this kind of environment, it's not a bad thing to have some cash as well. So, it gives us ultimately the flexibility to manage through this kind of environment. And we have a really strong balance sheet and proud of it. And we have flexibility that others don't have in the industry.\n\nAnd I think that puts us in a position of strength.\n\nDavid Whiston -- Morningstar -- Analyst\n\nAnd somewhat related to the buyback pause, I do understand wanting to be prudent, but should we interpret this to mean you guys are less optimistic about maybe the short to midterm than you were three months ago?\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nWell, it's important that we run a conservative balance sheet in this kind of environment. And as I mentioned in my prepared remarks, we do look at our net leverage ratio in terms of something to manage too carefully to make sure we have ultimate flexibility when it comes to having funds and managing CAF. We do have a very large captive finance organization, and that's just a key consideration that goes into it. So, I think until the business kind of improves and just as importantly, the macro backdrop improves, I expect that we will pause the share buyback.\n\nThat being said, we remain fully committed to the share repurchase program, and we'll get back into it at the appropriate time when things improve and the outlook improves.\n\nBill Nash -- President and Chief Executive Officer\n\nYeah, David. It's less about our views have changed on things are going to get worse. It's just more about the uncertainty.\n\nDavid Whiston -- Morningstar -- Analyst\n\nYeah, I hear you. Hopefully, it's not too long a pause. I think your stock is very attractive here.\n\nBill Nash -- President and Chief Executive Officer\n\nYep. Agree.\n\nOperator\n\nThank you. We don't have any further questions at this time. I'll hand the call back over to Bill for any closing remarks.\n\nBill Nash -- President and Chief Executive Officer\n\nThank you, Ashley. Well, listen, thanks, everyone, for joining the call today and for your questions. As I said multiple times today, we believe we're well positioned to navigate this environment, and I do think we'll emerge an even stronger company. I want to thank again our associates for everything they're doing and their commitment to each other and the customer and the communities and the environment.\n\nAnd I want to wish you all a happy holiday season, and we look forward to talking again next quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid Lowenstein -- Assistant Vice President, Investor Relations\n\nBill Nash -- President and Chief Executive Officer\n\nEnrique Mayor-Mora -- Senior Vice President and Chief Financial Officer\n\nJon Daniels -- Senior Vice President, CAF Operations\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nRajat Gupta -- JPMorgan Chase and Company -- Analyst\n\nJohn Healy -- Northcoast Research -- Analyst\n\nDaniel Imbro -- Stephens, Inc. -- Analyst\n\nJohn Murphy -- Bank of America Merrill Lynch -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nCraig Kennison -- Robert W. Baird and Company -- Analyst\n\nMichael Montani -- Evercore ISI -- Analyst\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nChris Pierce -- Needham and Company -- Analyst\n\nDavid Whiston -- Morningstar -- Analyst\n\nMore KMX analysis\n\nAll earnings call transcripts"
}