{
  "companyName": "Halliburton",
  "companyTicker": "HAL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/halliburton-hal-q3-2022-earnings-call-transcript/",
  "content": "Halliburton (HAL 1.24%)\nQ3 2022 Earnings Call\nOct 25, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to Halliburton's third quarter 2022 earnings call. [Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, David Coleman, senior director of investor relations.\n\nPlease go ahead.\n\nDavid Coleman -- Head of Investor Relations\n\nHello, and thank you for joining the Halliburton third quarter 2022 conference call. We will make the recording of today's webcast available on Halliburton's website after this call. Joining me today are Jeff Miller, chairman, president and CEO; and Eric Carre, EVP and CFO. Some of today's comments may include forward-looking statements reflecting Halliburton's views about future events.\n\nThese matters involve risks and uncertainties that could cause our actual results to materially differ from our forward-looking statements. These risks are discussed in Halliburton's Form 10-K for the year ended December 31, 2021, Form 10-Q for the quarter ended June 30, 2022, recent current reports on Form 8-K and other Securities and Exchange Commission filings. We undertake no obligation to revise or update publicly any forward-looking statements for any reason. Our comments today also include non-GAAP financial measures.\n\nAdditional details and reconciliation to the most directly comparable GAAP financial measures are included in our third quarter earnings release and in the quarterly results and presentation section of our website. Now, I'll turn the call over to Jeff.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThank you, David, and good morning, everyone. Our outlook today is strong. Oil and gas supply remains tight for the foreseeable future. International market activity is accelerating and North America service capacity continues to further tighten.\n\nAs a result, pricing is moving up in both markets. Halliburton's strong third quarter results demonstrate the power of our strategy. Here are some highlights. Total company revenue increased 6% sequentially as both North America and international activity continue to expand.\n\nOperating income grew 18% compared to adjusted operating income from the second quarter with improved margin performance in both divisions. Our overall operating income margin was 16% representing 45% incremental margins over last quarter's adjusted operating income. Our completion and production division revenue increased 8% over last quarter, driven by completions activity and pricing in North America and international markets. C&P delivered operating margin of 19% in the third quarter.\n\nThe drilling and evaluation division revenue grew 3%. Operating margin of 15% increased 140 basis points sequentially and 380 basis points above the same period last year, demonstrating the earnings power and global competitiveness of our D&E business. North America revenue grew almost 9% sequentially as both drilling and completions activity improved throughout the third quarter. Pricing gains and activity increases across both divisions drove these results.\n\nInternational revenue grew 3% sequentially with improved activity in the Middle East and Latin America that more than offset the revenue decline related to exiting our Russia business. Importantly, during the third quarter, we generated similar incremental margins in both international and North America markets. Finally, we generated free cash flow of $543 million and retired $600 million of debt during the quarter. I am pleased with the third quarter results.\n\nI want to express my appreciation to the men and women of Halliburton whose hard work and dedication made these results possible. Your commitment to collaboration, safety and service quality every day make Halliburton successful. Turning to our macro outlook. Oil and gas supply remains fundamentally tight due to multiple years of underinvestment.\n\nThis tightness is apparent in historically low inventory levels, production levels well below expectations and temporary actions such as the largest ever SPR release. Against tight supply, demand for oil and gas is strong, and we believe it will remain so. While broader market volatility is clear, what we see in our business is strong and growing demand for equipment and services. There is no immediate solution to balance the world's demand for secure and reliable oil and gas against its limited supply.\n\nI believe that only multiple years of increased investment in existing and new sources of production will solve the short supply. The effective solution to short supply is conventional and unconventional, deepwater and shallow water, new and existing developments and short and long-cycle barrels. All of it. I expect progress toward increased supply will be measured in years, not months, as behavior of both operators and service companies have changed.\n\nOperators remain disciplined. Their commitments to investor returns require a measured approach to growth and investment. Service companies follow the same discipline, delivering on their commitments to investor returns and taking a measured approach to growth and investment. What I think is underappreciated is how this results in more sustainable growth and returns over a longer period of time.\n\nLet's turn now to Halliburton's performance, starting with the international markets. Our third quarter performance demonstrates the strength of our strategy to deliver profitable international growth through improved pricing, selective contract wins and the competitiveness of our technology offerings. International revenue in the third quarter for the C&P and D&E divisions grew year over year from a percentage standpoint in the high teens and mid-20s, respectively, which outpaced international rig count growth and reflects our competitiveness in all markets. Our year-over-year growth and the margin expansion demonstrated by both divisions give me confidence in the earnings power of our international business.\n\nLooking forward, I see activity increasing around the world, from the smallest to the largest countries and producers. I expect the areas of strongest growth will be the Middle East, led by Saudi Arabia, but with meaningful activity increases in the UAE, Qatar, Iraq and Kuwait. Elsewhere, Brazil, Guyana and many others have also signaled a commitment to increased activity. Throughout these markets, I am pleased with the broad adoption of our new directional drilling platform such as iCruise and EarthStar.\n\nImportantly, these broad-based activity increases serve to tighten equipment availability and drive price increases in our international business. Shifting to North America. We had a fantastic quarter. Our solid performance demonstrates our strategy to maximize value in North America.\n\nWe achieved this through improved pricing, partnering with high-quality customers and differentiated technology. Our revenue grew 9% sequentially and is up 63% over the third quarter last year. Pricing continues to improve across all product lines and completions equipment remains extremely tight across the market. Interest in e-fleets is strong and customers are pleased with the superior efficiencies, operational uptime and reduced carbon footprint of our market-leading solution.\n\nLooking into 2023. I see continued growth. The inbounds for calendar slots are stronger than I have ever seen at this point in the year. More importantly, I see increased demand for a limited set of equipment and an environment where technology and performance are increasingly valued, all perfectly set up for Halliburton to maximize value in North America.\n\nMarket consolidation, competitors that answer to public investors, disciplined customers and supply chain constraints all drive the services market that I expect to remain tight for the foreseeable future. Halliburton will continue to outperform in this market. Our best-in-class Zeus e-fleets have pumped over 20,000 hours for customers. Our e-fleet customers know that they have a field-proven technology which carries the full weight of Halliburton's expertise to build, run and optimize this next-generation equipment.\n\nAdditionally, our SmartFleet intelligent fracturing system continues to gain traction, and we expect an almost eightfold increase in stages completed this year. SmartFleet gives customers unparalleled access to data about where and how their fractures permeate, the potential for frac hits on adjacent wells and the real-time data necessary to improve completion designs. In all markets, Halliburton's strong financial performance demonstrates its strategy and action, profitable international growth, maximizing value in North America and improved asset velocity to deliver value for our shareholders today. These strategies equip us to outperform under any market conditions, but especially to maximize returns through this up cycle.\n\nExecution is at the heart of Halliburton's identity. We collaborate and engineer solutions to maximize asset value for our customers. You've seen that in action in today's results. You can hear how excited I am about Halliburton's future all around the world.\n\nThe structural demand for more oil and gas supply provides strong tailwinds for our business and Halliburton is ideally positioned to deliver improved profitability and increased returns for shareholders. Now, I will turn the call over to Eric to provide more details on our third quarter financial results Eric?\n\nEric Carre -- Chief Financial Officer\n\nThank you, Jeff, and good morning. Let me begin with a summary of our third quarter results. Total company revenue for the quarter was $5.4 billion, a 6% increase over the second quarter while operating income was $846 million, an increase of 18% over second quarter adjusted operating income. Globally, higher activity and pricing improvement supported these strong results.\n\nOperating margin for the company was 16% in the third quarter, a 164-basis-point increase over second quarter adjusted operating margin and 393 basis points over adjusted operating margin in the third quarter of 2021. Our third quarter reported net income per diluted share was $0.60, an increase of $0.11 or 22% from second quarter adjusted net income per diluted share and more than doubled the adjusted net income per diluted share for the same period last year. Beginning with our completion and production division, revenue in the third quarter was $3.1 billion, an 8% increase when compared to the second quarter while operating income was $583 million, an increase of 17% when compared to the second quarter. These results were driven by increased pressure pumping services, primarily in North America land and increased completion tool sales in Middle East Asia.\n\nIn our drilling and evaluation division, revenue in the third quarter was $2.2 billion, an increase of 3% when compared to the second quarter while operating income was $325 million, an increase of 14% when compared to the second quarter. These results were driven by improved drilling-related services in Latin America and Middle East Asia and increased project management and wireline services internationally. The exit from our Russia business negatively impacted financial results for both divisions. Moving on to geographic results.\n\nIn North America, revenue in the third quarter was $2.6 billion, a 9% increase when compared to the second quarter. This increase was primarily driven by increased pressure pumping services and drilling-related services in North America land. These increases were partially offset by decreased activity across multiple product service lines in the Gulf of Mexico. Latin America revenue in the third quarter was $841 million, an 11% increase sequentially driven by increased well construction services and project management activity in Mexico.\n\nEurope Africa revenue in the third quarter was $639 million, an 11% decrease sequentially. Almost all of this reduction was related to exiting our Russia business. Middle East Asia revenue in the third quarter was $1.2 billion, a 6% increase sequentially primarily resulting from increased completion tool sales in the Arabian Gulf and higher drilling services activity in Saudi Arabia and Southeast Asia. In the third quarter, our corporate and other expenses were $62 million, which was in line with expectations.\n\nFor the fourth quarter, we expect our corporate expense to be up slightly or roughly in line with second quarter. Net interest expense for the quarter was $93 million, a slight decrease due to higher yields on cash balances. For the fourth quarter, we expect this expense to decrease slightly due to lower debt balances. Other net expense for the quarter was $48 million, primarily related to currency losses driven by the strength of the U.S.\n\ndollar. For the fourth quarter, we expect this expense to remain approximately flat. Our normalized effective tax rate for the third quarter came in at approximately 22%. Based on our anticipated geographic earnings mix, we expect our fourth quarter effective tax rate to increase slightly.\n\nCapital expenditure for the third quarter were $251 million. We expect our full year capital expenditure to be in line with our target of 5% to 6% of revenue. Turning to cash flow. We generated $753 million of cash from operations and $543 million of free cash flow during the third quarter.\n\nWe expect full year free cash flow to be in the range of last year's free cash flow. With the latest payment of $600 million, we have now retired $2.4 billion of debt since 2020. We're quickly approaching our near-term leverage target of two times gross debt-to-EBITDA. Given our balance sheet position and strong outlook, we now have greater flexibility to increase the cash we'll return to shareholders through dividends and/or share buybacks under our existing repurchase program.\n\nNow, let me turn to the near-term outlook. In the completion and production division, we expect fourth quarter revenue to grow in the low to mid-single digits and margins to improve 50 to 100 basis points. In the drilling and evaluation division, we expect fourth quarter revenue to grow in the low to mid-single digits and margins to improve 75 to 125 basis points. I will now turn the call back to Jeff.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThanks, Eric. Let me summarize our discussion today. Halliburton's third quarter financial performance shows our strategy in action, delivering value for our shareholders. Oil and gas supply remains tight, requiring multiple years of investment.\n\nDemand for Halliburton services is strong. We will continue to execute on our strategic priorities that drive free cash flow and returns for our shareholders. And now, let's open it up for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Dave Anderson with Barclays. Your line is now open.\n\nDave Anderson -- Barclays -- Analyst\n\nHey. Good morning, Jeff.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nGood morning, Dave.\n\nDave Anderson -- Barclays -- Analyst\n\nSo first question on U.S. land. So we often hear about budget exhaustion this time of year. But you actually are saying -- you're saying you're seeing stronger inbound than ever going to year-end.\n\nI'm curious as to how those inbounds have changed. Are the inbounds more from public E&Ps versus privates? And I'm also wondering, are these customers looking for term now, with such limited equipment available? And does that get a premium?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nYeah. Look, I mean, we are certainly not seeing budget exhaustion, we remain sold out through the end of the year and into next year. So the market is strong and activity remains strong. And so as we look at what kind of inbounds are we getting, I'd say it's a mix, but it may be a little stronger toward larger companies.\n\nLet's just say it that way, just given they want to be certain they have equipment for 2023. I expect that -- in North America, the more you work -- the more you produce, the more we have to work. And I think we're seeing that play out. At term, I would say that people would like term.\n\nWe view that as we have term, but at the same time, flexibility around pricing just because I really believe, and I think it's pretty clear to us that 2023 remains extremely tight, both from an equipment standpoint, repair parts standpoint, you name it. So very encouraged about the outlook for '23 in North America.\n\nDave Anderson -- Barclays -- Analyst\n\nThat make sense. They don't lock in term right here. But shifting over to the Middle East, you talked about increased project management in the Middle East. I don't know if it's a little tricky to do.\n\nI was just curious if you could just think about all those projects collectively. Where are we on the overall kind of ramp-up? Are you kind of halfway there? Are you kind of -- do you -- are you in closer to fully ramped up? And I guess, secondarily, once you do get ramped up on these project management, is there another leg of growth out there in terms of more tenders? Or is it more likely to be follow-on potentially some upselling of these contracts. It's been a while since we've seen an upmarket in project management in Middle East.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nLook, I think that really hasn't even begun, in my view. I think we're just getting underway in terms of some of the bigger projects, discrete work starting. But I think we've got a long way to run internationally and in the Middle East in particular. And this is all consistent with sort of my earlier look on the macro in terms of -- we didn't get here overnight.\n\nWe got to where we are from a supply standpoint over eight to 10 years. And that's the kind of time frame that it takes to solve for. And I think the Middle East broadly takes a long view of this business. And as a result when they're getting traction now, but it's not a knee-jerk reaction.\n\nIt is a methodical march toward reserve extensions and adding reserves, which takes time and money. And so I am super encouraged about the outlook in the Middle East.\n\nDave Anderson -- Barclays -- Analyst\n\nThanks, Jeff.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of James West with Evercore ISI. Your line is now open.\n\nJames West -- Evercore ISI -- Analyst\n\nHey. Good morning, Jeff and Eric. \n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nGood morning, James.\n\nEric Carre -- Chief Financial Officer\n\nGood morning, James.\n\nJames West -- Evercore ISI -- Analyst\n\nJeff, I wanted to dig in a little more on the international business. Obviously, this quarter had some mixed results just given Russia coming out. But Halliburton as a company as at least I understand it and certainly you can elaborate on this, but you've spent the last -- the better part of the last three decades, really building out a superior international franchise and one that should be competitive with your major peers or your major competitor here. Is there any reason that we should think that you would underperform or that you would outperform over the next several years in the international arena, given the outlook is as strong as kind of you're alluding to and certainly what we see in the market.\n\nWe start with the Middle East, if you want, but there's also many other regions that are going to be showing really substantial growth. I'm just curious kind of how Halliburton is set up for that.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThanks, James. Look, we are extremely well set up for international expansion and have outgrown many quarters in the past and expect to continue to do so into the future based on our technology portfolio and our footprint internationally. Just for some context, Halliburton grew 21% internationally year on year while exiting Russia this quarter. And of course, this is the quarter in Russia, where we typically see the prewinter sort of step up in the 15% range.\n\nSo that wasn't there. But we're seeing strong growth and expect to continue to see that internationally. I think also important to recall, I mentioned in my comments, was the strong international incrementals, which were basically on par with North America, which continues to demonstrate not only growth, but margin expansion internationally. If I look ahead internationally, we're only halfway through our iCruise deployment.\n\nWe've got all of that left to do. So I feel -- like I said, really good. Our production business is new and on plan. And so I expect to continue growing revenue internationally and expanding margins.\n\nSo I feel really good about our international outlook, actually better than I ever have.\n\nJames West -- Evercore ISI -- Analyst\n\nOK. Well, that's a very strong statement. And perhaps to follow up on that, on the D&E side, which is an international bias, you're kind of hitting margin targets that we were anticipating for next year. So you're kind of already there.\n\nAnd do you think -- and as you see the outlook, and I know you may not want to get bogged down in specific numbers, but how do you see that progression as we go through the end of this year and into '23?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nLook, I expect to continue to see improvement. We're in the right markets. We've got an extremely competitive portfolio. All service lines are contributing to that.\n\nI think the -- when I look out, I've always said about our D&E business that we were making meaningful investments in that business, probably, started saying that four years ago. And that every year, we wanted to stack better margins on better margins, full year margin. And obviously, there's cyclicality throughout a year in weather and other stuff. But ultimately, the plan was to continue this march of stacking on better margins.\n\nAnd that's what you're seeing. And as I've already said, if we're only halfway through deployment of what I think the flagship technology is in D&E, we should continue, I expect to continue stacking those better margins up.\n\nJames West -- Evercore ISI -- Analyst\n\nPerfect. Got it. OK, thanks, Jeff.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nGot it. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Arun Jayaram with J.P. Morgan. Your line is open.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nYeah. Good morning, Jeff. I wanted to talk a little bit about the portfolio. I know one of your long-term ambitions is to grow house leverage to the production phase of the oil and gas life cycle versus just pure D&C.\n\nSo I was wondering, if you could comment where you think you're on -- where you're at in terms of that journey and how you think about your potential to grow your share in things like lift and chemicals.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nLook, I feel good about that. I mean it's all marching along as planned and we continue to grow. We're still in the very early innings of that international expansion, so call it the second inning. But it's doing exactly what we had hoped.\n\nWe continue to grow the footprint in the Middle East with lift and with chemicals. Chemicals is -- we put our first full scale production lot through the plant this month. That's an important first step. And a lot of work to do.\n\nBut again, the infrastructure is in place, and we're getting access to market and making sales. The lift bottom line, just a fantastic business in North America, and it's the same technology that we apply internationally. And so those guys are just dead focused on profitable market entries and growth and we're seeing that Latin America and in the Middle East.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nGreat. And maybe just a follow-up for Eric. Eric, you highlighted your leverage target of two times. A number of your peers have announced some return of capital, announcements Liberty, Helmerich & Payne.\n\nI was wondering, if you could maybe give us a little bit more thoughts on how you think about return of capital after reaching your deleveraging target and how you're thinking about future dividend growth versus buybacks.\n\nEric Carre -- Chief Financial Officer\n\nRight. So thanks, Arun. So what we've said for the last couple of years is that our priority No. 1 was really to get our balance sheet in order.\n\nSo with the $600 million that we have retired in Q3 that puts us at about $2.4 billion retired since 2020, $1.2 billion retired this year alone. So if you combine that with our improved business performance for all practical purposes, we are at our target and considering as well our positive outlook we see no reason for that to change. So really big picture, we're starting to turn our attention now to returning more cash to shareholders. So we're working through scenarios.\n\nWe are engaging our board, so more details to come.\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks a lot.\n\nOperator\n\nThank you. Our next question comes from the line of Chase Mulvehill with Bank of America. Your line is now open.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning, everybody. So I guess, first, I kind of want to hit on margins. And if we kind of look at how your pre-shale margins, so call it 2011 and maybe going all the way back to kind of 2006 and 2008 time frame, you did mid to high 20% EBITDA margins.\n\nToday, you're sitting in the low 20s. So Jeff, I don't -- could you just kind of walk us through what would need to happen to get back to these type of margins and whether you even think that this is possible to kind of get back to those type of margin levels in this cycle?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nLook, I think the key thing about this cycle is it's duration and it's the right kind of cycle from a duration standpoint that I think we grow into better margins as we continue forward. So I'm not going to try to put a date or a time, but my expectation is the duration of the market, sort of the behavior that I described to both operators and service companies, which is absolutely rational in terms of returning cash to shareholders, which is what Eric just talked about. This is the kind of cycle where we're able to do that. And I think setting up for margin improvement, the EBITDA strengthening, all of those are the things that create the free cash flow.\n\nAnd I think that historically, actually, I really haven't seen the cycle set up where we've got short supply the way that we do and the sort of runway that I see in front of us and all of the right sort of motivation by the industry. I think energy is a fantastic industry. And I think what you're going to see is the demonstration from the entire industry of what returning cash to shareholders and generating meaningful returns look like over a good cycle, long cycle.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. Just to follow up on international markets. Could you just talk about how tight the markets are today, what kind of pricing momentum that you're seeing? And when you think about idled or spare capacity across international markets, at least for Halliburton, do you see an opportunity to continue to kind of mobilize the tighter markets or do you have a lot less spare capacity? And what did that mean for capex for next year on the international side?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nWell, from a capex standpoint, we've already described that we're in the 5% to 6% range of revenues on capex. So what we do is deploy capital to the best opportunities, which international markets demonstrate important opportunity, so we would direct capital that way as opposed to others. But I think what's important about the market is we are just seeing customer urgency return in the sense that quality matters equipment matters. Is it tight, yes, it's tight.\n\nI don't think there's a lot of spare capacity anywhere in the world. If I go back to our strategic tenants, it's profitable growth internationally and asset velocity. And I think what you see is that asset velocity being baked into just the way that we work is creating the ability to do a lot more with less than we ever have in the past. And that's one of the key reasons we're confident in our capital spend levels is because of the type of equipment we're putting in the market, its ability to be moved around, work longer, repair faster.\n\nAnd when we do all of those things, it just makes us a much better effective business internationally.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. All right. I appreciate the color. I'll turn it back over.\n\nThanks, Jeff.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. Our next question comes from Neil Mehta with Goldman Sachs. Your line is now open.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYeah. Good morning, team. The first question was around North America. You mentioned that you continue to see revenue growth in North America and that there is increased demand for a limited set of equipment.\n\nCan you talk about what the moving pieces are there? What kind of types of equipment are we talking about? And how do you think about adding frac capacity? Is there a demand for it as you look out in the market into '23?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nWell, the activity we really see is let's just describe it as service intensity, which is increasing, and that's more reps on equipment, more sand through equipment. We're also seeing our drilling activity in the U.S. as well. So all services related to D&E.\n\nBut principally, frac. And so as it works harder, it grow -- I mean, that generates more value for us. And so that's probably the principal thing. When I think about capacity, we're maximizing value in North America, and we're growing profitably internationally.\n\nAnd that automatically balances where we spend our money and how we approach markets. North America from a capacity standpoint for us, really, we look at e-fleets and it's not really capacity, I view it as replacement over different time horizons. But we -- the conversations, for example, that we're having about e-fleets are not anything really immediate. It's all around late '23, '24, '25 in terms of e-fleet additions.\n\nAnd so that will likely wind up replacing equipment over time. Yeah, so I'm really encouraged about where the market goes. It's extremely tight. It's tight for repair parts, it's tight for just everything, and we've all talked about sort of bottlenecks in the supply chain.\n\nI know that's really going to rectify itself over any sort of short horizon. So I think that under all conditions, North America is tight. I don't think capacity could be added in a meaningful way even if it was desired.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nYeah, that's great perspective. And then just some early thoughts on '23 in terms of what you're hearing from customers in terms of activity? And any early thoughts around what you expect spending increases to be both in the U.S. and internationally as a percentage? And how much do you think inflation will be as a component of that increase?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nLook, I think we've got strong growth as we look into next year. Really, we don't haven't even seen budgets from customers, but expect that growth to be strong. Clearly, we're going to be up from here, I guess, is how I would describe next year up from where we are today. And obviously, that's really strong growth that we've seen over the last year.\n\nSo I think that the North America demand continues to increase. And internationally, we've already talked quite a bit about that, but I expect that we'll see growth really everywhere in the sense that customers can be busy, they will be busy. I think the traction in the Middle East is just getting underway. And I think that we'll continue to see a tightening.\n\nAnd I continue to view this as a margin cycle as opposed to necessarily -- it's not a build cycle, it's a margin cycle. And I think that we're going to be the real beneficiaries of that at Halliburton.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nThank you.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Scott Gruber with Citi. Your line is now open.\n\nScott Gruber -- Citi -- Analyst\n\nYes. Good morning.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nGood morning, Scott.\n\nEric Carre -- Chief Financial Officer\n\nGood morning.\n\nScott Gruber -- Citi -- Analyst\n\nThe smaller pumpers here domestically have discussed replacing about 10% of their fleet annually, generally with e-frac additions. As we think about Halliburton, is that a rough guide for you all, assuming returns stay positive? Or do you have a different framework? How do you think about that kind of multiyear replacement cycle?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nYeah. Look, what we're seeing -- we have a healthy fleet today and we have a healthy fleet because we've always reinvested in our fleet through thick and thin. I mean, at the worst of the market, the best of the market, we're always maintaining a replacement cycle for equipment, and we get the benefit of that all of the time. When I look at the market, I have feedback from a customer recently that a lot of the equipment out there looks just dead on its feet, don't know how to get it replaced fast enough.\n\nI think that the pace at which we're working, what comes with the service intensity I described for frac equipment is just more revolutions and you can't meet physics. And so I think that when we look at replacement cycle, we view it as an electric replacement cycle. And so we've focused on that. We've got leading technology.\n\nAnd we're seeing strong pull from our customers for that technology. And so what we're doing is [Audio gap] Demand and pull translates into contracts of duration that return capital and cost -- margin and capital, the actual return of capital all happen inside the same contract. And that demonstrates for me, the strength of the technology and also what that pull looks like. But it's not something we rush to do.\n\nIt's something we do as the pull is adequate to sign that equipment up and it's going to be over a period of time.\n\nScott Gruber -- Citi -- Analyst\n\nGot it. I appreciate the color. And then turning back to the international markets. You had impressive growth internationally, even without Russia this quarter, as you highlighted.\n\nWe had a few inbounds though this morning trying to ascertain exactly what the international growth was year on year, excluding Russia. I apologize if you mentioned that number earlier, I may have missed it. But are you able to share with us what that growth was?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nYeah, it's 21% year-on-year international growth.\n\nScott Gruber -- Citi -- Analyst\n\nWas that inclusive of the -- of Russia or excluding Russia?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThat's excluding -- well, Russia, while we had Russia and excluding Russia for the last quarter.\n\nEric Carre -- Chief Financial Officer\n\nWith Russia in H1 and without Russia in Q3.\n\nScott Gruber -- Citi -- Analyst\n\nRight. Do you have the number outside of Russia, how quickly you guys grew year on year?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThat, I don't know. But it would have been substantially -- it would have been more.\n\nScott Gruber -- Citi -- Analyst\n\nOK. I could follow up. OK, thank you.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThanks, Scott.\n\nOperator\n\nThank you. Our next question comes from the line of Stephen Gengaro with Stifel. Your line is now open.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nThanks. Good morning, gentlemen. \n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nGood morning, Stephen.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nTwo things for me. One, just from a North American perspective, how are the conversations with customers about price? I mean, obviously, pricing has been improving for a while now. Is there a pushback yet? How do the conversations go as far as 2023 pricing for frac? And how do you think that plays out as you go forward?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nLook, I'm absolutely not going to get into details around price discussions with customers. Look, I think that I've already said, I view that pricing strengthens. We're still below pre-pandemic levels in terms of pricing, so there's room to improve there. Service quality and technology are both driving premiums.\n\nI've talked about sort of pull on e-fleets and just general performance and maintenance of the fleet. Pricing is always going to be iterative. It's not giant steps. It's what I talked about like throughout the year that gets us to where we are today.\n\nAnd I think there's a lot of power in having a structurally advantaged low emissions fleet, which is what we have out there today. Yeah, I think that one of the things that was left out of the conversation is securing capacity for 2023, reliable capacity, obviously, Halliburton we -- we're the execution company, we do what we say. And so we're very reliable in terms of delivery. And I think securing that kind of capacity for '23 is a high priority for our customers.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nAnd just as a follow-up, do you see -- is there a gap? And how much in conversations the sort of cost of diesel relative to the lower cost of running e-fleets play into either the gap in price or the conversations about pricing?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nAgain, ignoring price, the conversation around the e-fleets is really that it's a better mousetrap over the long run. Is it more efficient to operate? Yes, it is. It should -- it creates value from a price standpoint, but it also creates value from an effectiveness standpoint, the ability to pump. These fleets are extremely reliable.\n\nAnd then we took one out of the box and it pumped 500 hours first month. I mean that's the type of reliability we're seeing out of the equipment. So I think all of that conspires to make it sought after in the marketplace. That's why we see the pulse.\n\nIs cost a component? It probably is. I'm sure it is for our clients. It always is. But I think it would be wrong to ignore the other components of value there.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. OK, thank you.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Roger Read with Wells Fargo. Your line is now open.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nYeah. Thank you. Good morning. I guess I'd like to ask the question a little bit differently on the capacity versus investment and tightness of new equipment, spare parts and everything, as you said, Jeff.\n\nBut if we were to look at maybe work you've turned down in North America or contracts that you either don't want to bid on internationally or bid maybe less aggressively. Has there been any change in that as we look across the course of '22 and maybe what you're seeing for the early parts of '23.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nIt would be returning more not less in terms of -- that's part of how we improve margins on the overall portfolio and returns. But we've been really consistent about our strategy and maximizing value in North America, growing profitably internationally. And that is one of the key levers that we have to do both of those things. And so yes, we've done both of those.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nYes. But I guess I'm just wondering, I mean, you're turning down more not less. Is it a material amount at this point? Or is it still pretty much just on the margin you see a project that's not interesting or enticing?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nLook, I think that it's -- clearly, it's -- I don't know how to describe that is that at the margin, it's probably at the margin but it is going to grow as the market continues to get tighter. We are building, I've already described, our capex and so we will be adding. We've been able to grow with the capex levels that we've had. I'd say, meaningfully, over the last year and expect that we will continue to grow because of the way that we're building equipment.\n\nSo it's not we're turning everything down by any means. But I think it's an important point that we are much more -- I mean, the contracts that we pursue and win are accretive to what we're doing and if they're not, then they probably fall out of the list because we want to -- even the new capital that we would add, whether it's drilling equipment or anything else that's going to go toward things that are of higher value.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nYeah, it makes sense. Glad to hear there's better selectivity out there. And then my other question was to follow up. You mentioned tight for kind of everything in terms of new equipment, spare parts, etc.\n\nI know you're very integrated on the pressure pumping side in terms of manufacturing. But as you work with subcontracts, are you trying to do anything different in terms of helping them increase capacity? Or are we just the system is tight and there's not really much prospect for change in terms of -- I'm just thinking the supply chain all the way down on the types of equipment where you want to expand or where there's a relatively high maintenance component?\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nLook, it will get fixed over time. But in most of these cases, there's not a lot that can be done to accelerate their supply chain when it's far reaching. Clearly, we plan ahead, and we've been planning ahead for over a year. We've got great visibility, but that market will just be tight for spare parts and equipment.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nAll right. Appreciate it. Thank you.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nAll right. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Marc Bianchi with Cowen. Your line is now open. Marc Bianchi with Cowen, your line is now open.\n\nPlease check your mute button. Thank you. And I'm currently showing no further questions at this time. I'd like to turn the call back over to Jeff Miller for closing remarks.\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nYeah. Thank you, Shannon, and thank you all for participating in today's call. Just let me summarize with a few key points. Halliburton's strong third quarter performance shows our strategy is delivering value for our shareholders.\n\nOil and gas supply, shortness -- constraints and shortages I see today create strong and growing demand for Halliburton's equipment and services in support of this multiyear up-cycle. At Halliburton, we will continue to execute on our strategic priorities to drive free cash flow and support of this multi-year. Looking forward to speaking with you again next quarter. Please close out the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid Coleman -- Head of Investor Relations\n\nJeff Miller -- Chairman, President, and Chief Executive Officer\n\nEric Carre -- Chief Financial Officer\n\nDave Anderson -- Barclays -- Analyst\n\nJames West -- Evercore ISI -- Analyst\n\nArun Jayaram -- JPMorgan Chase and Company -- Analyst\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nScott Gruber -- Citi -- Analyst\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nMore HAL analysis\n\nAll earnings call transcripts"
}