{
  "companyName": "Upstart Holdings, Inc.",
  "companyTicker": "UPST",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/upstart-holdings-inc-upst-q2-2022-earnings-call-tr/",
  "content": "Upstart Holdings, Inc. (UPST 0.46%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Upstart Q2 2022 earnings call. [Operator instructions] At this time, I would like to turn the conference over to Jason Schmidt, head of investor relations. Please go ahead, sir.\n\nJason Schmidt -- Head of Investor Relations\n\nGood afternoon, and thank you for joining us on today's conference call to discuss Upstart's second quarter 2022 financial results. With us on today's call are Dave Girouard, Upstart's chief executive officer; and Sanjay Datta, our chief financial officer. Before we begin, I want to remind you that shortly after the market closed today, Upstart issued a press release announcing its second quarter 2022 financial results and published an investor relations presentation and credit FAQ. All are available on our investor relations website, ir.upstart.com.\n\nDuring the call, we will make forward-looking statements, such as guidance for the third quarter of 2022, related to our business and our plans to expand our platform in the future. These statements are based on our current expectations and information available as of today and are subject to a variety of risks, uncertainties, and assumptions. Actual results may differ materially as a result of various risk factors that have been described in our filings with the SEC. As a result, we caution you against placing undue reliance on these forward-looking statements.\n\nWe assume no obligation to update any forward-looking statements as a result of new information future events, except as required by law. In addition, during today's call, unless otherwise stated, references to our results are provided as non-GAAP financial measures and are reconciled to our results, which can be found in the earnings release and supplemental tables. To ensure that we have addressed as many analyst questions as possible during the call, we request that you please limit yourself to one initial question and one follow-up. Later this quarter, Upstart will be participating in the Goldman Sachs Communacopia Plus Technology Conference, September 13th; and the Piper Sandler Growth Frontiers Conference, September 14th.\n\nNow, I'd like to turn it over to Dave Girouard, CEO of Upstart.\n\nDave Girouard -- Chief Executive Officer\n\nGood afternoon, everyone. Thank you for joining us on our earnings call covering our second quarter 2022 results. I'm Dave Girouard, co-founder and CEO of Upstart. Today, we reported a decline in revenues, which is obviously disappointing and unacceptable to us.\n\nI want to explain where this decline came from and what we're doing to address it. It may be natural for you to question whether Upstart's AI-powered risk models aren't working as designed. But we're confident this isn't the case; that, in fact, our models continue to improve with respect to accuracy and risk separation. But there's no getting around the fact that a decline in revenues is a business problem that we need to address.\n\nAnd today, we'll share with you the actions we're taking to address it. Today, Sanjay and I will discuss a variety of topics, including credit performance, loan funding, lending partner sentiment, and some of the actions we're taking right now to make sure Upstart's future is bright. I also want to share with you the progress we've made in many important aspects of our business and how they're setting the stage once again for Upstart's growth in the future. I don't want to spend too much time restating what you've already heard about the current economic climate.\n\nGiven the nature of our product and our borrower, we do, however, have a unique lens into what's transpired in the last two plus years and what may transpire in the coming months and years. We believe we're at the end of a unique economic cycle related to the pandemic that included two distinct phases. The first phase was triggered by a pandemic-constrained consumer spending and unprecedented government stimulus throughout 2020 and early 2021. This together drove significant improvements in consumer savings level and liquidity, which, in turn, led to dramatic overperformance of credit during this phase.\n\nOur platform experienced about a 50% reduction in credit defaults compared to the pre-COVID timeframe. In the second phase, toward the end of 2021 and into 2022, this effect began to unwind as stimulus was discontinued and consumers began to travel, dine out, and spend once again. And as expected, default rates returned to pre-COVID levels, or in some cases, even higher. While virtually all consumers benefited financially from reduced spending during the early stages of the pandemic, this cycle was concentrated in consumers who received government stimulus checks, a demographic which is also more likely to be Upstart borrowers.\n\nOur risk models largely captured these effects and performed admirably, though not perfectly, throughout. I'll get to that in a bit. We believe we're now at the end of the two-phase cycle. And an important question for all of us is what's next? Will efforts to slow inflation lead to recession and unemployment? While no one knows the future, we do expect a significant slowing of the economy and a worse-than-normal macro for the next year and beyond.\n\nWe'll speak to that as well. Our job through all of this is to ensure the future of our platform and to protect Upstart's ability to pursue our mission for years to come. Alongside our earnings release, we today shared some responses to two important questions regarding credit performance on Upstart's platform. It goes without saying that measuring credit performance is vital, and it's also nontrivial.\n\nComparing one platform to another can be challenging: different products, different borrowers, different return targets, months on book, prepayments, hardship policies, and more. There's no simple apples-to-apples comparison. We believe the central measurement for credit performance is actual dollar returns compared to the lenders or institutional investors' target at the time of origination, full stop. And today, we provide this information for all Upstart cohorts going back to the beginning of 2018.\n\nThe bottom line is this. Our 70-plus bank and credit union partners, who typically retain loans in the lower risk rates appropriate to their businesses have seen to-date portfolios consistently meet or exceed expectations since the program began in 2018 and however institutional loan buyers done against a target of approximately 8% growth return since Q1 2018. Institutional buyers have so far seen 12 quarterly vintages overperform, with five expected to underperform. It's important to highlight that a loan buyer who invested equally in all cohorts since Q1 2018 would have experienced a positive return on all vintages thus far, with an overall 9.8 gross annualized return.\n\nThis compares to a return of less than 3% in the U.S. high yield bond index over that same period. Lastly, we believe it's not reasonable to expect above-target loan performance irrespective of the economic cycle. So, it's fundamentally important to separate the impact of macro conditions from imperfections in a credit model.\n\nThe essential litmus test for model performance is separation of high- and low-risk borrowers. As demonstrated in the last rate by grade and AUC metrics we shared today, our model is positively differentiated in this respect, and it continues to improve. In an effort to deliver unparalleled transparency and analytics, we will provide this detailed information to each of our lenders and loan buyers. Today, we're in a funding-constrained environment, which is the primary cause of our revenue shortfall.\n\nI want to share some thoughts on this situation and actions were taking to address it. First, as we have said recently, our goal is to operate as a marketplace for credit over the long run. We want loan transactions to take place when they make sense for the borrower and the lender. And certainly, lending is a category which we expect to experience some volatility over time due to macroeconomic factors.\n\nHaving said that, in the last few months, lenders and institutional credit investors reacted more quickly and abruptly than we anticipated. Despite the fact that our bank partners have seen consistently strong credit performing, meaning portfolios performing at or above plan across quarterly cohorts, several of them have paused or reduced originations due to fear about the future of the economy. To be clear, these lenders and institutional investors have not left Upstart's platforms, but have temporarily paused or reduced their originations. As we shared in our credit performance FAQ today, we believe our models are well-calibrated to the current economic environment and, in fact, include a generous accommodation for a recession over the next 18 to 24 months.\n\nAnd given funding constraints, we believe the opportunity for lenders to generate strong returns on Upstart is unusually high right now. Yet, the reaction of lenders is often binary in nature, more so than we would have anticipated. As a result, we concluded that we need to upgrade and improve the funding side of our marketplace, bringing a significant amount of committed capital on board from partners who will invest consistently through cycles. We're currently evaluating a variety of opportunities to do just that.\n\nSo, we expect this will take some time to bring to fruition. Furthermore, while we continue to believe that it doesn't make sense for Upstart to become a bank. We've decided it may make sense to, at times, leverage our own balance sheet as a transitional bridge to this committed funding. I acknowledge that this is a shift relative to what we planned and communicated earlier this year.\n\nBut a changing and volatile environment suggests we need to be flexible and responsive in our approach. We're taking this step for a few reasons. First, there's an obvious information asymmetry where we understand better than anybody how our model is performing today and how well it's calibrated for the current economic environment. Secondly, we believe the opportunity to generate outsized profits on our platform is unusually high right now.\n\nAnd third, we can bring a level of stability to our business that's important to our longer term goals while we work to put these committed capital structures in place. Sanjay will share some more about this in his remarks shortly. I want to also highlight that we're building a business that can survive and thrive through a variety of market conditions to make sure we achieve these ambitious long-term goals. Our fixed costs are low and our gross margins are strong, so we can continue to invest in our roadmap and in our future through a variety of macro environments.\n\nWe continue to make rapid progress in the newer parts of our business, and we're optimistic that this progress is setting up the next stage of growth for Upstart, which I'm sure you're all looking forward to. First, we continue to add new vendors to our marketplace with a total of 71 banks and credit unions as of today, up from 57 when we last spoke to you in May. Despite the cautionary outlook in the financial services industry, forward-thinking banks and credit unions continue to choose Upstart. We now have 640 dealerships using Upstart Auto Retail software.\n\nAnd just a few weeks ago, industry analyst automotive market data declared that Upstart was the nation's fastest-growing auto retail software provider. In the second quarter, Subaru and VW were the latest OEMs that announced support for Upstart Auto Retail, joining Toyota, Lexus, Mitsubishi, and Kia, as well as top-franchised dealers from 37 brands, including Ford, Honda, and BMW. We also extended our auto retail lending product, up to 29 dealerships and saw the first $10 million in retail loan originations in the second quarter. In just the last couple of weeks, we merged our machine-learning model for automated income verification, originally developed for our personal loan product into our auto retail lending flow.\n\nWe expect this improvement to more than double the percent of applicants for whom we can now automatically verify their income. I'm also pleased to announce that we quietly launched our small business loan product at the end of June, well ahead of schedule. We've already seen some more than 40 small business loans originated totaling more than $1 million in principal in just a few weeks. That team is quickly ironing out operational issues with an eye toward rapidly expanding this product in the coming months and years.\n\nLastly, the small-dollar loan team launched support for Spanish-speaking applicants, another giant step toward serving those left out of the country's mainstream financial system. Some of you have questioned whether Upstart veered too quickly into lending to riskier borrowers in 2021 in order to grow in our post IPO phase. But I believe we have done exactly what we set out to do and what we said we would do. Upstart's mission is and has been to leverage modern technology and data science to improve access to affordable credit.\n\nThere are tens of millions of Americans who deserve access to reasonably priced credit from our nation's banking system, yet are denied access through no fault of their own. We're unique among our fintech peers in that we aim to tackle this problem directly. The terms nonprime, near prime, and subprime; these are words the industry invented to describe people that our current systems don't understand. The truth is that the vast majority of these Americans are entirely creditworthy.\n\nUpstart's mission is to identify those borrowers and provide them with access to affordable credit. And we haven't wavered from that challenge. How does growth fit in? We approach our business as a waterfall of priorities, in a way analogous to structured credit. Upstart's highest priority, our A bond, if you will, is credit quality.\n\nOur goal is to reliably deliver the return the lender or investor expects for a specific allocation of risk. Our B bond, or next highest priority, is unit economics or gross profits. We don't strive for loan transactions that lose money for Upstart and generally seek to avoid them. And finally, whatever is left over goes to platform transaction growth; our residual, so to speak.\n\nIn truth, growth isn't a specific target for us. It's a plug based on our waterfall of priorities. The reasons for this ordering are clear. Without strong credit performance and solid unit economics, growth over the long term would be unsustainable.\n\nTo close, I want to acknowledge that we've experienced some setbacks in our business, but our fundamental economic engine is strong. Our risk models are better than ever, and I'm confident that we'll be on the growth path again soon. We're taking decisive action to bring committed capital to Upstart. And to those who say that we should focus on the traditionally prime market, I see that there are plenty of others focused on that.\n\nImproving access to credit for all Americans is too important to go ignored, and Upstart has the right stuff to get it done. Thank you. And I would like to turn it over to Sanjay, our chief financial officer, to walk through our Q2 financial results and guidance. Sanjay.\n\nSanjay Datta -- Chief Financial Officer\n\nThank you, Dave, and thanks to, everyone, for joining. The environment we're operating in has continued to evolve rapidly since the previous call. Industry data shows a general rise in delinquencies across all segments of unsecured credit, disproportionately impacting the higher risk tiers that is comprised a significant component of our borrower base. The impact of this dynamic on the credit performance of Upstart loans can be seen in the supplemental credit performance information that was released today together with our investor materials.\n\nThe macro uncertainty and the impact of economic stress on consumer delinquencies have led to a decrease in available funding for loans on our platform, which has become the operating constraint of the business. While today's results are in line with the preliminary numbers we pre-announced on July 7th, I will quickly call out the key financial headlines. On the top line, origination volumes and revenue from fees were both down from last quarter and below our internal expectations,π driven primarily by funding constraints in the capital markets. While profitability was also below guidance.\n\nWe began to systematically improve unit economics in the second half of the quarter and have pivoted to optimizing for in quarter cash flow generation, which will carry over into our third quarter contribution margin. Following our recent share repurchase authorization, we have repurchased approximately 4.4 million shares of Upstart, totaling $150 million in repurchases. Additionally, we saw the meaningful amount of the loan assets from our balance sheet in Q2 in order to fortify our cash position. With these dynamics in mind, here now is a more detailed summary of our numbers.\n\nNet revenues in Q2 came in at $228 million, up 18% year over year. Revenue from fees constituted $258 million of that amount, representing 113% of overall revenue and up 38% year over year, but down sequentially 18%. Net interest income was a negative component of net revenue this quarter as we entered into multiple loan sale transactions, some of which incurred a negative fair value impact and as the valuation marks of our remaining loans continued to be negatively impacted by the rising interest rate environment. The volume of loan transactions across our platform in Q2 was approximately 321,000 loans, up 12% year over year and representing over 233,000 new borrowers.\n\nAverage loan size was up 5% over last quarter, largely owing to auto loans representing a higher proportion of the mix. Our contribution margin, a non-GAAP metric, which we define as revenue from fees minus variable costs for borrower acquisition, verification, and servicing was flat sequentially at 47% and 200 basis points ahead of guidance. Without the inclusion of the fledgling auto loan volume, our contribution margin for core personal lending would have risen to 51%. As we optimize our fees and marketing spend for lower near-term volumes, we expect that unit economics will continue to show meaningful sequential improvement.\n\nOperating expenses were $260 million in Q2, down 5% sequentially. We reduced our sales and marketing by 21% sequentially as we downsized our marketing campaigns to reflect our constrained funding supply. Engineering and product development grew 14% sequentially and remains our priority area of investment. Although by the end of the quarter we had slowed down hiring significantly and concentrated most of the remaining hires into key technical roles.\n\nGrowth in general and administrative spend grew 8% sequentially. Taken together, these components resulted in Q2 gap net income of negative $29.9 million. Adjusted EBITDA of $5.5 million contracted 91% Q-on-Q. Adjusted earnings per share for Q2 was $0.01 based on a diluted weighted average share count of 93.3 million.\n\nWe ended the quarter with $790 million in unrestricted cash, mostly up from $758 million in Q1. Our balance of loans at the end of the quarter was $624 million, of which $484 million represented R&D loans, principally in the auto segment. While our balance of poor personal loans at $140 million was only marginally down from Q1, we did sell a significant number of the loans that it accumulated on our balance sheet subsequent to the end of Q1, but prior to our earnings call in May. Earlier today, we published some key data regarding the credit performance of Upstart loans.\n\nJust to recap a couple of the key points. Our models continue to provide around five times the amount of risk separation than a credit score, and the statistical accuracy of our models continues to improve. This has not changed. Most vintages from 2021 will underperform their return targets.\n\nThis volatility comes on the heels of vintages' significantly overperforming targets for 12 consecutive quarters. Despite this latest volatility, an investor who invested equally across all Upstart cohorts would expect a 9.8% unleveraged gross annualized return. Notwithstanding the performance of the credits, we must confront the fact that the largely uncommitted nature of our third-party funding has proven inadequate to the task of navigating the current market turbulence. And we have turned our efforts toward building a more resilient funding model over time.\n\nDespite not having suffered any adverse loan performance, some banks are moving to limit their overall exposure to unsecured lending. Investors who have earned significant excess returns during the benign cycle over the past few years are now anxious over the state of the economy and weary over the future prospects of less affluent borrowers who have been the most impacted by the termination of the stimulus. Despite significant conservatism in our current underwriting and the prospect of historically high returns, investors have been reluctant to reenter the fray. Consequently, our intention is to significantly increase the fraction of forward committed capital deployed on our platform through partnerships with investors that are comfortable investing through cycles with an eye toward longer-term outcomes and in exchange for predictable future access to yield.\n\nAs Dave has said, this will not happen overnight. In the interim, we are prepared to be more proactive with our own balance sheet operations if we deem it necessary to provide a level of stability for the business in this transitional period, as well as to demonstrate our own confidence in the models to the funding markets. Please note that this does not represent a change in permanent strategy, and we continue to maintain the view that it is not in our long-term interest to run a large balance sheet or to become a bank. However, in the context of the current extenuating circumstances, we will be flexible in determining whether a temporary change in tactics and balance sheet usage would be in the best interests of supporting the business through to its next date.\n\nGiven the volatility of the current funding environment and the difficulty in forecasting the timing of change in macro sentiment, we feel it is prudent to limit our guidance for now to the coming quarter and withdraw prior full year guidance. With that for Q3 of 2022, we are expecting revenues of approximately $170 million, representing a year-over-year contraction of 26%; contribution margin of approximately 59%; net income of approximately negative $42 million; adjusted net income of approximately negative $9 million; adjusted EBITDA of approximately zero; and a diluted weighted average share count of approximately 85.5 million shares. Our gratitude and admiration once again to all the folks at Upstart who are remaining resilient through the choppy waters that we are currently navigating as a company and remain as focused and with as much conviction as ever about the purpose and opportunity before us. With that, Dave and I are now happy to open the call to any questions.\n\nOperator, back to you.\n\nOperator\n\n[Operator instructions] And we will go first to Simon Clinch with Atlantic Equities.\n\nSimon Clinch -- Atlantic Equities -- Analyst\n\nHi, everyone. Thanks for taking my question. I was wondering. Dave or Sanjay, if you could talk a little bit more about what -- how you actually go about refocusing your institutional buyer -- investor base to sort of longer-term investors.\n\nAnd I guess, you know, how long that might take in a sense of, you know, the steps that you need to take to achieve that goal?\n\nDave Girouard -- Chief Executive Officer\n\nHi there. Sure. This is Dave. I'll give a quick answer, and then Sanjay may want to chime in.\n\nSure. So, essentially, you know, the nature of our agreements today, by and large, are at-will agreements with a volume that anybody, in particular, entity, is originating or purchasing is decided on a month-by-month basis. And we're talking about instead about structures where there's committed funding over a significant period of time, many, many months, or even years. And, really, that's, you know, in return in some form for access to yield over that period of time in some form of economics that makes sense for those entities.\n\nSo, we don't have more specifics to share than that, other than -- and, certainly, I think a lot of marketplace businesses in many different types of industries take actions to secure -- effectively secure inventory on their platforms one way or another. And we've decided this is just necessary for us. And so, we're beginning the steps toward taking, you know, getting that done.\n\nSanjay Datta -- Chief Financial Officer\n\nYeah. I'll just add, Dave that -- this is Sanjay. I think that we have demonstrated and will be able to demonstrate, certainly, as we go through this cycle, pretty attractive long-term yields for anyone who's willing to hold an investor cycle. And Dave cited some of those numbers, and we've got some of those in the releases we've provided.\n\nAnd so, I think there's a class of capital provider out there for whom access to that would be attractive. And, you know, those are sort of, you know, more fixed arrangements that will take a while to put into place. But, you know, I think that, you know, predominantly what we have today are capital providers who are, you know, vintage by vintage and, in some sense, may depend on either leverage or liquidity for the markets, which creates more volatility. So, I think now that we have some proof points which demonstrate what yield looks like through a cycle, you know, we will use that to enter into negotiations and arrangements with the partners that are more of the style of, you know, wanting predictable stability in terms of access to yield.\n\nAnd so, I think that's all we really have to share at this time. As Dave said, that these aren't going to happen overnight. They're pretty complex relationships. But, you know, I think we're all very convicted that that's the direction that will provide stability for our platform to get to the next level of volume.\n\nSimon Clinch -- Atlantic Equities -- Analyst\n\nOK. All right. That's useful. And just as a follow-up, Dave, I think in your opening comments, you mentioned your views that, you know, the heading for significant slowdown in the near-term recession in the next seven to 10 months and, I guess, a slower economic growth outlook beyond fiscal '23.\n\nNow, I was wondering if you could expand on your thoughts there and, I guess, sort of what you're seeing and what gives you that much bleaker outlook than perhaps I've heard from from others.\n\nDave Girouard -- Chief Executive Officer\n\nYeah, sure. They've -- I wouldn't say. That it's my outlook per se. I'm definitely not a macro forecaster.\n\nAnd Upstart does not try to hold within its skills, you know, kind of a crystal ball about the next phases in the economy. What I was trying to state, though, is that we try to build in what you would think of as some form of market consensus, where the market thinks the economy is going to go with a degree of conservatism sufficient for, you know, banks and investors and credit unions, etc., to feel comfortable on the platform. So, we necessarily take what you might consider a conservative viewpoint on them only because it's a good starting point for those who are on the platform with capital at risk. It doesn't necessarily mean it's my personal outlook or Upstart's personal outlook, really.\n\nIt's just trying to reflect a reasonable and a conservative take on where the economy could be in the next couple of years.\n\nSimon Clinch -- Atlantic Equities -- Analyst\n\nGreat. Thanks. I'll jump back in the queue.\n\nOperator\n\nAnd we'll go next to Mike Ng of Goldman Sachs.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nHey, good afternoon. Thank you very much for the question. I just have to -- first, could you talk a little bit more about the fee revenue as a percentage originations. You know, it is quite strong in the quarter.\n\nI'm just wondering if there were any specific drivers that led to that increase, whether those are price increases or the loan mix? And then. Second, just on the guidance for the third quarter for $170 million of revenue, and can you just talk a little bit about the mix between fee revenue and net interest income and any notable points around fair value adjustments? Thank you.\n\nSanjay Datta -- Chief Financial Officer\n\nSure. And, Michael, this is Sanjay. Sure, on the first question, can I presume you're talking about take rates? When you say strength you're talking about --\n\nMike Ng -- Goldman Sachs -- Analyst\n\nYes.\n\nSanjay Datta -- Chief Financial Officer\n\nOK. Yeah. I mean, I think it's as simple as -- and I think we've signal this in the past, we've typically been optimizing for not interim cash production but sort of long-term volume and how we price. And so, our take rates have generally always been at a level where, you know, we are able to, you know, produce more volume that will lead to model acceleration and learning and will lead to, you know, future value in the form of repeat loans.\n\nAnd, obviously, in a situation like we're in today, where we are funding constrained and we're much more focused on in-quarter cash generation, we've sort of set our fees at a more optimal level, if you will. And so, we've priced them higher, and that has the effect of creating a more resilient in-quarter P&L. And so, that's, I would say, an artifact of how we're managing the business through the choppiness that we're experiencing in the market. And the second question really was around the guidance and fair value, in particular, I believe.\n\nI mean, I think most of our revenue is an expression of transaction volume and fee revenue. There still is some, you know, downside in terms of fair value. You know, we disclosed it in our investor materials besides that sheet we're holding, which is pretty much on par with last quarter. And, you know, to the extent there's more interest rate exposure, if the rates continue to rise, those will necessarily depress asset values and create some fair value exposure.\n\nBut we're not making, I would say, large assumptions one way or the other about macro variables. We're really, I guess, trying to express the direction of transaction volume and the consequence fee revenue.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nGreat. Thank you for the thoughts, Sanjay. That's very helpful.\n\nSanjay Datta -- Chief Financial Officer\n\nThank you, Mike.\n\nOperator\n\nAnd we'll go next to Andrew Boone with JMP Securities.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nHi, guys. Thanks so much for taking my questions. As we think about you moving more loans onto the balance sheet, can you help us understand the guardrails that you're thinking about? Understood it's still early here, but how do we think about just what's the potential for using balance sheet? And then as you talked about lenders and just the attractiveness of yields that are available right now. Can you talk about just how you're educating your partners to be able to step back in? How can you proactively have them come back? Thanks so much.\n\nDave Girouard -- Chief Executive Officer\n\nHey, Andrew, this is Dave. On balance usage, I would just say, first of all, we're most certainly being prudent in usage of our cash in any way. As Sanjay said earlier, it is not our intention to become a large balance sheet lender whatsoever. Our long-term strategy hasn't changed.\n\nWe aren't becoming a bank. But, certainly, we see ourselves in a transitional phase where we are recognizing the need for permanent or more committed capital on the platform. And as a bridge to that, we want to have the freedom to do the right things at the right time to get from here to there. It doesn't really change our overall philosophy, but we know, nor do we think it's great at this time to have sort of a litmus test of not using our balance sheet whatsoever with a lot of cash on our balance sheet.\n\nAnd we want to use it to the advantage of the business over the long haul. So -- but for sure, we're a company that has always been very much capital efficient as a private company. What we raised very modestly compared to others, how we used it. We've been profitable most of our time as a public company.\n\nSo, I think we we have the genetics of a company that likes to be cash efficient. And we certainly will do nothing to put our operational capacity at risk or our business at risk with our balance sheet, irrespective of whether or not we choose to use some of it within the marketplace. Sanjay, do you have anything to add to that?\n\nSanjay Datta -- Chief Financial Officer\n\nYeah. I mean -- I guess -- I should -- Andrew, just reiterate, you know, it's still our intention in the long term to be a platform that, you know, decisions, third-party capital. We don't want to be in the business of being a balance sheet. Now, as you've seen, we're sort of signaling a contraction in our guidance.\n\nWe recognize that we need less that we're funding more committed funding, and they get us through to that point. I think what we're expressing is not so much an intention as a need for flexibility in making that transition. But as Dave said, we've always been very, you know, very careful stewards of the capital that are on our balance sheet. We've always run a very lenient company.\n\nSo, this is really more about just making sure we have within maybe a stability of model in order to make that transition. And then there's the second question you asked is, how are we engaging the capital markets in the funding markets in order to provide them this comfort? And there's a couple of ways. I mean, certainly the amount of information that we've provided to the broader public in the form of the sort of FAQs and the blog posts and the additional investor information we've released today. We have a much deeper level of information that we take to the funding markets.\n\nAnd in fact, in the same way that we hold a sort of a conference broadcast in order to discuss business results with the equity markets, we're going to have a similar construct with the funding markets. And so, you know, we do have, I think, as much or more information about anybody is the current direction of delinquencies in very real time. And we're going to do our best to express that. And then part of this goes back to your question on balance sheet in some sense that the markets would like a signal of confidence in the way that the loans are currently being priced, and then the macro assumptions that Dave talked about.\n\nAnd, you know, using our balance sheet, to some extent, as a signal, I think can can provide a lot of comfort to the funding markets. So, that's something that's not lost on us, given the asymmetry of information that we have around how the models are calibrated and how the loans are currently trending.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThank you.\n\nOperator\n\nWe'll go next to Ramsey El-Assal with Barclays.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thanks so much for taking my question this evening. Can you give us some color on what you're seeing most recently in the business quarter to date in July?\n\nSanjay Datta -- Chief Financial Officer\n\nYeah. Hey, Ramsey, this is Sanjay. are you referring to any particular aspect of the business? Meaning, the financials, the volumes, the credit performance, or the general sort of overall?\n\nRamsey El-Assal -- Barclays -- Analyst\n\nKind of -- it was quite. It was quite general.\n\nSanjay Datta -- Chief Financial Officer\n\nOh, OK. I mean, I think the best expression of what we're seeing to date in the business is, as I said, you know, sort of reflected in our guidance, if you will. So, you know, I think that, as we've said, there's a continuing contraction on the top line, which is evident that anyone and I think that's probably the headline for what we're managing through right now.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nAnd would you characterize that as as having gone down and you're sort of seeing some stability in performance at this point? Or is it still something where you have relatively limited visibility as trends are sort of maybe unstable and still sort of on the move?\n\nSanjay Datta -- Chief Financial Officer\n\nAnd when you say performance trends, are you referring to credit performance or --\n\nRamsey El-Assal -- Barclays -- Analyst\n\nI am referring to credit performance, but also to, I guess, in addition, perhaps, like the demand environment.\n\nSanjay Datta -- Chief Financial Officer\n\nI don't think there's too much to comment on with respect to the demand environment outside of what we're signaling with guidance. I think that's probably the best reflection we have of it. With respect to credit trends, I would say that the macro environment remains very fluid, obviously. And it's something that I think is changing month by month.\n\nAnd so, I would characterize that as, you know, continuing fluidity. I would say with respect to how our model is sort of consuming and predicting the future, I think there's been significant recalibrations in our model since the beginning of this year. So, when you therefore look at how the loans are performing and how they're being priced, I think there's pretty big changes in those curves, maybe starting as recently as January or February. And so, due to that, I think that the model has very much recalibrated to where the macro is.\n\nAnd as Dave said, in terms of how it's thinking about the future, there's significant conservatism in the assumptions around what will happen in the macro. And we don't have any specific, you know, knowledge or ability to forecast the macro than anyone else has. But with what we have and the trends we're seeing, I think that you could say that the assumptions are very conservative.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nSanjay, thank you very much.\n\nSanjay Datta -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nWe'll move on to our next question from Pete Christiansen with Citi.\n\nPete Christiansen -- Citi -- Analyst\n\nGood afternoon, and thanks for the question. Dave, as it relates to the CFPB, could you just walk through some of the changes that -- I know there's a bunch of nuances. But if you can give your take of how that relationship is moving. And then my second question is, as it relates to the 3Q guide, are there any assumptions that there'll be ABS issuance in the quarter? Thanks.\n\nDave Girouard -- Chief Executive Officer\n\nSure. Thanks, Pete. I'll take the first question. I'll let Sanjay handle the second one.\n\nYou know, we continue to have what we consider to be a great relationship with the CFPB. We've had that relationship since the very early days of the company through three different administrations. So, you know, we have a lot of history with them. We consider it constructive.\n\nWe've always been very transparent and forthright with them. As many know, we have had this form of a no-action letter agreement that started way back in 2017, renewed in 2022. And a few months back, we requested to terminated early, really in the sense that it was mission accomplished. It had done what we hoped and in terms of getting a lot of feedback from the CFPB on how to properly test for fairness in a sort of modern lending model.\n\nAnd so, through a long -- a lot of period of times in the years, we built -- we considered be very sophisticated forms of testing that we do on behalf of all of our bank partners. So, we have continued strong relationship with CFPB, that structure of no-action letters, etc., it's something that CFPB internally decided they want to move away from. So, I think that's, you know, OK by us, as we said, we felt in the early days of our existence. And before, we had really refined how to do fairness testing, right, it was very useful.\n\nBut today we continue to believe we have state-of-the art fairness testing. We do that reliably on behalf of all of our lending partners. And we do continue to have open communication with CFPB, and I would expect to do so in the future as well.\n\nSanjay Datta -- Chief Financial Officer\n\nHey, Pete, this is Sanjay. To your second question, there's no explicit assumptions we're making with respect to ABS issuance in our guidance. And we continue to issue regularly. Obviously, the execution in the market right now is quite volatile.\n\nBut, you know, we don't have an explicit assumption on what that looks like or dependency on it.\n\nPete Christiansen -- Citi -- Analyst\n\nOK. Thanks, gentlemen. I'll get back into queue.\n\nDave Girouard -- Chief Executive Officer\n\nThanks, Pete.\n\nOperator\n\nAnd we will go next to Arvind Ramnani with Piper Sandler.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nHi, thanks for taking my question. Yeah, just a couple of questions. You know, as you're deciding to use your own balance sheet or use your banking partners for some of your loans, what are some of the trigger points you will use to kind of make that determination?\n\nDave Girouard -- Chief Executive Officer\n\nHey, Arvind, this is Dave. Let's just say, I mean, we don't have specific trigger points per se. What we just want to really have is flexibility. I think being able to transition from one state of our funding supply to another is one we want to make sure goes smoothly and with some confidence and just in -- and getting from here to there in a way that's not disruptive to our partners, to our employees, to anything else.\n\nSo, we don't have any definitive trigger points other than we absolutely intend to be cautious and prudent with the use of our cash. We are confident that there's real profits available on our platform today. So, for that sort of basic reason, it makes sense for us to do so. But it isn't our goal to build a giant balance sheet.\n\nAnd it's certainly not our intention over time is to sort of switch toward that form of a business. We do believe it makes most sense for us, you know, for our employees, for our shareholders, for all of our partners, to have some flexibility in how we navigate through a pretty unique economic time that we are sitting in today.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nYeah. That's helpful. And is that something that you will like sort of plan to communicate to investors as you look to expand the balance sheet? Or will -- is it kind of going to be part of the regularly schedule earnings calls, if you'll plan to go that route?\n\nSanjay Datta -- Chief Financial Officer\n\nHey, Arvind. This is Sanjay. I think it'll make -- you know, be a component of our regular communications with the market. I don't necessarily foresee anything that's so extraordinary that would require an interim communication.\n\nBut if there is, we'll certainly make it. Just as an aside, I don't know if you've seen it, but we are sort of breaking out the balance sheet and the exact components of it in our investor materials now.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nYeah, yeah. I did see that. And then just one of the things that you talked about certainly was, you know, how you continue to see models better equipped to price loans? And I know in prior earnings calls, you've talked about some banks referring to use Upstart versus like a FICO score. But are you using similar validation through your partners that may sort of ease up the funding sources, you know, in terms of like really validating that your models are better to price loans and to shift volume your way?\n\nDave Girouard -- Chief Executive Officer\n\nWell, Arvind, one of the things that we've kind of tried to make pretty clear is that, you know, the 70 plus banks and credit unions who tend to originate and hold the primary end of the credit have all done really well through all cycle -- all parts of the cycle, if you will, and have actually performed at or above expectations. So, I don't think we necessarily need any more than that. Some of them have stated publicly, and we can see it in the data and have shared the aggregate data. So, I think that, you know, that's all a very good thing.\n\nBut I think a lot of the issue out there really is about what may happen, you know, on the next year or two years. And everybody has the right to have a different opinion about that and take actions based on that opinion. So, that's part of, you know, of course, the challenges is it's about the future, not about exactly what's gone on in the last year or two years. And in that sense, that's why we have sort of said, we want to move toward investor relationships that have a long-term approach across through cycle approach toward investing.\n\nAnd that will, you know, be -- in the end, lead to a much stronger platform for Upstart.\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nGreat. Terrific. Thank you very much.\n\nDave Girouard -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe'll go for our next question from Vincent Caintic with Stephens.\n\nVincent Caintic -- Stephens Inc. -- Analyst\n\nThanks for taking my questions. I have two. First question so on the balance sheet usage, so I appreciate your comments on that. And if you could talk about your balance sheet strength.\n\nSo, you've got over 900 million in cash. And I guess if you were to leverage that conservative leverage, maybe you could do 2 billion to 3 billion of loan originations to support the business and the interim. And so, I was just wondering if we could maybe talk about some of the guardrails or sort of how you're thinking about the balance sheet usage? And then, relatedly, I think you spoke about in a prior press release about selling some of the loans that were on the balance sheet. If you could talk about, how that performed, I'd see, there's still about 600 million this quarter.\n\nYou know, how was the -- how did that go? And what was the, I guess, the par value? Thank you.\n\nSanjay Datta -- Chief Financial Officer\n\nHey, Vin, this is Sanjay. So, just to maybe put some parameters around our balance sheet, that's correct. We have sort of the 900 million in restricted and unrestricted cash. I would say we have about probably 400 million of loan equity on the balance sheet and about 600 million of assets.\n\nSo, maybe 200 million of that is financed -- that will I don't -- we don't have an intention of getting into large amounts of financed loans. So, numbers that you alluded to on your [Audio gap] and I don't think it would be anything approaching that. I think it would be much more modest. And, you know, this is an environment which [Audio gap] and, candidly, it's not readily available these days at reasonable prices anyway.\n\nSo, you know, I think of our loan balance sheet sort of flexibility as being, you know, denoted in values of maybe a couple of million dollars. With respect to loan transactions, I would say transactions, like I, the main force of gravity on those is what's going on with rates in the environment as you're transacting. And most of the transactions we've had have been older vintages. So, vintages, that have accumulated maybe in Q1 of this year and six months later, interest rates have gone up.\n\nAnd so, to the extent that they have executed below par and then we've indicated that that has created some of the negative fair value pressure in our P&L, it's really a function of the fact that, you know, some of the more seasoned loans have just been impacted by the industry environment this year.\n\nVincent Caintic -- Stephens Inc. -- Analyst\n\nOK. Thank you for that. I appreciate it. And one question just following up on guidance, just if you could talk about, so the $170 million of revenues, if maybe you can talk about the cadence of that.\n\nLike are you seeing and improving performance as we go through the quarter? And on the contribution margin, so I'm calculating 59%, so a nice expansion there. Just wondering what would be driving that maybe, you know, less marketing expense or more efficiency, if you could just talk about that. Thank you.\n\nSanjay Datta -- Chief Financial Officer\n\nSure. Yeah. I guess in terms of the guidance, we're not really telegraphing any directionality. I would say things are volatile right now.\n\nAnd so, that's more of a level than a trend, if you will. With respect to the contribution margins, yes, and it's sort of a bit of what we referenced earlier, which is, you know, when we are in a period of compaction like this, we optimize for in-quarter cash generation. And, you know, candidly, it's one of the important economic characteristics of the business, which is we can -- we're essentially suffering or sort of telegraphing roughly 50% contraction between the forward guidance and what we did last in Q1. And yet we can, whether that with, you know, still guiding to a breakeven EBITDA.\n\nAnd the reason is because we have quite a bit of control in terms of our ability to set fees. We tend to be inelastic and below optimal fee levels in normal times, and so we can raise them to buffer volume contractions. And as you said, when we have less funding availability, our marketing programs, we tend to sort of keep the more efficient ones and discard the more experimental ones. So, as a result, our take rates go up, our acquisition costs tend to go down.\n\nAnd it creates a margin expansion, which, in some sense, tends to push against the volume contraction. And it allows us to be somewhat resilient as a business model.\n\nVincent Caintic -- Stephens Inc. -- Analyst\n\nOK. Very helpful. Thanks very much.\n\nOperator\n\nAnd we'll go next James Faucette with Morgan Stanley.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThank you very much. And thanks for all the detail and supplemental information. I'm wondering when we look at kind of your expected returns on by quarter, etc., is that you're showing that you expect a pretty significant improvement on the cohort from Q1 '22 versus Q3 and Q4, even though the total -- or the target gross return is similar or even a little bit lower. Can you talk a little bit about the changes that were made for that Q1 2022 and that you -- that are driving your expected return higher versus what was being done in the second half of last year?\n\nSanjay Datta -- Chief Financial Officer\n\nYeah. Hey. James, this is Sanjay. Sure.\n\nI mean the simple version is, you're seeing the model recalibrating to the changing environment. And in particular, I think starting in, by Q3 of 2021 the delinquency trends in the industry started to rise. And it's been disproportionately, I say, borne by the, I would say, the less affluent borrowers, if you will. And so, our models observe that and react to it and change pricing as that is happening.\n\nAnd so, in some sense, because that trend had happened between Q3 of 2021 and early this year, maybe call it Q1 or Q2 of this year. Our model has been reacting to that adjusting recalibrating. And on top of that, we do what you might think of as a manual overlay, which is we have to make some estimate of what we think the future macro holds because that's not something that's in the training data for our machines. And so, in addition to the model recalibrating to loss trends, as they change, we are making more conservative forward predictions what the macro will sort of do in the future.\n\nAnd we're to the point now where I would say our macro accommodation is fairly conservative in terms of what we're expecting to happen -- or maybe expecting is the wrong word, what we're prepared to happen in the macro, given inflation and unemployment, etc. And so, those are really the two variables that are changing. It's the models estimate of loss, depending on -- you know, as a function of the changing actuals, and it's our forward prediction of how to prepare for continued macro volatility.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGot it. And then, when you talk about looking to add committed capital and expanding that range of partnerships and agreements, what's your expectation for what that's going to do on cost of capital and what you would need to do, if anything, and if there is an impact, what you would need to do around fees and those kinds of things. Just trying to figure out like what you may have to give up in order to achieve that longer, better, or stickier capital, I guess?\n\nDave Girouard -- Chief Executive Officer\n\nYeah, it's a great question, James. I would say that on the one hand, it will make notionally certainly to a capital provider who's committing capital forward. There's cost for that. I think it'll make capital on the margin more expensive in good times, but maybe on the margin less expensive in times like now because they're investing through the full cycle.\n\nAnd, you know, the other variable is that as we sort of talked about in some of the other questions, we are quite margin-rich. And so, we ourselves can trade off economics in the good times for economics in the choppier periods in the next economic cycle, such that, you know, the investor as whole, and we're creating more stability for the platform. And so I think to the extent, the committed capital is more expensive in a benign period. We can offset that through our own business model and then make it up when there are down cycles as there inevitably will be.\n\nSo, we view our margins to be lever that we can use to make sure that the investors are stable and the platform is stable, and the borrowers are getting some amount of stability, even though -- as you know, our mission is to fundamentally, you know, lend to for proportions of the population which, notionally, are riskier.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe'll go next to Nat Schindler of Bank of America.\n\nNat Schindler -- Bank of America Merrill Lynch -- Analyst\n\nYes. Hi guys. I think a lot of my questions have been asked already. But one thing I wanted to go over -- well, two things.\n\nOne, you said that you have -- you're going to go out to lenders and you have now a cross-cycle vision of your performance. Are we really cross cycle? Are you modeling that this is the bottom and we've turned the corner on kind of the low-end consumer that is contrary to what most of our economists are saying at this point? So, I want to just understand what you mean and whether or not you think that these delinquencies are going to get worse from here or better. Finally, also, I'm a little confused on the back and forth of the balance sheet, no balance sheet, using the balance sheet, not using the balance sheet. One, why this oscillation; and two, how much of your -- how much do you really think that you were ever going to get to on your balance sheet? I mean, originally, you were saying you were going to be only about 5%, and that's through experimental purposes.\n\nI think in Q1, you got up to 15, and you said you would go down from there, and while that was experimental with auto anyways. And now you're saying you're going to go onto the balance sheet again. What kind of level do you think makes sense? One final question on top of that, I'm sorry for the three, but who are these investors that you haven't talked to? Who are you going out to, to kind of increase your supply? Just are they people that don't do personal loans? Are they people that are new to this market? Who is out there that you are trying to evangelize the product to on the supply side? Thanks.\n\nSanjay Datta -- Chief Financial Officer\n\nHey, Nat. It's Sanjay. I'll take your first question. And then, you know, Dave and I will work it on the last two.\n\nThe first question was about, do we really think we're at past the bottom of the cycle? I think in a short word, no. But I'll just give you overview on a couple of different nuances. So, first of all, I do think that what's happened to date, while in the aggregate, I think that -- maybe there's a view that it hasn't been too bad to date and there's more to come. I think that picture is sort of a little bit different in a nuance way depending where you are in the credit spectrum.\n\nI mean, if you look at the industry data, if you're an affluent borrower and you talk about like what has been the best sort of credit performance in the last year, sort of mid-2021, and where are you compared to there, you know, you're mildly, you're up 30%, and you're still below pre-COVID numbers. If you are on the less affluent side of the spectrum, you are up much more than that in your well pass, where you were pre-COVID. So, I think that the timing of all this is a little bit different. I think that the less affluent side of the spectrum peaked a little bit sooner and has come up a little bit sooner and maybe prime borrowers are still sort of in that schedule somewhere.\n\nSo -- and I think the second component is we've largely -- you know, to us, it's not just the -- it's the rate of change of things and the very sudden changes in the delinquency trends. In our core borrower, we've sort of cut up to. And we're making significant conservative assumptions about the future. So, I think we're expecting further degradation in loss trends.\n\nBut I think that the difference is compared to like mid-2021, when everything was rosy and everyone still had a lot of stimulus in the bank account, and delinquencies were still like 50% of long-term normal. We are now projecting it and prepared for it. So, there is still a world in which these vintages underperform going forward. But it would have to be a very, very significant economic sort of setback in our view.\n\nAnd so, what we really care about demonstrating to someone who will be forward committing capital in a sort of a cross-cycle kind of a way is like what's the cycle of the returns. And if you look at the sort of returns that we -- you know, by cohort that we talked about in the investor materials, you can see that it's sort of troughed with the Q3, Q4 vintages. Q1 looks like it's sort of working its way back. And I think that you'll see that when you see those Q2 numbers, we'll -- our belief is we will be able to tell a story that the returns have gone through their cycle, and we're on the front edge of what's coming.\n\nAnd of course, you can never fully predict the future, but just the preparedness of our models and the conservatism of the macro assumptions are such that I think we're ahead of the curve now. So, that's the question with -- so that's the answer to the first question. I think your second question was about balance sheet usage. So, I don't know, Dave, do you want to chime in on that?\n\nDave Girouard -- Chief Executive Officer\n\nYeah, sure. Nat asked, I don't know exactly how exactly how to put it, what's with the back and forth on balance sheet usage is maybe the short version of it. But, you know, Nat, look, I just say, the company I founded and co-founded 10-plus years ago, the thing that's made us successful over the years is being nimble and thoughtful and responsive when needed by the market. And we certainly have a long-term view that we are a marketplace business, meaning to bring lenders and investors together with consumers, borrowers on the other side.\n\nAnd that's how we view ourselves long term. Having said that, you know, we came to the conclusion that having sort of a litmus test that thou shalt not use the balance sheet at all doesn't make sense, particularly when you see reaction to the supply side of our business happen in ways that almost a contrary to facts to us, meaning credits generally performing well. And yet, for reasons that are obviously be -- many of which are beyond our control, lenders or investors take decisions that they take. So, I just think in the interest of our shareholders and everybody else, it's proven for us to use our balance sheet wisely.\n\nWe don't intend to become a large balance sheet lender. But at the same time, we think it's important to stay to the community out there that we're going to do the right things for the business. And we don't believe that it makes sense to have a sort of iron clad witness test that thou shalt not use your balance sheet in the marketplace. And that's the conclusion we came to.\n\nWe think it really is, as we've said numerous times now, a transitional step toward a place where we have committed third-party capital. And that's what we think also is represents a significant chance to upgrade our business structure. And so, put those altogether and we think this is the right step forward for Upstart. It's going to be part of building a much larger, a much stronger Upstart over time.\n\nOperator\n\nAnd we will go next to David Chiaverini with Wedbush Securities.\n\nDavid Chiaverini -- Wedbush Securities -- Analyst\n\nHi. Thanks for taking the questions. The first question is on the take rate, and it makes sense to increase the take rate in this environment. I was curious how high should we expect the take rate to go over the next couple quarters?\n\nSanjay Datta -- Chief Financial Officer\n\nYeah. Hi, David, it's Sanjay. I think maybe one we're putting this is, you know, given the guidance we've put out for Q3, you might imagine that we're doing all that we can to ensure that our P&L remains resilient.\n\nDavid Chiaverini -- Wedbush Securities -- Analyst\n\nGot it. And then somewhat similar question on originations for the third quarter, I guess zooming out back to the second quarter. Are you able to share what the June origination number was and how that compares to July?\n\nSanjay Datta -- Chief Financial Officer\n\nYeah, we're not breaking out specific months, David. I would just -- I would say that the trend right now is volatile. So, there's no real directionality in our numbers with respect to, you know, June versus July.\n\nDavid Chiaverini -- Wedbush Securities -- Analyst\n\nGot it. And then quickly on the buyback. Can you talk about your appetite from here?\n\nSanjay Datta -- Chief Financial Officer\n\nSure. David. Well, as you know, we have, you know, board authorization to go up to 400 million of which we've used 150 million. I mean, it's sort of an ongoing equation between where the price is versus what we think is fair value.\n\nAnd now, of course, what other sources and uses of cash, or, I guess, uses in particular we might have. And so, there's always opportunities whether it's buying back the stock and reducing the dilution or looking at some of the convertibles in the market that are ours or buying loans, which, as Dave said, we think can have a very lucrative return right now. So, I would just say that we're monitoring that on an ongoing basis. And, you know, we're certainly interested in using -- making efficient use of our cash balance on behalf of the shareholders.\n\nDavid Chiaverini -- Wedbush Securities -- Analyst\n\nThanks very much.\n\nSanjay Datta -- Chief Financial Officer\n\nThank you, David.\n\nOperator\n\nAnd now, I will turn the call over to Dave Girouard for any additional or closing remarks.\n\nDave Girouard -- Chief Executive Officer\n\nThanks, all, for being with us today. Sanjay and I just want to make clear. We're not happy with our results. We're not a company that likes to have a declining revenue from one quarter to the next.\n\nBut we are -- we feel doing the right things to make the company as strong and as powerful as it can be in the future. We are as committed as ever to the mission of improving access to credit for those who deserve it. And we are making steps to make the company stronger and better and do anticipate we'll be back on a growth track. So, we appreciate all them sticking with us through this.\n\nAnd we're going to get back to work at making Upstart the great company that it is.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJason Schmidt -- Head of Investor Relations\n\nDave Girouard -- Chief Executive Officer\n\nSanjay Datta -- Chief Financial Officer\n\nSimon Clinch -- Atlantic Equities -- Analyst\n\nMike Ng -- Goldman Sachs -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nPete Christiansen -- Citi -- Analyst\n\nArvind Ramnani -- Piper Sandler -- Analyst\n\nVincent Caintic -- Stephens Inc. -- Analyst\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nNat Schindler -- Bank of America Merrill Lynch -- Analyst\n\nDavid Chiaverini -- Wedbush Securities -- Analyst\n\nMore UPST analysis\n\nAll earnings call transcripts"
}