{
  "companyName": "Agilent Technologies",
  "companyTicker": "A",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/agilent-technologies-a-q3-2022-earnings-call-trans/",
  "content": "Agilent Technologies (A -0.80%)\nQ3 2022 Earnings Call\nAug 16, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. Thank you for attending today's Agilent Technologies Q3 '22 earnings call. My name is Hannah, and I will be your moderator for today's call. [Operator instructions] I would now like to pass the conference over to our host, Parmeet Ahuja, with Agilent.\n\nPlease go ahead.\n\nParmeet Ahuja -- Vice President, Investor Relations\n\nThank you, Hannah, and welcome, everyone, to Agilent's conference call for the third quarter of fiscal year 2022. With me are Mike McMullen, Agilent president and CEO; and Bob McMahon, Agilent senior vice president and CFO. Joining in the Q&A after Mike and Bob's comments will be Jacob Thaysen, president of the Agilent Life Science and Applied Markets Group; Sam Raha, president of the Agilent Diagnostics and Genomics Group; and Padraig McDonnell, president of the Agilent CrossLab Group. This presentation is being webcast live.\n\nThe news release for our third quarter financial results, investor presentation and information to supplement today's discussion, along with the recording of this webcast, are available on our website at www.investor.agilent.com. Today's comments by Mike and Bob will refer to non-GAAP financial measures. You'll find the most directly comparable GAAP financial metrics and reconciliations on our website. Unless otherwise noted, all references to increases or decreases in financial metrics are year over year, and references to revenue growth are on a core basis.\n\nCore revenue growth excludes the impact of currency and any acquisitions and divestitures completed within the past 12 months. Guidance is based on exchange rates as of July 31. As previously announced, beginning in the first quarter of fiscal 2022, we implemented certain changes to our segment reporting structure. We have recast our historical segment information to reflect these changes.\n\nThese changes have no impact on our company's consolidated financial statements. We will also make forward-looking statements about the financial performance of the company. These statements are subject to risks and uncertainties and are only valid as of today. The company assumes no obligation to update them.\n\nPlease look at the company's recent SEC filings for a more complete picture of our risks and other factors. And now, I would like to turn the call over to Mike.\n\nMike McMullen -- President and Chief Executive Officer\n\nThanks, Parmeet, and thanks, everyone, for joining our call today. In the third quarter, we once again demonstrated the strength of our diversified business and the unstoppable One Agilent team. We delivered an excellent quarter, significantly exceeding our revenue and earnings expectations. Revenues of $1.72 billion are up 13% core, this is on top of 21% core growth in Q3 of 2021.\n\nThird quarter operating margin of 27.5%. Operating margins continue to expand and are up 150 basis points from last year. Earnings per share of $1.34, up 22%. Our strong results in Q3, coupled with orders continuing to outpace revenues, highlight the ongoing strength of our diversified business.\n\nThe momentum in our business continues, and we once again raised our outlook for the year. Let's take a closer look at our Q3 results. From an end-market perspective, our results were once again led by strength in our two largest markets, pharma and chemical and energy. Our largest market, pharma, grew 16% versus 27% a year ago.\n\nWithin pharma, both the biopharma and small-molecule segments grew double digits. The momentum in our C&E market segment continues, with Q3 growth of 22%. This is on top of 23% growth a year ago. The C&E market is being fueled by demand in chemicals, along with strong secular demand and ongoing investment within the advanced materials space.\n\nWe're also very pleased to achieve double-digit growth in the food and environmental and forensic markets, with both markets growing 11%. In our last call, I shared our belief that the business impact of the Shanghai COVID-19 lockdown would be transitory. I also expressed that we remain confident about the ongoing strength of our business in China. In Q3, the China team delivered 29% growth.\n\nThese stellar results were driven by continued strong end-market demand, coupled with the faster-than-expected recovery of production and shipment activity following the end of the Shanghai area lockdown. We are also very pleased with this result, which highlights the customer focus, drive and outstanding execution of the Agilent China team. Strength in Americas continued as we posted another quarter of double-digit growth on top of 32% growth last year. Our European business grew 6% against the 23% last year despite a 2-point headwind for the curtailment of our operations in Russia.\n\nIn terms of business unit performance, the Life Science and Applied Markets Group generated revenues of $1.02 billion, up 18% on a core basis. Growth was broad-based, with continued strong demand for our LC and LC/MS offerings, where we posted high-20s growth. Our spectroscopy business grew low 30s driven by the strength in the advanced materials market. Chemistries and consumables, cell analysis and our GC business each delivered double-digit growth in the quarter.\n\nLSAG's end-market growth is broad-based, with particular strength in the pharma and chemical and energy markets. Our pharma results were driven by strength in the biopharma segment, which grew more than 20%. We had an excellent showing at the recent ASMS conference, introducing several important LC/MS and GC/MS instruments and biopharma workflow solutions. These innovative and intelligent LC/MS and GC/MS systems have been designed to make the lives of our customers easier.\n\nTo build an instrument intelligence and a higher-level instrument diagnostics helped maximize system uptime and improved lab productivity by allowing operators to focus on their analysis rather than their instruments. In addition, we introduced an industry-first HydroInert source for GC single-quad and GC triple quad instruments, enabling customers to seamlessly migrate from helium as a supplier gas, to lower-cost hydrogen. And rounding out the list of new products announced at ASMS, we introduced the MassHunter BioConfirm 12.0 software, an integrated compliant workflow targeted at the fast-growing oligo-based therapy development market. These new products have already been well received by customers and represent the latest addition to Agilent's history of leadership in mass spectrometry.\n\nOur LSAG business also won some important awards during the quarter, including the 6560C Ion Mobility LC/Q-TOF system, winning the Scientists' Choice Award for Best New Spectroscopy Product. Earlier this month, we also strengthened and broadened our advanced materials and biopharma portfolio with the acquisition of PSS, Polymer Standard Service, a leader in polymer characterization. We're extremely pleased to welcome the PSS team and their technology to the Agilent family. The Agilent CrossLab Group posted services revenue of $359 million.\n\nThis is up 10% core. We grew 10% core even as lab activity continues to ramp in China. Growth in services was again broad-based across services contracts, preventive maintenance, compliance, education and informatic enterprise services. Strong instrument placements and increased connect rates continued to be a driver for our service business as customers continue to see value in our ACG offerings.\n\nAnother critical important factor on our results is the scale and execution capability of Agilent's world-class global service delivery organization in service of customers to meet their needs as we're seen as the trusted company to work with among our global customers. The Diagnostic and Genomics Group delivered revenue of $340 million, up 3% core. This is versus that compare of 37% growth last year. The solid results in our clinical cancer testing and NGS businesses were partially offset by COVID testing headwinds in the qPCR portfolio.\n\nIn addition, the DGG business in China continues to ramp from the COVID-related shutdowns there. NASD revenues were up modestly in line with expectations. As we noted last quarter, Q3 included the impact of a planned shutdown in our oligo manufacturing line in Frederick, Colorado. The shutdown of Frederick was for both routine maintenance and development of key elements of our Train B., our new manufacturing line to increase our capacity, $150 million-plus, when fully ramped.\n\nWhile we continue to make good progress in the construction of Train B, we have seen some supply chain-related delays and are now targeting a midyear 2023 go-live, a slight delay. We see continued strong demand for oligo-based therapies as the number of approved drugs continues to increase and the pipeline of drugs in development are targeting disease states with larger patient populations. We are more confident than ever in the long-term trajectory of the market and our business. In addition to these highlights, I would like to also point to the recent release of Agilent's 2021 ESG report.\n\nWhile we've always published our progress and sustainability in addressing societal needs, this year, we've taken our approach to the next level. We addressed these issues in a new format, that for the first time, that looks specifically at our progress in the areas of environmental, social and governance issues. We hope you have a chance to review our progress in ESG by checking out the report on the Agilent website, learning more about how we're executing our mission to advance the quality of life. Agilent's Q3 results again point to the strength of our diversified business and the outstanding execution ability of the Agilent team.\n\nWe continue to bring innovative, differentiated new offerings in the marketplace. Acceleration in digital orders growth continues, as well as new customer acquisition. In addition, as we started 2022, we undertook a bold move to create One Agilent commercial organization to further drive customer focus and growth. The strength of our portfolio and the continued strong execution by our One Agilent commercial organization make a powerful combination.\n\nAnd you see it in the results we're delivering. Customer satisfaction hit another all-time high this quarter. We continue to outgrow the market. As a result of our strong Q3 performance and continued momentum, we're once again raising our full year revenue and EPS guidance.\n\nBob will share more of the specifics. It's an exciting time at Agilent, with the best yet to come. Thank you for being on the call today. And now, I will hand the call off to Bob.\n\nBob?\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nThanks, Mike, and good afternoon, everyone. In my remarks today, I'll provide some additional details on revenue in the quarter and take you through the income statement and other key financial metrics. I'll then finish up with our guidance for the fourth quarter and fiscal year. Unless otherwise noted, my remarks will focus on non-GAAP results.\n\nWe are extremely pleased with our Q3 performance. Results were above expectations, and we expect that strength to continue in the fourth quarter. Q3 revenues were $1.72 billion, up 8.4% on a reported basis and up 13.2% core. FX was a 4-point headwind to growth or $76 million.\n\nPricing for the quarter contributed over 3 points of growth year on year and improved sequentially. The performance was broad-based as all end markets and regions grew during the quarter. As we mentioned last quarter, the COVID-related lockdowns in China deferred an estimated $50 million to $55 million in revenue from Q2, and we forecasted that revenue would be recovered during the rest of the calendar year. Our team in China did a fantastic job ramping production and shipments faster than expected following the shutdowns.\n\nWe estimate over half of that deferred total was delivered in Q3, exceeding our expectations. Given the strong performance, we now expect the remainder will be delivered in Q4, which is an acceleration from our thinking from last quarter. The acceleration of the COVID-related shutdown recovery in China contributed to an already strong Q3 for the company. For perspective, we estimate the total business grew double digits, excluding the accelerated recovery.\n\nAs Mike mentioned, earnings per share of $1.34 were up 22% from a year ago, representing strong incremental flow-through of the better-than-expected revenue growth. This performance is against our most difficult comparison of the year as EPS grew 41% in Q3 of last year. Now let me dive a little deeper into the end markets. Our largest market, pharma, was up 16%, exceeding our expectations.\n\nBiopharma grew 18% and small-molecule was up 14%. Biopharma is a focus area for us and now represents 38% of our overall pharma business. We expect that ratio to continue to climb over time. In addition, all three business groups grew double digits in the pharma segment.\n\nAnd our LC portfolio continues to perform very well, growing 25% in this important market for us. Chemical and energy continued to show strength, growing 22% during the quarter driven by the chemicals and advanced materials segment of this market. We saw strength in plastics and packaging for chemicals and ongoing demand in advanced materials coming from the markets for semiconductors and batteries. In the food segment, we achieved growth of 11% on top of 12% growth a year ago.\n\nStrength in the food market was led by the Americas and China. Our environmental and forensics market also grew 11% during the quarter driven by the Americas and China. In the Americas, we saw increased funding to support PFAS testing, while China experienced faster-than-expected recovery post the Shanghai shutdowns for GC and GC/MS. The academia and government market grew 5% on top of a 12% comparison last year, in line with expectations.\n\nAnd rounding out the review of our end markets, our business in the diagnostics and clinical market grew 2% against a very strong 28% compare versus last year. While not material at the Agilent level, this market did experience some headwinds associated with COVID-related revenues being lower than last year. Excluding this, the growth would have been mid-single digits in this quarter. On a geographic basis, China led the way with 29% growth driven by underlying demand and a faster-than-expected recovery following the COVID-related lockdowns.\n\nAnd looking forward, demand in China continues to be very strong. The Americas grew 11%, another strong showing, and Europe grew 6%, which exceeded expectations. Now turning to the rest of the P&L. Our team continues to execute at a very high level.\n\nThird quarter gross margin was 56.4%, up 50 basis points from a year ago as pricing actions, volume and productivity helped to offset inflationary pressures tied to ongoing supply chain challenges and higher logistics costs. Operating expense leverage, driven by the strong top line and continued attention to cost management, helped to deliver very healthy margin improvements. Our operating margin was 27.5%, up 150 basis points from last year. Below the line, our tax rate was 14% for the quarter as expected, and we had 299 million diluted shares outstanding.\n\nLooking at cash flow and our balance sheet. We generated operating cash flow of $326 million in the quarter while investing $82 million in capital expenditures during Q3 driven by our NASD expansion. During the quarter, we also repurchased $323 million worth of shares. We paid out $62 million in dividends in Q3, returning a combined total of $385 million to shareholders in the quarter.\n\nYear-to-date, we have purchased over $1 billion of shares. Given the ongoing strength of the business, we believe this is a very good investment. Our balance sheet continues to remain healthy, with a net leverage ratio of one. Now let's move to our outlook for the full year and the fourth quarter.\n\nWe now expect revenues for the full year to be in the range of $6.75 billion to $6.775 billion. This takes into account our Q3 results and an improved outlook in Q4, partially offset by an additional $40 million headwind associated with the strengthening of the dollar. This represents core revenue growth of between 9.9% and 10.3%. We are also raising our EPS guidance for the year to a range of $5.06 to $5.08, representing 17% growth year on year.\n\nThis translates to Q4 revenue in the range of $1.75 billion to $1.775 billion. Core growth is expected to be in the range of 10.3% to 11.8%, while exchange rates will be a 5-point headwind, and M&A will contribute 0.1 points. In closing out our Q4 guidance, non-GAAP EPS is expected to be in the range of $1.38 to $1.40, up 14% to 16% versus the prior year. This is based on a 14% tax rate and 299 million diluted shares outstanding.\n\nThe Agilent team once again performed extremely well in Q3, delivering strong results, driving excellent execution and building a strong foundation for the future. Our diversified business, and most importantly, our team, have put us in an excellent position to again deliver strong results in Q4. And now, back to Parmeet, as we take your questions. Parmeet?\n\nParmeet Ahuja -- Vice President, Investor Relations\n\nThanks, Bob. Hannah, if you could please provide instructions for the Q&A now.\n\nOperator\n\nCertainly. [Operator instructions] The first question is from the line of Matt Sykes with Goldman Sachs. Please proceed.\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nHey, good afternoon, Mike, Bob. Congrats on the quarter. Thanks for taking the questions.\n\nMike McMullen -- President and Chief Executive Officer\n\nSure.\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nMaybe just starting on LSAG, where you had a really good quarter, just interested to know, one, what drove the operating margin expansion in the quarter relative to your expectations and last year. And then, specifically, I know it was broad-based strength across instrument categories, but was there one or two areas that really surprised you to the upside where you feel is either underappreciated or could see continued momentum in the back half of the calendar year?\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. So I'll take the first part of that, and we'll jump in and have Bob and Jacob add their thoughts here as well. So I think relative to the strength and why the operating margin was so high is, one, is I think we've been -- we rightly benefited from the leverage impact of having those higher-than-expected revenues. But more importantly, we've been working on the pricing side and really ensuring that we are receiving the value for our offerings.\n\nAnd Bob, I think we are well over 3 points of price appreciation overall for the portfolio in LSAG, I believe.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nThat's correct. That's correct.\n\nMike McMullen -- President and Chief Executive Officer\n\nAnd we are -- as you may have picked up in my script, it was across-the-board a great quarter for LSAG and across all product categories. But Jacob, I think a couple really stood out for you, don't -- didn't they?\n\nJacob Thaysen -- President of the Agilent Life Science and Applied Markets Group\n\nYeah. I think, as we know, we continue to do really well in the LC, LC/MS space, but this quarter is really spectroscopy that was standing out. We have, especially in our atomic spectroscopy field, we have really seen a lot of momentum, based, of course, on the dynamics in the markets, but also the innovation that has been created over the past year. And I think we really see the impact of that these days.\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. I think it was a real race to see who had the highest growth, right, spectroscopy or LC and LC/MS. They both did extremely well.\n\nJacob Thaysen -- President of the Agilent Life Science and Applied Markets Group\n\nThey were close.\n\nMike McMullen -- President and Chief Executive Officer\n\nAnything else, Matt?\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nGreat. And then maybe just as a follow-up. I know Europe --\n\nMike McMullen -- President and Chief Executive Officer\n\nSure.\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nYeah, I did just say for a follow-up. Can you hear me?\n\nMike McMullen -- President and Chief Executive Officer\n\nYes. Yes, yes.\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nYeah. Sorry. Just for a follow-up on Europe, 6% growth. I think getting a lot of questions on just the spend environment in that region, what are you seeing there? And are there any kind of concerns you might have in terms of demand, either from the currency fluctuations or just overall demand in certain end markets within Europe?\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. Sure, Matt. So we posted a 6% growth rate, core growth in the third quarter, albeit there was actually 2 points of headwind from the curtailment of our Russia operations. So really it was high single digit, 8%, on a restated basis.\n\nAnd Europe clearly is a watch area for us, but we haven't seen any significant signals of movement to the downside.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. I think, Matt, to build on what Mike is saying, I think, in particular, we continue to see very strong growth in our pharma business. And that really is a global phenomenon. And -- but we also saw very nice growth in our chemical and energy businesses as well.\n\nAnd so as Mike mentioned, it is a watch area. But the demand from what we're seeing in the health of the order funnel continues to be there.\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nThank you. The next question is from the line of Brandon Couillard with Jefferies. Please proceed.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nHey, thanks, good afternoon. Mike, could you elaborate just on the core order growth that you saw in the third quarter? And given the strength of order momentum over the last several periods, how does that inform kind of your initial thoughts on '23? I mean should we still think about 5% to 7% still being relevant? And then Bob, should we expect normal 30% to 40% incrementals next year? Any headwinds to consider, maybe the new ASP line?\n\nMike McMullen -- President and Chief Executive Officer\n\nHey, Brandon, we're probably not ready to talk about '23, but I would just leave you with a couple of thoughts here, which is, very clearly, the business has momentum. And our -- even though we had the highest revenue quarter ever for Agilent in this recent third quarter, we still build backlog, both globally and also in China. So our orders that exceeded our revenue is in those. So that sets us up nicely, I think, for '23, but we'll get to '23 guide when we get there.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. And I think, Brandon, on your core incrementals, I mean, I think that if you look at, historically, that's where we've been. Obviously, we do have some start-up costs in '23 for NASD, and we'll spell those out when we get to the numbers. But I don't think that there's going to be anything fundamentally different on an incremental basis going forward.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nOK. That's helpful. And then on the NASD Train B line, Mike, you said it was pushed out a little bit in terms of the launch time line. Is that like one or two months? I thought the plan was already mid next year.\n\nCould you elaborate a little more specifically on kind of where the supply chain issues, exactly what those are, that are kind of pushing the delay?\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. I think you got the right time frame in there, which is a month or two. It's really been sort of specialized steel that's required. So I actually had a chance to see it myself, where you go into a room or you're -- the steel pipe fitters are working and they're getting the area ready, and they can't close things off because they're missing one valve or something.\n\nSo we've had bits and pieces that have been missing that actually caused us certain delays. I mean the team has been all over. I think the global supply chains are pretty well-publicized. But we thought it was -- we thought we should, in the spirit of transparency, let you know we're still on track for revenue coming out of the facility in '23, but maybe a month or two later than we had thought initially.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. And I think, Brandon, there is one more important piece. I think based on what we know today, we still expect to be at capacity at the exit of FY '23 as well in terms of a ramp-up.\n\nBrandon Couillard -- Jefferies -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. The next question is from the line of Vijay Kumar with Evercore ISI. Please proceed.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nHey, guys, congrats on a really strong quarter here. Hi, Mike, congrats on the print. And one maybe on the guidance here. Q4, at the midpoint, is at 11% organic.\n\nYou guys are just at 15%. The comps will get easier for Q4. I'm curious, sequentially, when you think about it, is the change just because of the cadence of how the China deferred revenues were recognized more in 3Q versus Q4? Can we just talk about the sequential assumptions here for the 4Q guidance?\n\nMike McMullen -- President and Chief Executive Officer\n\nSure, Vijay. And again, we are very, very pleased with the print. So thanks for the feedback. And Bob, we didn't use it in our script, but I think the word prudent may apply to our Q4 guide as well.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nThat's right. Yeah. I think, Vijay, if you think about kind of the moving pieces within China, what we did was we pulled forward some of the revenue that was deferred into Q3, but we also pulled Q1 revenue into Q4. So Q4, I would say, we didn't have a material change one way or another.\n\nWe actually feel very good that we're going to realize that full $50 million to $55 million here in the fiscal year versus having it bleed a little into Q1. And as Mike said, I mean, we're not out of the woods, certainly in supply chain challenges and in COVID situations, and so we thought, at this point in time, a double-digit core growth is very good but also prudent, as Mike said.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nI love that word, prudent. Maybe one on some of the moving parts for '23, Mike. And I'm not asking for a guidance, but if I look at pricing contribution, I think we started with the year at 100 basis points. We're running at 300 basis points.\n\nI think that pricing should continue until it annualizes until mid of next year. You did mention orders coming in about revenues. What is the backlog conversion? Is that a three-month or a six-month or a 12-month visibility that you have from backlog? Any impact from NASD? And sorry, on C&E very strong, but obviously, with the macro, should we perhaps be prudent for '23?\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. So great question, Vijay. So I think I would like to -- the headline here was, as the way Bob closed off his prepared remarks, we're building a strong foundation for the future. So we've got -- we had record revenues in Q3, yet we still build backlog.\n\nAnd some of that backlog, obviously, will carry into '23. And we -- it's probably a three- to six-month visibility for sure on the revenue coming from the backlog. And Bob, I know you see that. And we agree with your thesis around pricing and the impact it will have on our '23 business as well.\n\nAnd Bob, maybe you want to add to --\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. The only thing -- I think you're spot on, Vijay. I would say there's not a material change right now in terms of how we're thinking about NASD. And if I think about the various pieces there, they certainly set us up for a good momentum going into FY '23.\n\nNow there's still some unknowns in terms of kind of the macro environment. But we're expecting to have a stronger-than-normal backlog. We certainly have that right now and are expecting to continue that into '23. And then, obviously, pricing is continuing to anniversary, and I would expect it to be a higher contributor to growth next year, all things being equal.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nUnderstood. Thank you, guys.\n\nMike McMullen -- President and Chief Executive Officer\n\nThanks, Vijay.\n\nOperator\n\nThank you. The next question is from the line of Puneet Souda with SVB. Please proceed.\n\nPuneet Souda -- SVB Securities -- Analyst\n\nHi, Mike and Bob. Thanks for taking the questions. So first one, just LSAG, obviously, a very strong quarter. And I mean, obviously, congrats on the quarter here.\n\nWhen you look at the 25% growth that you're seeing in LC, overall, the order book being strong, can you maybe just characterize sort of, from an end-market perspective, it seems like biopharma continues to do well, but geographically, can you just characterize, is this contribution from biopharma China in the quarter? And how should we think about the sort of order book? Can you maybe characterize the order book more geographically? And do you expect this -- again in line with sort of some of the other questions, is that sort of how should we think about this order book flow through -- flowing through into 2023?\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nPuneet, you packed in a lot in that one question. But we'll try to address it. Sorry, Mike.\n\nMike McMullen -- President and Chief Executive Officer\n\nI was just saying, maybe you want to take that, Bob. But I think the answer was really across the board. I mean both -- I mean, clearly, biopharma and pharma, our portfolio is doing really, really well there. And as I mentioned to the team the other day, we just got the most recent [Inaudible] report, which shows market share movements.\n\nAnd as my Danish colleagues like to say, it was green as a Danish forest. Did I get that right, Jacob? So --\n\nJacob Thaysen -- President of the Agilent Life Science and Applied Markets Group\n\nThat's right. That's right, Mike.\n\nMike McMullen -- President and Chief Executive Officer\n\nIt was across the board, but I think it's -- the same story holds geographically well. So it really is a nice global story. But I think it's more than just pharma. I know you're getting some good C&E growth, right, for -- in the advanced materials, with LC, LC/MS.\n\nWe posted some really good numbers in food and the environmental market, which also are big users of LC and LC/MS. So I think it was really a broad-based story there, if I remember correctly, Jacob.\n\nJacob Thaysen -- President of the Agilent Life Science and Applied Markets Group\n\nYeah. Correct, Mike. I think we've really seen good performance across the board, as you're saying, Mike. And we are also seeing that the customers are really interested in our full solutions.\n\nI think PFAS is a good example of where we see a lot of interest right now, both right now, but also where we see some of the big builds that is coming through in the U.S., where PFASs have a prominent exposure. So we expect to continue to see momentum in that space.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nI think, Puneet, just to build on what Mike and Jacob were saying, I think one of the things you're really seeing come out in Q3 is just the strength and breadth of our portfolio. And why we haven't talked about spectroscopy a lot in the past, it continues to be a very important part of our portfolio and solution set. And I think it fits nicely across multiple end markets. And the LC and LC/MS get a lot of headlines, but we're more than just an LC and LC/MS business.\n\nPuneet Souda -- SVB Securities -- Analyst\n\nGot it. Thanks for that. And then just -- I'll keep it simple for my follow-up. Polymer Standards acquisition, can you characterize sort of what's the contribution this year? And how does that enhance your offering for columns and sort of biomolecules? And should -- how should we think about that overall acquisition, overall fitting into the LSAG group?\n\nMike McMullen -- President and Chief Executive Officer\n\nYou want to take the first piece of that?\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. Yeah, I'll -- it's not a material business. We estimate that's less than $10 million annualized today. That's the 0.1% that we built into our guide for Q4.\n\nBut more importantly, I think, strategically, I'll let Jacob talk about the merits of the portfolio and how we think it's going to continue to drive growth for us.\n\nJacob Thaysen -- President of the Agilent Life Science and Applied Markets Group\n\nYeah. Thanks for that. And we have a long-standing relationship with PSS, so we knew exactly their strength. And we've been very impressed with what they have done in the polymer business for the -- for a long period of time.\n\nAnd particularly, our interest was intrigued when we also see polymer science going from advanced material, into biopharma, where we see a lot of opportunities. And PSS have done a wonderful job using our instrumentation together with their columns and also an informatics pack they have built, to really go after a segment of the market and also the expertise in the field. They have more than 500 application nodes within this field. So we can really leverage that with the strong presence we have across the globe to really accelerate that business opportunity that has developed over the past decades, really.\n\nPuneet Souda -- SVB Securities -- Analyst\n\nGot it. OK. Great. Thanks guys.\n\nCongrats again.\n\nMike McMullen -- President and Chief Executive Officer\n\nThank you. Appreciate it.\n\nOperator\n\nThank you. The next question is from the line of Rachel Vatnsdal with J.P. Morgan. Please proceed.\n\nRachel Vatnsdal -- J.P. Morgan -- Analyst\n\nHi, thanks for taking the questions, and congrats on the nice quarter. So first up, on China --\n\nMike McMullen -- President and Chief Executive Officer\n\nHey, Rachel. Thank you, thank you.\n\nRachel Vatnsdal -- J.P. Morgan -- Analyst\n\nYeah. Great to hear that some of that catch-up in China was pulled forward there. And then you also pointed to double-digit growth in the region for that ex acceleration recovery. So first off, can you just walk us through specifically what drove that pull-forward on the catch-up from lockdown? And are you seeing an acceleration of demand catch up in China? And then second, how are you thinking about that longer-term growth within China? And could that be a source of upside for the year?\n\nMike McMullen -- President and Chief Executive Officer\n\nGreat. So I'll start, Bob, here. So I would have to say, it was the extraordinary effort of our team in China. I mean people sacrificed and worked tremendously hard.\n\nWe had people coming into our factories and living at the factories. They slept and worked at the factories for the entire period of when before you couldn't really get out beyond -- back to your local community. So they did that for several weeks, both in our logistics operations, as well as our factories. And that allowed us to get our global GC production going, as well as the import/export of our products as well.\n\nSo I have to say, really, it was the extraordinary effort of the team that made that happen. And we're very optimistic about our ability to continue to grow well in China. In Q2, I think we talked about a greater than 20% order rate. We posted a number of 29% growth in Q3.\n\nYeah, we still built backlog in the third quarter in China. So I think we're well-positioned for the fourth quarter. And Bob, I say that probably does represent a level of upside, potentially with things continuing to develop as we hope. The wildcards, from my perspective, are how much money could come into the segment from government stimulus.\n\nI know they're talking about some of the things. We haven't seen any specifics. So that would be something that would be there on a positive. But again, our demand really is coming from the core private sector, commercial sector around pharma and C&E.\n\nWe think those things are sustainable.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. Exactly, Mike. I think you mentioned Q2 kind of order growth rate, and Q3 was in that same range. And so we're seeing very strong demand and been able to do a fantastic job of ramping up that capacity, and we expect that to continue into Q4.\n\nRachel Vatnsdal -- J.P. Morgan -- Analyst\n\nGreat to hear. And then last one for me, just on the C&E segment. So 22% growth is quite impressive, and that growth has really continued to accelerate in recent quarters on that end market. So how should we be thinking about that longer-term outlook for C&E, especially given some of the macro dependence on that portfolio?\n\nMike McMullen -- President and Chief Executive Officer\n\nWell, we think that the structure of this marketplace has changed over the last few years. And yes, that's still a segment that's tied directly to what happens to the global GDP situation. But we've highlighted in my comments, there's secular demand happening here, particularly in advanced materials, when there's investments being made in battery technology, more sustainable materials, semiconductors, onshoring of production. So we think those trends are here for a number of years.\n\nI think our view is the sector has probably got a higher growth rate than we viewed it having a couple of years ago because of the secular aspect of growth in C&E. And Bob, what else might you add there?\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah, I think, as you said, I think one of the things that I think is really important, don't take '22 and take -- build it into your model because we don't think that that growth rate is going to continue. We certainly are pleased with it. But I think the other more important piece is we have a very strong right to win in the C&E business. We're a leader in this space and feel good about our portfolio.\n\nAnd as Mike said, this is an area that we are seeing kind of a renewed sense in some of these areas that we do think that has many years to come in terms of investment.\n\nMike McMullen -- President and Chief Executive Officer\n\nI'm going to use the word, undisputed leader in the space.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nI won't disagree.\n\nMike McMullen -- President and Chief Executive Officer\n\nThanks for the question, Rachel.\n\nRachel Vatnsdal -- J.P. Morgan -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. The next question is from the line of Derik De Bruin with Bank of America. Please proceed.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks for taking the question. This is Mike Ryskin on for Derik. I want to follow up on your comments on price.\n\nYou sort of indicated that price continues to sort of grow as you go through the year. Is that a factor of the timing of when orders are converted to revenues and when you're recognizing those revenues? So it's just more of a dynamic of that, or is this an incremental price increase that you're building in as you go through the year? And just alongside that, any comments you could say in terms of reception to price? Any pushback or any particular areas where you let it take more versus last? Just sort of give us an update on the pricing dynamic as we go through the year.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. Hey, Mike, this is Bob. I'll take that in here. It's the former.\n\nAnd so when we take price, it takes some time to get through the backlog. And so we're seeing the price realization from the orders that -- the price increase that we took back in the beginning of the calendar year. And really, what we're trying to do is cover our costs. And we're seeing increased logistics costs and increased material costs.\n\nAnd so we've taken it across the board, but also recognizing where the costs are higher, we've taken those prices up higher. We haven't really heard any pushback, I think, as evidenced by our strong order growth. And then also we look very closely at cancellations or -- within our order book, and that continues to be very low. And so I think our customers understand why we're having to raise prices because of the inflationary environment.\n\nAnd I think, to date, we've been able to actually generate more price than I think we anticipated at the beginning of the year.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nOK. Great. And then for the follow-up. You've commented on the balance sheet, that you're getting the leverage lower and lower.\n\nI've done a couple of deals here and there in the past couple of years, but they definitely had been -- to be on the much smaller side. So could you talk about your willingness to lever up a little bit, to put a little bit more of that capital to work? And if so, what are the types of assets are you looking for? Sort of are sellers willing to engage in this market? Or is the -- how are things proceeding on that front, on the BD front? Thanks.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. I think we've been public about being willing to take on bigger deals than what we have had historically. I think we're still -- we have the benefit of having a very strong balance sheet. We're going to first invest in our business.\n\nWe think that that's the greatest opportunity, but we're always out on the lookout for M&A. And as you said -- I would say the pipeline continues to be healthy. The dynamic has certainly changed in the last nine months, particularly on the public market side. And I think there's some good assets out there.\n\nIt's probably taken a little longer on the private market side, which is where we tend to focus our efforts. But I can tell you that we have -- the beauty of our model is that we have organic growth first and M&A as kind of an adder on top of that. And so it is something that we're continuing to look at and would be not uncomfortable levering up a little higher than where we are today for the right deal and if the economics work.\n\nMike McMullen -- President and Chief Executive Officer\n\nAbsolutely, Bob.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nIs that, [Inaudible] to be the four times lever or --\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nI'm not -- that's pretty rich. But I think it all depends on what the right asset and what it looks like.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nThank you. Next question is from the line of Josh Waldman with Cleveland Research. Please proceed.\n\nJosh Waldman -- Cleveland Research -- Analyst\n\nThanks for taking my questions. Just two for you guys. First, Mike, wondered if you could provide more context on the supply chain situation, how supply and cost could track versus your expectations over the last 90 days. Have you seen any relief on supply? And then it sounds like you built backlog in Q3.\n\nCurious whether your fourth quarter guide assumes any work-down in the backlog given recent order rates?\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. So I'll let Bob handle the second question, and I'll start with the first one. So supply chain challenges are still out there, but our team continues to do an excellent job navigating them, getting the material that we need for our customers. We continue to have very, very low order cancellation rates.\n\nIt's something we watch like a hawk. And I think we're managing the price changes. So I think in the early days of things, we were kind of surprised at what things would cost on the market for chips and others. But I think we have now found ways to work that and then offset that with some of the pricing actions that we -- I mentioned earlier.\n\nSo I think, if anything, it's probably trending in a more positive direction, albeit is still challenging out there.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. And I would say, on the second question, Josh, I would say, first and foremost, demand continues to be very strong in our marketplace. And so we're expecting order growth to continue into our fourth quarter. As you know, that typically is one of the larger quarters that we have for our sales organization and certainly, for our customers as well.\n\nThat being said, I would expect maybe some slight degradation in backlog just given, again, the deferral that we're talking about within China. But don't interpret that as us seeing anything slowing in the marketplace.\n\nJosh Waldman -- Cleveland Research -- Analyst\n\nGot it. And then kind of along those lines, wondered if the group has any initial thoughts on pharma budget flushing this year given the strength in orders from these accounts. Curious at this point if you're getting any indication that maybe the strength in the order book is reflecting pull-forward or just not seeing that yet?\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah, Josh, I'm going to pass this call over to Padraig. He's the closest to what's going on. As you know, he heads up our One Commercialization, in addition to running our ACG services business. So Padraig, what's your thoughts on that?\n\nPadraig McDonnell -- President of the Agilent CrossLab Group\n\nYeah. No, I think it's pretty steady, Mike. We're not seeing any pull-forward at this point. And of course, the team are very focused on key end-market workflows, where we have the best chance to meet the customer needs.\n\nSo we're seeing a very steady-state order rate with not much pull-forward.\n\nJosh Waldman -- Cleveland Research -- Analyst\n\nGot it. Appreciate it.\n\nMike McMullen -- President and Chief Executive Officer\n\nHey, welcome.\n\nOperator\n\nThank you. The next question is from the line of Jack Meehan with Nephron Research. Please proceed.\n\nJack Meehan -- Nephron Research -- Analyst\n\nThank you. Good afternoon. So I wanted to ask about the chemical and energy -- Good afternoon. So the chemical and energy acceleration.\n\nMy first question is on the chemicals customers. So your commentary sounds pretty bullish. There's certainly been some headlines from some of the big European chemical players that have been a little bit more mixed though. So it would just be great to get your perspective on how you feel about the durability of that customer class and kind of squaring your view versus what we might be hearing from others in the market.\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. That may be more regionally specific to Europe, where we did see a level of growth a little bit slower than we've seen in the Americas and China. So I would say that's probably more regionally specific. And as we mentioned earlier on the call, Europe remains sort of a watch area for us because of, obviously, all these challenges in that region right now.\n\nBut I think we think it's pretty durable right now. I mean I think it's -- remember, the chemical pieces, going into some of these supply chains as fabs go up and other things, so it's fueling some of the efforts in the advanced materials area. And Bob, I know that you and Jacob looked at this a little more closely. I don't know if there's anything else you would add to that?\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nNo. I think you're spot on, Mike. I mean if we looked across the -- all regions grew in C&E as, Mike, you were saying. But -- or Europe was below the average.\n\nAnd so -- but I think over time, that investment in some of these areas, we think, is ongoing demand.\n\nJack Meehan -- Nephron Research -- Analyst\n\nGreat. And then it was only a week ago, the CHIPS and Science Act got signed into law. I'm not sure if you have any early perspectives as to what this might mean for Agilent. If you could call out kind of the businesses that you think could benefit from some of the funding that's going in? And can you just maybe call out what could be advanced materials business to grow this quarter? Thanks.\n\nMike McMullen -- President and Chief Executive Officer\n\nYes. So I'm going to -- I'll let Bob handle the second question. He's got more numbers on the pages than I do in front of him. But relative to the recent enactment by Congress, we see some real upside for us.\n\nAnd we actually were just talking about that before this call. I think the big debate is when is it actually going to release. But Jacob mentioned earlier, PFAS. There's -- what we can see, there's some funding in there for PFAS, which will help our LC/MS and GC/MS business.\n\nAnd then tied to the CHIPS, both the upstream and downstream side of semiconductor fabs that play right into spectroscopy strength that we mentioned as well. And Jacob, perhaps you want to add a few others --\n\nJacob Thaysen -- President of the Agilent Life Science and Applied Markets Group\n\nYeah. I think, I mean, actually, even though spectroscopy and GC are the big winners in the -- related to the CHIPS Act, we actually see, across the board, it's both the mass spec business, also the LC and LC/MS, that Mike was mentioning and then, of course, a lot of our consumables also. And so we see a lot of opportunities here. I think both the CHIPS Act, but also the other bill, the -- what's it called, the --\n\nMike McMullen -- President and Chief Executive Officer\n\nInflation bill, and yes --\n\nJacob Thaysen -- President of the Agilent Life Science and Applied Markets Group\n\n[Inaudible] and the inflation bill here, all of them are driving some of our technologies. So we see a lot of opportunities in that. Now it all comes down to timing here.\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. Yeah.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nAnd the answer to your last question, it was above 30%.\n\nJack Meehan -- Nephron Research -- Analyst\n\nThanks. All right. Super. Thank you, guys.\n\nOperator\n\nThank you. The next question is from the line of Elizabeth Garcia with UBS. Please proceed.\n\nLiza Garcia -- UBS -- Analyst\n\nHey, guys. Thank you so much for taking the question. Congrats on the quarter.\n\nMike McMullen -- President and Chief Executive Officer\n\nSure, Elizabeth, no problem. Thank you very much.\n\nLiza Garcia -- UBS -- Analyst\n\nYeah. Great. So maybe I just didn't catch it, but I know there was the planned shutdown this quarter for NASD. But just thinking about kind of how we should think about kind of to close this quarter and then maybe sequentially as we head into the next quarter for the 4Q.\n\nMike McMullen -- President and Chief Executive Officer\n\nAnd Bob, you and Sam want to tag-team on this one?\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. So yeah, we had a planned shutdown this quarter, expect return to strong growth in Q4 for NASD.\n\nMike McMullen -- President and Chief Executive Officer\n\nAnd Sam, I don't know if you want to add some comments about what you're seeing on the market as well.\n\nSam Raha -- President of the Agilent Diagnostics and Genomics Group\n\nYeah. Thanks, Mike, and thanks for the question. I mean listen, it was a good quarter. We had the planned shutdown you already heard about.\n\nBut I want to note that we are very pleased with the trend that we're seeing, that increasingly, these very therapeutic oligos that we're working on, that the treatment modalities beyond the more rare indications are expanding into diseases for larger populations. For example, you might have seen just the recent news from Alnylam that reported favorable results on their phase 3 study for patisiran. And this is for patients with ATTR for cardiomyopathy. And as Alnylam's supplier for the API and patisiran, we're, of course, excited.\n\nWe also think this is indicative of just generally the trend that we're starting to see in the promise of therapeutic oligos. And our book of business remains strong as we go into the quarter and as we will go into next year.\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. Hey, thanks, Sam. I probably should elaborate a little more, Elizabeth, on the routine. I think it's also important to understand why we were shutting down, right? It's both for routine maintenance, but also a critical milestone in the construction of Train B.\n\nSo we tied the infrastructure together. So that's why we're speaking with confidence about our ability to get revenue in '23.\n\nLiza Garcia -- UBS -- Analyst\n\nGreat. Great news. And I guess, just one more for me, staying on the theme of kind of biopharma. So you kind of -- you've announced the collaboration with APC for real-time process monitoring.\n\nYou also had an announcement with Merck around downstream PAT. It would be great to kind of get your thoughts around the space and kind of the work you're doing here.\n\nMike McMullen -- President and Chief Executive Officer\n\nYeah. I'll make just some high-level comments, and then maybe, Jacob, you want to provide some specifics as well. So we love this space. And we've been putting a lot of our investments over the last several years, targeted at the biopharma space.\n\nAnd you see it reflected now in the growth rates and actually how we're shifting the mix of our pharma business, both in the lab but also plays outside the lab. And Jacob, I know you've got a lot of interesting things happening there.\n\nJacob Thaysen -- President of the Agilent Life Science and Applied Markets Group\n\nYeah. Thanks for that, Mike. And we are very interested in the bioprocessing space, especially from the [Inaudible] perspective, where we truly believe that that instruments will start to move into the manufacturing. Historically, we have had, in the small-molecule space, the QA/QC sitting in a different lab.\n\nAnd now we see the opportunity to bring online, LC and LC/MS technologies, into the bioprocessing space itself or manufacturing space itself. And hence, we have decided and we have made collaborations with leaders in that space, Merck being one of them, where we're developing, of course, based on our individual strength, new solutions to address that. But we're looking at multiple partnerships in this space here, and we're really bullish around that.\n\nLiza Garcia -- UBS -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. The next question is from the line of Patrick Donnelly with Citi. Please proceed.\n\nPatrick Donnelly -- Citi -- Analyst\n\nHey, guys. Thanks for taking the questions. Mike, maybe one for you, just on China specifically, in terms of the linearity of the quarter. Can you just talk about it? I mean it sounds like things clearly picked up as we went, obviously, on the supply side and you guys kind of got back online.\n\nCan you talk about the demand environment as well? Obviously, you guys are the only ones who have kind of a full July in the quarter. So just curious what kind of ramp you saw throughout the quarter. And then again, as we work our way through August here, I mean, it certainly seems like the order growth has been encouraging. But maybe just talk about how things trended there throughout the quarter and kind of going into this quarter.\n\nMike McMullen -- President and Chief Executive Officer\n\nGreat question. Yeah, sure. Happy to do so. I think it's a great question.\n\nAnd I'll parse my response into two areas: orders and revenue. So I think, I would say, the order intake throughout the quarter was there. It was linear, smooth, no big lumpiness and in fact, as what we saw in the second quarter as well. So now, as you know, the revenue side has been a different story because the ability to get product in and out of China, as well as produced in China was affected by the COVID-19 shutdowns.\n\nAnd that's where we saw maybe a slower start, first few weeks of Q3, but then the team's efforts really started paying off when we were able to get back into our facilities. So I think the ramp rate of revenue had looked at a little different profile throughout the quarter. And Bob, I don't know if you would add anything.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. No, that's exactly right. I mean if you think about the months in our quarters, May was very light. As we talked about, we were ramping up, and I think we exited May at like 25% capacity.\n\nAnd then the teams really started kicking it in gear as the COVID restrictions started to ease. And July was very strong as they not only got the production up to full capacity, but then were able to not only satisfy existing demand, but also some of that deferral to bring it in.\n\nMike McMullen -- President and Chief Executive Officer\n\nRight. And they were really focused on meeting the expectations of our customers who wanted the product. And as I mentioned earlier, in my earlier comments, we had teams working a lot of overtime, working in the factories over the weekend. So really, some heroics that got us back on track.\n\nPatrick Donnelly -- Citi -- Analyst\n\nYeah. It's encouraging to hear. And then, Bob, maybe one for you, just on the margin side. You talked about pricing a few times on the call.\n\nCan you just talk about, I guess, the flow-through to the margin side? You basically said it's offsetting some of the increase in costs. Maybe just talk about the give and take on that front in terms of the pricing increases, the cost increases and how we should think about kind of that algorithm going forward on the margin piece.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYes. I think if you looked at our 150 basis points year on year, it was roughly 50 basis points in gross margin and then 100 basis points of leverage on the SG&A opex side. And I think if you looked at that, there was some productivity. As I mentioned, price probably would have kept things flat.\n\nAnd then the other 50 basis points were a benefit of some productivity that the OFS team did and then the volume. That's the thing that really, I think, really helped drive a benefit in gross margin as just the amount of product that was able to be produced through the factories. And so that, I think -- think about pricing as covering our costs and then if those incrementals around better-than-expected revenues drove the margin improvement on the gross margin side. What I would say is we continue to leverage the opex side to drive our productivity as a company overall.\n\nPatrick Donnelly -- Citi -- Analyst\n\nHelpful. Thank you, guys.\n\nOperator\n\nThank you. The last question is from the line of Tim Daley with Wells Fargo. Please proceed.\n\nTim Daley -- Wells Fargo Securities -- Analyst\n\nHey, everyone. Thanks for the time. Just quickly, I wanted to touch back on NASD here. So if we're just thinking about when we're past the Train B buildout, things have kind of normalized a bit, you're starting to leverage those investments and upfront costs here, what's the clean run rate margin profile to think about in that business, I guess, initially when we get past that capacity buildout here?\n\nMike McMullen -- President and Chief Executive Officer\n\nAnd Tim, that question brought a smile to Bob's face. I'll let him answer that.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nI would say very good. I'll leave it at that.\n\nMike McMullen -- President and Chief Executive Officer\n\nAt least 12 is the company average, right?\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYes. Yup.\n\nTim Daley -- Wells Fargo Securities -- Analyst\n\nAll right. I can work with that. And then, I guess, just a quick one here on capital allocation. So another strong quarter of buybacks.\n\nJust thinking about the go-forward outlook, how should we be sizing this in our heads? The $1 billion, you've already hit in '22, with a quarter left to go. Is that a good base for the out-years? Just kind of -- just general thoughts on the capital allocation hierarchy as some assets are probably getting a bit cheaper and more attractive here.\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nYeah. I mean I think our methodology really hasn't changed. And I think what we do is invest for growth, first internally, and then we look for value-accreting M&A. But if there isn't anything imminent, we're also not going to keep cash on the books.\n\nAnd if I looked at historically, we've generated roughly 2% of earnings-per-share growth kind of below the line through share repurchase. And I think that that's probably a fair way to look at it going forward. But in terms of -- to be very clear, our priorities are investing for growth internally and then M&A before we would do share repurchases. And we're also committed to continuing to grow our dividend as well.\n\nOperator\n\nThere are no additional questions waiting at this time, so I will turn the call back over to Parmeet for closing remarks.\n\nParmeet Ahuja -- Vice President, Investor Relations\n\nThanks, Hannah, and thanks, everyone, for joining. With that, we would like to wrap up the call for today. Have a great rest of the day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nParmeet Ahuja -- Vice President, Investor Relations\n\nMike McMullen -- President and Chief Executive Officer\n\nBob McMahon -- Senior Vice President and Chief Financial Officer\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nJacob Thaysen -- President of the Agilent Life Science and Applied Markets Group\n\nBrandon Couillard -- Jefferies -- Analyst\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nPuneet Souda -- SVB Securities -- Analyst\n\nRachel Vatnsdal -- J.P. Morgan -- Analyst\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nJosh Waldman -- Cleveland Research -- Analyst\n\nPadraig McDonnell -- President of the Agilent CrossLab Group\n\nJack Meehan -- Nephron Research -- Analyst\n\nLiza Garcia -- UBS -- Analyst\n\nSam Raha -- President of the Agilent Diagnostics and Genomics Group\n\nPatrick Donnelly -- Citi -- Analyst\n\nTim Daley -- Wells Fargo Securities -- Analyst\n\nMore A analysis\n\nAll earnings call transcripts"
}