{
  "companyName": "Flywire Corporation",
  "companyTicker": "FLYW",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/flywire-corporation-flyw-q2-2022-earnings-call-tra/",
  "content": "Flywire Corporation (FLYW 3.12%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings, ladies and gentlemen, and welcome to Flywire Corporation's second quarter 2022 earnings call. [Operator instructions] I would now like to turn the conference over to your host, Akil Hollis, vice president, investor relations and FP&A. Thank you.\n\nAkil Hollis -- Vice President, Investor Relations\n\nThank you, and good afternoon. With me on today's call are Mike Massaro, chief executive officer; Rob Orgel, president and chief operating officer; and Mike Ellis, chief financial officer. Our second quarter 2022 earnings press release, supplemental presentation, and when filed, associated quarterly report on Form 10-Q can be found at ir.flywire.com. During the call, we will be discussing certain forward-looking information.\n\nActual results could differ materially from those contemplated by these forward-looking statements. We will also be discussing certain non-GAAP financial measures. Please refer to our press release and SEC filings for more information on the risks regarding these forward-looking statements that could cause actual results to differ materially, risk factors associated with our business and required disclosures related to non-GAAP financial measures. This call is being webcast live and will be available for replay on our website.\n\nI would now like to turn the call over to Mike Massaro.\n\nMike Massaro -- Chief Executive Officer\n\nThank you, Akil. Thank you to everyone that is joining us today. We are excited to share our Q2 2022 results with all of you and provide more insights on the future of Flywire. We saw strong performance in the second quarter.\n\nIn a few minutes, Rob Orgel, our president and COO; as well as Mike Ellis, our CFO, will go into greater detail about our operating and financial performance during the quarter. But first, I will start with a few financial highlights. As you will see from our results, we continue to have success in penetrating the significant total addressable market that are education, healthcare, travel, and B2B verticals represent. Total payment volume for the quarter increased 49% compared to Q2 2021.\n\nRevenue, less ancillary services, was 51.5 million, representing a year-over-year revenue growth of 56%, even despite increasing FX headwinds. Adjusted gross profit was 33.2 million in Q2, an increase of 48% year over year. Adjusted EBITDA was negative 6.1 million, which was better than internal expectations, driven primarily by stronger revenue growth. Today, we will be raising our full year 2022 financial guidance for both revenue, less ancillary services, and adjusted EBITDA, which Mike Ellis will share details on later in this call.\n\nI am quite proud of the great results we are sharing this quarter, especially at how the business continues to navigate these exceptional macroeconomic times. Of course, none of this would be possible without our amazing FlyMates. And I'd like to take the moment to thank them for all their incredible efforts. I'll now move on to discuss our industry verticals and trends.\n\nWhile none of us can predict the future based on the historical, current, and expected trends, we believe Flywire is well-positioned for continued growth across our verticals. Education and healthcare have historically been resilient during recessions and economic downturns. Travel, particularly luxury travel, continues to be strong, supported by pent-up demand from the pandemic. And with more businesses focused on digitizing and streamlining global accounts receivable, we expect to see increased demand for solutions like ours in the B2B sector.\n\nLet's take a closer look at trends, starting with education. Education has remained strong even during recessionary periods, with the National Bureau of Economic Research reporting that college and university attendance levels increased even during the Great Recession. Education today is still in the midst of a post-COVID recovery as the international student enrollment volumes normalize and travel restrictions are removed. According to the Institute of International Education's 2021 Open Doors report, total international students as a percentage of total U.S.\n\ncampus enrollment averaged 5.4% pre-COVID in the 2019-2020 academic year versus just 4.6% in the 2020-2021 academic year, leaving room for still further recovery. Additionally, after suffering steep losses in new international student enrollment in 2020 and 2021, U.S. colleges and universities are reporting increasing numbers of international student applications for the upcoming academic year. In fact, new research from the educational consultancy, ICEF, reported that 65% of U.S.\n\nuniversities surveyed this spring said international applications have increased. This is compared to just 43% in the same period last year. Shifting to trends in healthcare, we believe that our healthcare solutions are more relevant than ever, given that the healthcare industry continues to be durable, and the services provided are often non-discretionary in nature. We have seen that healthcare organizations who use Flywire are able to better engage patients through multiple and preferred digital channels throughout the entirety of the healthcare payment experience.\n\nThey can reduce bad debt write-offs and meaningfully increase revenue collections. By offering Flywire payment plans and solutions to their patients, our clients are able to increase affordability of care they provide through our omnichannel engagement software and provide further transparency to their patients. According to a study prepared for Flywire by Forrester Consulting, Flywire healthcare clients can see a 29% increase in revenue collections from our solutions. Looking at travel, American Express recently stated that the travel industry has rebounded, post-pandemic at a faster and stronger rate than anyone expected.\n\nAnd we strongly agree. According to the U.S. Travel Association, for the first time since the start of the pandemic, travel spending in April 2022 was 3% above 2019 levels. Approximately 28% of surveyed travelers plan to spend significantly more this summer compared to their summer 2019 travel budgets despite higher prices.\n\nAgain, these trends and our strong growth in travel continues to validate the large and growing opportunity we have with our solutions. As for our B2B vertical, we continue to work with many businesses to automate their accounts receivable and enhance their order to cash workflows. We are seeing particular success in businesses who already have international clients with those looking to expand globally, because our solutions eliminate many operational challenges related to international invoicing and payments, while also improving the customer experience. According to a recent survey from Globalization Partners, 83% of CFOs feel their long-term plans will focus on expansion into new countries, despite mounting concerns around rising wages and inflation.\n\nTo conclude on the trends we are seeing across our verticals, while the global economy may be uncertain, we continue to feel confident about the opportunity ahead of us here at Flywire. Next, I wanted to spend a few minutes providing an update on the investment areas that we outlined at the beginning of the year and during our recent analyst day event in May. Flywire had a successful investment track record. Our approach of taking long term view, but also ensuring clear prioritization based on expected ROI has helped us grow this business while establishing multiple deep and strategic moats.\n\nWe were able to enter new verticals, leveraging our core platform, expand our geographic footprint, and effectively acquire and integrate organizations that further Flywire's mission and accelerate our performance. We believe it is strategically important to keep investing in our Flywire advantage, which is made up of our next-generation payment platform, our proprietary global payment network, and our vertical-specific software. Earlier this year, we laid out that 2022 will be a record year of investment for Flywire as we accelerated key initiatives in multiple areas of the company. At our analyst day, we shared more details of these investments, which include increasing our go-to-market team, further geographic expansion, and investing in our product and payment innovation teams.\n\nLet me first start with expanding our go-to-market. Our goal is to capture the significant total addressable market and opportunities that you've heard us talk about. We are investing in two main areas. First, more FlyMates sales and relationship management.\n\nAnd second, optimizing our digital acquisition capabilities. We have prioritized our hiring around go-to-market roles this year and are very pleased with the amazing talent we've brought into the company so far. We've also improved the way we onboard our new go-to-market fly to be more efficient and effective. This has generated a significant improvement in sales rep ramp time and a nearly 2x increase in pipeline value when comparing the first half of 2022 versus the same period of 2021.\n\nIn addition, with just a modest year-over-year increase in our digital acquisition investment, we are already seeing impressive returns in sales pipeline generation and new client signed ARR. Next, I'll move to geographic expansion. Flywire is truly a global company. We believe there continues to be unique opportunity to expand globally to serve our clients and our customers.\n\nAlmost 2/3 of our Q2 2022 ARR signed with outside of North America. And through the end of Q2, we have more than doubled the number of FlyMates across India, China, Australia, and Latin America compared to the same time last year. We believe our proven ability to hire talent around the world maximizes our local market understanding and improves our ability to service our customers. This is a major differentiator for Flywire.\n\nAnd finally, I'll cover our investment in product and payment innovation, where we are focused on creating even more value for our clients, their customers and the broader industries that we serve. This quarter, we continued to expand our payment network and improve payment experiences around the world, from heading a new local method in Colombia as part of our Latin expansion to improving the payment experiences in India by streamlining required regulatory forms, to enhancing local payment acceptance in Europe through the expansion of direct debit capabilities. Our strategy is to continue to solve complexity for our clients, ultimately expanding our Flywire advantage to power these vertical ecosystems. In closing, as many of you are aware, we recently announced the acquisition of Cohort Go, which fits into our core M&A pillars we have discussed many times with all of you.\n\nCohort Go is an international education payments provider that brings additional students, education agents, and essential student services to Flywire's growing payment ecosystem. This deal also deepens our commitment to product and payment innovation and helps us further invest in Asia Pacific, a key near-term geographic focus for Flywire. We are thrilled to welcome over 50 new FlyMates from Cohort Go into our Flywire community. We're excited to have their expertise and capabilities as we expand Flywire strength even further in education.\n\nWhile Cohort Go's revenue is relatively small compared to Flywire's overall revenue, Mike Ellis will share an updated guidance for the full year, which incorporates the expected incremental impact of this acquisition. Additionally, I'd like to mention that the integration of WPM continues to go well. We are seeing great momentum with our education clients in the U.K., who are adopting our solutions. With that, I'd like to turn the call over to Rob Orgel, our president and COO, to share updates on our operating results and growth initiatives during the second quarter.\n\nRob?\n\nRob Orgel -- President and Chief Operating Officer\n\nThanks, Mike, and good afternoon, everyone. Our strong results this quarter reflect continued execution of our growth strategies. We saw strength in bringing on new clients with the addition of over 140 new clients in the quarter. This brings our client count to over 2,800.\n\nAnd consistent with our recent quarters, we also had success in getting more payments and payment share by cross-selling to existing clients. I'd like to highlight some of our successes across the verticals. Starting today with travel, we continue to see strength in travel, especially in our European clients. As of the end of the second quarter, our India destination management clients have delivered revenue in the first two quarters above our full year expectations for that segment.\n\nWe continue to see strong new client growth, as well as contribution from clients we acquired since the start of the COVID-19 pandemic. In the quarter, we formed a relationship with Travel Connect, which is the parent company of our existing client, Nordic Visitor. They chose to expand the relationship with Flywire based on the quality of service and cost savings for them and their traveling customers, which they saw from our initial deployment. Travel Connect own six luxury travel brands, which includes five destination management companies and one accommodation provider.\n\nWe signed an agreement with Travel Connect to allow us to offer Flywire payments and software services through all of their entities. In the Asia Pacific region, we also saw a meaningful recovery in our clients' business activity. In June 2022 alone, our APAC travel clients used our solutions to move more money than was moved by Flywire in the region during the entirety of 2021 in this segment. Our APAC clients have also indicated that they are starting to receive deposits for travel bookings for the last three months of 2022 and also into 2023.\n\nWe added AYA Niseko, a luxury accommodation provider in Japan. AYA Niseko chose Flywire as its payment platform because of our strong integration with RoomBoss' property management system and flying wires, ability to process not just card payments but also handle more complex international bank transfers. Prior to using Flywire, AYA Niseko had separate solutions to collect payments depending on the payment methods involved. With Flywire's single integrated receivables solution, AYA Niseko can now pay lower card payment fees, offer more payment options to their guests, and tightly integrate their payments collection with their core property management software.\n\nOn to healthcare. We added several new clients in the quarter. We continue to focus on building our omnichannel patient engagement capabilities to help our healthcare clients increase plan signups and payment dollars. The client benefits of using Flywire are real.\n\nOver a sample of six of our healthcare clients, our clients saw immediate increase of 49% in plan signups and a 13% increase in patient payment dollars within three months of launching omnichannel engagement after implementing Flywire's solutions. We signed one of the nation's leading health systems with over 40 hospitals, and we'll partner with them to leverage our full suite of services to simplify their patient payment experience, improve their digital self-service, increase collections, and lower costs through reducing placements to collections agencies after a competitive sales process, Flywire was chosen due to our deep integration with Meditech and Epic EHR systems. These integrations are critical for hospitals already using these systems and, when combined with the strength of our digital engagement and payments model, helps drive patient self-service, reduce placement costs, and increase cash collections. We continue to innovate with our health systems to drive digital engagement and payment throughout the patient lifecycle.\n\nFor example, one of our existing healthcare clients, Banner Health, which is based in Phoenix, Arizona and serves over 6.5 million patients and has created an application to provide their patients with a digital self-service check in process. This allows the patient to check in for their scheduled visit, complete any privacy forms, review or complete insurance information, and make payment for their portion of the visit, all in a self-service fashion. Flywire integrated our healthcare payments experience into this new application to provide a cohesive experience for Banner Health's patients at every payment touchpoint from pre to post service. Flywire is delighted to continue to partner with Banner to provide the best financial experience for their patients.\n\nOverall, our healthcare team worked hard through Q2 and into this quarter, resulting in a strong period for deployment. And we are excited for the opportunity to deliver results for a number of new clients. Moving on to education. In addition to the recent Cohort Go acquisition Mike mentioned earlier, we continued to see strong performance across segments and geographies.\n\nIn particular, we saw exceptional results from our cross-border education segment, as we outperformed in the United Kingdom and Canada, and non higher education segments rebounded stronger and faster than we anticipated. Helped by our focus on the K-12 education subsegment and our partnership with Tru North, we signed five new Canadian K-12 district school boards during the quarter, with the expectation there is additional opportunity going forward. For example, we signed one of the top five largest district school boards in Ontario with more than 100,000 total students across 200-plus elementary and secondary schools in the region, creating an excellent cross-border opportunity for Flywire across these district school boards as they enroll international students. Here in the U.S., the University of Rhode Island went live in April with our full CRM system offering.\n\nURI I is the flagship public research university in the state of Rhode Island with over 18,000 undergraduate and graduate students, representing 48 states and 76 countries. URI is processing all domestic and cross-border tuition payments through Flywire. We also expanded our relationship with the University of Chicago, ranked No. 6 in the U.S.\n\nNews and World Report's 2022 best nationally university rankings with over 17,000 undergraduate and graduate students. U-Chicago added our A/R collect and international payment plan product offerings. We look forward to continuing to build our relationships with both URI and University of Chicago. We also announced a new strategic partnership with Universitas XXI, a student management system focused on servicing higher education customers throughout Spain.\n\nThis partnership aligns with Flywire commitment to expanding further into markets. Our payments integration allows flier to be the payment option at any point in the end-to-end student lifecycle from initial application through tuition. Universitas XXI has a very strong reputation in Spain and has been a successful referral source for our field reps in the Spanish higher education market. Our integration with Universitas XXI supports a complete one-door payment strategy, which includes domestic payment flows for all clients in Spain.\n\nOne final update on our education vertical. Since the WPM acquisition closed, we have signed agreements with more than 20 U.K.-based universities to process international payments through an existing WPM pathway. The first customer go live happened in June, more have gone live in July. And we are anticipating several others to go live throughout the third quarter.\n\nFinally, in our B2B segment, we continued to grow our customer base and to expand with existing customers and this emerging segment. This quarter marked the largest signed ARR quarter for the B2B segment to date, with revenue from our B2B clients generating a strong triple-digit growth rate versus the same period in 2021. For example, Export Diesel is a global supplier of diesel fuel injection components. Export Diesel came to us via a referral from our Bank of America partnership.\n\nThis was one of many successful referrals from Bank of America this quarter as the partnership continues to scale. Export Diesel will be utilizing our invoicing software to automate the reconciliation process. And we look forward to helping them in these efforts. We are very pleased with the activity generated by our investments and channel partnerships.\n\nWe continue to deepen our automation capabilities and expand our partner ecosystem. During the quarter, we have enhanced the Flywire-NetSuite integration by building in multiple invoice payment and prepayment capabilities. These features allow customers to easily access a snapshot of open balances while digitizing the netSuite payment experience and reconciliation process. We are seeing that these powerful B2B features are being used across clients in different industries and regions.\n\nFinally, we continue to make great progress across our operations, including strengthening our global payment network, as well as driving internal operational efficiency by leveraging technology to provide great services to our clients and their customers. Also, given the economic climate, we are being mindful on discretionary spending and being thoughtful in the pacing of our hiring. We are focused on what we expect will drive long-term results. Overall, you can see we had another very active quarter with Flywire's global team of FlyMates doing great work across our verticals and across the company.\n\nI would now like to turn the call over to Mike Ellis, our CFO, to review our results for the second quarter and guidance for the remainder of the year. Mike?\n\nMike Ellis -- Chief Financial Officer\n\nThank you, Rob. Good afternoon, everyone. Today, I'll be discussing our non-GAAP financial metrics for our second quarter of 2022, including revenue, less ancillary services, adjusted gross profit, adjusted gross margin, and adjusted EBITDA. For our financial results prepared in accordance with U.S.\n\ngenerally accepted accounting principles, please read the preliminary and unaudited financial statements included within our earnings release and the unaudited financial statements that will be included in our quarterly report on Form 10-Q when filed with the SEC. Revenue, less ancillary services, for Q2 2022 was 51.5 million, representing a 56% increase compared to Q2 2021. Our revenue growth rate was driven by an increase in total payment volume, particularly due to strong performance from our international cross-border payment volumes in our education and travel verticals. We processed 2.9 billion in total payment volume during Q2 2022, which was an increase of 49% from the 1.9 billion we processed during Q2 2021.\n\nSpecifically, transaction revenue increased 72% compared to Q2 2021, driven by a 63% increase in transaction payment volume, platform and usage-based fee revenue increased 14% compared to Q2 2021, driven by a 24% increase in platform and usage-based payment volume. With the platform revenue growth, still being partially offset by the loss of a client and healthcare vertical last year, which was discussed during our protocols and is not yet fully lapped. As mentioned by Rob a few minutes ago, we expect recently onboarded new healthcare clients to contribute to platform and usage-based fee revenue growth in the second half of the year. Moving on to adjusted gross profit, we generated 33.2 million in adjusted gross profit in Q2 2022, representing a 48% increase compared to Q2 2021.\n\nThat resulted in adjusted gross margin of 64.5%, which was lower compared to Q2 2021 due to shifts in revenue and payment method mix similar to those discussed on our Q1 2022 earnings call. Specifically, our transaction revenue continued to outpace our platform and usage-based fee revenue, and we saw a payment method shift toward credit cards due to the growth within our travel vertical and domestic transactions within our education vertical. Overall, our Q2 2022 net spread on transaction volumes remained stable compared to Q1 2021. However, due to the outperformance of our credit card heavy travel vertical and domestic transactions within our education vertical, we expect adjusted gross margins for full year 2022 in the middle to lower end of the full range of 65% to 70% shared at the analyst day.\n\nAs we have previously discussed, our business and payment method mix drives our adjusted gross margin. And we remain focused on our many opportunities to add value for our clients and to drive gross profit. We were particularly pleased with our revenue volume and adjusted gross profit growth considering the foreign exchange headwinds we faced at the U.S. dollar strengthened against the British pound, the euro, and the Canadian dollar.\n\nThese FX headwinds reduced our revenue nominal terms compared to Q2 2021 from transactions in which we settled in British pounds, euros, and Canadian dollars. Moving on to operating expenses, technology and development expenses were 13.2 million for Q2 2022, representing an increase of 91% over the 6.9 million incurred during Q2 2021. We continued with our strategic investments within our technology and development teams as we added 120 new FlyMates over the past year. The cost of these new FlyMates, combined with higher stock-based compensation and amortization expense associated with acquired intangible assets, accounted for the majority of the increase in our technology and development expenses.\n\nSelling and marketing expenses were 18.9 million for Q2 2022, an increase of 73% over the 10.9 million incurred during Q2 2021. Selling and marketing is another area of strategic investment, and this increase was due to a number of factors. First, personnel costs increased due to our hiring efforts over the past year, where we added over 110 new FlyMates within our sales, marketing, and product teams. Second, based on our strong revenue growth, sales commissions also contributed to our increase in selling and marketing expenses.\n\nThird, we continued to invest in our global marketing initiatives to drive client acquisition and payer engagement. And finally, we saw increases in stock-based compensation expense and higher travel cost for client visits and Flywire collaboration. General and administrative expenses were 20.0 million during Q2 2022, an increase of 47% over the 13.6 million incurred during Q2 2021. The primary factors driving the increase were, number one, our hiring activities where we increased the number of FlyMats by 45%.\n\nNumber two, higher stock-based compensation expense. And number three, incremental cost associated with operating as a public company, which consisted primarily of insurance cost and professional fees. Adjusted EBITDA for the quarter was negative 6.1 million, which was better than our expectations for Q2 2022. Due to stronger-than-expected revenue and adjusted gross profit, as well as personnel cost savings as we paced our hiring, adjusted EBITDA decreased 6.0 million compared to the negative 0.1 million we generated during Q2 2021.\n\nThe year-over-year decrease in adjusted EBITDA was the result of our hiring during the past year, as well as increased cost from operating as a public company and travel-related costs. With respect to capitalization, as of June 30, 2022, we had 360.6 million in cash and cash equivalents and 25.9 million in long-term debt. As of June 30, 2022, we had 107.9 million shares of common stock outstanding, which was higher than the weighted average shares outstanding used to calculate net loss per share for Q2 2022 due to the timing of our IPO. Moving on to guidance for full year 2022, we are raising our guidance for revenue, less ancillary services, to be in the range of 260 million to 269 million, which results in an annual revenue growth rate of 46% at the midpoint.\n\nOur full year 2022 expectations reflect an increase in our organic revenue expectations, even in the face of current FX headwinds, plus revenue from our recently announced acquisitions of WPM and Cohort Go. Further movements in exchange rates representing additional FX headwind could impact our revenue and adjusted EBITDA expectations for the remainder of 2022. With respect to adjusted EBITDA, we are raising our full year 2022 guidance to be in the range of 13 million to 17 million, reflecting our current view about continued growth and execution in the business alongside continuation of our previously announced growth and investment plans. With respect to guidance for Q3 2022 revenue, while ancillary services is expected to be in the range of 87 million to 90 million, which represents a year-over-year revenue growth rate of 42% at the midpoint as we enter our historically highest revenue and adjusted EBITDA quarter.\n\nWe currently expect to generate positive adjusted EBITDA in both Q3 and Q4 of 2022. In conclusion, we are pleased with our Q2 2022 financial results and overall business performance, and we continue to look forward to the rest of 2022. With that, I'd like to turn the call over to the operator for questions. Operator?\n\nOperator\n\n[Operator instructions] The first question comes from Bob Napoli of William Blair.\n\nBob Napoli -- William Blair -- Analyst\n\nHi. Thank you. Good afternoon. Nice job on the quarter.\n\nYou had good results. So, I just would like to get some clarification on the upside versus your guidance. How much of that came organically versus any other contribution? Maybe give some color on the contribution of Cohort Go, WPM. So, if you could just unpack the the upside, if you would.\n\nMike Ellis -- Chief Financial Officer\n\nSure. Thank you, Bob.\n\nMike Massaro -- Chief Executive Officer\n\nSure. Thanks, Bob. We're going to let Mike Ellis handle it.\n\nMike Ellis -- Chief Financial Officer\n\nHey, Bob, thanks for the question. So, essentially, we increased our annual revenue guidance by approximately 11.5 million. The breakdown of that comes from 5 million from our Q2 revenue outperformance. The remaining comes from 5.5 million from contributions from the recent acquisition of Cohort Go.\n\nAnd again, that represents about five and a half months of the year, given the acquisition closed in the middle of July. And then the final amount is another million dollars from expected continued strong organic revenue growth offset by continued FX headwinds. And just with respect to Cohort Go, I just want to highlight that there's been some inquiries around their revenue projections that have been seen in some publications that happened or that were published prior to our acquisition. And we wanted to kind of avoid confusion around those numbers.\n\nBut for clarity, any forecasts that you might have seen prior to acquisition in the press were in fact in Australian dollars. And number two, those forecasts were from a private company and there were projections made at the beginning of their full year. So, just for clarity purposes to give you a little bit of sense of how we unpack the revenue and what we've included, but certainly an organic beat that we expect and that's why we raised our guidance, which is included in there.\n\nBob Napoli -- William Blair -- Analyst\n\nGreat. Thank you. And then this has been a very high investment year for the company, and you've had very good momentum in the business. What should we expect as we go into 2023 on investment as -- I mean, I would imagine that the investment levels is relative to revenue may moderate some.\n\nCan you keep the momentum growing in the business with some moderation in the investment levels versus this year?\n\nRob Orgel -- President and Chief Operating Officer\n\nBob, this is Rob. And I'll jump in and take that one. But thanks for that question. And I can tell just from the way you phrased it, that your understanding very much matches our expectations for how things will unfold going forward.\n\nSo, we called out that this was a significant investment year for the company, both across go-to-market, as well as R&D. We're excited about those investments, and I remind everyone those are intended as sort of long-term investments with long term-returns. But as we grow the company, just as you say, we do see scalability across multiple of our functions, and we would expect to see some moderation in that hiring pace. You know, as we continue to grow the revenue line.\n\nBob Napoli -- William Blair -- Analyst\n\nGreat. And the momentum in the business, I guess, that's the big question is, just the top-line momentum, you know, as you know, some moderation of investment levels.\n\nMike Ellis -- Chief Financial Officer\n\nYeah. I'll just jump in. Bob, this is Mike. You know, I would say we feel quite confident in the business where we're sitting.\n\nYou know, as Mike said, you know, not only a beat but a raise organically as well. You know, there's obviously an uncertain world out there, but we feel really good with the trends we're seeing. I talked about it in a number of points I made earlier. And I think we feel really good about where that leads us throughout years.\n\nBut we'll continue to make good investments that we think have good returns, continue to grow the business when we can, but do so with that financial mindset that we talked about at length over the last year.\n\nBob Napoli -- William Blair -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Dan Perlin of RBC Capital Markets.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nThanks. Good evening, and great quarter. I just wanted to get clarity on the commentary around gross profit. I think you had said 65% to 70%.\n\nAnd then I think you were just kind of trying to clarify that you're going to be toward the mid to lower end of that range. So, first was that -- I just want to clarify that. And then secondly, if that's the case, maybe just remind us again why the material ramp, how confident you are in that to the second half of the year relative to the first half?\n\nMike Massaro -- Chief Executive Officer\n\nYeah. Thanks, Dan. So, yeah, that's what we were thinking that the annual range will come in to the mid to the lower part of that range. And it really comes down to the outperformance that we've seen across all our travel verticals and our domestic transactions within our education vertical.\n\nThat's been an excellent revenue driver and excellent adjusted gross profit driver for the business. We do expect adjusted gross margins to come in higher in the second half of the year due to the cross-border education business and as a result of the payment methods typically selected for those larger payments. We do get to enjoy higher adjusted gross margins toward the higher end of that range for that quarter. And we would expect that Q4 would be similar to Q1 in Q2 in numbers, rounding out to around that mid to low end of the range as communicated.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nOK. No, that's super helpful. And then just a quick follow-up in the education vertical, you were talking about the Canadian market. You signed five new district school boards in K-12.\n\nI'm just -- you know, I oftentimes just think mostly of you in terms of universities and such. But in that example, it sounds like you're making some really good inroads into the K-12 space. So, I'm just wondering, are there investments that you're making in that? Is that just a couple examples you're just trying to pull out specifically for this quarter? Or are there some real initiatives that you put behind it and you're starting to see some good outcomes? Thank you.\n\nRob Orgel -- President and Chief Operating Officer\n\nHey, Dan. This is Rob. I'm happy to start this one off. You know, I think we've always wanted to make sure people understood the breadth and the diversity of the education space.\n\nWe've always talked about that diversity as not being just higher ed, but higher ed plus vocational plus K through 12 plus language schools plus summer programs and other categories as well. We've also described it as a very global business. So, there is that diversity and breadth. That is part of the strength of the business.\n\nNow, we do have as part of this go-to-market investment that I described for you earlier, initiatives against a number of these segments that are intended to allow us to accelerate. One in particular was to be able to do more around that sort of K-12 segment. That's been a business of ours for some time. But by putting some more energy against it, looking to the opportunity to accelerate it, and I'll tell you that we've enjoyed success on that, not just in Canada but in other parts of the world as well.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nThat's great. Thank you.\n\nRob Orgel -- President and Chief Operating Officer\n\nThanks, Dan.\n\nOperator\n\nThe next question comes from Andrew Bauch of SMBC Nikko.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nHey, guys. Nice set of results here. Wanted to unpack one of the comments you had on the call, Mike, that the pipeline that you see today is 2x where we were last year. So, if you could just help us kind of dimensionalize where that is.\n\nI assume the bulk of it's in education. But is there opportunities in domestic side? Are you cross-selling at a higher rate, or any way that we can kind of unpack that?\n\nMike Massaro -- Chief Executive Officer\n\nYeah. I would say, you know, I would say that growth is happening across all verticals. So, that'd be the first comment I would make. I would say that's also coming from land and expand, which is the domestic strategy that we've highlighted numerous times where we're going from just doing cross-border services to expanding into more of our product offering in the education vertical.\n\nIt's also coming from there. And then I would just also highlight the mention I had earlier as well about pipeline strength and signs coming from overseas in the business from an ARR perspective. You know, it's truly a global business. It's getting more and more global.\n\nAs Rob said, it's also diverse as you get into the industries and the subsectors within those industries. And so, I would say all those factors are leading to that exceptional increase to pipeline and super excited about it for the future.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nYeah, it's a pretty exciting opportunity to have that level of visibility. And my follow-up was, I think you said you signed 20 of the WPM clients in the U.K. throughout the quarter or thus far through, what, eight or so months? But is this the kind of pace we can assume as far as the penetration of WPM? I think they have over 175, if I'm not mistaken. But just trying to understand if this is what we can expect for that initiative.\n\nMike Massaro -- Chief Executive Officer\n\nYeah. You know, I would say we're super happy with obviously the success we've had. You know, so I wouldn't say that this is either, you know, massively ahead of pace or, you know, or anything behind. I think it's, you know, above our expectations.\n\nBut I wouldn't say it's massively likely to accelerate or slow down. You know, our goal is to really get out there, continue to tell the story to these clients. You know, they all ultimately need to make their own decision as to when it's the right time to have the integrated offering. But the more case studies we get out there, the more clients that are talking about this integration, I think it's going to lead to more and more of those U.K.\n\nclients seeing the benefit of the integrated solution. And the team is just doing a great job communicating that value to customers. So, super excited about the results. You know, beat our projections as to what we were thinking internally.\n\nBut, you know, I think it's a reasonable pace to continue, but nothing we're putting in stone.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nGot it. Appreciate the color. And nice set of results here.\n\nMike Massaro -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Darrin Peller of Wolfe Research.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHey, guys. Nice job today. When we look at the land-and-expand versus the new clients you're adding, if you could just help us understand a little more of what you're seeing there. And then maybe to add on to that, on a vertical-by-vertical basis, are you seeing any evidence that any change in behavior just doesn't sound like there's any macro changes? But any color would be great on specifically travel, but anything else you're seeing would be great.\n\nMike Massaro -- Chief Executive Officer\n\nYou want to talk about it?\n\nRob Orgel -- President and Chief Operating Officer\n\nSure, I can start off. So, there and you've heard us describe sort of land and expand. That has been pretty fundamental to our strategy. You've heard us talk a lot about and NRR and LTV to CAC.\n\nWhat I would tell you is that, you know, we continue to execute very successfully against that playbook. You know, we're not doing sort of quarter-by-quarter disclosure on NRR. But I can tell you that the NRR is coming in -- came in very strong for the quarter, once again above our our three-year average. And so, we continue to do things like the case study that I describe for this announcement for URI, similarly for University of Chicago.\n\nBoth of those are preexisting clients in other areas where they've chosen to expand their their opportunity with us, or their use of our solutions. So, you know, that's sort of a big part of the Flywire playbook. We continue to do very well at that. Of course, I also mentioned a bunch of net new clients.\n\nSo, we're continuing to sign up new clients very well. And I also mentioned 140-plus, you know, new clients for the quarter. So, overall land-and-expand, as well as net new clients continue just to happen. You have to be particular about travel.\n\nAnd I think the context. there, the highlights there are the travel is obviously was particularly strong for us in the quarter. We called that out in our earlier comments. That would translate into both NRR for existing clients, very, very strong in the travel vertical, as well as being very pleased with the pace which we're getting travel clients live and they're generating good revenue for us and payment volumes that are associated with that revenue.\n\nMike Massaro -- Chief Executive Officer\n\nYeah. The only thing I'd add on there, Darrin, is just, you know, if you look at travel, you know, really encouraged. I mean, you know, we talked a lot of detail this day about, you know, how we see opportunities for these vertical ecosystems to do more for clients. I would say we feel even stronger about that opportunity in places like travel.\n\nAnd then, you know, if there was a call out for travel, definitely, the team did an amazing job in Europe in particular, right? That definitely kind of came back and came back strong from a travel perspective as a trend.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nAll right. That's helpful. Thanks, guys. Can we just revisit for a minute the deals you guys did? Both of them, actually, in terms of the magnitude of what you could see or, you know, the execution you can do on synergies and the top-line synergies potentially? Maybe just each one of them would be great to hear more about.\n\nI know WPM has opportunities on the volume side shifting over, but I think there's opportunities on both. And I'd love to hear a little more if you can.\n\nMike Massaro -- Chief Executive Officer\n\nYeah, sure. So, you know, Dan, I'll kind of remind folks what we had said at WPM. WPM was a business that was very much platform- and usage-based revenue. It was also a business that, you know, I would say, was not run for high growth, right, but focused on clients and engagement of those clients and driving value.\n\nSo, the opportunity we see, obviously, as we've talked about before, is monetizing that payment volume. And we've said that, you know, we see multiple billions of dollars of payment volume sitting within that opportunity. And so, again, that's going to materialize over, you know, not only '22, but '23, '24 as we get the integrated solution live and as you start to see the full year effect of that volume come through, right? And so, you know, really great result of the number of clients who have signed up for that integrated solution. But those are going to get live.\n\nYou going to see the full year effect, which is all great, you know, indications for medium and long-term growth for Flywire. On Cohort. Again, Mike I think was pretty clear as to what you expect through the end of this year. And again, I think if you the assumption that we believe both that is an accretive business for us both on top line and bottom line.\n\nLike we said in the announcement, you know, we feel really good about driving synergies there. You know, we're not doing these deals to cut. We're doing these deals to grow and invest, right? That's the type of businesses that we like. And so, it's really about growth for us.\n\nYou know. And the other thing I'd highlight, cohort is really around not only Asia Pacific but also those educational agents. We talked about that trend quite a lot at analyst day. It's a major trend inside the education sector.\n\nAnd so, our education team and business coming together with the Cohort team, you know, kind of unmatched class, in our opinion, on the opportunity ahead of us. And so, again, I think that's going to all materialize, you know, over the medium, long term as well. OK, Darrin.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nOK. That's great. It does. I know -- just to sneak one in, the FX impact expectations now versus prior.\n\nIf you could just remind us real quick.\n\nMike Massaro -- Chief Executive Officer\n\nSure. Mike, you want to --\n\nMike Ellis -- Chief Financial Officer\n\nSure. So, as we disclosed in our most recent press release, we do have some FX headwinds predominately around a couple of currencies. We've built that into our guidance for the full year. And we're talking about single to mid millions relative to the FX headwinds that we're seeing for the full year.\n\nAnd that breaks up by quarter. Relatively not material in Q1 at all. And we're just managing it. But our guidance does in fact assume that the existing currency conversions with these currencies remain stable where they are today over the remaining period of 2022.\n\nMike Massaro -- Chief Executive Officer\n\nYeah. I'd highlight, Darrin, obviously, with those FX headwinds, you know, if you didn't have those, you would have seen even higher growth than was reported this quarter. So, hopefully that helps clear that up.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nNo. Yeah, absolutely. Thanks, guys. Appreciate it.\n\nOperator\n\nThank you. The next question comes from Ashwin Shirvaikar of Citi.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you. Hey, Mike. Mike, good quarter here. Congratulations.\n\nMike Massaro -- Chief Executive Officer\n\nThank you.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nLet me start -- hey. Let me start with maybe 3Q versus 4Q EBITDA. You know, last couple of years 3Q EBITDA margin has been sort of in the 27%, 28% range. I know you mentioned a couple of moving parts there, you know, including the upper part of the range for gross margins.\n\nWould the 27%, 28% range for EBITDA be kind of what one should expect? And I think the broader question there is, obviously, that, you know, that would imply that 3Q EBITDA contribution is greater than sort of full year contribution. Is that a pattern one should expect would dissipate, say, in the next couple of years as we think of quarterly contribution?\n\nMike Ellis -- Chief Financial Officer\n\nThis is Mike Ellis. So just to level set, I believe the 2021 adjusted EBITDA margin was closer to the 12% or 13% range. And what we've shared at analyst day, you know, our initial guidance for 2022 was right around the 5% range for adjusted EBITDA. And we indicated that we think and feel confident based on our revenue profile and growth profile that we could add, you know, roughly 3% to 4% per year up until, you know, getting to a higher adjusted EBITDA percentage.\n\nWe would expect, at least in the short term, that the revenue composition and the adjusted EBITDA composition that you've seen seasonally historically would continue on in the short term. We are -- we did provide some level of guidance as it relates to adjusted EBITDA that they will both be positive in Q3 and Q4. But I'd urge you to look at the seasonality that we've seen historically in Q3 and Q4 to level set those for your own modeling.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nOK. OK. Now, I was just wondering with some of these acquisitions and mix changes with, you know, travel and B2B and so on so forth growing, if that was going to going to change. The other question I had was payment method mix.\n\nCould you remind us sort of what it is today and how you would expect that to maybe evolve over time? I know that does have a bearing on where adjusted gross profit lands.\n\nMike Massaro -- Chief Executive Officer\n\nYeah. One thing I'd say on payment method mix. So, we talked before. You know, if you look at our broad set of volume, the vast majority of volume being bank transfers.\n\nAgain, that's the history of the education business in a large sum of the transactions on that side of the business. What does happen throughout the year is you see different average transaction sizes. You also see different payment method mix by vertical, right? So, you really have to be looking at that vertical mix for revenue and the payment mix that's almost inherent in the transaction sizes and/or the industries, sometimes even the geographies that those payments are coming from. So, again, you know, vast majority of transactions be it bank methods.\n\nAgain, higher gross margin methods. But again, depending on that type of average transaction value, you could see a different mix of cards or even just the inherent choice of the payer will change the mix of cards or payment -- bank transfers or third-party payment methods within a given industry.\n\nMike Ellis -- Chief Financial Officer\n\nYeah. The only thing I would add, this is Mike Ellis, is that we're really committed to driving adjusted gross profit growth. We'll let the adjusted gross margin come where it is because we're very confident in the unit economics across our payment methods and our payment types. But as Mike said, you know, as payment method mix shift, as well as you've seen in the prior two quarters, revenue from transactions really outpacing our platform and usage-based fee revenue, which is also a driver of this, you know, this adjusted gross margin number that might be from the mid to the low end of the range for the full year, but still really healthy adjusted gross profit growth, which we're very proud of.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nIf I can ask a quick clarification on that platform versus transaction. I was assuming some of that at least was a recovery from COVID, you know, trends where transactions might have been lower. That's it.\n\nMike Massaro -- Chief Executive Officer\n\nAshwin, I'm not sure I'm totally following that one. Can you just sort of ask us that one more time in terms of the trend that you're trying to inquire about?\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nYeah. You know, as Mike mentioned, the transaction revenue growth has outpaced platform and usage growth by quite a bit. And I was assuming that at least one of the contributors to that was probably sort of a COVID recovery, if you will. And I just wanted to confirm that was true.\n\nMike Massaro -- Chief Executive Officer\n\nAshwin, I think our view of this is that there's obviously COVID dynamics that are coming into place in different geographies and different verticals. But overall, what you're seeing here is just a strong recovery across all of our business units, right? You're seeing that transaction volume grow across education, across travel, across B2B as well. So, while we're early in some of those segments, they're all growing very nicely. And, you know, perhaps there's some interplay of COVID there, but it's also a function of new client signings, our land-and-expand, all the things we're doing to continue to grow the business in all of those clients.\n\nMike Ellis -- Chief Financial Officer\n\nYeah, I would just add, Ashwin, remember full year effect as well, right? So, when you when you end up seeing transaction volume growth, you may have only gotten a certain amount of transactions from a given account that were signed a year prior, right? So, relatively low impact on in-year revenue, but also that's driving transaction growth over time as well.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nUnderstood. Got it. Thank you.\n\nOperator\n\nThe next question comes from John Davis of Raymond James.\n\nJohn Davis -- Raymond James -- Analyst\n\nHey. Good afternoon, guys. Mike, you made some comments in prepared remarks about kind of there's still some some education recovery to come. I think the numbers you gave would more like a 15% or 17% of uplift still that's not there from education as far as kind of students attending school.\n\nSo, first off, would you expect most of that to come in the third quarter, kind of this school year? Or do you think it's going to take multi years? And if so, does that mean you would probably have an NRR number that is above kind of if you go back to 2018, 2019? Do you still kind of have some recovery juice in education?\n\nMike Massaro -- Chief Executive Officer\n\nYeah. Hey, JD. I think you're thinking about it the right way. You know, we've always said and a lot of you've heard it said a long time, we've always felt this this rolling recovery, right? And and I think we even said, you know, into 2023.\n\nAnd that continues to play out as true. And to give you some more context on that, think within education, right? You know, universities in places like Australia and New Zealand didn't fully recover just based on border policies. Japan was very similar. Certain parts of Southeast Asia.\n\nYou also have countries -- obviously, Chinese students. They had some pretty severe lockdowns that were part of China. You have boarding schools and language programs which were hit harder inside education globally just because people weren't willing to take the risk of cross-border travel for maybe a young teenager or for a short-term class. So, those are really a lot of the areas where we think there's definitely going to be some carry-through into '23.\n\nYou know, I think your assumptions on that size in my prepared remarks is right on. That will hit, you know, NRR. And I think it will help continue to drive really solid NRR numbers. But, you know, don't think there's a guaranteed snapback in Q3 or Q4.\n\nWe think that's going to roll into 2023 just based on the geographic peaks within a lot of these markets.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. That's super helpful. And then maybe one for for Mike Ellis. Just kind of circling back to some of the comments you made at investor day.\n\nYou know, if we look at -- you know, you guys outlined some kind of 600 basis points of annual margin expansion. But you guys were very clear at the beginning of this year, you kind of had a one-time step-up. It's an incremental investment. So, is it fair to think as we kind of look out into '23 that you're not going to have those repeat, therefore, you know, I guess, all is equal, you would see margin expansion kind of outsized in '23 from an EBITDA and profitability perspective? Or anything else that I'm not thinking about to trying to defloat kind of onetime step-up in expenses? And how should we think about the margin trajectory going forward?\n\nMike Ellis -- Chief Financial Officer\n\nYeah. I'm happy to take that. Thanks for the question. So, you know, as we talked about during the analyst day, we're very confident in being able to share that that 3% to 6% per year type increase of adjusted EBITDA is what we're signing up for.\n\nAnd from the standpoint of the investment year, we certainly made a significant investment coming out of COVID toward the end of '21, which we're feeling the full year impact in '22. I think both Rob and I shared roughly about a $50 million investment year, which we're continually evaluating for ROI and ensuring that the ROI is there on every dollar that we deploy. It's a very balanced and disciplined approach. We want to be really good stewards of shareholder capital.\n\nAnd I think when you think about moving into 2023, listen, we're going to have some, you know, SOCs compliance and implementation fees that are one-time related in 2022, which may carry over in '23. But we're always looking for scaling and efficiencies within our business, and we'll continue to do that to drive long-term adjusted EBITDA.\n\nJohn Davis -- Raymond James -- Analyst\n\nOK. Appreciate all color. Thanks, guys.\n\nOperator\n\nOur next question comes from [Inaudible] of Truist Securities.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nHi, guys. This is [Inaudible] for Andrew Jeffrey. I just had a question about Cohort Go acquisition. I was wondering if that's a bit of a one-off? Or do you think that there's a little bit more room for M&A in a fragmented market like education payments?\n\nMike Massaro -- Chief Executive Officer\n\nYeah. I appreciate the question. This is Mike. So, you know, I would say we're always, you know, we continue to have three -- always looking for for deals that we think fit our core strategy and thesis.\n\nYou know, M&A pillars we've talked about before, what can help accelerate an industry or geography, what can help drive in our -- or give us additional capabilities or potentially a third pillar expand into a new geography or new industry. Those pillars remain the same. Obviously, our first two deals as a public company have been education-related. You know, we'll continue to look in all verticals.\n\nYou know, I don't -- I don't have, in all honesty, a preference as to one industry or vertical over another. At the same time, you know, we're kind of picky. You know, we want to find great culture fits in both Cohort Go and WPM were companies that we had known for a long time. We attract for a long time.\n\nWe felt there was great opportunity to drive that next level of growth together. And so, you know, I would expect us to do something similar, look for a great company, not only culture but technology and and market opportunity. That's really where we look for inorganic. And I would just highlight, you know, we feel really good about our organic path ahead, right? So, you know, we don't sit here saying we need to do inorganic moves to keep growing this business, but we have the cash position to be able to do it.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nThat's awesome. Thank you. And then just a quick follow up. Are you guys able to provide any color as to what demand looks like for software solutions in healthcare for something like repayment plans and just whether or not you view that as structural or cyclical demand?\n\nRob Orgel -- President and Chief Operating Officer\n\nYeah. So, you know, the health the healthcare vertical continues to be a good one for us. We had a good Q2 in terms of ARR signings in Q2. I think the environment has become even more focusing for healthcare clients because of the sort of the financial pressures that they face, as well as the affordability and financial pressures that their patients face.\n\nSo, our software, you know, one of its key benefits from the hospital perspective is that it is helping drive a higher collection rate and lower cost internally. You know, they're having the same challenges hiring that lots of folks are and they have a real imperative to try to automate and reduce costs. As you heard from my comments, we help drive self-service. We help drive patient satisfaction.\n\nAnd very importantly, we ultimately helped drive more collections. So, as the climate remains challenging for healthcare providers in general, I think there's -- you know, that's a dynamic that makes our software even more valuable for them. And so, we, you know, we continue to move forward well. We're especially proud of the results that we deliver in the healthcare space.\n\nThe ROI of what we do is really, really strong.\n\nUnknown speaker -- Truist Securities -- Analyst\n\nThank you so much, guys. And again, congrats on the quarter.\n\nMike Massaro -- Chief Executive Officer\n\nAppreciate that.\n\nOperator\n\nThe next question comes from Ken Suchoski of Autonomous Research.\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nHey. Good evening, everyone. Nice job here. Thanks for taking my questions.\n\nI wanted to dig into the platform and usage-based fees. It looks like those adjusted revenues were down quarter over quarter. Can you just talk about what's driving the revenue lower in that line? Is it FX or something else? And I think you mentioned that there were some recently onboarded healthcare clients that will contribute to second half platform revenues. Could you give us a little detail on those wins? You know, how did those come about and how much you expect those wins to contribute to revenue in the second half?\n\nRob Orgel -- President and Chief Operating Officer\n\nHi. So, Rob, here, I'll start and then I'll hand off to Mike just in a second to go into the numbers. So. Yeah.\n\nJust to highlight the comment that I made. We have had multiple deployments in the recent period that, you know, we look forward to serving those clients well and we look forward to the revenue contribution that those will create for us. You know, there was this single client that we referred to as having a meaningful effect that we mentioned way back in the back part of last year. And so, we had called that out back then and remind folks that that still has an ongoing effect in the platform revenue line until we lap that, which will happen later this year.\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nOK. All right, great. And then I guess just as my follow up, China, I guess, is coming up a lot more in conversation. Can you just talk about your exposure to China, whether by number of students originating from China or revenue from Chinese students.\n\nAnd then obviously there's a lot of unknowns with this, but maybe you could talk about the risks to the business or maybe the diversity of the business from a high level as China and U.S. tensions increase.\n\nMike Massaro -- Chief Executive Officer\n\nYeah. Ken, hey, I'll take that one. This is Mike. You know, I would say, you know, couple of things to remember.\n\nFlywire's got, you know, obviously, China impact really would impact our education business as opposed to other industries or verticals. But in specifically cross-border education flows, obviously. The thing I would call out is, you know, Flywire gets clients in over 32 countries, right? So, it isn't really about whether students, you know, come to one country or another. But really, do they end up in a place where Flywire is servicing those customers? So, you know, we've seen geopolitical tensions before.\n\nYou know, if anything continues to escalate there or any change in travel policies, you know, our expectation is students from China will go somewhere. They're not going to not go and study abroad. And if you look at the last two decades of trends of international students studying abroad, there's been a really consistent -- minus the pandemic. There's been a really consistent growth rate of students studying abroad.\n\nAnd if you look at that number, it's still a relatively small number when you look at global students. And so feel really good about general trends around international students. You know, one of the interesting dynamics is also India has become the No. 1 country of origination for students studying abroad.\n\nAnd so, again, that, you know, that, you know, I think has has a positive impact. Certain, you know, travel policies. I think some of the COVID dynamics in China, you know, can impact that. But students are going to go abroad.\n\nThey may end up in Australia, they may end up in New Zealand, if there are geopolitical tensions. But that's why we have a good footprint for Flywire all around the world. So, you know, some exposure there in our education cross-border business. But again, we think it's relatively mitigated based on students still wanting to travel and study.\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nOK. All right. Thanks, Mike. Appreciate the thoughts, and congrats on the results.\n\nMike Massaro -- Chief Executive Officer\n\nThanks, Ken.\n\nOperator\n\nThe final question comes from Jeff Cantwell of Wells Fargo.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nHey, thanks and congrats on the results. I wanted to follow up on some of the wins that you announced over the past year and to see if you can give us an update in education, particularly with, you know, Texas A&M and Stamford and UConn. Is there anything you can talk about as far as how that's progressing and what we should expect, you know, for some of these more noteworthy wins as of now over the past 12 months Thank you very much.\n\nRob Orgel -- President and Chief Operating Officer\n\nYeah. Hi, Jeff. Rob here. I'll take that.\n\nSo, you know, obviously, we're very excited about the domestic business. We're very excited about each of the client wins that we've announced on the last series of calls, right? So, we've talked about Texas A&M. We've talked about Stamford University of Connecticut. This call, URI and University of Chicago.\n\nWe are stoked about, you know, great wins internationally, folks like MMU that we've discussed as well in our prior calls. So, the, you know, performance of these schools is going really, really well. I mean, at some level, the best news is that those clients are just happy, content working with our solution and getting the benefits that we expected and plan to deliver for them. And so, for us, that's exactly what we want because these are word-of-mouth industries where when people hear that you're doing well for their colleagues at a school, they're that much more inclined to want to work with you themselves.\n\nSo, our our job, number one, is just to do a great job delivering on behalf of these clients. And with that, we continue to see the pipeline grow and the number of opportunities grow. And that's the playbook we're executing against.\n\nMike Massaro -- Chief Executive Officer\n\nYeah. Jeff. The only thing I'd add, this is Mike, is just, you know, our implementation teams have been doing a great job, you know, really scaling with the growth of our business. And really, this is a global implementation team across all our industries.\n\nAnd so, that's not only treating our clients great once we sign them on, but getting them live, and as Rob said, driving that value. So, you'll feel really good in our ability to do more of that and have a great implementation team behind us.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nOK. Great. Thanks very much, guys. And congrats on the results.\n\nMike Massaro -- Chief Executive Officer\n\nThanks, Jeff. Appreciate it.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of the question-and-answer session. I will now turn the call over to Mike Massaro for closing remarks.\n\nMike Massaro -- Chief Executive Officer\n\nAppreciate everyone's time listening to our Q2 2022 earnings call. And I'm sure we'll be talking to many of you quite soon. Thanks very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAkil Hollis -- Vice President, Investor Relations\n\nMike Massaro -- Chief Executive Officer\n\nRob Orgel -- President and Chief Operating Officer\n\nMike Ellis -- Chief Financial Officer\n\nBob Napoli -- William Blair -- Analyst\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nJohn Davis -- Raymond James -- Analyst\n\nUnknown speaker -- Truist Securities -- Analyst\n\nKen Suchoski -- Autonomous Research -- Analyst\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nMore FLYW analysis\n\nAll earnings call transcripts"
}