{
  "companyName": "Flowers Foods",
  "companyTicker": "FLO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/flowers-foods-flo-q2-2022-earnings-call-transcript/",
  "content": "Flowers Foods (FLO -0.72%)\nQ2 2022 Earnings Call\nAug 12, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day. Welcome to the Flowers Foods second quarter 2022 results call. [Operator instructions] I would like to turn the call over to J.T. Rieck, senior vice president of finance and IR.\n\nYou may begin.\n\nJ.T. Rieck -- Vice President of Finance and Investor Relations\n\nThank you, Michelle, and good morning. I hope everyone had the opportunity to review our earnings release, listen to our prepared remarks, and view the slide presentation that were all posted yesterday evening on our investor relations website. After today's Q&A session, we will also post an audio replay of this call. Please note that in this Q&A session, we may make forward-looking statements about the company's performance.\n\nAlthough we believe these statements to be reasonable, they are subject to risks and uncertainties that could cause actual results to differ materially. In addition to what you hear in these remarks, important factors relating to Flowers Foods business are fully detailed in our filings. We also provide non-GAAP financial measures for which disclosure and reconciliations are provided in the earnings release and at the end of the slide presentation on our website. Joining me today are Ryals McMullian, vice president and CEO; and Steve Kinsey, our CFO.\n\nRyals, I'll turn it over to you.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nOK. Thanks, J.T. Good morning, everybody. Thanks for joining the second quarter call.\n\nWe continue to execute well on the quarter, driving second quarter sales to record levels. Our performance in this challenging consumer environment demonstrates the resiliency of the category and the strength of our leading brands. Due to the outstanding efforts of our team, we successfully mitigated much of the supply chain pressure we discussed last quarter. As a result, we raised the bottom end of our 2022 EPS guidance by $0.05 to a $1.25.\n\nI'd like to thank our exceptional Flowers team for their hard work and dedication, which has made the strong performance possible. The fundamentals of our business are strong, and I've never been more optimistic about our prospects. No matter the environment, our team is focused on delivering results in line with or better than our long-term financial targets. So, with that, Michelle, we're ready to start the Q&A, please.\n\nOperator\n\n[Operator instructions] Our first question comes from Bill Chappell with Truist. Your line is open.\n\nBill Chappell -- Truist Securities -- Analyst\n\nThanks. Good morning.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nGood morning.\n\nBill Chappell -- Truist Securities -- Analyst\n\nHey, Ryals, you had mentioned in prepared remarks a little bit about, I guess, one competitor being a little bit slower to raise prices. And I don't know if that was just a timing issue. And maybe discuss any changes in terms of the competitive landscape of pricing. Or is everybody, for the most part, kind of moving up with commodities and input costs and what have you? And then your kind of thought as -- I think you also had thought that inflation would start to peak by October in terms of what you're looking at.\n\nSo, maybe a little more color there would be great. Thanks.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nSure, happy to do that. I'll let Steve handle the inflation question. But with regard to pricing, it wasn't so much the other competitors were late raising price. It's just that, Bill, we went in a little bit earlier than normal.\n\nSo, I would say that, you know, most of the rest of the industry was relatively on time as far as typical, you know, times to raise prices in the industry. But we went in June a little bit earlier. And so, you know, what you ended up with were, you know, price gaps that were, you know, a little bit larger than, you know, historical gaps. And I think we commented that, you know, that impacted our unit share a little bit in the quarter.\n\nBut since then, you know, most of the industry has followed and raised prices as we have. Steve, you want to touch on inflation?\n\nSteve Kinsey -- Chief Financial Officer\n\nSure. Yeah, Bill. So, you know, we have said that Q3, we'll see our highest overall cost from an inflationary standpoint. It will moderate somewhat in Q4, but again, it still will be elevated in Q4.\n\nBut the peak of that happens in Q3 and then it starts to pull back slightly.\n\nBill Chappell -- Truist Securities -- Analyst\n\nGot it. And then separately, just on acquisition/innovation, can you give us a little more color, and sorry, the name of the company is escaping me, of the investment you made in the quarter? I guess I would have expected normally you to buy outright those type of businesses. So, kind of partnering with a small business and what that brings to the portfolio. And then I'll leave it at that and let others ask questions on other innovation.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nSure. Thanks, Bill. Yeah. The name of the company is Base Culture.\n\nThey are gluten-free and grain-free baked foods company, so it's all keto- and paleo-certified. Very much on trend. The reason that we took more of a venture approach to this is that Base Culture is much, much earlier in their growth cycle than even like a Dave's Killer Bread was back in 2015. And, you know, we've been looking for some time to start doing venture-type, minority-type investments to bolster our own internal agile innovation efforts.\n\nAnd this one just fit very nicely with our portfolio on where we're trying to go as far as, you know, healthier eating, you know, on-trend attributes like keto and paleo, which we don't really have much of an offering in right now. So, we're quite excited about. Small investment but -- and small company, but we're quite excited about the prospects.\n\nBill Chappell -- Truist Securities -- Analyst\n\nAnd when should we start to see, I guess, wider distribution of their products? And then is there an option to own the company outright down the road?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. I mean, there is. And it will be helping them not only with their production because, obviously, we have that skill set, and they don't. They're a very small organization.\n\nBut also sales and distribution opportunities. So, we're already working in that regard.\n\nBill Chappell -- Truist Securities -- Analyst\n\nSo, I would see the products in the next couple of quarters everywhere? Or is that too quick?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYou know, it'll probably take a little bit longer than that for it to be everywhere. Again, they're really small. But we'll grow them in a way that they can, you know, they can absorb with their production capacity, which, you know, eventually will need to be expanded.\n\nBill Chappell -- Truist Securities -- Analyst\n\nGot it. I'll turn it over. Thanks so much.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nThank you, Bill.\n\nOperator\n\nOur next question comes from Robert Dickerson with Jefferies. Your line is open.\n\nRob Dickerson -- Jefferies -- Analyst\n\nGreat. Thanks so much. Maybe just a question for you, Steve. First, I think you just said, I think, costs may have peaked in Q2, still high Q3, Q4.\n\nIn the prepared remarks, seems like you're essentially almost fully hedged for the year in ingredients side, I'm assuming. So, if we think about kind of that margin cadence, I guess, inclusive of mix in the back half, you know, is there should be kind of this implied expectation for EBITDA to actually grow, I guess, in the second half? And then maybe just explain if that's what -- you know, it sounds like it's a little bit more Q4-weighted. Then I have a quick follow up.\n\nSteve Kinsey -- Chief Financial Officer\n\nYeah, I mean, just one quick correction there. We said Q3 would be our highest cost quarter.\n\nRob Dickerson -- Jefferies -- Analyst\n\nRight, yeah.\n\nSteve Kinsey -- Chief Financial Officer\n\nCost continues to, you know, coming in to Q3. It will pull back some in Q4, but for the most part, you know, people will remain -- will be elevated as well, just not quite to the level as Q3. And you're right, you know, in the back half, we have said a lot of our initiatives come into play. You know, we have the pricing to mitigate a lot of the inflation, but we do have, you know, several cost savings initiatives, as well as productivity initiatives that are in flight.\n\nAnd, you know, from a cadence perspective, we said those will come in Q3, Q4. So that will, you know, be a big driver of the EBITDA in the back half.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nAnd, Rob, just to put a number on that, we're still in the range of that 25 million to 35 million. All of which is back half.\n\nRob Dickerson -- Jefferies -- Analyst\n\nOK, great. Yeah. And, you know, I realized that because I think there's a line in the prepared remarks that said as you got through the second quarter, you actually started to see EBITDA improve. So, it sounds like maybe that was also a function of maybe some of the more of the pricing and some of the productivity coming through in the kind of latter part of the quarter.\n\nIs that fair?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. And remember, too, I don't know if this was clear from the prepared remarks, but there's still more pricing that will continue to come in. Steve, roughly through the third quarter, right?\n\nSteve Kinsey -- Chief Financial Officer\n\nYeah.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nMost of it's in, but there is still more rolling in primarily in food service. So, that will also help, too, Rob.\n\nRob Dickerson -- Jefferies -- Analyst\n\nOK. Super. And then just quickly on DKB, obviously, it sounds like, yeah, there is a little bit of supply constraint in the quarter. Seems like that's essentially been fixed now.\n\nAnd then you also have the new West Coast facility. So, kind of bigger picture, you know, if we're thinking it through kind of back half of this year and really on the go-forward from there, you view -- I mean, well, let's say, you're not going to quantify what the opportunity is in the West Coast with DKB, but my assumption is that would still be kind of an ongoing driver of the business, maybe outside of what you see on the rest of the business. So, any incremental color there would be great.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah, no question about it, Rob. I mean, we still -- we're still so confident in DKB and its growth prospects. We were hampered a bit by the packaging issues that we had in the second quarter for DKB, but also those capacity constraints which, you know, are now resolved. Those capacity constraints, you know, we don't promote DKB that much, but we were so constrained we weren't able to do much at all.\n\nAnd so, that, you know, hurt the units a bit. Now that we have Henderson up and running, we can, you know, go back to what we have been doing historically, driving the growth of DKB out West. You know, even still, though, I do want to point out, and I don't know if we mentioned this in the prepared remarks or not, but, you know, even though DKB was slightly pressured in the quarter from both from a unit standpoint, the breakfast segment for DKB was outstanding in the quarter. And as you know, that's been a key area of focus for us since we're underpenetrated there.\n\nSo, that was one highlight for DKB on the quarter that we'll call out.\n\nRob Dickerson -- Jefferies -- Analyst\n\nAll right. Super. Thanks so much. I'll pass it on.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nThank you, Rob. Appreciate it.\n\nOperator\n\nOur next question comes from Ben Bienvenu with Stephens. Your line is open.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nHey, guys. Jim Salera on for Ben. Good morning.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nGood morning.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nI wanted to ask, Ryals, in your prepared comments, you had mentioned you are seeing, you know, lower-income consumers trade down to less expensive, which is kind of, you know, on par with the expectations. But then for higher-income consumers, they had actually been increasing their purchases with the premium products. Can you just maybe drill down on that a little bit and see or talk about what's driving that? Because we would think that, you know, everyone just kind of shifts, parallel shift down to the fact that they're increasing is, I would say, countercyclical to what you would expect.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. There's a lot to talk about there, really. I don't think there's going to be a lot of questions about elasticity. So, this is as good a time as any to talk about it.\n\nThere's quite a few sort of competing data points out there that we're looking at. You know, on the one hand, you know, we saw private label gain a little bit of unit share, 10 basis points of unit share. But if you look at the overall private label units, they were down almost 8 million units in the quarter. So, a lot of that private label share growth was being driven in mass.\n\nAnd what we've seen in mass is retail prices being held down, which, you know, kind of creates a bit more of a gap than you might have historically seen. If you look at the grocery channel sort of x mass, private label loss share again in the quarter. And in that channel, the price gaps were much more in line with, you know, historical averages than what we're seeing in mass. Turning to DKB, specifically, DKB's unit declines were primarily in California and the mass channel.\n\nAnd they were -- as you pointed out, they were concentrated more among lower-income households. But DKB grew units and share in the Northeast and nationwide among higher-income households, which you might expect. And product trips also increased nationwide among both middle- and higher-income households. But then a caveat to that is we are seeing even those higher-income households seek a bit more value from the mass and club channels.\n\nSo, you can see there's a little bit of yin and yang there. When we're looking at the data, I think it's still early days. But the takeaway is that, you know, given the environment and I read everybody saw the news yesterday, you know, growth, grocery prices up 13.1%, the highest since 1979. And yet, you know, we still perform very, very well in that environment.\n\nNature's Own units were up. Canyon units were up. Yes, our volumes were down, but quite a bit of that is our own portfolio optimization and SKU rationalization we're doing. And our volume declines were right in line with our expectations.\n\nSo, overall, when you look at the total picture, even though there are some sort of conflicting data points out there. We were very, very pleased with how our brands and the company performed in the quarter.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nIf I can follow up on that, do you think it's because the price point is still so accessible just in dollar terms that, you know, if everything's up, you know, a 13% change on a $2 item is obviously a lot lower than a 13% change on a $20 item. Is it just that there's nowhere else for the consumer to go, and so it's easy to make a $3 indulgent purchase than a $30 one or, you know --\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. Yeah, I certainly -- I think it's part of it. You know, we've said many, many times, I mean, when you think about an inflationary environment, bread is still a very, very economical choice, just given the number of servings in a loaf, right? And furthermore, you know, even though prices have increased, we play across all the price points from super premium Dave's Killer Bread and Canyon, you know, all the way down to private label. So, you know, there's -- simply put, there's something for everybody there.\n\nThere's something for, you know, every household income, every household budget.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nOK. Great. And then if you guys could give us -- you mentioned real briefly in the prepared remarks the baby bars test. If you could just give us a little bit more commentary on, you know, consumer reception of that and maybe, you know, channels that it worked in better or worse, and just how we're thinking about the rollout of that.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYes. So, it's still early days for that. We're still in test market, but we're working toward national distribution on the first three SKUs. And as we said in the prepared remarks, we're wildly excited about the results that we've seen so far.\n\nIt's just further testament to the DKB brand and what it stands for and the quality and the story behind it, etc. So, we're very excited about it. And further news, not in the prepared remarks, we've recently launched three additional SKUs that are high-protein, which the original three were not, to add to that. Then we're also putting in the test markets and quite excited about it as well.\n\nSo, not resting on our laurels. You know, we continue to innovate with DKB and one of the reasons we continue to be excited about its growth prospects going forward.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nOK. Great. When do we -- when should we expect to see the first handful of SKUs out, you know, kind of in stores across the country?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. Early next year.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nOK. Perfect. Thanks, guys. I'll pass it on.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question comes from Connor Rattigan with Consumer Edge Research. Your line is open.\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nGood morning, guys. Thanks for the question.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nGood morning.\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nGood morning. Hi. So, I guess just on the mix shift more toward private label in the quarter, I was wondering if you can address the market implications of that shift. Just, I guess, how much of the 240-basis-point decline was attributable to that mix shift? And I guess, also, sort of just following up on Ben's question, would it be a reasonable assumption that maybe in the next few quarters the portfolio remains slightly more oriented toward private label versus 2021?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nSo, private label definitely went up in the quarter. But remember, that's virtually all price. You know, I've already mentioned that the units were down in the category, 8 million units and that's a good thing. As we've mentioned on prior calls, we've been working diligently to improve the margin profile of our lower-margin business, which is, generally speaking, the private label and food service businesses.\n\nAnd we've taken significant price to mitigate these inflationary headwinds in both of those businesses. Now, certainly, there's still lower margin than branded retail. And the pressures we're feeling on gross margin from, you know, ingredients, packaging, freight, bags, you know, you name it, you know, is certainly impacting us on the gross margin line. But, you know, Steve can comment further.\n\nWe have done a good job, I think, leveraging SG&A and that's come down as a percentage of sales.\n\nSteve Kinsey -- Chief Financial Officer\n\nRight. I mean, I would say, overall, the inflationary pressures probably drive more of the margin pressure than the mix shift because even though it's happening, it's still not -- you know, we've said it's still not meaningful at this point. We continue to monitor that. So, a lot of the margin pressure really is coming from the inflation on input cost, transportation, labor more than the mix itself.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. The one other thing I would add to that, Connor, that's exactly why it's more important than ever for us to maintain our marketing and brand support investments. Because, you know, as we said, we said it last quarter, I mean, in this kind of environment, I mean, you've got to expect some amount of trade-down, you know, particularly among lower-income households. But lower-income households, believe it or not, are 20% of Dave's Killer Bread units.\n\nKind of surprising even to me when I first heard that. But, you know, continuing to support the brands, continuing to be out there from a marketing standpoint, keeping those brands front and center, you know, we will get through this eventually. And when we do, we want those consumers, obviously, to come back to the brands they love.\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nMmm hmm. Thanks. That was helpful. And I guess just a follow up to that, too, just the question about the Phoenix bakery closure.\n\nSo, in the prepared remarks, you guys commented that it's, you know, I guess it's an older lower-margin bakery that services more private label products. I guess just why the decision to close it now? I mean, was this like a long-running plan? Or I mean, just I guess, given the increased private label demand you saw in the quarter.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nSo yeah, Phoenix is an older, much less-efficient bakery. This is all part of our network optimization plans that we've been talking about for several years now. And, you know, alongside that, we did exit some lower-margin private label and food service business out there. And we have plenty of capacity to take over what remains and ample capacity to fund future growth, so we can take care of all of our remaining business.\n\nBut, you know, as we execute our portfolio strategy, you know, it can have network optimization implications as well. And that's what you saw with Phoenix.\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nOK. Great. Thank you. I'll pass it on.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Steve Powers with Deutsche Bank. Your line is open.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nHey, guys. Good morning.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nGood morning.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nI want to go back to what you were seeing or what you have been seeing in terms of the different tactics in terms of private label pricing mass versus grocery and how you think that evolves. Do ultimately mass prices move higher because the cost picture demands it? Or, you know, this is business risk creating some kind of competitive dynamic where grocery prices, you know, move lower to compete with mass. And then we have sort of downward pressure on the category. How are you thinking about that evolution?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nWell, we certainly haven't seen that yet. And I can't speak to, you know, why certain retailers are doing what they're doing. You know, all we can do is execute on our plans. And I would -- obviously, we hope, you know, they'll come up and some of those gaps will close a bit.\n\nBut it's certainly hard for me to predict what they're going to do.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nYeah.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nBut again, as we mentioned so far -- so far, we haven't, you know, we haven't seen this in grocery. And again, you know, private label lost share in grocery.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nYeah. Yeah. And it's not -- and as you say, you still have some pricing, you know, set to come in. It's not -- nothing that you're seeing has really altered your own strategy from a pricing standpoint or your own expectations in terms of price realization.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nIt has not.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nOK. OK. Very good. Thank you.\n\nThank you very much.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nThanks, Steve.\n\nOperator\n\nOur next question comes from Mitchell Pinheiro with Sturdivant & Co. Your line is open.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nYeah. Hey, good morning.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nGood morning, Mitch.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nHey. I had a question. You talked about price increases and ahead of competition, which seemed to trim a little bit of volume in the quarter. And, you know, is pricing -- I mean, it seems to suggest that it's, you know, that maybe, you know, this is certainly a commodity-type product if, you know, merely, you know, a price increase a couple of weeks or a month ahead of the competition is going to affect volume that much.\n\nWhy is it that -- was it a very large price increase relative to the competition? Or, you know, why would it be that dramatic?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. So, it it's not in terms of magnitude of our price increases versus, you know, competitors price increases. It was just that, you know, in this environment when you start getting gaps, you know, that much larger, that can affect behavior somewhat. That's not the only thing that affected units in the quarter.\n\nAnd we talked about, you know, supply chain issues, etc., but it certainly was a factor. You know, we also caught a hurricane, which we haven't mentioned yet. And we typically perform very well. So, there were other things other than that, but it certainly had, you know, at least some effect on the quarter.\n\nBut that's, you know, that's all much more normalized at this point.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. And how did food service do in the quarter?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nFrom a top-line standpoint, really, really well. So, if you look at it from a pre-pandemic standpoint year to date, you know, in terms of sales dollars, the food service business has recovered, but the units are still below pre-pandemic.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nAnd is that -- are units below across the board or in one particular segment like QSR or fast casual?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nI'd have to look. I want to say it was a little bit lower in quick serve.\n\nSteve Kinsey -- Chief Financial Officer\n\nQSR was more challenged.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. And is there a reason for that? Is it just traffic in the QSR customers? Or, you know, is there anything going on underneath that?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nNo, I think it's just, Mitch, I think it's just a bit more normalization coming out of the pandemic. Remember, quick serve actually did pretty well during the pandemic just because of, you know, less contact. But now that people are more comfortable going back to restaurants, I think that's why you're seeing that shift. But that's also good for us because our margins were higher in those other segments.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nRight. And then, you know, you had, you know, I don't know, it seems like about six quarters of lower volume growth. Um, when does that stop? When are we going to see SKU rationalization slow down as an impact on your results? And if you could talk about that a little bit, it'd be helpful.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. So, I think, generally speaking, we've done the bulk of what we want to do for now. I mean, obviously, you know, SKU rats are, you know, kind of a continual process. But I think in large measure, you know, we've cleaned out most of the underperforming items that we wanted to simplify operations, simplify our sales execution for that matter, and, you know, get to the business of growing volumes.\n\nYou know, I think innovation remains key for that. And so, obviously, our goal over time is to not only grow dollars but continue growing our unit share as well. So, we're focused on that.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nSo, if we look at the third quarter, I mean, are we going to still see some year-over-year volume declines in the overall business?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. So, Mitch, embedded in the EPS guidance is an assumption around mainly elasticities. And as I've said so far, year to date, we're running right about where we thought we would be. So, I think it's reasonable to assume that trend to continue through the year.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. And then could you talk about specifically about some of the cost savings programs that you are currently, you know, initiating and how they're going to flow through the second half?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYeah. So, that's that 25 million to 35 million. And it's a mix of benefits from our digital investments that we've made, which we expect in the back half. We talked a little bit about bakery in the future.\n\nAnd then so that's bakery improvement in the digital sense. There are also separate bakery improvement projects, initiatives that are underway, and also procurement. So, those are sort of the three big areas that the savings will come from.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nAnd as you look next year, does any of that carry through into '23?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nYes, it does. We have not quantified that yet. But, yes, it does.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nAnd then I guess, finally, just when it comes to regional variations in your business, is there any -- which where the best-performing region and which were the worst-performing regions geographically?\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nSo, the Northeast continues to be a call out for us. You know, as you know, we've put a lot of focus up there, and it continues to pay dividends for us. You know, we did have a couple of regions that underperformed by our standards, but I would submit to you that was more operational performance-driven than it was top-line sales performance-driven.\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nOK. That's all I have. Thank you for your time.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nAll right. Thank you, Mitch.\n\nOperator\n\nThere are no further questions. I will turn the call back over to Ryals McMullian for any closing remarks.\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nThanks, Michelle. Thank you very much, everybody, for your interest in Flowers. We look forward to speaking with you again next quarter. Everybody, take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJ.T. Rieck -- Vice President of Finance and Investor Relations\n\nRyals McMullian -- Vice Chairman and Chief Executive Officer\n\nBill Chappell -- Truist Securities -- Analyst\n\nSteve Kinsey -- Chief Financial Officer\n\nRob Dickerson -- Jefferies -- Analyst\n\nJim Salera -- Stephens Inc. -- Analyst\n\nConnor Rattigan -- Consumer Edge Research -- Analyst\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nMitch Pinheiro -- Sturdivant and Company -- Analyst\n\nMore FLO analysis\n\nAll earnings call transcripts"
}