{
  "companyName": "Gap",
  "companyTicker": "GPS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/17/gap-gps-q3-2022-earnings-call-transcript/",
  "content": "Gap (GPS -1.05%)\nQ3 2022 Earnings Call\nNov 17, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. My name is Brent, and I will be your conference operator today. I would like to welcome everyone to the Gap Inc. third quarter 2022 earnings conference call.\n\n[Operator instructions] I would now like to introduce your host, Cammeron McLaughlin, head of investor relations.\n\nCammeron McLaughlin -- Head of Investor Relations\n\nGood afternoon, everyone. Welcome to Gap Inc.'s third quarter fiscal 2022 earnings conference call. Before we begin, I'd like to remind you that information made available on this webcast and conference call contains forward-looking statements that are subject to risks that could cause our actual results to be materially different. For information on factors that could cause our actual results to differ materially from any forward-looking statements, as well as the description and reconciliation of any financial measures not consistent with generally accepted accounting principles, please refer to the cautionary statements contained in our latest earnings release; the information included on Page 2 of the slides shown on the investors section of our website, gapinc.com, which supplement today's remarks; the risk factors described in the company's annual report on Form 10-K filed with the Securities and Exchange Commission on March 15, 2022, and any subsequent filings with the Securities and Exchange Commission, all of which are available on gapinc.com.\n\nThese forward-looking statements are based on information as of today, November 17, 2022, and we assume no obligation to publicly update or revise our forward-looking statements. Joining me on the call today are Interim chief executive officer, Bobby Martin; and chief financial officer, Katrina O'Connell. With that, I'll turn the call over to Bobby.\n\nBobby Martin -- Chief Executive Officer\n\nThank you, Cammeron, and good afternoon, everyone. After four months as interim president and CEO, I have even deeper conviction that we have a portfolio of iconic brands that our customers love, an increased confidence in our platform to drive leverage and economies of scale and belief in this team's ability to deliver. We know where we've gotten things wrong, and the team and I are at work to correct them. As I told you last quarter, we can and we should win in any environment and the management team and I continue to hold the company accountable to deliver on that.\n\nWe've taken action to optimize profitability and cash flow while rebalancing and reducing inventory to drive near- and long-term improvements across our entire business. We've sharpened our focus on execution or bringing more rigor to our operations and are responding to what our customers are telling us with respect to trend. While our efforts drove sequential improvement during the quarter, our expectations are set on the consistency of execution quarter after quarter, year after year that we know is crucial to delivering the sustainable profitable growth and value that our people and shareholders expect. Let me provide an update on our progress during the quarter, starting with actions taken on cost.\n\nAs I last shared, we are aggressively managing costs and have taken the state action in this quarter alone, resulting in roughly $250 million in estimated annualized savings. These actions include: the elimination of 500 existing and open roles in our corporate offices and a pause on hiring and contractor spend for the remainder of the year, resulting in $125 million in estimated annualized savings. Initially, the renegotiation of our advertising agency contracts, resulting in approximately $75 million in annualized savings; and a reduction in technology, operating costs and rationalized investments, resulting in estimated $50 million of annualized savings beginning in fiscal 2023. We are early in our work here and yet already these savings are expected to help offset higher incentive compensation and increasing labor costs in fiscal 2023.\n\nHowever, there is still work to be done to transform our cost structure and improve overall efficiency so that we are fit for the future. Next, let me share more on our inventory actions and assortment rebalancing efforts. We continue to rely heavily on markdowns and discounting to sell-through styles this quarter and have reduced receipts in Q4. These actions will allow us to enter fiscal 2023 in an improved inventory position, and beginning in Q1, our brands will benefit from our reinstated responsive capabilities to chase into product demand.\n\nWe're seeing an improved balance in the assortment across the portfolio compared to the first half of the year. And each of our brands were better positioned in the categories that resonate with the base consumer preferences, and our customers rewarded us for that. We saw consistent category strength in dresses, sweaters, pants and woven tops across the portfolio, with active underperforming across the board as consumers continue to shift away from the cozy at-home lifestyle. While Athleta isn't immune to the change in consumer preference, despite moderation of growth in the women's active market, the brand is showing strength in lifestyle categories like dresses and accessories that are demonstrating disproportionate growth in today's current environment.\n\nNow, let me take a moment and speak to each of our brands, starting with Old Navy. Old Navy delivered net sales growth of 2% over last year, showing early signs of improvement as the brand continues its efforts to rightsize inventory, balance assortment, relevance and sizing across its channels. And the brand saw strength in its women's business in categories including pants, outerwear, sweaters and woven tops. All this was offset, however, by softness in active in kids and baby as we lapped last year's strong demand, which we believe was driven in part by the U.S.\n\nChild Tax credit and, of course, the post-COVID back-to-school spending. Old Navy customers still have a propensity to buy. That being said, it continues to experience softness in spending and shopping frequency from its lowest income consumers. As we continue to attract a wide range of consumers, we still believe Old Navy is well positioned in the marketplace, particularly as consumers become more value-conscious.\n\nNext, Gap brand. Gap delivered net sales flat to last year and is seeing signs of strength in its core, with a significant shift in trend performance across its women's business. Iconic [Inaudible] are delivering in trend-right fabrics like faux leather and occasion-based categories like dresses, woven tops, sweaters and pants all drove comparable sales growth. Similar to Old Navy, Gap brand experienced softness in kids and baby and activewear overall.\n\nOver the last 18 months, Gap brand has successfully transitioned its France, Italy and U.K. businesses to franchise partners as part of our partner to amplify strategy. And last week, we signed agreement to transition the Gap Greater China business to who will operate our end market site in stores under a franchise agreement, pending closing conditions and regulatory approval early next year. This strategy allows Gap brand to operate its businesses through a more asset-light, cost-effective model and to benefit from the local expertise of our partners.\n\nMoving to Banana Republic. We saw net sales growth of 8% compared to last year. September marked the one-year anniversary of their brand relaunch. Shifting from a highly promotional workwear brand catering to everybody, Banana Republic spent the last year reimagining every element of the customer journey, with a special focus on quality products, differentiated experiences and relevant branding, positioning it as a premier lifestyle brand that enhances people's lives wherever they are.\n\nThis accessible luxury differentiates Banana Republic from others at this price point and has brought in a more premium consumer. We hope that you'll take a look soon. During the quarter, Banana Republic experienced strong demand for suiting and its finer fabrics, including silk and cashmere. As some consumer preferences began to balance from the current trend of occasion and workwear, it will be important that Banana Republic continues to use its unique customer proposition as a lifestyle brand to differentiate itself for years to come.\n\nFinally on Athleta, Athleta delivered net sales growth of 6% compared to last year. While the women's activewear market has continued to be soft against the growth trajectory in the past few years, Athleta is holding share. As I mentioned last quarter, Athleta has made quick pivots to print and pattern, as well as with their performance lifestyle product to better meet the customers' preferences. The new fall and holiday product is resonating well with the customer and has led to sales growth in both bottoms and tops, the largest categories in the women's apparel market and key to the brand's long-term strategy.\n\nBefore I pass it off to Katrina to share more details on our financials, let me end with how I began on the state of the business. I have no doubt, we have world-class brands that our customers love, and we drive value and scale through the synergy of our platform. But I'm also very clear that there is work to be done to rightsize our cost structure, streamline inventory and capitalize on our creative strengths to deliver the products and experience our customers deserve and employees and shareholders expect. Lastly, the board remains active in its search for a permanent chief executive officer.\n\nWe're focused on a hands-on leader who can greatly increase our operating rigor, moving us past our deficiencies while, in parallel, enabling strong creative direction and brand architecture as they develop the vision for how our portfolio should evolve over time to create a sustainable business model. This is a great company with strong assets and one that demands a leader who can hold to its value and ensure it remains fit and capable of scaling its omni-platform and market leadership. And with that, I'll turn the call over to Katrina.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nThank you, Bobby, and thanks, everyone, for joining us this afternoon. Let me start with our third quarter results. Third quarter net sales of $4.04 billion increased 2% versus last year or 3% on a constant currency basis, driven by an improvement in trend relative to the first half of the year and in part due to the timing of franchise sales. Sales in the third quarter were 1% above pre-pandemic levels in 2019.\n\nComparable sales were up 1% on top of negative 1% comp last year and a significant sequential improvement from the negative 10% comp last quarter, primarily as our assortment rebalancing efforts at Old Navy and Gap are starting to take hold and resonating with our customers, as well as the benefit of an early holiday promotional event at Old Navy in October. Store sales increased 1% from the prior year. Year-to-date, we have closed a net total of 29 Gap and Banana Republic stores in North America and now anticipate closing approximately 30 additional stores this year, bringing us to close to 90% of our goal of closing 350 stores in North America by the end of fiscal 2023. As we look to the remainder of fiscal 2022, we remain on track to open a net 30 Athleta stores and now expect to open a net 10 Old Navy stores this year.\n\nOnline sales increased 5% versus last year and represented 39% of total sales in the quarter. Compared to pre-pandemic levels in 2019, online sales increased 55%. Turning to sales by brand. Starting with Old Navy, sales in the third quarter of $2.1 billion were up 2% versus last year and increased 10% relative to pre-pandemic levels in 2019.\n\nOld Navy comparable sales were down 1%, representing a sequential improvement from the negative 15% comp last quarter, driven by improvements in category mix and a more balanced assortment that now includes more of the product that our customers have been looking for as preferences have shifted from cozy casual to work occasion this year. However, we do believe that Old Navy did benefit from a slight pull-forward of sales from the fourth quarter into October as a result of its efforts to get out earlier than typical with its first holiday promotional event. Gap brand global sales of $1.04 billion were flat versus last year, with global comparable sales up 4%, driven by improved category mix and a more balanced assortment, including more occasion-based and driven categories, as well as comp growth in Asia as a result of lapping the outsized negative impact of COVID-related restrictions last year. North America comparable sales were flat, a sequential improvement from negative 10% last quarter.\n\nBanana Republic sales grew 8% from last year to $517 million, with comparable sales up 10% as the brand continued to capitalize on the shift in consumer preference and the relaunch and elevated positioning of the brand last year. Athleta sales grew 6% to $340 million or an increase of 57% compared to 2019 pre-pandemic levels. Comparable sales improved sequentially to a flat comp in the third quarter compared to negative 8% comp last quarter and negative 7% in the first quarter. As we look to sales in the fourth quarter, we continue to take a prudent approach, given the uncertain macro and consumer environment, as well as the competitive promotional environment.\n\nAlso, as stated earlier, third quarter net sales benefited in part by the timing of franchise sales, as well as the October holiday event at Old Navy. In addition, Gap brands will be up against an approximate one point headwind as we anniversaried Yeezy Gap sales last year that will not be in the base this year. As a result of these factors and the continued uncertain environment, we anticipate that total company sales in the fourth quarter could be down mid-single digits year over year. Now, to gross margin.\n\nGross margin in the third quarter was 37.4%, deleveraging 470 basis points versus last year, inclusive of 130 basis points of deleverage related to a $53 million Yeezy Gap impairment charge. On an adjusted basis, gross margin was 38.7%, deleveraging 320 basis points versus last year as we continue to experience higher levels of markdowns in order to better position our inventory. Excluding the impairment related to Yeezy Gap, merch margin deleveraged 370 basis points as a result of higher discounting due to the previously communicated assortment imbalances, as well as more aggressive focus on better positioning and clearing excess inventory as we exit fiscal 2022. Air freight contributed approximately 200 basis points of leverage as spend levels normalized during the quarter and we lapped the $70 million of incremental air freight expense last year.\n\nEqually offsetting this was approximately 200 basis points of deleverage due to inflationary and commodity cost-related headwinds. Turning to ROD. We continue to benefit from our fleet restructuring efforts through lower ROD costs, which were relatively in line with last year on a nominal basis. Excluding a Yeezy Gap impairment charge, ROD as a percentage of sales leveraged approximately 50 basis points.\n\nAs we look to gross margin in the fourth quarter, we will lap last year's $245 million of incremental air freight, which is expected to add approximately 540 basis points to gross margin versus last year. We continue to anticipate an approximate 200 basis point inflationary and commodity cost headwinds and that ROD will likely be about flat as a percentage of sales versus last year. As we communicated last quarter, while we are taking actions to rightsize inventory in an increasingly promotional environment, we continue to expect significant variability in discount rate. As a reminder, gross margin in the second and third quarters were impacted by approximately 370 basis points of deleverage stemming from higher discounting.\n\nTurning to SG&A. Reported SG&A was $1.3 billion or 32.8% of sales, leveraging 540 basis points from the prior year and includes an $83 million net benefit from the sale of our U.K. DC now that our European partnership model transition is complete. In addition, we recorded an immaterial amount of severance related to the overhead reductions taken in the third quarter.\n\nAdjusted SG&A, excluding the U.K. DC benefit, decreased 5% versus last year to $1.4 billion. As a percentage of sales, adjusted SG&A leveraged 280 basis points from the prior year's adjusted rate, primarily as a result of higher sales volumes, lower bonus accrual and lower marketing expense compared to last year. As Bobby discussed, we've begun to take actions to rightsize our cost structure and improve profitability, focusing acutely on areas where we may have invested without commensurate returns in recent years as it relates to overhead, marketing and technology.\n\nWe've already acted on approximately $250 million in annualized savings stemming from the reduction of approximately 500 existing and open corporate roles in the quarter, the renegotiation of advertising agency contracts and the reduction of technology operating costs and rationalization of digital investments. These actions will not have a material impact on SG&A as we look to the fourth quarter as a result of timing and severance offsets, in addition to headwinds in the quarter related to higher seasonal labor costs relative to last year. However, these actions will provide a significant offset to the higher incentive compensation and wage inflation headwinds we anticipate in fiscal 2023. Reported operating income increased 22% to $186 million or 4.6% as a percentage of sales.\n\nAdjusted operating income decreased 8% from the prior year to $156 million. Adjusted operating margin of 3.9% was 40 basis points lower than last year's adjusted rate, reflecting the elevated promotional activity and higher inflationary costs, offset by the air freight leverage and the SG&A leverage relative to last year. Moving to interest and taxes. We recognized $18 million in net interest expense, a $25 million savings versus last year due to the refinancing of our long-term debt last fall.\n\nDuring the quarter, we recorded an income tax benefit of $114 million on pre-tax income of $168 million, which resulted in a negative effective tax rate of 68%. This income tax benefit was related to the cumulative impact of a change in the estimated annual tax rate as a result of quarterly earnings variability. This year-to-date tax benefit is expected to reverse and result in at least $200 million of tax expense in the fourth quarter, offsetting the tax benefit on a fiscal year basis. Reported EPS was $0.77.\n\nAdjusted EPS, which excludes an approximate $0.18 net benefit related to the U.K. DC sale and a $0.12 negative impact due to the Yeezy Gap impairment charge was $0.71. Adjusted EPS includes $0.33 related to the tax benefit in the quarter. Share count ended at 365 million.\n\nTurning to balance sheet and cash flow, starting with inventory. We are making initial progress on our plan to rightsize inventories and move to levels below last year by the end of the fiscal year. Our more aggressive markdowns combined with moderated holiday receipts drove a sequential improvement in the inventory growth during the quarter. Total ending inventory was up 12% versus last year, a sequential improvement from 37% inventory growth in the second quarter.\n\nThe 12% year-over-year growth in the third quarter includes a 13 percentage point benefit related to in-transit as we lapped last year's supply chain challenges. Nine percentage points of growth related to pack and hold, and close to two thirds of the remaining increase is attributable to elevated levels of slow-turning basics and the remainder seasonal products. Compared to pre-pandemic levels in the third quarter of 2019, ending inventory was up 12%. While an improvement in trend versus the first half as we expected, we are entering the fourth quarter with overall elevated inventory levels and some carryover of fall product despite the increased markdown activity in the third quarter.\n\nAlthough we did take action earlier this year to reduce holiday receipts, we continue to anticipate a competitive promotional environment, given the increased inventory levels industrywide and plan to continue to take aggressive action to clear inventory in order to enter fiscal 2023 better positioned. As we look to fiscal 2023, we continue to moderate and expect to begin to lean into our responsive levers this spring, which will provide further flexibility to better align inventory levels with demand trends next year. In addition, we are releasing some of last year's holiday pack and hold inventory, and we'll continue to integrate our pack and hold inventory into future assortments. As you know, while pack and hold is the use of cash in the short term, we are able to optimize our margin in the near term and benefit working capital next year as we buy lower receipts and sell through the pack and hold inventory.\n\nQuarter-end cash and equivalents were $679 million. Net cash from operating activities was an inflow of $95 million in the quarter, driven by a moderation in working capital usage as a result of our progress on improving inventory levels and composition coupled with our receipt cuts and leaner buys. As we stated last quarter, we anticipated beginning to see more normalized cash flow in the back half of the year and we are seeing that play out. We continue to focus on fortifying our balance sheet and cash position.\n\nAs discussed last quarter, we've cut or deferred some capital spending and reduced the number of Old Navy stores slated for back half of the year and continue to expect capex of approximately $650 million for the year. We remain committed to delivering an attractive quarterly dividend as a core component of total shareholder returns. During the quarter, we paid a dividend of $0.15 per share, and on November 8, our board approved a $0.15 dividend for the fourth quarter of fiscal 2022. We repurchased 1.2 million shares early in the quarter.\n\nAs discussed last quarter, we have completed our goal of offsetting dilution in fiscal 2022 and do not anticipate repurchasing additional shares this year. We continue to have $476 million available under our current share repurchase program authorization. Before closing, we understand that there has been increased focus on freight- and commodity-related tailwinds in fiscal 2023 across the industry as we've all begun to see favorability in rates. As a reminder, we have experienced a more modest freight headwind throughout fiscal 2022 as compared to many other retailers as a result of our long-term ocean contracts, which were locked in at favorable rates.\n\nThese negotiated rates remain below current ocean container rates. As a result, as ocean container rates come down, this will not represent a significant tailwind to our margin as it may for other retailers as we look to fiscal 2023. In addition, as it relates to cotton and commodity costs, we have already made purchases through the first half of fiscal 2023, and therefore will not begin to benefit from advantaged pricing until we enter the back half of next year. In closing, while we continue to navigate an uncertain consumer environment and promotionally competitive environment, we are confident in the actions we're taking and believe we are taking the right steps to position Gap Inc.\n\nback on its path toward sustainable, profitable growth and delivering value to our shareholders over the long term. With that, we'll open the line for questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from Lorraine Hutchinson with Bank of America. Your line is open.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good afternoon. Katrina, thanks for the gross margin puts and takes. I just had a question about the promotional piece of that.\n\nYou mentioned the 370 in the past two quarters. Just given where your inventories are, where your receipts are in the macro environment, would you expect the promotional pressure to be in line with that or better? Maybe if you could give us some guardrail there.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes. Sure, Lorraine, and thanks for the question. I think that's the real open part of the margin that we sort of left for you to model, giving you guys the known things, which are the air freight benefit in the quarter for fourth quarter of 540 basis points, partially offset by the inflationary pressure of 200. We're prepared to keep promoting to get ourselves clean of both fall and holiday inventories as we enter into next year.\n\nAnd so, there's a wide range of possibilities as to what that discount amount could be. I think if you see Q2 at 370 and Q3 at 370, it's rational to think that's a possibility. But we're not guiding to that number, given there's such a wide range of possible outcomes. So we'll let you guys take a look at what you think that will look like, knowing that we will be committed to getting our inventories cleaned up so that we don't continue to carry the excess inventory into next year.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nAnd then related to that, as you look into the first half of next year, what proportion of your inventory will be -- will take advantage of some of the responsive capabilities?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nWe haven't said and we'll certainly consider if we'll say more on a future call. But I think what's important to know about responsive, as we've said, is that it can take many different formats. So whether it's getting our basics loaded on to venture managed inventory, which allows us to take advantage of their replenishment capabilities or whether it's leaving overall inventory open to chase [Inaudible] or just give us an ability to range up or range down total inventory based on demand, it really is a capability that we're looking forward to having back. With the manufacturing disruption that we saw starting with India closing and then Vietnam closing and many of the other jurisdictions closing down during COVID, we really lost those capabilities, which caused us to have to lean too far forward into total inventory, as well as category inventory.\n\nAnd so, having those levers back will give us so much more flexibility. But we haven't said it's different by brand, and certainly, we're happy to talk more about it as we get closer in, if appropriate.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nYour next question is from the line of Bob Drbul with Guggenheim. Your line is open.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nHi. Good afternoon. I guess the first question I have is on Old Navy. Can you maybe just talk to some of the operational improvements? And where do you think any of the early reads are on Old Navy under Haio as he's taken over? And then, Bobby, I'm just curious if -- are you thinking of staying on as CEO, given the delay in naming a permanent CEO?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nDo you want to go ahead, Bobby? Go ahead.\n\nBobby Martin -- Chief Executive Officer\n\nNo. Go ahead. I can't wait to my answer on that last one.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nI'll go ahead and start with Old Navy. I think we're really pleased to see playing out at Old Navy what we have been talking about, which is sequentially improving the BODEQUALITY inventory, which has finally been cleaned up and more rationalized in stores back toward what is an appropriate level of inventory for that customer, still having that inventory fully available online to serve that customer but really getting that markdown inventory out of stores. Then on top of that, being able to finally pivot the inventories toward the categories that are selling, and then on top of that, starting to really get back to pulling down inventory more in line with demand. And all of that sequentially has started to show real improvement.\n\nI know, Bobby, you also have a view on some of the executional work so I'll let you talk to that.\n\nBobby Martin -- Chief Executive Officer\n\nYes. Look, I think looking at Haio, although he's only been in just a little over 100 days, he's taken decisive steps, particularly around the store inventory. If you get in our stores, right now, they're full. We brought a lot of that inventory forward but it's being merchandised well.\n\nAnd his focus has been very, very, very strong that we don't lose sight of good merchandising, so we've got good product. It is resonating with the customer and we should never get confused even in the excess of inventory to not merchandise that well. So that as a customer comes in, right now, we've really tightened up under his leadership, particularly in Old Navy, but it's across the other brands to really know when the customer is in. She knows that -- we know she's there from the time she comes in until she leaves.\n\nSo the engagement with the customers is really high. And being able to, again, capitalize on some of the current trends. Old Navy, clearly, even in the given assortment, we serve a wide range of customer. We commented on it during our opening remarks that even with the lower income customer, we're seeing some transition there, but that's just meaning that they're really moving to opening price point and denim a little bit more.\n\nBut on the other side, we've got big strengths that are showing up in categories like back-to-office and even in just some of our basic fashion where she's really responding well. So Haio's strengths right now through the team and I'd say that we're really pleased with what we're seeing happen is really getting the inventory rightsized, cleaned up. And operationally, we're executing to get the maximum conversion and then driving the UPT up, knowing as soon as we can get her committed to the checkout, we have a greater opportunity to see that additional transactions hit the basket and that's got the work of the work. And right now, we're pretty pleased with what we're seeing, and again, a lot more to come.\n\nI will address your second question and I'm flattered, I guess, that you would ask, but there's really only two messages that you really should hear. I mean, you've heard the really strong focus around operational improvements, getting things right, knowing where we've got it wrong and stepping up to those things. So the message you really have to hang on to there is we're not in timeout. And it's very clear to me what the board's asked me to do in terms of stepping in and assessing where we are, capitalizing on our strengths, improving and responding quickly to make things move in the direction we want them to go.\n\nBut the board is very, very diligent around getting a CEO in place and so we're very active at that. But the board's also very determined to make sure we take the time to get it right. And as I said in my closing remarks, not just casually. But this is a great company.\n\nMy confidence has gone way up being inside, that the strength of these brands, they are iconic. We're seeing right now in our results, customers are responding, that when we get it right, they bring exactly on what they trust us for. And we will find the right leader and -- that can do the kind of job that I described relative to being strong operationally and getting us past some of the deficiencies, whether they're costs, other execution, rightsizing. But more than anything, also being able to double down on what you know and expect and we expect of ourselves, and that is returning ourselves to really, really strong, creative strengths, brand architecture because I believe in the portfolio strategy.\n\nAnd so, I'm not sure exactly when we will finish there, but we will land the CEO for the future of this company.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nThank you very much.\n\nOperator\n\nYour next question comes from the line of Alex Straton with Morgan Stanley. Your line is open.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much for taking my question and congrats on a good quarter. I just wanted to drill down on the traffic or sales trends that you saw throughout the quarter. Did things -- how did things kind of develop by month? We have been hearing some October and November weakness at select retailers.\n\nJust wondering if you saw a similar exit rate as they did.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes. Thanks, Alex. I think in line with others' commentary, we did see strong volume in October slow a bit in the end and a little bit of a slow start to November. But that trend is fully contemplated in the outlook that we described today and a little bit of why we remain prudent on the outlook for fourth quarter revenue.\n\nBut that said, it's early days and we know that some of that was weather and potentially some other disruption happening out there. So we'll see what plays out. But certainly, we did see a little bit of that similar trend.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat, that's helpful. Maybe I could also describe your outlook on holiday. I know last year, customers kind of had a call to action to shop earlier. It seems like maybe shopping could be later.\n\nAnd then, our surveys are also just saying that customers could be waiting for deals. Maybe what are your thoughts on that as we head into the holiday selling period?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes. I mean, I've heard those various points of view as well. And so, we're just prepared to compete when the customer is ready to shop. And so, we know we have to get out ahead of ensuring that we're early enough, that we're promoting at a time when she's willing to buy, and we're not waiting too late to clear the merchandise.\n\nAnd on the flip side, if they're not going to shop until later, we don't want to be too far out ahead of it. So we're remaining vigilant in our view on what's happening competitively, as well as taking a prudent approach to understanding where our inventory movement is and where our customer is shopping. So I guess I'll have to say that we've seen -- we've heard a lot of those dynamics. We're just watching it carefully day-to-day.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nThanks so much.\n\nOperator\n\nYour next question is from the line of Paul Lejuez with Citi. Your line is open.\n\nPaul Lejuez -- Citi -- Analyst\n\nHey, thanks, guys. I think you mentioned seeing commodity costs higher in the first half of '23. Any quantification of that relative to what you've been seeing as a drag in the second half of '22? And then also, you've pulled back this year a bit on store openings. Curious how you're thinking about store growth for next year, obviously, specifically Athleta and Old Navy.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nSure. So Paul, we'll provide a lot more color on 2023 as we get closer to the year. What we wanted to make sure that you guys understood is we do see the cotton movement happening. Of course, it takes a while for the raw materials to move through the full average unit cost of a garment.\n\nAnd so, more to come on when we get to see the timing of the benefit on cotton start to flow through our COGS. I think importantly, we've bought the first half so any raw material movement won't be flowing through COGS materially in Q1 and Q2. But certainly, we'll be focused on figuring out how much of that we can get through our back half average unit cost. So more to come on that dynamic.\n\nWe just wanted to sort of give early thoughts on it. And then -- sorry, your second question?\n\nPaul Lejuez -- Citi -- Analyst\n\nEarly thoughts on openings for next year?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes. So Athleta, we're going to open about 30 stores and we feel good about that pace of growth. I think that's a reasonable pace of growth, and so you could likely expect that. For Old Navy, the 10 stores that we're opening this year was a pullback.\n\nThat was partially based on, given the performance, really wanting to make sure we were staying prudent on those store openings. We did have some slip into next year, but likely, we'll have a more moderated pace on Old Navy store openings as we move forward. But again, more to come as we fully land that pipeline of stores.\n\nPaul Lejuez -- Citi -- Analyst\n\nGot it. Thank you. Good luck.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Mark Altschwager with Baird. Your line is open.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nGood afternoon. Thanks for taking my question. So just standing back on margin, EBIT margin, a lot of moving pieces this year, a lot of temporary factors as you kind of rightsize inventory and prepare for some additional sort of clearance and promotions on the holiday. But as we look forward to next year and your path to clearance, you annualize some of these SG&A savings that you're seeing, is there a baseline level of EBIT margin that you think the business can achieve sort of regardless of kind of what the revenue backdrop might look like?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes. I mean, there are so many moving pieces, Mark, and I think that we haven't issued any forward-looking guidance on anything beyond sort of where we are now, so more to come on that. I think that overall, as we think about the future, what we have said is a little bit of what you've heard over the last couple of quarters, which is we feel good about the store closure activity that's really given us a lot of benefit in ROD leverage. We feel good about the work that the Gap team has been doing about transitioning many of our international markets to partners, which will help us maybe with lower revenue but fewer losses of operating income.\n\nAnd we are committed to really deeply staring at the operating costs that we've added into the business in the form of marketing overhead and technology. That said, we are in still a very inflationary environment, and so there's headwinds on labor costs and headwinds in other inflation that we're still working through. So lots of moving pieces and we'll give you more of an outlook into that as we put 2023 together. But certainly, we're focused on the long-term goal of getting the company back to a better operating margin with profitable sales growth.\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nThank you. Best of luck.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nThank you.\n\nOperator\n\nYour next question is from the line of Brooke Roach with Goldman Sachs. Your line is open.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nGood afternoon and thank you so much for taking the question. I wanted to narrow in on Athleta, which had a nice comp improvement this quarter on both a sequential and a three-year stack. Can you reflect a little bit more on the drivers of the sequential improvement? And do you think that the three-year stock trend is sustainable from here on out? If that is the case, what is the segment profit margin that you expect for this brand ending the year? And how does that compare with your view of long-term segment profit operating margins for the business?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes. Brooke, I mean, we were pleased to see Athleta return to the positive 6% growth flat comp, which was a meaningful improvement. NDD came out with the industry growth yesterday for the quarter and the women's active market is down negative 7%. And so, Athleta's growth in the quarter does show that they are taking market share even as that active market is slowing a bit after a few years of significant growth.\n\nSo we do feel like we're starting to see a little bit of rebound in some of the performance product, as well as, as Bobby said in his prepared remarks, really winning on a lot of the lifestyle products that they've been able to compete well in as they've been able to balance sort of performance and lifestyle as a lifestyle active brand. As far as the three-year stack going forward, I guess we'll see, but certainly, our aspiration is to continue to be driving profitable sales growth at Athleta. We don't report on the operating margin segment, but certainly appreciate the question. And so with that, we'll probably not comment on that at this point.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nOK. One more question, if I may. As you contemplate the mid-single-digit sales decline that you forecasted for 4Q, can you help us a little bit with any quantification that you might be able to share about the franchise impact and the holiday event pull-forward impact within that?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes, sure. We haven't quantified that, Brooke. And so, I think it's just fair to say that the dynamics are such that we did say it was a slight impact from the October promotion in Old Navy. And then, the franchise sales timing is a modest impact.\n\nGap had the Yeezy impact. It's a point to them. It's probably less -- more modest than that for Gap Inc., so sort of all those things together. And then on top of that, as we said, we're really just trying to remain prudent about the consumer and the environment heading into holiday, so that we do allow ourselves the ability to sell through the product as we need to as we enter into next year.\n\nSo hopefully, all those drivers are helpful, but I don't think it's any one single driver. It's really everything together that's adding up to that outlook.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nThank you very much. I'll pass it on.\n\nOperator\n\nYour next question is from the line of Oliver Chen with Cowen. Your line is open.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, Katrina and Bobby. Thank you. Regarding the carryover fall product, what's the nature of the product that you're -- you still need to work through at this current time? And then, as we zoom out a little bit on Old Navy, what's your hypothesis for a few things that need to be done strategically just to drive more consistent comps and margins? You mentioned balancing the assortment as one, and I'm sure speed and agility and fabric platforming is an opportunity, too. Thanks.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes. Sure, Oliver. I'll take the content and then maybe, Bobby, I don't know if you want to speak to the Old Navy piece. On the content side, it's different by brand.\n\nBut fundamentally, as we think about summer inventory that carried into fall, that was a margin drain in the second quarter -- in the third quarter, and then we had fall inventory we were clearing that now is carrying into holiday. We do feel like with holiday buys being down, we will stop that from continuing, but we need to focus on the fall product that's carried over. It's really various things. There's nothing -- no pockets in particular.\n\nIt's really more about the overall inventory being higher than the relative demand and our ability to actually clear through that, given sort of the customer dynamics. So we're focused on clearing through that now, though, and that is part of why we do believe the margins will be pressured in fourth quarter. And again, we have a lot less holidays so we look to have that cycle stop as we head into first quarter of next year. So I don't know, Bobby, do you want to comment on Old Navy?\n\nBobby Martin -- Chief Executive Officer\n\nWell, I mean, I think you put your finger on those things that you would expect maybe is and challenging us, and we clearly let an assortment get broader than it really needs to be. And in some cases, again, we're missing a great deal of depth. So the course correction there is really just getting back to the fundamentals and putting the right lens on inventory. So there's a much, much, much greater focus looking at sell-through expectations, more of a life cycle mindset around the product so that we're continuing to keep the freshness and the newness there.\n\nAs I referred to Haio, one of the things that he's done through the team and again, really happy right now with the things that are taking place is calls with both our mills and vendor partners where we know that we've got an opportunity for greater collaboration. Same responsive capabilities that right now have been helping Gap brand, Old Navy will be able to leverage on. So there's a lot more creative, I think, insight from the consumer and being able to deliver on it. I'll give you a good example that's even going on right now in the brand that shows what happens when we do get it right.\n\nBack-to-office is that the brand hopes to really own. But even right now, we have a Pixie and a Stevie pant that's offered in a skinny leg player, wide leg, different fabrications and patterns, all very, very, very popular. That's the message that the consumer is telling us about the sensibility and fashion that she's looking for and, again, certainly staying really sharp on our basics. But in particular, being able to serve, again, a wide range of customer.\n\nI commented on denim and opening price point right now at lower end. But again, across the aisle, the men's customers turn from denim to a chino fabric that we've got out. And again, these are things I think that the brand is really going to look to try and capitalize on. So much more rationalization around the breadth of the assortment and really getting deep where we know [Inaudible] looking for us and then again, keeping enough open that we can chase into it.\n\nAnd last point on that. It's not just being more responsive and having a better inventory balance. The more effective we are at that, those are big down payments and steps toward localizing more effectively as well in the inventory we carry and increasing sell-through. So it's something, I think, that's a big, big, big opportunity to the brand and underlying why we feel so strong about the opportunity for Old Navy going forward.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you. Happy holidays.\n\nOperator\n\nYour next question is from the line of Ike Boruchow with Wells Fargo. Your line is open.\n\nJesse Sobelson -- Wells Fargo Securities -- Analyst\n\nHi, everyone. This is Jesse Sobelson on for Ike. Thanks for taking our questions. I was just curious on this -- so first, the $53 million write-down of the Yeezy product.\n\nI just wanted to kind of confirm that that was all of the product that you guys held and it's just fully written down. And then, kind of looking at over the longer term with the real estate with your business. I was curious on your views of the ownership there, and we should expect any more sales in the future.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nThanks, Jesse. So yes, we did take the appropriate impairment on the Yeezy inventory as we are winding down that business and that $53 million is reflected as appropriate. As we think about -- you're talking about corporate-owned real estate, I'm assuming, based on your question?\n\nJesse Sobelson -- Wells Fargo Securities -- Analyst\n\nYes.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nSo the way I think about the corporate-owned real estate is, we will always look to monetize underutilized assets. To the degree the assets are being fully utilized, we are proud of the assets we have and we feel good about them. So I'm not previewing anything else other than to say we do try to look and prudently evaluate how we're utilizing our assets to make sure that they're adding the value they need to add. But at this point, we feel good with where we are today.\n\nJesse Sobelson -- Wells Fargo Securities -- Analyst\n\nWonderful. Thank you.\n\nOperator\n\nYour next question is from the line of Matthew Boss with J.P. Morgan. Your line is open.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks. So Katrina, a couple of things. Maybe one, could you help rank assortment changes that you made at Gap which drove sequential improvement this quarter? Two at Old Navy.\n\nIs there a way to think about maybe just a reasonable time line for optimal inventory balance that you think across categories at Old Navy? And then three, on the $250 million of annualized expense savings, I guess what percent do you see flowing through to the bottom line next year versus opportunities you see for reinvestment?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nSo in order. For Gap, are you talking about the specific -- like the specific assortments, what's working there? Is that what you're asking?\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nExactly.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes. I think -- it's funny, Bobby and I were talking about this. We're really proud of the way that the Gap team has come back with great current fashion, but really, it's current for the modern essentials. And so, whether it's the faux leather pants that have really driven a lot of interest in the normal five-pocket styles or whether it's their great interpretation of the basics like a jean jacket with a pop sleeve, that just makes that product more current.\n\nI would say, overall, they've just done a really nice job of having trend-right fashion but interpreted into modern essentials. And so, I'll answer the other two, and if Bobby has anything more to add on Gap, I'll have him do that. As far as Old Navy optimal inventory assortment, I think we're making progressive improvement through every quarter. And importantly, as we move into spring, we're just very excited to have that responsive inventory back because that will start to give them the opportunity to be much closer to demand and be able to chase into the inventory trends.\n\nAs an example, Gap has been able to chase back into the faux leather styles, as well as that Gap -- that pop sleeve denim jacket, for instance, in a very short amount of time after they saw the fall product succeed to get it back in time for holiday. And so, just an example of how once we get that responsive inventory back, I think Old Navy will similarly start to see the ability to really change the way they are able to serve their customers. And then, on the $250 million of annualized expense savings, right now, our view is that that's expected to just offset the reset in bonus for next year, since as you can imagine, we're not likely to pay bonuses this year based on performance, as well as some of the wage inflation that we're seeing. But as Bobby said, more to come.\n\nWe're not stopping at the $250 million. I think we feel like that's a good start for where we need to be really bearing down on cost in the company. But overall, we are working hard to think about how to think longer term about more expansive cost efforts that we think will rightsize the company's expense structure to make it more fit for purpose. So I don't know, Bobby, on Gap, if you'd add anything.\n\nBobby Martin -- Chief Executive Officer\n\nNo, I think I would just double underline on the cost. I mean, we said we're really early in this work. But I mean, this is work where -- I mean, we're taking a real comfortable position on questioning everything that we do. So it's work that will, I say, going on well into 2023 so a lot more to come there.\n\nI would not miss a chance because I think Katrina did it nicely, but I think it's a meaningful deal that we've seen strong women's specialty business turn across wovens, bottoms. It's sweaters, it's everything. I mean, there's a great oversized turtleneck sweater that's really, really hot in there. They've gotten bold enough trend-right right now, knowing the customer is ready to get out.\n\nSo whether it's partywear right now, etc., and it's in the category, it's in the flannel sleep sets and so forth. So seeing that business turn and the way the team, I think, has geared up to keep that going, it has my attention. I've seen spring and summer. So I think that, hopefully, we're going to find ourselves with some positive traction here.\n\nOperator\n\nYour next question is from the line of Corey Tarlowe with Jefferies. Your line is open.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nHi. Great. Thanks. Hi.\n\nGood afternoon and thanks for taking my questions. So I wanted to touch a little bit on the Gap. So I think one thing that's clear is that strategically, this business has been really focused on driving capital-efficient growth, whether it's franchising international, selling the China business or maybe even more recently, going on to launching on Amazon fashion. So could you maybe just talk a little bit about the overarching strategy at the Gap brand and how that's progressing and how you see that playing out as we look to the fourth quarter and next year?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes, Corey. It is very much consistent with what we've put out for Gap brand, which is that we have spent the last couple of years really rightsizing the business model to a more modern model for the Gap brand, closing North America specialty stores that we potentially had overexpanded back in the heyday, getting out of malls that are not as relevant anymore, pivoting to be much more digital, really focusing on ensuring that the international growth, which we think is important, it's our most global brand, is being done with other people's capital in a way that we can be in those important markets but not be sustaining the operating losses that we were sustaining there. So really focusing on a much healthier core. And then, really, the focus on the creative health of the brand, the relevance that drives the North America core through product relevance and partnerships is the recipe for that brand.\n\nAnd I think that that's what's playing out in the third quarter. It's what Bobby articulated about their sort of product early signs of improvement and what we remain committed to as we head into next year.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGreat. Thank you very much and best of luck.\n\nOperator\n\nYour last question comes from the line of Janet Kloppenburg with JJK Research. Your line is open.\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nHi, everybody. Congratulations on the progress. Katrina, I just wanted to flesh out the merchandise margin direction for the fourth quarter where it seems like you have some caution. And I appreciate the inventory breakdown, but you did a great job of bringing your inventories down.\n\nSo I'm wondering with this product -- better balanced product, not where you want it to be, but balanced, better balanced, is there some indication that the promotional levels will be that much more severe, even though the inventory levels appear to be in pretty good shape? Or let's put it this way, much better shape than they were? And then on the SG&A, it seems like you saved a lot on marketing in the third quarter. That's my view. And I'm just wondering, will you start to uptick your marketing spend in the fourth quarter and going forward into '23?\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nYes, sure. So I think, Janet, we are glad that we have started to see the inventory levels come down. When you adjust for the in-transit and the pack and hold and the basics that we're carrying, we do still have fashion heading into the fourth quarter. That is about the current revenue outlook, and that's what gives us the caution on the margin combined with the fact that we know others are working hard to get their inventory levels down.\n\nSo we'll see where the margin lands, but we remain sort of prudent about what it might take in order to get through that. So we'll see where that lands. But again, trying to be helpful in articulating that we had to run discounts impacting the margin of about 370 basis points for Q2 and Q3. And while we certainly hope it's better in Q4, it's certainly on our mind that it could be that as we head into the quarter.\n\nSo we'll let you decide. On SG&A, yes, we did save some in marketing in third quarter. I don't believe that we would be spending more in marketing in fourth quarter. We continue to try and find that right balance of marketing in the brand.\n\nBut overall, we're focused on marketing effectiveness, both in fourth quarter, as well as we head into next year as we look to make sure that we're being prudent in that marketing spend after a couple of years of heavily investing. So I wouldn't expect the marketing to go up in fourth quarter.\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nOK. Great. Thanks so much and best of luck for a good holiday.\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nThanks, Janet. You, too.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nCammeron McLaughlin -- Head of Investor Relations\n\nBobby Martin -- Chief Executive Officer\n\nKatrina O'Connell -- Executive Vice President, Chief Financial Officer\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nPaul Lejuez -- Citi -- Analyst\n\nMark Altschwager -- Robert W. Baird and Company -- Analyst\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nJesse Sobelson -- Wells Fargo Securities -- Analyst\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nJanet Kloppenburg -- JJK Research Associates -- Analyst\n\nMore GPS analysis\n\nAll earnings call transcripts"
}