{
  "companyName": "Gevo, Inc.",
  "companyTicker": "GEVO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/gevo-inc-gevo-q2-2022-earnings-call-transcript/",
  "content": "Gevo, Inc. (GEVO 2.15%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Gevo second quarter 2022 earnings call. [Operator instructions] After the speaker's presentation, there will be a question-and-answer session. [Operator instructions] Please be advised that today's conference is being recorded.\n\nI would now like to hand the conference over to your speaker today, John Richardson. Please go ahead.\n\nJohn Richardson -- Director of Investor Relations\n\n Good afternoon, everyone. This is John Richardson, Gevo's director of investor relations. Thanks for joining us to discuss Gevo's second quarter results for the period ended June 30, 2022. I'd like to start by introducing today's participants from the company.\n\nWith us today are Dr. Patrick Gruber, Gevo's chief executive officer, Tim Cesarek, Gevo's chief commercial officer, and Lynn Smull, Gevo's chief financial officer. Earlier today, we issued a press release that outlines the topics we plan to discuss. A copy of the press release is available on our website at www.gevo.com.\n\nPlease be advised that our remarks today, including answers to your questions, contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act. These forward-looking statements are subject to risks and uncertainties that could cause actual results to be materially different from those currently anticipated. Those statements include projections about the timing, development, engineering, financing and construction of Gevo's sustainable aviation fuel projects, its sales agreements, its renewable natural gas project and other activities described in our filings with the Securities and Exchange Commission, which are incorporated by reference. We disclaim any obligation to update these forward-looking statements.\n\nIn addition, we may provide certain non-GAAP financial information in this call. The relevant definitions and GAAP reconciliations may be found in our earnings release and 10-Q, which can be found on our website at www.gevo.com in the investor relations section. Following the prepared remarks, time permitting, we'll open the call to your questions. I would like to remind everyone that this conference call is open to the media, and we are providing simultaneous webcast to the public.\n\nA replay will be available via the company's investor relations page at www.gevo.com. I would now like to turn the call over to the CEO of Gevo, Dr. Patrick Gruber. Pat?\n\nPatrick Gruber -- Chief Executive Officer\n\nThanks, John. Good afternoon, everyone, and thanks for joining our call today. We filed our Form 10-Q earlier today, and we ask that you refer to it for more detailed information. Our team had fantastic momentum as we exited the first quarter of this year.\n\nWe announced two new SAF supply agreements, one with Delta, another with British Airways in the first quarter for a combined 105 million gallons per year. We maintained that momentum through the second quarter and beyond. Since the first quarter, Gevo's business development team has done a great job to close five additional supply agreements with American Airlines, Alaska Airlines, Japan Airlines, Finnair, and Aer Lingus for a combined total volume of 155 million gallons per year of SAF. Collectively then, Gevo now has over 350 million gallons per year of committed SAF offtake that has an applied hydrocarbon revenue value estimated at over $2 billion per year, inclusive of the market -- inclusive of the value of the environmental benefits and based on current market projections and operating assumptions.\n\nNow, that brings us meaningfully closer to our production goal and sales goal of 1 billion gallons per year of 2030. It's tremendous progress. I'm proud of our team. And what's even better is, they're all -- they're take-or-pay agreements, and that helps us.\n\nNow, it's good momentum for SAF and our systematic approach driving down carbon intensity, the customer base buys into what we're doing. It's inclusive of our whole supply chain from growing of raw materials to the burning of jet fuel. And we continue to believe that net zero carbon negative fuels can be produced profitably. That's what all the data keeps saying.\n\nWe haven't slowed down either. Our team continues to discuss and negotiate agreements with other potential partners, including strategic partners. We are very pleased with our Northwest Iowa RNG project, all three of our dairy partners and the digesters are now producing biogas, and that gas is being set to the upgrading unit and injected into the sales pipeline where the sales are managed by BP. Over the next several months, gas quality production data will be gathered for Gevo's application to CARB so that we can apply for LCFS and maximize the value to Gevo in those gas streams -- with those gas streams.\n\nI look forward to being able to report meaningful revenue and the associated profit for that project in the near future. Our team has done a great job work through start-up issues, everything is working. So it is very, very good. And the -- to remind people, this is a 355,000 million BTU nameplate capacity.\n\nThis is the fifth largest dairy project ever constructed, and it is doing really well. Our Net-Zero 1 project in Lake Preston, South Dakota, which is being designed to produce 62 million gallons a year of low carbon fuels, 55 million gallons will be sustainable aviation fuel. That remains on schedule to deliver its first volumes in 2025. The FEL-3 work is expected to be done around year-end, but we already have enough data to move forward on the build-out, and we expect to stay on schedule.\n\nAs we announced last month, Gevo closed land purchase for approximately 245 acres in Lake Preston where the NZ1 plant is going to be built, and we have planned a groundbreaking ceremony for next month to kick off the initial site work phase. We expect to be ordering long lead equipment in the fourth quarter of 2022, we are doing everything we can to stick to our schedule. We're monitoring the supply chain issues and attempting to mitigate any that we find as they arise. NZ1 is happening.\n\nI expect this NZ1 plant to really quite something. It's going to show the world what's possible. It's going to show that sustainably produced raw materials can be converted into SAF with energy-efficient production processes, we can displace the fossil-based energy that's the electricity and the heat sources, get rid of the methane from fossil base, and swap them out with renewable energy and make it all profitable to produce our jet fuel. We continue to evaluate additional plant locations as we map out the path forward beyond Net-Zero 1, Kim has done such a good job selling stuff that we have so many gallons that we've got to really plan these out and get on with it.\n\nRemember, we have over 350 million gallons per year of SAF to deliver beginning over the next few years and then multiple plants are going to be required to satisfy those contracts. We expect that the take-or-pay or otherwise financial agreements that we have, they will assist us in securing debt and equity for our projects. Our team has done a great job, and our customers have done a great job cooperating with us to make sure that it all works. We've discussed previously for future production projects, both greenfield sites and existing ethanol plants, they'll both be likely in the mix for us as we go forward in our build-out strategy.\n\nOur focus continues to be on locations with stable, low-cost feedstocks that are CI score advantaged and a large part of the footprint from traditional production facilities comes from, where did you get that electricity, where did you get that gas. It's because you don't want the fossil stuff, you want something else. And so, a large part of our effort is around opportunities to de-fossilize energy sources to drive the production facilities, got to substitute electricity, got to do something about heat sources. And of course, you have to also choose states and local governments that are business-friendly and support the overall goals.\n\nWe have been achieving our Net-Zero 1 development milestones that we identified in our company update in June, and it's happening on our timeline that we had planned. We will begin ordering long lead equipment over the next few months, and we expect to close our DBOOM contracts for wind power, green hydrogen that we need for the energy sources up at our NZ1 plan. In June, we issued shares of common stock in order to strengthen our balance sheet and advance what we believe will be a challenging financial markets over the next two years. Now, we can move forward with our NZ1 project and begin initial work on NZ2, our next big plant without significant capital constraints.\n\nWe're already getting organized to put a NZ2 plant in place, but I got to say, nothing is going to distract us from executing on NZ1. NZ1, FID and financial close on the debt component is expected to occur around mid-2023. We'll have already been spending and going to build that plant in advance of that. We expect to have 1 or more equity partners in the project at that time, which preserves Gevo Capital for the NZ program development.\n\nWe expect that NZ1 will be the cornerstone for our platform of NZ projects with debt and equity partners. We met several investors, energy, and financial strategics who see what we're doing and have expressed the interest in investing in our projects. We do explore it and flesh it out still, the combination of our take-or-pay contracts and the proven production technology takes a lot of risk off the table and people are starting to notice. Now, I'd like to turn the call over to Tim Cesarek, our chief commercial officer.\n\nTim has over 30 years of business development and private equity experience with over 15 of those years in renewable fuels, chemicals and energy. Tim has been with us at Gevo since early 2019, and his team is responsible for building the relationships and growth opportunities that have led to over 350 million gallons per year of SAF agreements. I think to get a few words from Tim describing the current market environment would be helpful. Tim?\n\nTim Cesarek -- Chief Commercial Officer\n\nThanks, Pat. First of all, I'd like to thank all the airline and trading companies that have joined our crusade for their continued confidence in Gevo's capability and vision. The importance of sustainable agriculture to the production of both nutrition and ultra-low carbon sustainable aviation fuel, and transportation fuels has been acknowledged by these companies through t`heir multiyear commitments to Gevo. We continue to see demand for low-carbon SAF exceeding supply for the next decade and beyond by as much as a factor of 12 times.\n\nBased on what we're seeing, we believe the SAF market size is 10 billion to 30 billion gallons over the next two decades. On the supply side, currently announced SAF projects total approximately 2.4 billion gallons globally. Gevo's goal of 1 billion gallons of fuel production by 2030 should be easily absorbed by the level of demand that is expected. While not distracting from our ethanol to jet production build-out, it's important to note that we continue to consider ways to progress our isobutanol platform to supply low-carbon renewable gasoline blend stocks and SAF.\n\nAdditionally, both the ethanol to jet and isobutanol platforms can supply chemicals, which is an area of rising interest with our customers. Our chemical products have the potential to be significantly carbon negative based on the GREET model. The world hasn't seen a drop in products that can drive down CI score like this. It will be exciting to see how the market determines the value of these products.\n\nIt's important to note that the ethanol to jet and isobutanol platforms also have operational and product synergies and can optimize our cash cost and product position on the same platform over time. In short, they're complementary, and I anticipate you'll all see more on these efforts in the future. So based on our volume of executed take-or-pay contracts, we have proven the strong demand for SAF exists. We continue to secure additional contracts and we'll supply the market for volume beyond 2027.\n\nHowever, going forward, our team will focus attention on securing partners in the energy transition space, as well as traditional energy companies and strategic financial groups who can help us grow faster. Further, we continue to screen and secure greenfield facility builds, and we will also look to partner with existing ethanol producers who are keen to decarbonize where it creates value and accelerates our time for production. Finally, I expect our commercial efforts will build off our Verity Tracking platform, which as you know, is in development. This will help us secure customers, differentiate us and our users who believe in the vision of tracking and counting carbon across every link of the value chain.\n\nNow, I'll turn the call over to Lynn to comment on the quarter's financial highlights. Lynn?\n\nLynn Smull -- Chief Financial Officer\n\nThank you, Tim. We ended the second quarter of 2022 with a strong liquidity position of $546.8 million in cash, restricted cash and other liquid investments. We realized $139 million of net proceeds from the issuance of common stock and common stock warrants in the June 2022 offering. Long-term debt outstanding of $67 million is related to the Northwest Iowa RNG project.\n\nOur corporate spend that is SG&A was approximately $6 million for the quarter, net of noncash stock-based compensation. During the second quarter of 2022, we invested approximately $15 million in capital projects comprised of $6 million into our Net-Zero 1 project, $8 million into the Northwest Iowa RNG project and approximately $1 million into other capital projects. Construction on our Northwest Iowa project is complete and it is being placed into service in Q3. Depreciation will start flowing through the income statement at that point.\n\nWe continue the development and finance efforts around Net-Zero 1. There is substantial interest from lenders and Net-Zero 1 project financing. The actual debt structuring and financing efforts will ramp up later this year to drive toward a debt close in 2023 after the project delivery contracts and final costs have been locked in. We're also engaged in discussions around equity partners in Net-Zero 1 and our Net Zero program overall.\n\nWe'd welcome an equity partner or partners to preserve our development capital for subsequent plants while still giving Gevo meaningful permanent project equity positions. And also note that the Senate passed draft Inflation Reduction Act of 2022 is a positive development for Gevo given both the SAF blenders tax credit and the clean fuel production credit for SAF or CP -- sorry, CFPC were included for a total of five years. The CFPC would take effect for production in 2025. To qualify for this new tax credit, SAF producers must produce fuel with at least a 50% reduction in life cycle greenhouse gas emissions when compared to petroleum jet fuel.\n\nThe SAF credit has an upside of $1.75 per gallon if a Net Zero CI score is received. This is all very good for Net-Zero 1, as we expect our SAF will qualify for the CFPC incentive, and we could qualify for as much as a cap to $1.75 a gallon if the EPA uses the Argon GREET 3.0 model as its measurement tool since we plan to be Net Zero under that model. Now, I'll turn the call back to Pat. Thank you.\n\nPatrick Gruber -- Chief Executive Officer\n\nThanks, Lynn. Yes, there's other good things in that bill as well. There are things like the funding for overall greenhouse reduction programs to build out plants and capacity and things like that, plus they fund some of the DOE programs and the USDA smart agriculture, all those kind of things have potential to benefit us. That's pretty exciting.\n\nThanks, Lynn. And operator, now please open up the call for Q&A.\n\nOperator\n\n[Operator instructions] We have a question from Derrick Whitfield with Stifel. Your line is open.\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nThanks and good afternoon. For my first question, I wanted to ask if you could really share your thoughts on potential benefits from the pending RA legislation, really building on where you ended the conversation. Obviously, the SAP BTC is a positive, but it seems like there's also a potential on the CCS and ITC elements that could benefit your capital costs. Any thoughts you guys could share about those benefits and the payment mechanism will be really appreciated.\n\nPatrick Gruber -- Chief Executive Officer\n\nYes. So the way the CCS work for us is that there is one of the pipelines being built, not too far away from us. We'll probably look up to that. I would expect us to and then it will go on.\n\nAnd the deal that we make with that would -- so everyone understands, we'll be capturing CO2 that comes off from mutation source or renewable carbon, and going into the pipeline, and ultimately geologically sequestered. That improves our CI score along the way. And so, it helps to add to the margins of our product. And how much it adds is dependent upon California LCFS, how it will be treated under RFS and all the rest, plus then there's the blenders tax credit that we just talked about.\n\nSo those are things that will be unfolding. If you do Argonne GREET model, you'd wind up with carbon negative type CI scores, carbon-negative CI scores. There's nobody who's talking about fuel from carbon negative, but us. And that's because we start with a Net Zero plan, if you add CCS to it, then it goes negative.\n\nThat's a big deal. And that shows people what's possible here for the future. The other things that are interesting in that bill are, one of the DOE programs, good. Those are about energy transition.\n\nThey funded the USDA smart climate stuff, that's awesome because this is about sustainable agriculture, bringing in to the overall picture. One of the great tools that this country has available to it is capturing carbon in the soil. It requires that modern -- people use modern farming techniques like low-till and no-till with precision agriculture, monitor what's growing, measure carbon and things like that. But those are the kind of programs that are put forth in that bill, and that's a big deal.\n\nThe other thing that we see is, going to be important is hydrogen stuff got funded, wind tax credits got funded, those benefit us because we'll be building hydrogen where, of course, we're working with Juhl Energy to build up the wind. The biogas, I think, there's some stuff in there for that, but I think it will be more important in the farm bill as that gets done because it's related more toward the manure and how to build things there. So overall, there's lots of really interesting stuff in here. It's a question of, is it going to get morphed up a little bit as it goes through the house, and then what is all -- what all the language behind it mean, all those things will be interesting to see.\n\nBut overall, it's like it's pretty encouraging, I'd say.\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nCertainly. And maybe just tacking on to your response, while the plan for decarbonizing your energy sources for NZ1 is likely locked, is there -- when you critically review that legislation to date, could that change your potential or preferred pathway for decarbonizing your production process?\n\nPatrick Gruber -- Chief Executive Officer\n\nThere's nothing in there that would change it like that. The fundamental issue for all production plants, this is all ethanol guys, anyone who makes, manufactures anything is, grid electricity is not green. That's just a simple fact of life. And so, people can talk about all the grid electricity and all the, hey, I got news.\n\nIf we want to use it, it creates the footprint for us. And you know what's worse, is fossil-based natural gas. That's where the issues lie for all of us who manufacture things. Those have to be substituted out over time if we're going to be successful in reducing the greenhouse gases.\n\nSo what's interesting about this is, I think that people really are grasping this idea of energy transition that will happen over a period of time. It's going to require many different sources of renewable electricity -- of different routes to get there. Same thing, hydrogen is useful. We can use capture excess electrons from wind, put into hydrogen, we can always get the energy back out of the hydrogen.\n\nWe'll be doing that up at our plant at, like Preston. And then, I think there is a possibility to do techniques where sequestration comes into play, geological sequestration comes into play where you can do the burning of a natural gas, capture the CO2 from it, sequester it. And so, I guess that's blue energy, and you'd wind up reducing the carbon footprint. So all those things are touched upon in this bill.\n\nBut make no mistake, all these things are awfully market-driven. So the government is nice, good, good for them, making progress, great. That will help things. We've got to clear up things.\n\nWe've got to clear up grid problems, all those kind of things. But you know what, it's all market-driven anyway. And so, this ain't going away ever on CI score. And that is a new competitive attribute of which we are 100% focused on.\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nThat's great. And if I could just ask one additional question. Regarding to the chemical products you referred to in your prepared remarks, could you help frame or add some color around the market size and potential specializations for low-carbon chemical products?\n\nPatrick Gruber -- Chief Executive Officer\n\nYes. Here's a really simple way to think of it is that our business is taking the renewable materials and converting them first in the building blocks. These building blocks are the primary petrochemical things that you get out of a cracker, the ethylene, propylene, and butines. If you know how to make those from renewables and to do them cost effectively, which we do, you can make literally everything that's in the petrochemical, all the big chemical products, you can make them.\n\nThe technologies are all already exist, and all in play already in the chemical industry. The thing that's going to be interesting about our material is that they're massively carbon negative. So think about that. If we take in our manufacturing sustainable aviation fuel, and then it goes to a jet plane and it burns and we're measuring CO2 at the tail versus what the farmer took in a CO2 on the front, and we get to Net Zero right? If it's sitting in -- that same fuel sitting in a tank would be about a minus 100 CI score, fully sequestered carbon sitting there in tank, likewise, with these chemical products.\n\nSo it'd be possible to take and make massively carbon-negative polyethylene, polypropylene, polyester, any of those things. So think of all plastics, all large plastics, think of all those things, all of those are then enabled and it's not doing anything super special or fancy. It's just simply feeding them into the infrastructure of the chemical industry. That's all that has to happen.\n\nYou don't need new production to go downstream and do the chemical products, it already exists. You just got to substitute the raw material.\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nThat's great. Thanks for your time and responses.\n\nOperator\n\nAt this time, this concludes our question-and-answer session. I would now turn the call back over to Dr. Gruber for his closing remarks.\n\nPatrick Gruber -- Chief Executive Officer\n\nThank you all for joining us. It's an exciting time for us here at Gevo. I'm pleased to be moving forward. Lake Preston feels really good, after all this time to get on with it.\n\nI appreciate all of our partners who are working with us to do the defossilization, decarbonization. That's going to be a tremendously important thing as we go forth, and the solutions are going to be slightly different each location. And our customers have been great. They've been up learning about how to do sustainable agriculture, how to think about counting carbon, and learning to the ins and outs of this whole business because it is different.\n\nWe have to account for the whole supply chain. And we are out to drive CI score down. And we are trying to change the whole of the business system together. And so, it's a pretty interesting game to play.\n\nI'm looking forward to it, and getting on with it, and I'm glad our teams are doing such a good job of getting things done. And thank you all for your support in Gevo. With that, have a good afternoon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Richardson -- Director of Investor Relations\n\nPatrick Gruber -- Chief Executive Officer\n\nTim Cesarek -- Chief Commercial Officer\n\nLynn Smull -- Chief Financial Officer\n\nDerrick Whitfield -- Stifel Financial Corp. -- Analyst\n\nMore GEVO analysis\n\nAll earnings call transcripts"
}