{
  "companyName": "Yext, Inc.",
  "companyTicker": "YEXT",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/yext-inc-yext-q2-2023-earnings-call-transcript/",
  "content": "Yext, Inc. (YEXT 1.87%)\nQ2 2023 Earnings Call\nSep 07, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Yext second quarter fiscal 2023 earnings conference call. All participants will be in listen-only mode. [Operator instructions]. After today's presentation, there will be an opportunity to ask questions.\n\n[Operator instructions]. Please note, this event is being recorded. I would now like to turn the conference over to Nils Erdmann, senior vice president, investor relations. Please go ahead.\n\nNils Erdmann -- Senior Vice President, Investor Relations\n\nThank you, operator, and good afternoon, everyone. Welcome to the Yext fiscal second quarter 2023 conference call. With me today are CEO, Mike Walrath; COO and president, Marc Ferrentino; and CFO, Darryl Bond. Before we begin, I'd like to remind everyone that this call may contain forward-looking statements, including statements about expectations regarding growth of our business, our management and governance plans, strategy, forward-looking guidance, and estimates of financial and operating metrics, capital expenditures and other non-historical statements as further described in our second quarter earnings press release.\n\nThese forward-looking statements are subject to certain risks, uncertainties, and assumptions, including those related to Yext's growth, the evolution of our industry, our product development and success, our management performance, and general economic and business conditions, such as the impact of COVID-19 pandemic. We undertake no obligation to revise any statements to reflect changes that occur after this call. Descriptions of these and other risks that could cause actual results to have a material difference from these forward-looking statements are discussed in our reports filed with the SEC, including our most recent quarterly and annual reports and our press release that was issued this afternoon. During the call, we also refer to non-GAAP financial measures.\n\nReconciliations with the most comparable GAAP measures are also available in the earnings press release, which is available at investors.yext.com. With that, I will turn the call over to Mike.\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nThanks, Nils, and thanks, everyone for joining us today. Second quarter was a solid quarter for Yext and we executed well against our strategy of driving long-term growth through increased operational efficiency, best-in-class product innovation, and improving customer satisfaction. Our revenue for the quarter was $100.9 million and our non-GAAP net loss per share was $0.03, beating the high end of our guidance range by $0.02, driven by our success in streamlining the business and improving our operating efficiencies. These results highlight the momentum we're generating through a realignment of our sales and customer success organizations, while successfully managing costs in order to increase our cash position in the future.\n\nAs our full-year non-GAAP EPS guidance suggests, we expect to achieve profitability in the back half of this year. I'd like to share some observations about our progress toward achieving our strategic objectives and how the rate of this progress factors into our expectations for the second half of the year. First, as we noted in our first quarter call, providing greater clarity around our brand and platform capabilities are a key to rearchitecting our go-to-market strategy. During the quarter, we made significant progress against this priority and transitioned the name of our answers product to search and our core set of products, listings, reviews, pages, search and knowledge graph together as the answers platform.\n\nWe did this to align with what we actually do for customers in our vision to help businesses answer every question from their customers, employees and partners anytime, anywhere. We made this change with the launch of our summer release that included 60 plus new features and upgrades across every area of the platform, reflecting our continued commitment to innovation and realizing our vision as the answers company. To help us continue to strengthen our brand positioning, we announced our new chief marketing officer, Raianne Reiss in late August. Raianne has more than 20 years of global technology marketing experience at companies like AWS, Juniper Networks, and more recently Elastic.\n\nRaianne will oversee Yext's global marketing organization and be responsible for building and strengthening the Yext brand and increasing demand for Yext solutions globally. Second, we continue to lay the groundwork for future revenue opportunities, landing deals across all of our products. Although it's still early, I'm very encouraged by the breadth and variety of deals we closed during the quarter as they demonstrate that our product suite and value are resonating with customers. Mark will discuss our recent product innovations and share customer wins in a moment.\n\nI believe these customer stories are leading indicators reflecting that the ongoing rearchitecture of our go-to-market is having an impact and we are well positioned to capture additional opportunities as we continue to improve all elements of our go-to-market motion to drive product innovation and expand customer use across the platform. In conversations with dozens of customers and prospects this quarter, I've observed first-hand the increasing importance to the C-suite of answering their constituents' questions wherever and whenever those questions are being asked. The individual use cases and priorities of each customer vary from location-based questions on third-party properties to various company-controlled search use cases such as support search, but this is a clear priority across the diversity of customer use cases. While we remain cautious on our outlook, I am highly encouraged by our prospects to drive tremendous customer value.\n\nThird, our third quarter guidance reflects our ability to successfully improve our operating efficiencies. We've demonstrated we can operate more efficiently and the team is excited about the changes we are making to drive success for our customers. We continue to make organizational changes in the business that lower our operating expenses by reducing layers, increasing spans of controls, and creating more coordination across our teams. I could continue to believe that we'll drive better customer outcomes and ultimately sell and service our products more effectively by creating a leaner, more agile organization.\n\nAs we noted on our last call, ARR is a metric we focus on because it provides insight into the performance of our recurring revenue business model and is less impacted by fluctuations in billing and contract terms. Direct ARR continues to be our primary revenue driver. We are working to broaden our relationships with third-party resellers and refocus on our share growth opportunities. As I look at the ARR picture, our total ARR is relatively flat over the last couple of quarters.\n\nThis is largely driven by significant negative FX in Q1 and Q2 and weakness in third-party reseller ARR. We are seeing growth in direct ARR, which we believe is the most immediate measure of our overall products market fit. Darryl will provide more detail on the specific dynamics around FX and ARR. We will continue to look at the ARR picture conservatively as we work to improve our go-to-market motion and in light of global macroeconomic and FX conditions.\n\nWe do see a global trend toward more scrutiny on overall spending and longer deal cycles and this is reflected in our outlook. Our Q2 results and full-year guidance demonstrate that we are executing well against our strategy, while making clear progress on our path to profitability. The team and I continue to operate the business based on the principle that long-term sustainable growth is the result of a more clinical and efficient operating model and I remain extremely optimistic about our ability to capitalize on our large market opportunity. We have installed a lot of change inside the company in the last six months.\n\nChange like this is challenging in any environment and even more so with the backdrop of uncertainty in the global macro environment. I'd like to take a moment and thank our entire global team for their dedication and commitment to getting to the right answer for our customers and the company. We continue to believe that our stock is a great investment and this is reflected in our continued share repurchases in Q2. With that, I'd now like to turn the call over to Marc.\n\nMarc Ferrentino -- President and Chief Operating Officer\n\nThanks, Mike. As Mike noted earlier, we reached an important milestone in our brand cleanup this quarter and added new features across the entire platform with the early access launch of the summer release. I'll begin by discussing how we are rolling out updated branding and highlight the product innovations included in our summer release followed by a few customer success stories. Last quarter, we discussed how we would be working to clean up our messaging and simplify our brand.\n\nI am proud to report that we have made major progress on this front. We have revised and simplified our brand positioning, cleaned up our usage of the term answers by updating the product name to search and establishing answers as the name of our platform. We've updated our website products, solutions, and marketing materials to reflect this updated messaging and brand positioning. We believe that every CEO has an answers problem.\n\nEvery day, customers, employees and partners are asking questions about your business in an attempt to find information. Answering these questions is hard for any business since the answers are scattered across different content silos and digital channels are managed separately. With the answers platform, Yext solves this problem by collecting and organizing your content, then answering these questions through seamless multichannel digital experiences. This updated messaging and branding is being rolled out to the organization throughout Q3.\n\nThe rollout of our new branding coincided with the early access of our summer release. With this release, we have added Google business profile listings analytics and more detailed listing statuses, which offers never before seen insights into user, performance, and operating data. We believe these insights will further strengthen the value of our flagship listings product. We also enhanced our connector framework to allow us to connect to a larger range of internal systems in order to populate the knowledge graph.\n\nWe continue to make great strides with our developer experience with major enhancements to our pages, offering and allowing a greater set of development options to create search experiences. Overall, we have launched 60 plus new features across our listings, pages, reviews, search, and knowledge graph products. These features significantly upgrade the ability of the Answers platform to create multichannel experiences that are more efficient, cost effective and gratifying for the end user. General availability will kick off tomorrow, September 8.\n\nAs Mike noted, we believe the diversity of our customer wins across listings only, listings upsell, search and multiproduct solutions are a good indicator that we have the opportunity to expand these partner relationships over time, particularly as we continue to strengthen our go-to-market and customer support teams. Here are a few examples. Texas Children's Hospital was a listings renewal and upsell this quarter, originally, they use listings for several hundred of their care providers. After we were able to demonstrate incremental revenue lift, the customer decided to renew and increase their commitment to approximately 3,000 providers.\n\nThis is a listings customer that started small and by showing value we were able to expand our relationship over time and we see future potential opportunities to expand with other products. Piedmont Health is another good example of a healthcare client has started with listings over three years ago and seeing that Yext could deliver on both scale and speed invested in additional products. This quarter, we expanded our agreement with Piedmont Health to include additional providers. In retail, we've expanded our listings and pages relationship with the SPARC Group to include additional brands that we haven't worked with before, including Aeropostale, Eddie Bauer, and Nautica.\n\nWe also transformed nationwide support hub by adding Yext Search. After Yext was able to successfully deliver on listings and pages over the past two years, nationwide decided to expand our relationship to include support search. Internationally, HCA UK was a great win for us, as they are one of the largest private healthcare companies in the UK. We landed with search this quarter, helped them solve the support pain point, but with over 3,000 consultants in 240 facilities, we see future opportunities to expand with this customer.\n\nIn Japan, we signed Tsuruha Holdings, one of the leading companies in the drug store industry in Japan, which will be using our listing solution. After a competitive evaluation process, Box, the content cloud selected Yext to transform the search experience of their Zendesk support site. The support search deal is their initial high-priority use case and we see additional room for growth across the business. We have been working with L'Oreal's SalonCentric brand is a listings client for over a year.\n\nThis quarter, we expanded across three additional brands that sell their products through salons. Our search product was able to provide a centralized platform for managing data, integrate with other technologies like Salesforce, and handle non-location related data to provide additional accurate information about the salons that sell these products. On the partnership front, our partnership with Acquia help provide a solution for Pegasystems where we will power their search on their support and community sites. And our partnership with Adobe helped us win a site search deal at Booz Allen.\n\nOn the competitive front, win rates for our Search product were very high. Notably, we beat several of our competitors in new business wins, including the largest global insurance provider based in Europe, Community Health Network, Exponent, and ECCO Shoes. In closing, we're excited about the pace of our product innovation and the diversity of use cases as demonstrated by our customer wins. Now, I'll turn the call over to Darryl.\n\nDarryl Bond -- Chief Financial Officer\n\nThanks, Marc. Our second quarter revenue grew 3% year-over-year to $100.9 million, which was above the high-end of our guidance range. As a result of the stronger dollar relative to countries where we transact in local currencies, second quarter revenue included a negative year-over-year impact of approximately $2.8 million or 3% using a constant currency basis. Excluding the FX impact, our second quarter year-over-year growth was approximately 6%.\n\nUnearned revenue was $165.9 million at the end of the quarter, up slightly from a year ago. Annual recurring revenue or ARR was $387 million at the end of Q2, up 2% year-over-year. ARR at the end of Q2 experienced an approximate $10.8 million negative impact from FX year-over-year on a constant currency basis. Excluding the FX impact, our Q2 year-over-year ARR growth was approximately 5% and has grown sequentially since the first quarter of this year.\n\nOur trailing 12-month net dollar based retention, which excludes our small business customers was 98%. Our trailing 12-month net dollar-based retention for direct, which also excludes small business customers as well as our third-party reseller customers was 98%. Our customer count, which exclude small business customers and third-party reseller customers increased 8% year-over-year to over 2,870. Last quarter, we began providing a more detailed look at ARR across our direct customers and third-party reseller customers to help investors measure our future opportunity as well as progress across new customer adoption renewals and upsells.\n\nIn the second quarter, direct customers represented 81% of total ARR. Direct ARR at the end of Q2 totaled $312 million, representing 5% year-over-year growth. Excluding the impact of FX, the direct ARR growth relative to last year was 8% on a constant currency basis. The direct sales team is primarily focused on enterprise and mid-market accounts where ARR growth is a good measure of adoption and satisfaction.\n\nThird-party resellers represent 19% of total ARR. Third-party reseller ARR totaled $74.9 million at the end of Q2, representing decline of 6% over prior year. Excluding the impact of FX, third-party reseller ARR declined 4% relative to last year on a constant currency basis. Turning to non-GAAP results, which are reconciled to GAAP in our press release.\n\nQ2 gross margin was 74.5%, compared to 75.2% in the year-ago quarter, generally consistent with our second quarter seasonality and we expect to be in the range of our long-term non-GAAP gross margin target of 75% to 80% for the remainder of the year. Q2 operating expenses were $78.6 million or 78% of revenue, compared to $79.8 million or 81% of revenue in the year-ago quarter. We continue to improve operating efficiencies, particularly in sales and marketing. Sales and marketing as a percentage of revenue declined to 48% in Q2 from 52% in the second quarter last year and we expect this metric to continue to improve on an annual basis.\n\nOur Q2 net loss was $3.9 million, compared to a net loss of $7.2 million in the year-ago quarter. Our Q2 net loss per share was $0.03 compared to a net loss of $0.06 per share in the second quarter last year. Cash and cash equivalents were $188 million at the end of Q2, compared to $248 million at the end of the first quarter. The decline in our cash balances was driven largely by continued share repurchases executed during Q2, which totaled $31.6 million.\n\nYear-to-date our share repurchases totaled $59 million. We intend to continue to maintain a strong balance sheet and cash position going forward and will remain open to buying back our stock at attractive prices. Net cash used in operating activities for Q2 was $25.2 million compared to $32.6 million cash used in the year-ago quarter. Capex was $2.2 million in the second quarter compared to $3.1 million in the second quarter of last year as we have returned to a normalized annual Capex run rate following the completion of our real estate expansions.\n\nTurning to our outlook. The U.S. dollar has strengthened even further versus the currencies in which we transact our international business, resulting in a larger than expected FX headwinds to both Q3 and the full year of our fiscal '23. Our guidance assumed present foreign currency rates and we expect Q3 revenue to be between $99 million and $100 million.\n\nOur Q3 guidance includes the negative impact of $1 million as a result of FX. While this indicates a sequential decline in revenue, when adjusting for FX on a constant currency basis, our business continues to grow. For example, total ARR grew modestly quarter-over-quarter this year when adjusting for the impact of FX on a constant currency basis. We expect our Q3 non-GAAP EPS to be between negative $0.01 and positive $0.01 assuming a weighted average basic share count of approximately 124.4 million shares.\n\nFor the full year fiscal '23, we expect revenue of $399.4 million to $401.4 million. The total year-over-year FX impact is now estimated to be $8 million, an incremental $2 million since our last earnings call, which is based on present foreign currency rates. Our non-GAAP net loss per share is expected to range from $0.06 to $0.08, a $0.04 improvement from the midpoint of our previous guidance as we expect continued improvement across operating expenses, particularly sales and marketing. Full-year EPS assumes a basic weighted average share count of approximately 126.3 million shares.\n\nOperator, we are ready to open it up for Q&A.\n\nOperator\n\n[Operator instructions]. Pardon me, this is the conference operator. We seem to have lost the connection with the main speakers, rejoining them momentarily.\n\nNils Erdmann -- Senior Vice President, Investor Relations\n\nHello.\n\nOperator\n\nYes, Nils. Can you hear me?\n\nNils Erdmann -- Senior Vice President, Investor Relations\n\nWe can hear you now.\n\nOperator\n\nOK. Let me just try the other line real quick here. Hang on one second, please. OK.\n\nWe're going to proceed on this line, gentlemen. Our first question is going to come from Naved Khan with Truist. Please go ahead.\n\nNaved Khan -- Truist Securities -- Analyst\n\nYes. Hi. Thanks a lot. Just two questions for me.\n\nFirst on the sales and marketing. We are seeing nice leverage, can you just maybe update us on the headcount? And I understand the rebranding that you're doing, but outside of that, what are the other things that you might be doing to increase sales efficiency and maybe sales motion maybe? Any color there would be helpful. And then on the net dollar retention for direct, it seems like it went down from Q1 and wanted to clarify if there's any FX impact there or how should we understand that sequential decline? Thanks.\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nYes. So, hey, it's Mike, and thanks for the question. I'll let Darryl handle the net dollar discussion. What I'll say on your question about the sales and marketing efficiencies, and specifically, headcount.\n\nOne thing I told you on my first call here six months ago was that we are not going to be continuing to run the business from a capacity point of view and that we're going to be focused on driving sales productivity and that we would reinvest in the business when we saw the productivity that we wanted. So you can clearly see that we're driving that efficiency through the organization and it's a lot bigger than just quota-carrying head count, but across the board we're finding these efficiencies. And so we're not going to be doing -- what I'm going to be providing a quota carrying number and that's just -- it's a moving target for us and it's something that we're constantly evaluating and will continue to be constantly evaluating as we look at the ability for the sales teams to be effective in the market. So much of the work that we're doing from a branding perspective and from a positioning perspective is going to help us drive better results through the channels.\n\nAnd so I think the headline there is, we're just taking a totally different look at it, approaching it from a productivity standpoint as close to a capacity standpoint.\n\nDarryl Bond -- Chief Financial Officer\n\nYes. On the net retention, you're right, it did tick down from 99% last quarter, 98% this quarter. And that's really a result of just some of the challenges that we've talked about in previous calls around customer success and gross retention and obviously as we continue to move through a lot of the go-to-market changes that we've been talking about. We're certainly having an impact on our upsells, which are really what's contributing to the movement there.\n\nNaved Khan -- Truist Securities -- Analyst\n\nGot it. And then a quick follow-up if I may. So your recent appointment of Raianne Reiss, I think that's a great hire, maybe just talk about how you think, where do you see sort of hire kind of leveraging her background as it sort of -- as it relates to the product offering at Yext? Is it -- do you see that in the search offering or do you see -- where do you see the most opportunity there, just kind of address your thoughts?\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nYes. So, we're absolutely thrilled that Raianne has joined the company, she is about two weeks in the job. So we're going to give her a little time to get oriented, but she brings 20 years of technology marketing experience to the table, AWS, Juniper, and Elastic more recently. And she is a complete marketing executive, who will oversee our whole marketing organization.\n\nWe are not thinking about things from a search being separate standpoint here anymore and I think that's reflected in the positioning. So what we're excited about and I think what Raianne excited about here is that there's a complete platform to sell here, it's keyed in on solving some of the most important problems of the C-Suite, which are answering their constituent questions anytime, anywhere. And between our brand positioning work, which Raianne will continue to advance as well as really importantly the demand generation background that she has and the ability to drive that we just really saw she actually bring lot to the table here.\n\nNaved Khan -- Truist Securities -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nThe next question is from Arjun Bhatia with William Blair. Please go ahead.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nPerfect. Thank you guys for taking my question here. Just one on the rebranding efforts and how you're repositioning that. What impact or change rather have you made to pricing if any? Do any of these rebranding efforts impacts how customers are actually purchasing Yext's or is it more on just the broader sales process for the communication of these, the value proposition is clearer.\n\nAnd then just on this topic as well, do you have a sense of how long it might take before we start to see some of the broader impact from some of the initiatives that you're rolling out today to play out?\n\nMarc Ferrentino -- President and Chief Operating Officer\n\nAll right. Hey, this is Marc. Thanks for the question. So on the rebrand, a lot -- what we're doing here is really articulating in a really strong way that the total value of the platform.\n\nHistorically, we've talked about individual products, we are sort of looking at the world now in a way that sort of experiences now, span across multiple channels and we have a digital experience platform that allows you to deliver your answers across multiple different channels and of course to do this right, you need to of course do that. From a pricing standpoint we changed actually two years ago to a capacity-based pricing model that was in anticipation of this move toward the platform. And so at this time, there is no need to change, there is no reason to change to be -- we already meet that big shift a couple of years ago.\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nI think the second part of your question, we got a little, there were some background noise there, but it sounded like, it started with how long will it take and I lost the second part of it.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nYes. No, sorry, that was right. Just, how long it would take before -- it starts like, it sounds like you're seeing some early impacts, but how long before we see a broader impact from some of the initiatives you're rolling out today?\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nYes. So, it's Mike again, and the way I would describe this is on this Friday I think I will have been in the job for six months. And obviously, the first order of business was getting the team organized, which took a little bit of time, and the second order of business was a lot of the restructuring and efficiency work that we've been doing. I still fundamentally believe that the more efficient operation that we're creating and that you're starting to see on the expense side of the business is going to actually -- is going to help us produce better results by having a more coordinated and more streamlined and a more agile organization.\n\nBut I think it's really important to understand that our sales cycles are six months plus, right. And so our ability to fundamentally change bookings and retention dynamics, they're going to -- it's just going to take longer than it is for us to flex the expense lines. And so I think what we're beginning to see in the business are very early indications that better coordination, better management of our opportunities, but we're just so early in that process, and as we get into the next six months to 12 months, I think we start to see the fruits of all that work.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nUnderstood, very helpful. And then you talked about some of the channel, the progress in the channel that you're making. I'm curious, what is the reach today, like, I know it's 90% of ARR, but as you think about focusing on as an issue in the future here, do you want more partners, do you want deep relationships with existing partners, is there a potential for Yext size to get involved here, just walk us through how you're thinking the partner strategy?\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nYes. So, I think, you can see clearly that we have some headwinds in the partner channel that is the outside the reseller channel, our third-party resellers or how we access primarily small and medium SMBs. And so we do think that there is a bit more headwinds in that section of the market than there is in the enterprise. I also think there's a lot more we can do with those reseller partners to bring more opportunity to the table and bring more value to those relationships.\n\nAnd so, I've said this before and I could say that we're committed to figuring out ways to continue to drive value through product innovation, through different structures and different business relationships with our third-party reseller partners. And thinking more broadly about what the partnership universe looks like for us, which includes a size and Marc has been spending a lot of time with not just the -- and his team, not just with the reseller partners, but also with partners of many flavors and it's all part of our strategy moving forward.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nUnderstood. Thanks for taking the question, guys.\n\nOperator\n\nThe next question is from Tom White with D.A. Davidson. Please go ahead.\n\nWyatt Swanson -- D.A. Davidson -- Analyst\n\nHey. This is Wyatt Swanson on for Tom. Thanks for taking our questions. Sorry, if I missed this during the prepared remarks, but can you guys talk a bit about retention trends in your listing business? I believe you guys recently rolled out some new product features and enhancements for listing customers.\n\nDoes that have a quantifiable impact on listings retention?\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nYes. So, I'll start, it's Mike. And then I think let Marc talk about a bunch of the product stuff. So what we saw in Q2 was gross retention in the business in the low-80s, which is consistent with what we saw in Q1.\n\nAnd as a reminder, and I wasn't maybe clear enough about this on the last call. The way we calculate gross retention when we talk about it in this context is it's the grand total of contracts that are up for renewal in a given quarter is the number and then what we actually renew. And so we're not happy with that number the last couple of quarters in the low-80s. But we have a much smaller set of contracts in Q1 and Q2 that are up for renewal.\n\nAnd so there is no higher priority for us in the business than driving performance in this number. And a lot of that comes down to happier customers which I've talked about a lot, product enhancements, which Marc can talk about are a big part of that process as well.\n\nMarc Ferrentino -- President and Chief Operating Officer\n\nYes. The last two the releases, the spring release in summer release, we continue to innovate on the listings product, listings product has been our -- one of our core flagship products for a very long time. This release we -- two big features that I mentioned in the prepared remarks, we're around the Google business profile analytics, which actually gives you keyword level analytics now as far as how your brands showing up, which is -- that was something new and exciting, really highlights the value of listings overall in addition to just operational metrics around losing status and things of that nature. Every single release we have continue to evolve the listings product, to innovate listings product, I think we've done a better job of in the last quarter is actually articulated those new features to our customer base, and that's -- that has been at least anecdotally well received by many of our customers appreciating the insight and even sending out to the listings specific product updates to sort of be able to highlight exactly what we're doing in that front.\n\nWyatt Swanson -- D.A. Davidson -- Analyst\n\nGot you. OK. Thank you. And then just one more from me.\n\nCould you share your latest thoughts on potentially using your balance sheet to do some M&A or does M&A kind of play less of a role right now for Yext just given your focus on simplifying the go-to-market and unifying the overall end-customer experience?\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nYes. So, it's Mike. So, I'm happy to talk about that. We've obviously as you can see, been using our balance sheet to invest in our own stock, which we think is the greater investment and we will continue to look at that as we go forward.\n\nFrom an M&A perspective, I do think it's an interesting thing for the future. I think at this point, we have a lot of wood to chop to continue our -- to strengthen our go-to-market and complete the work that we've been doing here to reorient the business around a more efficient operation. So I wouldn't call -- I wouldn't say it's a high priority for M&A at this point to be aggressively looking at that. I do think there will be opportunities along the way and we'll obviously look at anything that seems additive and feasible.\n\nBut I'm not going to say it's one of my or the team size priorities right now.\n\nWyatt Swanson -- D.A. Davidson -- Analyst\n\nGot you. OK. Thank you.\n\nOperator\n\n[Operator instructions]. The next question is from Ryan MacDonald with Needham. Please go ahead.\n\nUnknown speaker\n\nHi, everyone. This is Michael on for Ryan today. You noted it a little bit earlier, but could you talk a bit on the broad macro impact outside of just FX? Are there any verticals or regions that stand out to you in terms of the impact of elongated sales cycles?\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nYes. So I think what we're seeing is we're seeing customers assessing their costs more carefully. We're seeing, I think you procurement cycles to take a little bit longer. I think most businesses are taking a little bit closer look at what they're spending.\n\nThe other thing we're -- so I think we're seeing a lot of what a lot of people are seeing, which is potentially some elongation of sale cycles and that may be regionally happening a little bit more in Europe than it is here in the U.S., although I really think most global businesses now are taking a closer look at their expense lines. The other thing we're seeing and that I think is more encouraging is that with that scrutiny comes to focus on which partners they work with who can provide multiple solutions and platform solutions as opposed to individual point solutions. And so one of the things that that we're hearing from customers and frankly we're doing in our own businesses, we're figuring out where can we do more with our best partners and potentially eliminate overlap and duplication. And we really think that's an advantage for us because we have a platform that crosses many of the needs of our customers and prospects, and we think that over the long run any consolidation of focus is going to be to our advantage relative to our competitors who don't have a platform.\n\nUnknown speaker\n\nGreat. And then given the turnover you saw in the workforce earlier this year, could you give us an update on how you're progressing on your hiring plans relative to expectation? And then in regards to those newly hired reps, could you give us a sense of how those reps are ramping relative to expectations? Thank you.\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nSo I think general comment on the hiring situation is, I think we've seen a significant change in the hiring environment. And I think it's cooled down quite a bit, and the flip side of that is that hiring in our quota carrying position is significantly less of a priority right now for us as we work through, making sure that every reps that we have in the business is productive and making sure that our system is working our way that drives production. This is -- my answer on the quota-carrying reps question is related to the -- so just -- I'll get very focused on the number of quota-carrying reps that we have in the business when all of the quota-carrying reps that we have and we're ramped are producing at a level that we wanted to be. And so we'll always look to add talent to the business and I think the environment that we're going into makes that easier for us, not harder, but we're going to get our blocking and tackling together before we go out and aggressively expand.\n\nUnknown speaker\n\nGreat. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNils Erdmann -- Senior Vice President, Investor Relations\n\nMike Walrath -- Chairman and Chief Executive Officer\n\nMarc Ferrentino -- President and Chief Operating Officer\n\nDarryl Bond -- Chief Financial Officer\n\nNaved Khan -- Truist Securities -- Analyst\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nWyatt Swanson -- D.A. Davidson -- Analyst\n\nUnknown speaker\n\nMore YEXT analysis\n\nAll earnings call transcripts"
}