{
  "companyName": "Icahn Enterprises",
  "companyTicker": "IEP",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/icahn-enterprises-iep-q3-2022-earnings-call-transc/",
  "content": "Icahn Enterprises (IEP 1.00%)\nQ3 2022 Earnings Call\nNov 04, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Icahn Enterprises L.P. third quarter 2022 earnings conference call with Rob Flint, director of accounting; David Willetts, president and CEO; and Ted Papapostolou, chief financial officer. I would now like to hand the conference over to Rob Flint, who will read the opening statement.\n\nRob Flint -- Director of Accounting\n\nThank you, operator. The Private Securities Litigation Reform Act of 1995 provides a safe harbor for forward-looking statements we make in this presentation, including statements regarding our future performance and plans for our businesses and potential acquisitions. Forward-looking statements may be identified by words such as expects, anticipates, intends, plans, believes, seeks estimates, will, or words of similar meaning and include, but are not limited to, statements about the expected future business and financial performance of Icahn Enterprises L.P. and its subsidiaries.\n\nActual events, results, and outcomes may differ materially from our expectations due to a variety of known and unknown risks, uncertainties, and other factors that are discussed in our filings with the Securities and Exchange Commission, including economic, competitive, legal, and other factors, including the severity, magnitude, and duration of the COVID-19 pandemic. Accordingly, there is no assurance that our expectations will be realized. We assume no obligation to update or revise any forward-looking statements should circumstances change, except as otherwise required by law. This presentation also includes certain non-GAAP financial measures.\n\nA reconciliation of such non-GAAP financial measures to the most directly comparable GAAP financial measures can be found in the back of this presentation. I'll now turn it over to David Willetts, our chief executive officer.\n\nDavid Willetts -- President and Chief Executive Officer\n\nThank you, Rob. Good morning, and welcome to the third quarter 2022 Icahn Enterprises earnings conference call. Joining me on today's call is Ted Papapostolou, our chief financial officer. Together, we'll provide an overview of Q3 results and then be available for questions.\n\nBefore we get into the results, I'd like to reemphasize that we believe activism is the best paradigm for investing. We are putting our activist principles into effect in both our majority controlled and our minority positions held in our investment segment. Additionally, we strongly believe in hedging our positions to mitigate risk, especially in the volatile markets that we're living in today. For the sake of brevity, all net income and EBITDA amounts we'll discuss are attributable to Icahn Enterprises, unless otherwise specified.\n\nNow, on to the numbers. For the nine months ended September 30, 2022, net income was 72 million, or $0.23 per depositary unit, and our adjusted EBITDA was 812 million. For reference, last year's first nine months figures were a net loss of 122 million, or a loss of $0.47 per depositary unit, and adjusted EBITDA of 715 million. Our third quarter discrete results were a net loss of 123 million, with adjusted EBITDA of 70 million.\n\nThis represents a quarter-over-quarter improvement of $25 million of net loss and a decrease of 18 million of adjusted EBITDA. Our indicative net asset value as at quarter end increased by 1 billion to 6.2 billion as compared to December 31, 2021. A change in indicative net asset value includes, among other things, changes in the fair value of certain subsidiaries, which are not included in our GAAP earnings reported above. Regarding our segments.\n\nYear to date, our investment funds had a positive return of 2.4%, which includes a negative Q3 return of 1.9%. By comparison, the S&P 500 is down approximately 24% for the year and down 5% for the quarter. CVI ended the quarter with continued strong performance, largely due to crack spreads, which is facilitating a continued -- which is facilitating continued dividend distributions. We're in the process of upgrading select management change.\n\nIn this case, we have replaced the CEO, have invested in a new head of manufacturing, and are refocusing the business on margin growth and factory performance. At Pep Boys, we're in the process of replacing the CEO and looking to upgrade other members of the senior management. The board declared a $2 quarterly distribution payable in cash for additional units. With that, let me turn it over to Ted for a detailed discussion of all of our segments.\n\nTed Papapostolou -- Chief Financial Officer\n\nThanks, David. I'll begin by reviewing our consolidated results and then highlight the performance of our operating segments and comment on the strength of our balance sheets. For Q3 '22, we had net loss of 123 million and adjusted EBITDA of 70 million compared to a net loss of 148 million and adjusted EBITDA of 88 million in the prior-year period. I'll now provide more detail regarding the performance of our individual segments.\n\nAs David mentioned, the investment funds had a negative return of 1.9% for the quarter, which was primarily driven by net losses in long positions and credit default swaps, offset in part by net gains in other short positions. For the quarter, long positions had a negative performance attribution of 4.9%, while short positions and other had a positive performance attribution of 3%. The investment funds had a net short notional exposure of 54% at the end of the quarter compared to a net short notional exposure of 28% at the end of Q2. Our investment in the fund was approximately 4.4 billion as of quarter end.\n\nAnd now, to our energy segment. In Q3 '22, our energy segment reported net sales of 2.7 billion compared to 1.9 billion in the prior-year quarter. Adjusted EBITDA was 124 million for Q3 '22 compared to 143 million in Q3 '21. CVI declared a $1.40 per share cash dividend, which includes a special dividend of $1 per share.\n\nAnd CVR Partners declared a third quarter cash distribution of $1.77 per unit. Q3 '22 refining margin per throughput barrel was $16.56 compared to $15.03 in the prior-year quarter. This increase was primarily due to widening crack spreads. The cost of rents continue to have a negative impact on our refining business with 136 million of related expense for the quarter.\n\nQ3 '22 average realized gate prices for UAN improved by 42% to $433 per ton, and ammonia improved by 65% to $837 per ton when compared to the prior-year quarter. And now, turning to our auto segment. Q3 '22 net sales and service revenues for the automotive segment were 625 million, an increase of 31 million from the prior-year quarter. Q3 '22 adjusted EBITDA was 1 million compared to 14 million in the prior-year quarter.\n\nQ3 '22 automotive service revenue increased by 55 million as compared to the prior-year period, mainly due to volume and price increases. During the quarter, the service business were negatively impacted by unfavorable product mix and several nonrecurring SG&A. Aftermarket parts sales decreased by 34 million, mainly due to store closures as part of the transformation plan. And to our real estate segment, Q3 '22 net sales and other revenues increased by 3 million compared to the prior-year quarter.\n\nAdjusted EBITDA was 7 million for Q3 '22 compared to 2 million Q3 '21. The segment continued a strong performance, and the management team is focused on increasing occupancy across the portfolio. And to our other segments. Q3 '22 net sales and other revenues from all other operating segments was flat compared to the prior-year quarter.\n\nAdjusted EBITDA was 5 million for Q3 '22 compared to 10 million for Q3 '21. This case is priority throughout the year, has been to raise prices to offset historic distribution and raw material cost inflation, which the team has substantially completed. The principal impact for the quarter has been an underperforming plant, which has led to higher cost and scrap rates. The manufacturing team is highly focused on turning this plant around and resolving the inefficiencies.\n\nHome fashion continues to experience high demand for its hospitality products. Retailers broadly are reevaluating and reducing their inventories for home fashion goods and have markedly reduced their purchasing. This has directly impacted results within the segment. During the quarter, bad debt reserve of 4 million was recorded for two significant retail customers.\n\nThe pharma segment continues to experience strong script growth for both of its commercial products. Now, turning to our liquidity. We maintain liquidity as a holding company and each of our operating subsidiaries to take advantage of attractive opportunities. We ended the quarter with cash and cash equivalents, our investment in investment funds, and revolver availability, totaling approximately 7.1 billion.\n\nOur subsidiaries have approximately 761 million of cash and 291 million of undrawn credit facilities to enable them to take advantage of attractive opportunities. In summary, we continue to focus on building asset value and maintaining liquidity to enable us to capitalize on opportunities within and outside our existing operating segments. Thank you. Operator, can you please open the call up for questions?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Daniel Fannon with Jefferies. Please proceed.\n\nDan Fannon -- Jefferies -- Analyst\n\nThanks. Good morning. Just wanted to talk about the auto segment and, you know, just the outlook as you think about both growth and profitability. Obviously, the store closures have been planned.\n\nThose are kind of flowing through. But just, you know, other aspects of the business, other kind of cost-cutting measures, or other things you're doing to kind of think about profitability and the outlook for that business kind of in the intermediate term.\n\nDavid Willetts -- President and Chief Executive Officer\n\nAll right. Good morning, Dan. It's a good question. Let's decompose auto a little bit, and I'll talk about the services segment, you know, principally in responding.\n\nSo, I think there are three things we should touch on. The first is what does the top line look like, and what are the macros look like for the business over the next few quarters, you know, potentially going into recessionary environment. I think the first macro is, generally, recessions are good for the service business as folks delay capital purchases for cars. And that means they're running their existing cars or existing fleets, which have a higher maintenance, you know, component to them.\n\nSo, generally, heading into a down market in the services business is not necessarily bad. That said, the second piece is what does that mean with regards to ticket price? Folks are going to be pretty mindful about only buying what they need to buy. And I think when we take a look at this year, you've had some pretty substantial revenue growth, much of which has been derived through price as we have successfully passed through the cost increases that have come from suppliers and from our labor force, as well as pricing our services to what we think is a market-appropriate return. That's the area where I see some potential pressure.\n\nAnd to your point, the third bucket is, how do we get more efficient? And when I look at services, there are really, you know, two components. Are we as lean as we can be with our SG&A in our back office? The answer is no. We are currently in the process of doing, you know, two things. One is a, you know, just a resizing of the overall headcount levels, as well as cost levels.\n\nThe second is work elimination. Think of this as more continuous improvement, let's eliminate the work, let's streamline things versus just Band-Aid them. So, on the SG&A front that is active, and that is going to be pronounced in, you know, next year's results. And we would expect that to have a pretty substantial discussion point in Q4 and then continuing throughout next year.\n\nOn the variable costs, there is a lot to be done with our partners, from tire manufacturers to parts manufacturers, to work through the supply chain to get not just the right price but the right and the right degree of cash investment that we need to make. That is active. We're actively partnering with those vendors to really reset the relationships in a positive and constructive way for both companies, yourselves, as well as our partners. On the operating costs in the stores, frankly, I think we've been lagging there.\n\nAnd we are actively looking at putting in basic what I would consider to be efficiency programs. You know, how do we streamline? How long it takes us to do a tire change or an oil change? We're actively looking at upgrading store managers and regional managers, you know, with the right skill sets so that they can, you know, really service the customers far better and give them more value as well as more value for us. So, you know, our principal approach there is to coach versus replace. But obviously, there will be a few folks along the way.\n\nThe last thing, which we haven't done a good job of, candidly, is we haven't done much in the way of greenfields. I think there have been -- you can squint out at a few different ways, four to six greenfields over the last few years. That is totally unacceptable. And, you know, we need to target something well north of that to fill in areas and grow with the population growth.\n\nThat is something that we're currently sizing. We have a number of greenfields that we're targeting to open really over the course of this year with an acceleration to next. And we're just sizing exactly where it makes sense to go. So, that may be more than you want wanted, Dan.\n\nBut I think the holistic thesis is, we have to get better on multiple fronts and accelerate, and the CEO replacement and COO replacement and several other management will help effectuate that, getting folks that are appropriate for this next stage of the journey and really drive forward with your speed, haste, and pragmatism. Does that help, Dan?\n\nDan Fannon -- Jefferies -- Analyst\n\nYeah, no, that's helpful, I guess. I mean, obviously that's a multi-step process with lots of initiatives. So, as we think about that, that is kind of mid-next year in terms of implementation and kind of thinking about, you know, flowing through in terms of the numerics in the back half exiting next year. Is that the right way to think of it? Or is it something earlier than that, do you think, is more reasonable?\n\nDavid Willetts -- President and Chief Executive Officer\n\nI think that remains to be seen. We're still working through the exact timing of the plans. What I'd say is there are many actions that are going to be executed in Q4. But those are not limited to Q4.\n\nThere'll be ones in Q1 and Q2. It's -- to your point, it's a multifaceted approach. When that hits the ledger, we'll be a little different. I think we'll have a number of cash items, eyes on cash generative items that can hit relatively quickly.\n\nI think some of the income items will be a little bit of a TBD. I'd like to think it's earlier than second half of next year. But we don't have the timing fully measured out, so I'd hate to commit to something earlier, though. I desire it.\n\nDan Fannon -- Jefferies -- Analyst\n\nUnderstood. My follow-up question is just on the dividends from the various businesses. So, is energy the only dividend that IEP received up this quarter? And I believe you said there was a special in there to. I guess, just kind of thinking about the outlook for kind of dividends from the various investments and how we should think about that also on a perspective basis.\n\nDavid Willetts -- President and Chief Executive Officer\n\nSure. I mean, when we -- and you're talking about the owned companies.\n\nDan Fannon -- Jefferies -- Analyst\n\nCorrect. Yes.\n\nDavid Willetts -- President and Chief Executive Officer\n\nWhen I think of the owned companies, CVI and UAN are phenomenal businesses, you know, given the current crack spreads. We monitor that. And Dave Lamp and the team does a phenomenal job of squeezing as much as they possibly can out of the refineries, as well as the fertilizer plant. So, I feel guardedly optimistic.\n\nCertainly, the forecasts suggest that the EBITDA will continue and, presumably, that will continue with a dividend stream versus, you know, a change. Whether or not there is a special dividend will be monitored on a quarter-to-quarter basis. When you look at the other companies, I mean, the only one of consequence really to talk about at this point would be Pep Boys. And they are not in a cash-generative mode back to us.\n\nGiven the greenfields, that is going to be consuming a fair amount of capital which we need to size. So, I wouldn't pencil them in for any particular dividend. But I'm also not particularly worried about that since there's zero external debt on the company. If we wish to, there could always be a dividend recap at some point in the future.\n\nBut I think that's the short version. You know, WestPoint Home and, in this case, in Vivus, they're all relatively small at this point. And so, even if they did do a dividend, it wouldn't be that meaningful.\n\nDan Fannon -- Jefferies -- Analyst\n\nUnderstood. And then just, I guess, one more lap down, just the investment funds. Understood the short positioning. You're getting a little bit -- growing, I should say, you know, kind of where it sits today.\n\nSo, broadly speaking, I would assume that's a more conservative outlook just in terms of the broader markets. As you think about the fully invested versus cash, Jjust trying to get a sense of where the fund sits today and kind of how you're viewing the current environment for new investments in the fund versus, you know, kind of still maybe being a bit more cautious and waiting?\n\nDavid Willetts -- President and Chief Executive Officer\n\nThat's the debate we have constantly in terms of are we at the maximum degree of uncertainty and at the bottom, or is there more uncertainty? Certainly, with rate hikes, with inflation, you can look at the market in two ways depending on your perspective. So, we're still in the mode of evaluating a number of investments. We anticipate putting capital to work. We have a number of items in the pipeline.\n\nI think, right now, the question is really timing. So, we're optimistic, but the question is the time frame. Certainly, over 2023, we hope that things are solidly more positive in terms of making a very concrete series of investments. But we have several that, you know, will be announced, or you'll have them.\n\nIn terms of the overall short position, I don't think we've gotten more conservative, candidly. I think the shorts have just done relatively well. So, that has expanded the relative percentage of short we have in the portfolio. And earlier in the year, we harvested some of the longs.\n\nSo, you've seen a little rebalancing, but I wouldn't say that's a shift in strategy. It's a combination of opportunity and performance. Is that fair, Ted?\n\nTed Papapostolou -- Chief Financial Officer\n\nYeah. That's right, David.\n\nDavid Willetts -- President and Chief Executive Officer\n\nOK.\n\nDan Fannon -- Jefferies -- Analyst\n\nGreat. Thanks for answering all my questions.\n\nDavid Willetts -- President and Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. And one moment for our next question. And it comes from the line of Bruce Monrad with Northeast Investors. Please proceed.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nHi, guys. Do you hear me OK?\n\nDavid Willetts -- President and Chief Executive Officer\n\nYes. Good morning, Bruce.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nOK, great. Good morning. And thanks for hosting the call. So, a couple of questions, as usual, on this case.\n\nAnd you don't break out the number, so I just want -- I'm a little confused. I see the -- was EBITDA mostly flat there? Have I got that wrong? Or -- that seems to -- or you'd get there with the back-end value. Is that right?\n\nTed Papapostolou -- Chief Financial Officer\n\nYeah.\n\nDavid Willetts -- President and Chief Executive Officer\n\nLook -- yes. Flat to slightly down. But just as a note, when you look at the actual Q, we have summarized this presentation, but the Q still breaks it out. So, when you look at it, you'll be able to see the actual, you know, specifics for just this case.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nOK, great. And so, I was sort of -- you know, I understand we've got FX headwinds, so I'd love for color on that. Or I was expecting a better quarter, frankly. And so, I guess it's a question of, can you be a little more granular, please, on whether FX or pricing? And, you know, leading question, you know -- and I -- and by the way, I thought that the line went up back up in June.\n\nSo -- and, you know, maybe it was comparison with fourth quarter, not third quarter last year. But sort of what -- you know, how are you looking at that? And, you know, would I be wrong in thinking that 4Q is got to be a layup in a comparison? So, can you go there? And I may follow up a little bit, if that's OK.\n\nDavid Willetts -- President and Chief Executive Officer\n\nYeah, of course. I think you're given your investment in this case, you know, we appreciate this dialogue. I think the context for the year has been, we did not do a good job historically. And by historically, I'm talking about 2021 in terms of actually getting price.\n\nThat's been a primary focus. And that, on a year-over-year basis, has been a real driver to stabilize profitability where it needs to be. We had the line problem in Osceola. It was resolved, and then it became unresolved.\n\nThe scrap rates just got too high. We had a number of, you know, training issues on the line. So, that has come unstuck, which is obviously not acceptable. And that has hit us both in terms of lost revenue and profit opportunity from the line, as well as, you know, cost.\n\nSo, there are no excuses for that. The question is, what are we doing about it? And that's where the team is is working through the basics. Given the technical training that is required to operate the line, it's a combination of, you know, rapid training, you know, improved plant management, and, frankly, root-causing many of the generators of waste on the line. Realistically, it's going to take another quarter or two to suss all of that out.\n\nAnd that timing is not -- it's not remotely acceptable, but I think that's a realistic timing. With that said --\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nI'm sorry, can you just tell me that again?\n\nDavid Willetts -- President and Chief Executive Officer\n\nGo ahead.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nI'm sorry to be -- but why -- if the problem was a surprise, why does it take so long? Sorry.\n\nDavid Willetts -- President and Chief Executive Officer\n\nUltimately gets to two things. Right? Scrap rates on the line and, two, experienced operators on the line. Right? We don't have enough experienced operators in the plant to run the line fully and at a low scrap rate. Secondarily, the scrap rates, apart from the operators, have been high.\n\nSo, it didn't make sense economically to run the line. Right? You take that, and that is what we have to fix. And that's what the team is focused on fixing. We have a new CEO.\n\nWe have a head of manufacturing that's new as of two months because we didn't have the right focus in the company on addressing that issue.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nOK. All right. So, and then -- all right. So, 4Q is not a layup is what you're saying?\n\nDavid Willetts -- President and Chief Executive Officer\n\nI think on a comparable basis, I think you'll be pleased. I went through the numbers with the management team. I'm pretty optimistic, and that is offsetting. I think the results won't have a fully restored line in Osceola.\n\nBut I think the results will be favorable on a year-over-year basis, even though that's still a headwind.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nWell, I mean, it just seem -- if I'm allowed to, you know, when you go to your customers, it seems like if you're incurring costs, I mean, you know, whether it's acceptable or unacceptable, this is a cost that your customers should be paying for. Right? You know, so, I would --\n\nDavid Willetts -- President and Chief Executive Officer\n\nAnd I think we've had that dialogue with customers this year. And if I just -- I mean, just to use a few numbers, if I take a look at the total amount of price that we've gotten year over year, it's substantial. On the bridge, by far, it is the largest number that we have because we hadn't historically done that. We hadn't had a mature dialogue or a relationship with the customers to explain we're adding value, but there is a cost to that value.\n\nI think the year-over-year price that we're getting, just in the third quarter year to date alone is something like $37 million. You know, dropping the bottom line. Right? Now, the lost profit opportunity on the line has been a headwind in Q3, you know, and it'll continue to be a drag in Q4. So, I'd say, price has been a major focus, and it has actually delivered the results.\n\nBut we have other operational issues that need to get back and restored. There are, obviously, a number of other price actions that we're taking. It's not a one and done, particularly in Europe as we continue to forward price based on the costs we anticipate versus playing the game of catch-up.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nOK. Well, if I'm allowed to cosmically say, you know, I know it's a small holding for you guys in one sense. But in terms of like percentage, you know, if there's anybody that could benefit -- I mean, EBITDA has been 50 million for forever. And if there's any company -- it's not my job to -- but, you know, with -- you know, this would -- attention and focus and, you know, this is an undervalued opportunity.\n\nDavid Willetts -- President and Chief Executive Officer\n\nWhen I take a look at this company, it should be doing a lot better. There's no question about that.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nOK.\n\nDavid Willetts -- President and Chief Executive Officer\n\nIt needs to have five to six, I mean, minimum percentage points more of EBITDA. You're likely closer to 10, and we weren't going to do it with the old team. You know, and we have a new team that is demonstrating the ability to do this.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nOK. Last question, if I may. New team, the CEO you're talking about, you know, from 12, 24 months ago, not like a week ago or anything like that? Or if I got that wrong --\n\nDavid Willetts -- President and Chief Executive Officer\n\nNo. So, Tim Feast is the new CEO. Tim and I have worked together for years in the past. He's had a number of very successful, what I would consider to be specialty chemical, which ultimately is what this case is, you know, leadership roles, you know, across multiple industries focused on extrusion technologies, customer -- consumer product-facing goods in the plastics and similar markets.\n\nSo, he has been there, what, Ted, for two months?\n\nTed Papapostolou -- Chief Financial Officer\n\nAbout two months. Yeah.\n\nDavid Willetts -- President and Chief Executive Officer\n\nSo, he is he is getting his legs under him very, very quickly. And I'd say the board is extremely pleased with what we've seen just in the first 60 days. But realistically, you know, this is a company that has been asleep for probably 10 years. And it's going to take time, but not much, to upgrade talent and get the right people moving in the right direction with the right metrics.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nWell, we look forward -- you know, I know you put in $100 million at 2.65. And you're carrying it at $2 now, and we carry it at $0.70. You know, we look forward to partnering with you, and we look forward to seeing those results.\n\nDavid Willetts -- President and Chief Executive Officer\n\nYeah.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nThank you.\n\nDavid Willetts -- President and Chief Executive Officer\n\nI think, you know, you and I and the rest of the investors can have a cocktail when Tim and the team deliver, and that's the goal for next year.\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nThank you.\n\nOperator\n\nThank you. I'm showing no further questions in queue. I will turn the call back to David Willetts for final remarks.\n\nDavid Willetts -- President and Chief Executive Officer\n\nAs always, we appreciate our investors and this opportunity to interface with you all and go through the numbers. Hold us accountable, and we'll be as transparent as we can. So, with that said, we look forward to talking to everyone at the end of Q4 and wish everyone a good afternoon and a good weekend. Take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRob Flint -- Director of Accounting\n\nDavid Willetts -- President and Chief Executive Officer\n\nTed Papapostolou -- Chief Financial Officer\n\nDan Fannon -- Jefferies -- Analyst\n\nBruce Monrad -- Northeast Investors Trust -- Analyst\n\nMore IEP analysis\n\nAll earnings call transcripts"
}