{
  "companyName": "Nordstrom",
  "companyTicker": "JWN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/22/nordstrom-jwn-q3-2022-earnings-call-transcript/",
  "content": "Nordstrom (JWN 0.31%)\nQ3 2022 Earnings Call\nNov 22, 2022, 4:45 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Nordstrom third quarter 2022 earnings conference call. At this time, all participants are in a listen-only mode. We will begin with prepared remarks, followed by a question-and-answer session. [Operator instructions] As a reminder, this conference is being recorded.\n\nAt this time, I'd like to turn the call over to Heather Hollander, head of investor relations for Nordstrom. You may now begin.\n\nHeather Hollander -- Head of Investor Relations\n\nGood afternoon, and thank you for joining us. Before we begin, I want to mention that we'll be referring to slides, which can be viewed in the Investor Relations section on nordstrom.com. Our discussion may include forward-looking statements, so please refer to the slide with our safe harbor language. Participating in today's call are Erik Nordstrom, chief executive officer; Pete Nordstrom, president and chief brand officer; Anne Bramman, chief financial officer; and Michael Maher, chief accounting officer, who will provide a business update and discuss the company's third-quarter performance.\n\nAnd now, I'll turn the call over to Erik.\n\nErik Nordstrom -- Chief Executive Officer\n\nThank you, Heather, and good afternoon, everyone. Thank you for joining us today. For the third quarter, we delivered results in line with our expectations with quarterly net sales of $3.4 billion, a loss per share of $0.13, and adjusted earnings per share of $0.20. As we discussed, while reporting our second-quarter results, we saw customer demand begin to soften in late June, mostly in Nordstrom Rack.\n\nAcross both banners, the softening trend was more significant in customer segments with the lowest income profiles, while we saw greater resilience in the higher income cohorts. As customer trends shifted, we took action to manage through the short-term macroeconomic uncertainty and position our business for success. This included managing expenses to align with sales expectations and clearing through excess inventory to exit the year with healthy inventory levels and mix. These actions prepared us well for the third quarter as macroeconomic pressures impacted all customer segments, with outsized impact in the lowest income groups.\n\nAdditionally, sales decelerated in late October and early November, particularly in geographies with unseasonably warm weather. In the last two weeks, however, sales trends have improved. Our teams have executed well in a challenging environment this quarter and continued to advance our closer-to-use strategy. Given ongoing inflationary pressures in supply chain and fulfillment, we are particularly pleased that we decreased our variable supply chain cost this quarter.\n\nOur supply chain optimization work streams drove efficiency and lowered the per-unit cost of moving product through our system, while also delivering an improved customer experience and faster order fulfillment. We're also on track with our plans to clear through excess inventory and optimize our product mix. Net sales decreased 3% versus last year, which includes a negative impact of approximately 200 basis points from one week of the Anniversary Sale's shifting into the second quarter. Nordstrom banner sales and gross merchandise value, or GMV, each decreased 3% versus last year.\n\nThe timing shift of the Anniversary Sale had a negative impact on Nordstrom banner net sales of approximately 300 basis points. In the third quarter, customers continued to refresh their wardrobes and shop for occasions such as social events, travel, work, and holidays, which drove demand for our core categories and services. Consistent with the second quarter, items with lower AURs underperformed higher AUR items. Customers continue to respond very positively to newness and fashion in our seasonal assortment.\n\nTurning now to our strategic initiatives. Our team remains focused on improving Rack performance, increasing profitability, and optimizing our supply chain and inventory flow. We're making progress in these initiatives, and we expect them to benefit our top-line and bottom-line performance in the fourth quarter of this year, in 2023, and beyond. While we take actions to address a shifting consumer backdrop, we are also building capabilities to better serve customers and deliver increased profitability, as we focus on improving Nordstrom Rack performance, winning in our most important markets, and leveraging our digital capabilities.\n\nStarting with Nordstrom Rack. Sales declined 2% versus last year as we continued to see softening demand, especially within our lower-income customer groups. We remain focused on delivering profitable growth while improving the customer experience. To that end, this quarter, we made the decision to reduce Rack store-based order fulfillment and raised the minimum order amount to receive free ship-to-store delivery on rack.com.\n\nThese actions reduced our order cancellations, simplified rack operations, and improved profitability but negatively impacted top-line growth at the Rack by approximately 200 basis points. We continue to focus on increasing our supply of premium brands at Rack, improving our assortment, and growing brand awareness to fuel future growth. Premium brands are a differentiator for the Rack, and we are dedicated to having great brands at great prices at each of our locations. The linkage to the Nordstrom banner gives Nordstrom Rack unique access to premium brands that are not broadly available in the off-price space.\n\nFor example, 90% of the top brands at Nordstrom are sold at Nordstrom Rack. This quarter, sales of our top 100 brands at the Rack increased 9%, which underscores the growth opportunity from increasing our supply of premium brands. We are also continuing to shift away from the lower price point items that have not resonated with Rack customers. We expect to clear through this inventory by the end of the fiscal year, which opens more space and buying capacity for premium brands.\n\nWith the work underway, we expect to optimize Rack product mix by mid-2023. We believe that improving our assortment and increasing penetration of top brands will differentiate the Rack experience for customers and drive profitable sales growth. Next, our market capabilities help us engage with customers by delivering convenience, connection, and greater access to product, no matter how they choose to shop. Customers clearly value our interconnected model with a strong store fleet, two unique banners, and omnichannel capabilities linked at the market level.\n\nOrder pickup represented 12% of nordstrom.com demand this quarter, an increase of 200 basis points versus last year. We are also leveraging our digital capabilities to extend our unmatched one-to-one store experience to a digital world. Our goal is to personalize the digital experience with discovery supported by a broad product assortment, convenience powered by our market strategy, and connection via our people and experiences. We are evolving digital discovery and driving higher engagement with enhanced content, a refreshed shopping experience that includes redesigned product pages, and smarter product search capabilities.\n\nWe are also improving the digital purchase journey with better imagery and product descriptions to help customers make more informed purchase decisions and minimize returns. Total digital sales declined 16% this quarter, which includes a negative impact of approximately 300 basis points from the Anniversary Sale shift. Additionally, reducing store-based fulfillment for rack.com orders and sunsetting Trunk Club negatively impacted digital sales by approximately 700 basis points, with the change to rack.com store fulfillment accounting for the majority of the impact. Our digital sales were also affected by channel shift as customers return to pre-pandemic shopping behavior and increasingly chose to shop in-store this quarter.\n\nDigital sales represented 34% of total sales during the quarter. Before I turn it over to Pete, we'd like to thank our employees, customers, and partners for helping kids start off the school year on the right foot. For the 12th year, we partnered with Nike and shoes that fit to donate more than 40,000 pairs of brand-new shoes to kids in need for back-to-school. This program leverages our heritage and shoes and engages our teams and customers to make a difference in their communities.\n\nWe're very proud of the incredible support our team and customers put behind this important cause. In closing, though there is continued macro uncertainty, we are pleased with the actions we've taken to prepare for this environment and the progress we've made in improving our agility. The capabilities we built with our closer-to-use strategy, digital assets, and supply chain optimization prepare us to manage short-term pressures. With our strong balance sheet and cash position, we also have the flexibility to respond to shifting demand.\n\nWe are navigating short-term headwinds while also continuing to build capabilities to better serve our customers, drive profitable growth, and increase shareholder value. We are focused on remaining nimble to navigate this environment and look forward to realizing additional benefits in the fourth quarter and into 2023. I'll now turn the call over to Pete.\n\nPete Nordstrom -- President and Chief Brand Officer\n\nThanks, Erik. I'll begin by talking about our category performance, then I'll discuss the actions we're taking to ensure healthy inventory levels and mix going into next year. Finally, I'll update you on the progress we are making to improve supply chain and inventory flow and increase gross margin. Starting with the category performance.\n\nMen's and women's apparel, shoes, and designer had the strongest growth in the quarter versus last year. Customers continue to shop for occasions and return to the office and update their closets. We continue to see softness versus last year in categories previously accelerated by the pandemic, including home and active. Turning now to inventory.\n\nAs you know, we have been taking aggressive action to align inventory with softening demand and category shifts. We have been focusing on improving our assortment by clearing through product that customers weren't responding to and showcasing the fashion, newness, and categories they want. While this clearance activity pressures margins in the near term, the impact is in line with our expectations and consistent with the outlook we shared with you last quarter. Importantly, we expect to have healthy and current inventory by the end of the year.\n\nsetting us up for longer-term growth and profitability. In addition to healthy inventory levels, we are also focused on having the right composition of inventory. We are maintaining a strong inflow of exciting brands to deliver the newness customers expect from us. We continue to partner with new limited distribution brands to grow their businesses and offer our customers increased selection.\n\nFor example, our partnerships with On Running, SKIMS, and Fear of God illustrate our strategy and effectiveness in amplifying exciting new brands. These partnerships only began a few years ago, and now they're among Nordstrom's top five fastest-growing brands and ranked in our top brands overall. We also continue to focus on improving our supply chain and inventory flow. Last year, in response to our growing digital business and increasing inflationary cost pressure, we launched a series of work streams to drive efficiency and reduce supply chain costs while also elevating the customer experience.\n\nImproved inventory flow is a key component of this work and an integral part of our Closer to You strategy. By optimizing our supply chain, we are able to provide our customers with greater selection and faster delivery speeds. We're reducing the number of product touchpoints through our network, which decreases our cost and gets the product in a sellable position faster, which improves our regular price sell-through. As part of our supply chain optimization efforts, we are also continuing to increase productivity in our distribution and fulfillment centers and improving the consistency of unit flow through our network.\n\nWe are very pleased with the early results we're seeing from this work. While we evaluate many supply chain metrics, for our customer, we believe the most important metric is click-to-deliver speed. This quarter, we improved click-to-deliver speed by 15%. As we improved unit flow through our network, we increased fulfillment center flow through by 28% versus last year and reduced our variable handling cost per unit by 3%.\n\nIn fact, despite inflationary pressures this quarter, we decreased our variable supply chain cost as a percent of sales by approximately 100 basis points compared to last year. As we advance our supply chain capabilities, we are also aligning our network accordingly. To that end, we closed a smaller omnichannel fulfillment center in Los Angeles that is no longer needed and retired the third-party technology tested in that center, as we have scaled our West Coast Omnichannel Center to support the demand in that region. In addition to supply chain optimization, we continue to focus on expanding our merchandise margins over the long term.\n\nOne of the most important levers in improving merchandise margin is faster inventory turns. We are committed to delivering a double-digit percentage increase in inventory turns in 2023. In addition to faster inventory turns, we are also working to improve merchandise margins by leveraging advanced analytics to identify customer needs, improve our assortment, increase promotional effectiveness, and optimize markdowns. We saw the benefits of this work in the first half of the year and expect to deliver additional merchandise margin improvements once we are past the clearance markdown pressure this year.\n\nTurning now to holiday, our customers are excited for the season, and we are well-positioned with a fresh, relevant assortment to help them get ready for their celebrations. We've used our learnings from past holiday events to improve our offering with the goal of being the go-to destination for gifting and preparing for the moments that matter to our customers. In closing, we are taking actions to clear through excess inventory, improve our mix and assortment, increase our agility, and enter 2023 in a healthy inventory position. We're confident in our ability to build on our progress in driving supply chain efficiencies and the additional benefits we expect in the fourth quarter and in 2023.\n\nNow, I'll turn it back to Erik.\n\nErik Nordstrom -- Chief Executive Officer\n\nAs we announced last month, Anne Bramman will be stepping down from her role as CFO on December 2nd. We'd like to take a moment to recognize Anne for her dedication to our customers, our employees, our shareholders, and our values. Anne made significant contributions to our business over the last five years, including helping to successfully guide the company through the pandemic, sponsoring multiple strategic initiatives to improve profitability, and elevating the finance organization. So, Anne, we thank you for your partnership and leadership.\n\nWe wish you all the best in your next step.\n\nAnne Bramman -- Chief Financial Officer\n\nThank you, Erik. It's been a privilege to work alongside you, our executive leadership team, our board of directors, and all of the incredible people who make Nordstrom such a special place. It has been an honor to be a part of this company. I'll now review our third-quarter results and then turn it over to Michael Maher, who will serve as our interim CFO beginning December 5th, to address our outlook for the remainder of the year.\n\nFor the third quarter, we reported a loss per share of $0.13. After excluding charges related to a supply chain technology and related asset impairment, adjusted earnings per share was $0.20. Overall, net sales decreased 3%, in line with our expectations. This includes a negative impact of approximately 200 basis points due to one week of the Anniversary Sale shifting into the second quarter.\n\nGMV decreased 2%. Nordstrom banner sales and GMV each decreased 3% versus last year. Anniversary Sale timing negatively impacted the Nordstrom banner by approximately 300 basis points. Nordstrom Rack sales decreased 2% in the third quarter.\n\nDigital sales decreased 16% this quarter. Digital sales include a 1,000-basis-point impact from Anniversary Sale timing shift, reducing Rack store fulfill, and sunsetting Trunk Club. Gross profit as a percentage of net sales decreased 190 basis points primarily due to higher markdown rates on clearance products. Consistent with our expectations from the end of the second quarter, we realized approximately $100 million of incremental markdowns during the third quarter.\n\nAs Erik and Pete described, we have taken actions to right-size our inventory and as such, ending inventory increased 1% this quarter versus a 3% decrease in sales. As a result of reduced supply chain backlogs, we had a higher percentage of our inventory on hand this year versus in transit last year. We continue to expect that we will end the year in a healthy inventory position and are committed to a disciplined approach to inventory management in 2023. Total SG&A as a percentage of net sales increased 200 basis points due to a supply chain technology and related asset impairment charge, partially offset by leverage driven by fulfillment expense efficiencies.\n\nExcluding the impact of the impairment, total SG&A as a percentage of net sales remained flat with the prior year. Since last year, we've been making progress on our supply chain optimization initiatives to offset anticipated labor and fulfillment cost pressure, and we're pleased with the results we're seeing. We continue to expect that these initiatives will deliver more significant benefits in the fourth quarter and in 2023. EBIT margin was 0.1% of sales for the third quarter.\n\nAfter excluding charges related to the impairment, adjusted EBIT margin was 2.1%. We maintained a solid financial position, ending the third quarter with $993 million in available liquidity, including $293 million in cash. Subsequent to quarter-end, we paid off the $100 million we had borrowed on our revolving line of credit and once again have the entire balance available to us. Finally, we are pleased to announce the extension of our credit card program agreement with TD Bank as the exclusive issuer of our proprietary Nordstrom branded credit card.\n\nTD has been a strong partner and we look forward to working with them to further enhance the card member experience. I'll now hand it over to Michael to talk through our outlook for the remainder of fiscal 2022.\n\nMichael Maher -- Chief Accounting Officer\n\nThanks, Anne. And before I discuss our outlook, I just want to briefly add a word of appreciation on behalf of the finance team here at Nordstrom. We've the past few years. Thank you for everything and all the best in your next chapter.\n\nNow, I'll describe the macroeconomic backdrop contemplated in our guidance for the balance of the year. As Erik indicated, macroeconomic pressures impacted demand across all customer segments in the third quarter, with the most significant impact in the lowest-income groups. However, customers continue to refresh their wardrobes, shop for occasions, and respond to fashion and newness in our assortment. With regard to recent trends, sales softened in late October and early November but improved in the last two weeks.\n\nWe believe that unseasonably warm temperatures in certain geographies contributed to the decelerating trends, along with delayed holiday shopping. As weather normalized and we get closer to the holidays, we've seen sales trends improve and gifting activity accelerate. As for holiday shopping expectations, we believe that this year's calendar, which has an extra Saturday between Thanksgiving and Christmas, will lead some customers to wait until closer to Christmas to make their purchases. We continue to expect an elevated promotional environment across retail in the fourth quarter.\n\nTaking these factors into consideration, we are reaffirming our 2022 financial outlook. For fiscal year 2022, we continue to expect revenue growth of 5% to 7% versus 2021. We expect adjusted EBIT margin of approximately 4.3% to 4.7% for the full year. Our forecast assumes that EBIT margin improvement for the year will be driven by SG&A leverage, with gross profit roughly flat for the full year.\n\nOur effective tax rate is expected to be approximately 27% for the fiscal year. We expect adjusted EPS of $2.30 to $2.60. Our outlook excludes the impact of any future share repurchases. We continue to expect approximately $100 million of incremental markdown impacts from clearance activity in the fourth quarter.\n\nThough we are facing inflationary expense pressures, we contemplated that pressure in our outlook, along with the increasing benefits of our supply chain optimization initiatives. With regard to the assumptions embedded in our guidance range, the low end of our guidance assumes that the softer sales trends from late October and early November return, and promotional activity in the sector increases above what we've seen to date. The high end of our guidance assumes that holiday sales will accelerate year over year as we approach Christmas, in line with pre-pandemic shopping behavior, and that promotional levels in the sector are consistent with what we've seen to date. Shifting to capital allocation, our priorities remain unchanged.\n\nOur first priority is investing in the business to better serve our customers and support long-term growth. We're planning capital expenditures at normalized levels of 3% to 4% of net sales as we continue to invest in supply chain and technology capabilities. Our second priority is reducing our leverage. We remain committed to an investment-grade credit rating and expect to decrease our leverage ratio below 2.9 times by the end of 2022.\n\nWe continue to target a leverage ratio below 2.5 times. Our third priority is returning cash to shareholders. Last week, our board of directors declared a quarterly cash dividend of $0.19 per share. Year to date, we also repurchased approximately $53 million of our stock at an average price of $23 per share.\n\nWe have approximately $447 million remaining on our share repurchase authorization. We will continue to take a measured approach to share repurchases through the remainder of this year, aligning with our cash flow and market conditions. In closing, we've been taking the necessary steps to prepare for a softening macroeconomic backdrop and are confident that we have the financial strength and strategic capabilities to manage through a rapidly evolving environment. We have a strong balance sheet and a favorable debt maturity schedule.\n\nWe're reducing our inventory levels to enter 2023 in a healthy and current position and improve our flexibility and agility. Despite markdown and inflationary pressures, we still expect to deliver SG&A benefits from our supply chain optimization work and disciplined expense management and significantly increase our year-over-year profitability in the fourth quarter. With that, Heather, we're ready for questions.\n\nHeather Hollander -- Head of Investor Relations\n\nThank you, Michael. Before we get started with Q&A, we ask that participants limit their responses to one question and one follow-up. We'll now move to the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] Thank you. Our first question is from Ashley Helgans with Jefferies. Please proceed with your question.\n\nUnknown speaker\n\nHi. It's Blake on for Ashley. Thanks for taking our question. Just wanted to ask on the sales guide.\n\nA couple of headwinds, I guess, you called out you're seeing from the Rack decisions about store-based fulfillment in the shipping minimum. You also talked about weakness in the lower AUR interest a general macro. What are the positive offsets you're seeing on the top line to help you maintain the guide here? Thank you.\n\nMichael Maher -- Chief Accounting Officer\n\nYeah. Blake, this is Michael. I'll take that. So, that's right.\n\nThose headwinds that you talked about are contemplated in the guide. They're pretty consistent with what we saw in the third quarter, though. So, the assumption is that the choices we've made around Rack store fulfillment are consistent impacts to our business in the fourth quarter relative to what we've seen in the third. So, generally speaking, I'd just bring it up a level.\n\nAs we think about going forward, I think you can expect to see something similar in the fourth quarter in terms of the banner breakout, as well as the channels. We continue to expect that customers are voting for shopping in stores and that we'll see some mix shift to that.\n\nOperator\n\nNext is Matthew Boss with JPMorgan. Please proceed with your question.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks. So, a couple of questions. First, how are you planning full-line inventory by category as we think about anniversary-ing some of the shift toward occasion and dress-up apparel next year? And then at Rack, could you just speak to the timeline you think is reasonable to return the Rack to positive sales growth and some of the initiatives behind that?\n\nPete Nordstrom -- President and Chief Brand Officer\n\nHi, Matt. Yeah. This is Pete. I'll start with the category inventory.\n\nAs we mentioned in our comments, we feel really good about the content of what we have available here for the fourth quarter and coming into holiday. And that's because things have stabilized a little bit in terms of what customer demand is, we talked about categories that were really over-indexing in the early days of the pandemic, and we were part of that as well with home and active in categories like that doing very well. But in the last, gosh, probably eight, nine months or so, in particular, the return to occasions and people just moving around more and just being out there, it's lent itself well to what we've traditionally always done pretty well at, and we can talk about that in terms of the moments that matter. And so, we've done well in apparel and shoes in the categories that really reflect people just out and about engaged more activities and events.\n\nAnd so, I think that that's really where we've focused our inventories going forward. And I think the only other thing about that is just coming at this time of year is the best you can to try to figure out whether and what cold weather and the impact that has, and we feel really good about our assortment in cold weather, too.\n\nErik Nordstrom -- Chief Executive Officer\n\nOK. Hi. Hey Matthew, this is Erik. For the Rack, a couple of things we'd emphasize, and we do continue to see traction in our strategies.\n\nIt's a third quarter in a row of sequential improvement versus pre-pandemic and, really, since we've focused on our North Star of great brands at great prices. And as we called out, we had some actions, most notably, stopping store fulfill for rack.com orders that hit our top line but made it a more profitable business and a better customer experience. So, overall, our business is about flat if you back that out. And we continue to see traction from these best brands.\n\nLast quarter, our top 100 brands in Rack grew 9%. We continue to see growth there. As for the timing, there's two things that are juries we have to address to get at the timing. One is certainly getting access and ordering a greater percentage of our inventory in these great brands.\n\nAnd that is happening. The second piece, as we talked about coming out of last quarter is, clearing through the less productive inventory we have. And as I'm sure you know, Rack is part of our total ecosystem. And we've -- coming out of Q2, as we revised our guidance, we saw that it would take through Half 2 to clear out and open up the inventory dollars to get us in the balance that we want going forward.\n\nSo, for Rack, we need to certainly get more of these great brands in, but we also have to, through the rest of Q4, clear out the inventory that hasn't been as productive, and that sets us up well for 2023 to have continued improvement.\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nBest of luck in holiday.\n\nErik Nordstrom -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nNext is Chuck Grom with Gordon Haskett. Please proceed with your question.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey. Just to follow up on Matt's question a little bit. Just on the Rack, if you look at it on a three-year basis, it really decelerated, and all of your off-price peers have reported over the past week or so and really haven't shown that level of softness. So, I was just wondering, if you could, maybe, just go a layer deeper to the factors of the underperformance.\n\nAnd then as we look to 2023, how are you planning the entire enterprise business from a category perspective? Are you expecting some of the recent areas of strength to continue, or are you expecting a shift back to some of the pandemic areas to resume their strength?\n\nAnne Bramman -- Chief Financial Officer\n\nSo, Eric, do you want to talk a little bit about the Rack?\n\nErik Nordstrom -- Chief Executive Officer\n\nSure. Yeah. OK. I'll take a start with that, Chuck.\n\nYes. Not sure I have a lot more to add there. It's -- as we talked about coming out of Q2, we did see a pullback in our customer cohorts or lower income segments for us, and that is most pronounced in our Rack business. And we certainly see signs of customers being restrained from economic conditions.\n\nAnd we've seen evidence of some pullback across all customer cohorts, but most pronounced at lower customer -- lower-income customer cohorts. And, again, that hits us more in the Rack business. And then -- so there's some macro issues, but internally, again, I'd pull you back to getting our mix right. We're very confident in that of how why customers respond strongly to the Rack, why they choose us, and getting that mix right.\n\nAgain, we have some cleanup to do still here in Q4, but we see that entering 2023 in a real healthy and clean inventory position to where we'll get the mix that we want.\n\nAnne Bramman -- Chief Financial Officer\n\nSo, Chuck, this is Anne. I would add a couple of things to that. Just to remind you, when we talk about the change in rack.com store fulfill program for the last quarter, that was worth about 200 basis points top-line impact to the Rack banner itself. So, when you adjust for that, it's actually a pretty -- it's a flat business overall for the quarter.\n\nHaving said that, just to remind you, if you look at the history of the Rack, we typically have not had a big category in home and certainly not a lot in athletic apparel, which was certainly high COVID pandemic categories. As we've come through, we've also reshifted the focus on the best brands at the best prices. And that has also been a piece of getting out of some of the older inventory that's a lower price inventory and moving into the categories and the brands that people really seem to respond to, and we're seeing -- the result of that was positive increases in those areas, and we'll continue to drive that, both balancing getting out of the current inventory that's not working, but also really leaning heavy into next year as far as these better brands.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nGot it. Thank you very much.\n\nAnne Bramman -- Chief Financial Officer\n\nYeah. On the '23 question, I think the thing I would add to that is we -- as Pete talked about, we're really focusing on the categories they're responding with the customers. I think for us, we're also focusing on being pretty conservative agile as well. So, it's giving us the capability to chase more than what we've seen in the last couple of years coming out of the pandemic.\n\nCertainly, supply chain has gotten much better. Access to goods has gotten much better. And so, this is giving us the ability to be more being able to chase where the customer is going as well. So, we're trying to keep powder dry as we go into 2023, but also really focusing on seeing early trends and responding to the customer.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nGreat. Thanks, Anne.\n\nAnne Bramman -- Chief Financial Officer\n\nYep.\n\nOperator\n\nNext is Oliver Chen with Cowen.\n\nUnknown speaker\n\nHi there. This is Katie on for Oliver. Thanks for taking our question. First was on the variable costs.\n\nAre those permanent improvements, or is that just sort of more flexing with the sales performance? And then our second question is more on the excess inventory. How much is left to sort of clear through in Q4? Thank you.\n\nAnne Bramman -- Chief Financial Officer\n\nYes. So, I'll take the variable cost piece, and then, Mike and Pete, if you want to take the inventory component, that would be great. So, on the variable costs, those are actually permanent. As we talked about the last couple of quarters, coming out as I would even rewind a little bit at the end of last year, we saw inflationary costs and headwinds.\n\nWe determined that we thought those were going to be pretty permanent out there. So, we started taking into doing initiatives around really driving improvement. And we talked about in the last couple of quarters that we thought we were going to get leverage in our overhead in the first half based on top line, just your fixed overhead getting leverage on the sales side. On the second half, we -- as we've indicated, we really -- we're continuing to get momentum in our supply chain cost per unit initiatives and efficiencies.\n\nAnd so, for that, you saw that coming through in Q3, and that's continuing to build in Q4 and beyond.\n\nMichael Maher -- Chief Accounting Officer\n\nHey, Katie, with respect to the inventories, we said at the end of last quarter that we expected to take approximately $200 million of incremental markdowns in the back half of the year, roughly evenly split between the third and fourth quarters, and we're on track for that. So, we still expect to exit the year in a healthy and current inventory position.\n\nUnknown speaker\n\nThank you so much. Have a great holiday.\n\nOperator\n\nNext is Kimberly Greenberger with Morgan Stanley.\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much. Good evening. I wanted to ask about -- just some of the puts and takes in your operating margin as we head into next year, it would seem that the inventory cleanup and potentially lower markdown rate in 2023 could be a tailwind for gross margin.\n\nAre there any headwinds that might be noteworthy? And then -- and specific to your comments on SG&A, I would assume that SG&A dollars are likely to grow next year. There's still ongoing inflation out there, and I would imagine that you're experiencing some of the same. But do you have any -- do you or Michael have any sort of preliminary thoughts on how we should think about the growth in SG&A in 2023 compared to this year? Thanks.\n\nAnne Bramman -- Chief Financial Officer\n\nYes. Thanks, Kimberly. Erik is going to give some broader context, and then Michael can give specifics for the question.\n\nErik Nordstrom -- Chief Executive Officer\n\nYeah. Thanks for the question, Kimberly. Let me start with -- there's certainly a lot of uncertainty out there. Macroeconomic conditions and customer behavior is moving rapidly, and we feel really well prepared for that uncertainty.\n\nAnd I take you back to our last quarter call, we started to see a little softness in the end of June. And we made the call pretty early in hindsight to take what we thought were the prudent steps and in particular, reducing inventory managing our expenses and overall improving our agility to navigate these uncertain times. And those actions have served us well. We really feel good about our execution through Q3 of that plan.\n\nWe exceeded our plan last quarter. And probably more importantly, it sets us up well for the uncertainty going forward. We're not just starting right now of looking at kind of the volatile economic times out there and making adjustments. These adjustments were put in place at the end of last quarter and, again, have served us well through Q3 and have prepared as well going forward.\n\nMichael Maher -- Chief Accounting Officer\n\nYeah. So, Kimberly, more specifically then about 2023 is we're not giving 2023 guidance today. But given the uncertainty that Erik just talked about in the macro environment, we're really focused on preserving and protecting that agility and that flexibility as we go forward into the fourth quarter and into next year. So, that means managing inventory more conservatively to not only increase agility, but also improved gross margin.\n\nWe'd rather be chasing the business in clearing. You heard Pete talk earlier about a double-digit improvement target for our 2023 inventory turn. It also means disciplined expense management and continuing to hold the line on that. And then just continuing to build on the strategic initiatives that we've talked about with a special focus on supply chain, given the size of our digital business that that helps us, that improves our capability to serve our customers, but it also helps mitigate some of that inflationary cost pressure that you alluded to and improve our profitability.\n\nSo, not ready to give specific guidance yet, but those are sort of the guiding principles as we think about planning for next year.\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nNext is Ed Yruma with Piper Sandler.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nHey, guys, thanks for taking our questions, and best of luck in your next step. I guess, first, a bigger-picture question. Gosh, it might have been a couple of Analyst Days ago, but you once said that online and stores had roughly equivalent contribution margin. Just given the new dynamic growth outpacing in the store fleet versus e-com, can you refresh us on that and how we should view contribution margin now that you're tipping back to stores? And then as a follow-up, the traffic trends seem to have lagged historically or recent history at the urban stores ex-New York, give us a quick update as to performance of urban versus suburban? Thank you.\n\nErik Nordstrom -- Chief Executive Officer\n\nYeah. Let me start and then anyone else can jump in there. You know, the contribution margin between online and stores, for the Nordstrom banner, they remain pretty darn close. And I guess I've called out to variable, just to shed a little more light on it.\n\nCertainly, there's been increase expenses in supply chain, particularly transportation that hits the digital business a little more. But offsetting that is our digital business has been leveraging really well. As we grow sales there, there's a big fixed-cost base there that gives us a lot of leverage as we add sales. So, overall, we're really pleased with our online profitability in nordstrom.com.\n\nThe Nordstrom stores that model has a lot of variable expense to us, which allows us to manage it well as sales trend up or down. The other thing I'd call out is we're not at parity at rack.com and Rack stores. And in particular, I'd go back to our decisions last quarter to stop doing store fulfillment and Rack stores for rack.com. And there are really two reasons that -- and these are two things that we at Nordstrom, we ask ourselves all the time.\n\nOne, how do we provide a great customer experience; and two, how do we get profitable growth and store fulfillment at our Rack stores was not providing the level of customer experience that we hold ourselves to, we had higher cancellation rates there because it's a little more difficult finding the product in a treasure hunt environment in the stores. But secondly, kind of to your contribution margin point, the economics get tougher with the lower price points we have in the Rack versus our Nordstrom banner. So, didn't meet our standards of profitable growth. So, I use that as an example of -- there are levers that we are actively pulling to address contribution margin in our off-price digital business.\n\nDo you want me to take urban, or do you want to comment? OK. As far as urban and suburban, there's not -- that's leveled out a bit. We still -- our urban stores got hit harder during the pandemic. So, they are growing faster in general versus our nonurban stores.\n\nAnd New York, as we've called out all year, it continues to be one of our very top stores in sales growth over last year.\n\nEd Yruma -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nNext is Noah Zatzkin with KeyBanc.\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nHi. Thanks for taking my question. Just on the Rack, on the opportunity at the rack to accelerate improvement in brand mix, given excess inventory in the channel, could you just provide an update on what you're kind of seeing in the channel there? And any progress on that opportunity? And then second, just on the decision to reduce store base futile at the Rack. Is that a permanent change, or would you expect to revert back to the prior minimum for free ship to or at some point in the future? Thank you.\n\nAnne Bramman -- Chief Financial Officer\n\nYeah. So, Pete, do you want to take the -- what you're seeing in the market? And then do you want to finish, Erik, on the second question on that?\n\nPete Nordstrom -- President and Chief Brand Officer\n\nYeah. I think as everyone has noticed, in the last few months, pretty much everyone in retailing is over inventory at some level. And as a result of that, that plays right into our hands. I think, in terms of being able to be selective about pursuing great brands, the great prices and hear us talk about premium brands.\n\nAnd these are really the brands that you would typically find in a Nordstrom store that are not ubiquitously distributed among typical off-price retailers. We've got great relationships with all these brands. And what we try to do is to be first call for them when they have inventory to clear. And like I said, this there's inventory out there to be had.\n\nAnd I think it puts us in a great position of being able to be selective. So, we feel very good about what would be possible for us in '23.\n\nErik Nordstrom -- Chief Executive Officer\n\nYes, and take the store fulfillment and Rack. Certainly, we would revisit that. Just to be clear, there was two actions we took last quarter. One was doing store fulfill of rack.com orders.\n\nThe other was having free -- the threshold for free shipping to a Rack store of rack.com order. The store fulfillment is the bigger impact of those two. But that threshold is something we've consistently look at. And yes, again, we look at the business model there and we look at the customer experience.\n\nSo, we have a lot of initiatives underway to continue to improve the inventory accuracy that we have that helps with the customer experience side by reducing our cancellations. So, we do think that will get better going forward. And then the costs for the supply chain cost of moving that product around. There's obviously a lot of external factors there, but there's plenty of internal levers for us to pull.\n\nAnd last quarter is a good example. I feel really good about our supply chain performance this last quarter and the traction we're getting on some initiatives. So, a long way of answering your question that, yes, we would revisit that as conditions change.\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nAnne Bramman -- Chief Financial Officer\n\nNow, we'll take one more question.\n\nOperator\n\nOur last question comes from Dana Telsey with Telsey Advisory Group.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. Good afternoon, everyone. As you've seen the season unfold and the difference between the lower-income and the higher-income customer cohort, how are you positioning the brands at the core, at the full-line Nordstrom stores between the higher end and the lower end, and the positioning for Rack? And as we see this going through into 2023, is there a cadence of what the assortment should look like at Rack that you've identified given the more premium brands that works well there, of how you're transitioning the full-line stores to in order to better balance the lower income versus the higher income consumer given that, typically, we think of Nordstrom as a little bit more higher-end than lower-income with the headwinds that are rising today? Thank you.\n\nPete Nordstrom -- President and Chief Brand Officer\n\nHi, Dana. It's Pete. It's interesting you would intuitively think that when customer demographics are showing different spending patterns related to what's happening out there, inflation, that you would see us over-indexing and selling a lot more lower-priced goods. And that's not necessarily true.\n\nI mean, the broken record for us, almost regardless of what macro times are going through, is newness and flow and great brands and just giving people compelling reasons to buy new things, that's what really works for us. And it works in the Rack banner, and it works in the Nordstrom banner as well. So, the fact that we called out that we're still having good growth in designer, I think, is evidence of the fact that it's not so much about a specific price point or offer. We pay close attention to what's going on with our customers and close attention to what's going on out there in the macro environment.\n\nBut I think getting our inventory levels in a position where we can have that kind of consistent flow and the large majority of what we have to offer is new. That's the most important thing for us. And I think in terms of what's happening in the Rack, again, it's really about those great brands. It's not about us just out pursuing the cheapest goods.\n\nIt's great brands at great prices. And that formula has worked for us in the past, at all times, really, again, regardless of what's happening in the macro environment. And we anticipate that will continue to work for us again. So, we feel good about it.\n\nWe've got access to the greatest brands in the world. We're going to continue to bring them in. We do have a difference. We have -- even having the two banners, we've got that full-price proposition, and then we've got that bargain hunter proposition as well.\n\nAnd so, we feel like it's a big net where we can serve a lot of customers.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nAnd what is -- how are you thinking about store openings for Rack going forward?\n\nErik Nordstrom -- Chief Executive Officer\n\nHi, Dana. It's Erik. We started now, I think, some more Rack openings. As we've mentioned before, we think there's opportunity for new stores in the Rack banner.\n\nOur Rack stores are profitable, and the IRR opportunities are really compelling. And I meant, for the off-price space, convenience store locations is even more important than in the Nordstrom banner space. We know you get outside of about a 20-minute drive to Rack store, we start to lose customers. And you've seen a lot of the leading off-price players had a lot of store count over the last handful of years and has helped drive their growth.\n\nAnd one of the things we know is when we share a location, we share a parking lot with other off-price competitors in the vast, vast majority of cases, we have the highest sales per square foot. So, when we share a parking lot, more often than not, customers choose us. So, given our store count compared to what else is out there, some competitors, we think there's a lot of attractive opportunities to add some stores.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nHeather Hollander -- Head of Investor Relations\n\nWe want to thank you for joining today's call. A replay, along with the slide presentation and prepared remarks, will be available for one year on our website. Thank you for your interest in Nordstrom.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHeather Hollander -- Head of Investor Relations\n\nErik Nordstrom -- Chief Executive Officer\n\nPete Nordstrom -- President and Chief Brand Officer\n\nAnne Bramman -- Chief Financial Officer\n\nMichael Maher -- Chief Accounting Officer\n\nUnknown speaker\n\nMatthew Boss -- JPMorgan Chase and Company -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nEd Yruma -- Piper Sandler -- Analyst\n\nNoah Zatzkin -- KeyBanc Capital Markets -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nMore JWN analysis\n\nAll earnings call transcripts"
}