{
  "companyName": "Yum China Holdings, Inc.",
  "companyTicker": "YUMC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/yum-china-holdings-inc-yumc-q3-2022-earnings-call/",
  "content": "Yum China Holdings, Inc. (YUMC -2.24%)\nQ3 2022 Earnings Call\nNov 01, 2022, 8:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the Yum China third quarter 2022 earnings conference call. All participants are in a listen-only mode. There will be a presentation followed by a question-and-answer session. [Operator instructions] I would now like to hand the conference over to Ms.\n\nMichelle Shen, director of investor relations. Please go ahead.\n\nMichelle Shen -- Director, Investor Relations\n\nThank you, Ashley. Hello, everyone. Thank you for joining Yum China's third quarter 2022 earnings conference call. On today's call are our CEO, Ms.\n\nJoey Wat; and our CFO, Mr. Andy Yeung. We are dialing in from different locations today. If we experience any technical difficulties during the call, please remain on the line as we reconnect.\n\nBefore we get started, I'd like to remind you that our earnings call and investor materials contain forward-looking statements, which are subject to future events and uncertainties. Our actual results may differ materially from these forward-looking statements. All forward-looking statements should be considered in conjunction with the cautionary statements in our earnings release and the risk factors included in our filings with the SEC. This call also includes certain non-GAAP financial measures -- you should carefully consider the comparable GAAP measures.\n\nReconciliation of non-GAAP and GAAP measures is included in our earnings release. Today's call includes three sections. Joey will provide an update regarding our performance in the third quarter. Andy will then cover the financial performance and outlook in greater detail.\n\nFinally, we'll open the call to questions. You can find the webcast of this call and a PowerPoint presentation, which contains operational and financial information for the quarter on our IR website. Also on the site, you can find a video we prepared that showcases our latest stores, offers, and activities. Now, I would like to turn the call over to Ms.\n\nJoey Wat, CEO of Yum China. Joey?\n\nJoey Wat -- Chief Executive Officer\n\nThank you, Michelle. Hello, everyone, and thank you for joining us today. We achieved outstanding performance in the third quarter with fantastic growth, both top line and bottom line. This demonstrates our ability to operate in an uncertain environment by learning, adapting, and strengthening business fundamentals.\n\nDuring COVID time, our resilient business model and agility helped us manage the negative impact. As COVID conditions were relatively calmer in July and August. We capture sales opportunities during the peak summer season. System sales recovered with 5% year-over-year growth.\n\nOperating profit surged 77% year over year to 360 million, even higher than 2019 levels. Great teamwork makes this possible. Key elements in our winning formula includes our in-house and tailor-mix supply chain, industry-leading digital and delivery capabilities, cost restructuring, and solid execution. Let's move to KFC and Pizza Hut.\n\nWe have been innovating new products to satisfy customer cravings. In the past two years, we have established strong presence in new categories such as beef burger, whole chicken, and durian pizza. This was enabled by a powerful supply chain by securing supply and scale, streamlining production, and optimizing costs. Let me share our success stories.\n\nAt KFC, our extra juicy beef burger rapidly captured meaningful market share. Since adding them to the permanent menu in May 2021, we have sold over 100 million burgers. That's about five beef burgers every second. For the full year, we expect to generate close to 2 billion in sales from beef burgers.\n\nWe cater to Chinese taste by making the patty super juicy using our specialty ovens. Customers love our burgers for their great taste and value for money. We source our wagyu beef [Inaudible] locally from Northeastern China and have signed a multiyear contract to secure a price enterprise. Our juicy whole chicken has also quickly gained popularity since its launched late last year.\n\nYear to date, we have sold over 18 million whole chickens. Whole chicken is a versatile product. good for both dine-in and take-home consumption. We use a different breed or smaller chicken with better cost that is the perfect size for an individual meal and particularly juicy.\n\nAnd it's good for sharing on the dining table at home as well. At Pizza Hut, durian pizza has become a customer favorite. In fact, during Q3's promotion, every four pizza we sold was a durian pizza. Our limited-time durian trio pizza, [Inaudible], with three types of durian, was especially popular with durian lovers.\n\nCustomers are increasingly value-conscious, yet we do not compromise on quality. Last quarter, we shared about KFC's widely popular Crazy Thursday campaign, [Inaudible]. Since 2018, we have been offering delicious food, including the latest innovation at amazing value. The campaign continues to be a phenomenal event generating a significant boost in sales every Thursday.\n\nOur customers create witty and playful social media content using the Crazy Thursday theme. Many of these postings has gone viral, creating huge hype for us. Now, to drive weekend traffic for families and kids, we have introduced a Sunday Buy More, Save More, [Foreign language] campaign in July. Customers can get a bigger discount when they buy more, up to 50% off for eight items.\n\nThis new promotion perform has built wonderful momentum with good value perception while protecting our ticket average. Apart from abundant value, we also launched a Golden Star chicken breast burger, [Foreign language]. This is our first successful chicken breast burger. We add an extra step in the preparation process to make the breast meat super juicy and tender.\n\nThis entry-price burger widens our choices for customers. and is a great product for lower-tier cities. We try to keep our brands appealing to useful customers. In September, we transformed select Pizza Hut stores into social hubs for gamers, partnering with the popular RPG game, Genshin Impact, [Inaudible], with the great stores, updated restaurant crews, and exclusive gifts.\n\nThe campaign generated extraordinary social hype. In just three minutes, we sold over 300,000 team combo mills. And our super app recorded its highest activity ever. I'm looking forward to more successful events with this partnership.\n\nLet's move to digital and delivery. We have been enhancing our delivery and digital ecosystem to make our business fundamentally stronger. Customers love coming in; delivery sales are growing fast, empowered by our dedicated delivery riders and leading digital capabilities. Delivery grew 19% year over year and reached 38% of sales mix in Quarter 3.\n\nTogether with takeaway, off-premise sales were over 60%. Our ability to capture off-premise demand not only enable us to successfully serve customers but also pushing store closure impact due to COVID conditions. This 60% off-premise sales is so fundamental to our business model because it really prepares our downside in both sales and profit despite the fluid situation. We have been maximizing delivery coverage and flexibility using AI technology.\n\nMost recently, we launched Smart Delivery, [Foreign language], to dynamically adjust delivery coverage for each store by daypart, taking into account the operating hours of nearby stores. The upgrade system help us serve more customers more efficiently. Our digital capabilities serve as key touchpoints with customers. In Quarter 3, we reached two milestones in our digital ecosystem.\n\nOne, our loyalty program reached 400 million members. And two, cumulatively since 2018, KFC sold over 100 million privileged subscriptions. Our privileged subscriptions offer great value for money and have been expected too in driving frequency and spending. Our digital capabilities are also crucial to streamlining restaurant efficiency.\n\nDigital orders optimize in-store labor efficiency and accounts for more than 90% of sales in the quarter. Pizza Hut's table sign mobile ordering sales have grown exponentially from just 2% at its launch in 2018 to 45% in Quarter 3 2022. This helps mitigate rising wage inflation and frees up the crew members to enhance customer service. To improve digital experience, we introduced intelligent order sequencing at KFC, [Foreign language], in the third quarter.\n\nThis system automatically arranges ordered to shorten customer wait time. Now, let's move on to coffee, our third growth engine. Lavazza is making solid progress along its clear four-pillar strategy. The pillars include brand building, menu upgrades, expand digital and delivery capabilities, and store development.\n\nHere's how we build this out. Branding. Lavazza has a century-long reputation for coffee expertise. We will continue to accentuate its brand positioning as the leading Italian coffee brand offering and an Italian experience.\n\nMenu upgrade. We are broadening food and drink offerings with more unique Italian products, including coffee premium, single-origin beam in tigelle, which is an Italian flat bread with meat or except something like our Chinese [Inaudible]. We also launched localized products such as coconut latte, [Inaudible] milk latte, and even [Inaudible] is a very lovely fragrant flower used in many Chinese desserts. These new products capture the latest coffee trend and have been well received by our customers.\n\nDigital and delivery. We are building our membership program and digital fundamentals to improve customer experience and attract online traffic. Delivery reached almost 40% of sales mix in Quarter 3. Store development.\n\nNow, with 78 stores, we have further refined our store models, paving the way for growth. We have made great progress so far, but work remains. But things do take time. We want to grow this brand right with every step at the right time.\n\nIn close partnership with Lavazza Group, we are confident to build a successful Lavazza business in China. We decided to wind down our COFFii & Joy operation from branding to site selection to operation and more. We learned a lot with COFFii & Joy. This invaluable learning experience will help us capture growing opportunities in the coffee market.\n\nGoing forward, we will grow our coffee business with two distinct market positions: take coffee, focused on value and convenience; and Lavazza focused on authentic Italian coffee. To summarize, our innovations and hard work in the pandemic years have made our business fundamentally stronger. We are confident in our team's ability to find opportunities in diversity and unlock further potential in China. We will continue to execute our GM, which stands for resiliency, growth, and moat framework to strengthen our competitive position and capture long-term growth.\n\nWith that, I will turn the call over to Andy. Andy?\n\nAndy Yeung -- Chief Financial Officer\n\nThank you, Joey, and hello, everyone. Let me now go through the third quarter performance in detail. We saw sequential improvement in the third quarter. System sales returned to growth year over year and restaurant margin was highest since 2018, well above our expectations.\n\nWe focus on driving sales through new products and compelling value. Same-store sales recover to the same level a year ago. From a timing perspective, the trend remains volatile impacted by frequent COVID outbreaks. In July and August, we saw a sequential recovery in same-store sales in August exceeding the prior year.\n\nThis was mainly due to lapping the Delta variant outbreak in August 2021, which heavily impacted Eastern China. However, in September, same-store sales declined mid-single digits as COVID-related health measures tightened in many areas. Around 900 stores were temporarily closed or provided limited services in September compared to around 400 stores on average in July and August. On the margin side, we continue to identify cost-saving opportunities, drive labor productivity and we base our cost structure.\n\nLet me go through the financials and our cost control initiatives. Unless noted otherwise, all percentage changes are for the effect of foreign exchange. Foreign exchange had a negative impact of approximately 6% in the quarter. Third quarter total revenues increased 5% year over year in reported currency to $2.68 billion due to the contribution of new units and the consolidation of Hangzhou KFC.\n\nThis was partially offset by temporary store closure and foreign exchange translation. In constant currency, total revenue grew 11%. System sales grew 5%. Same-store sales were flat year over year.\n\nBy brand, KFC same-store sales were flat with same solid traffic at 93% of prior year's level. Ticket average grew 8% due to the increase in delivery mix, which has a higher ticket average than dine-in. Abundant value campaigns like the Family Bucket and Buy More, Save More, also strongly contributed to higher ticket. Pizza Hut same-store sales grew 2% year over year.\n\nSame-store traffic grew by 2%, while ticket average was flat. High delivery mix, which has a lower ticket average than dine-in was offset by discount management. [Inaudible] margin was 18.8%, 660 basis points higher than last year. The year-over-year increase was mainly due to high product activity, temporary relief, and sales leveraging.\n\nThese were partially offset by inflation in commodity, wage, and utility costs, while costs also increased due to high delivery volume. Our team worked diligently to improve our cost structure, so let me next go through each expand line item and the actions we have taken. Cost of sales was 30.7%, 150 basis points lower than last year. We focused on the most effective campaign to drive traffic that allow us to be more cost-efficient while ensuring quick value for money.\n\nWe also manage commodity price inflation to low single digits. Cost of labor was 23.5%, 210 basis points lower than last year. This was mainly due to improvement in labor productivity and release recognized in the third quarter of $17 million. These were partially offset by increasing costs from higher inventory sales mix and wage inflation of 2%.\n\nWe improved labor productivity by, one, optimizing staff scheduling and hiring; two, sharing restaurant management teams across stores; and three, leveraging digital tools to automate processes, such as digital ordering and inventory management. There was also a lapping impact due to higher second levels in 2021 caused by the Southern Delta variant outbreak. Occupancy and others was 27%, 300 basis points lower than last year. This was mainly due to our cost savings initiatives and lower rental expense as a percentage of sales.\n\nIn addition, we pulled back on marketing and advertising. Rental expenses were lower in the quarter due to, one, rental relief of $30 million; two, smaller store format with lower upfront investment and better store economics; and three, negotiating more rental relief with wearable components. G&A expenses increased 16% year over year mainly due to increased compensation and benefit expenses, consolidation of Hangzhou KFC, and incremental expenses from emerging brands. There were also one-time expenses associated with primary listing conversions in Hong Kong.\n\nOperating profit was $316 million, a 77% increase year over year. The net contribution from Hangzhou KFC consolidation was 6% of total operating profit in the quarter. It includes amortization of intangible assets acquired which was roughly $60 million per quarter. This will run through the end of this year.\n\nBelow the operating line, we incurred a $13 million mark-to-market net loss on our equity investment in Meituan in the quarter. It was lower than $32 million net loss in the same period last year. Effective tax rate was 29.9%, 160 basis points higher than last year due to Hangzhou KFC consolidation. Prior to consolidation, the agri income from JVs was not subject to tax, resulting in a lower tax rate.\n\nWe expect the full-year effective tax rate to come in around low 30s. Net income was $206 million, a 72% increase year over year. Diluted EPS was $0.49, more than double the prior-year period. The mark-to-market loss in Meituan negatively impacted our EPS by $0.03.\n\nWe have returned around $560 million to shareholders in cash dividends and share repurchases year to date. We temporarily [Inaudible] purchase in the third quarter prior to the dual primary conversion. Helped by our strong balance sheet, we will continue to execute our disciplined and balanced capital allocation strategy. Our operating cash flow remains strong.\n\nIn the third quarter, we generated free cash flow of $558 million. Let us take a look at the fourth quarter outlook. The external environment remains challenging. COVID-related preventive health measure [Inaudible] in October.\n\nIn October, around 1,400 of our stores on average were temporarily closed or offered limited services. Downward pressures on the economy, cautious consumer spending, and inflationary environment are also happening that we continue to face. Our same-store sales in the third quarter were below the pre-pandemic level. We expect a full recovery of sales -- of same-store sales will take time, and the path to remain uneven and nonlinear.\n\nI would also like to remind everyone that, one, fourth quarter is seasonally a lower quarter in terms of sales and profit. So, sales volatilities could have a more potent impact on profitability. Two, there was around $30 million temporary relief in the third quarter, most of which is unlikely to repeat in the fourth quarter. Three, the appreciation of U.S.\n\ndollar against the yuan may negatively affect our product numbers. And four, we continue to dial back some austerity measures to balance cost reduction and service level. Now, despite the headwinds in the third quarter, we resumed the pace of store openings and opened 621 net new stores year to date. By relentlessly optimizing store economics with lower upfront investment, our new store performance continued to be strong.\n\nStore payback remained healthy at two years for KFC and three years for Pizza Hut. This gives us strong confidence for further expansion. We will continue to implement our disciplined and systematic store opening approach, opening new and profitable store at a robust pace. As the fourth quarter is usually the peak season for store openings, we are confident in reaching the full-year target of 1,000 to 1,200 net new stores.\n\nLastly, let me touch on our primary listing conversion in Hong Kong. It became effective on October 24 along with our inclusion in the Southbound Stock Connect. We expect the new status will provide additional access to investors, [Inaudible] our shareholder base, and increase liquidity. To round up, we have learned to navigate through uncertainties and volatilities in the past two years.\n\nCOVID conditions will continue to remain challenging, but we're adapting to the new normal. Our resilient business model and agility allow us to pivot quickly and effectively develop new strengths. When the market is mildly calmer, we are able to capture the upside and deliver strong results. In the third quarter, we have once again demonstrated our transformative fundamentals, cost control, and solid execution.\n\nWe are confident in our ability to achieve long-term growth in China and generate sustainable returns to shareholders. With that, I will pass you back to Michelle to start the Q&A. Michelle?\n\nMichelle Shen -- Director, Investor Relations\n\nThank you, Andy. We'll now open the call for questions. In order to give more people the chance to ask questions, please limit your questions to one at a time. Ashley, please start the Q&A.\n\nOperator\n\nThank you. [Operator instructions] Your first question comes from Chen Luo with Bank of America. Please go ahead.\n\nChen Luo -- Bank of America Merrill Lynch -- Analyst\n\nHi, Joey, and congratulations on the very strong Q3 results. Given the very fluid situation amid the coat outbreak and restrictions in China, my question will focus on margins. We have seen very impressive margin expansion in Q3 results, and over the past three years, we also observed a pattern that usually during the first few quarters of a big COVID outbreak, such as the Wuhan one or the delta outbreak in Q3 last year and the omicron early this year, we might see a few quarters of margin erosion. But then after our very agile and quick adaptation in the following quarters, we actually -- we managed to achieve margins that could be even higher than the pre-pandemic level.\n\nAnd let's assume that next year, we are not going to see another big wave of outbreak that would lead to massive lockdowns in our core markets such as Eastern China. Is it fair to say that we can actually achieve a restaurant margin that is largely comparable to the pre-pandemic level, which is around mid-teens? So, this is my question. Thank you.\n\nAndy Yeung -- Chief Financial Officer\n\nThank you for your questions. You know, obviously, you know, our team has done a fantastic job to deliver solid margins amid a very difficult and challenging situation. Now, our margin improvement, obviously, some of these fundamental transformations that would last going forward. Some of this is more temporary and some of the outstanding measure maybe dial back as things returning to normal.\n\nNow, if you look at our margin improvement was largely contributed by high productivity, right, and also for the quarter, some temporary relief and sales leveraging, now so when we look at the initiatives that we have undertaken over the past couple of years, we have mentioned over the past few quarters, we have taken initiatives to rebase our cost structure and also to drive efficiency gain. So, you see a lot of new product innovation in terms of our assets, how we manage the pricing, and also the cost inflation and commodity prices. Also, our office and our supply chain team on our core strength in terms of managing supply and robustness of our supply chain. And also sort of mitigate partially some of those impacts, sometimes commodity prices, and allow us to continue to innovate and quickly to roll out new products that meet the consumer demand.\n\nThe other one is, obviously, you look at the labor board activities, for example, we have deployed technologies. We have continued to invest in technologies to automate system processes to help improve labor positivity. As we have mentioned probably last quarter, we're beginning to roll out a management tool for our stores. So, our management team for the store can be used called multiple stores.\n\nAnd if you look at our rental, for example, obviously, we see some rental [Inaudible], but we also have over the past few years and especially over the past couple of years to work very hard to restructure the rental cost structure. We have landlord not only seeing lower rental cost but also more wearable and impactable rent structure. And so, those are both fundamental transformation we continue going forward. Same thing for our digital investment.\n\nOver the past few years, we have continued to invest heavily in digital that allow us to in, for example, during the pandemic, have direct outreach to our consumer mobile new products, new marketing campaign efficiently. And also allow us to if you look at our membership program, we continue to be a very strong foundation for ourselves, membership program now account for north of 60% of our sales. So, those will continue to help us going forward to maintain efficiencies and operating efficiency. However, as we mentioned before, some of this is temporary, for example, the rent lease, some of the relief in our labor costs, especially some of the government incentives or relief, as well as the delay in delay in rate increase in the market in the third quarter.\n\nUsually, we adjust wages in the third quarter for our market, maybe fourth. But because of the pandemic impact this year, many markets have delayed rate increase. So, some of this may come back, and also some of that program. So, all in all, I think looking forward, I think you can expect some of this fundamental change you would stay.\n\nAnd then some of these temporary measures may subside over time.\n\nJoey Wat -- Chief Executive Officer\n\nI would like to just add some color in terms of our management team thinking and also the business model, why that helps protect the margin now in the future. Well, we do believe that this company and this team, this management team is an anti-fragile company. Whatever stone is thrown at us, we possibly could convert these stones into our stepping stones to go further and higher. That's what we believe and that's our team keeps trying to do the right thing.\n\nIn terms of business model, as I mentioned in our -- in my presentation earlier, it's very important to recognize that our off-premise business right now is 60%. What does that mean? Well, if we look at by brand, KFC is actually 65% off-premise. And that is up from last year, which was 60%. Now, Pizza Hut tell even a more amazing story.\n\nPizza Hut, the off-premise sales is 50%, 50. Before pandemic, it was only 30%. From 30% to 50%. So, our business, our off-premise business in Pizza Hut is much, much stronger and higher.\n\nGiven the fluid situation in the pandemic, these are incredibly important number because when we are in sort of a more tougher situation in terms of lockdown, that 60% will become higher because there will be naturally some sales transfer from dine-in to additional off-premise business. So, with the 60% sort of the off-premise influence situation, that percent will go higher that naturally protect our business, ourselves. Because it's very difficult to have a strong margin when the sales leverage is not there. So, it's not only all the margin line that we prepare as Andy has comprehensively pointed out.\n\nBut on the other side, the sales side that we have also put and that's a lot of hard work in the last three years, and the team has done a great job.\n\nChen Luo -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Your margin management capability is really impressive. Congratulations again.\n\nJoey Wat -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Next question comes from Lillian Lou with Morgan Stanley. Please go ahead.\n\nLillian Lou -- Morgan Stanley -- Analyst\n\nThanks a lot. And then thanks for your very detailed explanation. My question is also a follow-up question on margin management, but maybe from different angle because Joey and Andy, you mentioned about the sales leverage and also the line items, management on cost side. So, maybe look at all the initiatives in the third quarter and also during the pandemic in these three years.\n\nYou've been focusing on really kind of rejuvenize the menu and the new product launch and smaller stores, a very effective promotional campaign. So, when you out design this, what's your thinking behind, especially trying to understand that with our new stores now incrementally higher portion of small stores? Would that actually fundamentally change our margin profile going forward? And also, especially third quarter you have more promotional campaign, but in return, actually, it didn't suffer on margin instead on the offer side, they improved the margin. So, I'm trying to understand a little bit further how you achieve that from these efforts. Thank you.\n\nAndy Yeung -- Chief Financial Officer\n\nThank you, Lillian. I think, you know, in terms of margins, I think I want to emphasize, at least in the short term. Because of the COVID situations, we see fluctuations in our sales, impacted and high correlation with the situation. So, the biggest lever of deleveraging impact when things come down is actually sell, right? Higher store sales generally will drive higher restaurant margin.\n\nAnd we can see that even with a dynamic in a time, you'll see that margin fluctuate through the year during the first quarter and the third quarter of January is higher sales period for us, and we also see higher margins. And then in second quarter and especially the fourth quarter, January had lower sales season for us, and you'll also see lower margins. So, I want to emphasize and echo what Joey have mentioned earlier, sales is very important to us in terms of driving margins and to leverage. Now in terms of our store format, our store format remains very, very healthy so economics, probably be in the recent years.\n\nThis is not just come naturally, but a lot of hard work to have put into the store, format design, operations, and then also the menu mix and etc., to make it work. Now, our store format, obviously, right now are geared to our two areas largely. One is on the greenfield, right? So, we still have a lot of cities and townships that we can serve. And then we have a format for that.\n\nWe also have formatting to the urban area where we're increasing density and cater to the high mix of delivery and takeaway business. And so, but they all have one thing in common is that our store format in terms of open investment are turning lower. Compared to a few years ago, we're spending on average, you know, 2.5 million per store. Now, we are spending net less than $2 million, close to like maybe drawing down to like $1.6 million, $1.7 million per store.\n\nSo, that helped us sort of be like more agile, more nimble, and reduce upward investment that allow us to continue to see the very strong unit economics for the new stores that we open. Now, as I mentioned on our prepared remarks, if you look at our payback period for KFC, it's still very healthy at two years. Obviously, there may be some fluctuations depending on the dynamics -- and for Pizza Hut, it's three years. If you look at the satellite store model, as we mentioned before, its performance is very close to what we can achieve with KFC already.\n\nAnd so, that's what still has confidence in terms of robust store expansion. And I don't think we're too concerned about at least from the economics that would have a material impact on our margin mix going forward. So, that's the store format and then also our store economics for new store. Joey, do you have anything to add to that?\n\nJoey Wat -- Chief Executive Officer\n\nYeah. Let me -- again, let me add some color in terms of the relation between promotion and margin management. As we mentioned earlier, we consolidate our promotion mechanism, and we focus on fewer and more impactful such as [indiscernible] Buy More Save More. They help drive our sales during weekend, which is quite effective.\n\nBut at the same time, we are very, very careful to manage our products, for example, the whole chicken, right? The whole chicken -- I'll give you one example. You guys will get it. Sometimes, it's more detail to get it. We sell 80 million whole chicken, so far, this year.\n\nIt's roast chicken, one whole fried chicken. Well, here is the reason why. Oil this year is very expensive. So, if we do roast chicken, it has two benefits.\n\nOne, it's healthier; two, it costs less. Customers love it. So we go through every little detail, make sure that it has both great products but at good cost. And that work for not only them but at-home consumption.\n\nSo, a small example to give a sense. And in terms of margin protection, I would like to share another belief which result in very good results. Back to Q2, it was a very difficult quarter. We reiterate our commitment to protect our staff's jobs, no layoff.\n\nWe look at every single way to manage our cost structure, our margin, except layoffs. We want to prepare our employee jobs during the tough time. Everyone needs some sense of security during very fluid situation. And our staff, our 400,000 strong team, they appreciate it and everyone, everyone go for every single innovation that we can achieve to protect our company in that.\n\nI'll pause here. Let's move on to next question.\n\nOperator\n\nYour next question comes from Xiaopo Wei with Citi. Please go ahead.\n\nXiaopo Wei -- Citi -- Analyst\n\nHi. Good morning, Joey, Andy. I will also ask a question about the margin, but I will take another approach maybe the bigger picture what happened in the past two years. If we look at what happened in the past two years since COVID.\n\nWe are seeing to open more stores. But in the third quarter, the first time that we are seeing amazing restaurant margin with some very short window of rebound about all the consumption, etc. But you can see that you greatly capture that upside of the consumption rebound, should we say that actually, the new store opening, which works the investment for the future, starting working well in a situation for when the COVID is phasing out, actually, our new work contribution to our probability actually be more pronounced than before? Another question related to this is if we look at the delivery sales contribution, the KFC hit 37%, which is amazing, very close to Pizza Hut. I do remember years ago, when I first met Joey, I had the impression that with KFC have never been that high.\n\nIn terms of delivery sales contribution for Pizza Hut. And now we are seeing Pizza Hut and KFC having a very close kind of delivery sales contribution. Shall we say that looking forward, KFC fundamentally has transformed? And we are expecting actually higher-than-expected delivery sales contribution looking forward, approaching 40%? Thank you.\n\nAndy Yeung -- Chief Financial Officer\n\nSo, I think there's a lot of question about margin today. Obviously, we're very pleased with our margin performance in the third quarter. As we mentioned, the sales leveraging when come a time we're not only able to capture both the only the sales upside, but also able to regain the sales leveraging. So, we obviously, as I mentioned before, there's a number of fundamental transformation that we have undergone.\n\nWe base our cost structure in the form of initiative. But I think what you're asking about is about two things, right? One is the new store margins and probably the one is the delivery sales mix, what's the percentage going forward. Now, I think when we look at the new store economics, I think one thing to remember is that for any new store, generally take a couple of years for it to ramp up sales and margins to a truly mature level. So, the other part is that, obviously, we're very pleased as you mentioned, when we look at our new store performance, they continue to be very robust, very strong.\n\nIf we look at the margin fund that I mentioned, the ramp-up period, but even for the store that we opened this year, a large majority of them turn to restaurant breakeven or better within three months of time, which is tracking on par or slightly better than the software level. And so, I mean, there's a couple of things that is happening there, right? One is, as we mentioned, we have worked very hard to find a way format, not just reducing the size of the size, it's obviously important, but also the operations, the total operating offering, and the menu mix. So, all these were in conjunction with that. We also -- as we mentioned, we have worked hard on changing the like restaurant management structure.\n\nWe have developed a management labor pool that can share with the store to make it productivity improvement. So, I think -- and then also, if you look at the entire rental for a new U.S. store, obviously, we have worked very hard to lower the rental cost as per sales. But more importantly, to keep us with sale, we continue to work with [Inaudible] we want to develop a high proportion of web cost component.\n\nAnd so, that allows us to be more resilient over time. So, I think our approach to new store opening is very disciplined and systematic as I mentioned before, and we'll continue to drive that discipline so that when we open new stores as we continue at a very robust pace and might be accelerating during the fourth quarter, we will continue to open not only new store but [Inaudible] store. And so, I think the portfolio contribution for new stores is important layover time. But I think the economic sale, I think, is on par, as we mentioned, [Inaudible] peers, two-year for KFC, three-year for Pizza Hut, which is pretty consistent.\n\nSo, that's the new store margin and possibly. In terms of sales mix, obviously, in the short term, you're going to be depending on COVID situation, tighter measures you're going to see higher delivery mix shift. And then you sometimes you see that things calmer and then dine-in traffic would come back. But all in all, I think you can see there's a big change in our business.\n\nDelivery mix right now and all premise right now come for a majority of our sales now. And so, that's why like when we're developing smart format, as we mentioned before, for the smaller urban format, we do dose more catering to away business. So, high growth, I think we depend on the consumer, if they want more, we'll deliver more and we have to format and how achieve that, especially on the digital side, like we have a whole app to drive traffic, we work a date. So, the consumer can audit whenever they want, and we have a small set.\n\nOperator\n\nYour next question comes from Michelle Cheng with Goldman Sachs. Please go ahead.\n\nMichelle Cheng -- Goldman Sachs -- Analyst\n\nHi, Joey, Andy. My question is about store expansion. So, given this very strong profit margin, do you have any initial thoughts on the expansion plan into 2023? Any chance we could further accelerate expansion given we know all the smaller players are suffering? And also, more specifically by brands, so aside from KFC, Pizza Hut maintaining a relatively stronger momentum on expansion. How do we think about other brands since we're actually reshuffling other brands quite aggressively in the past few quarters? Thank you.\n\nAndy Yeung -- Chief Financial Officer\n\nMichelle, thank you for the question. So, about new store -- and as I mentioned, our new store performance continues to be strong. And also, as I mentioned before, I mean, each year, we set a target thing what is reasonable, but ultimately, it is for the market and the fundamentals that would try how many stores that will be open and then also sometimes get impacted by COVID. So, we will continue to maintain that discipline and systematic approach.\n\nSo, when you see the economics are good, the system we're doing, you'll see some acceleration because more so we propose and more, so we approve. Obviously, when the market or like the economics are more moderate, impacted, then we see some deceleration in medical because it's doing to the model and the assumption itself will refresh that very regularly. So, we will maintain that very disciplined approach. Obviously, we'll continue to see very strong fundamentals for soft opening.\n\nWe see, as I mentioned before, the greenfield. We have more KFC, we're only in a little bit more than 1,700 cities. We see probably another housing so that potentially we can enter Pizza Hut, like almost 1,000 stores that KFC already in, we don't have a Pizza Hut store. So, there's a greenfield opportunity.\n\nSo, we see feel very good about install expansion, so network expansion and opportunity there. Now, in terms of -- obviously, we'll continue to have to work hard on the store format, right, because the consumer change -- and we see obviously opportunities right now. Our pipeline is very strong because we will feel very attractive tenants right now in the restaurant industry. After two, three years of pandemic, we continue to be -- perform very well, pay our rent on time and everything.\n\nSo, we move them attractively even more attractive tenant, so we have more opportunity. But our emphasis, again, is on discipline and some approach to make sure that we not only open a new store but open new and profitable stores. And so, that's important. Now, as you mentioned, we did some portfolio management on our brand.\n\nAs Joey mentioned earlier, we are winding down C&J to focus our resources on the coffee side on Lavazza, which we see very good opportunities, a lot of potential there. And so, that's an approach. We also -- a part this year, we also wind down the COFFii & JOY business. And, you know, starting – having a homegrown brand for more --  close to a decade now.\n\nUnfortunately, this market positioning is in the transportation and tourist locations. Now that business has been very, very challenging over the past three years, you can imagine. And currently, we don't see with the new normal improvement in any short time. So, we decided to wind that business down.\n\nSo, again, back to that discipline and systematic approach be it in store expansion, be it in portfolio management. We are very disciplined about that. And so, we will continue that going forward about the brand development. So, thank you, Michelle.\n\nJoey Wat -- Chief Executive Officer\n\nI'll just add a few comments about the store expansion. First, we certainly are opening even more smaller stores. So, for Pizza Hut alone, some 5% of the new store opened this year are either smaller or satellite store, and KFC is about half. And these small stores worked particularly well in lower-tier cities, and that's where we will continue our store expansion.\n\nAnd the result is pretty exciting and promising. So, that's comment number one. Comment number two is opening new -- the smaller stores also require focus on the product and operations side, and we are giving that support to the new smaller stores. For example, chicken breast burger, [Foreign language].\n\nThe price is very good. It's 9.9. It's brilliant. It's amazing for the lower-tier city new stores as introduction to our business.\n\nThe other products like [Foreign language], we developed these products with lower price points, specifically for lower-tier cities and specifically for the introduction new stores. And at the same time, we also continue to innovate in terms of operating process within the small stores. Well, one example, smaller store we only can accommodate fewer number of staff, which is a great news for shareholders. But that also requires changes in terms of operating process, how to still make it work to protect our product quality for safety.\n\nYou name it. So, not only just the cause of opening new stores but also the product and the operating process that we are focusing on. Thank you, Michelle. Next question.\n\nOperator\n\nYour next question comes from Anne Ling with Jefferies. Please go ahead.\n\nAnne Ling -- Jefferies -- Analyst\n\nHey, thank you. Thank you for giving me the opportunity for asking the question. Hi. Regarding the cost side, we look at like -- we track the chicken price, and which we saw a 20-odd percent increase.\n\nAnd also, at the same time, flow costs also increased. I understand that management has a really great way in terms of like making use of the whole to the chicken parts. But moving into like year 2023, when do you see this increase in terms of the cost, the checking costs, or the other commodity costs kicking into your P&L? Or maybe you can share with us what is your current agreement with your supplier. Thank you.\n\nAndy Yeung -- Chief Financial Officer\n\nAnd thank you for your question. Joey, do you want to --\n\nJoey Wat -- Chief Executive Officer\n\nNo, no, go on.\n\nAndy Yeung -- Chief Financial Officer\n\nYeah. OK. So, when we look at, you know, our [Inaudible], obviously, I think we do have to comment on how fantastic job product innovation team have done to help us manage that cost inflation. Commodity price inflation, as you mentioned, is very real and is globally and it's true also in China as well.\n\nObvious in China, we see more moderate inflationary pressure. But still, we see the commodity price increase escalating over the past probably like a year. We see a very favorable pricing last year, 2021. We're beginning to see that commodity price pricing pressure building up.\n\nAnd right now, China is probably at mid- to high-quality commodity price increase. And as you mentioned, we all see poultry price increase -- so as I mentioned before, this is going to continue happening. And we'll continue to work hard to mitigate it. The other one I want to mention is that as we have mentioned before, our supply chain lock down most of the supply, you know, a quarter to half time.\n\nSo, there will be some lagging impact on the inflationary side. And obviously, because we get an inflationary environment or supply thing also deploy long-term contracts at when it is possible to lock in pricing a little bit longer. For example, coffee, they have to talking in a longer-term pricing contract. But some of the commodity you can lock in for a longer time.\n\nSo, we'll see some commodity pricing pressure building up in the coming quarter as well. Now, as you mentioned to you for pricing pressure besides of the supply chain and the efficiency there is also on product innovation, as Joey has mentioned. The team has done a fantastic job developing new products. That utilize given part of the resources that we already have, chicken, beef.\n\nFor our folks in the U.S., like when people talk about chicken sandwich or chicken burger, generally that will refer to chicken breast. But as we have mentioned before for China consumer, generally, they like dark meat more than white meat because dark meat means they tend to be more tender and more flavorful. So, this -- for example, this quarter, as Joey mentioned, we have developed a fantastic chicken sandwich, chicken burger but that is very successful in what we see by consumer. Now like that kind of product innovation will satisfy consumer demand and also help us to manage commodity prices will be very key for long-term managing [Inaudible].\n\nSo, yes, so that relieve hyperinflation. And then also, obviously, how do we manage our marketing campaign? How do we manage other costs, waystation or that we also point for us in the long term to manage the till? Now, for labor inflation, as we mentioned before, generally bad time, good time, we will likely see labor cost increase. Sometimes you will delay sometimes it's more moderate. But in China, the long-term trend is mid- to high single digits.\n\nAnd so, in long term, we will continue to have to work hard to improve their productivity, invest in technology, IT, invest in infrastructure, and as Joey mentioned, continue to innovate, continue to improve our store operations, so that we can maintain labor efficiency of gain to offset that labor inflation. And that said, I like commodity price and labor inflation.\n\nJoey Wat -- Chief Executive Officer\n\nAnn, I'll just add one comment on that one. We do use every part of chicken accept the chicken better. But I would also like to point out that we have our team, both the pricing team and then the product innovation team. We have been able to interview and use different protein, beef, pork, fish, and duck.\n\nWe are selling duck burger right now as we speak right now, chicken and duck burger. So, we have a variety of proteins in our pipeline that we can use and we can promote, depending also on the price. I mean, the thinking is rather simple. A good chef, they look at what is the best in terms of quality, not only price, quality, and price available in the market.\n\nAnd then you turn this fantastic ingredient to great food. Same for us, just a much, much bigger scale, I guess. So, we have both the flexibility and the scale to deliver amazing food to our customers at very good price and very good value. Thank you, Ann.\n\nOperator\n\nYour next question comes from Christine Peng with UBS. Please go ahead.\n\nChristine Peng -- UBS -- Analyst\n\nThank you, management, for taking my question. So, my question is on the product side. So, I supported a very interesting new product, which Joey mentioned, which is the beef burger. So, I noticed that this product has been on the menu since May of 2021, which means that this is likely to be a long-standing product instead of LTO.\n\nSo, if that is the case, Joey, can you share with the distinction behind this product in terms of the rationale, the supply chain management, and also future plan. for this product going forward. Because what I'm interested to understand is that will this be a burger potentially become a very important category for KFC going forward. And what's going to be the structural impact on KFC in terms of competition, in terms of margin trends, etc.\n\nSo, anything you can share with us, that will be very much appreciated. Thank you.\n\nJoey Wat -- Chief Executive Officer\n\nThank you, Christine. Well, it's already a very important product in KFC portfolio. The speed and the support from the customer exceeds our expectation. To quantify the sales of beef burger, I mean, we talk about it already.\n\nThey already contribute meaningful sales mix to our business. It's about 3% to 4% of KFC sales mix, but that is a lot already because for original recipe after all these years, it's about 6%, 7%. So, it's half of our original recipe chicken sales already. So, that's the number side.\n\nIn terms of product side, for those who are in China, if you have a chance to try, I do strongly encourage you try it, then you can form the opinion yourself about the future of this product. I know it's rather unusual for a company selling chicken to sell beef burger, but once you try it, you will understand why. We have good range of product choice there from entry-price burger, which pays amazing, to beef burger all the way to what will the Angus beef burger. You know, as Andy mentioned, it's hard to imagine.\n\nBut it says amazing. What we did, you can't write what will be focused. And the price is still very good value. I want to say it's low price.\n\nI mean, it's the fantastic value. So, the choice of product is fantastic. Third is the flavor, the taste. There are plenty of customer – customer-made video comparing our burger versus other competitors.\n\nOne thing very distinct about our beef burger is the burger is it's very juicy, and this is our focus. Because while some traditional beef burger lover might love the barbecue flavor, for Chinese taste, they prefer the juicy burgers. And that has been our focus. And we are uniquely positioned to do that because we have very high-quality ovens in our kitchen each of our KFC kitchen to produce the beef burger.\n\nSo, the burger patty is cooked in an oven, not on grill. So, I hope that gives you some flavor of this amazing product that I love myself.\n\nAndy Yeung -- Chief Financial Officer\n\nJoey, let me add a little bit here because I'm self-proclaimed No. 1 fan of KFC often. And like -- but still sometimes I do need variety beside chicken, right, and rice -- so I think the beer is fantastic. The before we have one local program, but now we have a range of further that pre-border that can appeal to different pricing points.\n\nI myself increase my frequency go and give a store because I now have -- like when I want to be, I have fantastic choice for the KFC beef burger program. So, from a customer standpoint, I think it's fantastic because greater right you mentioned great variety, different proteins, different choices. And so, I love it anyway. Thank you.\n\nOperator\n\nYour next question comes from Veronica Song with Credit Suisse. Please go ahead.\n\nVeronica Song -- Credit Suisse -- Analyst\n\nThank you, management, for taking my question, and congratulations on a very strong set of results. I have a question regarding the cost business. So, as Joey mentioned, we're going to wind down the COFFii & Joy business and focus more on the K-Coffee and Lavazza. So, could you share more color on the current situation or achievement of Lavazza, especially in terms of store expansion, and any color on store economics? So how can we adopt the valuable experience we learned from COFFii & Joy and KFC to drive Lavazza's success? Thank you.\n\nAndy Yeung -- Chief Financial Officer\n\nOK. So, I think first of all, I think it's a repeated quickly, which is we wind down the C&J business so that we can focus more our resources the cab resources on abate and give, obviously, the team more focus, more laser-focused on the market. And as you mentioned, currently, our coffee strategy have two key brands. One is take coffee, which is served the value and convenience segments.\n\nAnd for Lavazza, refocusing on offer authentic wonderful Italian coffee and experience. So, from obviously, C&J with the homegrown brand over the past four years, we'll learn a lot. And this is one thing that we have keep saying, we have held respect when we enter into a new business segment. Comp business is very different, obviously, from fried chicken and Pizza Hut business.\n\nSo, there's learning there and how to give our product, coffee, water, milk, the whole process to make good coffee in selection, obviously, is also very critical. And then obviously, for coffee too, the store format, I think trying to figure out what the right format at different trade and economics and whatnot. And then also in terms of the Chinese customer, coffee is still a volatile new market segment. A lot of Chinese consumer are still very new to coffee to take a coffee and what their presence are also make time for us to develop and learn and apply to our product development.\n\nSo, a lot of this learning, I think, a wonderful learning that we did with C&J would help us to obviously apply to rebase and flow out and expand its business. And for Lavazza, continue to recover from, obviously, from a franchise time because a lot of store in Shanghai early part of this year. And we see recently, a business has rebounded. I think in terms of the product, the team they continue to be on the right track.\n\nI think we don't -- I don't think we can say like we're there yet, but building a new brand, a new business is going to take time, but they have done a great job in terms of putting the wide -- organizing the right team, putting the -- continue to innovate in the product. You've seen a lot of new product innovations, right, where the [Inaudible] make and train -- we also see the [Inaudible] latte, and all that have been wonderful success with the consumer. That sort like offer that Italian experience, but also favorite that here to a Chinese consumer. And then we'll continue to do more, I think, like in terms of training and innovation.\n\nSoftware is the same thing. You see that they continue to experiment and roll out. And overall, you see the unit economics improve. But I think for them to reach obviously, the consumer awareness, the sales level, and also the profitability I think people have to be a little bit more patient on that.\n\nThey have quite a bit of thought this year, almost double, right on now, we have 78 stores, and we continue to open more stores. And then we also continue to develop its capability. They continue to develop its digital and do very capability. So, if you look at sales mix now, you can see that the membership program and also the go volume continue to increase delivery now almost like 40% of the sales mix now.\n\nSo, that's a great improvement, especially given the challenging environment with COVID. In terms of store development, as I mentioned, like to improvement, increased from a year ago to 78 stores. There will be more and -- but you should not -- felt like COVID obviously will have some impact. I think last year, we mentioned 1,000 stores and we're very much committed to that.\n\nBut obviously, the timing of that is going to be depending on some market conditions, especially with COVID. As we mentioned, we have a very systematic and disciplined approach even with the new coffee brand in Lavazza. But I think we're pretty confident as the economics improve, you will see more store open. So, that's the update on Lavazza.\n\nOperator\n\nThere are no further questions at this time. I will now hand back to Mr. Shen for closing remarks.\n\nMichelle Shen -- Director, Investor Relations\n\nThank you, Ashley. Thank you all for joining the call today. We look forward to speaking with you on the next earnings call. If you have further questions, please reach out through the contact information in our earnings release and on our website.\n\nHave a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichelle Shen -- Director, Investor Relations\n\nJoey Wat -- Chief Executive Officer\n\nAndy Yeung -- Chief Financial Officer\n\nChen Luo -- Bank of America Merrill Lynch -- Analyst\n\nLillian Lou -- Morgan Stanley -- Analyst\n\nXiaopo Wei -- Citi -- Analyst\n\nMichelle Cheng -- Goldman Sachs -- Analyst\n\nAnne Ling -- Jefferies -- Analyst\n\nChristine Peng -- UBS -- Analyst\n\nVeronica Song -- Credit Suisse -- Analyst\n\nMore YUMC analysis\n\nAll earnings call transcripts"
}