{
  "companyName": "Digital Media Solutions, Inc.",
  "companyTicker": "DMS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/digital-media-solutions-inc-dms-q2-2022-earnings-c/",
  "content": "Digital Media Solutions, Inc. (DMS -0.74%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Brika, and I'll be your conference operator for today. At this time, I would like to welcome everyone to the Digital Media Solutions second quarter financial results 2022 conference call. [Operator instructions] Thank you.\n\nNow I would like to pass the call over to Tony Saldana, DMS general counsel.\n\nTony Saldana -- General Counsel\n\nThank you for joining us to discuss DMS' financial results for the second quarter of 2022. With me on the call are Joe Marinucci, co-founder and CEO; and Richard Rodick, our new CFO. We posted our earnings announcement this afternoon in press release and also on our Investor Relations website. By now, everyone should have access.\n\nBefore we begin, I would like to call your attention to our safe harbor provision for forward-looking statements in our financial results press release. The safe harbor provision identifies risk factors that may cause actual results to differ materially from the contents of our forward-looking statements. For a more detailed description of the risk factors that may affect our results, please refer to our financial results press release and our SEC filings. Also, during this call, management's commentary will include non-GAAP financial measures.\n\nReconciliations between GAAP and non-GAAP financial measures for our reported results can be found in the tables of our financial results press release, which we have posted to our Investor Relations website at investors.digitalmediasolutions.com. The additional financial and other information to be discussed on this call can also be found on our Investor Relations website. Now I'd like to turn the call over to Joe Marinucci, our CEO.\n\nJoe Marinucci -- Co-Founder and Chief Executive Officer\n\nThank you, Tony, and good afternoon, everyone. Welcome to our second quarter 2022 earnings call. We posted our press release earlier this afternoon. Our second quarter performance reflects many of the major challenges that resulted from significant market volatility and macroeconomic factors.\n\nHere's an overview of our second quarter performance. Our second quarter net revenue was $91 million, down 13% year over year. We generated gross margin of 26% and variable marketing margin of 33%. Adjusted EBITDA came in at $3 million or a margin of approximately 3%.\n\nRick will add more details and dig deeper into the numbers and go over our guidance for the third quarter and full year 2022 later in the call. During Q2, our insurance vertical was significantly impacted by unparalleled market volatility. Let's quickly discuss the factors leading to the volatility we're facing within auto and health insurance. Auto insurance industry challenges were evident in a significant year-over-year reduction in carrier revenue and pricing.\n\nThis is due to exceptional inflation and supply chain issues continuing to prevent accelerated recovery as increased claims costs continue to suppress insurance carrier marketing spend. Because of this, we project many carriers will remain cautious throughout 2022, with a modest recovery now expected to push into 2023 as the industry continues to experience unprecedented factors. At this time, we do not have the ability to accurately predict exactly when market conditions will return to normal. Across the health insurance industry, lockup period spend continue to be down from prior comparable periods as providers reserve marketing spend for the open enrollment periods.\n\nWe're cautiously optimistic about ad spend in Q4 when the AEP/OEP period is expected to significantly drive our performance. Overall, we're optimistic that the volatility we are seeing should decline sometime in 2023. For the remainder of this year, our team will continue to focus on execution against our strategic initiatives and opportunities. So yes, there are headwinds, especially within the auto and health insurance verticals.\n\nThat said, let's shift focus to review our next phases of diversification growth in our largest vertical insurance. As noted, we see volatility and a lot of this is at the enterprise level. Parallel to our enterprise clients will be our independent agents. We currently have over 7,000 agents across major clients such as Allstate, State Farm and others.\n\nOver the last quarter, we have made significant investments into our leadership and agent success teams who support these agents. We have also invested in our platforms, specifically ALM and ZipQuote. These investments are leading our agent growth as we aim to expand our agent base by as much as 40% over the next 12 months. This expansion not only helps to drive revenue growth for DMS, but also helps give us more diversity in our revenue mix between enterprise and SMBs.\n\nWe also continue to invest in our core assets: data, technology and media. Identity is at the core of our data platform. And with the Traverse acquisition, our actionable intelligence from data signals are increasing to deliver more of what consumers are looking for at the right time and the right channel. With Traverse, DMS is developing a commercialized omnichannel, audience activation, engagement and reengagement data signals platform.\n\nThe integration in its current base has already elevated the power of DMS first-party data and signals. This is exciting for us as we believe we're still in the early innings of this growth curve. And this is the cornerstone to our future growth as the unique strength of our data platform and real-time intelligence signals are what helps DMS sufficiently and effectively use omnichannel activation to connect high-intent consumers and advertisers. This is a dynamic capability for DMS that competitively differentiates us and can be seen in our earlier announcement of our multiyear partnership with Seekr.\n\nAs reported in our press release earlier, global omnichannel, audience activation and engagement campaigns with Seekr are currently underway. Overall, we see the Q2 2022 period is trough level performance for DMS. So far in Q3, we are seeing good initial indicators for the period and also early positivity for the Q4 period, which has been historically and seasonally strong for us. As a result, we believe we will return to growth in 2023 as we exit 2022 with noted momentum as a result of our investments in our strategy.\n\nI summarize this strategy as follows: continuing to leverage our data first technology-driven approach, which allows for the diversification of our business, inclusive of verticals and media channels; delivering for top advertising clients, which has led to retention rates for our top customers remaining strong with our top 10 growth clients showing revenue increases of 26% quarter over quarter; the commitment to continue investing in our people, process and technology to support initiatives like the growth of our independent insurance agents; and finally, a continued focus on driving efficiency in our business through consolidation and reduction in operating expenses. Lastly, I'd like to offer a quick update on our strategic review. As previously discussed, in August of last year, we announced plans to evaluate strategic alternatives for DMS to further maximize shareholder value, and we were hoping to have an update for you today. However, we are still not finished with this process, so I have nothing to share other than to state that we are working toward the best possible results, and we appreciate your patience.\n\nAnd as soon as we're able, we will provide updates. Now it's my pleasure of turning the call over to Rick Rodick, who joined us as our new CFO back in July. His depth of experience across financial reporting, financial planning and analysis, investor relations and acquisition valuation makes him an invaluable addition to the DMS leadership team. So with that, I'll pass it to Rick to dig deeper into our second quarter financial results.\n\nOver to you, Rick.\n\nRick Rodick -- Chief Financial Officer\n\nThanks, Joe. It's great to be on my first call as the DMS chief financial officer. I'd like to thank the entire team for the warm welcome I've received since joining the company in July. What I've seen since journey DMS has only made me more excited about the opportunities for our clients, partners and employees.\n\nQ2 was a challenging quarter as we continue to see headwinds and macro challenges inside of insurance, which represents the majority of our business. These headwinds and macro challenges impacted both property and casualty along with health insurance and can be seen across both the Brand-Direct and Marketplace segments of our business. Net revenue was $91 million, down 13% versus same quarter last year as a result of these trends. Insurance, which account for approximately 57% of our total revenue in the second quarter, was down 18% compared to the same period last year.\n\nThe breakdown of insurance business was as follows: auto made up 69% of total insurance; health was 20%; followed by life at 8%; and home at 3%. As Joe said, dynamic diversification has remained important to us as DMS remains vertical-agnostic. Here's an overview of the performance of some of our other verticals. Career and education, which was approximately 14% of our total revenues in Q2, grew 16% year over year, driven by strong demand for our services as we continue to win wallet share.\n\nE-commerce, which represents 12% of our total revenues, was down 50% compared to the same period in 2021. Fluctuations like this are why we remain a dynamically diversified company so we can quickly pivot with our advertiser clients and publisher partners toward the best opportunity. Consumer finance accounted for 11% of our total revenue grew 37% in Q2 over the prior year's quarter. Our agility enabled us to capitalize on the market trends despite rising interest rates impacting mortgage growth.\n\nIt's important to note that typically higher mortgage rates trigger increased demand from lenders as they seek to expand their buyer databases. For the second quarter, we reported gross profit of $23 million, equating to 26% margin versus a 32% margin in Q2 2021, driven by margin compression within auto insurance and consumer pathways. Variable marketing margin was 33% compared to 38% in Q2 2021. On a reported segment basis, excluding intracompany revenue, the Q2 Brand-Direct Solutions gross margin was 21% compared to 26% in Q2 2021.\n\nAnd the Q2 Marketplace Solutions gross margin was 24% compared to 29% in Q2 '21. Technology Solutions, which was formally called Other Solutions, has primarily included our SaaS business. Q2 margin for this segment was 84%. Gross margins continue to be negatively impacted by media costs, wage inflation and the tight labor market, especially for our call centers.\n\nNow moving on to operating expenses. Our total operating expenses amounted to $35 million in the second quarter, an increase of $7 million year over year, driven primarily by the change in fair value of warrant liabilities plus higher costs due to acquisitions and public company costs. However, we've continued to stay focused on driving efficiency in our business through consolidation and reduction of operating expenses. To this point, we've been successful in reducing our operating expenses for the second consecutive quarter and expect this trend to continue to the end of the year.\n\nWe entered the quarter with corporate head count of 308 FTEs, down from 344 FTEs at the end of Q1 2022. Finally, on profitability. Our adjusted EBITDA for the quarter was $3 million or a margin of 3%, down $13 million compared to the same quarter last year, driven primarily by lower revenues and mix. Our net loss was $12 million versus net income of $5 million for the same quarter last year.\n\nEarnings per share for the quarter was a loss of $0.18, compared to $0.07 positive earnings per share in Q2 2021. Lastly, turning to the balance sheet and liquidity. We ended the quarter with $26 million in cash and cash equivalents, which was flat with December 31, 2021, driven by our strong cash collections. At quarter end, our total debt was $217 million.\n\nAnd as of quarter end, our $50 million revolving facility remained undrawn. As of June 30, our net leverage was 4.7 times. As a reminder, our credit facility includes a leverage covenant of five times. We believe we have sufficient liquidity under our facility and remain mindful of our obligations given current economic volatilities.\n\nAs we look to 2022, despite a number of macro headwinds, our people, processes and technologies remain key for us. We remain focused on execution and data-driven opportunities. As such, we remain comfortable with maintaining our previously discussed gross margin guidance of 28% to 31% and variable marketing margin range of 32% to 36% for both the third quarter and full year 2022. We expect the third quarter net revenue to be in the range of $87 million to $90 million.\n\nWe expect adjusted EBITDA to be between $4 million and $6 million. Again, as Joe noted, we are seeing good initial indicators for the Q3 and also the Q4 period, the latter of which has been historically and seasonally strong for us. We expect our full year net revenue to be in the range of $390 million to $400 million and full year adjusted EBITDA guidance to be between $30 million and $35 million. Overall, with the investments we are making in the various components of our business and with what we believe to be a modest recovery in property and casualty insurance next year, we are excited about2023 as a year where we return to growth.\n\nDuring this time, we expect a continued high rate of free cash flow conversion to EBITDA. With that, we thank you for your interest in DMS, and we now open the line for questions. Operator, please provide our listeners with instructions on how to submit questions.\n\nOperator\n\n[Operator instructions] We have our first question on the line from Rob Shapiro of Singular Research. Your line is open, Rob.\n\nRob Shapiro -- Singular Research -- Analyst\n\nHello. So yeah, you did just forecast that your gross margin should be between 28% and 31% for the third quarter. And you just had a -- so the second quarter had a gross margin of 25.7%. So I wanted to know, has there been something that changed in the environment where you feel like you can move that gross margin up to around 28% to 31%?\n\nJoe Marinucci -- Co-Founder and Chief Executive Officer\n\nHey, Rob. Good afternoon. This is Joe Marinucci speaking. Good to speak to you again.\n\nSo yes, gross margin for the period did move below our range. And as Rick, during his segment properly called out, gross margin takes into account other factors outside of just pure media spend. So specifically with the call center component of our business, which plays a pretty critical role in delivery for us. We're dealing with some volatility there with wage and support service costs, which during the period, as I mentioned and Rick mentioned, we're mindful of driving operating efficiency to make sure that we're removing unnecessary costs throughout the business.\n\nSo we've been able to recalibrate here in the third quarter to adjust for some of those inflationary pressures that came through at the end of Q1 and really started to gain momentum in Q2. So we do believe that we will come back in range on gross margin during the Q3 and the Q4 periods. Some of that also ties back into our growth initiatives, and we did see considerable growth in our agent base from Q1. This is our independent insurance agent base, which diversifies us from the enterprise level clients spend.\n\nSo we have the two tracks there with the enterprise spend and the independent agents. So we saw agent growth in the Q2 period. As we noted, we're investing behind that, and we saw our agent base grow by about 10% from about 6,400 to just over 7,000. And because of how agents spend as opposed to how carriers spend, there's more stability there.\n\nIt helps us with our VMM, which pulls directly through the gross margin. So as we see that trend continuing, as we continue to see growth in the independent agent base, which gives us stability in insurance that also helps to lift the VMM, which lifts the gross margin, and we have cost controls coming in underneath that, which again leads us back to the belief that we come back in line for gross margin for the Q3 and Q4 period, and VMM is already in line. So hopefully, that answers your question.\n\nRob Shapiro -- Singular Research -- Analyst\n\nYeah. OK. Thank you.\n\nOperator\n\nThank you, Rob. [Operator instructions] There are no further questions at this time. [Operator signoff]\n\nDuration: 0 minutes\n\nTony Saldana -- General Counsel\n\nJoe Marinucci -- Co-Founder and Chief Executive Officer\n\nRick Rodick -- Chief Financial Officer\n\nRob Shapiro -- Singular Research -- Analyst\n\nMore DMS analysis\n\nAll earnings call transcripts"
}