{
  "companyName": "Genasys Inc.",
  "companyTicker": "GNSS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/genasys-inc-gnss-q3-2022-earnings-call-transcript/",
  "content": "Genasys Inc. (GNSS 12.12%)\nQ3 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Genasys Inc. fiscal third quarter 2022 conference call. [Operator instructions] At this time, it is my pleasure to turn the floor over to your host. Kim Rogers, investor relations for Genasys.\n\nMa'am, the floor is yours.\n\nKim Rogers -- Investor Relations\n\nThank you, Karen. Good afternoon, everyone, and welcome to the Genasys Inc. fiscal third quarter 2022 financial results conference call. I'm Kim Rogers with Hayden IR, the Investor Relations firm for Genasys.\n\nWith me on the call are Richard Danforth, chief executive officer; and Dennis Klahn, chief financial officer of Genasys. During today's call, management will make forward-looking statements regarding the company's plans, expectations, outlook and the future financial performance that involve certain risks and uncertainties. The company's results may differ materially from the projections described in these forward-looking statements. Factors that may cause such differences and other potential risks and uncertainties and can be found in the Risk Factors section of the company's Form 10-K for the fiscal year ended September 30, 2021.\n\nOther than statements of historical facts, forward-looking statements made on this call are based only on information and management's expectations as of today. We explicitly disclaim any intent or obligation to update those forward-looking statements, except as otherwise specifically stated. We will also discuss non-GAAP financial measures and other operational metrics, including adjusted EBITDA, bookings and backlog, which we believe provide helpful information to investors with respect to evaluating the company's performance. For a reconciliation of adjusted EBITDA to GAAP financial metrics, please see the table in the press release issued by the company at the close of the market today.\n\nWe consider bookings and backlog leading indicators of future revenues and use these metrics to support production planning. Bookings is an internal operational metric that measures the total dollar value of customer purchase orders executed in a given period regardless of the timing of related revenue recognition. Backlog is a measure of purchase orders received that are scheduled to ship in the next 12 months. Finally, a replay of this call will be available in approximately four hours through the Investor Relations page on the company's website.\n\nAt this time, it's my pleasure to turn the call over to Genasys, chief executive officer, Richard Danforth.\n\nRichard Danforth -- Chief Executive Officer\n\nThank you, Kim, and welcome, everybody. We had another terrific quarter with strong Q3 revenues leading to nine-month record revenues. Our operating activities generated more than $2.5 million in cash, further strengthening our balance sheet with the capital to fund our growth investments. Bookings for the quarter were nearly $20 million, growing our backlog $6 million to a total of $30 million exiting Q3, keeping us on track for our revenue expectations for the year.\n\nOverhead bookings remained strong, more than $20 million for the quarter. Fiscal year law enforcement and public safety bookings are already at a record level for the third consecutive year. Genasys Software Services will use numerous times to deliver flash flood warnings and evacuation notices during the Eastern Australian floods in April, and in late June and early July during the New South Wales floods that displaced more than 85,000 people. First responders and emergency management agencies deployed Genasys software evacuation resources during 12 wildfires in June alone in Northern California.\n\nDuring these fires, more than 250,000 new users access the Genasys Zonehaven community website for real-time evacuation alerts and repopulation notification. During the ongoing McKinney fire near the California-Oregon border, the performance of the Zonehaven AWARE platform has been exceptional. Users have access to site more than 400,000 times for updated fire evacuation and repopulation information. Many California counties made Zonehaven a key element in their 2022 emergency preparedness campaigns, encouraging residents to memorize their zone numbers and bookmark the Zonehaven community website for faster access to vital information throughout wildfires and other public safety threats.\n\nFor the second time this year, Laguna Beach emergency personnel activated the city's Genasys Integrated Mass Notification system to alert residents and broadcast evacuation warnings during the May 11 coastal fire. The coastal fire burned just south of Laguna Beach, destroying 20 homes and damaging 12 others in neighboring Laguna Niguel. Two weeks after the coastal fire, the Laguna Beach City Council discussed the further expansions of the city's outdoor warning systems. Berkeley, California selected the first five installation sites for the city's Genasys emergency warning network that was announced earlier this year.\n\n10 additional sites will also be selected for the system that will alert residents to fires, earthquakes, tsunamis and other life safety hazards like broadcasting audible, hyperlocal warnings and notification. Under our contract with Alameda County, Berkeley first responders and residents have access to the Zonehaven evacuation resources. Nine-month revenues for mass notification hardware integrated with GEM Software increased 425% to $8.4 million, compared to $1.6 million in the first nine months of fiscal 2021. We received new SaaS contracts from cities, counties, universities and enterprise software customers in 12 states, which include our first contracts in Colorado, Georgia, Indiana, Oklahoma, Oregon and New York.\n\nGenasys has replaced competitive software service in most all of our SaaS contracts to date. Genasys software and integrated mass notification systems are now helping safeguard millions of people in several countries and 20 states. SaaS revenue has nearly doubled year over year and SaaS bookings in the first nine months increased 27% over the same period last year, reflecting the growing momentum of our GEM and Zonehaven solution. GEM and Zonehaven are providing excellent cross-selling and up-selling opportunities as we expand our critical communication and public safety resources in North America and throughout the world.\n\nLast year, we made the strategic decision to invest globally in our SaaS critical communication platform in response to the large and growing opportunity to help keep people safe in a world that is becoming increasingly dangerous. We continue to add personnel and other resources essential to executing our SaaS growth strategy. As we announced last week, the hiring of 25-year software veteran, Dennis Walsh, as our Chief Revenue Officer, is one of these important resources. Dennis' experience building and running successful SaaS technology companies makes him the ideal choice to serve as our CRO and lead our sales and marketing team.\n\nHe has built and led high-performing sales, marketing and support organizations, spearheaded sales for new SaaS business applications to many worldwide corporation and significantly increased revenues for companies in which he serve. We welcome Dennis and his extensive global experience driving software revenue growth. It's also important to note that the growth investments we are making continue to be funded by our operating activities, providing us the capital to fund our initiatives in the current economic environment. At an investor conference in June, I shared an updated long-term model for Genasys.\n\nWe expect the revenue drivers for the next few years will be: one, a macro backdrop that is increasing the need for critical communications; two, a growing pipeline for higher-margin software opportunities; three, the Zonehaven greenfield opportunity in the United States and internationally, and four, the synergies of our software solutions and our hardware systems. In addition to these drivers, this week's announcement of a commercial security order from a global enterprise company is one of several business opportunities we are working in this sector. Government and enterprises are acutely aware of the escalating security risk to employees, citizens critical infrastructure facilities. Additional commercial and critical infrastructure security orders are expected this quarter and next fiscal year.\n\nAfter a 425% increase in year-over-year revenues for the first nine months, the outlook for our GEM Integrated Mass Notification system is extremely positive. Beyond installations currently underway in the city of Berkeley, Southern Marin County, Puerto Rico, Japan and other locations, multiple IMNS projects are in the pipeline with several anticipated to close in coming quarters. As reflected by our recent GEM, our partnership with the Boston Red Sox, SaaS orders and pipeline growth are expected to accelerate through the end of the fiscal year and beyond. We are continuing to replace competitors offerings by providing superior comprehensive life-saving services for governments, commercial enterprise and other entities.\n\nBased on our $30 million quarter end backlog and supported by a rapidly growing business pipeline, we are well-positioned for a sixth year of revenue growth. With that, I'll now turn it over to Dennis, and he'll detail the fiscal third quarter and nine months financial results. Dennis?\n\nDennis Klahn -- Chief Financial Officer\n\nThank you, Richard. Revenues for the fiscal 2022 third quarter were $14.2 million, up 12% from the prior year quarter. The revenue increase was driven by the $3.9 million from IMNS shipments, up 756% from the prior year quarter. North American SaaS revenue in the third quarter was 144% greater than the fourth quarter of fiscal year 2021.\n\nGross margin was 46.5%, a decrease of 440 basis points compared to 50.9% in the third quarter of fiscal 2021. The lower gross margin percentage was largely due to higher cost of components in this year's quarter. We continue to expect gross margin to be plus or minus 50% for the full year, although there may be some fluctuations quarter to quarter. Operating expenses were $7.2 million, up from $5.9 million in the same period a year ago.\n\nThe increase was due to a 15% increase in SG&A related to strategic growth spending to accelerate SaaS revenue and a 52% increase in research and development spending with a significant increase in SaaS development. As a reminder, our fiscal 2022 business plan includes a year-over-year increase in operating expense for strategic growth initiatives targeted at materially shifting our revenue mix toward a higher proportion of software revenue and expanding our margins. Net loss for the quarter was $589,000 or $0.02 per share, a decrease from net income of $290,000 or $0.01 per share in the fiscal 2021 third quarter. The change was due to the increase in operating expenses, which I just discussed.\n\nAdjusted EBITDA for the fiscal 2022 third quarter was $364,000, compared with $1.4 million in the prior fiscal year third quarter. We believe this information and comparisons of adjusted EBITDA enhances the overall understanding and visibility of our business performance. To that effect, a reconciliation of our GAAP results to non-GAAP figures has been included in our financial results release. Turning to our year-to-date results.\n\nFor the first nine months of fiscal 2022, revenues were $38 million, up 19% from $32 million in the same period last year. Gross margin was 49.2%, up 100 basis points from the first nine months of fiscal 2021. Operating expenses were $21.4 million, up from $15 million in the same period last year, again, due to a 35% increase in SG&A, related to strategic growth spending to accelerate SaaS revenue and a 72% increase in research and development spending. Net loss for the first nine months was $2.4 million or $0.07 per diluted share, compared with a net loss of $67,000 or zero per share in the first nine months of fiscal 2021.\n\nThis decrease was due to the higher operating expenses, partially offset by higher revenues in the current year period. Adjusted EBITDA for the first nine months of fiscal 2022 was $805,000, compared with $2.3 million in the prior year period. Our balance sheet remains strong with cash, cash equivalents and marketable securities totaling $19 million as of June 30, 2022, compared to $20.7 million as of the prior year-end. Working capital totaled $17.6 million as of June 30, 2022, compared with $18 million as of September 30, 2021.\n\nCash used in operating activities for the first nine months of fiscal year 2022 was $600,000. This compares to cash provided by operating activities of $8.3 million in the same period last year. The fluctuation primarily reflects this year's higher net loss, a lower balance in customer deposits and higher inventory on hand compared with the same period last year. We expect the higher inventory balance to convert to revenue through customer shipments this fiscal year.\n\nThe company has an authorized share buyback program to repurchase shares negated up to $5 million through December 31, 2022. During the three months ended June 30, 2022, no shares were repurchased. Fiscal year to date, 259,310 shares were repurchased for approximately $1 million. We may from time to time as market conditions warrant, repurchase shares in open market transactions.\n\nHowever, investing in our business for future growth remains our primary objective for the allocation of our capital. The $1.7 million change in our cash position from $20.7 million at the end of last fiscal year to $19 million as of June 30, 2022, is largely attributable to share repurchases. This affirms the strong underlying cash engine that is supporting the strategic investments we are making to fuel our next phase of growth. We will now open the call for Q&A.\n\nOperator\n\nThank you. [Operator instructions] And our first question comes from Brian Colley from Stephens. Please go ahead.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nHi, guys. Thanks for taking my questions. So apologies if I missed it, but did you disclose the -- what the software revenue was for the quarter?\n\nRichard Danforth -- Chief Executive Officer\n\nWe did not.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nOK.\n\nRichard Danforth -- Chief Executive Officer\n\nNot in total. Did we?\n\nDennis Klahn -- Chief Financial Officer\n\nNo. I mean in total, it will be disclosed in the 10-Q, and I believe that it's a little over $700,000 for the quarter. Now that's a mix of -- it has grown. It's a mix that has changed year over year.\n\nLast year had a fair amount of professional services involved. However, this year, the SaaS-based recurring revenue has grown essentially enough to offset all the reduction in professional services.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nGot it. OK. That's helpful. Thank you.\n\nAnd then I also wanted to ask just about recent demand trends as it relates to weaker economic backdrop. I presume you're relatively well insulated given the nature of your products and customer base being in government and SLED verticals. But have you seen any softening in demand for either hardware or software related to recent macro uncertainty, whether it's lengthening sales cycles or more budget scrutiny?\n\nRichard Danforth -- Chief Executive Officer\n\nNo, Brian. Quite the opposite when it comes to the SaaS offerings. The amount of activity has ramped up substantially in the last three months for us. So that's very good.\n\nFrom a hardware perspective, you're right, we're somewhat insulated from the economics of the inflation and that kind of thing. And given what's going on in the world, there is an increasing demand for our software, our hardware and our system solutions. So right now, the answer to your question is no, we don't see an impact from it.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nUnderstood. Well, that's encouraging to hear. Lastly, I wanted to ask about the new Chief Revenue Officer, Dennis Walsh. I know he's still brand new to the job, but can you talk about any early strategy or view on his plans to expand your software business and what that might entail?\n\nRichard Danforth -- Chief Executive Officer\n\nHe's been here a week and two days. So we're going to give them a little more time to lay that out, but you can rest assured that that's in process, and we'll talk about that when it's more complete.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nGot it. OK. If I could sneak one last question in here. I'm curious how much you all are leveraging channel partners today for your software business? And if expanding your channel ecosystem is an opportunity that you're actively pursuing?\n\nRichard Danforth -- Chief Executive Officer\n\nIt is. We have one channel partner, I think, at this time, Brian. So it's not been tapped into hugely yet. Most of our software sales are direct.\n\nBut certainly, as we expand, particularly outside the United States, it'll likely been much higher use of channel partners.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nOK. Got it. Well, I appreciate the time, guys.\n\nRichard Danforth -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd next, we'll take a question from Ed Woo from Ascendiant Capital. Please go ahead.\n\nEd Woo -- Ascendiant Capital Markets -- Analyst\n\nYeah. Congratulations on the quarter. In terms of supply chain and inflation, it looks like it impacted the quarter. What is your visibility? Is it getting better? And what's your visibility into the next six months?\n\nRichard Danforth -- Chief Executive Officer\n\nThe supply chain from an availability is, as I said last quarter, is manageable, and we have been managing it. We have seen an increase in pricing that's reflected in a slightly lower gross margin for the quarter, although the gross margin for the nine months is actually ahead of where we were last year. So I think I'd put that in the same category, we are managing that. We expect our gross margin to -- as we historically have to be plus or minus 50%.\n\nAnd again, the supply chain we have delivered record revenues over three years with the supply chain challenges, and I think that will continue.\n\nEd Woo -- Ascendiant Capital Markets -- Analyst\n\nGreat. Well, thanks for answering my questions, and I wish you guys good luck. Thank you.\n\nRichard Danforth -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. And our next question comes from Mike Latimore from Northland Capital. Please go ahead.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nHi. I'm Vivek on for Mike Latimore. My first question is, what percent of bookings was software in the quarter?\n\nRichard Danforth -- Chief Executive Officer\n\nWe don't disclose that yet. That will be something we'll likely do as we enter our next fiscal year.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nOK then. So can you just tell me how many salespeople do you have?\n\nRichard Danforth -- Chief Executive Officer\n\nThe number grows every day almost. So I don't know what the number is right or talking to, but we can get that and get it over to you.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nOK. Any approximate numbers?\n\nRichard Danforth -- Chief Executive Officer\n\nFor the United States, it's 20.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nOK. So did Slovenia go live in July? So how is that operating? Any color on that?\n\nRichard Danforth -- Chief Executive Officer\n\nYeah, sure. It went live on schedule in July, and it's operating as we speak today.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nCool. My last question is that do you have any European deals in the pipeline for this calendar year?\n\nRichard Danforth -- Chief Executive Officer\n\nYes.\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nOK. That's it from me. Thanks for answering.\n\nRichard Danforth -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\n[Operator instructions] And next, we'll go to Kris Tuttle from SoundView Capital. Please go ahead.\n\nKris Tuttle -- SoundView Capital -- Analyst\n\nOK. Thank you. Yeah, I just had a couple on the newer business, the deal that you announced with the Red Sox, did they have any kind of existing system in place? And in general, do you find that sports teams and large arenas have something already in place? Or is it more of a greenfield opportunity for you?\n\nRichard Danforth -- Chief Executive Officer\n\nIt's both. The case of the Red Sox, it was an incumbent that we took out. There's been other sports arena, sports stadiums that we've won where there hasn't been an incumbent, but it does go, Kris, to any place a large gathering of people will be has a need for the GEM platform. We've sold it out of the Red Sox, the Green Bay Packers, to MetLife and there's others in the pipeline.\n\nKris Tuttle -- SoundView Capital -- Analyst\n\nOK. And one other question, just related to the historical, the LRAD business, I mean you guys announced a, I think, like a $15 million-ish order with the Army. What's the time frame for delivery of that kind of order?\n\nRichard Danforth -- Chief Executive Officer\n\nThere'll be some in our Q4 and the balance in our fiscal '23.\n\nKris Tuttle -- SoundView Capital -- Analyst\n\nOK. So like next 12 to 16 months, something like that, it will be fulfilled?\n\nRichard Danforth -- Chief Executive Officer\n\nIt's likely in the next 12 months.\n\nKris Tuttle -- SoundView Capital -- Analyst\n\nOK. And can you give -- I mean, what's your -- at least qualitatively, looking at the branches of the service and the installed base of the older LRAD systems. Does this represent sort of like the Army will be fully upgraded with their older systems? Or in general, like there's a lot more to go in terms of the upgrade opportunity for the LRAD?\n\nRichard Danforth -- Chief Executive Officer\n\nIn the current program of record, Kris, is not a replacement of previously purchased LRAD products. It has three very specific use cases and we continue to deliver on those use cases as we cultivate new use cases for the United States Army and other armies around the world. But I think the United States Army will continue for a long time to be a very good customer of Genasys.\n\nKris Tuttle -- SoundView Capital -- Analyst\n\nOK. And then I had one last question just on the demand for these kind of emergency response systems. I have been told that in particular, state and local municipalities in more rural states have radios, police radios that are designed more to function outdoors than indoors, and that has led to some communication issues inside large buildings like schools. And I'm just wondering, have you all seen an increase in demand or any sign of demand from those kind of municipalities looking to change out their older radio systems that are more designed for outdoor use than indoor use?\n\nRichard Danforth -- Chief Executive Officer\n\nWe have -- I mean, I mentioned GEM, the demand for GEM ramping up quite a bit. And that's across state and local governments, that's across colleges and universities and large enterprises. So the GEM platform can put geo-specific messages to your phone to your desktop to your laptop to digital signs to a radio to TV, an HF radio is just one channel. And with the GEM platform, we can use the HF radios or many of the other channels like I just mentioned.\n\nKris Tuttle -- SoundView Capital -- Analyst\n\nOK. Got it. All right. Well, thanks very much, guys.\n\nAppreciate it.\n\nRichard Danforth -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. And we'll take another question from Brian Colley from Stephens. Please go ahead.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nHey, thanks for taking my follow-up. I was curious if you could provide an update on public warning activity in the EU. Everbridge mentioned earlier this week that there were 12 different countries with RFPs and RFIs out there right now. Are there any countries you feel particularly strongly about your ability to win.\n\nI'm curious if that market is still seeing highly competitive pricing.\n\nRichard Danforth -- Chief Executive Officer\n\nIt certainly is with respect to cell broadcast. Europe is in the month of August and not a lot happens in the month of August, but there are countries and network providers that they are active RFIs and RFPs. And as I said earlier, I believe, Brian, some of those will close before the end of this calendar year.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nOK. Got it. And then on the software side, it seems like most of the growth that you're pursuing is with new customers. I'm curious if upselling existing customers --\n\nRichard Danforth -- Chief Executive Officer\n\nNo, that's not -- yeah, I'm sorry to interrupt you, Brian, but the software -- the SaaS we're selling, the GEM SaaS we're selling is almost always replacing an incumbent. In the case of the Zonehaven software, there is no incumbent. So that's always going to be new. Frequently, it is the same people that are buying GEM.\n\nSo there's no incumbent to replace with Zonehaven. There certainly is with GEM. And I will say it again, almost always we're replacing the company.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nGot it. Yeah. I guess I meant more so you're adding new customers, whether it's you're replacing an incumbent or not. They're new customers to you.\n\nI'm curious if kind of upselling your existing customer base that is your software customer base, additional solutions represents a meaningful growth driver as well. Do GEM and Zonehaven have enough add-on functionality to make upselling kind of a key priority there?\n\nRichard Danforth -- Chief Executive Officer\n\nIt certainly does. So it actually goes three different ways, Brian. So GEM is pulling Zonehaven. Zonehaven is pulling GEM and the integrated mass notification system is pulling both of them.\n\nThere are several counties and communities in the United States that have been a GEM customer that have upsold Zonehaven and vice versa. And where we've had integrated mass notification systems, selling them the GEM communication platform, as well as the Zonehaven software is showing great promise.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nOK. That's encouraging. And then lastly, just as it relates to the international expansion opportunity at Zonehaven, when -- are you already kind of pursuing that opportunity today? Are you kind of going after other states in the U.S. first? And if the latter is the case, I'm curious when you might start to pursue the international opportunity with Zonehaven.\n\nRichard Danforth -- Chief Executive Officer\n\nWe will begin first in Europe and plans are underway now.\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nOK. Got it. Well, I'll leave it at that. Thank you for the time today.\n\nRichard Danforth -- Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] And there appear to be no further questions at this time. I'd like to turn the floor back over to Dennis Klahn for closing remarks.\n\nDennis Klahn -- Chief Financial Officer\n\nThank you. We regularly discuss our business at investor events during the year, and you are invited to join us for these events. We are participating in the Windy City MicroCap Rodeo in Chicago on October 13, contact the event organizer to schedule a one-on-one meeting. We will also be at the LD Micro main event on October 25.\n\nYou can register for the conference and book a meeting through the LD Micro website. In mid-November, we are participating in the Stephens Annual Investment Conference. Contact your Stephen's representative for more information. Thank you for participating in today's call.\n\nWe look forward to speaking with you again later this year when we report our fourth quarter and fiscal year 2022 results.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKim Rogers -- Investor Relations\n\nRichard Danforth -- Chief Executive Officer\n\nDennis Klahn -- Chief Financial Officer\n\nBrian Colley -- Stephens Inc. -- Analyst\n\nEd Woo -- Ascendiant Capital Markets -- Analyst\n\nUnknown speaker -- Northland Capital Markets -- Analyst\n\nKris Tuttle -- SoundView Capital -- Analyst\n\nMore GNSS analysis\n\nAll earnings call transcripts"
}