{
  "companyName": "Goosehead Insurance, Inc.",
  "companyTicker": "GSHD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/goosehead-insurance-inc-gshd-q3-2022-earnings-call/",
  "content": "Goosehead Insurance, Inc. (GSHD -3.05%)\nQ3 2022 Earnings Call\nOct 26, 2022, 4:30 p.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the Goosehead Insurance third quarter 2020 earnings call. [Operator instructions] I would now like to turn the conference over to Dan Farrell, VP, capital markets.\n\nPlease go ahead.\n\nDan Farrell -- Vice President, Capital Markets\n\nThank you, and good afternoon. Before we begin our formal remarks, I need to remind everyone that part of our discussion today may include forward-looking statements, which are based on the expectations, estimates and projections of management as of today. Forward-looking statements in our discussion are subject to various assumptions, risks, uncertainties and other factors that are difficult to predict and which could cause the actual results to differ materially from those expressed or implied in the forward-looking statements. These statements are not guarantees of future performance, and therefore, undue reliance should not be placed upon them.\n\nWe refer all of you to our recent SEC filings for a more detailed discussion of the risks and uncertainties that could impact the future operating results and financial condition of Goosehead Insurance. We disclaim any intentions or obligations to update or revise any forward-looking statements, except to the extent required by applicable law. I would also like to point out that during this call, we will discuss certain financial measures that are not prepared in accordance with GAAP. Management uses these non-GAAP financial measures when planning, monitoring and evaluating our performance.\n\nWe consider these non-GAAP financial measures to be useful metrics for management and investors to facilitate operating performance comparisons from period to period by excluding potential differences caused by various variations in capital structure, tax position, depreciation, amortization and certain other items that we believe are not representative of our core business. For more information regarding the use of non-GAAP financial measures, including reconciliations of these measures to the most comparable GAAP financial measures, we refer you to today's earnings release. In addition, this call is being webcast. An archived version will be available shortly after the call ends on the Investor Relations portion of the company's website at www.gooseheadinsurance.com.\n\nWith that, I'd like to turn the call over to our CEO, Mark Jones.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nThanks, Dan. And welcome, everyone, to our third quarter call. I will provide a strategic overview following which Mark Miller will cover our operating results and Mark Jones Jr. will review our financials.\n\nWe just passed the 19th anniversary of the founding of our company, and we continue to refine our business model every day. When we started the company, we set the goal of becoming the No. 1 distributor of personal line insurance in the United States during my lifetime, and we remain committed to doing what it takes to get there. I feel very fortunate to serve the team that is building one of the best businesses on the planet with a $390 billion market, very weak competitors in the personal line space, incredibly resilient, recession-resistant underlying market demand for the product.\n\nBasically, if you live somewhere or drive something, you have to buy our product. Then lastly, extremely attractive margin and cash flow potential, particularly after 19 years and accumulating over 700,000 clients. We remain true to the principle we were founded upon, which is to place the client at the center of our universe and to build the business around them, bringing extraordinary human capital and technology to bear to create an unmatched insurance experience. Our core business, which is our corporate agency and our franchise network, remained strong, and we continue to invest in strengthening them.\n\nThis business has a powerful and growing competitive moat protecting it, and we have no meaningful competitors who operate at scale with a choice model. We're not arrogant to believe that we'll never face competitive threats in our core business, but we believe that creating viable competition will take a very long time, cost a great deal of money and be exceptionally difficult. Our digital agent represents a potentially extraordinary growth opportunity with different competitive dynamics than those in our core business. We have a substantial competitive lead with our technology, but we constantly operate as if new industry entrants are investing to duplicate what we have built.\n\nRemember that our carrier partners entrust us to legally bind them to provide coverage and ultimately pay claims. This is a privilege we have earned over many years and millions of transactions. A crucial element of our competitive moat, particularly as it relates to the digital agent is our relationships with insurance carriers and the track record we've built over the last two decades of writing high volumes of high-quality, profitable business. It will be very challenging and take time for competitors to earn the trust of insurance carriers sufficient to convince them to hand over the responsibility to commit them to paying claims.\n\nThat being the case, we need to invest and work very hard to build our quote-to-issue capability as soon as possible to protect our competitive position. Our recently announced addition of Justin Ricketts as executive vice president of technology and partnerships is designed to help do just that. Justin has an internal team of more than 40 people whose mission it is to extend our technology lead and deepen and widen our competitive moat. The U.S.\n\nhousing market represents a headwind for Goosehead, but not nearly to the extent that some assume. And it is a headwind we're actively responding to based on our experience managing through the housing downturn during the great financial crisis of 2008, 2009. Only about 20% of our revenue is exposed to the housing market from transactions tied to home closings. The remaining 80% comes from referrals and renewal business.\n\nRegarding the 20% of our revenue connected to housing, we currently represent only about 3% of home closings per year. So we still have huge market share to gain and are not dependent on overall housing market transaction growth. Our referral partner search tool technology allows us to pivot to add new referral partners when volumes soften with existing ones. We're seeing this phenomenon play out every day with our agents.\n\nWe're ramping up activity to generate new business via client referrals and our digital marketing team consistently generates leads from current and former clients that are turning into meaningful revenue. While higher than normal underwriting losses have plagued many of our carrier partners this year, most have been successful at increasing premiums. Whenever this happens, we get a pay raise because we earn a commission as a percentage of those premiums. This is creating a tailwind for us in 2022 and beyond, and we hope that higher policy pricing drive better industry profitability and more normalized contingent commission levels looking further out.\n\nWhile housing market headwinds impact about 20% of our revenue base, the premium pricing tailwinds benefit 100% of our book of business. 2022 has been a transition year for us. Over the last two years, many of our corporate agents were onboarded and received training in a virtual environment. Some of these agents did not ramp up as quickly as those who went through in-person training, which negatively impacted the profitability of our corporate channel.\n\nNow that we're in a post-pandemic environment, training is largely conducted in person and we are managing out our less productive agents more aggressively. Our business is strengthened by moving out weak performers to consume valuable management resources but contribute only negligible revenue. Management investment can be best placed where it will drive attractive returns. In 2022, we made it a priority to launch more agencies at a faster pace and have seen good progress to date with our backlog declining from 1,030 agencies earlier this year to 884 at the end of Q3.\n\nWe've also sharpened our pencils on the optimal use of our resources to drive growth that is profitable and sustainable. This includes a recalibration of the relative roles that corporate and franchise channels play in our strategy. In simple terms, the cost structure for corporate is extensive and new producers take time to become profitable. While a healthy profitable corporate business is central to our strategy, our franchise network is the primary driver of our growth now accounting for more than three quarters of premiums.\n\nThe cost to add new producers and franchise is nominal and every dollar of new revenue they generate comes with higher incremental margins. We continue to leverage the full capabilities of what we've built over the years but in ways that optimize profitability without sacrificing growth. Examples of this include utilizing the amazing recruiting machine we've built to help franchisees add producers to their agencies and creating a much larger aperture for highly capable corporate agents to become franchisees and build their own business. After launching the initiative just a few months ago to help our franchisees recruit producers, we expect to have helped place more than 30 producers with agency partners by year-end.\n\nSo far this year, nine corporate agents have become franchisees, with six of them being among our top 10 new agencies for productivity. That's out of almost 400 agencies launched so far. Just one specific example is Wren Mcfadden, who after spending three years in corporate launched this franchise this summer in Denver. Wren was the second most productive franchise agent in our entire Mountain region in just his first month live.\n\nWe're extremely encouraged by the opportunity we have to seed outstanding franchisees from corporate. The franchise opportunity also significantly strengthens our on-campus recruiting value proposition. Our optimized plan is to thoughtfully and profitably grow corporate over time, albeit not as rapidly as we grow our franchise business. We believe we can continue to attract very strong talent to our corporate business and provide great career opportunities, whether that be to remain in corporate or become a franchisee.\n\nBut we believe that earnings will be stronger and capital will be most productively deployed by investing differentially in the franchise business. Finally, we continue to work hard to strengthen our management capabilities so that we have the right people and skill sets to scale Goosehead from a middle market to a large company. As Goosehead's largest shareholder and the person with the most to lose if we get things wrong, and as someone with an intimate understanding of Goosehead's needs, I'm highly confident the moves we are making are the right ones to drive long-term shareholder value. So far, our efforts are beginning to pay off as revenues in Q3 climbed 38% year over year, and we delivered $11 million of adjusted EBITDA at a 19% margin, representing 320 basis points of margin expansion from 2021.\n\nEven in an environment of economic uncertainty, our business remains very strong, and we're more confident than ever that we're building one of the great American business success stories. With that, I'll turn it over to Mark Miller to discuss our business results.\n\nMark Miller -- President and Chief Operating Officer\n\nThanks, Mark, and good afternoon, everyone. When I started four months ago, Mark Jones and I agreed on a list of priorities, and I'm excited to report that we're making excellent progress against each of them. We're currently focused on enhancing service levels for our clients, building a healthy franchise business, optimizing productivity of corporate agents, opening new growth opportunities through technology innovation and partnerships and building the people, processes and systems that are prepared to operate at a much larger scale. Like most companies in the U.S., the great resignation had some impact on our service organization earlier this year but we responded quickly by mobilizing our recruiting and training teams to staff open positions.\n\nAs of now, we have reached the optimal service headcount to meet demand and where we have seen significant improvement in key service metrics, such as average wait times. At the same time, we're also continuously implementing new processes and technology to provide a more seamless customer experience. Our scheduled callback program is a great example of this type of innovation. We believe that this laser focus on service will ultimately drive even higher NPS and retention rates.\n\nThese changes are in turn, improving employee satisfaction, reducing employee attrition and driving cost efficiency. The foundation to growing any recurring revenue business is customer retention. We currently achieve what we believe to be industry-leading customer retention through our world-class service organization that delivers an unmatched customer experience as evidenced by our 90 NPS score. The continued investments and improvements in this area will position us to sustain sizable future growth.\n\nTurning to the efforts to build a healthy franchise business. We have been focused on improving franchise launches and compressing the time between signing and launch. I'm extremely encouraged with the underlying trends we're seeing. During the quarter, we launched 144 franchises, up 57% year over year and a new company record.\n\nIn addition, our signings remain strong, and our pipeline is substantial. The quality of our signed pipeline continues to improve, and we're seeing faster launch rates. This is a direct result of changes we implemented in our recruiting and onboarding processes and the adjustments to the compensation model of our recruiting team. During COVID, we delayed culling of underperforming franchises.\n\nWe have now returned to our historic process of eliminating low production franchises that put a drag on our overall system. This culling is offsetting some of the strong trends we're seeing in net franchise sales and launches. Just to be clear, these terminated franchise account for less than 1% of our new business production, but they absorb a disproportionate amount of valuable operating bandwidth. Additionally, we are increasing our focus on converting strong corporate agents to franchise owners.\n\nHistorically, very few corporate agents have converted to franchise ownership. However, corporate agents that flip over to franchise ownership are overwhelmingly successful. Typically, their first year of production is in the top 5% of all franchises launched and the overwhelming majority are successful. Expanding this effort over time will create long-term career paths for our best corporate agents and be highly accretive to Goosehead.\n\nMoving on to how we're optimizing productivity of corporate agents. During the quarter, we deliberately reduced our corporate agent headcount by 18% to focus on increasing productivity and eliminating the P&L drag caused by underperforming agents. This initiative has already started to deliver improvement in productivity per agent, particularly in the less than one-year cohort. With this near-term slowdown in corporate headcount, we see an opportunity to strengthen the team and become substantially more efficient with minimal impact to our overall company top-line premium growth.\n\nThis improvement will further establish our corporate agency as the gold standard of performance in the industry and the best practice model for our rapidly growing franchise business. Over time, the corporate agency new business production has become less and less of a driver of our overall revenue growth. We believe the best way to expand our footprint rapidly and efficiently across the U.S. is with a finely tuned corporate agency that feeds the franchise network with technology innovation and highly skilled talent.\n\nAs we optimize the corporate business, we will add headcount only to the extent it supports the expansion of the franchise business. Moderating head count growth in the corporate agency does not mean we intend to slow overall corporate and franchise producer count combined. Earlier this year, we piloted our program where our recruiting team identified top producer talent for scaling franchises. This program was overwhelmingly received in the pilot, and we are expanding the service to the roughly 200 franchises in our network that are in a high-growth phase of their business development.\n\nWe believe this will result in significant total producer additions to our franchise business over the next year. And the number of franchises that are scaling their operations will continue to grow as our franchise business matures. We currently have over 700 franchises that are less than two years old. So this is a service our franchise organization will leverage for years to come.\n\nWe have approximately 1,000 professionally trained and licensed sales and service agents in our corporate operations and over 2,000 franchise agents across our 1,400-plus franchises. This total number of agents will continue to grow meaningfully to serve our client needs and drive us toward our long-term goal of industry leadership. Our proprietary platform is unmatched in the industry, and we are focused on leveraging this advantage through further technology innovation and development of partnerships. We recently launched our new agent-facing rater, we call it Aviator.\n\nThis allows agents to more seamlessly and efficiently quote across products and carriers to determine the best package of coverage. We also are continuing to make progress on our QTI capabilities. We currently have one carrier on quote to issue and are in various stages of development with several of our other national, regional and new digital carriers. We expect a meaningful portion of our premium base will be QTI-enabled over time.\n\nI couldn't be more excited with the company's current position and the priorities we are focusing on to position the company for its next phase of substantial growth. Our market opportunity is enormous. We remain hyper focused on driving revenue growth while continuously hardening our operating processes to scale efficiently to meet these enormous market opportunities. We believe that executing against these strategic priorities will allow us to grow our core business premiums at 30% to 35% annually over the next several years with potential upside to this through partnerships and to drive EBITDA margin well into the mid- to high 20s over the same time period.\n\nWith that, let me turn it over to our CFO, Mark Jones Jr.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nThank you, Mark, and hello to everybody on the call. Our strong results this quarter in a difficult personal lines marketplace and challenging macro environment demonstrate the inherent strength and consistency of our business and the uniqueness of our operating platform. Insurance is a necessary product for the vast majority of the population regardless of the challenges of P&C underwriters and overall economic uncertainty. As a scale independent agency with industry-leading proprietary technology, we provide a seamless choice shopping experience and valued advice which cannot be matched by a single product platform.\n\nThe advantages of our model for clients to become even more evident in times of industry and macroeconomic stress. We are best positioned to optimize the client's outcomes as carriers raise pricing to address underwriting profitability, helping them maximize their buying power in an increasingly challenging home buying process and manage the experience through loss events as a trusted advocate. We are in an incredibly favorable position in the personal lines insurance value chain. We benefit from our close proximity to the client relationship.\n\nAs in most businesses, those with the closest relationship to the end client tend to control or significantly influence the profit pools. Our ability to provide the client with a choice platform they need and the highest level of service creates the opportunity for excess economics. As a broker, we do not carry the balance sheet risk that carriers do and in fact, in a rising premium environment, we get a raise in our entire book of business. Our emphasis on expanding the franchise distribution significantly reduces the potential downside risk of fast expansion as we bear significantly less cost to ramp the producer talent.\n\nThis allows us to optimize earnings while minimizing risk. These characteristics will allow us to drive consistent high levels of revenue and earnings growth with significant cash flow conversion and limited balance sheet risk for many years to come. For the third quarter of 2022, total written premiums, the key leading indicator of future core and ancillary revenue growth, increased 42% to $616 million. This included franchise premium growth of 46% to $464 million and corporate premium growth of 30% to $151 million.\n\nThis growth is being driven by continued strong performance of our renewal book from high retention levels and increasing P&C pricing needed to improve underwriting profitability. Additionally, we continue to add and improve the quality of our franchise producer account. These benefits were partially offset by our deliberate near-term reduction in corporate agent headcount to drive productivity improvements, increased efficiency and maximize long-term profit dollars. We are already seeing benefits from these efforts emerge.\n\nTotal revenues and core revenues were up 38% and 39% for the quarter at $57.7 million and $51.9 million, respectively. Our cost recovery revenue of $3.4 million was up 73% as accounting rules require us to defer the recognition of initial franchise fees over the term of the franchise agreement. Terminating an underperforming agency results in the acceleration of the remaining deferred franchise fee revenue. Importantly, the cash flow of these initial franchise fees is unchanged as we collect these revenues at the launch of the franchise.\n\nAncillary revenue, which includes contingent commissions, was $2.4 million in the quarter, compared to $2.5 million a year ago. We continue to expect contingent commissions for the full year to range between $7 million and $10 million, given current underwriter profitability. However, we are seeing long overdue rate actions in the industry that over time should improve underwriting profitability and lead to a more normalized contingent level looking further out. Our franchises generated core revenue of $26.4 million during the quarter, an increase of 54% from the year-ago period.\n\nFranchise core revenue growth is driven by new business production from a growing franchise count and increasing premium retention levels. At the end of the third quarter, operating franchise count was $1,403, up 23% from a year ago. Increased culling of underperforming franchises is masking the strength of the underlying KPIs in the franchise distribution. In the third quarter, we saw a 57% launch growth year over year, compared to 31% in the second quarter and roughly flat launch growth over the preceding three quarters.\n\nThe 144 launches in the quarter was a record for us as we begin to see the existing backlog launch or terminate. Our early fourth quarter franchise KPI data continues to trend well as we expect strong launch growth through the balance of the year. We remain encouraged by the increased contribution in revenue from our tenured franchisees as they continue to ramp up their production and hire new sales agents within their respective franchises, driving positive same-store sales. This is being offset in the near term by a higher return of franchises, which ran at 25% annualized in the quarter, compared to 21% in the second quarter at a roughly 15% historical average.\n\nWe expect higher churn in the near term as we make up for high single-digit churn that we allowed through most of the pandemic. Our most successful franchises continue to drive higher percentages of premium growth. It remains critical that we focus our investments toward these most successful franchises, part of ensuring that focus requires a valuation of our lowest performing franchises. We view the resulting near-term increase in churn as healthy and necessary to properly run a high-performing sales organization.\n\nAnd consistent with previous churn, it accounts for less than 1% of new business generation, but consumed substantial management resources. Our overall recruiting pool also remains strong and robust, and the quality of our signed but not yet launched franchises continues to improve as we actively engage our signed pipeline to drive faster overall launch activity and identify signed franchises that no longer intend to launch. Our signed but not launched franchise count at quarter end was 884, down from 997 in the second quarter and 1,030 in Q1 with strong signing activity offset by our efforts to cull the pipeline of franchises that we'll not launch. We expect higher launch rates to continue to emerge as the signed pool is increasingly comprised of more recent recruiting quarters, which took place in a more normal operating and labor environment compared to COVID years.\n\nCorporate sales head count at the end of the third quarter was 411, a decrease of 18% from the year-ago quarter. Corporate core revenues were $25.4 million in the third quarter, an increase of 27% compared to the year-ago period. Looking forward, we expect to manage corporate headcount to optimize the balance between growth and profitability with focus on maintaining adequate resources for the franchise effort while also improving overall corporate productivity and management efficiency. Given these efforts, we expect corporate head count to be slightly down from the third quarter by year-end.\n\nLonger term, we expect to grow the corporate distribution. However, it will not grow as fast as the franchise network, but will at the level needed to support franchise growth. Given that revenues produced through the franchise network are accounted for on a net basis, these changes may moderately impact our revenue growth near term, but they will significantly improve our margin profile and earnings growth trajectory. Total operating expenses for the third quarter of 2022, excluding equity-based compensation, were $46.7 million, up 33% from a year ago.\n\nCompensation and benefits, excluding equity-based compensation, was $30.9 million for the quarter, up 28% from the year-ago period. The increase in compensation and benefits is being driven by increased headcount across the organization, particularly the hiring of service agents to manage our largest revenue stream renewals, recruiting and onboarding functions to continue our growth trajectory and system developers to ensure our technology is on the cutting edge for our clients and internal users. G&A expenses for the quarter were $13.5 million, an increase of 33% from a year ago. Growth in G&A expense was due to an expanding real estate footprint, higher travel and entertainment expense, marketing expenses and other various expenses resulting from increased headcount of 19%.\n\nOur bad debt expense was $2.3 million, compared to $0.7 million a year ago, with the increase largely driven by our increased culling of signed franchises that have yet to launch. Total adjusted EBITDA for the quarter grew 67% to $11 million, compared to $6.6 million in the year-ago period. EBITDA margin was 19% versus 16% a year ago. Excluding contingent commissions, EBITDA margin expanded six points in the quarter.\n\nAdjusted EPS was $0.24 versus $0.26 in the year-ago period. We continue to expect our full year margins will be up compared to a year ago. Looking beyond 2022, we expect to drive annual margin expansion, excluding contingents for the next several years as we manage core revenue growth moderately higher than expense growth on an annual basis. As of September 30, 2022, the company had cash and cash equivalents of $46.1 million.\n\nWe had an unused line of credit of $24.8 million at quarter end. Total outstanding term note payable balance was $95.6 million at the end of the quarter. During October we paid down the $25 million drawn on the revolving credit facility with existing cash on the balance sheet. For the full year 2022, our guidance is as follows; total written premiums placed for 2022 are expected to be between $2.176 billion and $2.215 billion, representing growth of 40% on the low end of the range and 42% on the high end of the range.\n\nTotal revenues for 2022 are expected to be between $194 million and $205 million, representing organic growth of 28% in the low end of the range to 35% on the high end of the range, driven by continued high levels of core revenue growth, offset by weaker than historical average contingent commissions as a result of carriers profitability challenges they are just recently addressing. As a reminder, the contingency plans restart each calendar year and a below-average contingency year does not equate to weaker bonuses in the future years. We continue to expect growth in EBITDA and EBITDA margin for the full year. However, lower-than-expected contingent commissions could result in more moderate EBITDA and margin than planned.\n\nWe do expect more significant growth in EBITDA and EBITDA margin when excluding the effects of contingent commissions. Our business is demonstrating strong revenue and earnings growth in the challenging environment. We look forward to continuing to deliver on the business through the remainder of the year and many years beyond. I want to thank everybody for their time.\n\nAnd with that, let's open the lineup for questions. Operator?\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] Our first question comes from Matt Carletti of JMP. Please go ahead.\n\nMatt Carletti -- JMP Securities -- Analyst\n\nHey. Thanks. Good afternoon. Mark, I want to go back to some of your opening comments.\n\nYou talked a bit about the housing market impacts and how the 20% of your revenues exposed to that, but also about the pricing environment and how, obviously, your entire book is exposed to that. I was hoping you can maybe make a more direct comparison between the two. I'm not looking for numbers, but just kind of as you see it qualitatively right now, is the pricing environment strong enough that you could see it offsetting kind of the impact from the housing market? Or is it kind of too difficult to call?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nAt this point, it's -- I think it's too difficult to call if I'm going to be sort of completely honest with you. We don't really know how much compression there's going to be in existing home sales over the next sort of two or three months. And so, we're trying to be cautious. I think, the important thing that we remember and that we keep our people focused on is this is a time where there's market turbulence and the way you win when there's market turbulence is you have a maniacal focus externally on your clients, on your referral partners and you add referral partners.\n\nAnd given that we're only about 3% of the real estate closings, or the home closings, in the country, we've got lots and lots of sort of white space in the market to pick up. So we're working with our agents, both our corporate agents and our franchise agents to increase their referral partner marketing activities. That doesn't happen overnight, but it does happen pretty damn fast. And also, maybe Mark Miller can just talk.\n\nHe's been out on the road and talked to lots of franchisees.\n\nMark Miller -- President and Chief Operating Officer\n\nYeah. Hey, Matt, how are you doing? I was just going to add, I think you know we were out on the road doing four big regional conferences with our franchise owners, and I sat down and talked to over 100 of them for sure. And just ask them what their questions and concerns were at this point. Macro headwinds were not one of the major concerns.\n\nAnd I think, they all know it's out there, but they are just leaning in much heavier. I mean, they know what they've got to do to bring in additional business. And so, they're really focused on getting more referral partners and generating extra leads.\n\nMatt Carletti -- JMP Securities -- Analyst\n\nGreat. Thank you very much. That's all I got. You did a great job of answering my other questions in the opening comments.\n\nSo thank you for the color and best of luck.\n\nMark Miller -- President and Chief Operating Officer\n\nThanks, Matt.\n\nOperator\n\nOur next question comes from Paul Newsome of Piper Sandler. Please go ahead.\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nGood afternoon. Thanks for the call. Maybe just one more one run off of this key new business issue. With the corporate agencies shrinking a little bit and other effects, it seems like folks on the negative side of the stock are very focused on this idea that ultimately, the new business piece, not the renewal piece and maybe even not the productivity piece will markedly slow.\n\nAnd if you could just kind of maybe focus just on that piece a little again. I know you talked about it already, but it just seems to be where I'm getting the most questions.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah, Paul, this is Mark, Jr. What I would say to that is we're not singularly focused on driving corporate agent headcount exactly. In fact, we've said specifically, we're going to focus on productivity with those agents. But what we do want to do is add to the total producer count between both corporate and franchise.\n\nSo we talked about this program to add producers into the franchise network, we talked about 30 this year. We are going to continue to do that on a go-forward basis. And what we've seen is those producers have been very successful. And like we responded to Matt, the housing market headwinds out there.\n\nOur agents are doing a really good job combating that with taking additional share from their referral partners, as well as cross-selling their existing book, working their canceled policy list. So our agents are doing a very good job of being agile and what is a challenging macro environment. But the fact is, is everybody has to have insurance regardless of whether you're in the middle of a housing transaction or not. We've got the inflationary environment right now where it's generating some additional shopping behavior, and that's an opportunity for us to take additional share in the marketplace.\n\nSo Paul, you might be interested in this as we talked about as we think about growing total producer headcount and the focus being in the franchise channel, I learned today that when an existing agency hires a producer, they produce on average one and two-thirds the production of a new franchise. So you think about that, if we add 200 franchise producers out in the field next year, that's the equivalent of adding about 320 new franchises. So we've learned some -- where there's real leverage, and we're applying that where we're going to get the biggest bang for buck.\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nMakes sense. This may be a little bit nitpicky, but I noticed that the lower range of the contingents in the guidance was down a little bit. Is there anything behind there? I apologize, it's a small number, but just curious if there's anything there that is worth noting.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah. I'm sure you've seen the macro P&C environment, carriers are having some real profitability challenges. I'm sure you saw some of the notes that have come out this week. There's some uncertainty in that environment of whether it's going to be in the top end or the bottom end of that range, we would expect probably at this point, it's closer to the bottom end of that range, just given the profitability with the carriers.\n\nIdeally, with the rate that they're taking right now and through next year, we'll start to see that normalize over the longer term, but that's where we're at right now.\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nAnd then, my last question, and I'll let somebody else ask wanted to ask about the elevated bad debt. I can understand where it's coming from, I think, but should we anticipate that that remains at an elevated level given what you're doing with corporate producer franchise as well? Or does that snap back to kind of a more normalized level?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah, I think, in the near term, you'll continue to see that be elevated as we work through the rest of that backlog. The age of that backlog has come down this year. So we're pleased with the progress that we're making. There's still some work to be done.\n\nSo you'll see that remain elevated in the near term and then over the intermediate to longer term, that would normalize back to historical levels.\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nThank you very much for the help. Really appreciate the call.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nThanks, Paul.\n\nOperator\n\nOur next question comes from Ryan Tunis of Autonomous Research. Please go ahead.\n\nRyan Tunis -- Autonomous Research -- Analyst\n\nYeah, good evening. In thinking about expenses and we've been reducing corporate, to what extent is the expense base that we're seeing this quarter indicative of all the action that was taken through Q? I'm just -- I'm trying to figure out what the right expense baseline might be headed into the fourth quarter.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah. So we've talked about growing core revenue faster than we're growing the expense base. That's probably how I would think about it in the fourth quarter. If you think about our corporate agent headcount in the third quarter, the average number will be higher than it was in the fourth quarter.\n\nSo that's how I would plan for the expense growth in the fourth quarter.\n\nOperator\n\nOur next question comes from Tommy McJoynt of KBW. Please go ahead.\n\nTommy McJoynt -- Keefe, Bruyette and Woods -- Analyst\n\nGuys, thanks for taking my questions. So I guess, continuing on the expense topic. So the employee compensation expense line increased about $5 million sequentially. I think, you called out a few hirings and other initiatives.\n\nWas there anything in there this quarter that was -- could be considered a one-timer? Or is that number more run ratable?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah. I think, Mark Miller talked about our service levels in the prepared remarks. We added a bunch of service headcount during the quarter to get those back up to the levels that we wanted them to be. I think, the level that you see it at here probably makes sense on a go-forward basis.\n\nYou won't see big increases from corporate agent headcount and the associated management overhead from that. But scaling the back office service, our onboarding teams is we're going to continue to add as many producers in a productive environment that we can, as well as our agency management team to help those franchises ramp up as successfully as possible. So I wouldn't say that there's anything necessarily onetime in the compensation from the quarter.\n\nMark Miller -- President and Chief Operating Officer\n\nYeah, this is Mark Miller. I would just say on Mark Jr.'s comments about service. Last quarter we talked about we needed to ramp up the service levels. We achieved that during the quarter.\n\nAnd so, we ended with close to 600 service agents. So that's what you're seeing come through. We are at the level that we need to be at right now, but we will need to take it up slightly as volume grows, but we can also start to dial things back with automation. So we're trying to find that perfect balance, but that's probably what some of the step-up in headcount cost is.\n\nTommy McJoynt -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Thanks. And then, actually, just going back to the housing question as well. So I understand that only about 20% of revenue is exposed to housing transaction volumes.\n\nBut is it fair to think that a sharper kind of slowdown in housing does weigh on growth since that new business compounds into renewal over time?\n\nMark Miller -- President and Chief Operating Officer\n\nYeah, I mean, that's just the arithmetic. What we are doing, I mean, we -- and we saw a very rough housing market in 2008, 2009. And at that time, what we said because we haven't seen anything like that in the history of our business. So we said, well, what are sort of analogous circumstances that we can learn from, and we looked at what happened during the dot-com bubble burst.\n\nAnd there were companies that were successful and companies that failed during that time, the ones that were successful were the ones that were very outwardly focused on their clients, on their markets, the ones that failed tend to be inwardly focused circling the wagons, and we pursued that strategy in 2008, 2009. We are pursuing that exact same strategy now. It works. That's not to say that there's no impact that we're going to see, but we're certainly powering through it in a way that I'm very proud of, and I'm very confident that we'll come out of this adjustment in the market with a very strong renewal book.\n\nAnd even if it's -- we weren't blowing away all our sales records, it's still going to be a very powerful renewal book going forward.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah, I would just add, we are still such a small piece of the market share. So that would be a really, really big concern if we had 40% market share, less than 3%. There's still plenty of white space even with a significant housing downturn. We just need to execute on our strategies, and we have confidence that we can do that.\n\nAnd I would just add on top of that, I think there are other ways to generate volume that we're -- that we haven't discussed yet, which we've been pretty aggressive on our digital marketing efforts, which have paid off very nicely. And so, cross-selling to the existing base, people that only have one policy line with us, picking up additional policies, going to customers that have canceled over time and going back to them are ways that we're generating incremental volume from the existing base.\n\nTommy McJoynt -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from Mark Hughes of Truist. Please go ahead.\n\nMark Hughes -- Truist Securities -- Analyst\n\nThank you. Good afternoon. I wonder if you could talk about the total franchise trend up 17% in the quarter. I think, you mentioned that you're more actively culling some of those ones that you don't anticipate will eventually go to operating status.\n\nBut then, I wonder if you could talk about that, those terminations or that culling versus the new sales, how it's adding up to 17% growth. And maybe just some sense of where that goes in coming quarters?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah. So we think about trying to secure all of our launches from the most recent pool of signing. So that backlog that's now at $884. The culling of that is where you're seeing the drag on the total franchise count growth as opposed to the operating agency count growth.\n\nWe are focused on driving total operating agencies that are going to go out there and sell insurance policies. So that up 23% in the quarter. That's net of some relatively aggressive culling to make sure we've got the healthiest system that we can. 57% increase in total agencies launched during the quarter with some strong Q4 trends.\n\nSo we're seeing really good things in the data there from an operating agency standpoint.\n\nMark Hughes -- Truist Securities -- Analyst\n\nAnd sorry, what was the 23% number you mentioned?\n\nMark Jones -- Chairman and Chief Executive Officer\n\n23% is the total operating agency's growth, 17% is the total franchise count growth if you include the backlog.\n\nMark Hughes -- Truist Securities -- Analyst\n\nYeah. Anything about new franchises sold when we think about the last couple of quarters versus the prior trend?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah. I think, they've been really encouraging trends. So a record this quarter, 144 franchises launch. That's a 57% increase over the prior-year Q3.\n\nWe've got strong initial Q4 trends. It's all going in the right direction there.\n\nMark Hughes -- Truist Securities -- Analyst\n\nUnderstood. And then, the attrition within the operating franchises, when do you think that you kind of get over the hump and that starts to slow down or normalize?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah, so we're running a little hotter than our historical average now. We've talked about during 2020 and 2021, that churn being below where we really needed it to be. So I would expect that for the near term to be still running a little hotter than the historical average of 15%. Over the intermediate to longer term, I would expect that to trend back down to the historical average.\n\nMark Hughes -- Truist Securities -- Analyst\n\nAnd then, a final question. The corporate headcount, Mark Jones Jr., did you make a comment about where you would -- did you say that might be down slightly by year-end from here? Did I hear that properly?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah, that's what we said in the prepared remarks. We are at 411 at the end of the quarter, the expectation is we'll be slightly down from that at the end of the year.\n\nMark Hughes -- Truist Securities -- Analyst\n\nThank you very much.\n\nOperator\n\nOur next question comes from Mark Dwelle of RBC Capital Markets. Please go ahead.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nGood evening. Back on the -- just to remain kind of on the expense topic. You've gone through a number of different things. I just want to make sure I kind of reiterate what I've heard there.\n\nI mean, it seems like a little over a year ago, a lot of money was spent to build out the corporate franchise corporate channel and add infrastructure and people there. So is what we're hearing today kind of just a refinement of that? Or are you planning to exit some of these locations, close down branches? Are there charges associated with all that process? Or is this just kind of allowing attrition? Or how is it actually being executed?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah, Mark, it's Mark Jones, Sr. Probably a year ago or so on one of the calls, I had indicated that we were seeing our absorptive capacity expand. It was kind of a different sort of operating environment with COVID and whatnot. And the truth is we overestimated and that's on me.\n\nI overestimated what our real absorptive capacity was. Once we got back to sort of a normal operating environment, we found ourselves with capacity that exceeded our sales management's ability to manage it. So what we had to do is we've got to get that that corporate agency sort of back to a level of attractive profitability. And in order to do that, we've got to take out the capacity that's losing us money.\n\nWe are in a situation where we're kind of rebuilding our management bench a little bit. But we don't anticipate -- we don't anticipate sort of any other like location consolidations or closings. We've done a little bit of office consolidation in Austin. We combined -- we had two offices there.\n\nWe put all the people together in one now, and that's actually proving very helpful. We had a small number of producers in Las Vegas. That's not a particularly attractive market, so we took them out. But all of our other locations, we continue to be committed to those locations and committed to the business there.\n\nWe just -- and so I don't anticipate that we're going to see sort of any big charges or anything like that coming through. It's just a matter of we've got to sort of finish the kind of the cleansing of that corporate organization because my eyes were bigger than my stomach.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nOK. That's helpful. So to maybe sum up that bit then in conjunction with one of the prior questions. As we look at the employee compensation expense line, I guess, the traffic in the quarter was, on the one hand, you've added to flesh out the ranks of the service staff.\n\nBut on the other hand, you've reduced some of the producer and presumably some support people staff associated with them. And that the net of that is the overall growth in the expense line or compensation expense on both a sequential and a year-over-year basis. Is that not the right way of interpreting that?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYep, that's fair.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nWas there any -- you've had some changes in the senior management rank recently. Were there any expenses in the quarter or to be anticipated associated with any of that?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nWell, there's a little bit of severance, but that is not material in and of itself. So a little bit, but not a lot.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nOK. And then, lastly, and maybe you already answered this is just already on the G&A side. There weren't any unique G&A-related expenses associated with either the staff up or the staff down as appropriate in the quarter?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nNo. We will, on a go-forward basis, continue to add service headcount in the areas where we think it makes the most sense. Right now, our San Antonio Service Center is a fantastic location for us. So we're taking additional space there to grow there.\n\nIt's a fantastic demographic for our service agents. They do a fantastic job. So we'll continue to see real estate footprint expansion there from a service perspective, nothing else from a corporate sales, real estate expansion expected in the near term.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nOK. And then, lastly, with respect to contingent commissions, were the -- were the rather large Ian losses in the quarter, something that you anticipate having a greater negative effect on the cumulative total for the year for this year's contingents? I know they don't necessarily carry on to next year. But have you -- any refinement to the calculation there relative to how we were thinking about it, say, previously.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nProbably not specifically related to Ian. Most of those contingency plans include caps for the catastrophic losses, but the losses have also been so tough for these personal lines carriers throughout the year that if you're already over the loss ratio percentage, the hurricane doesn't help you get there, but it also doesn't really hurt you if you're already not earning it. So like you mentioned, it's not -- it doesn't have any carryover impact into 2023, and we should hopefully see the pricing take hold over the next year or so, and we can get back to kind of historical average level of contingencies.\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nI think, those are all my question. Thank you.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nThanks, Mark.\n\nOperator\n\nOur next question comes from Pablo Singzon of J.P. Morgan. Please go ahead.\n\nPablo Singzon -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. So first question I had was the gap between year-on-year growth and policies in forests and return premiums has been increasing over the past several quarters. Is that gap a fair representation of the benefit of pricing and I guess, perhaps exposure? And do you think that gap widens further in 2023? Or are we sort of past the peak there from sort of pricing and exposure perspective?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah, good question, Pablo. You can see that total risk premium holding steady at that 42%. I think that gap between total written premium growth and policy enforced growth is a fair indication of the pricing inflation that we're seeing in the market. I think, it's important that we take credit for being in the right spot in the insurance distribution value chain where when the carriers need to take rate to increase their profitability, we get that raise on our entire book.\n\nAnd when it's a soft market for them, and they don't need to take rate, we typically have good profitability and high contingencies. So you probably do see that gap between price growth and total written premium growth continue into 2023, but we would expect that to as pricing starts to normalize again, level back off and start to shrink.\n\nPablo Singzon -- JPMorgan Chase and Company -- Analyst\n\nGot it. That makes sense. And just a follow-up on contingent. So given all the pricing actions being taken by the underwriters, it seems like at least my assessment is that personal margins should improve in 2023 over 2022, right, but probably not where they want to be longer term.\n\nIf that scenario comes to pass, would it be fair to assume that your contingent in 2023 might be lower than what would be otherwise be a normal year?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah, I think that's a fair assessment. I probably would not expect a super great contingency year as compared to historical averages in 2023. I think, the carriers probably still have some more work to do on pricing before they get their profitability in a spot where they're going to be willing to pay big bonuses to brokers. So I wouldn't expect a blowout year in contingencies in 2023.\n\nPablo Singzon -- JPMorgan Chase and Company -- Analyst\n\nOK. And then, last one for me, it's a broader question. It's about the sort of the pivot from corporative franchising. And I think, Mark Jones Sr., you had mentioned upfront expenses and the ramp-up time as reasons for moving away from corporate right on a relative basis.\n\nSo the question is, several years ago, you had disclosed segment margins, right? And I think, at that point, corporate was spending about a 20% EBITDA, which in the context is pretty good. But just given what you've done to date and all the discussion about the pivot. Is it fair to assume that that 20% is significantly worse today? And maybe part of the reason why you're moving away from corporate on a relative basis?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYes.\n\nPablo Singzon -- JPMorgan Chase and Company -- Analyst\n\nOK. And the reason being just sort of like over capacity --\n\nMark Jones -- Chairman and Chief Executive Officer\n\nPablo, we're in the business of allocating finite resources, right? So if we're going to allocate an hour of our time and $1.00 of our money, we want to allocate it where we're going to get the best return. And we are improving returns in our corporate business by taking the actions that we're doing now. But again, if you sort of stand back and think about it, in the franchise channel, there's not a lot of cost infrastructure that we have to carry to generate revenue. There's cost infrastructure we carry to maintain that revenue in service.\n\nBut basically, in the franchise business, people pay us to come work for us and then generate revenue for us. So it's a hell of a deal. And it's not -- it doesn't consume the same kind of capital and you can move faster than we can in our corporate agency. Now that wasn't always the case.\n\nWhen that franchise business was subscale, that the economics were very different. But we know now, for example, if we're going to take someone out of the corporate channel, like I said in my remarks, out of the nine people that we took, that we put into a franchise channel over the last couple of months, six we're in the top 10 agencies for production. They're super productive agencies. We know that when we move we help franchises add producers.\n\nIt costs us a little bit, but it doesn't cost us -- we're not carrying the payroll expenses and office expenses and all of that stuff for those producers. And we know that they are roughly 1.6, 1.7 times as productive as an entire new franchise. So what we're doing is we're looking at what are the longest levers that we can pull to get the best return for an hour of our time and $1.00 of our money.\n\nPablo Singzon -- JPMorgan Chase and Company -- Analyst\n\nGot it. That makes sense. Mark, thank you.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Josh Shanker of Bank of America. Please go ahead.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nYeah, thank you for taking my question. I'm just curious, of the corporate agents who are no longer with the platform, are many of them who left going to become franchisees? Or are the, I guess, initial nine of those start-up, those are the best and brightest, and you'll be finding more.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYeah, Josh, this is Mark Jr. So you don't get to fail out of a corporate job and buy a franchise. You got to go through our approval process. If you've proven that you can't sell in the corporate position where you've got the most access to resources, then you're not going to be a successful franchise.\n\nBut we have plenty of very successful corporate agents that would like to buy a franchise. We control the timing of that and give them specific targets on what they need to do to buy a franchise. And we see a really good pipeline of that in the coming year.\n\nAnd just in terms of our on-campus refining value proposition, it's pretty dynamite when you can go on campus and say we have basically an entrepreneurial program with our company, you come work for us like a three-year paid partnership. And you can be your own business owner and get on a path to a sort of a seven-figure income or net worth over the next decade. It's a spectacular value proposition.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nAnd so, the 100-or-so corporate agents who didn't open franchises, we should assume they're basically gone for all intents and purposes?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nYes, that group that declined from Q2 to Q3 number in corporate agent headcount; those are people that are out of the system, except for those nine that we talked about that bought franchises. And we have literally just started moving people into franchises. So this is new, but the early results are super good.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nVery good. And then, I guess, it was asked, but maybe you get a little more color. Is there anything you can tell us about the newly signed franchisees in the quarter? If we take the 144 launches and subtract that from the outstanding signatures, I guess, that gets us to about even where the number is, but I assume you've added a lot of new signatures and you've culled a lot of signatures. Is there any magnitude you can talk about in that term?\n\nMark Jones -- Chairman and Chief Executive Officer\n\nWe are not going to talk about specifics there, but I can tell you the pipeline for new agencies remains very strong. If you look at the personal lines market, if you're working for one of the big captives and they don't want to write insurance in the area that you live in, you're effectively out of a job. So our value proposition plays really, really well in this market for insurance professionals. So we have a very strong pipeline of new franchises that are both signing now and that we think will continue to sign through 2023.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my questions. Appreciate it.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThis concludes the question-and-answer session. I would like to turn the conference back over to Mark Jones for any closing remarks.\n\nMark Jones -- Chairman and Chief Executive Officer\n\nWe appreciate everybody's time. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDan Farrell -- Vice President, Capital Markets\n\nMark Jones -- Chairman and Chief Executive Officer\n\nMark Miller -- President and Chief Operating Officer\n\nMatt Carletti -- JMP Securities -- Analyst\n\nPaul Newsome -- Piper Sandler -- Analyst\n\nRyan Tunis -- Autonomous Research -- Analyst\n\nTommy McJoynt -- Keefe, Bruyette and Woods -- Analyst\n\nMark Hughes -- Truist Securities -- Analyst\n\nMark Dwelle -- RBC Capital Markets -- Analyst\n\nPablo Singzon -- JPMorgan Chase and Company -- Analyst\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nMore GSHD analysis\n\nAll earnings call transcripts"
}