{
  "companyName": "TaskUs, Inc.",
  "companyTicker": "TASK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/taskus-inc-task-q3-2022-earnings-call-transcript/",
  "content": "TaskUs, Inc. (TASK)\nQ3 2022 Earnings Call\nNov 07, 2022, 5:00 p.m. ET\n\nOperator\n\nGood morning and welcome to the TaskUs third quarter 2022 investor call. My name is Shomali and I'll be your conference facilitator today. At this time, all lines have been placed on mute to go avoid background noise. After the speakers remarks, there will be a question-and-answer period.\n\nPlease note this conference is being recorded. I would now like to introduce Alan Katz, vice president of investor relations. Alan, you may begin.\n\nAlan Katz -- Vice President, Investor Relations\n\nGood afternoon. And thank you for joining the TaskUs third quarter 2022 earnings call. Joining me on the call today are Bryce Maddock, our co-founder and chief executive officer; and Balaji Sekar, our chief financial officer. Full details of our results and additional management commentary are available in our earnings release, which can be found on the investor relations section of the website at ir.TaskUs.com.\n\nWe have also posted supplemental information on our website, including an investor presentation and an Excel-based metrics file. Please note that this call is being simultaneously webcast on the IR section of our website. Before we start, I would like to remind you that the following discussion contains forward-looking statements within the meaning of the Federal Securities Laws, including but not limited to, statements regarding our future financial results and management's expectations and plans for the business. These statements are neither promises nor guarantees and involve risks and uncertainties that may cause actual results to differ materially from those discussed here.\n\nYou should not place undue reliance on any forward-looking statements. Factors that could cause actual results to differ from those forward-looking statements can be found in our annual report on Form 10-K, which was filed with the SEC on March 9, 2022. This filing is accessible on the SEC's website and on our website at ir.TaskUs.com, and may be supplemented with subsequent periodic reports that we file with the SEC. Any forward-looking statements made in today's conference call, including responses to questions, are based on current expectations as of today and TaskUs assumes no obligation to update or revise them, whether as a result of new development or otherwise, except as required by law.\n\nThe following discussion contains non-GAAP financial measures. For a reconciliation of each of these non-GAAP financial measures to the most directly comparable GAAP metrics, please see our earnings press release, which is available in the IR section of our website. Now, I will turn the call over to Bryce Maddock, co-founder and chief executive officer of TaskUs. Bryce?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nThank you, Alan. Good afternoon, everyone and thank you for joining us. In Q3, our revenue and adjusted EBITDA once again came in above the top end of our guidance ranges. Q3 revenue grew by 15.5% year on year to $232.1 million, above the top end of our guidance of $226 million.\n\nAdjusted EBITDA grew 15.3% year on year to $55.5 million for an adjusted EBITDA margin of 23.9%, also above our guidance of 22%. 2022 has been a challenging year as many of our clients have shifted their focus from growth to cost. I am very proud of how quickly our team has responded. After a pause in some client decision making in Q2, our sales activity picked back up this quarter.\n\nWe also moved to drive additional efficiencies into our business. This quarter, we increased our margins compared with last quarter through our focus on G&A spending. We delivered our highest adjusted EBITDA margin and highest free cash flow for the year in spite of the top line headwinds we faced. Over the next few quarters, we will navigate the volatile macro environment and a set of challenging comps from the first half of this year.\n\nBut given our team's incredible performance over the past quarter, I remain confident in our ability to drive revenue growth and increase profitability and cash flow in 2023. After going through the details of our Q3 performance and briefly highlighting our updated full year outlook, I'll discuss our current outlook for the start of 2023 given the recent strong sales performance, the current macroenvironment and our clients' volume projections. Balaji will then walk through the financials, as well as our guidance for the remainder of 2022. Let's start with the third quarter.\n\nWe delivered strong signings from both new and existing clients this past quarter, and continue to move up the value chain with our clients. Starting with growth with our current clients, in Q3, our top 20 clients increased their spend year over year by more than 5%. This growth rate was materially impacted by the transition of work offshore at our largest client and the declines in volume at our largest crypto and equity trading clients. If we exclude those three clients, our largest 17 clients grew 26% year over year.\n\nRevenue from clients outside the top 20 grew at more than 46% year over year. This broad based growth has continued to reduce our client revenue concentration and improved the diversity and resilience of our client base. Looking at our service offerings. Digital customer experience revenue grew 20.9% compared with Q3 of 2021 as a result of expansion with existing clients and new clients signings.\n\nWe're seeing strong signings activity from existing clients in the travel and on demand transportation space, as well as with healthtech and non-crypto fintech clients. In terms of new clients, our signings are weighted toward clients in the retail and e-commerce and travel verticals, as well as with one of the big tech client I discussed on the Q2 call. The sequential quarterly revenue decline in the service offering was primarily driven by the continued decline in volumes from our crypto and equity trading clients. In Q2, these clients accounted for about 12% of revenue.\n\nIn Q3, they represented about 6% of our revenue and we now expect them to represent about 4% of Q4 revenues. In terms of major DCX signings, we signed a significant expansion for the smart home technology client. This client has asked TaskUs to take on their most complex customer support interactions and escalations. We are also now leading user retention efforts when one of their customers moves or considers canceling their service.\n\nThis is a client who we began working with at the end of 2019. At the time, they had a large diverse global vendor network. Our performance and strategic relationship has consistently led to us taking share from these competitors, and we have a clear path to become this client's largest vendor in 2023. We also signed a DCX engagement with a rapidly growing app in the mental health space.\n\nThis is a great example of the growth we're seeing in healthtech. Here, we're providing digital customer experience to support their patients. The client chose us as their first vendor partner in large part due to our focus on health and wellness for our frontline teammates and our learning experience expertise. Finally, we signed a new digital customer experience contract with one of the largest global retailers to provide support for their e-commerce offering.\n\nWe'll be ramping up with this client during the holiday season and see the potential for significant expansion with them overtime. This client is another step forward in our engagement with the Fortune 100 and some of the world's most prominent brands. We're increasingly partnering with these global enterprises to support their digital transformations and customer engagement efforts. Moving on to content security.\n\nRevenues in this service offering declined 3.2% compared with Q3 of 2021, driven by the impact from our largest client moving work to our locations in the Philippines and India. Our relationship with our largest client remains very strong. We're taking significant share from competitors and continue to see both sequential and year-over-year volume growth. In fact, the number of teammates supporting this client have increased by 30% from the start of this year to the end of Q3.\n\nThis significant volume growth was offset by the shift of business from the US, which is the geography with the highest fill rates in the Philippines and India. This shift led to the revenue decline for the service offering this quarter. Despite these challenges, we expect more revenue from our largest client this year than last year. We also expect to add hundreds more teammates to support them over the next few quarters as we continue to take share.\n\nGlobally, they continue to move work from high cost delivery locations to lower cost geographies. We are benefiting from this shift due to our strong capabilities in the Philippines and India. We will see another smaller transition of less than 100 rolls that remain in the US for this client at the end of this year. We expect this to net out to revenues from our largest client being roughly flat from 2022 to 2023.\n\nIf we excluded the impact from our largest client, this quarter's content security revenues would have grown 26% compared with Q3 of 2021. We're seeing even faster volume growth as overall content security teammates increased by 44% year over year. As I mentioned last quarter, we expect to show sequential growth in content security moving forward. We expanded our content security services with a global music streaming app.\n\nHere we provide trust and safety for a diverse set of music and podcasts posted to the platform by global creators. We also moderate user comments on the platform. We're taking action on privacy violations, harassment and the posting of illegal or copyrighted content. We are the sole provider at this client and won this expansion from their in-house team against several competitors.\n\nWe continue to expand our risk and response offering with an e-commerce client to support any money laundering, know your customer and identity verification inquiries in cases involving unauthorized payments or account issues. We began working with a B2B fintech software platform that is used by global brands to manage disputes and chargebacks with a particular focus on fraud associated with this type of activity. This client turned to us to provide live support outside of their automated platform. This type of engagement is especially interesting, pairing our risk and response capabilities with our client software.\n\nFinally, we launched a risk and response engagement with one of our large food delivery clients. Here we're leading fraud investigations. AI services revenues grew 21% in Q3 compared with 2021, driven primarily by expansions with existing clients in the social media and autonomous vehicle spaces and new client signings. We signed new engagements with the leading global provider of generative AI technology, a collectibles marketplace and one of the largest global technology companies in the world.\n\nOur AI services engagements continue to be supported by a combination of our dedicated teams and task versus gig workers that we call taskers. We continue to invest aggressively in the TaskVerse and have signed up over 70,000 global taskers to the platform, surpassing the number of TaskUs teammates for the first time. We're seeing TaskVerse deals utilizing thousands of taskers focused on areas such as data collection, annotation and online research. In addition to image, video and audio annotation, we engaged with a global technology company who leveraged our platform to collect competitive benchmarking data from a demographically diverse community of taskers.\n\nWe are also seeing demand for our crowd outside of AI services. We engaged with one of the largest e-commerce marketplaces leveraging thousands of taskers to perform online research tasks to support this client sales team. These are just a few examples of the type of creative engagements that we've seen on the TaskVerse thus far. Looking at overall signings, our engagements this quarter were again driven largely by growth from existing clients, which accounted for over 70% of total new business signings in Q3.\n\nTurning to revenue growth within our industry verticals. We're seeing particularly strength from entertainment and gaming, hightech and on demand travel and transportation, which includes our food delivery clients. Each of these verticals grew by approximately 40% this quarter compared with Q3 of 2021. Throughout this year, we've discussed the trend of client shifting work that they were previously doing in higher cost locations to our offshore teams.\n\nThis has been particularly true of higher value services that clients may not have looked to outsource in the past. We saw this trend continue this past quarter with several clients, including a digital media company in the entertainment and gaming space. As the streaming media industry is increasingly driving revenue from advertisements, the support needed to insert ads into shows has increased. We were able to engage with our client to transition this entire workflow to our teams in the Philippines.\n\nWe're providing the same quality as their internal US-based teams at a lower cost. We expect this type of work to increase in the quarters to come. Last quarter, I also highlighted signings with three of the world's largest tech firms. We've had strong traction on our initial engagements and are actively engaged in other opportunities as part of their 2023 budget planning process.\n\nOur global model is perfectly positioned to support these firms as they increasingly focus on reducing their operating expenditures. We see the potential for significant growth with these clients. I'll spend a few minutes discussing our teammates and the environment for talent. In Q3, we added 3,400 net new teammates to TaskUs, bringing our global employee population to 48,700.\n\nIn the quarter, we added teammates in every geography we operate in except Ireland and the United States. Year over year, our combined teammate population in the Philippines and India has grown by over 40%. Our teammate population in the US has declined by approximately 25% in the same period as a result of this shift at our largest client and the volume reductions seen in the crypto and equity trading space. In terms of the environment for talent, we've seen an improvement in the market for talent compared to what we were seeing in the first half of the year.\n\nWe've continued to meet our client's aggressive hiring targets by being the employer of choice in each of our delivery markets. We've also seen employee retention improve meaningfully in Q3 as we have worked hard to create a world class employee experience for both are in office and work from home employees. At the end of the quarter, approximately 40% of our teammates were working safely for TaskUs offices around the globe. Clients are increasingly choosing to permanently adopt our work from home platform to drive cost savings and improve teammate retention.\n\nWe now believe that our global teammate population will settle somewhere around 50/50 in office and work from home for the foreseeable future. This is balanced model drives cost savings for our clients, reduces our capex and improves our teammate retention. The savings achieved from lower recruitment and training expenses will also improve our margins over time. Lastly, TaskUs teammates continue to be among the happiest in the industry, rating us at 4.6 stars on Glassdoor as at the end of the quarter.\n\nNow, let's move to our outlook for the remainder of 2022 and our initial view of 2023. Given the strong performance in Q3, we've raised our outlook for both our revenue and adjusted EBITDA for the remainder of the year. We now expect to achieve $950 million in revenue at the midpoint for the full year, up from the $940 million outlook that we gave on our Q2 earnings call. We anticipate our adjusted EBITDA margins to be 23.1% for the full year above the initial guidance we provided for 2022.\n\nConsistent with past practice, we will provide formal 2023 guidance on our Q4 earnings call. However, let me spend a few minutes on what we're initially seeing for next year given the current macroeconomic backdrop. We've been working closely with each of our clients as part of their 2023 budget planning processes. We're seeing two trends across much of our client base.\n\nFirst, we're seeing significant sales success among clients who are looking to shift expenses, in-house resources to our efficient offshore teams. We're also benefiting greatly from an increase in vendor consolidation efforts. We've taken over more critical processes and are moving up the value chain with both long term and newer clients, as they look to improve the efficiency of every aspect of their operations. At the same time, we've seen some clients lower their overall growth and volume forecasts for 2023.\n\nThis combined with the cost focused shift our clients continue to undertake by moving work from our onshore operations to our offshore delivery centers, will continue to weigh on revenue for the next few quarters. Our guidance implies low single digit year-on-year revenue growth in Q4, which includes the benefit of some seasonal volumes. In Q1, we will see some reduction from these Q4 seasonal volumes and the small transition of work offshore at our largest client, but we expect to offset this reduction through strong sales performance. We expect to return to sequential quarterly revenue growth in Q2 of 2023.\n\nAfter we lap at the challenging comps we faced in the first half of next year, we expect to return to double digit year-on-year revenue growth for the second half of 2023. We've used this period as an opportunity to drive a additional efficiency into our own business, significantly improving our margins and cash flows. We now expect our 2023 adjusted EBITDA margins to be at or above this year's performance of 23.1%. These improvements are driven by expanded gross margins and the reduced G&A spending our team achieved in the past 90 days.\n\nLast quarter, we also set a goal of achieving $100 million in free cash flow in 2022. We remain confident in our ability to deliver on this goal and we expect to increase free cash flow in 2023. We remain focused on creating long-term shareholder value with the cash we generate. We've continued to invest in the business to drive growth in new geographies and new service offerings.\n\nAt the same time, in September, our board approved a share repurchase program and we repurchased approximately 739,000 shares in the quarter, successfully returning capital to our investors. We will continue to allocate capital to our buyback program opportunistically. While this year has been challenging, I am extremely proud of how quickly our team has responded. We've driven significant growth in all of our offshore delivery locations, signed engagements with three of the biggest technology companies in the world and expanded our addressable market by providing digital transformation to more stable enterprise clients, all while continuing to take share in our core high growth technology client base.\n\nWe've made the tough choices quickly, improving our adjusted EBITDA margins and free cash flow conversion. As a result, we are well positioned to drive growth and profitability in 2023. With that, I'll hand it over to Balaji to go through our Q3 financial results and provide more details on our 2022 guidance.\n\nBalaji Sekar -- Chief Financial Officer\n\nThanks, Bryce and good afternoon, everyone. I'm going to discuss our financial results for the third quarter of 2022. Please note that some of the items are non-GAAP measures and the relevant reconciliations are attached to the press release we issued earlier today. In the third quarter, we earned total revenues of $232.1 million, an increase of 15.5% over the prior year.\n\nWe outperformed compared to our guidance driven by strong sales performance and client expansions. In the third quarter, our digital customer experience offerings generated $151.5 million for a year-over-year growth rate of 20.9%. Our content security business declined 3.2% versus Q3 of 2021, resulting in $43.9 million of revenue and our AI services business grew 21% year over year for revenues of $36.7 million. Our client base continue to diversify in Q3 as we saw growth from our largest clients exceeded by the ongoing expansion of the rest of our client base.\n\nAs a result, our revenue concentration with our largest client was approximately 22%, consistent with Q2 and down from 27% in Q3 of 2021. Our second largest client was below 10% of our revenue, down from approximately 11% in Q3 2021. Our top 10 and top 20 clients accounted for 56% and 70%, down from 58% and 73% in Q2 of this year and down from 61% and 76% as of Q3 2021. In the third quarter, we generated 55% of our revenue in the Philippines, 21% of our revenues in the United States and 24% of our revenues from the rest of the world, mainly driven by our operations in India and Europe.\n\nWe also expanded our global footprint with clients in Japan and Malaysia. We expect to continue to see our revenue concentration shift toward our offshore geographies for the foreseeable future. As a reminder, our margin is driven in large part by our geographic mix with offshore margins higher than onshore. So this mix change should help to drive margins over time.\n\nOur cost of service as a percentage of revenue was 58% in the third quarter compared to 55.9% in Q3 of the prior year. The increase was primarily driven by ongoing expenses associated with increased facilities expenses as a result of both our return to office and positioning for growth and costs associated with the transition of work from onshore to offshore locations. As I discussed last quarter, the majority of the impact from wage inflation this year was offset by the currency benefit of the strong US dollar and price increases from COLA provisions in our contracts. Quarter over quarter, we have seen our cost of service as a percentage of revenue improve from 58.2% in Q2 to 58% this quarter.\n\nWe expect this trend to continue in Q4 and next year, as we realize the margin benefits that come with an increasing percentage of our business being delivered in offshore geographies. In the third quarter, our SG&A expenses were $62.3 million or 26.9% of revenue. This compares to SG&A in Q3 of 2021 of $60.3 million or 30% of revenue. The improvement in his SG&A was driven by the FX, as well as cost reductions and other efficiency efforts while we continue to invest in sales and our TaskVerse platform.\n\nStock compensation expenses in the quarter were $15.1 million relating to equity grants compared with $18.8 million in Q3 2021. In the third quarter of 2022, we earned adjusted EBITDA of $55.5 million or 23.9% margins compared to $48.1 million and 23.9% in the third quarter of 2021. We outperformed compared with guidance driven by the impact of FX due to the strengthening of the US dollar against Filipino peso and Indian rupee and our cost optimization efforts in G&A, partially offset by our investments supporting our return to office and onshore to offshore transition costs. Adjusted net income for the quarter was $35.8 million and adjusted earnings per share was $0.35.\n\nBy comparison, in the year ago period, we earned adjusted net income of $32.8 million and adjusted EPS of $0.30. Now, moving on to the balance sheet. Cash and cash equivalents were $132.5 million as of September 30, 2022 compared with June 30, 2022 balance of $104.7 million. In the quarter, we utilized approximately $14 million for share repurchases, buying back approximately 739,000 shares at an average price of $18.54.\n\nAs of quarter end, we had approximately $86 million of authorization left on our plan. Cash generated from operations was $41.5 million for the third quarter of 2022 as compared to a use of cash of $109.1 million in Q3 of 2021, which was a result of one time payments to employees related to the IPO. Our DSO was 66 days in the current quarter compared with 71 days in Q3, 2021, driven by improvements in our billing processes. Our capital expenditure decreased in the third quarter of 2022 to $6.7 million compared to $15.2 million in Q3 of 2021.\n\nThe decrease was primarily driven by teammate related equipment purchases in Q3 2021, which were lower this year. Free cash flow was $34.8 million or 62.8% of adjusted EBITDA. This product conversion rate was particularly high given the optimization in capex spend and releases in working capital. In terms of our financial outlook, for the remainder of the year, we've updated our guidance as follows.\n\nWe now anticipate full year 2022 total revenues to be in the range of $949 million to $951 million, representing a year-over-year growth of 24.9% at the midpoint. In addition, we expect to earn full year 2022 adjusted EBITDA margin of 23.1%. Lastly, free cash flow, which we define as cash flow from operations less capex, is expected to be $100 million. I will now hand it back to Bryce before we take your questions.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nThank you, Balaji. Before we get to Q&A, I want to share another TaskUs teammate story. This time from Stella Esposito, a teammate in the Philippines, who is one of our next gen scholarship recipients. In 2013, Stella resigned from her prior job to care for her children full time, Stella's youngest child has special needs and requires multiple therapy sessions a week.\n\nThese therapy sessions are expensive and ultimately led to Stella deciding to go back to work full time four years ago to help pay for her child's care. Around this same time, her eldest child began going to school, which brought another set of expenses for Stella and her family. Despite returning to work, Stella found herself struggling to meet all of the expenses. She had to cancel her youngest child's therapy sessions in order to meet her family's budget.\n\nThis is when Stella joined TaskUs and learned about our next gen scholarship program. This is a program that we started in the Philippines that offers any TaskUs teammate who's been with the company for a year or more and is in good standing the opportunity to have one of their children's educations paid for by the company. For Stella, the scholarship alleviated a large expense and allowed her to enroll her youngest child back into therapy. This year, TaskUs paid for the private education of over a thousand next gen scholars in the Philippines.\n\nWe're now in the process of expanding this program to India. It's stories such as Stella's and the incredible impact of the next gen scholarship program that make me so proud to work at TaskUs. With that, I'll ask the operator to open the line for our question-and-answer session. Operator?\n\nOperator\n\n[Operator instructions]. Our first question comes from the line of Ryan Potter with Citi. Please proceed with your question.\n\nRyan Potter -- Citi -- Analyst\n\nHey. Yeah, thanks for taking my question. I'd like to start on the tech vertical. With the increased cost focus and clients there, including higher freezes than layoffs we've seen recently, has this led to any reduced volume or spend commitments from clients that you have there? And then generally, how do you broadly view the trends within the vertical, both with larger clients, as well as start-ups, and I guess have these clients started turn to you more to help on costs whether it'd be offshoring or outsourcing?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nRyan, thanks for the question. So in Q2, we saw a momentary pause in decision-making among many of our clients and prospects in the technology space. In Q3, deal activity accelerated meaningfully. As our clients started to plan their 2023 budgets, they turn to TaskUs to help improve the efficiency of their spending.\n\nAnd as a result, we've seen clients turn to us to take on more complex processes that they were previously doing in-house. We've also continued to take significant share from our competitors. On the call, I mentioned that we took share at our large ride sharing client, we took share at our largest gaming client and we took share at the smart home device company that I mentioned. We're also taking meaningful share at our largest client.\n\nSo in this market, our view is that the strong will get stronger. And we're certainly benefiting from our clients' efforts to consolidate their vendor networks. In Q3, we also saw a new client sales pick up and we posted our highest ACV numbers for the year. We signed a digital customer experience engagement with a e-commerce division of the world's largest retailer, we landed a meaningful engagement with one of the world's best known B2C brands, and we also want a large opportunity with a leading mental health app.\n\nSo all of this combined to the strength of our guidance, our Q3 beat, and the raise of the full year outlook. When we think about what's happening here among our larger clients versus start-ups, in our top 20 clients this year, 15 of them are publicly traded. And we've seen strength among most of those clients with the exception of the largest crypto and equity trading client. And across the rapidly growing private companies, we're increasingly seeing a focus on cost savings and efficiency that continues to support our revenue growth.\n\nRyan Potter -- Citi -- Analyst\n\nGot it. And then, shifting gears to AI services, in particular, growth in that offering was kind of stronger than we expected, given the impact of the Facebook's offshore transition. Can you discuss some of the trends that you're seeing within this offering? And are you starting to reach a wider range of companies beyond just kind of tech companies? And I guess, beyond that also, what has adoption and demand of the TaskVerse platform specifically been so far with clients?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nSo AI services grew 21% year on year in Q3 and we expect to continue to grow AI services revenues each quarter. The year-over-year growth rate is likely to decelerate over the next two quarters, and that's being driven at least in part by the onshore to offshore transition at our largest client. But we're seeing sustained growth in our autonomous vehicle clients, along with multiple new client wins on the TaskVerse. These tend to be technology clients, some of the biggest technology companies in the world, but we're also seeing some unique customer applications in the automotive space.\n\nI mentioned the collectibles marketplace on the call. So the growth for AI services has certainly been supported by the incredible traction we're seeing in the Taskverse. On the call, we mentioned that we've now signed up over 70,000 gig workers that we call taskers and we're signing multiple new clients to the platform each month. But obviously, that growth is being partially offset by the onshore to offshore transition.\n\nRyan Potter -- Citi -- Analyst\n\nGot it. Thanks, and congrats on a good quarter.\n\nOperator\n\nOur next question comes from the line of Puneet Jain with J.P. Morgan. Please proceed with your question.\n\nPuneet Jain -- J.P. Morgan -- Analyst\n\nHey. Thanks for taking my question and good quarter. So I understand there might be uncertainty over business volume, clients' business volumes. But can you talk about like how much of your pipeline consists of large clients, maybe Fortune 100, 500 companies? You talked about signing like a retail customer in this quarters.\n\nWhat are the trends you are seeing in signing large companies, large clients to your portfolio?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah, thanks for the question, Puneet. So we talked in each quarter of this year about large enterprise clients that we've signed up. In the first quarter, we signed one of the US's largest airlines. In the second quarter, we signed a large corporate travel agency.\n\nAnd then, this quarter we talked about the world's largest retailer. We continue to see significant interest among enterprise clients in the Fortune 100 and Fortune 500. And I think this is being driven by the demand to digitally reimagine these large enterprise businesses. There has been some concern expressed from investors about whether these deals mark a shift to more traditional outsourced services for TaskUs.\n\nAnd as I said on the call last quarter, all of these deals are being done at gross margins that are higher than the average for our business. So it's actually quite the contrary. We're seeing really demand for highly specialized services and digital transformation from these enterprise clients. The majority of our pipeline does continue to be the innovative technology clients that have made up the base of our business for so long.\n\nBut that's being supplemented by the demand we're seeing among the biggest technology companies in the world and more traditional enterprise clients.\n\nPuneet Jain -- J.P. Morgan -- Analyst\n\nAnd then, your top clients has been down 11% over the last two quarters. How should we think about that number in terms of volume versus pricing from offshore mix shift? And it seems like there is some more offshore mix shift coming up in Q1 of next year. How close you are to moving past that offshore mix shift at that client and also on an overall basis?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nThis year, we transitioned a large number of roles from the US to the Philippines, in India, in May. And obviously the US is the geography with the highest revenue per employee for TaskUs and in the Philippines and India, we make significantly less revenue per employee. So in isolation, this shift would have led to a substantial decline in revenues from our client. Fortunately, we added thousands of net new roles across the Philippines and India this year for this client, growing a global headcount by over 30% from the start of 2022 to the end of Q3.\n\nAnd as a result, revenue will increase from our largest client from 2021 to 2022. You're right to point out that sequentially the revenue has declined in Q3, but we see this stabilizing. We're now in the process of transitioning a much smaller group of employees from the remainder of our US operations. But simultaneously, you've been awarded multiple new lines of business that are being shifted from other vendors in higher cost geographies to our efficient operations.\n\nAnd I want to point out that this is a really great example of us taking meaningful share at our largest client. So when all this is netted out, these transactions and significant share gains, along with sitting down with our client and going through a detailed 2023 budgeting process, leave us confident that next year's revenues will be roughly flat when compared to this year's revenues.\n\nPuneet Jain -- J.P. Morgan -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nOur next question comes from the line of Dan Perlin with RBC Capital Markets. Please proceed with your question.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nThanks. I just wanted to make sure, point of clarity around the commentary where you said you're going to get back to sequential growth in the second quarter, and I think this kind of dovetails on the last question. But just to be clear, the expectation here is that there's going to be another kind of mix shift in Q1. So Q1's numbers are likely to be down sequentially versus Q4 but then we start to ramp back into Q2.\n\nAnd then, the second part is when we think about what double digit growth means kind of in the back half, should we use as kind of a baseline plus or minus where your growth is today kind of X probably the top three clients or the top 17 growing in the call it mid 20s? Thanks.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nThanks, Dan. So let me actually clarify here. Well, we're not providing formal guidance. At this stage, we believe Q1 revenues are going to be roughly flat when compared to Q4.\n\nAnd there are a few factors that are impacting Q1. The first is the reversal of Q4 seasonal volumes. Our business doesn't have a ton of seasonality but we do see some impacts in Q1. The second is the transition of less than 100 roles at our largest client and these are roles that remain in the US that we'll move at the end of this year.\n\nWe believe both of those factors are going to be offset by our strong sales performance and the addition of roles at both new and existing clients, and that will leave Q1 revenues roughly flat when compared to Q4. When we think about the back half, again, we're not providing formal guidance on this call. But we do believe that we will return to sequential quarterly revenue growth in Q2 of 2023 and we will achieve double digit revenue growth for the second half of 2023. We also expect that our revenue -- the year-on-year revenue growth will accelerate in each quarter of next year.\n\nSo that'll give you some perspective on what we anticipate for next year.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nAnd then, just quickly in listening to your competitors, but you guys, you added headcount pretty meaningfully. It sounds like you have a fair amount of demand as these things pivots more offshore. I'm just wondering, as we think about the 3,400 employees you added and we think about moving into next year. How should we'd be thinking about maybe the metric there for net new headcount relative to maybe attrition rates for -- and again, I understand you're not providing guidance, but it obviously is a vote of confidence as you guys continue to hire in the face of demand?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nGiven the macroenvironment, we've seen acceleration in demand, particularly for our offshore delivery locations, particularly for the Philippines and India. We saw a 40% increase in headcount in these two regions year-on-year in Q3. And so, we expect that type of growth to continue into next year, and that will continue to drive additional net headcount growth in 2023.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nOur next question comes from the line of Maggie Nolan with William Blair. Please proceed with your question.\n\nJesse Fink -- William Blair -- Analyst\n\nHi. Thank you. This is Jesse on for Maggie. I had a couple of questions on the shift to offshore.\n\nSo first, how do you think the shift impacts your view for the company's long term growth profile?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah. Thanks, Jesse. From my perspective, the position of our business has a largely offshore business, means that we will see an acceleration in growth given the demand for offshore services in this economy. Clearly, the shift from onshore to offshore was a significant headwind to revenue growth in 2022, and it'll continue to be a significant headwind in the first half of 2023 as we lap some very challenging comps.\n\nBut as we get into the back half of next year, we believe that our position as a offshore outsource service provider will actually be a tailwind to growth rates.\n\nJesse Fink -- William Blair -- Analyst\n\nGot it. Thank you. And then for my follow-up, margin has been lower compared to 2021 despite the shift. So can you elaborate on what's going on there and your expectations for next year?\n\nBalaji Sekar -- Chief Financial Officer\n\nSo the gross margins in Q3 are, which is cost of service in Q3, was lower than what it was in the first half of the year. But one of the things that we pointed out at the beginning of the year is that we will continue to incur transition cost in 2022 as we shift work from onshore to offshore. So that is something that we've been incurring even in Q3. And we also continue to incur return to office expenses, because in the previous year, all of our employees were working from home and now we are transitioning employees back to the office, so it's incurred off relating to that.\n\nBut we would start seeing in Q4 with the change in the mix shift, we'll start seeing some benefit of that in Q4 and we would start seeing full year impact of the mix shift getting into 2023.\n\nJesse Fink -- William Blair -- Analyst\n\nThat's helpful. Thank you for taking our question.\n\nOperator\n\nOur next question comes from the line of Kathy Cheng with Bank of America. Please proceed with your question.\n\nKathy Cheng -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Nice to see the performance here. First of all, I just wanted to ask another question about clarifying 2023 guidance. Just wanted to clarify, is that on a FX neutral basis and what does you guys assume for crypto in that? Is it fair to assume the same about 4% exit rate from the 4Q that you guys had just provided some color on? And then, also I wanted to ask about the cadence of margins as well, to get to the overall outlook for that stable to slightly ahead of the 2022 that you guys provided? Thank you.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nKathy, thanks so much for the question. So in terms of the outlook for next year, we -- well, I'm going to start with the last question. So in terms of the cadence for margins, as we continue to grow into 2023, we would expect the margins to continue to expand. We have moved quite decisively to drive additional efficiencies into our own business, and that's going to lead to an increase in our adjusted EBITDA margins, not only this quarter but for the full year when compared to our initial outlook.\n\nFor crypto, we looked at these numbers and in Q1 15% of our revenues came from crypto and equity trading clients and in Q4, that number was down to 4%. So we don't see meaningful downside among more than a dozen clients that we still have in the space. We're not factoring any growth for those clients into the outlook we're providing for 2023. And if you would help me just with the first question that you asked that that would be great.\n\nKathy Cheng -- Bank of America Merrill Lynch -- Analyst\n\nYou basically answered it. The other part was just is that like a constant currency basis organic --\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYes, thank you. You want to take that, Balaji?\n\nBalaji Sekar -- Chief Financial Officer\n\nYes, I'll take that. So Kathy, just to remind our -- most of our revenues are currently burned and collected in US dollars. So we don't really see any impact from a revenue perspective from a foreign currency moment, because they are built in US dollars. We do have foreign currency exposure, both in our offshore countries, more importantly, in the Philippines and in India.\n\nSo from a forecast perspective, what we do is we take the current projection and the spot rate that is currently visible in terms of using those numbers for projecting margins and cost.\n\nKathy Cheng -- Bank of America Merrill Lynch -- Analyst\n\nGreat. And then, I wanted to switch gears a bit and ask about free cash flow as well, which was very strong in the quarter. What kind of drove the outperformance in this quarter? And you talked about engaging in buybacks? Should we expect that pace of about the 740,000 in September to continue throughout 4Q? And how are you thinking about M&A within the priorities for your excess free cash flow?\n\nBalaji Sekar -- Chief Financial Officer\n\nSo Bryce, let me take the free cash flow question, and then I'll let you handle the M&A piece. So from a free cash flow perspective, it was about $34.8 million and about 63% conversion on adjusted EBITDA. And this quarter's conversion rate was particularly high given the optimization that we had in capex spend as more of our employees work from home than we anticipated earlier, and some releases that we have from a working capital perspective. But for the full year, we are expecting free cash flow conversion to be 45% and at about $100 million.\n\nBryce, you want to take the M&A question?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nSure. Yeah, when we think about capital allocation on the whole, we're taking a really pragmatic approach to our capital allocation strategy. We believe that the stock buyback makes the most sense at the moment given the relative valuation of our own stock. When we think about M&A specifically, today's M&A environment is interesting.\n\nWe've seen a broad based repricing in the public markets and that hasn't really translated yet to private market valuations. We've seen a few deals recently that transacted at significant premiums to historical multiples and the current public market reality, and these are deals that are getting done at multiples that are significantly higher than the acquirers' own multiple. At TaskUs we're taking a long term view and our strategy is to remain disciplined. We're going to buy businesses that are accretive to our growth margins and our culture.\n\nAnd our acquisition of heloo earlier this year was a perfect example of this. It's been a huge success, they're growing ahead of plan and they're being successfully integrated into TaskUs and they were -- it was done at a multiple that was accretive to our own at the time. So we've seen a few interesting M&A possibilities that look like heloo, they tend to be more bolt-on type acquisitions that would expand our geographic delivery footprint or add specialized service capabilities. But broadly in this industry, we're fairly unique in our ability to drive organic growth.\n\nSo for now, we're focused on returning to double digit organic growth for the back half of 2023.\n\nKathy Cheng -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Very helpful. Thanks, guys.\n\nOperator\n\nOur next question comes from the line of James Faucette with Morgan Stanley. Please proceed with your question.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nHey, good afternoon. Bryce, can you quickly talk through your strategy right now of going after prospects that may be outside of your typical high growth new economy customer base? And I guess just trying to understand how your interaction and growth potential with those customers may or may not be different from what you've seen historically?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah. James, thanks for the question. So we're seeing two types of clients outside of our historic high growth technology focus. The first are the biggest technology companies in the world and these are clients that we have been working for years to get into.\n\nAs I said on our last earnings call, we successfully signed deals with three of the biggest technology companies in the world and those engagements have gone very, very well. We're actively involved in the 2023 budgeting process for these clients, looking at adding additional workflows as all of our clients get more serious about cost savings, TaskUs is the provider that can deliver those cost savings to them. We also have a group of clients that are more traditional enterprise clients, these are Fortune 500 and Fortune 100 clients. And here, we had always been open to engaging with traditional clients but looked to let the type of work these clients are interested in really dictate whether we would take on the work.\n\nSo we never are going to take on traditional call center work for a big telco but we will absolutely engage in the digital transformation work inside the app of leading airline as we did in Q1. So those are the types of engagements that we found ourselves taking on for more traditional enterprise clients. And we see this as broadening our client base and really adding to overall revenue stability in the face of an uncertain macroenvironment.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGot it. Appreciate that. And then Balaji, just a couple of quick follow-ups on comments you've already made. But first on the cost base and foreign currencies, particularly from the Philippines and India.\n\nDo you hedge any of that cost at all or to what degree do you do that? And then secondly, you explained quite clearly why the cash flow conversion had improved during the course of '22. But is there any catch up spend or cash flow impact that we should expect for the end of this year and next year? For example, capex related to new hires, etc. Thanks.\n\nBalaji Sekar -- Chief Financial Officer\n\nSo in terms of the hedging that we do. So James, we do hedge about 50% of our exposure in the Philippines. So we've used forward contracts to try to reduce the volatility of cash flows, primarily related to cost dominated in the Philippine peso. So we do not use foreign currency exchange rate contracts for trading purposes.\n\nSo our contracts generally have a maturity of about 12 months or less. And typically -- so as an example, the contracts that are currently maturing are contracts that we entered into about a 12 months ago period. And then second, your question on cash flow. Again, for the full year, we are reiterating our free cash flow guidance of about $100 million, which is a 45% conversion on adjusted EBITDA.\n\nBut while we are not providing any guidance currently on 2023, we would expect that to be somewhere between 40% to 50% in the medium term. And so, one of the things that Bryce mentioned earlier is that we expect the onshore, the work from home to in office mix to be about 50/50 person, and that's going to be beneficial from a capex perspective. So that is something that we would continue to see even getting into next year where capex would be somewhere between 5% to 5.5% of revenues.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThat's great. Appreciate that.\n\nOperator\n\nOur next question comes from the line of Robert Bamberger with Baird. Please proceed with your question.\n\nRobert Bamberger -- Baird -- Analyst\n\nYeah. Thanks for taking my question. Was there any one-time election revenue this quarter in content security from the mid-term elections? And I guess looking into next quarter too, would there be any in Q4 as well?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nRobert, thanks so much for the question. So we obviously run large content security operations for the leading social networks. We don't see election seasonality, because the teammates that we have supporting those workflows tend to roll from one political engagement to another, or move from political engagements to traditional advertising and moderation. So to answer the question directly, there's no one time revenue from that.\n\nRobert Bamberger -- Baird -- Analyst\n\nAnd then, maybe just about attrition in the quarter, maybe if you could talk a little bit about that. Did that improve in Q3 and are you expecting that to get to normalized levels then in 2023?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nSo in Q3, our attrition rates declined from the first half of the year, attrition rates hit a high in Q2, driven by ongoing return to office efforts and I think just the attrition challenges that have been facing the industry as a whole. We made attrition a central area of focus for our entire leadership team. And one of the things we really focused on was defining our work from home value proposition, I think that had a huge impact in bringing the number back down. We don't anticipate our attrition rates to return to the levels we saw in 2020 and 2021.\n\nWe think that those low levels were largely driven by the COVID pandemic, but we do anticipate to drive our attrition rates below where they were in 2019. And so, our hope is to deliver on a number that's lower than 2019's number for the full year of 2022.\n\nRobert Bamberger -- Baird -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from the line of Jeff Cantwell with Wells Fargo. Please proceed with your question.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nHey, thanks very much. Congrats on results. I wanted to circle back to the -- and we understand it's preliminary outlook for 2023 and specifically the backdrop of the year. I just want to make sure we're all understanding the commentary for revenue.\n\nAnd so, can you walk us through what is the preliminary expectation or sequential growth there in the back half? I'm hearing the front half is very clear, it's crystal clear on the front half. I'm curious if your commentary about double digit growth in the back half of the year, if that means double digit sequential growth in 3Q versus 2Q and then double digit sequential growth in 4Q versus 3Q? So any kind of color you might be able to provide us on the preliminary outlook for revenue in the back half would be great? Thank you very much.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nJeff, thanks for the clarification. So to be clear, we expect to deliver double digit year-on-year revenue growth in the back half. At this stage, it would be too early to predict what the quarter-over-quarter growth rates would be that far out. But maybe I'll spend just a moment on talking about what is giving us the confidence that we're going to return to double digit growth, and really are three reasons.\n\nIf I start with No. 1, the biggest risks in our business have already been realized. Second, we have tremendous upside opportunities across our portfolio clients, specifically in the largest global tech clients that we signed recently. And third, we have seen significant uptake of our most complex services by clients who are searching for cost savings.\n\nSo those are the three reasons that we feel very confident in our ability to return to double digit growth for the back half of the year.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nAnd then, are you able to, we heard you on margins and it sounds like the G&A line is starting some cost optimization improvements and so forth. So are you able to give us that level of granularity on your preliminary guidance for next year? I just want to make sure we're able to dot all the i's and cross all the t's on your guidance as it relates to the EPS line, if that's possible at all? If not, then you know we'll wait to hear more, but just wanted to ask.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nBalaji, you want to take that?\n\nBalaji Sekar -- Chief Financial Officer\n\nSo like Bryce said, right now, we are not giving any formal guidance on 2023. But when we do that next year then during our Q4 call in February, we will provide that level of detail in terms of some of the assumptions that we are making. But a couple of things to call out that's going to be impacting next year is, one, we spoke about the mix shift from onshore to offshore geography, which is going to be margin accretive. So we'll start seeing the full year impact of that getting into 2023.\n\nAnd the second is we also spoke about the G&A optimization in the previous quarter and also we saw the impact of that to adjusted EBITDA in the current quarter, where we reported about 23.9% from an adjusted EBITDA perspective. So we see continued opportunities there in terms of optimizing our G&A spend and driving improvements. So those are things that we'll continue to work on getting into 2023. So what we are currently saying is that we feel confident that 2023 adjusted EBITDA margins to be at or above the current 2022 performance.\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nOf course. Of course. OK. Great.\n\nI appreciate all the color. And again, congrats on the results.\n\nOperator\n\nAnd our final question comes from the line of William McNamara with BTIG. Please proceed with your question.\n\nWilliam McNamara -- BTIG -- Analyst\n\nHi. Thanks for taking my question. I wanted to see how things are going in Europe in terms of expansion in Poland, Serbia and Romania, basically from finding talent and getting things going?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah. William, thank you so much for the question. So our acquisition of heloo has been a tremendous success. The company is performing ahead of plan and we are growing headcount in all of the countries that heloo has operations in, primarily Croatia and Serbia.\n\nWe also continue to grow TaskUs operations in Greece, where we have more than doubled our headcount this year. Going forward, we've hired a new leader for the entire European region and he's focused on integrating the heloo operations into our TaskUs operations. And we've got to go to market team based in the UK that is actively selling into the geography. While the outlook for the economy in Europe is certainly uncertain for 2023, we are finding opportunities much like the opportunities we're finding here in the US to help fast growing technology companies drive cost savings into their business.\n\nWilliam McNamara -- BTIG -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nAnd we have reached the end of the question-and-answer session. I'll now turn the call back over to Bryce Maddock for closing remarks.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nWell, in closing, I want to thank our clients, our teammates and our shareholders. We look forward to speaking with all of you again on our Q4 call in February. Good night, everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlan Katz -- Vice President, Investor Relations\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nBalaji Sekar -- Chief Financial Officer\n\nRyan Potter -- Citi -- Analyst\n\nPuneet Jain -- J.P. Morgan -- Analyst\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nJesse Fink -- William Blair -- Analyst\n\nKathy Cheng -- Bank of America Merrill Lynch -- Analyst\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nRobert Bamberger -- Baird -- Analyst\n\nJeff Cantwell -- Wells Fargo Securities -- Analyst\n\nWilliam McNamara -- BTIG -- Analyst\n\nMore TASK analysis\n\nAll earnings call transcripts"
}