{
  "companyName": "Couchbase, Inc.",
  "companyTicker": "BASE",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/08/couchbase-inc-base-q2-2023-earnings-call-transcrip/",
  "content": "Couchbase, Inc. (BASE 0.99%)\nQ2 2023 Earnings Call\nSep 07, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the Couchbase second-quarter fiscal 2023 earnings conference call. At this time, all participants are in listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator instructions] As a reminder, today's program may be recorded.\n\nAnd now, I'd like to introduce your host for today's program, Edward Parker, head of investor relations. Please go ahead.\n\nEdward Parker -- Head of Investor Relations\n\nGood afternoon, and welcome to Couchbase's second quarter 2023 earnings call. We will be discussing the results announced in our press release issued after the market close today. With me are Couchbase's president and CEO, Matt Cain; and CFO, Greg Henry. Today's call will contain forward-looking statements, which include statements concerning financial and business trends and strategies, market size, our expected future business and financial performance and financial condition, and our guidance for future periods.\n\nThese statements reflect our views as of today only and should not be relied upon as representing our views at any subsequent date, and we do not undertake any duty to update these statements. Forward-looking statements, by their nature, address matters that are subject to risks and uncertainties that could cause actual results to differ materially from expectations. For a discussion of the material risks and other important factors that could affect our actual results, please refer to the risks discussed in today's press release and our most recent annual report on Form 10-K or quarterly report on Form 10-Q filed with the SEC. During the call, we will also discuss certain non-GAAP financial measures, which are not prepared in accordance with generally accepted accounting principles.\n\nA reconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures, as well as how we define these metrics and other metrics, is included in our earnings press release, which is available on our Investor Relations website. With that, let me turn the call over to Matt.\n\nMatt Cain -- President and Chief Executive Officer\n\nThank you, Edward, and good afternoon, everyone. On today's call, Greg and I will provide details on our second-quarter results, as well as our third quarter and full year fiscal 2023 guidance. To kick things off, I want to acknowledge and thank our employees, customers, partners, and shareholders as we mark the one-year anniversary of bringing Couchbase to the public market. Your commitment to Couchbase motivates me and the entire leadership team every day.\n\nI am proud of the team's many achievements over the past year, and I am even more excited about what our future has in store. I'm pleased to report that we delivered another strong quarter and are well on our way to achieving what we laid out to do this year. Revenue in Q2 was 39.8 million, up 34% year over year. Total annual recurring revenue, or ARR, was 145.2 million, up 26% year over year and up 30% in constant currency.\n\nIn addition to beating our guidance across all metrics, we saw another quarter of year-over-year growth acceleration from Q2 last year, and I am proud of the momentum we are seeing at Couchbase. Our non-GAAP gross margin remains best in class at 88.7%. Non-GAAP operating loss was 8.4 million, well ahead of the high end of our range, driving a 17-point improvement in operating margin from Q1 and a 19-point improvement from Q2 of last year. As we scale, we will continue to complement our strong top-line momentum with a focus on driving more efficient growth and operating leverage in our model.\n\nIn our emerging cloud business, we continued to see enthusiastic customer receptivity and growing transaction volume for Capella. This, in addition to strength across leading indicators, continues to validate our excitement in and my very high expectations for our as-a-service offering. I'll cover more on that in a moment. In our core business, we continue to see broad strength, including a large deal momentum, renewal and expansion activity, and healthy new lands.\n\nAnd I'm happy to share that despite ongoing macroeconomic uncertainty, we had a record quarter for pipeline generation. Greg will provide more detail on our results in a moment. But first, let's discuss some highlights in the quarter. To begin, from a product perspective, we are making rapid progress with Capella.\n\nCapella offers an industry-leading price performance of our core platform and a multi-cloud database-as-a-service offering and provides built-in application services, so customers can easily create always-on and always-reliable applications. When we think about Capella, our approach is twofold: continuing to invest significant development resources by enhancing the core database platform and delivering even more ways to consume our technology. With respect to our core platform, customers choose Couchbase in part due to our ability to enable applications across a wide spectrum of deployment and usage models: from cloud to on-premise, from the data center to the edge, and everything in between. Recall that Couchbase Server 7.1, our most recent release, delivers meaningful advancements in performance, storage capacity, and workload breadth, which ultimately reduce TCO.\n\nAnd our unique mobile and edge database capabilities round out our ability to run anywhere, further differentiating us from our competition. Capella then offers customers the easiest way to access and consume this differentiated platform. We are innovating to extend Capella's reach and usability, enabling customers to pick their cloud of choice to efficiently build and modernize their applications. Over the summer, we announced the availability of Capella on Google Cloud, as well as the addition of our unique Capella app services on both AWS and Google Cloud for mobile and edge applications.\n\nWe also expanded Capella into new cloud zone regions for more global coverage. At the same time, we are reimagining the developer experience and building one that optimizes for productivity. This capability speaks to the core of what we are: unmatched scale and performance with familiarity and ease. In a new sponsored benchmark program with global I.T.\n\nservice provider, Altoros, Capella significantly outperformed competing databases of service offerings across various workloads and cluster sizes. Based on the benchmark results, Capella processed the same workloads with fewer nodes, resulting in an 81% cost reduction. This cost-effectiveness message is resonating with customers, especially at a time when organizations are looking for ways to consolidate their database investments and make more efficient use of their resources. With Capella, we are even better positioned for a large and growing $60 billion-plus database market.\n\nWe are moving fast on the innovation front, and we have an exciting roadmap ahead of us. We continue to believe Capella is well on its way toward becoming an important contributor to our business this year. And while it's still early, we are already seeing the fruits of these investments, as you will see in some of the customer wins and expansions I will discuss in a moment. On the go-to-market front, we continue to make rapid progress with enhancing all aspects of our sales motion.\n\nAs you will recall, we promoted Huw Owen to chief revenue officer earlier this summer, and he's off to a great start, driving increased organizational focus and rigor and building overall momentum across our go-to-market teams. The investments we have made in go-to-market have been especially impactful with Capella, where we are engaging and cultivating a new audience of developers. We saw another double-digit increase quarter over quarter in the number of Capella trial signups. We also continue to execute well on our high-touch enterprise sales motion, and I'm pleased with the record quarter of pipeline generation in Q2.\n\nOn the partnership front, our partner and alliance ecosystem remains strong and continues to contribute to our go-to-market acceleration. In Q2, we saw a healthy contribution from our partner community with respect to new customer acquisition and business bookings sourced by partners increase 38% year over year in the first half of the year. In particular, our AWS co-sell engagement continues to deepen. We're now enjoying differentiated access to several programs and incentives at AWS that support both demand-generation activities with customers and prospects and also encourage and incentivize collaboration at the account level.\n\nWe've been working with AWS to target ISV software companies that are building applications that are powered by Capella on AWS. During the quarter, we had several sourced and influenced new ISV partners that were converted from on-demand usage via public marketplace to customers with committed spend. Our cloud partnerships remain a key part of go-to-market acceleration. We are proud of our increasingly strong relationships with the cloud providers and the both AWS- and Google Cloud-sponsored, our Global Application Modernization Roadshow.\n\nLooking ahead, we remain committed to building out a targeted, scalable, world-class go-to-market motion as we prepare Couchbase for the next level of growth. Next, I'd like to highlight some key customer wins from the quarter. Overall, I am pleased with the breadth of our customer activity across all parts of our portfolio, including mobile, server, and especially Capella, which drove the largest percentage of our new wins. Let's start there.\n\nGame developer, publisher, and technology provider, East Side Games, selected Capella this quarter. This new customer is migrating from our Community Edition to our fully hosted offering, allowing its development team to focus on building engaging, responsive, and scalable gaming experiences instead of ongoing database management. Unlocking more of these Community Edition-to-Capella migrations is an important focus of our go-to-market organization, and we expect to see many more of them in the back half of the year. Another new Capella win was French social networking app, Yubo, which allows its millions of users to create video livestreams with their friends.\n\nYubo selected Capella on Google Cloud over the incumbent cloud database for a new use case and features on the app due to the performance, ease of use, and scalability that our database-as-a-service provides. Playgon is a SaaS technology gaming company focused on developing and licensing digital content for the growing iGaming market. They were an existing Couchbase customer and, in Q2, expanded their relationship with us by migrating to and expanding their investment in Capella. We support their gameplayer and betting data storage, and this customer selected our fully managed service for greater developer agility and better total cost of ownership.\n\nTurning to expansions. We grew our relationship with a Fortune 50 home improvement retailer. This customer relies on Couchbase Server for their main corporate order management system application, as well as for their product master data management. Since becoming a customer, they have significantly grown their use of Couchbase in their cloud environment, and we have become a strategic importance to their technology stack and business.\n\nAnother significant expansion during the quarter was with the leader in fast food restaurants, which uses Couchbase Mobile for their peer-to-peer, tablet-based point-of-sale system at restaurants to ensure a speedy and reliable experience for customers and staff. This is an excellent example of how our unique mobile capabilities are driving a multitude of connection with applications at the edge, all aligned toward driving a more compelling customer experience through digital transformation. With over tens of thousands of restaurants worldwide, this Fortune 500 customer will increase their Couchbase spend by more than 10x their prior purchase, and they continue to see growth opportunities ahead with Couchbase. As we look toward the second half of the year, I am as confident as ever in the long-term trends powering our growth.\n\nCouchbase is very well-positioned to take advantage of the tremendous opportunity to transform the database market. Let me remind you of four reasons why. First, from a product perspective, we continue to differentiate ourselves by expanding our portfolio to meet the wide-ranging demands and types of applications of the largest enterprises. Second, with respect to the cloud, industry analysts are forecasting the cloud database management service revenue will account for 50% of the total database market revenue this year.\n\nWith Capella, we are well-positioned to participate in this opportunity, as we've already outlined earlier. Third, digital transformation initiatives continue to receive the highest levels of attention and prioritization across organizations. Our conversations with customers increasingly revolve around how Couchbase can play an essential role in driving their multiyear strategic transformation. And fourth, as CEO of Couchbase, I have the honor of leading a great team of people.\n\nI am so proud of our world-class team, supported our customers and one another, adapted to constantly changing conditions, and executed over the past couple of years. Providing superior performance for massive volumes and scale while delivering industry-leading TCO gives me added confidence in our ability to navigate more challenging selling environments. And as you've heard me say before, one of our core values is to attack hard problems driven by customer outcomes. Our team is battle-tested, and I am highly confident in our ability to persevere and innovate, even in volatile markets.\n\nAs our results suggest, we have not seen a material change in demand for our products or in the buying behavior of our customers. In fact, save for a small amount of business in Russia, our EMEA business remains strong. And as I mentioned a few moments ago, Q2 was a record quarter in terms of pipeline generation. With that said, we wake up every morning with a degree of healthy paranoia, and as such, we remain cognizant of, if not resolutely focused on, the uncertainty being felt across the economy, and this focus continues to inform how we are looking at the rest of the year.\n\nIn conclusion, we continue to execute across all facets of the business, and the secular drivers supporting our growth trajectory remain strong. I'm proud of our results, and we believe we can do even better. I'd like to thank our team for their tireless efforts and our customers and partners for placing their trust in Couchbase. With that, I'll hand the call over to Greg to walk you through our results in more detail.\n\nGreg?\n\nGreg Henry -- Chief Financial Officer\n\nThanks, Matt, and thanks, everyone, for joining us. We had another strong quarter as we beat guidance across all key metrics. Against a more challenging macro environment and despite increased FX headwinds, we saw healthy demand for our solutions and are pleased with our execution in the quarter. I'll now walk you through our second-quarter financial results in more detail before providing our guidance for the third quarter and full year.\n\nTotal ARR at the end of the second quarter was $145.2 million, representing 26% growth year over year or 30% growth year over year on a constant-currency basis. Revenue for the second quarter was $39.8 million, an increase of 34% year over year and well above the high end of our guidance range. We estimate foreign currency had an approximately negative 1.5% impact on year-over-year revenue growth. In addition to strong subscription revenue growth this quarter, revenue benefited from our outperformance in our on-demand business and continued strength in professional services, which, we remind you, is nonrecurring and does not appear in our ARR number nor our customer count.\n\nSubscription revenue for the second quarter was $37.1 million, an increase of 32% year over year. Professional services revenue for the second quarter was $2.7 million, an increase of 64% year over year. We exited the quarter with 632 customers, an increase of 18 customers from the first quarter. Our ARR per customer performance in the second quarter was $230,000, up from $227,000 from the first quarter.\n\nOur dollar-based net retention rate continues to exceed 115%. In discussing the remainder of the income statement, please note that unless otherwise stated, all references to our expenses, results of operations, and share count are on a non-GAAP basis. In Q2, our gross margin remained best in class at 88.7%. This compares to a gross margin of 88.3% a year ago and 87.3% last quarter.\n\nTurning to expenses. We continue to invest aggressively to capture the generational opportunity we see in front of us but are focused on improving the efficiency of our growth. Our sales and marketing expenses for Q2 were $24.9 million or 63% of revenue, compared to $21.6 million or 73% of revenue a year ago. Research and development expenses for Q2 were $12.2 million or 31% of revenue, compared to $12.1 million or 41% of revenue a year ago.\n\nGeneral and administrative expenses for Q2 were $6.5 million or 16% of total revenue, compared to $4.6 million or 60% of revenue a year ago. Non-GAAP operating loss for Q2 was $8.4 million or a negative 21% operating margin, compared to an operating loss of $12 million or negative 40% operating margin a year ago. The operating loss was well above the high end of our guidance, resulting from our strong revenue results and focus on both expense discipline and increasing efficiencies, offset by public company costs. Non-GAAP net loss attributable to common stockholders for Q2 was $8.5 million or negative $0.19 per share.\n\nTurning to the balance sheet and cash flow statement. We ended Q2 with $192 million in cash, cash equivalents, and short-term investments. We remain well-capitalized to execute against our long-term growth strategy. Our remaining performance obligations, or RPO, totaled $166.5 million at the end of Q2, an increase of 40% year over year.\n\nWe expect to recognize approximately 62% or $103.1 million of total RPO as revenue over the next 12 months. We are pleased with our continued strength in RPO performance, but note that our sales plan no longer incentivizes multiyear contracts as aggressively, and as such, we may see a slight contraction in billings terms. Operating cash flow for Q2 was negative $7.7 million, while free cash flow margin was negative $9.3 million or negative 23% free cash flow margin. Now, to conclude the call, I will provide guidance for Q3 and the full-year fiscal 2023.\n\nAs Matt discussed, despite the ongoing macroeconomic volatility, our pipeline remains strong. We continue to see solid momentum across our industry in support of broad-based digital transformation initiatives. That said, we are mindful of the macro headwinds impacting I.T. spending and are monitoring the environment closely.\n\nWe also continue to see an incremental strengthening of the U.S. dollar, resulting in a headwind from foreign exchange exposure. Lastly, I'd like to remind everyone that, as opposed to our annual credit portion of our Capella business, the on-demand portion is not currently counted in ARR, and as such, we're factoring this emerging dynamic in our outlook. Accordingly, we are prudently considering these factors into our guidance.\n\nFor the third quarter of fiscal 2023, we expect total revenue in the range of 36.5 million to $36.7 million or a year-over-year growth of 19% at the midpoint. We anticipate ARR in the range of $149.3 million to $151.3 million, which represents 23% growth year over year at the midpoint. I'd add that we anticipate approximately 3% negative impact to our ARR growth rate due to foreign currency fluctuations. We expect a non-GAAP operating loss in the range of negative $14.7 million to negative $14.5 million.\n\nNow, turning to our revised full-year guidance. We are raising our full-year revenue guidance provided on our Q1 call and now expect revenue to be in the range of $149.5 million to $150.5 million or a year-over-year growth of 21% at the midpoint. As a reminder, we've historically seen variability with respect to the implementation timing of certain deals, which impacts our revenue visibility. We therefore believe that ARR is a better indicator than revenue of the strength of our business.\n\nOn a constant-currency basis, our full-year ARR guidance remains unchanged. However, we are adjusting our ARR guidance to account for foreign currency fluctuations, which is resulting in an approximately $1 million incremental headwind to our full-year fiscal 2023 guidance updated in June. Our updated ARR guidance for the fiscal 2023 is in the range of $159.5 million to $163.5 million or 22% year-over-year growth at the midpoint. We note that we anticipate approximately 2% negative impact to our ARR growth rate due to foreign currency fluctuations and approximately 1% incremental headwind since our Q1 call.\n\nAnd finally, due to revenue outperformance and continued expense discipline, we are raising our non-GAAP operating loss guidance and now expect a range of negative $51.8 million to negative $50.8 million. Finally, I want to share our thoughts on balancing growth and profitability. As Matt outlined earlier, we have a $60 billion database market ahead of us, and we are investing aggressively to become a cloud-first company. Our level of investment is informed by this tremendous market opportunity.\n\nBy prudently evaluating and managing our cost structure, delivering healthy revenue growth while improving profitability is a top priority for us. With that, Matt and I are happy to take your questions. Operator?\n\nOperator\n\nCertainly. [Operator instructions] And our first question comes from the line -- just one moment. Our first question comes from the line of Sanjit Singh from Morgan Stanley. Your question, please.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nYeah. Thank you for taking the questions, and congrats on that 30% constant-currency ARR growth this quarter. But I wanted to unpack some of the drivers that we could see for Capella over the next year. You talked in your script about the community to, you know, server upsell motion for Capella.\n\nI was wondering if you could -- if there's any way to sort of quantify or give us a sense of that opportunity for the Capella business. And similarly, in terms of penetration of the cloud providers, in terms of the availability zones, where do you stand today? And where do you think we'll be over the next year? And the last one -- I apologize for the multi-part question. On the other part of the release was the really great capabilities around relational migrations, and I wanted to see how you're thinking about that aspect becoming a driver, potentially going into a variety budget environment and whether that gets customers to think about replatform off of the more expensive relational. So, my question is, I guess, attached to the drivers for Capella.\n\nMatt Cain -- President and Chief Executive Officer\n\nHey, Sanjit. Great question. Let me break this down, and certainly, appreciate your acknowledgment of the 30% ARR growth. We're proud of that and focused on how we go forward.\n\nLook, as we think about Capella, we're, first off, very pleased with the momentum we're seeing. And as you know, this is still the early days for us, but we truly believe it's a game changer for the company. I think it's safe to say that Capella is dominating conversations with our customers, both existing and new prospects, and we do believe that it is a matter of when, not if, or being the de facto choice for Couchbase customers because of the value proposition we're enabling and the industry-leading database that is the foundation of our offering. When I think about the demand signals that demonstrate health of the business, I start from kind of the buyer journey.\n\nSo, how are they engaging with us digitally? Getting on our web page, reading our documentation, getting in into trials. Are they then progressing into PSCs, and can we successfully demonstrate our value quickly and efficiently in those proof of concepts that led -- you know, moves to lands and conversions? We've got to make sure that we're seeing positive product feedback, expanding at pace, both applications that we've landed and additional ones, and then, you know, ensuring that we have the ability to continuously innovate and expand our go-to-market. And across that entire value chain, we're seeing leading indicators that are very positive and trending in the direction that we want. Now, your question on CE-to-Capella is a really interesting one because one of the fundamental things that we believe Capella opens up for us that, quite frankly, we have not experienced them in a material way is product-led growth.\n\nAnd I do really think of CE-to-Capella as a great demonstration of that, where a customer is experiencing Couchbase, they see the power of the database, but then they decide that the consumption model of us managing the service frees them up from running the database and allows them to focus on application development. And we mentioned, you know, East Side Games, but there are other examples of that playing out. We had another company, an American sports book and betting operator, that moved from CE to Capella on AWS specifically for greater development team flexibility and agility. And we believe that's the value proposition that is opening up.\n\nSo, certainly, CE is a big portion of our potential demand stream, but I think the product-led growth aspect is even more significant, quite frankly, when you look across the business. Now, as we think about the availability of cloud providers, reminder, in the summer, we added GCP to our portfolio for both Server, as well as the addition of our Mobile and Application Services portfolio on AWS and GCP. Azure is on the roadmap for the rest of the year, and we'll continue to expand our geographic coverage with additional zones being deployed while we focus on, you know, developer productivity and reimagining that developer experience. Now, the last part of your question, Sanjit, on relational migrations, we think, is a really important part of our value proposition.\n\nAs we've been talking about for some time, companies still rely on us for mission-critical applications that often have some component of relational offload. And in today's demand environment, I think the value proposition of total cost of ownership and database consolidation, doing more with less, leveraging our SQL compatibility for all developer productivity, all those things are more relevant than they've ever been. And I think it's a big part of our value proposition that we'll continue to deliver capabilities in the market, to make that even easier specifically for developers and leveraging, you know, Capella as the preferred consumption model.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThat's a super helpful commentary that I really appreciate. And because of my long-winded question, I'm not going to give the floor to the rest of the group. Thank you so much. \n\nMatt Cain -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. Our next question comes from the line of Raimo Lenschow from Barclays. Your question, please.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. Two questions, actually, and congrats from me as well on the 30%. First one is on Capella, on what you see in the market in terms of adaptability. Like, you know, the one thing that people in the past put for you is that you had a slightly smaller ecosystem of developers do it [Technical difficulty]\n\nMatt Cain -- President and Chief Executive Officer\n\nEconomic value of solutions that are being deployed, and that really comes down to total cost of ownership. Our value proposition lends itself very well to that. But as we get into the Capella offering, how we articulate, you know, the entire managed service is a newer dynamic for us that we're really leaning into. But I think, you know, those are two dynamics that I think are particularly important in today's environment.\n\nUnknown speaker\n\nGreat. Thank you. And then just one really quick follow-up on the competitive side. You talked about the AWS partnership and some of the go-to-market work you're doing there.\n\nJust maybe just help us understand why AWS would not want to sell its own database relative to something like Couchbase. \n\nMatt Cain -- President and Chief Executive Officer\n\nYeah. Look, I think the value proposition that AWS is focused on, they talk a lot about customer obsession and ensuring that they are aligning as a business partner to help customers achieve their business objectives. And to their credit, I think they've built a very strong program to incent ISPs like Couchbase to truly engage with them at a partnership level. With Capella, we are able to help AWS with their value proposition and customers and, ultimately, you know, get more spend inside their cloud but with the value proposition that they're not able to offer fully with their embedded databases.\n\nAnd so, we've been pretty excited about the productive and collaborative selling and go-to-market efforts that we have with AWS. And we find that the more we engage with them early and often with account planning, it's actually opening up a lot more opportunities for us, which we've been talking about for some time, finding leverage in the go-to-market. And it's a testament to our teams, you know, on the field side, within our partner ecosystem, of really understanding, you know, the AWS machinery, leaning into incentive programs and go-to-market programs. But, you know, we're excited about that.\n\nWe think we're going to see similar benefits with GCP and Azure when we when we bring that to market.\n\nUnknown speaker\n\nThank you and good luck.\n\nMatt Cain -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] And our next question is from Raimo Lenschowfrom Barclays. Your question, please.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nHey, I don't know what happened earlier. I have two questions. One was -- and I don't know. I got dropped, and so I don't know if you answered it already.\n\nBut I was wondering if the cloud deployment that you have is kind of changing the whole dynamic about the developer ecosystem because one thing that cloud should enable you is to -- you know, because it removes a lot of the friction, the extra work, etc., and that the developer productivity should increase. So, it should be easier to kind of find more people and have more people working with you. So, I was just wondering if you had some early experience on that already. And then the second question was for Greg in terms of the better profitability guidance.\n\nHow did you kind of get to those better numbers, especially in light of your kind of growth versus margin discussion you had earlier? I just -- I'm trying to understand, like, what drove the different decisions here or what drove the changes here. Thank you.\n\nMatt Cain -- President and Chief Executive Officer\n\nRaimo, so on the developer front, I will tell you that, quite frankly, that's an area that we know we can do better as a company. And we know that Capella is a big part of unlocking our story with developers. And the fact that we are where we are in our journey has allowed us to really think innovatively on what experience we want to create for developers. That's everything from, you know, integration with third-party tools, reimagining user interfaces that developers are going to be working with, embedding documentation, you know, into Capella itself, just really removing friction and making it really easy to build applications on what we believe is, you know, the industry's most powerful next-generation database.\n\nAnd we're seeing that in the strength of our leading indicators, you know, additional significant growth and trials and POCs. But I'll give you one additional thing that has us pretty excited, which I think demonstrates what's in front of us. And that is, you know, shortened deal cycles. One of the new logos in Capella, you know, from the quarter was an animation studio.\n\nThey wanted a fully managed database, high performance, broad capabilities. They started off with the free trial. So, you know, that's them pursuing their buying process without us kind of actively selling to them. They then went into a POC where we were engaging with them on their particular application, which was content management, and we went from not knowing them to having them up and running on Capella in less than two and a half months.\n\nAnd there are other examples where that process has moved even faster. And so, why are we able to do that? While we're managing the complexity of the database, we're driving that experience. Developers are seeing how they can be flexible and agile and productive. And so, we believe that's going to demonstrate the value proposition to developers above and beyond what we've already been able to do with our core platform, significantly expand our reach.\n\nAnd that's going to allow us to build on that and get people who are using that solution in these ways to evangelize on behalf of Couchbase will drive further integrations. And I think that we have an opportunity to really expand our community efforts on the other side of this. So, certainly, all in on developers from both a innovation and mindset perspective, as well as our go-to-market.\n\nGreg Henry -- Chief Financial Officer\n\nYeah. Raimo, on your second question, look, we obviously saw a nice revenue beat outperformance in the first half and some good cost control, which drove some of that bottom-line profitability you saw. We are still investing aggressively to capture this once-in-a-generation database market. And we're going to -- we're starting to see and will continue to gain efficiency at Capella's scale.\n\nWe're going to get additional go-to-market improvements, see us driving some changes there that we'll continue to see as we go forward here. As Matt talked about, the partnerships -- we're leveraging the partnerships with cloud companies, you know, in terms of their partnership, and we'll continue to prudently manage expenses as we go here knowing that there's just uncertainty in the environment. So, we're trying to balance all at the same time, but we think we've started to demonstrate that in the first half, and we'll continue to drive that in the second half.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nIt sounds really good. Congratulations. \n\nGreg Henry -- Chief Financial Officer\n\nThanks, Raimo.\n\nOperator\n\nThank you. Our next question comes from the line of Rob Oliver from Baird. Your question, please.\n\nRob Oliver -- Robert W. Baird and Company -- Analyst\n\nGreat. Good evening, guys, and thank you for taking my question. And I think I missed a couple because of the technical issue. So, I apologize if this was already asked.\n\nBut one, Matt, for you, and then one, Greg, for you. Matt, you made the comment about your record pipeline gen in the quarter, which sounds great. I was just wondering if we could get a little bit more color on that, you know, where that is, if that's in Capella, if it's, you know, conversions, if it's, you know, more in the on-prem side. And maybe just any more color you can add on that kind of record pipeline and activity levels, that would be great.\n\nAnd then, you know, Greg, for you, just a follow-up to Raimo's question just around the expense side. Obviously, really great job, you know, managing that. You guys did call out the macro in your prepared remarks. It seems [Audio gap] outside of FX, there were any actual impacts of the macro on the business.\n\nIs that correct? And if that is then, you know, were there other signals that are flashing or anything else that you guys wanted to call out? Thank you.\n\nMatt Cain -- President and Chief Executive Officer\n\nRob, let me unpack pipeline a little bit. So, when we think about pipeline, which is something we, quite candidly, obsess over on a daily basis, we think about it in terms of size, shape, and velocity. And when we talk about record pipeline generation, that's something that we want to ensure that we're not only getting to levels, but we're doing it with the appropriate and healthy mix across geographies, across customer segments, across use cases, and most importantly, right now, as it pertains to the mix of Capella. And the strength of the pipeline, quite frankly, is better than it has been in as long as I can remember because of the focus on that, because of the contribution of new business.\n\nAnd we really think Capella is a big driving factor of that. When I say new business, it's certainly addressing one of the areas that we know we can do better, which is new customer acquisition, as well as an area that we do really well in, which is customer expansion. But being able to open up new use cases and address different personas with Capella for customers that we have, I think, is reflected in that record pipeline generation. So, we are incredibly focused on this across our go-to-market teams.\n\nThat's not just sales. That's marketing. It's our business development team. It's our community efforts.\n\nIt's everything that we're doing to ensure that we're extending our reach and people understand what we can do for them with Couchbase as a platform and Capella, in particular. But it's a leading indicator that is really important to us and one that was a big win in the quarter.\n\nGreg Henry -- Chief Financial Officer\n\nYeah. And, Rob, to take the second one, on the macro and expense side, yeah, I wouldn't say we didn't see any macro impacts in the first half, but I'd say that they were not material. And I think we just managed them very well at this point. That said, we are being prudent with our guidance.\n\nWe're very mindful reading the headlines on a daily basis. You know, just from a pure risk management perspective, we're trying to be just deliberate about how we go about setting guidance and make sure that, again, we're setting ourselves up to, at a minimum, meet that guidance, and we'll then -- we'll work really hard to beat it. So, that's how we're setting up for the second half, and we've been thinking about it most of the year.\n\nRob Oliver -- Robert W. Baird and Company -- Analyst\n\nOK. Great. Very helpful. Thank you, guys. \n\nGreg Henry -- Chief Financial Officer\n\nThanks, Rob.\n\nOperator\n\nThank you. Our next question comes from the line of Param Singh from Oppenheimer. Your question, please.\n\nParam Singh -- Oppenheimer and Company -- Analyst\n\nOh, great. Thank you. This is Param Singh on for Ittai Kidron. So, firstly, you know, you mentioned shorter sales cycles for Capella.\n\nMaybe you could give some color on, you know, how much of it's got a difference -- or does that impact RPO significantly? Also, what the typical ARR per customer is for Capella versus CE and any more granularity, that would be really helpful.\n\nMatt Cain -- President and Chief Executive Officer\n\nAll right. Maybe I'll talk how we think about the dynamic, and then I'll defer to Greg to get into RPO and ARR dynamics. Look, when we're working on a platform at the scale we are for the nature of the applications that we support, you know, enterprises will be prudent about evaluating that technology and ensuring that they're making a long-term bet on us as a vendor. The difference with Capella is we can shorten all of that.\n\nThey can get into trials. They can get into POCs. They can offload lot of what they would normally have to do on a longer selling cycle because we are handling all the back-end administration and running the service. And so, when you think about shorter deal cycles, that's really compelling to us, particularly as we open up, you know, new customer acquisition and do that at a pace that we haven't.\n\nWe're excited about shorter deal cycles, and quite frankly, just landing customers and allowing them to expand at their pace is something that we can do with Capella much more efficiently than we would have, you know, with our customer-managed Server version. And so, there's a big drive within the company to leverage this dynamic, lean into product-led growth, and really participate from this as-a-service dynamic in a material way. From a financial perspective, I'll let Greg talk about the impacts and how we're thinking about it.\n\nGreg Henry -- Chief Financial Officer\n\nYeah. Hey, Param. So, just as a reminder, you know, we haven't and we're not intending to give out compelling, specific metrics. Now, we will at the time when the business become -- that part of the business becomes material.\n\nIn terms of its potential impact on RPO, you know, look, we'll have to see as we go. Like I said, we're not -- it's not material to the business today, so it's not impacting the RPO per se. But that said, we obviously believe this is a massive tailwind and growth driver for us. So, if the theory of the case hold, you would obviously -- you know, that would be the driver of our RPO as well going forward.\n\nAnd then on the ARR, again, we're not giving that specifically, but as Matt alluded to, like our objective here is to get customers going on Capella as quickly as possible, which would lead to smaller deals by the start and then doing, you know, rebuys and upsells from there. So, we do believe that the initial deal size for Capella will be smaller than we've experienced in the past, but then there'd be more frequent buying coming after that.\n\nParam Singh -- Oppenheimer and Company -- Analyst\n\nI see. So, philosophically, is it like when you reach 5% or 10% of revenue, whether on Capella or some take rate level on the App Services, would you expect to disclose at that point? Is there, you know, some level of contribution that you have in mind?\n\nGreg Henry -- Chief Financial Officer\n\nYes, there is. We aren't talking about that specifically now, but when it does become material for the business, we fully intend to disclose the necessary compelling metrics that you're asking and others have been asking. So, things like ARR, customer count, etc. So, that will certainly be coming in due time.\n\nParam Singh -- Oppenheimer and Company -- Analyst\n\nAbsolutely. Thank you. Maybe one more if I could sneak in. You know, obviously, you've done a really good job with some of the leverage here and opex prudence.\n\nWhat is the philosophy behind getting to an operating breakeven? That's been a bigger topic of conversation among investors. How are you seeing that now versus a year ago? And what can we expect from trying to get to a breakeven sooner rather than later?\n\nGreg Henry -- Chief Financial Officer\n\nYeah. Look, I'd say we've always been mindful of that. Again, we're trying to do this through -- balance the investment, the investment levels to grow the business but being mindful of the profitability at the same time, as I referred to in the prepared remarks. So, I don't think anything necessarily changed materially at this point.\n\nWe remain mindful of it, and we're trying to find that right balance to make sure we can grow the business because we have this huge opportunity in front of us. But we absolutely intend to be moving toward, you know, profitability here over the next period, several periods here. And again, one of the things we will talk about when we get to an Analyst/Investor Day next year some time is to lay out a multi-year view and give you insight as to the path to profitability.\n\nParam Singh -- Oppenheimer and Company -- Analyst\n\nGot it. Thank you so much for taking my questions and great job on navigating the tough microenvironment.\n\nGreg Henry -- Chief Financial Officer\n\nThanks, Param.\n\nOperator\n\nThank you. And our next question comes from the line of Rudy Kessinger from D.A. Davidson. Your question, please.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nHey, guys. Thanks for taking my questions. You know, I guess I'm curious, based on your commentary on macro and the record pipeline, just -- I don't know if there's a way you could maybe quantify the conservatism that you've baked into the revised guidance, you know, on the macro. And just maybe, if not, you know, what assumptions are you making? Are you making an assumption that the macro gets worse, stays about the same, or -- just trying to understand better what you're flowing into that revised guide.\n\nGreg Henry -- Chief Financial Officer\n\nYeah. Hey, Rudy. Good to hear from you. Yeah, look, we -- again, as I said, we're trying to be mindful of everything that's going on around the world today, even beyond just the macroeconomic, and try to, you know, best assess that and how we think it could impact Couchbase, you know, in the second half of the year.\n\nSo, you know, we're, again, just baking in a certain level of prudence. I'm not sure to quantify it per se. I mean, it's good about the way we've guided the business. I think we've now, you know, first quarter, I think we've -- we're building a history of building a guidance where we can have, you know, a high probability that we're going to at least meet that and then continue to work hard to beat it.\n\nAnd so, I think that's what we baked in. I don't think it's changed materially other than we take the pieces of information about the headline news we see on a daily basis and try to continue to factor in and adjust and, by the way, not only to adjust the guidance but also to adjust our line of business to try to offset some of that. So, that's how I would articulate it.\n\nMatt Cain -- President and Chief Executive Officer\n\nReally -- this is Matt. The additional commentary I would have is we've worked through challenging circumstances as a team before. Certainly, not all are the same, but I think one of the things that we're very mindful of is we believe we're a battle-tested team and, you know, being smart about understanding, you know, deal cycle dynamics or the fact that there may be additional inspection on, you know, economic value and TCO and making sure we're planning for that in our sales cycles, balancing our demand generation across customer segments. I think we're really leaning into the things that we can control, you know, to take that all into account with, you know, some of the more challenging circumstances that may be being felt.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nGot it. And then, Greg -- and our and my congrats in the 30% ARR growth, constant currency. But I guess was there anything in Q1 that drove, you know, the really strong net new ARR figure in Q1? It was much, much higher than in years past. And I guess, you know, again, the ARR growth kind of came down a point from Q1.\n\nSo, I'm curious, just was there anything in Q1 that is resulting in kind of the nonlinear acceleration trend over the last couple of quarters?\n\nGreg Henry -- Chief Financial Officer\n\nYeah. It's a really -- I would say there's nothing that really sticks out in my mind, I would say. I mean, look, you know, we are enterprise-based, and so there can be, from time to time, a big deal here or there that can move things a little bit. So, that could be, you know, part of the driver.\n\nBut there is -- you know, there's nothing that really stands out other than, you know, a deal here or there that could be driving a one- or two-point variance. Otherwise, we feel really good about, you know, being able to maintain a 30% growth over the first half.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nGot it. Thanks for taking my questions. That's it for me.\n\nOperator\n\nThank you. This does conclude the question-and-answer session of today's program. I'd like to hand the program back to Matt Cain, president and chief executive officer, for any further remarks.\n\nMatt Cain -- President and Chief Executive Officer\n\nThanks, operator. To recap, we had a strong quarter, and I'm very pleased with the momentum we are seeing at Couchbase. I'm excited about our opportunity with Capella this year. There are some very big trends in our favor, like digital transformation, acceleration of the cloud, and innovation at the edge, while also remaining cognizant of the macro-related impact on visibility.\n\nCouchbase is in a great position. We'll see you back here next quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEdward Parker -- Head of Investor Relations\n\nMatt Cain -- President and Chief Executive Officer\n\nGreg Henry -- Chief Financial Officer\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nUnknown speaker\n\nRob Oliver -- Robert W. Baird and Company -- Analyst\n\nParam Singh -- Oppenheimer and Company -- Analyst\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nMore BASE analysis\n\nAll earnings call transcripts"
}