{
  "companyName": "Qualcomm",
  "companyTicker": "QCOM",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/qualcomm-qcom-q4-2022-earnings-call-transcript/",
  "content": "Qualcomm (QCOM 0.09%)\nQ4 2022 Earnings Call\nNov 02, 2022, 4:45 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to the Qualcomm fourth quarter and fiscal 2022 earnings conference call. At this time, all participants are in a listen-only mode. Later, we will conduct a question-and-answer session.\n\n[Operator instructions] As a reminder, this conference is being recorded November 2, 2022. The playback number for today's call is 877- 660-6853. International callers, please dial 201-612-7415. The playback reservation number is 13733389.\n\nI would now like to turn the call over to Mauricio Lopez-Hodoyan, vice president of investor relations. Mr. Lopez-Hodoyan, please go ahead.\n\nMauricio Lopez-Hodoyan -- Vice President, Investor Relations\n\nThank you and good afternoon, everyone. Today's call will include prepared remarks by Cristiano Amon and Akash Palkhiwala. In addition, Alex Rogers will join the question-and-answer session. You can access our earnings release and a slide presentation that accompany this call on our Investor Relations website.\n\nIn addition, this call is being webcast on qualcomm.com, and a replay will be available on our website later today. During the call today, we will use non-GAAP financial measures as defined in Regulation G, and you can find the related reconciliations to GAAP on our website. We will also make forward-looking statements, including projections and estimates of future events, business or industry trends, or business or financial results. Actual events or results could differ materially from those projected in our forward-looking statements.\n\nPlease refer to our SEC filings, including our most recent 10-K, which contain important factors that could cause actual results to differ materially from the forward-looking statements. And now, to comments from Qualcomm's president and chief executive officer, Cristiano Amon.\n\nCristiano Amon -- President and Chief Executive Officer\n\nThank you, Mauricio, and good afternoon, everyone. Thanks for joining us today. Fiscal '22 has been a strong year for Qualcomm with record performance in our chipset business and a strong execution of our diversification and growth strategy. We remain focused on continuing to transition Qualcomm from a wireless communications company for the mobile industry to a connected processor company for the intelligent edge.\n\nWe're driving the transformation of industries and growth of the digital economy by powering the billions of smart connected devices at the edge, utilizing our One Technology Roadmap with leadership in wireless connectivity, high-performance, low-power computing, and on-device AI. While the semiconductor industry is being impacted by significant macroeconomic headwinds and other short-term challenges from which we're not immune, the fundamentals of Qualcomm's growth drivers remain unchanged with significant opportunities in the coming years. In Q4, we delivered record revenues of $11.4 billion and non-GAAP earnings per share of $3.13, reflecting record revenues in our chipset business and solid performance in licensing. QCT revenues of $9.9 billion were up 28% year over year, including record performance across handsets, automotive, and IoT.\n\nFiscal '22 revenues of $44 billion were up 32% year over year. QCT, the growth engine of the company, contributed revenues of $37.7 billion, up 39% year over year, with combined fiscal year IoT and automotive revenues growing 38% year over year. QTL delivered $6.4 billion in revenues. Let me now summarize a few highlights from the fiscal year.\n\nIn handsets, we entered into a new multiyear agreement with Samsung, expanding the use of Snapdragon platforms for future premium Samsung Galaxy products globally. We also executed on the changing OEM landscape opportunity, securing key premium and high-tier design wins with our customers in China. Snapdragon has become synonymous with premium mobile experiences worldwide. In automotive, our design win pipeline across connectivity, digital cockpit, and ADAS is now greater than $30 billion.\n\nWe also completed the acquisition of Arriver, which enhances our ability to deliver open, scalable, fully integrated, and competitive ADAS solutions. Importantly, we have firmly established ourselves as a key strategic and technology partner for the automotive industry, and the Snapdragon Digital Chassis is now the preferred platform for next-generation vehicles. In IoT, we extended our chipset road map to capitalize on trends driving the connected intelligent edge, notably, the conversions of personal computing with mobile; the intersection of physical and virtual spaces; the enterprise transformation of the home; the expansion of broadband; and the ongoing digital transformation across many verticals. In consumer IoT, we increased OEM design wins in ecosystem traction for our next-generation Windows on Snapdragon solutions, which incorporate our custom CPUs.\n\nThe game-changing AI capabilities of our Snapdragon compute platform recently demonstrated at Microsoft Ignite 2022 developer conference will redefine user experiences on Windows 11. We also announced a multiyear agreement with Meta to develop premium virtual reality and mixed reality experiences starting with next-generation devices powered by custom Snapdragon XR platforms. We continue to be a leading platform provider for virtually all commercially available and announced XR devices and remain well-positioned as XR develops. In edge networking IoT, we have seen positive share traction related to the rollout of Wi-Fi 6 and 6E solutions for enterprise access points and retail mesh systems.\n\nAnd we are seeing strong interest in new design wins for our Wi-Fi 7 solutions. Additionally, our 5G fixed wireless access broadband solution is now the industry's platform of choice for wireless fiber globally. In industrial IoT, we built a strong foundation for growth with significant wins across industrial handhelds, robotics, payments, gateways, smart camera, enterprise collaboration, and edge processing. The growing diversity of these end markets position us well to benefit from durable and margin-accretive growth opportunities in industrial.\n\nIn licensing, we extended our agreement with Samsung through 2030, establishing an important benchmark for the long term and for future renegotiations. In addition to delivering record financial results, our fiscal '22 achievements validate our strategy and have provided a strong foundation for long-term growth. As we look to fiscal '23, further deterioration of the macroeconomic environment and extended China COVID restrictions have resulted in demand weakness and temporary elevated channel inventory across the industry. As good stewards of capital for our stockholders, we are committed to managing our business in light of the current environment without losing sight of the significant growth opportunities ahead.\n\nTo that end, we're being very disciplined in managing operating expenses while optimizing our R&D investments to prudently focus on growth within automotive and IoT. We have already implemented a hiring freeze, and we have planned spending reductions across our mature product areas and SG&A to fund our diversification. We are continuing to evaluate additional actions, and we are prepared and committed to making further reductions to operating expenses as needed. It is important to note that the current inventory drawdown is a cyclical adjustment that has no impact on the underlying growth and earnings power of the company in the long term.\n\nAnd we are in a strong position to manage the near-term headwinds. Beyond 2023, we see a number of our strategic growth initiatives increasing in scale. We anticipate automotive revenues will grow consistent with our Auto Investor Day projections as the design win pipeline materializes. We expect to see an inflection point in Windows on Snapdragon PCs in 2024 based on a significant number of design wins to date.\n\nXR is just at the beginning of its growth curve. 5G wireless fiber presents significant opportunities in regions such as India and other developing economies that have just started to deploy 5G networks. Lastly, the digital transformation of industries will continue to gain momentum, driving connectivity and intelligence at the edge. In summary, despite the short-term challenges, the fundamentals of our growth strategy remain intact.\n\nWe remain confident in our ability to navigate the current economic downturn given our strong balance sheet and consistent history of strong free cash flow generation. We will continue to focus on stockholder returns and executing on our ongoing diversification opportunities. The powerful secular tailwinds driving multiyear demand for our One Technology Roadmap across multiple end industries are unchanged and resilient. We remain on track to expand our addressable market by more than seven times to approximately $700 billion in the next decade and firmly establish Qualcomm as the connected processor company for the intelligent edge.\n\nI would now like to turn the call over to Akash.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nThank you, Cristiano, and good afternoon, everyone. In a challenging macroeconomic environment, we are pleased to announce strong fourth-quarter results with record revenues of $11.4 billion and non-GAAP EPS of $3.13. These results reflect year-over-year increases of 22% and 23% in revenues and EPS, respectively, driven by strength across QCT. This was also a record quarter for QCT revenues of $9.9 billion and EBT margin of 34%, both above the midpoint of our guidance with year-over-year revenue growth of 28% and EBT dollar growth of 37%.\n\nHandset revenues of $6.6 billion increased 40% versus the year-ago quarter on strength of our Snapdragon product portfolio across premium and high tiers. As expected, RF front-end revenues of $992 million were impacted by the continued weakness of the handset market and channel inventory. IoT revenues were up 24% year over year to $1.9 billion on growth across edge networking and industrial IoT. Automotive revenues of $427 million grew 58% versus the year-ago quarter due to the broad adoption of our Snapdragon Digital Chassis.\n\nQTL revenues of $1.4 billion and EBT margin of 69% reflected the impact of lower handset units relative to our expectations at the beginning of the quarter. Turning to fiscal '22 results. We delivered record non-GAAP revenues and EPS with year-over-year growth of 32% and 47%, respectively. In addition, looking over the past two fiscal years, we've more than doubled our non-GAAP revenues and almost tripled non-GAAP EPS from fiscal '20 to fiscal '22, underscoring the strong momentum across our businesses.\n\nIn QCT, we had records across all revenue streams, as well as approximately 500 basis points of EBT margin expansion from 29% in fiscal '21 to 34% in fiscal '22. We are pleased with the continued success of our diversification strategy as we delivered year-over-year combined revenue growth of 38% across IoT and automotive. Lastly, we continue to be disciplined in delivering long-term stockholder value. We executed on our capital return commitments, returning 93% of our free cash flow, including $3.2 billion in dividends and $3.1 billion in stock repurchases.\n\nBefore turning to first-quarter guidance, I'll address how our near-term financial outlook is impacted by the challenges facing the semiconductor industry. As we communicated during the last earnings call, we had started to see a deceleration in demand for mass-tier handsets in consumer IoT. Since then, the further deterioration of macroeconomic environment and sustained COVID restrictions in China have led to broad-based demand weakening across tiers and regions. Given these considerations, we now project 3G, 4G, 5G handset volumes in calendar 2022 to decline by low double digits on a year-over-year basis, including 600 million to 650 million 5G handsets.\n\nThis rapid deterioration in demand and easing of supply constraints across the semiconductor industry have resulted in elevated channel inventory. Due to these elevated levels, our largest customers have made significant changes to their inventory policy. They are now drawing down on their inventory, negatively impacting our near-term financial performance. Based on our current assessment, we estimate that there are roughly eight to 10 weeks of elevated inventory in the channel.\n\nWhile the environment is very dynamic, based on the information we have today, we believe this may take a couple of quarters to work itself through with more than half of the inventory drawdown completed in the first fiscal quarter. We are confident in our ability to navigate this environment successfully, and we'll continue to monitor inventory levels and order patterns closely. As Cristiano outlined, while we navigate this downturn, we've already implemented specific actions to manage our spending levels, including a hiring freeze and reductions in handsets, other mature product areas, and SG&A. We will remain disciplined and be prepared to take further decisive actions on additional reductions to operating expenses if the macroeconomic environment continues to deteriorate.\n\nTurning to guidance for the first fiscal quarter. We are forecasting revenues of $9.2 billion to $10 billion and non-GAAP EPS of $2.25 to $2.45. The midpoint of our guidance includes an estimated impact of approximately $2 billion in revenue and $0.80 in EPS related to the drawdown of channel inventory with the remaining impact primarily due to weaker end-market demand and foreign exchange headwinds. In QCT, we expect revenues of $7.7 billion to $8.3 billion and EBT margins of 26% to 28%.\n\nFollowing the record performance in fourth quarter, we expect our handsets and IoT revenue streams to be down sequentially due to the impacts I just described. On a year-over-year basis, we still expect revenue growth across IoT and automotive. We estimate QTL revenues of $1.45 billion to $1.65 billion and EBT margins of 71% to 75%. This estimate reflects the updated handset forecast, including a muted seasonal benefit for the holiday quarter and approximately $50 million headwind from foreign exchange on a year-over-year basis.\n\nLastly, we now anticipate non-GAAP operating expenses to decrease 3% to 5% sequentially. Before I conclude, I'd like to provide an update on RF front-end revenue stream disclosure and planning assumption for Apple product revenues. We have grown our RF front-end revenues to become the No. 1 player in handsets due to the breadth and strength of our product portfolio.\n\nLooking forward, we expect growth to be driven by our strong design win pipeline for 5G and Wi-Fi 7 platforms across handsets, automotive, and IoT. As a result, starting in fiscal '23, we will consolidate RF front-end revenues within handsets, automotive, and IoT revenue streams. In addition, we'll continue to provide periodic updates on the combined RF front-end revenues against our Investor Day target. For Apple product revenue, we now expect to have the vast majority of share of 5G modems for the 2023 iPhone launch, up from our previous 20% assumption.\n\nBeyond this, there are no changes to our planning assumption, and we are assuming minimal contribution from Apple product revenues in fiscal '25. In closing, while the current backdrop presents near-term headwinds for our industry, we remain confident in our leading technology road map, deep customer relationships, and strong balance sheet to help us navigate these challenges and maintain our leadership position. Our diversification strategy and long-term growth opportunities remain intact as we continue to drive our vision to bring cloud connectivity, data processing, and artificial intelligence to the edge. Thank you.\n\nBack to you, Mauricio.\n\nMauricio Lopez-Hodoyan -- Vice President, Investor Relations\n\nThank you, Akash. Operator, we are now ready for questions.\n\nOperator\n\n[Operator instructions] One moment, please. For the first question, Matt Ramsay with Cowen and Company. Please go ahead with your question.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nGood afternoon. Thank you very much, guys. I guess my first question, Cristiano, has really two parts to it on the smartphone market. No -- I guess you guys were really clear in the prepared script about what's going on with channel inventory, with customers, and a deterioration of the macro.\n\nI guess that's -- maybe the magnitudes are different, but directionally, no big surprise. So, I guess the questions are, are you guys seeing the weakness that's been there in global and low mid-tier Android? Are you seeing that worsen? Or are you seeing that weakness now moving into the high-end, premium tier? And the second part is we get questions from investors about when things do weaken, do some of the ASP -- really strong performance that you guys have had in your wireless business over the last year or two, do those ASPs started rolling over? Or is this a unit dynamic and you're seeing ASPs hold up well? Thanks.\n\nCristiano Amon -- President and Chief Executive Officer\n\nThank you, Matt. This is Cristiano. I'm going to start the question. I'm going to ask Akash to also add some data.\n\nSo, what we have seen in the smartphone markets, and I think we tried to detail as much as can in the script, it's really -- there is a combination of the weakness of demand, which is related to basically the macroeconomic headwinds and the prolonged COVID in China that has kind of singled out the China market has been also down as the major factor. And it's mostly a handset consumer story. The other issue that we've been talking about, and that's the big issue really, is you have a situation that you had a lot of demand and supply constrained environment. So, companies across the board had much higher inventory policies.\n\nWhen supply chain got resolved, then you get that with the macroeconomic uncertainty, you have a drawdown and trying to bring inventory to a different level than it was during the situation of demand constraint. That is starting to hit the premium tier as well as we -- as customers are basically adjusting their inventory levels on premium tier. However, we actually see as we go to next-generation possibilities for ASP to increase because we're actually increasing processor content, and we're very well-positioned for the premium tier. If you take the Apple update, I would say every premium-tier device has Qualcomm content on it.\n\nOf course, the best story is Snapdragon across Samsung and our Chinese customers. And the content is increasing. We expect to see ASP going up. Akash, anything you would like to add?\n\nAkash Palkhiwala -- Chief Financial Officer\n\nJust maybe quickly, Matt, on your first question. What we saw in the September quarter through our licensee reporting is weakness across tiers and regions. So, it was -- it cut across all tiers in that case. And then that's what we are projecting forward in the December quarter as well.\n\nAnd then clearly, on the ASP side, as Cristiano said, the content is increasing, and we have opportunity on upside in that case. And also, you've seen us manage through the last couple of years of foundry price increases, and then we've been able to keep gross margins strong.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nThank you both for the answers there. As my follow-up, Akash, last year -- I guess a year ago on the call at the beginning of the fiscal year, you were a different environment, a lot less volatility obviously. But you talked to us about the next fiscal year maybe having 20% or more EPS growth for the company. And you obviously did much better than that, and I think you came in at 47%.\n\nA lot of different variables now, the inventory correction, a change, and extension of the Apple business. If you have any thoughts there about how we should think about the next fiscal year, we'd really appreciate it. Thank you very much.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nSure, Matt. So, if you look at the first quarter, there are really two factors that are kind of inconsistent with current -- recent trend. The first one is this inventory drawdown that we are seeing in the quarter. Impact of that is approximately $0.80 within the quarter.\n\nAnd that's really the primary impact. Of course, there's a little bit of impact that also comes in from the weaker market environment as well. So, when you take that impact in the first quarter projected forward for the rest of the year, we were very clear that the OEM inventory drawdown, we see that as a couple of quarter issue. And it's not something that's a long-term challenge for us.\n\nIt's a short-term cyclical issue. So, that should inform how you project it through the year. And then on the market side, given the uncertainty at this point, our planning assumption is that the weakness in the market lasts through the fiscal year. Clearly, if the market improves, we'll see that as upside.\n\nBut at this point, we're going to plan based on current scale of the market. So, if you take kind of current expectations and apply that framework to the year, that should hopefully inform how you do the forecast for the second quarter and also for the full year.\n\nOperator\n\nSamik Chatterjee of JPMorgan, please go ahead with your question.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nThank you. Thanks for taking my questions. I guess I had two as well. And if I can start on IoT instead of smartphone.\n\nI guess, Akash, you mentioned smart IoT revenues as well moderating sequentially. And I wanted to see if you can now provide a bit more color. You've broken out the sort of IoT business previously into consumer, industrial, and edge networking, calling it roughly sort of one-third, one-third, one-third. Now, as we start to sort of see some moderation there, can you now talk about the trends in terms of the different sort of subsegments there? And where are you seeing more resilience versus sort of maybe more weakness? And how should we really be sort of projecting that forward? And I have a follow-up.\n\nThank you.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nSure, Samik. So, on IoT, we're obviously pretty happy with the way that business has played out for us. So, we've gone from $3 billion in fiscal '20 to $7 billion, $6.9 billion in '22. And then the quarter we reported was a record quarter for IoT at $1.9 billion of revenue.\n\nSo, pretty happy with how the business is doing. Now, in terms of the macro environment impacting the IoT market overall, and it's less about Qualcomm, it's about the overall macro environment. We're definitely seeing the impact of that on consumer and in some ways synonymous with handsets. Edge networking is holding for us.\n\nAnd we're seeing some minor pockets of weakness in industrial. But overall, I think when you kind of step back and look at where our IoT opportunity exists, for us, it's about digital transformation and about connecting everything to the cloud. And our technology portfolio is perfectly suited to enable various industries to do that. So, we feel pretty optimistic longer term.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nOK. OK. All right. And for my follow-up, I mean, I think, Cristiano and Akash, you both sort of talked about the content opportunity around Snapdragon and even sort of around fiscal '23 in the handset market.\n\nA lot of the pushback that we get from investors around that could really drive, particularly as we think about a weaker macro setup, is OEMs opting to use sort of previous generation Snapdragon chipsets and continue to sort of prioritize price in the market to make it much more affordable for consumers to buy smartphones to -- so as to trigger sort of volumes or help volumes in the market. I mean, when you think about sort of the fiscal '23, what are your planning assumptions when it comes to content gains or market share gains, and how confident are few of OEMs not sort of sticking to prior generation chipsets just to be able to optimize the price-cost equation here?\n\nCristiano Amon -- President and Chief Executive Officer\n\nThanks for the question, Samik. Let me start by giving you a direct answer. The design activity we have for next-generation Snapdragon is not showing that. It's showing that, as we expect in the mobile market, especially on the premium tier, it's about a flagship product every year.\n\nSoon, I think we're going to announce our next-generation Snapdragon in our Tech Summit in a couple of weeks, and I think design traction is very, very high. I think what we see right now is, structurally, we're very well positioned. If you look of the agreement we have with Samsung, plus the change of OEM landscape in China and how that positions Snapdragon as the premium and high-tier device, I think we're just going to see the fluctuations on the market size and how we deal in the short term with the inventory. But you should assume that the mobile market is going to continue to do its thing and we're going to have a product cycle transition.\n\nWe expect in the March quarter also to see the benefit of our increased share of Samsung.\n\nOperator\n\nMike Walkley from Canaccord Genuity, please go ahead with your question.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nThanks for taking my question. Just more on the planning assumptions for fiscal '23. Do you expect with the macro environment that the handset market shrinks again by double digits from calendar '22 for fiscal '23? And then as a follow-up, I'll just ask them both now. In terms of opex with the down sequentially, is this an area that you expect more opex cuts as you get into seasonally slower quarters? Or kind of flattish off this level? Thank you.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nMike, it's Akash. For fiscal '23, our market assumption is that the kind of the weak market we're seeing in the September-December quarter carries on to the rest of fiscal '23. And so, we're not using the first half of calendar '22 as the basis but really kind of the current, say, scale of the market carrying forward. So, that's our base assumption.\n\nAnd clearly, there is unpredictability and variance around it, but that's the planning assumption we're using for now. On the opex side, as we deal with the short-term headwinds, we're clearly taking decisive action on things that we control. As Cristiano mentioned, we've implemented a hiring freeze. We're reducing our spend in mature businesses, including handsets and SG&A.\n\nAnd then we're optimizing our R&D investments to increase focus on automotive and IoT, which is obviously the core of our strategy on diversification. And then finally, the way to think about fiscal '23 opex is we expect it will come in below fiscal '22 exit run rate. So, we're clearly taking action on opex from that perspective.\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nThank you.\n\nOperator\n\nStacy Rasgon with Bernstein Research, please state your question.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nHi, guys. Thanks for taking my questions. I want to ask a little bit about March quarter. So, you're saying that the inventory flush lasts a couple of quarters.\n\nYou said more than half of it is done in December quarter. It seems like there's a good chunk that's still coming in March. But at the same time, you also, Cristiano, just talked about the incremental Samsung volume starting to ramp in March. How do we think about the interplay of those two things? Is the Samsung volume enough to offset some of that channel flush that we're still seeing in March? I mean, you said big customers are changing some of their inventory plans.\n\nAre -- is Samsung one of those big customers? Is it -- it doesn't sound like it's just isolated to China. Just anything you can give us about like some of those drivers, both positive and negative, as they're going to the market would be helpful. And then I have a follow-up.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nSure, Stacy. It's Akash. So, from a March quarter perspective, you're right, the benefit from the Samsung launch for the new phone would be in the -- in kind of the second half of the March quarter. So, it comes in toward the end of the quarter, but that will be an advantage, whereas our share from 75% in G S22 goes up to global share in G S23.\n\nIn terms of inventory adjustment, I think you're right the way you heard it. You have an impact of $0.80 in the first quarter, and it's more than half. So, we do expect to have some impact from that going into second quarter as well. And then your last question on whether it's just the Chinese or Samsung and others adjusting inventory, it's really across the industry.\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nAll right. That's helpful. For my follow-up, I wanted to ask about the QTL run rate. So, I get the market's weak.\n\nBut presumably, Apple should be stronger than the rest of the market into December. And usually, that gives a pretty big lift. It implies that Android must be really bad in the December quarter unless there's something else going on. Can you just verify there's nothing else going on, no collection issues or anything like that? Is it just purely sort of Android market-related that's driving the run rate down? So, I think it used to be around $1.7 billion in December quarter, and you're guiding about $150 million light.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nYeah. Purely driven by market and mix functions. It has nothing to do with any other issue overall. Now just to highlight a couple of things for the QTL numbers in the December quarter.\n\nAt this point, we are not expecting normal seasonal volume increase into December. So, maybe one of the disconnects or questions you might have on the variance between those two numbers, $1.7 billion versus $1.55 billion, is driven by that assumption. And then second, I'd say is we do have FX impact that shows up in QTL. I highlighted in my script on a year-over-year basis, that's an impact of approximately $50 million that's included in our guidance.\n\nOperator\n\nRoss Seymore from Deutsche Bank, please state your question.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nThanks for taking my question. Akash, I want to go into the margin side of things. And I know you guys don't guide overtly to the gross margin side, but we can kind of back into generally where it is. So, within that $0.80 hit to the fiscal first quarter guidance, is there anything going on with charges on the gross margin side? Because the same sort of question that Stacy just asked on the revenue side for the March quarter will likely apply when people work through their models on the gross margin side.\n\nShould we expect a snapback there? Is it a one-time thing? Any sort of progression on the profitability would be helpful.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nYeah. So, first, Ross, on your direct question, there isn't a set of charges that are included in the number that's anything significant. So, that's the base assumption. The second thing I would say is if you look at where we guided our fourth fiscal quarter and where we came in, we actually did significantly better than our guidance.\n\nAnd then where we are guiding the first quarter is really in line with the guidance we had given for fourth quarter. So, nothing specifically to look at there. We're kind of navigating through the environment. And then over the last couple of years, as I said earlier, we are pretty happy with the way we've navigated through foundry price increases as well.\n\nSo, focus for us is staying disciplined on the pricing side and kind of taking advantage of the technology and products we have to improve our market share.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nThanks for that. And I guess as my follow-up, I just wanted to hit on the automotive side. I guess kind of a two-part question. In the near term, you didn't mention that as being down.\n\nSo, I assume -- is it safe to assume that that's going up? And then there's a general concern across the broader automotive ecosystem that it too will deal with the macro headwinds. I know you guys have a ton of market share gains. We're all in New York at your auto tech day. So, I get that longer term.\n\nBut are you seeing any evidence at all that the macro conditions might slow that -- the pace of that ramp that you're expecting over the next year or so?\n\nCristiano Amon -- President and Chief Executive Officer\n\nSo, let me give you the first answer. The way you should think about our auto, we have been -- you have the telematics business. Then you have the digital cockpit that was a big component of the design pipeline, and those are turning into revenue. And then the next one after that is ADAS.\n\nSo, we expect the story of Qualcomm automotive has been about the pipeline materializing into revenues and continue to generate growth, less impacted by the short-term markets. I don't know, Akash, if you want to add anything.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nI'll just say, kind of as you think about our auto business, it's all about new car launches and how the adoption of our solutions kind of helps our revenue as the cars launch. So, that's really the primary driver versus the overall size of the market.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nAnd it will be up sequentially in the first quarter? Just to clarify your guidance.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nOur guidance was that we said for IoT and handsets, it will be down. We were quiet on auto, which implies it's not going to be down.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nOK. Thank you.\n\nOperator\n\nJoseph Moore from Morgan Stanley, please go ahead with your question.\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nOK, great. Thank you. I wonder if you could talk about when you think the inventory built because it seems like you were on allocation until just a few months ago. Like do you think people were able to kind of get ahead of that and build inventory while it was still tight? Or did all that inventory build in a relatively short period of time, which would say that the recent numbers might be kind of overstated relative to demand?\n\nAkash Palkhiwala -- Chief Financial Officer\n\nYeah. So, it's Akash. That's a fair question. So, if you really think about our last earnings, one of the things we said was we expected customers to be cautious with their purchases in the second half of '22.\n\nBut since then, what has happened really is the macroeconomic environment deteriorated, and we went from a period of supply shortages to demand declines. And it's kind of an unprecedented change over a short period of time. And what you're seeing is really OEMs responding to that and making a change in their inventory policy and now drawing down on inventory. So, that's the impact that we're seeing in the December quarter that we sized at approximately $0.80.\n\nIf you also think about the seasonality, you typically expect December quarter to be a growth quarter as people build inventory going into the holiday season. And what we're seeing is the opposite. So, it does kind of come as a surprise in terms of how quickly the environment changed.\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. And then if I could follow up, what are you seeing on the pricing side in the more competitive markets, particularly in China? Is that the same as you've described? Or is there kind of incremental competition as you come out of a tight supply situation?\n\nAkash Palkhiwala -- Chief Financial Officer\n\nNo additional comments to what I just said. I mean, gross margin question that I answered kind of really factored. It's more of a pricing question than anything else, and those comments still apply.\n\nOperator\n\nLou Miscioscia from Daiwa, please go ahead with your question.\n\nLou Miscioscia -- Daiwa Capital Markets -- Analyst\n\nGreat. This is a longer-term question. I guess some news came out a little while ago from Ford and VM that they're closing down Argo. And also, one of the big self-driving ADAS pioneers, Levandowski, actually seems to change his view.\n\nRealize that you guys just had the Auto Day, which is great, and you're really looking out to 2026. But just any comments on this and that how difficult it will be actually to stick to the prior time frame that you had originally talked about at the Auto Day?\n\nCristiano Amon -- President and Chief Executive Officer\n\nVery good. Thanks for your question, Lou. The way you should think about our ADAS platform, and it's part of the Snapdragon Digital Chassis, we're really focused on scaling the technology and technology that has commercial applications. We really scale from level 2 all the way to level 3-plus.\n\nAnd we're not -- the market, I think, it's still -- for robotaxis, I think, is still a future market. We're really focused on attaching ADAS to every car. I think that's what has been the key driver of our design wins, and that's why we're winning across brands and across tiers for all the ones we announced. And we feel pretty bullish about ADAS materializing from the pipeline into revenues in the next few years.\n\nAnd you have to start thinking about that as they're multi-different levels of ADAS, starting with mandatory in-cap camera, all the way to highway autopilot. And we're really focused in that part of the market. That's where scale is.\n\nLou Miscioscia -- Daiwa Capital Markets -- Analyst\n\nOK. Thank you.\n\nOperator\n\nBlayne Curtis from Barclays, please go ahead with your question.\n\nBlayne Curtis -- Barclays -- Analyst\n\nThanks for taking my questions. I actually had two, and I apologize if you kind of answered this, but I wanted to ask it again. Just in terms of the weakness, clearly, Android has a lot of inventory to work through. Just kind of curious if you're baking in any non-Android softness or there's been concerns about production and such.\n\nI know it's a tough customer to answer, but is there a way you could talk about what you're embedding for the handset business, both Android and iOS?\n\nAkash Palkhiwala -- Chief Financial Officer\n\nYeah. I think the adjustment we talked about is primarily Android. So, that's how you should think about it.\n\nBlayne Curtis -- Barclays -- Analyst\n\nPerfect. And then I was just kind of curious, the thought process on rolling in the RF business. I know this is a big TAM for you guys, and you've made a lot of good progress in kind of penetrating that. So, I'm just kind of curious, if you just walk through the thought of rolling that back in starting next year.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nSure. So, when you look at our RF front-end business, it's kind of an end-to-end, modem-to-antenna development cycle. And because of that, we've become the No. 1 player in handsets already.\n\nWhen we look forward, the way we think about the growth in the business is it's driving 5G further into handsets and Wi-Fi 7 but also into automotive and IoT. In one of the new disclosures we gave, and you'll see this in our web slides, in fiscal '22, we had $137 million in auto RF front-end revenue, and we have a design win pipeline of greater than $900 million. And then within IoT, we have RF front-end revenue of $405 million. So, those numbers are becoming of scale.\n\nAnd generally, still, it was mostly handsets. We kept it separate. But I think we're getting to a point where there -- it's becoming at scale within automotive and IoT. And so, we thought the change in the revenue streams was -- this was the right time to do it.\n\nOperator\n\nTimothy Arcuri from UBS, please go ahead with your question.\n\nTimothy Arcuri -- UBS -- Analyst\n\nHi. Thanks. I had two. I guess the first one is on Apple.\n\nYou did update that you now expect the vast majority of the launch in 2023 for you to be in the product. That's not a big surprise, I think, to most people. And you said that by 2025 that you'll be out of the products, but you used the word product. So, I just want to clarify that you are still assuming that once they don't need your modem anymore that they will still pay you a royalty for said patents?\n\nCristiano Amon -- President and Chief Executive Officer\n\nThis is Cristiano. The licensing business is completely independent of whether or not we supply a modem to them. So, your assumption is correct. We expect to continue to have licensing revenues.\n\nAnd I think consistent with what we said in the past, we're focused on our strategy on long-term customers, and we just can assume that our planning assumption is we don't have any visibility and continue to provide the modem in '25.\n\nTimothy Arcuri -- UBS -- Analyst\n\nPerfect. Thank you, Cristiano. And then I guess also, Akash, I had a question on the financial model for QCT. I know you gave it a year ago, and things have changed a lot since then.\n\nAt the time, you were sort of implying if you sort of ran the growth rate out to '24, it was sort of implying a $40 billion QCT revenue out in 2024. You're now down to sort of $8 billion a quarter, so you're now run rating more like $32 billion. Do you still feel confident that you can get back next year into the $10 billion a quarter that would get you to that $40 billion financial model next year?\n\nAkash Palkhiwala -- Chief Financial Officer\n\nYes. So, as I'm sure you know, we just delivered $38 billion of revenue for fiscal '22 for QCT. And so, our strategy is unchanged. We are executing so far well ahead of target.\n\nAnd so, really what we're focused on right now is navigating the current environment. No updates to our Investor Day targets.\n\nOperator\n\nBrett Simpson from Arete Research, please go ahead with your question.\n\nBrett Simpson -- Arete Research -- Analyst\n\nI wanted to ask just the extent to which Qualcomm thinks they're under-shipping demand in the December quarter. And maybe just factoring in the weak outlook for December, and I think you talked about the flagship ramp with Samsung in the March quarter. Is it fair to assume the December quarter is a trough for Qualcomm this cycle? I mean, any perspective there as we look through that fiscal '23 would be very helpful. Thank you.\n\nAkash Palkhiwala -- Chief Financial Officer\n\nYeah. Hi, Brett. From an inventory drawdown perspective, we definitely see first quarter as the bottom. As we said, more than 50% of the inventory drawdown, we think, happened in the first quarter.\n\nAnd so, that hopefully answers the question you were asking.\n\nBrett Simpson -- Arete Research -- Analyst\n\nOK. Thanks. Thanks, Akash. And maybe just a follow-up on China.\n\nI mean, it's something that certainly is on a lot of investor minds. How does Qualcomm feel about your position in the region, particularly with the geopolitics that's happening right now? Do you see risks here long term to the business? Or is there scope for growth in China? Any perspective there would be much appreciated. Thank you.\n\nCristiano Amon -- President and Chief Executive Officer\n\nThanks for the question. Look, we -- the latest set of restrictions, we were not impacted by those. And we have seen our business in China to continue to expand, especially as we grew into auto and IoT. We see corresponding expansion of those business in China as well.\n\nI think we have a global position. I think we -- it's one global standard, especially when you think about the mobile market in 5G. And we look at a position that we have in China as one that is pretty stable right now. It's very difficult to predict this environment.\n\nBut so far, I think, continue to be a strong business for Qualcomm with growth opportunities. And we're hopeful that the extended lockdown will end soon, and that's going to have likely a positive impact on the size of the phone market.\n\nOperator\n\nThat concludes today's question-and-answer session. Mr. Amon, do you have anything further to add before adjourning the call?\n\nCristiano Amon -- President and Chief Executive Officer\n\nYes. Thank you, everyone, for listening to the call. I just want to say a big thank you to all of our employees and partners that are helping us through the incredible fiscal '22 and how we navigate to fiscal '23. Just a few comments.\n\nWhen you step back from the current short-term macroeconomics and this temporary cyclical inventory drawdown, we feel that Qualcomm is very well positioned. A lot of the trends continue to point to our technology road map. You need connectivity, advanced processing, and artificial intelligence at the edge. And as we outlined in the script, we see that everything is on track, including expanding design for our Windows on Snapdragon, wafer custom CPU, their ability to continue to materialize the auto, as well as IoT and industrial IoT, and the digital transformation has proven to be overall resilient in the long term.\n\nSo, we will be decisive in managing operating expenses and especially if the downturn gets steeper or more prolonged than we expect. But I would like to remind everyone that the current inventory is a cyclical adjustment that has no impact on the underlying long-term earnings power of the company. And we're have -- we're well on our way, executing our growth strategy and all the fundamentals remain in place. Thank you so much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMauricio Lopez-Hodoyan -- Vice President, Investor Relations\n\nCristiano Amon -- President and Chief Executive Officer\n\nAkash Palkhiwala -- Chief Financial Officer\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nMike Walkley -- Canaccord Genuity -- Analyst\n\nStacy Rasgon -- AllianceBernstein -- Analyst\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nLou Miscioscia -- Daiwa Capital Markets -- Analyst\n\nBlayne Curtis -- Barclays -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nBrett Simpson -- Arete Research -- Analyst\n\nMore QCOM analysis\n\nAll earnings call transcripts"
}