{
  "companyName": "American Airlines Group",
  "companyTicker": "AAL",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/american-airlines-group-aal-q3-2022-earnings-call/",
  "content": "American Airlines Group (AAL 0.16%)\nQ3 2022 Earnings Call\nOct 20, 2022, 8:30 a.m. ET\n\nOperator\n\nThank you for standing by, and welcome to American Airlines Group's third quarter 2022 earnings call. Today's call is being recorded. [Operator instructions] And now I'd like to turn the call over to your moderator, head of investor relations. Mr.\n\nScott Long. Please go ahead.\n\nScott Long -- Head of Investor Relations\n\nThanks, Latif. Good morning, everyone, and welcome to the American Airlines Group third quarter 2022 earnings conference call. On the call this morning, we have our CEO, Robert Isom; and our vice chair and CFO, Derek Kerr. A number of our other senior executives are also on the call for the Q&A session.\n\nRobert will start the call this morning with an overview of the third quarter, and Derek will follow with details on the quarter and our operating plans and outlook going forward. After Derek's comments, we'll open the call for analyst questions followed by questions from the media. [Operator instructions] And before we begin today, we must state that today's call contains forward-looking statements including statements concerning future revenues, costs, forecast of capacity, and fleet plans. These statements represent our predictions and expectations of future events, but numerous risks and uncertainties could cause actual results to differ from those projected.\n\nInformation about some of these risks and uncertainties can be found in our earnings press release that was issued this morning as well as our Form 10-Q for the quarter ended September 30, 2022. In addition, we'll be discussing certain non-GAAP financial measures this morning, which exclude the impact of unusual items. A reconciliation of those numbers to the GAAP financial measures is included in the earnings press release, which can be found in the Investor Relations section of our website. A webcast of this call will also be archived on our website.\n\nAnd the information we're giving you on this call this morning is as of today's date, and we undertake no obligation to update the information subsequently. Thank you for your interest and for joining us this morning. And with that, I'll turn the call over to our CEO, Robert Isom.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nThanks, Scott. Good morning, everybody. Thanks for joining us. This morning, American reported a third-quarter GAAP net income of $483 million.\n\nExcluding net special items, a third-quarter net income of $478 million. We produced revenues of $13.5 billion, which sets a new record for any quarter in the history of American Airlines. When I took on the CEO role in March, I told you American was going to do two things this year: run a reliable operation and return to profitability. It's taken us a bit longer than we would have liked to get where we want on the operations side, but we're pleased with how the airline is performing today, and we know we're on the right trajectory.\n\nAs far as profitability, we have now delivered two profitable quarters in a row and we're forecasting a profitable fourth quarter with continued strength in demand. We could not have made either of those commitments or ensure we deliver that item if it weren't for the hard work of the American Airlines team. They do a phenomenal job every day taking care of our customers and each other. Their teamwork, resiliency, and determination allow us to continue our focus of running a reliable operation and sustaining profitability.\n\nWe keep that focus because in our business, reliability is everything. It's the foundation of the service we provide our customers. A predictable solid operation changes the entire work experience of our team. Reliability also enables our long-term profitability and achieving sustained profitability is how we will meet our debt reduction targets and continue to invest in our team and deliver the network products and services our customers want.\n\nWith that in mind, let's talk more about the third quarter specifically. Our record quarterly revenue of $13.5 billion is a 13% increase over 2019. Notably, we achieved this record revenue while flying nearly 10% less capacity than we did in the third quarter of 2019. And we're pleased to have exceeded our initial guidance on both revenue and pre-tax margin in the third quarter despite constraints still facing American and the rest of the industry.\n\nAmerica's third quarter results, including our record revenue performance are significant, considering their macroeconomic uncertainty facing so many people. Demand remains strong, and it's clear that our customers in the U.S. and other parts of the world continue to value air travel and the ability to reconnect post pandemic. Importantly, many of the demand trends we saw emerge during the pandemic are becoming more consistent and shaping our commercial focus for 2023 and beyond.\n\nLeisure and business revenue remain incredibly strong, again, surpassing 2019 levels in the third quarter. Demand for small- and medium-sized businesses and customers traveling for a combination of business and leisure continue to outpace the recovery of managed corporate travel. As that revenue continues to build, it will be additive to an already strong base of business demand, led by small and medium business and blended trips. That as well as the return of long-haul international travel leaves us very bullish about overall demand even in an uncertain economic environment.\n\nThe changing nature demand provides an opportunity to rework our commercial offerings to better meet the needs of our customers and create a more resilient and profitable business. We continue to develop the most comprehensive airline network in the world. As we have shared on previous calls, over the past few years, we have made the decision to greatly simplify our fleet and network focusing on our flying on where we can create outsized customer value and working with our partners to create choices and value in areas where it's cost prohibitive to do so ourselves. This means prioritizing the flying that can best generate a return today, not bringing back flying it was only marginally profitable before the pandemic or that we had hoped would one day generate a return.\n\nIt also means using our partners to fill in the gaps and deliver a seamless network to our customers. That work continues, particularly with our Northeast alliance with JetBlue, our West Coast international alliance with Alaska and our Atlantic and Pacific joint businesses. To better match our product offering to customers and network, we recently announced in [Inaudible] our long-haul fleet that will give American an unrivaled premium experience among U.S. carriers.\n\nStarting in 2024, customers will see new flagship suite seats on our Boeing 777-300ER aircraft as well as on our new Boeing 787-9 and Airbus A321 XLR deliveries. With these new interiors, premium seating on our long-haul aircraft will grow by more than 45% by 2026. We're working to give our customers better choices and more access to the world's largest and best travel rewards program, and that's AAdvantage. It's clear that customers want more when they shop for travel, more choices on ways to earn and use miles and more incentives to earn miles even when they don't travel.\n\nSo turning to our operations. As I mentioned at the asset, operating reliably is critical to everything we do. We have the youngest fleet and the best network and partners in the industry, but we can't take full advantage of those assets if we aren't running reliably. That's why we continue to invest in our operations with additional resources and new technology, and those efforts are paying off.\n\nDespite a challenging operating environment with hurricanes in Florida and Caribbean, and flooding in Dallas Fort Worth region, we restored our operating reliability to pre-pandemic levels in the third quarter. And we did it while flying a schedule that was 25% larger than our closest competitor. We have delivered record on-time arrival rate and completion factor so far in October and expect to carry that momentum through the upcoming holiday season and beyond. Hurricane Fiona and Ian were devastating for so many, including the communities we serve in the places our team and customers call home.\n\nThe American Airlines team stepped up in amazing ways to take care of our customers and each other during the very challenging circumstances. Through our AAdvantage program and the partnership with the Red Cross, almost $4 million has been raised to support victims of the storms, and American continues to support our team through the American Airlines Family Fund. The storms moved through quickly, but they had an outsized impact on American given the size of our operation in Florida. We had to cancel more than 1,500 flights the last four days of September, given the impact of Hurricane Ian.\n\nWe estimate right now that these storms reduced revenue by about $40 million. As we close out the year and look to the first quarter, we continue to size the airline for the resources we have available and the operating conditions we face. This approach and our strong operational performance in September and so far in October give us a lot of confidence as we head into the busy travel holiday season. In closing, we remain very encouraged by the continued strength in demand and the trends we're seeing across the business.\n\nAmerican has the best team and most efficient assets in the industry, and we have built an airline that can be successful in many different demand and economic environments. Looking ahead, we're focused on investing in our operations, our network and our partnerships to ensure we can continue to deliver for our customers. And of course, we'll do so while remaining focused on achieving sustained profitability and reducing our debt. And with that, I'll hand it over to Derek.\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nThank you, Robert, and good morning, everyone. I want to start by thanking the American Airlines team for their efforts during the third quarter. Our airline success during the quarter was only possible because of the hard work of our team during a challenging summer. This morning, we reported a third-quarter GAAP net income of $483 million, excluding net special items, we reported a net income of $478 million, both equate to earnings of $0.69 per diluted share.\n\nSince the beginning of the year, we have been focused on returning the airline to sustained profitability. We are pleased that our third quarter results build on that progress we made in the second quarter. We beat the high end of our initial earnings expectations due to the continuation of the strong demand environment. The third quarter was our highest quarterly revenue in company history, beating the second quarter of this year.\n\nThe domestic and short-haul international entities continue to lead the revenue recovery, and we expect further improvement in long-haul international as we continue to grow back our capacity. The investments we have made to renew and simplify our fleet position us well for the future. We continue to operate the youngest, most fuel-efficient fleet among U.S. network carriers.\n\nIn August, we began taking deliveries of new 788 aircraft from Boeing for the first time in 15 months. In the third quarter, we took delivery of four 788s, and we expect to receive five for the remainder of this year and four in the first half of 2023. Our Boeing 789s are still expected to be delivered starting in 2024. During the quarter, we also took delivery of 3 A321neos and reactivated 6 7378 from long-term storage.\n\nIn the fourth quarter, we now expect to take delivery of eight A320neos, three E175, in addition to the 5788 I mentioned previously. Based on our latest guidance from Boeing, we now expect to take delivery of 19737 MAX 8 in 2023 compared to the 27 deliveries that we were previously expected. This change in timing will shift planned capex out of 2023 into future years. Our 2023 aircraft capex net of leases is now expected to be $1.6 billion.\n\nWe ended the third quarter with $14.3 billion of total available liquidity, which is $700 million higher than our initial third-quarter forecast due to continued forward booking strength seen throughout the quarter. This level of liquidity is more than double the amount we had at the year end of 2019. Reducing total debt continues to be a top priority, and we remain on track with our target of reducing overall debt levels by $15 billion by the end of 2025. As of the end of the third quarter, we have reduced total debt by $5.6 billion versus the 2021 peak.\n\nAnd as I mentioned last quarter, we expect further benefit from a reduction in our pension liability that will make -- reflected at the end of the year. In the fourth quarter, we expect to make approximately $540 million of scheduled debt and finance lease payments freeing up additional collateral in the process. We maintained our elevated liquidity position throughout the third quarter and continue to balance appropriate target liquidity levels with the expected recovery, debt reduction opportunities and investment in the business. We'll continue to target $10 billion to $12 billion in total liquidity in the medium term and intend to utilize excess liquidity above that level to accelerate our deleveraging initiative at the appropriate time.\n\nLooking forward, our next term loan maturity is our $1.2 billion term loan, which does not mature until December of 2023. Looking to the fourth quarter, we expect to produce an operating margin of between 7.5% -- 5.5% and 7.5% based on the current demand and fuel price forecast. We currently expect to produce total revenues that are 11% to 13% higher than the fourth quarter of 2019 on capacity that is 5% to 7% lower than 2019 levels. This continued strength in demand is expected to result in total revenue per available seat mile that is 18% to 20% higher than 2019.\n\nOur fourth quarter CASM, excluding fuel and net special items, is expected to be up between 8% and 10% compared to 2019. These higher unit costs versus 2019 are primarily driven by inflationary pressure and lower relative asset utilization. Our current forecast for the fourth quarter assumes fuel between $3.51 and $3.56, which is approximately 70% higher than 2019 levels. Finally, while we are still in the process of building our 2023 operating plans, I'd like to share a few thoughts on our approach.\n\nWe continue to believe that 2023 demand for air travel will be robust. We currently see no signs of demand slowing as we move into the new year. But as always, we will continue to keep a close eye on the macroeconomic environment and will adjust as plans, if necessary. Importantly, we will continue to size the airline for the resources we have with a focus on reliability and profitability.\n\nAs we move into 2023, the constraints facing our business today will remain. Those constraints are slower than planned aircraft deliveries and lower utilization of our fleet largely driven by regional pilot constraints. Therefore, based on our preliminary plans, we expect our 2023 capacity will be between 95% and 100% of 2019 levels. We believe this approach to capacity will produce strong profitability and free cash flow reliable operating performance and allow appropriate levels of flexibility in this very fluid environment.\n\nIn conclusion, demand for our product is strong and we remain nimble in our planning and execution to ensure we optimize for the environment we are operating in. As we close out 2022 and move into 2023, we're confident in our ability to continue to deliver on our stated objectives of operational reliability and sustained profitability because of our world-class network, efficient fleet, and incredible team. With that, I will open up the line for analyst questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of David Vernon of Bernstein.\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nI was wondering maybe if you could talk a little bit about how the fleet changes you guys have made through the pandemic are sort of impacting operational performance. Obviously, it's going to have an impact on reliability. But also when you think about sort of scheduling the network, maybe getting better utilization, maybe taking some peaks out of the schedule being unconstrained by the directionality of some of the equipment constraints that are in there. Can you just talk a little bit about how those fleet changes have impacted overall productivity and the early signs there?\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nDavid, thanks for the question, too. And we're really proud of what we were able to do over the pandemic. A bunch of different projects went into place. You know the story about rationalizing the fleet, getting down really from a mainline perspective, down to two types of narrow bodies and two types of wide bodies.\n\nWe did the same thing in our regional fleet as well. But during the pandemic as well, we accelerated our cabin consistency project that was a project where we were able to upsize the 737 and then also make sure that our A320 family were consistent in terms of seating as well. All that work is done. So it's freed up a tremendous amount of resources.\n\nBut then just in terms of operating, think about everything from not having to carry as many park pools in inventory. Think about pilot training and what's required from going from an FO on one equipment type to another and the simulators that are required for that, the training that's required for that. So look, as we get back to full utilization of our resources that's going to be something that I think pays dividends. You'll start to see it as we get back really to full utilization.\n\nAnd I think that that's something that plays well long into the future. We see it already. I know it's producing better reliability. It's easier for our team.\n\nAnd from a revenue perspective, I'll hand it off to Vasu. I can tell you it's making his job easier.\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nYes. I'll pick up right there, David. I think it's a great question. As we went through the pandemic, a major principle in how we've been planning the airline is to build it in a way where it is as nimble and responsive to demand and is resilient base crisis.\n\nAnd as you look at that over time, really the wide-body fleet for American Airlines was a strange kind of liability because that's the most volatile part of our business. It's part of our business that our customers have just valued a lot less than our short-haul network. And so for us, as you look out there, we took jets out. And so look at the fourth quarter schedule, we are 15% smaller long-haul airline.\n\nBut very importantly, what we've also done right is when we have such a big fleet of narrowbodies, we have a lot more flexibility in how we send them. So we've changed our capacity mix pretty materially from pre-pandemic. As we were entering the fourth quarter in 2019, we were about a 70-30 short-haul, long-haul airline. As we enter the fourth quarter now, we're something a lot closer to an 80-20 short-haul, long-haul airline.\n\nAnd that airline that we have is something which is a lot more dynamic. There's fewer fleet types like Robert said, if demand changes, we're much more able to adjust. And quite frankly, the short-haul business is and has been for the last 20 years, a much more durable part of it. And frankly, you see it right now.\n\nRight now, long haul is doing well. At some point in time, it will come down, but short haul remains pretty consistently strong across the business cycle.\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nAnd as you think about that plan to get back to 95% to 100% next year, is that going to get you the full benefit of utilizing the new fleet? Or are we still going to be carrying some additional sort of productivity headwinds from training or resourcing or just underutilization from an hours per aircraft per day kind of thing.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nDavid, I'll start. Derek can chime in here, too. It's a good question, but we look at it as upside for the airline. We know that we can find more out of the assets that we have.\n\nThere are constraints out there, notably pilot constraints, both for the regional side and just the massive amount of training that we have to do on the mainline side. Those constraints are going to be out there. Over time, they'll break free. But we're confident that we can actually get more utilization out of the current fleet to actually get us beyond flying at 100% of 2019 levels.\n\nAnd that's where I think the cost story as the airline gets really interesting. But it's going to take a little bit of time to get to that point.\n\nOperator\n\nOur next question comes from the line of Savi Syth of Raymond James.\n\nSavi Syth -- Raymond James -- Analyst\n\nCould you please talk about a little bit more on the hiring and kind of training side on the mainline, where you are on that and kind of expectations as you head into 2023?\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nSure, Savi. I appreciate the question. Look, we're hiring more pilots this year than we ever have in our history in a given year. So we're looking at hiring almost 2,000 pilots.\n\nWe're on track to actually accomplish that from a mainline perspective. So I feel really great about that. But let's face it. Training that many pilots is something we've never done before coming out of the pandemic.\n\nWe've had to make sure that resources are all in the right spot whether that's additional simulators, resources like that or even things like instructors. So that's all working its way through, and we feel very confident that over time, that our pilot pipeline for the mainline is very strong and our training resources are absolutely going to match the needs that we have going forward. The regional side of the business is a little bit different. We didn't hire and let's face it, well, we didn't hire for two years during the pandemic at all.\n\nAnd then not only that, people didn't come into the business. And so we've got to work our way through that. And you got a supply issue that I think is coming back online. I feel really confident about it.\n\nWe're facilitating that through things like our cadet program and creating financing vehicles for people that want to get into the business. That's all going well. But then the other issue is what's your run short, you actually have issues of getting kind of pilots from the right seat to the left seat and there are hours requirements that have to -- that you have to fulfill. We're working our way through that.\n\nThat's going to take a little bit longer by opinion. That's maybe two, three years to work out versus the mainline side, which I think is something from a training perspective, we really get fully caught up over the course of the next year.\n\nSavi Syth -- Raymond James -- Analyst\n\nThat's helpful. If I might, just following up on that. So I appreciate the kind of the thoughts on where capacity could be next year. Any way you could help us think about the cost side of things and how much of the headwinds that you're seeing today, we might see kind of go away as you kind of get through next year?\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nWell, Savi, I mean we're still going through our planning process. So we gave the guide for the ASMs, but we're not ready to guide costs yet. We will in the January call. We're working through our budget.\n\nWe're in that today. So the CASM will depend on what we fly, but we will go through that on the January call.\n\nOperator\n\nOur next question comes from the line of Jamie Baker of J.P. Morgan.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nTwo quick questions for Derek and then a follow-up for Vasu. Derek, why the pivot from pre-tax to operating margin guidance? And second, what's the increase in interest expense year on year at the current forward curve for your floating rate debt?\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nOK. Just no reason for the pivot. I mean we're just -- could be inconsistent with the rest of the airlines from an operating perspective. That's what we're focusing on.\n\nAnd then on the interest rate, I mean, our cost of debt has gone probably from about 4% to 5% and our fixed floating is 70-30. So as we look into next year, our interest expense is -- this quarter was around $494 million. So that go up in the fourth quarter to about $530 million. So it's probably about $40 million from the third to fourth quarter on an interest expense basis.\n\nBut that's totally offset right now with the cash levels we have on interest income. So it was offset in the third quarter interest income depends on where cash is in the fourth quarter. And you can see that our guide for non-op is pretty even quarter over quarter.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nYes. OK. That's why -- I appreciate that. So Vasu, as I continue to think through how American needs to adapt to new travel patterns.\n\nAnd look, maybe you don't aside from just shifting some capacity to certain days of the week, maybe Thanksgiving return peak shifts a bit. But I keep thinking there's more that can be done fair fences, promotions, advantage. Just to better capture these new travel patterns out there or is it just as simple as adjusting the day-ality of schedules? Not sure if day-ality is an American term, but I trust you know what I mean.\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nI think you just made a term, Jamie. That's fine. Keep going.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nWell, we use it at Air Mike. But that was a long time ago. Just really wondering if there's more than just pure scheduling nuances to best monetizing all these new travel patterns that are emerging, certainly much to my personal post-COVID surprise?\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nYes. That's a great question, Jamie. And let me start with just some context setting for just how indeed the world has changed. First of all, we are, in general, really encouraged by what is happening with aggregate demand.\n\nAs we say, the demand for travel and for air travel, in particular, has never been higher and remains strong in the kind of all future periods. But the shape of that, the composition has changed a lot. Now we're in a place for the quarter where 45% of our revenue came from blended trips, about 30% from discretionary or what we historically called leisure trip. And the remaining 25% from nondiscretionary that we've historically called business trips.\n\nImportantly, within business, about 17 to 20 points of that is coming actually from noncontracted unmanaged businesses. The remaining kind of five to eight points are from contracted corporations. That's meaningfully small, call it, four, five points smaller than historic. And that is the thing that is actually really encouraging for us for a couple of reasons that that big category of blended demand, which is growing.\n\nFirst and foremost, that unmanaged business is coming in at yield values where their gross yields are similar to the corporate contracted transactions that are not there. But very importantly, they're net yields, not of their cost of sale is actually very often higher than what we spilled off. But two, and kind of more directly related to your question, what we find is that indeed, this blended demand uses our airline network in a very economical way. Almost half of that demand is using O&D markets in our system where American's network is uniquely advantaged.\n\nBut additionally, we've seen across our system, not just for blended demand, two points of traffic shift from what we'll call the peak business periods in the day. That's pre-0800 and post 1600 and into the body of the day, the 800 to 1600 window. So if you think about that, historically, we've done a lot to kind of peak our schedules for the ends of the day, but now we're seeing a lot of really high-yielding demand in the places where it's most economical to frankly go and run the airline. And that takes me to the third point, which is where you're starting to go.\n\nBut as we start to contract, and we've done a lot of this, when you don't look at the transaction, look at the customer behind it, what we're finding is that a customer who has a blended trip in their profile is twice as likely to go and enroll in the Advantage program. They are three times more likely to sign up for one of our co-branded credit cards, they don't already have it. Those who have a credit card spend 40% more than a typical business customer. And these customers are overwhelmingly going to aa.com because it's frankly the only place where you can go and price and shop for a blended trip.\n\nSo that is very much influencing how we're thinking in a couple of meaningful ways, as you say, that first and foremost, the value that we can deliver to these customers through our loyalty program, as we call them, our currency partnerships with people such as Citi are paramount importance to our customers, and therefore, to us. And then there's a lot about the selling and distribution model that the airlines have operated on certainly that we've operated under that warrant some change that we can go in certain customer demand.\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nThat's super helpful. My risk is acing the right thing down at both the type and I hadn't thought about the loyalty angle. I appreciate it.\n\nOperator\n\nOur next question comes from the line of Duane Pfennigwerth of Evercore ISI.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nAnd my compliments on that pronunciation, better than many earnings calls. On the $95 million to $100 million for next year, I wanted to ask you how that might compare to a theoretical upper limit. How much of this is conservatism just given fuel and kind of macro uncertainty versus just your modeling of the staffing constraints. So if you really wanted to step on the gas, if the environment warranted, how much higher could you push than that 100%?\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nDuane, thanks for the question. Look, for us right now, we're going to size the airline for the resources that we have and the demand environment that we face. There's a lot of variability in just about everything that we deal with right now. But the thing that I think that Vasu will tell you, Derek, and our finance team will tell you, the best thing we could do is make sure that we have a predictable, stable airline, something that we can point to in the future.\n\nThat's what we're trying to do, given all the constraints that we face right now. So from the perspective of what is a limiting factor, probably try to fly a little bit more, you know what, we've got pilot constraints that are going to take a while to work their way through. Notably, we talked about what's happening on the regional side of things. So in terms of an upper bound, I don't have a number there.\n\nI don't know if we've actually gone out and calculated the max level.\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nNo. I think, Duane, as we talked about on the last call, we do have some unsupportable aircraft at this point in time. as things change on the regional side, it's all dependent on pilot hiring and how much the main line hired from the regionals. And so we're trying to be prudent in what we do as we saw in the summer, making some of those kinds of assumptions was not easy.\n\nSo I think we're being prudent on it. If there is more capability for us to fly from a regional perspective and a mainline perspective, because those constraints come down, then we'll be able to -- we could fly more with the fleet that we have, put it that way. So is that a couple of percent Probably. If we flew the whole thing, we could get somewhere in the 5% to 10% range from the fleet that we have.\n\nBut I think those constraints are going to be there. As Robert said, the regional constraints are going to be there for a longer period of time. We're working through them, and hopefully, there's other options that we have to bring that flying back up.\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nThat's helpful perspective. And then just for a quick follow-up on ops. Can you quantify the savings or the assumed savings from running a better operation in your 4Q guide? And it's an American question, frankly, it's an industry question. What have we learned or institutionalized from this summer that gives you confidence that sort of these better ops will sustain? Maybe in fourth quarter, frankly, it's less peak.\n\nIt's fewer ASMs, maybe that's the driver and the confidence. But if you can help us understand what's been institutionalized from this summer. That would be helpful.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nYes. Duane, that's something we talk a lot about. And look, we talk about utilization and getting more out of it, but there's always an offset to that utilization with running an airline that is potentially less reliable. So what we've done right now is we've taken a look at and given that the pandemic brought so much variability in just about every input to the business, OK? Everything from partners, at airports to aerospace limitations to Boeing and Airbus, delivering aircraft, our pilots, and flight attendants.\n\nWhat we're trying to do is build in at least a little buffer in a number of areas right now. And that is absolutely something that we're carrying on into the fourth quarter. Where does it show up? It shows up in higher reserve levels for pilots and flight attendants. Or does it show up? It shows up in terms of maybe not running even some of the aircraft that we have is hardest hard as you would.\n\nIt shows up in terms of making sure that we're trying to take into account restrictions that we have in the airports and with aerospace as well. So we're putting that all in. My hope is that as the airline gets up to speed and our other partners and vendors get up to speed, but that's something that we can slowly take a look at. But to the point that you brought up, this airline, American Airlines, the industry as a whole, we need to get back to reliability levels that we have pre pandemic and even higher.\n\nThat's the focus, and you're going to see us success in that, whether it's through putting in degrees of safety factor and things or just making sure that we fly the outer line appropriate for demand and operating conditions.\n\nOperator\n\nOur next question comes from the line of Michael Linenberg of Deutsche Bank.\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nI want to kind of touch on this as sort of a follow-on on Jamie's question about sort of structural change here. And I don't know if it's to Robert or Vasu. Robert, you talked about 45% more premium seating in your fleet. And when I look at some of the numbers, you can correct me if I'm wrong, but it looks like you're like 7879, the premium seats are going to go up by 60%.\n\nAnd when I look at where you will be on an absolute basis post this new product rollout, you'll be pretty well ahead of United and Delta. And I'm just -- it feels like it's a bit of a bet and it is maybe more of a secular shift to have that much premium seating. And I'm just -- I'm thinking what is the potential downside risk, sort of how you think about that? And it also looks like, I guess, we're going to see the retirement of the first class on the 777s. Is that right?\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nYes. Vasu, go ahead to start this one.\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nYes. Mike, thanks for the question. It's a very good one. I'll answer your second one first.\n\nYes, the first class will not exist on the 777 or for that matter, at American Airlines for the simple reason that our customers aren't buying it. The quality of the business class C has improved so much. And frankly, by removing it, we can go provide more business class seats, which is what our customers most want or most willing to pay for. But look, a really important thing to your first question, starts actually with the structure of the network that's here now versus what was their pre-pandemic.\n\nAnd though we've talked about it on a lot of calls, it probably can't be emphasized enough. And it's something which you can see through all the successive schedules -- on the quarterly schedules through COVID and even into what we published through the rest of this year and early next. But again, remember, for us, we're running a long-haul business now that is 15% smaller than what existed pre-COVID. And furthermore, of that, about 70-ish percent of our -- presume we're an 80-20 short-haul, long-haul split.\n\nBut for us, very importantly, 70% of our capacity almost 70% is in our core hubs. What's not there is really in some really strong international markets that are very premium-heavy. Heathrow long-haul South America, eventually Tokyo, places like that or else in really long-haul markets where, frankly, through the strength of our partnerships, we're able to go and make a larger premium cabin work. So because of that, we -- the airline has actually arced itself to a place where there's a lot more demand for its premium seats.\n\nThe last thing I'll say and this actually picks up right where my answer to Jamie left off, too. And what we're really encouraged by right now is actually long-haul profitability for American Airlines is better than what has historically been pre 2019 on a margin basis, in some cases, on an absolute basis. What it's being driven by is not just the premium cabin. But interestingly, it's being driven by blended customer demand there.\n\nI mean it used to be that large contract in corporations were as much as 50% of what filled those seats. Now between 40% and 50% of it is blended demand, and the rest of it is actually leisure demand that is willing to go and pay more for the quality of the business class seat. All of that is coming at a higher net yield values than what was there before. So we're really encouraged about what the future holds.\n\nAnd that's a lot of the context behind some of these bets we're making with the long-haul configuration.\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nVery helpful, Vasu. If I can just sneak in one other one. And just on the regional side. You guys seem to be doubling down on adding more regional service, including 50 seaters.\n\nAnd I know in the past, you've talked about how that historically has been -- those markets have been fairly high yield. But how does that square with just the rising costs that we're seeing on regional labor, other input costs for the regionals? And is maybe the offset that you have this sort of unique from a network perspective, you among all the carriers may be the only game in town in so many of these markets that you're still able to make it up in revenue. How do you square that?\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nVasu, let me start and then you jump in. First off, look, just in terms of the 50 seaters that we have, we've reduced the number of 50-seaters that we've had in place over time. I don't have the exact number hand. But what we have is a network that's ideally suited for servicing a number of regional markets.\n\nAnd you know what, 50 seaters is going to have in place in our system. But right now, the big focus is getting the aircraft that we have back up in the air. There's not a doubling count it say, \"Hey, this made sense before. It makes a lot of sense now.\n\nEspecially given what we're seeing with the rest of the marketplace.\" Vasu, go ahead.\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nYes, that's right. I'll add a couple of doses of back to that too especially that I was really encouraged by is when we crossed over from the summer into September, which is historically a weaker demand time for the airlines. What we found is that historically, in, let's call it, September of 2019, only about 20% to 25% of our revenue was coming from places where our O&D markets where our network was advantaged. When we got in September of this year, it was somewhere between 30% to 33% coming from places where our network was advantaged.\n\nAnd indeed, we see this over and over again, that we make 30% more O&Ds than our competitors, 30% more O&Ds and markets that where we consider them to be advantaged. And by that, I mean either O&Ds, we're the only ones who serve it or we serve it with the most convenient schedule. And so for us, we see that very much. I mean, the way our network is just structurally built we are the very best at serving all of the small cities of the Western Hemisphere and connecting customers there to the global marketplace.\n\nOthers are a whole lot better at flying long haul to Asia, or whatever the case might be. But for that reason, there are some really unique things to American Airlines, where we have a lot of value in a range of equipment types from the smallest 50- or 75-seat RJs to a 200-seat narrow-body, whereas for a lot of others, a lot more of their value may be and having multiple flavors of a 300 feet wide line.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nGo ahead, Derek.\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nMike, the only thing I was going to add is we have three wholly owns, Piedmont is going to fly 50, 50 seaters. That's what they have today. We're growing those back for sure. In boys getting out of the 50 seaters over time, we'll fly some next year.\n\nThey're going to move. But I know you're referring probably to the Air Wisconsin transaction. in a market where there's difficulty in pilot supply, Air Wisconsin has a great network. We've worked with them before.\n\nThey have a very good pilot supply and comply out of Chicago. And so I think it's an opportunistic transaction to do that in an environment where there's a pilot constraint on the regional side.\n\nOperator\n\nOur next question comes from the line of Conor Cunningham of Melius Research.\n\nConor Cunningham -- Melius Research -- Analyst\n\nJust on Savi's question from a hiring standpoint. I don't think you actually gave a number on 2023. Is there a stated goal from a pilot standpoint. The only reason why I asked as your headcount, I think, is down 2%, you're talking about capacity being flat to down 5%.\n\nSo basically, you're there from a hiring from an employee standpoint. So I'm just trying to figure out what we're talking about until into next year.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nDerek, go ahead.\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nYes. I think, Conor, we're going to have the schoolhouse pull all next year. So my assumption is if we hired 2,000 this year, we'll be hiring the same amount next year as we bring back the mainline fleet. So I would expect the school has to be full and us to train as about as many pilots in 2023 as we are in 2022.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nAnd, Conor, I'd just add that some of that as well. We still have considerable retirements due to age 65. We're at the peak levels. So while we're hiring 2,000, it doesn't mean that there's a net incremental of 2,000 pilots by any means.\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nYes, I think we retired somewhere in the neighborhood of 700, 750 pilots next year. So a lot of that's retirement.\n\nConor Cunningham -- Melius Research -- Analyst\n\nOK. And then the progress being made on profitability is obviously great to see. But I think the question a lot of folks have is just around profitability with new labor deals. I'm not trying to get you guys to cost me that publicly, but just how do you think about profitability into '23? Is it just more of like the demand picture is just so much better that we can absorb a lot of the pilot pay increases or labor deals and all that stuff? Just any high-level thoughts that you may have, that would be great.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nWell, I'll start like certainly, anything that we do with our pilots or flight attendants or any of the other team members that we're currently negotiating with, we negotiate with a mine to making sure we take care of our team that we take of the company as well. When we think about the deals that we have, we're going to make sure that they fit with an economic perspective of making money. And I'm confident we can do that. And it's the best interest of our pilots and flight attendance and mechanics and everybody in this company.\n\nSo there's win-win deals that will be had out there. I'm confident that we can do it. And it's in an environment where, yes -- we take a look at travel coming back, being something that just in terms of where people want to spend money is a change from prior to the pandemic. We take a look at the amount of growth that the general economy has had and yet the airline business is still -- American Airlines 10% smaller.\n\nAnd then on top of that, we know that travel is a bargain still general inflation is running about 5% and ticket prices are up since 2019, about 3% -- or less than 3% on an annual basis. So I look at all that and think that the kind of momentum that we have experienced in the third and fourth quarter carry in. And certainly, they're offsetting costs that are built in, in terms of redundancies that we have in place. But as we get the fleet back up and as Derek mentioned a little bit earlier, it may take us a while to get the regionals back up and maybe through 2023 to get the mainline fully back up as well.\n\nBut we will have efficiencies that come with up-gauging that we did -- we've done and will come with the incremental utilization that we can get out of our aircraft -- and quite frankly, some of the things that Vasu's talked about in terms of network, in terms of marketing and then also in terms of engaging our customers in a way that they will pay us for things like credit cards. The relationship is deepening. So on all those fronts, I feel really confident that we can put together an airline that can cover increased labor expenses and still make margins that we think are appropriate positive for the airline.\n\nOperator\n\nOur next question comes from the line of Helane Becker of Cowen.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nHelane?\n\nHelane Becker -- Cowen and Company -- Analyst\n\nCan you hear me now?\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nYes. We can hear you now.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nI'm not sure exactly what happened there because I was not on mute. So one question for clarification. What's the paid load factor in business versus upgrades in business class?\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nHelane, this is Vasu. Look, off the top of my head, I don't know well enough to go and tell you, but I will say this that our payloads in business are growing as a percentage of what they've been historically, but it changed a lot between July and September, as being shifted over. But a major part for that simply changes that we've made with our upgrade program that we used to have a lot of different, what I'll call cottage upgrade concepts that could be had through different certificates through our loyalty program, do things like that. We've been trying to go and simplify that for our customers, digitize a whole lot more of it and frankly, offer more fair products to customers.\n\nSo we're now getting to a place where it's probably our lowest of time as little as 60% could have been paid. Now we're in a place where, indeed, like in the domestic system, something closer to 80 or so.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nOK. That's very helpful. And then if I could follow up a question on the aircraft deliveries and the schedule. So, Derek, you talked about the under on the number of aircraft you actually have on for delivery schedule for next year.\n\nSo how are you scheduling the airline? Are you assuming, I suppose, a lower level of deliveries? Or could you just walk me through how you plan the network, not knowing how many aircraft you're actually going to have available to fly?\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nYes. I think as we look into 2023, we didn't have a lot of deliveries anyway. We probably had 32 deliveries. What we've done is we know the four 788s are coming in.\n\nWe know what those dates are, so we can plan that. And the one neo coming in, we know that. The MAXs, we've worked with Boeing to put our level of ops together. We were supposed to get 27 aircraft.\n\nWe've now taken that down to 19, and we have the delivery schedule that we believe that Boeing will meet. They need to meet those dates for us to hit the level of apps, but that's the way we're planning it. The good news for us is that we don't have a lot of deliveries next year. Our capex is way down.\n\nWe know what our fleet is. The uncertainty for us from a level of operations perspective is probably more on the regional side. And what we're doing is being conservative on the regional side to plan three months out. We'll put a level of ops together for the full year of what we -- where we think we are.\n\nAnd if the constraints fall off. We have more ability to fly. We'll add those back into the schedule as we move throughout the year. But we'll plan at the level that we gave you, which is the 100.\n\nThat assumes the push in the MAXs to only 19 aircraft and that they come in a little bit later. And we'll plan to schedule that way. We do have capabilities of putting the schedule out, and we can change it every three months and things like that. So you may see an adjustment to our plans as we go forward.\n\nbut we were sticking the stake in the ground with this level, with this aircraft, a lot easier to do this year than it has in the past, not knowing when they are coming, but still just the murkiest part for us is really the regional side and making sure that we can do the regionals at the levels we have them today.\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nI'll just add to something that Derek said there, really consistent with our principle of just making the airline as nimble and resilient as possible. One of the things that -- and a huge credit to Brian's Newtons and Aaron many people in our network and operations team. But we figured out ways where effectively, instead of building to a fictitious delivery plan. We can build what we know and add, as we call them lines of flying and on top of it, whether that is for regional jets for main lines.\n\nAnd if you go out and look at schedules at a time when so many airlines cut capacity closed in probably at least the only one that I've seen in published schedules being able to add capacity back as American Airlines. And so we're finding more ways to do it. It's doing that puts us in a much better place to go manage the airline operationally and financially. It makes it a little bit harder to go and manage things like the peak days after Thanksgiving, but it's a much more practical way to go manage through some of these infrastructure uncertainties that we've got.\n\nOperator\n\nOur next question comes from the line of Stephen Trent of Citi.\n\nStephen Trent -- Citi -- Analyst\n\nMost of my questions have been answered. I just had one quick question about fleet. I know you guys have gone through all of that operational dislocation with the next grounded in 2019. And as you think about longer term, any high-level view sort of what's optimal for American Airlines with respect to owning versus leasing versus sale leaseback, an ideal mix when you consider what's happening with interest rates and aircraft residual values, we just love to hear some color on that.\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nYes, Stephen, I mean, the one thing I will say is we are very happy that we did our fleet replacement program at a time where we could finance aircraft at 3% level. So as we look back at what we've done and where others have to go in this 6% to 7% range, we're very happy where we're at with the financing of our aircraft. As we look forward, we don't have many aircraft in 2023. So that's good news.\n\nWe only have about 32 aircraft. We already have five of them financed. We look at all markets. We look at the WTC market, the sale-leaseback market, the mortgage market, and we are getting attractive pricing in those markets today.\n\nSo our focus will be on the back half of 2023 and to finance those aircraft. We're all good through 2022. We're all good through the first half of 2023 with very attractive financing. And hopefully, as we go forward, we don't have a significant amount of aircraft.\n\nWe have 24 next year, and then we go into 50 and 50 to two years after that. So we've done our fleet replacement program. under really, really good rates that are going to be with us for a long time. So we're very happy where we're positioned now from an aircraft financing perspective.\n\nOperator\n\nOur next question comes from Sheila Kahyaoglu of Jefferies.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nMaybe if we could talk about just revenue trends to start. Q3 was the first quarter where international passenger revenue outperformed domestic. Any color on how you could how you think about that trend going forward and potentially the impact on the U.S. dollar strength.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nVasu, go ahead and start, and I want to add something at the end, too, OK?\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nYes, absolutely. Absolutely. Well, look, as mentioned before, the long-haul business is -- if you look back at over any time period you want, it's a much more volatile line of business to be than the short-haul business. We think that's absolutely the case.\n\nThat said, we're really encouraged where things are right now. there is clearly demand that's out there for the long-haul product. That too is taking shape in a very different way than what was there before the pandemic but coming in at levels that are far greater than what was there before the pandemic. What's less known is that we're still in a place where so many markets are still opening up.\n\nAs a practical matter, Japan really only opened up last week. So there's some major parts of the international systems that are coming back yet. They're still any number of inefficiencies there, which I know Robert can talk to a lot more that are going to yet be a bit of a drag. But over the long run, we're really excited for it, so much so that even though I've said that the airline is going to be an 80-20 short-haul, long-haul carrier.\n\nNonetheless, we're taking 787s steps. We still have an order for XLRs and things like that out there because we do think that the long-haul business will come back and come back in a way, which can be really beneficial certainly to us and our customers.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nThere's things that we're doing as a country that are actually hindering the recovery of demand internationally. It could be stronger, a lot stronger. And I want to make sure that people are aware of that. Right now -- in the past, in 2019, 43% of international visitation into the U.S.\n\nthat came from countries where you had to have a Visa to come into the United States. And back then in 2019, for people that wanted to come in for a first-time Visa to attend a big event meeting or kind of a convention. You maybe had to go and spend a few weeks to get a visa. So you can actually buy a ticket with some reasonable assurance that you'd actually be able to travel.\n\nWell, now that process of getting a Visa is -- can be over a year, well over a year and really important big travel markets like countries like Brazil and Mexico and India. And when I talk about that 43% of inbound travel of international visitation, it's not like they're just -- it's not like we're limiting ourselves just on airfares and ticket prices and airline revenue, those people spent $120 billion when they came into the United States. So the country as a whole is hard. Here's what we're trying to do about it because we need to get at this.\n\nYou just -- the international recovery would be so much stronger if we got this out of the way. We're working with the state department. We've got to make sure that we respond to the situation to do so quickly. And it really comes in to making sure that B1 and B2 applicants, why come the United States participating in meetings that they're eligible to do so instead of taking their travel someplace else, which is what they're doing right now.\n\nSo anyway, I just want to make that point, Vasu, that international travel could be stronger.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nNo, that's great color, guys. And maybe just one follow-up for Vasu and his comments earlier on the loyalty program and credit card spend. How are you thinking about the loyalty program? Has there been a change in how America is viewing it and it's important to the operation relative to 2019?\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nShort answer, yes. Absolutely. We've seen it in any number of ways that -- look, so much of the marketplace has changed. Maybe the simplest way to think of it is this, those customers who are blending travel value travel, whereas for a lot of our customers prior to the pandemic, they might have traveled because their employer made them or they had to go and do it.\n\nSo we're seeing people travel with a lot more intentionality. And when that happens, those same customers are much more willing to go and earn miles so that they can go and take their family on vacation, for example. So that's where we see like Advantage enrollments are growing record levels everywhere. As our partnerships expand, we're seeing growth in places like the West Coast and the Northeast.\n\nLevels that we've never seen before. But importantly, people are doing things like spending on their credit card. We did something where we counted credit card spending toward status, and that's been something really, really well received by our customers, too. And the last thing I'll say to this is we just see a lot of upside here.\n\nIf you compare our print out there in the sort of traditional network business, we're in a place where domestically in Latin America, we can be 10% to 20% larger than our competitors and produce unit revenues that are 5% to 10% larger than what they are. And that's a really good place to be in. But even still, compared to one of our largest network competitors, they run 90% the airline that we do, but they produce $1 billion more to their co-brand credit card program. So we're really focused on that because we think it's a huge value driver for our customers, a very obvious one for us.\n\nWe're really encouraged by the progress we've made with our partner in Citi. But as we look forward, we see that as a really key place where we need to have a strategic partnership in order to really create the value that's there.\n\nOperator\n\nThat concludes the analyst Q&A. We will now take questions from the media. [Operator instructions] Our first question from the media comes from Alison Sider of Wall Street Journal.\n\nAlison Sider -- Air Travel Reporter\n\nCurious, you ever has been talking about sort of these different travel patterns or blended travel, you have different types of leisure trips. And I'm just curious, do those trends -- do they kind of fully offset the loss of managed corporate travel that you're still seeing? Like if there was sort of a stall in the corporate recovery with these kinds of new leisure type or blended type bookings to make up for it?\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nAbsolutely. It has way more than offset it. And then you can see it in the results, right? The contracted corporations are 80% recovered, but this is the second quarter in a row where revenues have never been higher in our history. And indeed, that's on the strength of this blended demand that's there and unmanaged business-related demand, all of which is coming in at higher yield values, all of which tends to attach itself to really high-margin ancillary products like premium cabin seats, the credit card, loyalty programs, things like that.\n\nSo we're very much seeing a shift that's there and one that's really encouraging. All the more encouraging because as we look forward, really the airline revenue -- or airline revenues haven't totally recovered to their historical level. Historically, they would be about 1% of GDP. We're still not all the way there.\n\nAnd so we think there's yet a lot of headroom that's there. We are really encouraged and absolutely, Ali, we are very much seeing that the managed corporate hasn't come back yet. It's more than being offset. And the last thing I'll say to you is, though managed corporate hasn't come back, the really critical word in that sentence is the word yet.\n\nAs more countries open up, as the visa inefficiencies that Robert talked about get rectified, that can really unlock yet a lot of demand that's out there, which is kind of what are the upside for the travel business.\n\nAlison Sider -- Air Travel Reporter\n\nGot it. And I guess, you mentioned the GDP relationship, so maybe that's part of the answer, but what gives you the confidence that these are real permanent shifts and not just spill over for the summer and eventually, just the inflationary pressures will get speed too much and people will just travel spending will fall by the late side just like other spending categories are seeing?\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nYes. Ali, look, it's a great question, and there's probably maybe three parts to the answer. First, it's not a thing that we've just observed recently. We've been seeing this and talking about this probably for a couple of quarters now, and it is a real and a meaningful shift.\n\nTwo, it's not that we see the data in aggregate. We get the luxury of seeing it in particular. So for example, in 2021 and 2022, those customers on a blended trip who enrolled in our advantage program in 2022 are producing our revenue -- their revenues to us are about 10% higher than customers who traveled in '21 and '22 but didn't enroll the program. We see meaningful shifts.\n\nWhen people actually go and spend on the credit card, they are more likely to go and fly on the airline and vice versa. So there's a lot of things out there which are quite striking in the data that we see and are very consistent. Then the last thing that I'll mention is yes, even though other consumer -- demand for other consumer products is changing. -- just never forget for us, in real dollars, the price of airfares are less now than what they were in 2019.\n\nSo you can still go out there and now it's not like the depth of the pandemic where there were 29 one-way fares but now they're $49 one-way fares. So air travel has never been the bargain that it is today. And we -- that's going to be a thing that lasts for quite a while going forward. Frankly, to the good of our customers and our business.\n\nOperator\n\nOur next question comes from Leslie Josephs of CNBC.\n\nLeslie Josephs -- Airline Reporter\n\nI was just wondering if -- how you're thinking about the Advantage program and with so many people getting cards, lots of sign-ups, very high spend and accruing loss of miles. How you're thinking about just the sheer number of people that have so many miles and whether you can deliver a product that entices more people to remain in the program and to keep using it. And I'm thinking like competition for upgrades and things like that? And then my second question, in 2023, you said 95% to 100% back to 2019 levels. If you do have the aircraft, do you want to fly more? Or is there a concern that that would drive down fares in revenue?\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nLeslie, this is Vasu. I can start into that and others may want to join in for the second part of your question. So look, as we like to say it, burn begets burn. And the most important thing is people are earning more miles, we want to keep continuing to do it.\n\nIt's valuable to them. They want to be able to unlock future travel opportunities. And the really important thing is for that to happen, they need to be able to burn their miles. So stay tuned for more, but we're looking at a lot of ways where we can make status more rewarding and more meaningful and also where we can do more things where people can use their miles more.\n\nWe were really encouraged this summer. We actually experimented with a lot of ways where we went and expanded availability for award redemption and things like that. And we found the take rates among our customers to be really promising. And so we see a lot of opportunities for that, both within AA, but also in conjunction with many of our partners.\n\nSo more on that soon. And if you could just repeat your second question.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nVasu, this is me, I'll add into that. Look, whether or not we're -- the AAdvantage members are outpacing the growth in advanced members that are outpacing our ability to service them. Leslie, that's where we talk about what we're doing with our premium seats and making sure that we have the ability to serve customers but -- as well, we're creating world-class product as well in so many different places. Take our LaGuardia labs.\n\nIf you haven't been there, please go see it. best domestic lounge in the country. And it's only going to be beaten when we open up our new DCA lounge. And you'll see that we're doing this kind of thing to make sure that we can accommodate a much broader group.\n\nAnd we're going to spend for it. It's worthwhile to do that, and we're tracking the right customers. So then the last thing is, would we be flying more right now if we -- if these constraints weren't out there, we'd find a little bit more we'll take a look at that for next year. But as I said before, the biggest thing for us is making sure that we have certainty in terms of our schedule.\n\nAnd so we're going to make sure that we don't outpace what we have either in terms of aircraft deliveries if that's the constraint or if it's pilots at a regional level or our ability to train pilots from a mainline perspective.\n\nOperator\n\nOur next question comes from the line of Mary Schlangenstein of Bloomberg.\n\nMary Schlangenstein -- Airline Reporter\n\nYes. I'm not muted. Can you hear me?\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nYes.\n\nMary Schlangenstein -- Airline Reporter\n\nExcellent. Great. Vasu, for a long time, the thinking in the industry was that the domestic market was mature. And so the best opportunities for growth were outside of the U.S., and that seems to be the exact opposite of what you're doing now.\n\nAnd I wanted to see if you could comment on whether there was some sort of change, whether that belief across the industry was just an error or a misreading of the industry? And then the second question was on the 80/20 short-haul, long-haul mix. Is that 20 a base for you in terms of long haul? Or could we see that potentially fall further going forward?\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nThanks, Mary. The second of your question, it's pretty unlikely that it falls further going forward. How we build it back over time kind of remains to be seen. That's a big part of our 2023 and beyond planning.\n\nBut it will be pretty surprising at this point about anything materially lower than that. And indeed, through so many of these partnerships, we probably see more ways to grow it than any desire to shrink it. Then to the first of your question that, yes, look, what I'd say is that North America, as an originating market, is a very mature market, but it's also the highest area of airline demand, the highest yielding marketplace that's anywhere in the world. And what we find is, indeed, so much of what's happened, especially post pandemic across the U.S.\n\nis there's a significant amount of demand growth and economic growth outside of the historically large big coastal cities that are there, places like Phoenix Arizona, Austin, Texas, Oklahoma City, places like that are growing at a pretty meaningful level. And with that, there's just a lot of people who want to be able to come in and travel. And what we do great is we connect them into the global marketplace. Whether that is New York or Heathrow or whatever the case might be.\n\nMaybe to put a bit of an example on that, like take a market like New York City, New York City is a place where there's more flights a day to Paris than there are at Little Rock, Arkansas. Well, American Airlines out of the first flight from Little Rock to New York. And it was made possible through our partnership with JetBlue and the -- but by having that, we've created opportunities for customers that they wouldn't have had before. So we see yet a lot of opportunities to do that.\n\nAnd indeed, the results kind of speak for it, the more that we do, the more encouraged we are that our customers value and are willing to pay for it.\n\nOperator\n\nOur next question comes from the line of Kyle Arnold of Dallas News.\n\nKyle Arnold -- Aviation Writer\n\nCan you guys talk a little bit about how the blended travel trend is going to play into the holidays, whether you're seeing more people shift into earlier in the week outside of that, maybe pre-Thanksgiving day? And is there a different kind of cadence to that? In the summer versus the winter or maybe the winter where those peak days are a little tighter?\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nKyle, this is Vasu. And yes, we do see a little bit of that day of week shift. Not only do we see it just in general, a time of day ship for people who are coming out of what we call the peak business travel time channels and into the body of the airline Day. We're seeing more growth happening on things like Wednesday evenings or Thursday morning, places where -- while there was demand, it was traditionally not as great as what it would be on a Thursday evening at 6:00.\n\nAnd so with that in mind, yes, we are indeed anticipating that it's not just that the Thanksgiving weekend, for example, will be peak, but even the days around it, we'll have a level of demand. In fact, if you go look at our Thanksgiving schedule right now, there's less peak-to-trough variability there than certainly I've seen in the schedule for a number of years.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nSo, Kyle, I'll add. Vasu's organization has our revenue management team in it. They -- every now they take me through the worm charts that show us how we're booking at various points in the year. And I'll tell you this, what I saw earlier this week is compared to 2019 and the prior years, look, the holidays are booking really well.\n\nAnd so I think that that bodes well. But what I think Vasu, you also probably note is that getting the seat is something that's going to be hard. So it's going to place it there's going to be a move in terms of where people can fly just based on availability.\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nAbsolutely right.\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nWhich is a good thing. And Scott, is that on the last question? Is that right? So I'll just close with this, which is, if you can't tell, we're pleased with our results. It's been a heck of a few years in the pandemic. And it's great to be at a point where -- not only are we reporting profits on a quarterly basis, but looking at into the future as well.\n\nDemand remains strong. We're very optimistic. And American is really in a position to taking full advantage of the recovery. It's because of the things that we've done with our network, with our partnerships, with our fleet, getting the airline really situated to fly what we can do best.\n\nWe are focused on reliability. And that is something that everybody in the company has top of mind. I'm really pleased with how we're performing here in October and in September and as we closed out August as well. And my confidence is bolstered by a number of things.\n\nJust first, I look at the metrics that we run every day. So things like aircraft out of service at the start of the morning, we're running record all-time lows. I got to give a shout-out to our technical operations team for having our aircraft in better shape than they've ever been in but as well as things like reserve levels for our pilots and flight attendants and just making sure things are ready to go, I feel really confident the way that we recovered post the horrific hurricanes in the flooding that was here in DFW back in August. It gives me great confidence that even when you throw enormous disruption that we can get back on our feet really quickly.\n\nthat reliability translates into profitability. And yes, we said it over and over again. We have to be profitable in order to really serve the needs of our communities, our customers and the shareholders of this company. We're intent on doing it, and we're going to make sure that this airline is one that you can count on in terms of producing profits, ultimately reducing debt over time and being sustainable from a profitability perspective.\n\nSo we're hard at work. We're going to get back to it as soon as we get off this call. And I appreciate everybody spending time with us, and thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nScott Long -- Head of Investor Relations\n\nRobert Isom -- Chief Executive Officer and Chief Recruitment Officer\n\nDerek Kerr -- Vice Chairman, Chief Financial Officer\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nVasu Raja -- Senior Vice President, Chief Commercial Officer\n\nSavi Syth -- Raymond James -- Analyst\n\nJamie Baker -- JPMorgan Chase and Company -- Analyst\n\nDuane Pfennigwerth -- Evercore ISI -- Analyst\n\nMichael Linenberg -- Deutsche Bank -- Analyst\n\nConor Cunningham -- Melius Research -- Analyst\n\nHelane Becker -- Cowen and Company -- Analyst\n\nStephen Trent -- Citi -- Analyst\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nAlison Sider -- Air Travel Reporter\n\nLeslie Josephs -- Airline Reporter\n\nMary Schlangenstein -- Airline Reporter\n\nKyle Arnold -- Aviation Writer\n\nMore AAL analysis\n\nAll earnings call transcripts"
}