{
  "companyName": "Chewy",
  "companyTicker": "CHWY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/09/chewy-chwy-q3-2022-earnings-call-transcript/",
  "content": "Chewy (CHWY -1.44%)\nQ3 2022 Earnings Call\nDec 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood evening, everyone, and thank you for joining today's Chewy third-quarter fiscal year 2022 earnings call. My name is Don Tanami, the operator of today's call. All lines will be muted during the presentation portion of today's call and an opportunity for questions and answers at the end. [Operator instructions] I would now like to pass the conference over to our host, Mr.\n\nRobert LaFleur, vice president of investor relations. Sir, the floor is now yours.\n\nRobert LaFleur -- Vice President, Investor Relations\n\nThank you for joining us on the call today to discuss our third-quarter 2022 results. Joining me today are Chewy's CEO, Sumit Singh; and CFO, Mario Marte. Our earnings release and letter to shareholders, which were filed with the SEC earlier today, have been posted to the Investor Relations section of our website, investor.chewy.com. On our call today, we will be making forward-looking statements, including statements concerning Chewy's future prospects, financial results, business strategies, investments, industry trends, and our ability to successfully respond to business risks, including those related to inflation and its effect on the economy and our industry.\n\nSuch statements are considered forward-looking statements under the Private Securities Litigation Reform Act of 1995 and are subject to certain risks and uncertainties, which could cause actual results to differ materially from those contemplated by our forward-looking statements. Reported results should not be considered an indication of future performance. Also, note that the forward-looking statements on this call are based on information available to us as of today's date. We disclaim any obligation to update any forward-looking statements, except as required by law.\n\nFor further information, please refer to the risk factors and other information in Chewy's 10-Q and 8-K filed earlier today and in our other filings with the SEC, including our annual report on Form 10-K. Also, during this call, we will discuss certain non-GAAP financial measures. Reconciliations of these non-GAAP items to the most directly comparable GAAP financial measures are provided on our Investor Relations website and in today's SEC filings. These non-GAAP measures are not intended as a substitute for GAAP results.\n\nAdditionally, unless otherwise noted, results discussed today refer to the third quarter of 2022 and all comparisons are accordingly against the third quarter of 2021. Finally, this call in its entirety is being webcast on our Investor Relations website. A replay of this call will also be available on our IR website shortly. I'd now like to turn the call over to Sumit.\n\nSumit Singh -- Chief Executive Officer\n\nThanks, Bob, and thank you, all, for joining us on the call today. Building on the momentum we reported in the second quarter, Chewy's Q3 results showed accelerating double-digit top-line growth, a sequential increase in active customers, sustained gross margin expansion, and solid free cash flow generation. We experienced strong demand throughout the third quarter, especially across our nondiscretionary categories, which provided a solid foundation for our growth. The resilience of the underlying demand in these categories, coupled with our ability to grow customer share of wallet, again enable Chewy to outperform broader industry trends and take incremental market share.\n\nQ3 net sales were $2.53 billion, a year-over-year increase of 14.5% and a sequential acceleration from the 12.8% growth in the second quarter. Our top-line results were anchored by the predictable nature of our Autoship customer sales, which grew nearly 19% to 73.3% of net sales, and by rising customer engagement as measured by net sales per active customer, or NSPAC, which grew nearly 14% to $477. Digging a little deeper into our Q3 net sales, nondiscretionary categories like core food and healthcare collectively made up over 83% of our net sales and were the primary growth drivers, reflecting healthy unit demand and improved in-stock levels. Within discretionary categories, hard goods showed relative improvement in Q3 with sales declining 5% year over year, which is a 400-basis-point improvement versus the second-quarter year-over-year performance.\n\nWe remain confident that hard good sales will return to their growth path as the economic environment improves. Taking a longer-term view, over the last three years, our third quarter hard good sales are up 70%, gross profit has nearly doubled, and gross margin has expanded by over 400 basis points. Shifting to overall company profitability, Q3 gross margin expanded 200 basis points year over year to 28.4%, which is a new quarterly high. Our gross margin performance this quarter reflects the favorable comps from Q3 last year, the continuation of strong pricing trends without any noticeable impact on demand, and the incremental benefits we realized from our ongoing supply chain and logistics transformation.\n\nQ3 adjusted EBITDA was $70.4 million and adjusted EBITDA margin was 2.8%, an increase of $64 million and 250 basis points respectively. The primary drivers of adjusted EBITDA growth were higher gross margins and accelerated scaling of SG&A results that showcase our ability to get big fast and get fit fast as we simultaneously drive top-line growth and expand margins. Moving on to customers, we ended Q3 with 20.5 million active customers. Gross customer additions accelerated 6% sequentially and are up 9% compared to Q3 2019.\n\nConsistent with recent quarters, customer retention rates remained stable as we continue to work through the initial attrition phases of our pandemic-era cohorts. In the third quarter, as consumers shifted their focus away from summertime pursuits like travel toward the upcoming holiday season, we saw opportunities to increase our level of marketing investment compared to recent quarters. While ad supply remained tight, we found ROI-positive opportunities consistent with our philosophy to maximize LTV payback and we invested accordingly. Now, let me update you on some of our latest innovations as we continue to build out the Chewy Health ecosystem, expand into new and exciting high-margin verticals, and make meaningful strides in our supply chain transformation.\n\nStarting with Chewy Health, we recently announced the expansion of CarePlus, our exclusive suite of insurance and wellness offerings with plans provided by Lemonade. Combining the products from Lemonade and Trupanion under the CarePlus banner enables us to diversify our product offerings across the full spectrum of price points and coverage options in order to meet the needs of a wider range of pet parents. We are targeting a nationwide launch of our Lemonade offerings beginning in spring 2023. We remain bullish on the pet insurance space and our ability to drive customer acquisition and deepen customer engagement.\n\nElsewhere in Chewy Health, we recently launched Vibeful, our first private brand in the pet wellness category. Vibeful is a line of supplements featuring products from multivitamins to hip and joint supplements. The nonprescription pet health and wellness category has an estimated 2022 TAM of over $2.4 billion. And given the increased consumer focus on wellness and the ongoing trend toward pet humanization, we believe this launch gives us another opportunity to strengthen our connection with customers and to drive top and bottom-line results.\n\nMoving to new lines of growth, we recently launched the beta version of our sponsored ads program, several months ahead of schedule. Sponsored ads are dedicated product placements on chewy.com that promote specific products from select vendors. With these ads, our suppliers can seamlessly advertise to our 20-plus million active customers. We believe sponsored ads will enable us to scale contextual advertisements, which in turn should deliver highly relevant products to customers and high-margin revenue to our business.\n\nThe full launch is on track for 2023. And last but not least, we continue to make excellent progress transforming our supply chain and logistics operations and developing world-class capabilities across our organization. More importantly, these efforts produced meaningful operational and financial benefits throughout the company in Q3. First, our automated FC network is handling an increasingly larger portion of our outbound shipping volume at progressively lower variable cost per order.\n\nIn Q3, we shipped nearly 30% of our volume through our automated FC network, up from 10% in Q3 last year. Second, our inventory rebalancing efforts through enhanced software and planning capabilities have improved in-stock levels across our network, which has lowered costs by reducing average shipping distances by 25% compared to last year and announced customer experience by reducing click-to-deliver times and improving order accuracy. These efforts have been complemented by our middle-mile initiative, which also cuts average shipping distance and reduces costs. Finally, our two new import routing facilities are on pace to handle 90% of our import volume by the end of 2022, which further enhances our ability to optimize inventory distribution across our FC network and reduce inbound freight costs.\n\nCollectively, these supply chain and logistics efforts have allowed us to mitigate freight costs, begin leveraging our SG&A expenses a quarter ahead of schedule, and improve customer experience on multiple fronts. Let me conclude with the following. The operating environment remains dynamic and evolving. What hasn't changed is how much pet parents value the enduring companionship of their pets, and it is this emotional bond that sustains the pet category through all phases of the economic cycle.\n\nChewy's compelling value proposition backed by low prices, personalized service, and delivery convenience across a broad selection of products continues to resonate with our customers. This enables us to build the long-term trust that in our view allows us to outgrow our competitors and take market share. Concurrently and unequivocally, our team's relentless focus on execution and operational excellence allows us to take this growing market share and transform it into incrementally higher profitability and in growing free cash flow. Before I turn the call over to Mario, I would like to share an important development with you.\n\nAfter nearly eight years at Chewy, Mario has decided to retire from the company. Now it's too soon to plan his retirement party or order the proverbial gold watch, although those things will be appropriate sometime next year. As of today, we have no specific date in mind for Mario's departure and our intent right now is simply to inform you of our transition plans. We have begun a search for top-tier internal or external candidates for this important and strategic position.\n\nIn the meantime, it's business as usual and we are grateful to have Mario's services for as long as necessary to find and ramp a worthy successor. Please understand that this is not a matter about which we will provide regular updates and we don't plan to comment about this until we have a successor in place. With that, I will turn the call over to Mario. Mario?\n\nMario Marte -- Chief Financial Officer\n\nThank you, Sumit. Appreciate the kind words, and I am looking forward to a little R&R when the time comes. But until then, it is business as usual. Now, let's talk about our third quarter results.\n\nNet sales increased 14.5% or $320 million to $2.53 billion. Growth was led by our nondiscretionary consumables and healthcare categories, which collectively represented over 83% of our Q3 net sales. Driving our third quarter net sales growth was an 18.8% increase in Autoship customer sales, which reached a new high of 73.3% of net sales, a 13.8% increase in NSPAC, also a new high for the company, and an active customer base of just over 20.5 million, increasing approximately 30,000 versus the second quarter and 100,000 versus last year. Moving to profitability, our third-quarter gross margin expanded 200 basis points year over year to 28.4%.\n\nApproximately 100 basis points of the year-over-year improvement is a result of favorable comps against Q3 last year when global supply chain disruptions and product cost inflation adversely affected our gross margin. The balance came from continuation of the strong pricing trends that emerged last quarter and greater efficiency in outbound shipping costs, which resulted from bigger basket sizes and the favorable progress we have made in our supply chain and logistics initiatives. Continuing on to opex, SG&A, which includes all fulfillment and customer service costs, credit card processing fees, corporate overhead, and share-based compensation, totaled $543.5 million in the third quarter or 21.5% of net sales compared to 21.1% in the third quarter of 2021. Excluding share-based compensation, SG&A totaled $497.4 million or 19.6% of net sales.\n\nThis is an improvement of 60 basis points compared to the third quarter of 2021 and was flat on a sequential basis. As we shared previously, we expected to begin leveraging SG&A expenses, excluding share-based comp as we exited 2022 and we are pleased to be a quarter ahead of schedule in delivering on this expectation. I will now take a moment to elaborate on how our efforts to leverage these costs are paying off. First, greater efficiency and variable fulfillment costs provided 120 basis points of leverage in the quarter, led by ongoing improvements in fulfillment center productivity from our expanded network of automated FCs.\n\nAs Sumit shared in his remarks, nearly 30% of our Q3 volume shipped from automated FCs compared to 10% last year. This helped drive down variable fulfillment costs per order, which provided about half of the Q3 year-over-year cost leverage in this area with the remainder coming from an increase in average order size. We also gained an additional 20 basis points of SG&A leverage as the incremental volume shipped through our automated FCs absorbed more of the incremental fixed carry cost of those facilities. In addition to these gains, corporate overhead scaled by 40 basis points year over year as a result of our disciplined management of G&A spend and tight cost controls.\n\nAt the same time that we are scaling our base costs, we continue to invest in the future. This includes the upfront investments we began making in the second half of 2021 and the personnel and technology needed to support the growth and profitability initiatives that we have detailed for you on this and prior calls. This contributed approximately 90 basis points of deleveraging in Q3, which is a 20-basis-point sequential improvement from the deleveraging that we saw in the second quarter. As a reminder, while the growth-driving investments we make show up in our SG&A expenses today, the benefits will be realized over time through incremental top-line growth and gross margin expansion.\n\nThird-quarter advertising and marketing expense was $177.1 million or 7% of net sales, a 20-basis-point increase over the third quarter of 2021 and a 110-basis-point sequential increase compared to the second quarter of 2022. As we have said before, our marketing investments are ROI driven and may fluctuate from quarter to quarter, depending on market conditions. In Q3, we saw the opportunity to make incremental investments across a full spectrum of marketing channels and we lean into those opportunities to maximize long-term gains in terms of active customers and top-line growth. Overall, our marketing spend remained within the 5% to 7% of net sales range that we articulated on our last call.\n\nWrapping up the income statement, third-quarter net income was $2.3 million, a year-over-year increase of $34.6 million. Net margin expanded 160 basis points to 0.1%. Third quarter adjusted EBITDA increased to $70.4 million and our adjusted EBITDA margin expanded 250 basis points to 2.8%, which we believe clearly demonstrates the operating leverage that we are unlocking as we realized the benefits of higher gross margin and accelerated scaling of SG&A expenses. Moving on to free cash flow.\n\nThird-quarter free cash flow was $69.8 million, reflecting $117.4 million in cash flow from operating activities and $47.6 million of capital expenditures. Capital investments were primarily comprised of investments in our automated FC and Reno and ongoing technology projects. We finished the quarter with $675 million in cash and cash equivalents and marketable securities, which is $68 million higher than our cash and cash equivalents balance at the end of last quarter. This quarter, you will notice that our balance sheet includes $297 million of marketable securities.\n\nStarting in Q3, we took advantage of rising short-term interest rates to redeploy excess cash from overnight deposits into highly liquid commercial paper and short-term treasury bills. At the end of Q3, we remain debt-free, and between cash on hand, marketable securities, and our availability on our ABL our liquidity currently stands at over $1.1 billion. That concludes my third-quarter recap. So, now, let me cover our fourth-quarter and full-year 2022 guidance.\n\nAs 2022 winds down, the resilience of consumer spending in the pet category continues and Chewy's value proposition remain as compelling as ever. Our current outlook for the balance of 2022 assumes no material change from current trends in the macro environment. We are increasing our full-year 2022 guidance to incorporate our Q3 results and a tighter range of expectations for Q4. We are also raising our full-year adjusted EBITDA guidance to reflect our gross margin and leverage in SG&A as reported through the third quarter.\n\nWe expect fourth-quarter net sales to be between $2.63 billion and $2.65 billion, representing year-over-year growth of approximately 10% to 11%. We are raising our full-year 2022 net sales outlook to a range of $10.02 billion to $10.04 billion, representing year-over-year growth of approximately 13% and over $11 billion in absolute dollar growth compared to 2021. We are also raising our full-year 2022 adjusted EBITDA margin outlook to a range of 2.3% to 2.4%, up from our prior range of 1.75% to 2%. As you update your models, here are a few housekeeping items to keep in mind.\n\nWe now expect full-year 2022 gross margin to expand by approximately 90 to 100 basis points from our full-year 2021 gross margin of 26.7%. While we expect Q4 gross margin to improve year over year, it is likely to come in somewhat below Q3 due to seasonal factors like higher promotional activity and fewer opportunities to achieve freight and shipping efficiencies amid higher holiday volumes and peak season surcharges. In terms of capex, year-to-date capex is running at 2.3% of net sales. As we articulated on prior calls, the higher capex this year reflects a pull forward of payments on our next round of FC projects given longer project lead times.\n\nWe now expect full-year 2022 capex will come in slightly below our previous expectation of 2.5% of net sales as some anticipated spending shifts into 2023. We now expect to generate approximately $50 million to $100 million of positive free cash flow in 2022 given our revised profitability and capex outlook. Q3 results demonstrate Chewy's ability to expand margins in growth profitability in the current macro environment. This is a direct result of our sustained track record of making targeted investments in areas that enhance customer experience, grow our top line, expand margins, and improve free cash flow.\n\nWe believe our unwavering customer centricity, combined with our sharp operational execution will enable us to continue extending our industry-leading position in pet. And with that, I'll turn the call over to the operator for questions.\n\nOperator\n\nThank you, sir. [Operator instructions] Our first question comes from the line of Doug Anmuth with JPMorgan. Sir, the floor is yours.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nThank you. Thank you for taking the questions. I have two. Just, I guess, first on the 4Q revenue.\n\nCan you just talk about the deceleration versus 3Q and if there is anything in particular driving that or anything that you're seeing in terms of trends quarter to date or during the holidays? And then second, the accelerated scaling of SG&A expenses. Where do you think you're seeing the biggest gains across warehouses and automation and just overall logistics? Thank you.\n\nMario Marte -- Chief Financial Officer\n\nHey, Doug, it's Mario. I'll start off with the Q4 guidance. So, as you've heard us say before, our guidance doesn't anticipate to take into consideration all the data that we have as of right now, when we look at the fourth quarter, we're considering the fact that hard goods seem to make a bigger piece of the -- of sales usually in the fourth quarter. Seasonally, Q4 tends to show a little more heavily toward hard goods given the holidays.\n\nAnd while we saw some demand firming up in the -- between Q2 and Q3 generally speaking, demand for that category remains relatively soft compared to nondiscretionary demand in things like consumables and healthcare. And it's those headwinds produced by that softer discretionary demand that's likely to keep net sales growth rates below what we saw, for example, in Q3. Also recall that last year, Q4, we had a bit of a boost from the omicron search in December and January. So, that's an impact of higher comps last year regarding omicron.\n\nNow that all said, look, the midpoint of the fourth-quarter guidance is still -- it suggests over $250 million increase year over year, and the quarter is off to a good start. And if you look at the full year, you see that our guidance now for full year 2022 is about 13% growth over $1.1 billion growth in dollar terms year over year and more than double the revenue over the last three years.\n\nSumit Singh -- Chief Executive Officer\n\nHey, Doug, this is Sumit. I'll take the second part of the question. You said what's contributing to accelerated SG&A. You also said logistics.\n\nI'll take both logistics initiatives are rolling up through gross margin, but I'll explain as I kind of go through. On the SG&A scaling, so things that are in play here. One, the benefits that we're getting from automation, which we rolled out a couple of years ago are really starting to come through now. So, if you heard me talk about kind of a physics analogy in the past where I said there is a lot of potential energy conserved in the system, which once we start unlocking turns into kinetic energy and that's kind of what you're seeing flow through.\n\nSo, basically, the two fulfillment tenders that we launched last year are fully ramped. We pushed nearly third of our volume or just a little under 30% of our volume through that network. We know the third one is still ramping, and we realized half of our 120-basis-point leverage to the accelerated ramp of the fulfillment centers. The ramp is also helped by the fact that our inventory positioning is improving both as a result of our work and as a result of improved in-stock levels.\n\nAnd so, when you do that, you actually create density in the fulfillment centers that allows you to be more productive and the labor situation has been fairly stable. So, when you put all of that together, it allows us to leverage our network in a manner that we essentially planned it or built it, to begin with. So, that's the fulfillment center portion. Underneath of that, we're also getting operating leverage as a result of higher basket sizes.\n\nAnd as incremental volume flows through, that's the 20 basis points that Mario talked about today. And then third, of course, the G&A component that is built in, strong opex management strong controls on kind of spending, headcount, travel, relocation, anything basically that you need to run the company in a disciplined manner. The team is all over that. So, that as contributing to SG&A.\n\nOn the freight and logistics initiatives, there are basically three that we've talked about. One, our work with inventory and positioning allows us to better position inventory. We've gotten inventory in lower zones that allows us to ship lower distances that allows us to essentially be more efficient with our shipping cost. Number two, we are also improving package density that allows us to improve customization per order that allows us to extract that benefit.\n\nNumber three, the middle mile initiative is contributing. Again, it helps us consolidate orders and deeper inject into carrier networks. And then for the work with our routing centers allows us to move inventory more effectively, that hits the inbound freight side, which also rolls up to gross margin. So, as a result of these four, you're seeing us leverage kind of the cost on the freight side, and the previous comments were relative to the SG&A side.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you both. Appreciate that.\n\nSumit Singh -- Chief Executive Officer\n\nSure.\n\nOperator\n\nThank you for your question, sir. Our next line of questions comes from the line of Mark Mahaney with Evercore. Sir, the floor is now yours.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thank you. Let me try two questions. First, the sponsored ad revenue opportunity, have you sized the TAM before? And just talk about the -- which kind of advertisers you would expect to bring on to the platform? And then in terms of the net active customers, this growth you had this quarter after two quarters of decline.\n\nAnd I know there is a factor here, which is kind of moving beyond the COVID cohort a little bit. Should the interpretation be that you've now kind of at the end of that tunnel and that you're back to kind of more normalized churn levels across the customer base and the gross adds kind of stay high that we should now expect a consistently ongoing growth in net active customers? Thank you.\n\nSumit Singh -- Chief Executive Officer\n\nHey, Mark, I'll take the first one. Mario will take the second one. So, on sponsored ad, since it's just launched and still in beta, we haven't fully kind of shared the financial benefits. The way we would think about it is we compare ourselves to other companies that run single category or sponsored ads in single category.\n\nSo, I think that would become a reference. And then we would also consider the power of the Autoship program that allows us to build repeat purchase and loyalty into brands that allows us kind of an ROI, which is just different and more powerful than we've seen in the industry. So, you put those two together, the type of products that kind of lends itself to consumables, healthcare, all products where you can build loyalty, whether it's search demand, whether it's direct index on the website. And we've seen basically great response from partners from that standpoint right now.\n\nSo, we're prioritizing those, too.\n\nMario Marte -- Chief Financial Officer\n\nHey, Mark, on your second question about active customer growth, in the third quarter, you saw that we did increase the active customer account by about 30,000 and up about 100,000 year over year. That was in line with our expectations. The increase really is a result of a small uptick in the number of gross customer adds in the quarter and a small reduction in the number of churn customers. As to your point, we continue to lapse the very large COVID-era cohorts that we acquired in '20 and '21.\n\nYou know that, obviously, we don't guide to active customers just as we don't guide to NSPAC. But that said, our expectations for active customer growth going into the fourth quarter, remain generally consistent with what we said on prior calls. And that's all reflected in the guidance we provided for sales and the like.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nOK. Thank you so much. Thank you, Mario. And, Mario, congratulations on eight years of great success in execution.\n\nSo, wishing you all the best.\n\nMario Marte -- Chief Financial Officer\n\nThank you, Mark.\n\nOperator\n\nThank you for your question, sir. Our next line of questions comes from the line of Anna Andreeva with Needham and Company. Madam, the floor is yours.\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nGreat. Thank you so much. Good afternoon, guys, and congrats. Great results.\n\nTwo quick questions from us. On higher pricing, I know you have more of a portfolio approach toward managing that. Just any initial thoughts on how we should think about your price versus unit relationship into '23? And as you start lapping the price increases implemented this year? And then secondly, on advertising, it's fluctuated in the last couple of quarters. Can you talk about what's implied for advertising for the fourth quarter? And should we think the 5% to 7% range is still the right level for the business as we look out? Thank you.\n\nSumit Singh -- Chief Executive Officer\n\nHi, Anna. This is Sumit. I'll start, and if Mario has to add anything, you'll jump in here. So, first of all, pricing and unit growth contributed about equally to sales in Q3.\n\nWe grew pricing, but we also grew units meaningfully as we move through Q3. And in terms of lapping next year, so one, obviously, this year, we've seen increasingly elevated pricing as we moved from Q1 through Q3. And so, the first half of year, there is still positive favorable comps to be lapped. So, that's one.\n\nNumber two, we are expecting incremental costs, as we've shared in the previous calls, we're expecting incremental cost and therefore, more inflation to be passed through into the industry as we enter 2023. So, we believe that's how the pricing environment would look like as we get out of Q4 into the first half of 2023. And then, of course, in a similar manner where we're growing units which is actually structurally different than how industry growth occurred in Q3. In Q3, industry growth occurred primarily on the back of price.\n\nBut at Chewy, we grew units and price. We expect to do that in Q3 in '23 as well.\n\nMario Marte -- Chief Financial Officer\n\nYeah. Anna, to your second part of the question on marketing spend, we were in the Q4 marketing as a percent of net sales to be similar to Q3 and for the year to be in that 6% to 7% range, given where we are year to date.\n\nOperator\n\nThank you for your questions. Our next line of questions comes from the line of Brian Fitzgerald with Wells Fargo. Your line is now open.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nThanks, guys. Thirty percent of volume handled by the automated FCs. Any update or how should we frame up the cost savings that you realized from that? And then as you ramp up to automation and efficiency and then you drive these logistics improvements across the network it drives a better user experience, right? And so, have you seen anything in terms of positive impact on engagement, order frequency NSPAC as a direct result of what you're doing to the network?\n\nSumit Singh -- Chief Executive Officer\n\nHey, Brian, this is Sumit. So, the improvement in how do we think about potential buyers, I think you were asking a cost question. We've seen favorability to somewhere between 18% and 20%. So, the volume fulfilled out of the 2G network was roughly 18% to 20% cheaper than the volume that we fulfilled from our first one legacy 1G network.\n\nAnd two, we're still ramping volume into the third fulfillment center. So, there is incremental volume leverage that we expect to gain, and we're still continuing to scale our costs. So, there is incremental productivity improvement that we would expect from our network. So, all positive story there.\n\nIn terms of the impact that we've seen we have. I mean, we've seen an acceleration both in -- it's reflected in the gross adds number. It's also reflected in the reactivation number as we've improved both our inventory positioning and as we've improved CX. This is not an exact science.\n\nSo, getting down to specific numbers is a little bit hard, but you can clearly see it in the way that our network plays out and our ownership rates, both kind of net and gross work out there, so, yes.\n\nMario Marte -- Chief Financial Officer\n\nAnd, Brian, if I can add one more thing, I mean, if you look at where we are today, we have -- you saw the numbers we recounted -- we reported in terms of the benefit in SG&A from these three FCs. And as a reminder, Reno just opened more or less at the end of second quarter. So, it's still ramping. So, there is three FCs, one of which is ramping out of 13.\n\nAnd over the next year or a year, 18 months, we're going to see a couple of more FCs open up that are also automated. So, these are layers of profitability, as we said before, as we get more and more of our volume through these automated facilities over time.\n\nSumit Singh -- Chief Executive Officer\n\nBrian, if you add these up, like Reno has several basis points of improvements to give when it ramps. The next two, you know, we sized it at 30 to 50 basis points. We also said there is 20 to 30 basis points of utilization capacity, which is operating leverage, certainly get released. So, when you add that kind of improvement, along with the fact that we continue to push more volume and expect lower cost we're satisfied with the journey so far.\n\nThere's more to come.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nAwesome. Sumit and Mario, thank you.\n\nSumit Singh -- Chief Executive Officer\n\nThanks, Brian.\n\nMario Marte -- Chief Financial Officer\n\nThanks, Brian.\n\nOperator\n\nThank you for your questions, sir. Our next line of questions comes from the line of Corey Grady with Jefferies. Your line is now open.\n\nCorey Grady -- Jefferies -- Analyst\n\nHi. Thanks for taking my questions. I wanted to follow up on the pricing you're talking about in 2023. Can you say more about what you're hearing from brands and commodity costs and additional pricing and what you're expecting in terms of the magnitude of pricing next year? And then on hard goods, so as we come off the COVID adoption cycle and sort of think about a potential recession in 2023, how are you thinking about a recovery in that segment? And what are the leading indicators you would look at to gauge recovery and hard good demand? Thanks.\n\nSumit Singh -- Chief Executive Officer\n\nSure, sure, sure. So, pricing conversations, it's early to define or to put a range on the magnitude. So, perhaps we could discuss that on the next earnings call when we have a little more clarity when we meet in March. We are expecting pricing to start rolling through in the Q1 time frame.\n\nSo, this will actually become more clear as we kind of wrap up the year and get into next year. So, far, we're not hearing of multiple rounds of increase. But then again, as we get more information, we will definitely pass that on. If you look at 2022, we've had four rounds of cost increases over the last 15 months, starting from Q3 of 2021 through Q3 of 2022.\n\nWe don't expect multiple rounds of cost increases coming, but there is certainly incremental cost that needs to pass through the system first half of next year. Your second question on hard goods, the inputs that are driving the hard goods lag essentially are a couple here. One is it's tied directly to the consumers' mindset to inflation pressures and consumer mindset to pull back spending from discretionary categories. Number two is, you know, refresh cycles on hard goods are typically longer.\n\nSo, for example, if you recall, the last two years, every bed in America pretty much got, let's say, a bed refresh, you know, all -- every new puppy got a crate, etc. And so, you know, these refresh cycles are generally 12 to 15 months long, and they don't get as refreshed as quickly refreshed as toys would, for example. So, there is a little bit of that we have to lapse as we play the kind of the timescale here. And the third one is pet household formation.\n\nWhen you look at these options on relinquishment, they are basically flat to very slightly down from a year-over-year perspective. So, as pet hold household formation returns to normalcy, which again is tied back to the inflationary environment, as these inputs correct themselves, we expect hard goods growth to return to normal.\n\nCorey Grady -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThank you for your question, sir. Our next line of questions comes from the line of Lee Horowitz with Deutsche Bank. Your line is now open.\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nGreat. Thanks for the question. Maybe another one on NSPAC. For the quarter, can you help us unpack a bit how much of the NSPAC work you saw in the quarter was from share of wallet gains versus just general inflationary path and the pricing environment? And then I know we will have this conversation next quarter again.\n\nBut just at a high level, when you think about the path forward for NSPAC growth next year, we will have some pricing pass-through, but you're obviously comping it's a big inflationary year and don't necessarily have, say, a big '22 cohort that's going to be in that, call it, rapid paces NSPAC next year. So, how are you thinking about the inputs for NSPAC growth next year? Thanks so much.\n\nMario Marte -- Chief Financial Officer\n\nThis is Mario. I'll take that one. I can go on for a while on this answer. But look, let me kind of give -- purpose there was a couple of things.\n\nAs we mentioned in the prepared remarks, our NSPAC did reach another all-time high in the third quarter at $477. If you take that number back to Q1 2020, that's a 34% increase over the last couple of years, so significant increase in gain of share of wallet there. The other thing is from a spending perspective, if you're just comparing to customers that have been with us for a long time versus more recent customers. The customers we added during the last couple of years they are displaying similar spending patterns to customers we acquired back to the pandemic.\n\nAnd what that simply means is that they spend more the longer they stay with us. We've seen that for several years. In fact, we've seen it back to the first cohort as we projected out to today. And I mean the first cover back in 2011 to today.\n\nAlso consider that our current NSPAC is, as I said, about $477. And if you look at our oldest cohorts 11, 12, 13, they are spending about $1,000 a year with us. Add that to the fact that 60% of customers today have been with us for three years or less. So, think about what that means, there is this long curve that takes you from first year about $150, $200 to about $1,000.\n\nAnd on average, today, our cohort is -- our cohorts are fairly young on a weighted basis, and the average NSPAC is $477. So, there is a tremendous amount of upside potential to how much more share of wallet we can gain over time from those customers. Of course, we help drive NSPAC growth by adding new product categories like healthcare. We expand our catalog.\n\nNow we have over 100,000 products in our catalog. And we also make it easier to -- for customers to discover product and drive more cross-category shopping, so all of these things that we are doing to continue to gain that share of wallet. But again, if you look back at over the years, cohort-after-cohort, they have these nice long curves as they stay, they spend more with us, the longer they stay with us. Sumit, anything you want to add there?\n\nSumit Singh -- Chief Executive Officer\n\nYeah. I think Mario hit it. I mean, if you look at the business unit level, we have several growth factors that are still growing to deliver scale and contribute to positive NSPAC development. I mean, if you look at healthcare, that's a rapidly developing $40 billion TAM and less than 15%, 20% of our customers are active customers.\n\nAnd when you look at private label, there is an opportunity to ramp that up. We just launched Fresh and Prepared category, which is a high NSPAC driver in sales. Our premium and specialty businesses have plenty of runway in front of them. On top of this, our B2C and B2B services, such as telehealth or connect with event compounding, Practice Hub, shelters, pet insurance.\n\nThey all remain in nascent stages and early stages. And then on top of that, new initiatives such as sponsored ads, etc., are all -- these are all early kind of vectors that we believe can really compound the value proposition that we deliver and capture kind of the full life cycle output, offer customers engagement with our platform. So, we are super bullish about this.\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nVery helpful. Thanks so much.\n\nSumit Singh -- Chief Executive Officer\n\nSure.\n\nOperator\n\nThank you for your questions, sir. Our next line of questions comes from the line of Steve Forbes with Guggenheim. Your line is now open.\n\nJulio Marquez -- Guggenheim Securities -- Analyst\n\nIt's Julio Marquez on for Steve Forbes. Just a quick question on automated FCs, I see you mentioned 30% of the volume is shipped from automated. Any color you can give us on what that might look like at maturity? And any color you can give on additional investments either in Reno or additional facilities into 2023? Thank you.\n\nSumit Singh -- Chief Executive Officer\n\nSo, in terms of additional investments, we have talked about launching two new fulfillment centers, which will launch in the next 12 months to 15 months. So, one will definitely hit '23, one might hit toward the end of '23, perhaps early '24. But in the next 12 months to 15 months, we have shared with you two more fulfillment center launches, and both of them are automated. In terms of volume entitlement, of course, by the nature of the fact that we would have at that point, 15 fulfillment centers and five of the 15 would be automated linearly, we would say 30% of the volume, but we are already there.\n\nSo, what you can tell is that we are densifying the region as much as possible to be able to shift or place these fulfillment centers closer to customers and then pack them up with as much volume as possible. If you recall in one of the previous scripts, we have said we expect fixed output -- throughput per square foot to improve 25% is the efficiency that these buildings are giving us at overall 30% improvement in kind of full CPU or full cost per unit measure. And so, our goal will be to push as much volume as possible. The constraint there is optimally locating inventory, and of course, corresponding to normal demand distribution that exists in the country.\n\nSo, more to come as we continue to scale this.\n\nOperator\n\nThank you for your question, sir. Our next line of questions comes from the line of Eric Sheridan with Goldman Sachs. Your line is now open.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the questions. And maybe a two-parter if I can. Compared to what you have seen historically, is there any way to frame or quantify what you are embedding in the forward guidance for promotional activity or competitive intensity in the next quarter over the holiday period versus what you have seen historically? And is there any sense that you might see a different bent to competition in the industry given some of the inflation dynamics and consumer wallet dynamics out there broadly? Thanks so much for the color.\n\nSumit Singh -- Chief Executive Officer\n\nEric, compared to Q3, the promotional environment is elevated in Q4. You know, this is normal seasonal pattern we see every year heading into the holidays. But within the context of Q4 itself, we believe the promotional environment remains rational and more or less in line with what we have seen in previous holiday periods. And looking forward, we don't expect the levels of promotions will intensify beyond the current levels that we are seeing.\n\nOn your second question, we aren't -- do we expect competitors to add differently given inflation? You know, the fact that the industry, primarily on the consumables and healthcare side, is mapped, I think it allows, you know, a [Audio gap] discipline in a market. And secondly, supply chains haven't yet fully recovered. So, in-stock positions are certainly improving, but they are not back to normal to be able to expect hyperactivity. And then third, when you look at hard goods sales that are generally the elastic category, you know, currently, there isn't much elasticity to be driven given the consumers' mindset plus the inventory there, it doesn't -- like when you look at the contribution from a contribution point of view, it makes up about 15% of our overall sales.\n\nSo, we are a little more insured there from a spend point of view.\n\nOperator\n\nThank you for your question, sir. Our next line of questions comes from the line of Dylan Carden with William Blair. Your line is now open.\n\nDylan Carden -- William Blair -- Analyst\n\nOK. Thanks a lot. Just curious if you guys could decide today to provide any detail on the other revenue line item. I know there is a couple of moving parts there, particularly if you are seeing trade down or any benefit more broadly in the last several quarters in the private label space.\n\nAnd any update on the partnerships with vets or Practice Hub sort of how pharmaceuticals are trending? Thanks.\n\nMario Marte -- Chief Financial Officer\n\nHi, Dylan. This is Mario. I will take the first part of that. So, as you know, we don't desegregate that other line item, other revenue item.\n\nBut in there, we include not only our pharmacy but also our private -- all of our proprietary brand sales specialty, meaning anything that is noncat type of product, meaning other peptides. As you would expect that you saw in the hard goods, I will give you context rather than specific numbers. But as you saw in hard goods, though that was an improvement quarter over quarter in the terms of decline, a lot of our sales in the private brand space are going to be hard goods. So, just like we sell with third-party or national brands hard goods declined year over year.\n\nYou would have expected something similar on the private brands and other thing. Our healthcare offerings, our pharmacy especially continues to perform really well and to grow faster than the rest of the business. So, I will say that.\n\nSumit Singh -- Chief Executive Officer\n\nAnd then we have not seen trade downs. I think that was part of your question. Your second part of the question was on Practice Hub updates or wet initiatives. Look, we are pleased with the update.\n\nPractice Hub scale is up 30% quarter over quarter from the last time we met you. So, we continue to deepen our presence, our engagement, and our penetration with the vets and in a positively oriented manner. Connect with a vet continues to scale well. We are pleased with insurance.\n\nWe are very early in insurance. So, these are generally arcs that are certainly beyond the one-year mark. These are verticals that we think of in terms of three-year increments, just as we did pharmacy when we launched it back in middle of 2018, '19 time frame. But overall, we are pleased with the way that we are building out the healthcare ecosystem, and we are bullish about our place in this.\n\nDylan Carden -- William Blair -- Analyst\n\nThanks a lot, guys.\n\nOperator\n\nThank you for your question, sir. Our next line of questions comes from the line of Justin Kleber with Baird. Your line is now open.\n\nJustin Kleber -- Baird -- Analyst\n\nHey, good evening. Thanks, guys. Just a follow-up to the question on promotions. If we look at gross margin, you are going to end this year about four points above '19.\n\nCan you help us understand how much margin has benefited over these past three years from this more benign promotional backdrop? Just so we can assess what a normalization in the environment could mean if it does happen for gross margins in '23 and beyond?\n\nSumit Singh -- Chief Executive Officer\n\nIt's immaterial to the gross margin progress that we are showing. Any context to add, Mario?\n\nMario Marte -- Chief Financial Officer\n\nYes. No, I think that's exactly right. I think it's de minimis and I would say where you see the gross margin improvement over time is everything we have talked about. It is getting into or expanding our higher-margin categories, healthcare, hard goods.\n\nIt is the embedded business getting bigger, gaining the scale. It is gain sharing the benefits across our entire vendor supply and inbound and outbound, it is all those drivers there, but not promotional environment doesn't really affect it not materially here.\n\nJustin Kleber -- Baird -- Analyst\n\nOK. I guess -- and why is the big step down implied in 4Q on gross margin? It's -- you know, there's always a promotional holiday, right? So, I guess it sounds like there is not a year-over-year change in promotions that you are anticipating this holiday. So, if it's not been a big benefit, I guess I am trying to understand why the step down in margin here in 4Q relative to the 28.4 in 3Q.\n\nSumit Singh -- Chief Executive Officer\n\nSequentially, I mean, margins, of course, Q4 is a seasonal period. So, you would expect increased promotional activity. And we are seeing that. We have seen increased promotional activity as we move sequentially out of Q3 into Q4.\n\nOn an annual basis, we will be stronger this quarter relative to last quarter, relative to the same quarter last year.\n\nMario Marte -- Chief Financial Officer\n\nYes. So, between that and the peak surcharges that are happening during the holidays, and that's expected, we wouldn't have seen that in the third quarter. We would see it more in the fourth quarter. So, there are different drivers there, exactly.\n\nNow, I think maybe the other part of your question you didn't ask, and I will answer it anyways was, if you look at what we are looking at for the full year, we came into this year expecting to be basically we said broadly in line. We expect it to be more or less flat year over year on a full-year basis. And now we are guiding to a 90-basis-point to 100-basis-point improvement in end gross margin. So, we are seeing certainly a lift there as we go through the year.\n\nJustin Kleber -- Baird -- Analyst\n\nGot it. And just an unrelated question, you mentioned price -- another round of, I guess, cost increases and, therefore, price increases that need to be pushed in the system. If we eventually enter a period of deflation as input costs decline, how do you guys think about the ability to sustain all this pricing that's been taken here over the past few years, particularly in the consumables category? Thank you.\n\nSumit Singh -- Chief Executive Officer\n\nYeah. We think pricing will sustain because most of the pricing is getting translated or applied in the industry through MAP pricing and MAP prices are generally sticky. So, you see less variability and therefore more stability at the same time. So, we expect these to be sticky.\n\nJustin Kleber -- Baird -- Analyst\n\nAll right. Got it. Thank you both. Best of luck in the holidays.\n\nSumit Singh -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you for your question, sir. Our next line of questions comes from the line of Chris Bottiglieri from BNP Paribas. Your line is now open.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nHey, guys. Thanks for taking the question. You made a small bolt-on acquisition of PetaByte Technologies in November. Can you talk more about what capabilities this gives you and how it fits into your broader ambitions in the healthcare space?\n\nSumit Singh -- Chief Executive Officer\n\nYeah. Sure. So, PetaByte is a relatively small acquisition of a cloud-based provider of technology solutions for the vet sector that we completed in November. We are excited to welcome the PetaByte team into the Chewy family.\n\nAnd we see opportunities -- significant opportunities associated with adding PetaByte's technology to our broader portfolio of healthcare service offerings. And today, there is not much more to comment because we are -- it's early stages and work has just begun, but we look forward to sharing more with you in the quarters to come.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nGot it. OK. Thanks. And then I guess the next question is, can you just talk more about the -- I guess, the basket size is what you are seeing there? Are you seeing your basket size has grown? It sounds like discretionary is under pressure.\n\nSo, it's like you are adding more discretionary. What's driving the bigger basket sizes? Are people trading into bigger package sizes in order to save more money per unit because of inflation, or is this just -- are you finding more ways to attach like healthcare products and stuff like that, and that's what's driving that?\n\nSumit Singh -- Chief Executive Officer\n\nYeah. I think it's a combination of pricing strength and our complementary growth on the healthcare side. We have come up with several different complementary products to add to the simple consumables and supplies purchase. So, as attach rates for highly discretionary categories such as toys, perhaps, is near-term impacted, right? The attach for pharma drugs, you know, other products such as insurance, telehealth, these are all additive to the basket size.\n\nAutoships have higher basket sizes than non-Autoship orders and our ownership percent has continued to increase. So, that's the contributor in improving basket sizes as well. But this is all in place.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nGot it. OK. Thank you.\n\nOperator\n\nThank you for your question, sir. Our next line of questions comes from the line of Seth Basham. Your line is now open, sir.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot, and good afternoon. My question is on customer acquisition costs. You know that gross customer adds increased 6% sequentially, while your advertising and marketing expense increased 23% sequentially. So, your tax was up sharply, were your LTV expectations on customizations changed that much from the last quarter to this quarter to maintain ROI expectations on new customers?\n\nMario Marte -- Chief Financial Officer\n\nHey, Seth, this is Mario. I will start off and maybe Sumit can cover something. The customer, you said that our gross adds were up 6% quarter over quarter. So, expand on that one.\n\nI am trying to make sure that I answer your question correctly.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nI believe that's what you said in the script and in the shareholders letter.\n\nMario Marte -- Chief Financial Officer\n\nYeah. The gross adds, that is both new customers and customer reactivations. So, it is a combination of both customers that are lapsed and coming back and also gross adds. I wouldn't try to tie the two directly together.\n\nWe have gotten this question somewhat similar before on the active customer count increase and comparing that to investments in marketing. But I would say it's -- you have to sort of disconnect the two. They are not -- they shouldn't be tightly connected that way.\n\nSumit Singh -- Chief Executive Officer\n\nThis is Sumit. We are continuing to see NSPAC growth, LTV growth. So, when you look at Q3, there were multiple areas that the spend actually went in -- on top of the increased CPC or increased ad cost that we see in Q3, which you typically do coming out of a lull in Q2 as you gain as everybody tries to gain kind of mind share of the consumer in a current environment where the consumer pool remains shallow. So, CPCs have continued to increase.\n\nBut beyond that, we saw opportunities to invest in three different areas where we did. First is customer development, focused on increasing engagement and expanding NSPAC. So, that was part of our investment. Number two, reactivating previously churned customers.\n\nAnd in Q3, we saw a double-digit year-over-year increase in customer reactivation. And then three, there is always some experimentation and testing that we are doing with new channels that are designed to drive broader reach and awareness of the Chewy brand and positioning that right in front of the holiday season as we gain more traction with customers is just a prudent thing to do. So, all in all, we are -- in the way that we spent the money, we kept it within the 5% to 7% range that we have talked about before, and we were satisfied with the outcome here.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. OK. So, your TAC was up sequentially but in line with expectations to maintain ROI and the customers you acquired in this quarter relative to last?\n\nSumit Singh -- Chief Executive Officer\n\nThat's right. Yes.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you for your question, sir. I would now like to pass the call back to Mr. Sumit Singh for any closing remarks.\n\nSumit Singh -- Chief Executive Officer\n\nThank you, all, for joining us. Happy holidays, and a happy new year.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRobert LaFleur -- Vice President, Investor Relations\n\nSumit Singh -- Chief Executive Officer\n\nMario Marte -- Chief Financial Officer\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nCorey Grady -- Jefferies -- Analyst\n\nLee Horowitz -- Deutsche Bank -- Analyst\n\nJulio Marquez -- Guggenheim Securities -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nDylan Carden -- William Blair -- Analyst\n\nJustin Kleber -- Baird -- Analyst\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nMore CHWY analysis\n\nAll earnings call transcripts"
}