{
  "companyName": "Carnival Corp.",
  "companyTicker": "CCL",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/21/carnival-corp-ccl-q4-2022-earnings-call-transcript/",
  "content": "Carnival Corp. (CCL -0.25%)\nQ4 2022 Earnings Call\nDec 21, 2022, 10:00 a.m. ET\n\nJosh Weinstein\n\nGood morning. This is Josh Weinstein. Welcome to our fourth quarter 2022 business update conference call. I'm joined today by our chair, Micky Arison; our chief financial officer, David Bernstein; and our senior vice president of investor relations, Beth Roberts.\n\nBefore I begin, please note that some of our remarks on this call will be forward-looking. Therefore, I must refer you to the cautionary statement in today's press release. Our business continues to accelerate on an upward trajectory as we rapidly close the gap to 2019. In fact, we are already exceeding 2019 revenue per diems, and we're gaining momentum on our return to strong profitability.\n\nTaking a step back, this year, we've completed a monumental 18-month journey, and with our scale, what we believe to be the world's largest start-up, returning 90 ships to service, reboarding over 100,000 team members, and restarting our unmatched portfolio of eight private island and port destinations, plus our unrivaled land-based footprint in Alaska and the Yukon, all while welcoming back nearly 9 million guests. For that, I sincerely thank our global teams around the world for the ingenuity and sheer determination it took to see that through to completion. Throughout 2022, we have aggressively built occupancy from a 50-point gap in the first quarter to less than 20 points in the fourth quarter. We achieved this on growing capacity as we returned another 35% of our fleet to service in 2022, reaching 99% of our 2019 capacity levels during the fourth quarter.\n\nAnd on top of this, our constant dollar revenue per passenger cruise day was 2% higher than 2019's record levels for the full year and 4% higher in the fourth quarter, overcoming the dilutive effect of future cruise credit. Without this impact, each would have been two points higher. And in the process, we sustained record-breaking onboard revenue per diems significantly higher in 2019. We're also not losing sight of our cost base as we've worked through our restart and continue to absorb and mitigate the impacts of the high inflationary environment we've all been living in.\n\nWe reduced the increase in adjusted cruise costs, excluding fuel per ALBD in constant currency, from up 25% in Q1 to up 11% in Q4. We've also significantly ramped up our advertising and sales support to drive future demand. Thanks to this and the hard work of our amazing trade partners, our percentage of first-time guests has continued to sequentially improve, closing the gap to 2019 levels. And we've been working smarter with our shoreside team's headcount already having been significantly reduced from 2019 levels for some time now.\n\nWe delivered stunning new flagships for five of our brands, including Carnival Celebration, AIDAcosma, Costa Toscana, and Discovery Princess, as well as our first luxury expedition ship, the finest in the world, Seabourn Venture. All of these ships were purpose-built to generate higher returns. We broke ground at a new exclusive destination, Grand Bahama Port, which will be a game changer for Carnival Cruise Line, while, at the same time, benefiting, more than ever, from our existing private islands and unique port destinations, which captured 6 million visits from our guests. And all while working to minimize our environmental impact, with a 7% reduction in carbon intensity, a 30% reduction in food waste, and 290 million less single-use items compared to our baseline.\n\nMost importantly, we are back to doing what we do best: delivering millions of unforgettable and much-needed vacation experiences to our guests. And we are truly a global company, with 45% of those guests sourced outside of North America in 2019. In fact, we practically carried more people outside the U.S. than any of our peers carried in total.\n\nWe believe that having the No. 1 or No. 2 brand in each of the largest cruise markets such as North America, the U.K., Germany, Australia, Italy, France, and Spain is the foundation of our portfolio strategy and allows us to tailor our experiences and offerings to those specific source markets, enabling us to generate stronger brand loyalty and gain greater penetration and profit. In this current environment, though, there are two factors that have had an outsized impact on our results: an uneven reopening of cruise travel around the world in the aftermath of COVID and the more direct impact the war in the Ukraine has had on European countries.\n\nWhile all of our brands are on an upward trajectory, the pace of the recovery has trailed for those brands most heavily exposed to these factors. In 2019, one-third of our non-North American guests, 2 million people, came from Australia, Asia, and the Baltics. The vast majority of these guests were sourced through Costa and Princess, representing 40% of Costa's guests and 25% of Princess' guests. At this point in time, Australia's reopening is where North America was a year ago, and Japan is closer to two years behind.\n\nThe lagging reopening of these markets has triggered multiple changes in deployment and guest-sourcing approaches as we anticipate the impacts will continue to be felt, particularly for the first half of 2023. Of course, China also has yet to reopen. Given Costa's significant presence in Asia, with five ships planned to operate there year-round pre-pause, we've taken actions to right-size the Costa brand with the removal of another two smaller, less efficient ships from the Costa fleet. This is in addition to the previously announced three ships transferring to our highly successful Carnival Cruise Line brand.\n\nThis positions Costa well, with a competitive fleet with closer-to-home deployments focused on its core markets in continental Europe. We have already been encouraged by the recent strength in booking volumes for the Costa brand. In fact, last month, Costa's booking volumes in these core markets were above 2019 levels for the fourth quarter of 2022 and the first quarter of 2023 as they navigate a closer-in booking period. The war in the Ukraine remains concerning for us all, and especially those in the affected regions.\n\nGiven the closer proximity for both Costa and our German brand, AIDA, the war and associated impacts have weighed heavily on consumer confidence in those regions, resulting in greater uncertainty and closer-in booking patterns. To help manage, we've made strategic deployment decisions, leaning into more itineraries that homeport, where the guests originate, as well as shorter duration cruises, helping us to reduce the friction of air travel, lower the overall cost, and facilitate a closer-in booking environment. We believe this positions us well to attract more new-to-cruise guests and make us even more of a value proposition versus land-based alternatives by bringing our ships closer to where our guests live. We have furthered our fleet optimization efforts again this quarter, bringing the cumulative number of ship dispositions since the pause to 26.\n\nWhen coupled with the delivery of larger, more efficient ships, including the successful introduction of Carnival Celebration last month and the addition of Arvia for P&O Cruises just last week, this will result in nearly a quarter of our fleet consisting of new capacity. This fleet transformation results in an 8-percentage-point increase in balcony cabins, along with a tremendous increase in available real estate on board to deliver even more differentiated onboard experiences and generate associated revenues contributing to durable revenue growth going forward. We will also benefit from lower ship-level unit costs that help to mitigate inflation, with 9 percentage points higher fuel efficiency and 6 percentage points greater efficiency in remaining operating costs. Our revenue generation will also benefit from the launch of Carnival Venezia's Fun Italian Style in New York.\n\nThe program is off to a great start, having been met with strong demand and high prices, building confidence and prospects for this creative initiative. Overall, in 2023, we'll have just 3% capacity growth compared to 2019 while still retaining the excitement and demand from 12 fantastic ships delivered in 2020. And thanks to portfolio optimization efforts, our capacity grows and weighted toward three of our highest-returning brands: Carnival Cruise Line, AIDA, and P&O Cruises U.K. There is no doubt, 30-year assets will pay dividends along our path to strong profitability as we build demand and generate higher revenue yields over time.\n\nHaving said that, brand by brand, there is high capacity growth that we are managing in 2023. In this transition year, P&O Cruises is absorbing 40% more capacity than 2019, thanks to Iona and Arvia. AIDA has 20% more capacity at the start of the year. Costa will have significantly more capacity in its core markets versus 2019 as the full benefits of our fleet optimization program won't be completely felt until 2024.\n\nAnd Princess will source more heavily than ever before from North America given its source market disruptions. As I mentioned on the previous call, to help support this growth and to drive overall revenue generation, I've actively been working with each brand on their strategies and road maps. As a result, I've authorized our brands to take a significant step up in advertising activities, including a nearly 20% increase in our investment this past quarter over 2019, to elevate awareness and consideration and to drive demand for both the near and the longer term. This should be particularly impactful with those new-to-cruise, where we draw about one-third of our guests, as we position to take share from land-based alternatives.\n\nWe are capitalizing on the 25% to 50% value gap for land-based alternatives that, frankly, should not exist with new marketing campaigns to communicate our significant value advantage to land-based alternatives, including newly launched digital creatives from several brands. We plan to continue these increased investments in advertising as we head into next year to promote a strong wave season where we capture disproportionately higher bookings for the year, particularly our important summer season. Having been in pause status for the better part of two years, we are also rebuilding top-of-funnel demand through the army of advocates coming off our ships every day recommending our cruise vacations, a renewed focus on our trade relationships, and a growing sales force. On the revenue management side, we are ensuring that each brand is utilizing pricing philosophies to maximize revenue, from launch to sailing, and sharing best practices across brands.\n\nOur teams are focused on higher value add from bundle packages, supported by a market-for-sale approach and consistently capturing incremental revenue streams from many initiatives such as more robust cabin upgrade programs. While building back demand and enhancing our yield management tools and strategies, we are optimizing the combination of occupancy, ticket, and onboard to deliver revenue to the bottom line in the near term while maintaining price integrity for the long term. Given the closed-in nature of the booking curve from the disruption caused by the omicron variant earlier this year and the friction from protocols in effect through the bulk of the year, most brands have leaned heavily into opaque distribution channels like our friends and family rates, which allow us to achieve higher occupancy and resultant onboard revenue while still preserving pricing power over time as they are rates that are not offered in the general marketplace. These channels are beneficial in reaching higher occupancy levels and higher onboard revenues, particularly for our North American brands.\n\nBooking volumes have already strengthened following the relaxation in protocols. Cancellation trends are improving globally, and we have seen a measurable lengthening in the booking curve. This applies across the board. Since the start of the year, our EA brands have pushed the booking curve out and narrowed the gap by more than a month, while our North American brands have pushed the curve out and narrowed that gap by two months, now nearing 2019 lead times.\n\nWe enjoyed a strong response to our recent Black Friday and Cyber Monday activity, and the momentum has continued into December, building our base occupancy and marking an early start to a strong wave season ahead. It is important to recognize, much of the first half of 2023 was booked prior to the relaxation in protocols. And in actuality, many of these first half cruises are still implementing certain more restrictive protocols given the itinerary profiles consist of lengthier, exotic deployment, including our long-awaited return to world cruises and long winter deployments for our European brands operating from colder climates. And much of this relies heavily on long-haul flights, which are not conducive to a closer-in booking environment.\n\nNonetheless, we expect our first quarter occupancy gap to 2019 to be reduced even further and on higher net per diems on our way to historical occupancies in the summer. This bodes well for 2023 overall, as we expect more markets to open for cruise travel, protocols to continue to relax, our closer-to-home itineraries play out, and our brands continue to hone all aspects of their revenue-generating activities. And as we continue to invest to build demand, we are positioned to pull back on promotions and opaque channels to drive meaningful ticket price improvement over time. On a complementary basis, our industry-leading operating costs and fuel consumption per ALBD set us up to effectively deliver more of this revenue to the bottom line.\n\nNormalizing for 2019 fuel price and currency changes, which provides a better sense of the strength of the underlying fundamentals of the business and our progress, we expect adjusted EBITDA per ALBD to reach 50% of 2019 levels in the first quarter of 2023, with sequential quarterly improvement as we progressed through 2023 that should rival 2019 levels by the end of the year. Turning to capital expenditures, we actively manage down our spend by over $500 million during 2022, and we've taken a hard look at 2023 and beyond and reshaped investment spending by $300 million annually for a cumulative reduction of $1.7 billion. We have reprioritized project lists and hurdle rates to reflect the current environment while absolutely maintaining our commitment to excellence, compliance, protecting the environment, and the safety and well-being of our guests, team members, and communities we serve. Going forward, we are committed to using our expected cash flow strength to repair the balance sheet over time, and we'll be disciplined and rigorous in making newbuild decisions accordingly.\n\nWe have just four ships on order through 2025, plus our second incredible Seabourn luxury expedition ship to be delivered in 2023. This is our lowest order book in decades. We don't expect any new ships in 2026 and anticipate just one or two new builds each year for several years thereafter. Turning back to our operating performance, we are effectively addressing near-term challenges in the post-pause transition with higher first quarter net per diems expected and have been reshaping our portfolio to drive revenue growth as we return to historically high occupancy levels and delivering measurable pricing improvements over time.\n\nWe are fast-tracking our momentum by investing in marketing and sales support to effectively communicate the amazing vacation experiences we deliver day in and day out, offering an unparalleled level of convenience and personalized service and at way too good of a relative value to land-based alternatives at every price point, from mass contemporary to ultra-luxury. Overall, we remain focused on driving revenue growth that hits the bottom line and accelerating our return to strong profitability. And over time, this revenue generation, our industry-leading cost base, and our more focused capital expenditure profile will support significant free cash flow and propel us on the path to deleveraging, investment-grade credit ratings, and higher ROIC. This has been a truly remarkable year, and we have come a long way in an incredibly short amount of time.\n\nThese efforts highlight what we've always known: Our people are our greatest asset. And now, they are armed with an even greater skill set built up over the last few years, creativity, agility, and perseverance, that will help push us forward. We're looking forward to 2023 and are positioning for our first strong wave season in four years, enabling us to deliver a strong summer period where we generate the bulk of our operating profit for the year. With that, I'd like to turn the call over to David.\n\nDavid Bernstein -- Chief Financial Officer\n\nThank you, Josh. I'll start today with a recap of our cumulative booked position and our financial position. Then I'll provide some color on 2023. Turning to our cumulative booked position.\n\nMarking an early start to wave season, we ended the year with multiple brands breaking records on very strong Black Friday and Cyber Monday booking buy. Our full year 2023 cumulative advanced booked position is at higher prices and constant currency normalized for FCCs when compared to strong 2019 pricing and is higher than the historical average booked position. The second, third, and fourth quarters all have a booked position that are above the historical average, while the first quarter 2023 booked position was impacted by heightened protocols during its prime booking period, which have since been responsibly relaxed. As a result of the relaxation of the protocols, booking volumes for first quarter of 2023, along with all future sailings, have increased.\n\nTherefore, we expect to continue reducing our occupancy gap in first quarter 2023 to 2019 by nearly 5 percentage points from fourth quarter 2022. The strong cumulative booked position has resulted in total customer deposits hitting a fourth quarter record of $5.1 billion as of November 30, 2022, surpassing the previous record of 4.9 billion as of November 30, 2019. Next, let's talk about our financial position. During 2022, we continued to take refinancing risk off the table by addressing our 2023 debt maturities and getting ahead of our 2024 maturities.\n\nAs a result of this, we ended the fourth quarter of 2022 with 8.6 billion of liquidity. Looking forward, we expect to turn free cash flow positive in the back half of 2023 and continue to be free cash flow positive in 2024 and beyond. We anticipate utilizing this free cash flow to de-lever our balance sheet on our path back to an investment-grade credit rating. Now, I'll finish up with some color on 2023.\n\nFor first quarter 2023, we expect capacity growth to be 3.7% when compared to first quarter 2019 and 3.3% for the full year 2023 as compared to the full year 2019. During 2023, we expect to continue to close the gap on occupancy to 2019 levels. Occupancy for first quarter 2023 is expected to be 90% or slightly higher, just a 14-percentage-point gap or better. As I said before, this would be nearly a 5-percentage-point improvement from the fourth quarter 2022 gap.\n\nBut that is not enough. We are working hard and expect to close the gap to 2019, with occupancy returning to historical levels in the summer of 2023. On the pricing front, for first quarter of 2023, we expect net per diems to be up 5.5% to 6.5% in constant currency and 3% to 4% in current dollars as compared to first quarter of 2019. A great accomplishment as we start the new year.\n\nHowever, the net per diems of the first quarter of 2023 are expected to benefit from brand mix when compared with first quarter 2019. During 2023, while our European brands expect onboard and other revenue per diems to be up significantly versus 2019 as they were in 2022 and as has been the case with our North American brands, absolute onboard spending on our European brands is less than that on our North American brands. Our European-brand guests tend to drink a little more but gamble a lot less. As the European brands catch up on occupancy with our North American brands during the second and third quarters and build their ships, they will make up a larger percentage of the total, changing the per-passenger average.\n\nAnd with their historically lower onboard revenue per diems, we will no longer benefit from the brand mix. Also, for 2023, we do anticipate returning to non-GAAP financial measures to report revenue performance and use net per diems as opposed to revenue per passenger cruise day we used in 2022. For 2023, we once again expect that onboard and other revenue per diems to be up significantly versus 2019, helping to drive the net per diems up. However, as I indicated in the past, as we change the bundle package offerings, we reevaluate the revenue accounting allocations.\n\nAs a result, in 2023, more of the revenue will be left in tickets and less allocated to onboard, impacting the onboard and other revenue per diem comparisons to both 2022 and 2019. Just another reason to add to the list of reasons why the best way to judge our revenue performance is by reference to our total cruise revenue metrics such as net per diems. Now, turning to cost. Off the base of our industry-leading cost structure, adjusted cruise costs without fuel per ALBD for the full year 2023 versus 2019 are expected to be up 5% to 6% in current dollars and 7.5% to 8.5% in constant currency.\n\nFor the first quarter 2023, the ranges are up one point less, driven by lower dry-dock costs per ALBD versus first quarter 2019. But first quarter 2023 does include an over 30% increase in advertising to further accelerate demand. There are three main drivers of the cost increase. First, our forecast is for an average mid-teen level of inflation across all our cost categories globally.\n\nSecond, our decision to further invest in advertising to drive demand and pricing in 2023 and beyond is expected to add 1 percentage point to 2 percentage points to cost per ALBD. And third, deployment optimization and other small investments are likely to add 1 percentage point. Significantly mitigating these increases are our fleet optimization program that is expected to drive a 6-percentage-point improvement in ship operating cost per ALBD that is worth 4.5 points of adjusted cruise costs without fuel per ALBD and the creativity, resourcefulness, and hard work by our global teams producing sourcing and productivity savings of approximately 4 percentage points. A great accomplishment.\n\nI would like to say thank you to all the team members who contributed to this effort. The details of depreciation and amortization, interest expense, and fuel expense can be found in the business update press release we issued earlier this morning in the section titled Selected Forecast Information, so I will not walk you through all the numbers. However, for those of you modeling our fuel expense, please note that we expect MGO to represent about 40% of fuel consumption for 2023. However, that percentage may be slightly higher during the early part of the year.\n\nWhile we're on the subject of fuel consumption, I would like to recognize everyone on our global team who contributed to the expected 15% reduction in both fuel consumption per ALBD and carbon emissions per ALBD for the full year 2023, both as compared to 2019. We are working aggressively to drive down our carbon footprint, fuel consumption, and costs through technology upgrades being rolled out like the air lubrication systems mentioned in this morning's business update, along with investing in port and destination projects, and even more focus on itinerary optimization across our portfolio of brands while realizing the benefits of our fleet optimization efforts so that everyone can fully understand the underlying strength of our business. I did want to point out that for 2023 versus 2019, at current fuel prices and FX rates, we did expect a negative impact from fuel price, fuel mix, and currency of approximately 150 million for first quarter and an impact that is multiple times that for the full year, including a full year currency impact of over $70 million. Putting all these factors together, we expect 250 million to 350 million of adjusted EBITDA for the first quarter 2023 and sequential improvement compared to 2019 in each quarter of 2023 as we continue to close the gap.\n\nHowever, given the significance of the wave season ahead of us, we will be in a much better position to provide full year guidance for net per diems, occupancy, and EBITDA early next year. We plan on providing that guidance during our first quarter business update in March. And now, operator, let's open up the call for questions.\n\nOperator\n\nThank you. [Operator instructions] And our first question is from the line of Steve Wieczynski with Stifel. Please go ahead.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nYeah. Hey, good morning, guys. Good morning, Josh and David. So, you know, I guess the first question would be around the marketing spend for 2023.\n\nAnd I guess, you know, I guess we were thinking that marketing would be, you know, accelerated, you know, throughout the fourth quarter of '22 and then into the first quarter of '23 and then start to fall off some. But it sounds like, you know, you guys might be keeping marketing spend pretty high throughout the entire 2023 year. And I guess the question is maybe, you know, maybe why are you keeping it, you know, so high for the full year? And is there any way to understand, you know, maybe what that cost cadence will look like throughout next year? Just wondering if there are any quarters where spend levels for marketing or other costs might be, you know, higher or lower? Hope that all makes sense.\n\nJosh Weinstein\n\nYeah. Hi, Steve, how are you doing? So, with respect to the advertising in 2023, you know, if you saw the material that had been put on the website, you know we've been ratcheting up across all of 2022. And we are very excited about the momentum that we've got. We've already started the wave season incredibly strong with our Black Friday, Cyber Monday, and really just the whole booked position that's moved nicely in the month of November.\n\nAnd we think that advertising has a good amount to do with that, to really reach first-timers, generate awareness, generate consideration, and doing so in a really meaningful way. And I think it's -- we've got great brands, and we've got tremendous brands, but we need to do a better job getting the voice out. And this is a good way to do it. And it helps not just us, it helps our trade partners, it helps the bookings across the board.\n\nSo, as far as how we'll look at it across 2023, we've given you the guidance specifically for the first quarter. The great thing about advertising is, you know, we can dial up, dial down across the board where it's working and where we don't think it's having as much of an impact. But right now, the activities that we're doing both in the mainstream media side and then the digital and performance marketing, it's really starting to hit our stride. So, we're pretty pleased with the results.\n\nDavid Bernstein -- Chief Financial Officer\n\nYeah, Steve. The only other additional color that I would add to that is, remember, I've said historically the best way to judge our cost structure is the full year. And I gave you the guidance there of one-point to two-point increase. The problem with the seasonality is as we go along, we make decisions that are most appropriate and we remain agile and flexible.\n\nBut with that said, I will say that the advertising is likely on a quarterly basis, to be the highest in the first quarter and the lowest in the third quarter. But the third quarter traditionally has always been a low quarter in terms of advertising. So, that's probably the best guidance we can give you at this point.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nAnd to follow up on that, I guess as we kind of think a little bit further down the road. I mean, if you guys kind of get back to those normalized load factors and demand still looks pretty solid through the majority of '23, would you expect as we get to '24 that you would be able to pull back, you know, a good bit on that marketing spend?\n\nJosh Weinstein\n\nYeah. I mean, it's certainly within our control. Ultimately, we're not just trying to get back to occupancy levels that are historical. We're trying to really drive the unit pricing as well.\n\nAnd so, advertising is a big component of that. So, we're -- you know, I hope we're having that conversation in six months, Steve.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK, great. And then just one quick housekeeping, if possible. David, the two ships that are leaving Costa, were they sold, or are they just going to be scrapped?\n\nDavid Bernstein -- Chief Financial Officer\n\nNo. So, we announce three ships in total, and two of them we actually have a contract for at the moment, and one we're working on, a contract for sale.\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nOK. OK. Gotcha. Thanks, guys.\n\nHave a great holiday.\n\nJosh Weinstein\n\nYou, too, Steve.\n\nDavid Bernstein -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question is from the line of Robin Farley with UBS. Please go ahead.\n\nRobin Farley -- UBS -- Analyst\n\nGreat. Thank you. There were a couple of, you know, kind of really key things that I just -- I wonder if you could clarify for us. First, the comment on '23 price, that it's higher.\n\nI think you say adjusted for FCC. So, including the impact of that discount, which probably would only be 1% or 2% at this point, is your price on the books in '23 in constant currency higher than '19 including that? And then I'm just -- I guess I'm a little surprised that there's no yield guidance for Q1 because you give a lot of detail to get to the EBITDA line, including occupancy. And I haven't been able to do all the math since the release is only out for a few minutes before the call, but it seems like you have a yield in mind for Q1. It would be sort of 80%-plus booked by now.\n\nSo, I just wonder if you could help us with the sort of a range of what might get to the EBITDA that you're talking about just to help us check our math. And then lastly, the comment on EBITDA, it's like -- so the guidance for Q1, up 250 to 350 and then up sequentially each quarter after that. It is -- I wonder if you could just help us with a floor like on a full year basis. You know, can we get -- you know, you're comfortable that you would be higher than $3 billion in EBITDA for the full year.\n\nLike in other words, that sort of up sequentially each quarter could still get to sort of quite a low EBITDA number for the full year. And I just wonder if you could help give us the floor. Thank you.\n\nDavid Bernstein -- Chief Financial Officer\n\nYeah.\n\nJosh Weinstein\n\nHey, Robin. How are you doing? That was a lot of questions. So, let me start backwards because I can remember the first -- the last one. So, with respect to EBITDA, what we tried to convey is, you know, on a performance basis -- on a unit performance basis, when you strip out the noise of fuel and currency, you know, what's our trajectory and how are we looking at things? And so, we said on that basis we'd get back to 50% of 2019 levels in Q1, and sequentially throughout the year, continue to close that gap to 2019.\n\nI am certainly hopeful and pushing that we're going to exceed 2019 levels by the time we get to Q4. But we've got a lot of work to do to be able to do that. With respect to your question about yield guidance, just to make sure we're not -- so you want to do that?\n\nDavid Bernstein -- Chief Financial Officer\n\nYeah. Because, Robin, I guess maybe you missed the part in my notes where I did talk about this. I said specifically that we expect net per diems to be up 5.5% to 6.5% in constant currency. And that does translate to 3% to 4% in constant dollars.\n\nNow, we gave per diems, but, of course, we also gave the occupancy of 90% or slightly higher in the press release so you can calculate the revenue associated with that. And as far as the booking trends are concerned, you're right. You know, we did indicate that the FCCs would be less than a point for the year. And the book, the pricing would still be up even if we didn't add back the FCCs.\n\nWe're still at higher prices. I think that covers all your questions.\n\nRobin Farley -- UBS -- Analyst\n\nOK, great.\n\nDavid Bernstein -- Chief Financial Officer\n\nAny follow-up?\n\nRobin Farley -- UBS -- Analyst\n\nThat does. I have more, but I will get back in the queue. Thank you.\n\nDavid Bernstein -- Chief Financial Officer\n\nOK. Great.\n\nRobin Farley -- UBS -- Analyst\n\nThanks.\n\nOperator\n\nOur next question is from the line of, excuse me, Fred Wightman with Wolfe Research. Please go ahead.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for the questions. I just wanted to sort of follow up and build on the occupancy ramp. If we look just from 3Q to 4Q, 10 points of improvement.\n\nIf we look at sort of what you guys are expecting in 1Q, it's sort of five-ish percent. So, can you just sort of walk us through what's driving that lower sequential improvement relative to the 2019 levels and maybe how we should think about that in the context of the expectation that you guys are going to be back to sort of full occupancy over the summer?\n\nJosh Weinstein\n\nSure. Sure, Fred. So, one thing to think about when you think about our Q1 deployment profile, it is very different from what we typically have the rest of the year. You know, we've got actually nine ships in Q1 on world cruises, another four ships on 70-plus night grand voyages, and then a host of ships that are doing longer exotic voyages, 35-nighters, 28-nighters.\n\nAnd so, with that profile, you know, those take -- those are longer lead time type of itineraries, some bucket list types of things. And so, it is progressing for Q1 exactly where we thought it would be with respect to closing the occupancy gap given the dynamic of that itinerary profile. And as we get into Q2, those have stopped or winded down and we get back to the cadence that we expect.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nUnderstood. That makes sense. And just on the booking momentum, there was a comment in the release just talking about November booking volumes exceeding 2019 levels. Also a comment about momentum continuing into December.\n\nAre December bookings still above 2019 levels, or did those sort of tail off after some of the promos in November?\n\nDavid Bernstein -- Chief Financial Officer\n\nNo, they've continued very strong, and they've continued well above the 2019 levels. So, we're very pleased with the overall position and the bookings that are coming in to date.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nPerfect. Thank you.\n\nJosh Weinstein\n\nThank you.\n\nOperator\n\nOur next question is from the line of David Katz with Jefferies. Please go ahead.\n\nDavid Katz -- Jefferies -- Analyst\n\nMorning, everyone. Thanks for taking this. Two quick ones. I think in the past you've referenced getting back to, you know, 10% ROIC.\n\nIf you could just talk about the path there and, you know, the puts and takes and what has to happen for that to occur. And then second, with respect to the advertising, do you have any sort of measurements or metrics that you -- that are shareable, you know, that demonstrate or confirm some of the productivity around that? And that's it for me. Thanks.\n\nJosh Weinstein\n\nThanks, David. With respect to the advertising, you know, our brands -- without wanting to give away competitive positions, our brands are tracking with respect to awareness and consideration, which has a correlation to booking. They track lead generations. They track conversions on websites.\n\nThey track -- we have performance-type deals in the marketplace, and we actually know exactly what the impact is from the activities that we are taking. So, we do have them across the board, and we follow them, and we discuss them with the brands, and that's how we make decisions with them about where it is effective and where it might not be effective. And what's great about us having our brands sharing among themselves what's working and what's not working so we can learn from each other. With respect to the ROIC, it's revenue.\n\nI mean, revenue is the thing that's going to drive us back to double-digit ROIC. You know, David mentioned our industry-leading cost base. That will continue to be a focus, of course. But really, it's going to be the revenue, and that's where our brands are focused.\n\nDavid Bernstein -- Chief Financial Officer\n\nOne thing, David, I'd like to add on the advertising front. One thing we've been tracking is we take a look at our booked position for 2023. And in the last six months since we have increased the advertising, we have seen a shift and a lot more new to brand. In fact, it's an 8-percentage-point improvement.\n\nSo, at this point in time, what we're seeing for the 2023 booked position is that it's roughly half of the guests are repeat old guests and the other half are new to brand. Unfortunately, these people haven't all sailed, so I don't know whether they're new to cruise or they're brand switchers. We'll find that out shortly as they sail. But the fact is they're -- we're getting a lot of great demand, and we're seeing it in the booking volumes.\n\nJosh Weinstein\n\nAnd that's an indication also of the growing health of our trade partners because they're a huge piece of our ability to drive first-timers on board. So, shout out to them as well.\n\nDavid Katz -- Jefferies -- Analyst\n\nHelpful. Thank you very much. \n\nOperator\n\nOur next question is from the line of Jaime Katz with Morningstar. Please go ahead.\n\nJaime Katz -- Morningstar -- Analyst\n\nHey, good morning. Thanks for taking my questions. In the prepared remarks, there was a comment on reprioritizing project lists. Is there anything noteworthy to update us on maybe what you guys are shifting focus on or shifting focus away from? Anything sizable there?\n\nDavid Bernstein -- Chief Financial Officer\n\nSo, you know, there's -- I think a lot of this stuff is timing. You know, from a big perspective, if you look at the change in the capex, a lot of that had to do with the fact that 26 ships have left our fleet. They were smaller, less efficient ships. And therefore, we don't necessarily need the overall capex number as high as we had previously.\n\nBut when it comes time to prioritizing it, it's also a timing issue and doing the things that are most important first. And that's some of the reason why you saw the capex come down in 2022. The only noticeable thing that we're really -- as far as our office space, clearly with the new ways of working in today's environment, we're significantly reducing the amount of capex that we'll probably need to expand our offices as we continue to grow.\n\nJosh Weinstein\n\nYeah. You know, we -- I can give you an example of where we would and where we wouldn't reprioritize. So, you know, we talked in the press release and some of our prepared remarks about the impact we're making on our carbon footprint and the fuel consumption that drives that, that's going to continue full steam ahead. We see, A, great returns in that; and B, doing our part on the sustainability front, which is critical to our long-term success as well.\n\nThere could be things that when it comes to, you know, making a decision about the speed at which we want to introduce new venues on board of a particular brand, we can pace those out differently. We can take a little bit less risk on trial and error of creating new experiences. So, it's all a question of what we think the appropriate return could be, where we want to take risk, and where we just want to, you know, be more focused on managing the cash down.\n\nJaime Katz -- Morningstar -- Analyst\n\nOK. And then I know there's been a lot of discussion on marketing spend, and I'm not sure if you guys have directionally elaborated on maybe the ROI of marketing spend. There is -- seems to be a pretty decent push to sourcing more North American consumers across the cruise operator landscape. And so, I'm wondering if the marketing spend is as productive as it has been historically or if you expect it to be maybe temporarily depressed before you can bring that back.\n\nThanks.\n\nJosh Weinstein\n\nWell, I can repeat what we said, which is we are spending more, and we are very happy with the results, and we'll keep monitoring it and adjusting as appropriate. But we feel really good about our brands, their strength in the market, and our ability to champion them with additional advertising.\n\nJaime Katz -- Morningstar -- Analyst\n\nThanks.\n\nOperator\n\nOur next question is from the line of Brandt Montour with Barclays. Please go ahead.\n\nBrandt Montour -- Barclays -- Analyst\n\nHey, good morning, everybody. Thanks for taking my question. So, Josh, I wanted to dig into the opportunity, a little bit more on the marketing front as well. You know, if you were to try and isolate, you know, how much of the opaque channel mix shift you're doing now versus '19, that additional mix to that channel, and try and isolate the upside to that -- those per diems just from taking off the additional sort of, again, opaque channel promo activity, is there a way to sort of give us that level of magnitude for that opportunity when you are able to remove the rest of that?\n\nJosh Weinstein\n\nWell, I'd love to give you a straight answer, but I got to be honest. I'm not sure that I could in a way that I feel comfortable would make sense in a short amount of time.\n\nDavid Bernstein -- Chief Financial Officer\n\nSo, Brandt, I know that's like another way of asking us what is our yield guidance for the rest of the year. The one thing I do want to point out, which I said in my prepared remarks, is that, you know, we will -- wave season is important, and we will give guidance for the net per diems and occupancy and EBITDA for the balance of the year. However, we did give the net per diem guidance for the first quarter, as I reiterated before when Robin asked the question. And one thing I do want to point out is that I also mentioned that the first quarter benefited by brand mix, and that brand mix was worth about two points.\n\nAnd so, as you think through the balance of the year, there will be positives, as what you're just describing. But as you think through that, please take that into consideration as you forecast the year's per diem value.\n\nJosh Weinstein\n\nAnd I guess I could say, looking backwards and you look at our trajectory from Q3 to Q4, you know, we are pulling back, right? And that's helping improve our per diems, and we'll -- I mean, the great thing is it's pretty easy to turn on and turn off. And so far as we get into this wave season, the momentum is good. It gives us a lot of excitement about being able to fall back further as we get into 2023.\n\nBrandt Montour -- Barclays -- Analyst\n\nOK. That was really helpful. The second question I have is related to China. You know, you guys, it looks like the two ships that we didn't know where they were going to go are now being removed.\n\nAnd so, that means that there's no, you know, near or maybe even medium-term plans to return to China. Do you guys consider China still a medium- to longer-term opportunity for you? And are you watching that market closely to potentially go back eventually to, you know, alleviate supply pressures in other markets? Or how are you thinking about that market now?\n\nJosh Weinstein\n\nYeah, I mean, look, the great thing about our assets, they're mobile, and we've moved them to optimize our demand and our revenue generation. If and when China opens up again and opens up not just to domestic cruising, but really opens up, we'll certainly look at that. But we're not relying on it. We're not counting on it.\n\nWe have -- we are the No. 1 or No. 2 brand in all the major cruise markets today. And we like that position, and we're going to push hard on increasing our penetration there.\n\nBrandt Montour -- Barclays -- Analyst\n\nExcellent. Thanks, everyone.\n\nOperator\n\nOur next question is from the line of James Hardiman with Citi. Please go ahead.\n\nJames Hardiman -- Citi -- Analyst\n\nHey, good morning. Thanks for taking my call. So, there was a comment in the prepared remarks about discounting through opaque booking channels. That seemed like an important comment.\n\nI know criticism by at least one of your competitors is that you guys have been discounting in such a way that it's going to be difficult to recover from that any time soon. It seems like you disagree with that criticism. But also, it seems like, you know, if I look at the big difference between 3Q and 4Q, is sort of the turnaround in those per diems, which is obviously a focus for you guys. So, maybe speak to that strategy and your level of confidence that it's ultimately going to pay off.\n\nJosh Weinstein\n\nSure. So, you know, I'll speak for ourselves. I won't speak for anybody else. You know, we are a global company.\n\nWe have a different profile than our competitors. With respect to how our brands are optimizing revenue, which is price, it is occupancy and onboard spending. They are all using different levers and different mechanisms, including opaque channels, which, as you just referenced, we've been able to pull back over time without much of a problem. You know, we focus on the revenue that is going to get to the bottom line.\n\nAnd that's our focus, not just driving revenue, but driving revenue that doesn't get caught up in the costs and not hit our EBITDA or not hit our operating income. And that's what we're focused on.\n\nJames Hardiman -- Citi -- Analyst\n\nGot it. That's helpful. And then my second question, obviously, there's been a lot in the news, and if anybody has, you know, any kids in school right now, you know, half the class has something, right? Flu, COVID, RSV. This whole idea of a triple-demic, which is you got to hand it to the media for their ability to brand diseases at this point.\n\nBut I guess I'm curious if you're seeing anything in any of the metrics and booking statistics that you look at that would suggest that that's having an impact on your business at this point, or is the consumer largely over it as we think about how viruses and diseases are going to impact their willingness to book a cruise?\n\nJosh Weinstein\n\nYeah, we -- yeah, look, I mean, having come through two years of COVID, I think pretty much across the board, what we see is people are happy to get on with their lives. And obviously, I'm not trying to belittle what you said because, you know, there could be some folks that are dealing with some things that are pretty tough on them and their family right now. But what we see is trends that are going back to normal about how people are thinking about those types of illnesses. And, you know, we always knew this point would come, right, when all of the masking and staying away from each other would go away.\n\nAnd some things that we didn't experience would come back with a little bit of a fury on, you know, in the world, not on our ships. And that's what's going on. And we're taking it in stride. And it doesn't seem to be a problem.\n\nJames Hardiman -- Citi -- Analyst\n\nGood stuff. Appreciate it, guys.\n\nJosh Weinstein\n\nThanks.\n\nOperator\n\nOur next question is from the line of Patrick Scholes with Truist Securities. Please go ahead.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nGreat. Good morning. First question -- thank you. Good morning.\n\nHow should we read into your comments regarding pricing for next year? Certainly, [Inaudible] previously said higher. Now, it's slightly above. I mean, technically, they could mean the same thing. But, you know, can you put more color on that, please? Thank you.\n\nJosh Weinstein\n\nWell, I think you gave my answer, which is, you know, the language change, but it's really not a significant change in our booked position. Half one, we are really trying hard to close that occupancy gap. We are using the opaque channels where we think it makes sense and where we want to lean harder, and we plan to keep pulling that back as we get through a great wave season. And regardless, we anticipate very strong onboard spending to supplement our ticket prices.\n\nSo, you know, for us, pun intended, it's full steam ahead.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nOK. Thank you. Then one or two more questions here quickly. Can you just give us an update on what the booked direct brands have been, you know, the most recent quarter versus, say, the comparable quarter in 2019 versus booking through a travel agency? What are you seeing there? Thank you.\n\nJosh Weinstein\n\nYou know, what we've been saying all along is that the direct business held up relatively well throughout the pandemic, and the trade had to build itself back up. And we've been trying to support them to do just that. And the great thing is, as we've referenced in some of the other questions, the trade has been doing great lately. They're excited about our advertising as we are because it helps them, too, and they've really started to push on the volumes.\n\nAnd so, we couldn't be happier with how they're progressing.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nOK. And then just lastly, if I caught it correctly, you talked about 15% reduction in fuel per ALBD next year. I think the previous number had been 10%. How much is that being driven by the reduction in sounds like some of the older legacy fleet and what else may be driving that? Thank you and that's it.\n\nDavid Bernstein -- Chief Financial Officer\n\nYeah. So, it's -- the combination of the removal of the smaller, less efficient ships with the new ships that we delivered make up 9% of the 15%. And then the other six has to do with all of the itinerary optimization, as well as the investment in fuel reduction technology, things like the air lubrication system, which I mentioned in my notes and was also in the press release.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nOK. Thank you. That's it for me.\n\nJosh Weinstein\n\nThanks. I think we got, Chris, time for one more, one more question.\n\nOperator\n\nCertainly. Our final question will be from the line of Vince Ciepiel with Cleveland Research Company. Please go ahead.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nThanks. Just real quickly here, I wanted to get your kind of big-picture perspective on the path for margins potentially for the business. And it sounds like there are some real fuel efficiencies to be had in the consumption side. Obviously, you're dealing with higher fuel prices, but also, you know, your operating cost outlook was pretty strong.\n\nAnd then when you layer in your view for a return to historical occupancy, coupled with, you know, pretty decent price position for '23. But when you put all that together, you know, as I don't know, maybe you're even exiting '23, going into '24, do you foresee margins getting back close to historical levels, ahead of historical levels? Kind of what are you targeting kind of over the long run?\n\nJosh Weinstein\n\nWell, because we're not giving guidance, I think the best I can tell you is how we're thinking about that EBITDA on a per-unit basis. And when you get rid of the noise from currency and the fuel prices, operationally, what we're really trying to do is it exceed 2019 levels by the time we get to the end of the year. And that's where we're focused. As far as the longer term, you know, maybe we can have more of a conversation in that in March when we're going to be talking more fulsome, wholly about our full year guidance.\n\nDavid Bernstein -- Chief Financial Officer\n\nBut it's fair to say, there's a lot of potential relating to the revenue with all of the advertising that we're doing, which should bode well for the return on invested capital, which we expect to increase considerably over time as we move through the next year or two.\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nGreat. Thanks.\n\nJosh Weinstein\n\nThank you. So, to everybody on the call, thank you very much for joining us, and happy holidays. And I'd encourage you to go to our website for our presentation materials and some supplemental schedules. Thank you all very much.\n\nDuration: 0 minutes\n\nJosh Weinstein\n\nDavid Bernstein -- Chief Financial Officer\n\nSteve Wieczynski -- Stifel Financial Corp. -- Analyst\n\nRobin Farley -- UBS -- Analyst\n\nFred Wightman -- Wolfe Research -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nJaime Katz -- Morningstar -- Analyst\n\nBrandt Montour -- Barclays -- Analyst\n\nJames Hardiman -- Citi -- Analyst\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nVince Ciepiel -- Cleveland Research Company -- Analyst\n\nMore CCL analysis\n\nAll earnings call transcripts"
}