{
  "companyName": "TaskUs, Inc.",
  "companyTicker": "TASK",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/taskus-inc-task-q2-2022-earnings-call-transcript/",
  "content": "TaskUs, Inc. (TASK)\nQ2 2022 Earnings Call\nAug 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings. Welcome to the TaskUs Inc. Q2 2022 earnings call. [Operator instructions] Please note, this conference is being recorded.\n\nI will now turn the conference over to your host, Alan Katz, vice president of investor relations. You may be begin.\n\nAlan Katz -- Vice President, Investor Relations\n\nGood afternoon, and thank you for joining the TaskUs second quarter 2022 earnings call. Joining me on the call today are Bryce Maddock, our co-founder and chief executive officer; and Balaji Sekar, our chief financial officer. Full details of our results and additional management commentary are available in our earnings release, which can be found on the investor relations section of the website at ir.TaskUs.com. We have also posted supplemental information on this website, including an investor presentation and an Excel-based metric file.\n\nPlease note that this call is being simultaneously webcast on the IR section of our website. Before we start, I would like to remind you that the following discussion contains forward-looking statements within the meaning of the Federal Securities Laws, including, but not limited to, statements regarding our future financial results and management's expectations and plans for the business. These statements are neither promises nor guarantees that involve risks and uncertainties that may cause actual results to differ materially from those discussed here. You should not place undue reliance on any forward-looking statements.\n\nFactors that could cause actual results to differ from those forward-looking statements can be found in our annual report on Form 10-K, which was filed with the SEC on March 9, 2022. This filing is accessible on the SEC's website and on our website at ir.TaskUs.com and may be supplemented with subsequent periodic reports we file with the SEC. Any forward-looking statements made on today's conference call, including responses to questions, are based on current expectations as of today, and TaskUs assumes no obligation to update or revise them, whether as a result of new developments or otherwise, except as required by law. The following discussion contains non-GAAP financial measures.\n\nFor a reconciliation of each of these non-GAAP financial measures to the most directly comparable GAAP metrics, please see our earnings press release, which is available in the IR section of our website. Now I will turn it over to Bryce Maddock, co-founder and chief executive officer of TaskUs. Bryce.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nThank you, Alan. Good afternoon, everyone. And thank you for joining us. We delivered another strong quarter in Q2 with revenue and adjusted EBITDA coming in above the top end of our guidance ranges.\n\nQ2 revenue grew by 36.9% year on year to $246.5 million above the top end of our guidance range of $243.5 million. Adjusted EBITDA grew 26.2% year on year to $55.7 million for an adjusted EBITDA margin of 22.6%, just above our guidance of 22.5%. I'm also proud to report that this quarter Everest Group named TaskUs the fastest-growing business process service provider in the world. While we delivered strong results, we are seeing the impact of our clients shifting their focus from growth to cost optimization.\n\nIn the search for immediate savings, some of our clients have cut vendor spend. Since our last call, this trend is accelerated, particularly among our clients in the crypto currency and equity trading spaces. Given these trends, we have lowered guidance for the remainder of the year. I want to be clear in the face of these significant challenges, we are still positioned to deliver industry leading profitable growth.\n\nThis is because our teams continue to execute strongly on our five growth levers. Our clients focus on cost presents a major opportunity is they are increasingly turning to us to help optimize their spend by leveraging our offshore teams. I will review how we performed in Q2, and then return to our updated outlook for the remainder of the year, and our strategy to continue to grow faster than the industry. In Q2, we executed well across our first two growth levers expansion with our current high growth clients and adding new clients across verticals as we delivered signings from both new and existing clients.\n\nStarting with our growth with current clients in Q2, our top 20 clients increase their spend year over year by almost 30%. While revenue from clients outside of the top 20 grew up more than 60%, our largest client group 12% compared to Q2 of 2021. As expected, this growth rate is lower than prior quarters, driven by the impact of their transition offshore beginning to flow through this quarter. We have made great progress reducing client revenue concentration, and improving the diversity and resilience of our client base.\n\nLooking at our service offerings, digital customer experience revenue grew 47.4% compared with Q2 of 2021 as a result of expansion with existing clients and new client signings. Demand for DCX services has been particularly strong in gaming, travel and transportation and among challenger banks and remittance apps in the fintech space. We signed a digital customer experience expansion with a personal wellness brands to expand from one geography to three. We expect to add an additional 400 teammates to Latin America and the Philippines to support this client.\n\nWe expanded our European language support work in Greece for one of the world's largest e-commerce marketplaces. We are now delivering services from three different countries for this claim, will provide multilingual customer support, tech support and sales through various channels. In a quest for cost savings, our clients have begun to shift work they were previously doing in-house to our offshore teams. One of our clients, a large gaming company, where we provide player support in multiple languages shifted a large portion of their European language DCX work to our team in Greece, and some of their Tier 3 support work to our teams in the Philippines.\n\nFinally, we signed another digital transformation contract with a large travel client. This client actively sought us out given our experience in the travel and transportation space. We have launched a center of excellence for them in Texas, where we will provide them with a few hundred travel advisors in the coming months. Going forward we believe we will see demand for onshore operations from enterprise clients.\n\nMoving on to content security, revenues in this service offering grew by 7.8% compared with Q2 of 2021, driven by volume growth with existing clients and new client signings. We saw particularly strong signings growth this past quarter for content security work out of Malaysia, where we signed an expansion with one of the world's largest audio streaming platforms. We also signed a risk and response deal in Malaysia for a new client in the peer-to-peer payment space. We have been providing this client with know your customer and fraud investigation support.\n\nTwo of our challenger bank clients also asked us to take on complex processes previously done by their in-house teams. Here our risk and response organization will be delivering any money laundering and know your customer services, while significantly reducing our client spend on new services. Finally, we began working with one of the world's most popular gaming communication platforms. Given early success, we have already expanded the scope of trust and safety support that we will be providing this platform.\n\nWe have see an enormous growth opportunity ahead at this client. At our largest client, we completed the transition of hundreds of roles offshore at the end of May, given the timing of this transition and the offsetting ramp of additional roles, we expect Q3 to be the lowest revenue quarter for our content security service offering this year. We expect to return content security to growth in 2023. Our relationship with our largest client remains very strong.\n\nWe are in the process of scaling over a thousand new roles in our offshore delivery environments for them. Given the reduction to our onshore teams, this client's revenues in the back half of the year will be down slightly when compared to the first half. But we now expect to earn more from this client in 2022 than we did in 2021. We also expect to continue modest annual revenue growth with this client in 2023.\n\nAI service revenues grew 39.4% in Q2 compared with 2021. This growth was driven primarily by expansions with existing clients in the social media, travel and autonomous vehicle spaces, offset by the transition of work with our largest client. We signed several exciting projects for the TaskVerse our gig-worker platform, this included multiple projects with two big tech firms. One of which is a first-time TaskUs client.\n\nWe also signed a TaskVerse agreement with another one of our top 10 clients in the e-commerce space. TaskVerse.com is seeing strong initial demand for our data labeling and AI support services. In response, we are investing in sales and marketing to fuel its growth. Overall, our signings were, again, driven largely by growth from existing clients, which accounted for approximately 75% of our total new business signings in Q2.\n\nLooking at revenue growth within our industry verticals, we are seeing particular strength from our HealthTech entertainment and gaming, and non-crypto fintech clients. All of which grew revenue over 50% year on year in Q2. As economies around the world have reopened and business travel has resumed, we are also seeing a pickup in demand for our on-demand travel and transportation business. Revenue in this vertical grew by over 40% year on year.\n\nThis includes astounding growth at our largest ride sharing client where we more than tripled our revenue compared to Q2 of 2021 as we took significant share from our competitors. As I mentioned earlier, several enterprise travel companies have now turned to us to support their digital transformations. We are also seeing exciting opportunities in the autonomous vehicle space, where we have seen traction for both our AI services and learning experience solutions. The HiTech vertical also continues to be a major area of focus.\n\nLast quarter I discussed opportunities we were pursuing with some of the biggest tech companies. I'm proud to report that we have since signed deals with three big tech firms. Here, we are focused on delivering the operational excellence TaskUs is known for to earn the opportunity to expand. While we don't expect significant revenues from these clients this year, they have the potential to contribute meaningful growth over the next few years.\n\nMoving on to our third growth lever. We also showed continued progress, expanding our specialized services. As I mentioned, we closed multiple AI services deals on the TaskVerse, and several risk and response engagements this quarter. We also expanded our engagement with our largest learning experience services client, we are now servicing this client from three locations, providing training services to their global teams.\n\nAs clients are shifting their focus to cost, we are beginning to see opportunities to bring other service offerings to the market. Our learning experience solution is a great example of our client's willingness to look at certain in-house functions or processes that may have not been a candidate for outsourcing in the past. We are seeing good progress with our fourth growth lever, adding additional geographies, with Malaysia and Europe performing particularly well this quarter. Since launching Malaysia at the start of the year, we have signed for clients, including geographic expansions with three of our existing global client relationships.\n\nWe have also had strong sales performance out of Greece, where a headcount grew by more than 50% from Q1 to Q2 of this year. Finally, our acquisition of heloo has opened up Central and Eastern Europe as a delivery hub for our clients. This gives us a lower cost footprint for a European language support work. This brings me to our fifth growth driver M&A, we closed our first acquisition in April.\n\nAnd over the past three months, we have made great progress integrating the heloo team into TaskUs, heloo is performing ahead of plan, and we are starting to see opportunities for our sales teams to sell alongside one another. Given the current market dynamics, we are very excited about using M&A to consolidate our market over the medium term. However, we have not yet seen private market valuations aligned with the current public market reality. We remain disciplined and focused on accretive acquisitions.\n\nAnd we have the balance sheet and operating capacity to move quickly and take advantage of these opportunities. Turning to our teammates and the environment for talent. At the end of Q2, total headcount was 45,300 down by about 500 teammates compared with the end of last quarter. This was driven by our clients focus on cost reduction by reducing team sizes, primarily in our U.S.\n\noperations and among our crypto currency clients. We also moved to eliminate certain corporate roles in response to our updated revenue guidance. The environment for talent continues to be competitive. We have seen attrition increase this quarter compared to both last year and Q1.\n\nThe primary driver of this increase in attrition has been returning teammates to the office. We now have approximately 40% of our teammates working safely from TaskUs offices around the globe, up from 20% last quarter, whether working from home or in our offices, we continue to deliver classes on time and meet our clients' needs. We are working aggressively to reduce attrition, and I'm happy to say that our initial investments appear to be paying off as attrition in July was lower than in Q2. Our glass door rating also remains among the highest in the space at 4.5 stars as at the end of the quarter.\n\nNow let's move on to our outlook for the remainder of the year. While we have performed well in the first half of the year, the current macro environment is impacting many of our clients. As a result, we revise our outlook for 2022 and now expect to grow at 23.6% at the midpoint of our guidance. This change in outlook was primarily driven by two factors.\n\nFirst, our clients in the crypto and equity trading spaces have reduced volume faster and deeper than we expected as of our first quarter call. To put this in context, crypto and equity trading clients as a group accounted for over 15% of our revenues in Q1. We now expect that there will be approximately 5% of our revenues in the fourth quarter. While some of this impact was baked into our outlook, provided on the Q1 call, we have since seen incremental volume reductions.\n\nSecond, we are seeing other high growth tech clients look for immediate savings in response to market uncertainty. Here, our clients have focused on our U.S. based resources. Some of these clients are leveraging our offshore model and others are reducing vendor spend across the board.\n\nWhile the increased focus on cost creates meaningful opportunities with both new and existing clients over the coming quarters, it also puts immediate pressure on revenues. In response to these updates, we have not only taken steps to reduce our corporate spend, but have also frozen hiring for most non-revenue generating roles. We will continue to invest in our technology and go to market teams as these investments will drive our growth in 2023 and beyond. In terms of margins, we now expect that our adjusted EBITDA margin for the full year will be approximately 22.3% or $210 million at the midpoint of our guidance range.\n\nWe also expect to generate approximately $100 million of free cash flow this year. TaskUs is a highly cash-generated business and our discipline approach to capital allocation will continue to support our growth. As we look to 2023 and beyond, we remain confident in our ability to grow faster than the rest of the industry. TaskUs has been the fastest-growing business process service company since we were founded in 2008, because we are the preferred provider of high growth tech disruptors.\n\nWhile it is a volatile time for tech firms, our view is that these companies will continue to outgrow the market over the long run. More immediately, we have a strong pipeline of opportunities to help these clients reduce their operating expenditures by shifting functions that they are currently doing in-house to our offshore delivery locations. Finally, we are expanding our addressable market by working with enterprise clients on their digital transformations and closing deals with big tech. This quarter, we have signed pilots with three big tech firms.\n\nThese are companies that spend billions of dollars a year on outsource services. As we have done in the past, we expect to earn the opportunity to scale with these clients through the strength of our execution. With that, I will hand it over to Balaji to go through our Q2 financial results and provide more details on our guidance.\n\nBalaji Sekar -- Chief Financial Officer\n\nThanks Bryce, and good afternoon, everyone. I'm going to discuss about financial results for the second quarter of 2022. Please note that some of these items are non-GAAP measures and the relevant reconciliations are attached to the press release we issued earlier today. In the second quarter, we earned total revenues of $246.5 million and increase of 36.9% over the prior year.\n\nWe saw growth in each of our three specialized service offerings. In the second quarter, our digital customer experience offering generated $167.4 million for a year-over-year growth rate of 47.4%. Our content security business grew 7.8% versus Q2 of 2021, resulting in $46.3 million of revenue. And our AI services business grew 39.4% year over year for revenues of $32.7 million.\n\nIn Q2, we saw continued diversification of our revenue, as growth from our top-line was executed by the ongoing expansion of the rest of our timeframe. As a result, our revenue concentration with our largest client was approximately 22%, down from 24% in Q1 and 27% in Q2 of 2021. Our second-largest client was 9% of our revenue, down from approximately 10% in Q1 and well person in Q2 of 2021. Our top 10 and top 20 clients accounted for 58% and 73%, down from 61% and 75% in Q1 of this year, and down from 63% and 77% as of Q2 of 2021.\n\nIn the second quarter, we generated 51% of our revenues in the Philippines, 30% of our revenues in the United States, and 90% of our revenue from the rest of the world, mainly driven by our patients in India, Europe and Latin America. As Bryce discussed, we have see the pickup in signings for services to be delivered out of our Malaysia and brief locations. We expect to see our revenue concentration generally shift toward our offshore geographies for the remainder of the year. As a reminder, our margin is driven in large part by our geographic mix.\n\nOur cost of service as a percentage of revenues is lower in offshore locations, which positions us well for margin expansion over time. Our cost of service as a percentage of revenue was 58.2% in the second quarter, compared to 57.7% in Q2 of the prior year. The increase was primarily driven by ongoing expenses associated with our return to the office and costs associated with the transition of work from onshore to offshore locations. While you have seen wage inflation across geographies this year, the majority of this impact was offset by the currency benefit of the strong U.S.\n\ndollar and price increases from COLA provision in our contracts. In the second quarter, our SG&A expenses were $68.9 million, or 28% of revenue. This compares to SG&A in Q2 2021 of $177.8 million, or 98.8% of revenue, which include a onetime phantom share borders, and non recurring teammate bonuses associated with the IPO of $133.7 million. Stock compensation expenses in the quarter were $18.1 million relating to equity grants, compared with $5.7 million in Q2 of 2021.\n\nGiven the timing of the IPO in Q2 of last year, we have only had the impact of a partial quarter of stock compensation and public company expenses during that quarter. In the second quarter of 2022, we earned adjusted a bit of $55.7 million and a 22.6% margin, compared to $44.1 million and a 24.5% margin earned in the second quarter of 2021. The reduction in our adjusted EBITDA margin was primarily driven by ongoing cost associated with our return to office and the full quarter of public company costs. We expected adjusted EBITDA to be impacted by the slower revenue growth for the balance of this year.\n\nWe will also continue to invest to drive growth, which will partially be offset by our G&A cost optimization initiative and our higher margins offshore due to the mix change. Adjusted net income for the quarter was $38.7 million and adjusted earnings per share was $0.38 by comparison in the year-ago period. We earned adjusted net income of $31.4 million and adjusted EPS of $0.32. Now moving on to the balance sheet.\n\nCash and cash equivalence were $104.7 million as of June 30, 2022, compared with the March 31, 2022 balance of $77.1 million. Cash generated from operations was $36.1 million for the second quarter of 2022, as compared to cash generation of $5.8 million in Q2 of 2021. Our DSO was 66 days in the current quarter. Our capital expenditure decreased in the second quarter of 2022 to $11.6 million, compared to $13.3 million in Q2 of 2021.\n\nThe decrease was primarily driven by teammate-related equipment purchases in Q2 of 2021, which was lower this year. Free cash flow was $24.5 million or 44% of adjusted EBITDA. As Bryce discussed, we have always been a business that prioritizes free cash flow. And we continue to see this as an area of focus going forward.\n\nIn terms of our financial outlook for the remainder of the year, we have updated our guidance as follows. We now anticipate full year 2022 total revenues to be in range of $930 million to $950 million representing year-over-year growth rate of 23.6% at the midpoint. In addition, we expect to earn a full year 2022 adjusted EBITDA down margin of approximately 22.3%. Lastly, we have added free cash flow, which we define as cash flow from operations less capex as an annual guidance metric this quarter.\n\nWe expect over 2022 full year free cash flow to be approximately a $100 million. For the third quarter of 2022 we anticipate revenues to be in the range of $224 million to $226 million representing year-over-year growth rate of approximately 12% at the midpoint. And we expect to earn a Q3 2022 adjusted EBITDA margin of approximately 22%. Our outlook implies that we will exist 2022 flat to low-single-digit top-line growth.\n\nWhile we are providing guidance for 2023 on this call, we recognize that we will face challenging revenue comps in the first half of next year. We are confident that our growth rate will increase throughout the course of 2023, driven by the opportunities that Bryce outlined. I will now hand it back to Bryce before we take your questions.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nThank you Balaji. Before we get to Q&A, I want to share another TaskUs teammate story. This time for Jimenez one of our teammates in Colombia. Jimenez moved to Colombia from Venezuela in 2020, as a result of the economic situation in her home country.\n\nThis woman who trained as an engineer in Venezuela suddenly found herself unemployed in a new city. She began looking for opportunities in the BPO industry, hoping that she could apply her leadership skills to a new role. But she heard time and time again that while her background was impressive, her English was not yet strong enough for a customer service position. After some research, she set her sights on landing a role at TaskUs, because of our culture, and unique benefits.\n\nShe applied to TaskUs in January, and our recruitment team instantly saw her potential. We invited her to join our art of fluency program, and English language training program that we developed to rapidly improve English proficiency for customer support. Within a few months, she was hired as a teammate Jimenez has grown quickly at TaskUs. She supports one of our challenger bank clients and is delivering top quartile customer satisfaction scores.\n\nIn less than a year Jimenez has gone from being an unemployed refugee with limited English proficiency to a top performing teammate supporting a global fintech firm. It is these stories that inspires us. Our investment in our people continues to deliver for our teammates, and our clients. And the art of fluency program is an amazing example of thus.\n\nWith that, I will ask the operator to open the line for our question and answer session. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from the line of Dave Koning with Baird. Please proceed with your question.\n\nDave Koning -- Baird -- Analyst\n\nYeah, hey, guys. Nice job on the second quarter, and thanks for all the guidance on the back half. Maybe they kind of kick it off just, if we look at the back half and kind of compare it to even last year. If you would exclude crypto and maybe anything else, maybe talk through a little more on whether it is crypto and one or two other things maybe would the back half actually be quite good growth.\n\nAnd then, the second from that is Q4 really the base now when-you know, we kind of numbers from Q4 to just kind of grow more normalized sequentially going forward. I will leave it there let you kind of talk through some of those?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah, I will jump in here, Dave. Thanks so much for the question. So obviously, since our last call, we have seen our clients shift their focus to cost reduction. Some of them have done this by moving some of the work we are doing onshore to our offshore teams and others have done this by simply reducing vendor spend looking for immediate savings.\n\nAcross our entire client base, this has been most acute among our crypto and equity trading clients. So I want to make a few points about what we are seeing happen in the crypto and equity trading space. TaskUs has a low double-digit number of clients whose products feature a crypto or equity trading feature. These could be businesses that are entirely dedicated to trading equities or crypto or they could be a broader financial platform that offer crypto or equity trading as part of their offering.\n\nThese clients made up 15% in fact, over 15% of our revenues in Q1, and we now expect that they will be 5% of our revenues in Q4. With that said, we have not lost a single client in this space. We remain the preferred provider of high growth tech companies, including those in the crypto and equity trading spaces. Despite these challenges, we remain confident in our growth trajectory, as we continue to have very, very strong relationships with all of our clients and in particular our largest clients.\n\nSo we previously discussed that at our largest client, we have been shifting a large portion of the work we are doing there from higher revenue onshore locations to lower revenue offshore locations, which is a transition that we completed in Q2, but we have seen very strong over volume growth with this client. We are adding over a thousand additional roles for them in the back half of this year. Given this headcount growth and our current pipeline of opportunities we would expect that we will grow revenues with our largest client year on year in both 2022 and 2023 and hopefully, beyond that as well. We also have seen continued growth at our largest on demand transportation and food delivery clients.\n\nOn the call I mentioned that our revenues with our largest on demand transportation client has more than tripled year over year in Q2. We are taking significant share from our competitors and are now supporting this client from four different countries. Finally, we just signed pilots with three big tech companies that we believe have the potential to contribute meaningfully to our growth in 2023 and beyond. So strategically, we remain focused on supporting technology companies and this is a space that is clearly experiencing some volatility today, but we believe it is going to outgrow the market over the long term.\n\nFor now, we have shifted our focus from selling onshore teams to selling offshore teams, to increasingly selling our automation solutions to help these clients reduce their costs. We have also expanded our addressable market by pursuing digital transformation deals with enterprise clients and signing the big tech deals that I just mentioned. So while we have encountered some significant challenges in the first half of the year, we do feel like our base has been reset and we are very optimistic about our ability to continue to grow faster than the industry.\n\nDave Koning -- Baird -- Analyst\n\nGot you. Thanks for all that color. And maybe just a quick follow-up. When we look at 2023, and I know you haven't given any sort of formal guidance, but it is fair to say the first half has a pretty tough comp and we could expect you to grow slower than normal, just cause of that.\n\nAnd then, the 22% margin in the back half. Is that a good place to kind of think about next year there any puts and takes that would change that?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nBalaji, do you want to take that question?\n\nBalaji Sekar -- Chief Financial Officer\n\nYeah, thanks, Dave. So from a EBITDA for 2023 perspective, like Bryce mentioned, we will see our growth rates improve in the back half of 2023, I would expect to see-begin to see margin expand. And we would also start seeing the positive impact of offshoring getting into 2023. And like I said earlier, we will continue to monitor G&A spend, while continue to invest in growth.\n\nHence, we expect that adjusted EBITDA margin to be about 2022 margins getting into 2023.\n\nDave Koning -- Baird -- Analyst\n\nGot you. Now thanks guys. Thanks for all the color.\n\nOperator\n\nOur next question comes from the line of Puneet Jain with J.P. Morgan. Please proceed with your question.\n\nPuneet Jain -- J.P. Morgan -- Analyst\n\nHey, thanks for taking my question. I want to ask about the three last tech companies, the new contracts you signed there. Can you talk about the type of work you do for some of those clients and also the potential opportunity can any one of those potentially be your 10% client overtime? And should we expect that work to be relatively more stable than the work you do for small medium sized clients given possibly the volume there at those accounts?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nPuneet, thanks so much for the question. So we are very excited to have closed these deals. These are clients that we have pursued for many years, and this opens up a huge area of addressable spend and outsourcing budgets that run into the billions of dollars. So the best way to think about the potential here is to look back at our relationship with our largest client.\n\nWith our largest client, we initially signed a very small deal. In fact, in our first year, I think we did about a million dollars in revenue, but we worked really hard and we proved our value and we started to win RFP after RFP. So we grew in the second year to $50 million in revenue and have continued working together. And to-date, we have over $200 million from that client.\n\nSo we are optimistic about the potential with all three of these clients. It is going to take a lot of hard work. We want to continue to diversify our revenue base. And when we think about smaller clients versus larger clients, we always want to keep a healthy mix of both, but the revenue growth that we are trying to drive into 2023, 2024 and beyond will be greatly helped by upside at these big tech clients.\n\nPuneet Jain -- J.P. Morgan -- Analyst\n\nNo, I appreciate the color. And then, another question on the guidance cut for this year. So it looks like you have assumed significant reductions at the crypto and equity trading clients, but what drives confidence that the other accounts have been de-risked enough in that guidance and should not be a source of incremental surprise given the macro environment is still uncertain?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah, so we are taking a very cautious approach to our outlook for the remainder of 2023. Given the macro environment-sorry, the outlook for the remainder of 2022, given the macro environment. We have a very robust forecasting process that goes client-by-client and looks at the conversations we are having with those clients and committed volumes. We have listened intently to the earnings calls of all of our public clients.\n\nAnd we are hearing quite a lot of optimism. Amongst our largest clients, clients in the social media, ride sharing and food delivery space, we continue to have very strong relationships and very strong growth trajectories. And so, that is where we drive our confidence for the guidance that we are providing today.\n\nPuneet Jain -- J.P. Morgan -- Analyst\n\nGot you. Thank you.\n\nOperator\n\nOur next question comes from the line of Maggie Nolan with William Blair. Please proceed with your question.\n\nMaggie Nolan -- William Blair -- Analyst\n\nThank you. Maybe to ask that question in a slightly different way, can you expand a little bit on the nature of work that you are doing for the equity trading and crypto clients that was particularly sensitive to those client budget cuts? And then, if that work pervasive in any of your other segments, as we think about how a weaker macro could affect other segments from here?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah, the in the fintech space, across fintech clients, we provide two primary areas of service. We provide digital customer experience services. So that is supporting their customers answering their questions, solving account issues. We also provide a significant amount of risk and response services, this could be any money laundering, know your customer, fraud investigations work.\n\nBoth of those service lines were impacted by overall trading reductions. So trading volumes came down, contacts and investigation demand came down, and given the just broader pressure in the space, there has also been an increased focus on opex in order to get to profitability. When we look across the rest of our verticals, we offer a range of specialized services that we have discussed digital customer experience is our biggest service line. We have not seen anywhere near the same volume impact across any other vertical than we have seen in the fintech vertical, as it relates to crypto and equity trading clients over the course of the last quarter.\n\nMaggie Nolan -- William Blair -- Analyst\n\nThat is helpful, thank you. And then, as we think about, you know, your ability to service offshore or onshore, can you comment a little bit on where you are seeing demand currently? It seems like some of the new signings may have an onshore component off that. Is that still the preferred way to start engagements or are you starting to see more clients willing to embrace offshore from the get go?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nBroadly, we have seen a uptick an interest in our offshore delivery locations. We have seen clients who have a presence in our onshore locations, ask us about supplementing their teams with offshore locations to help bring down costs. We have also seen a lot more interest in our new logo clients in our offshore offerings. I think, this is to be expected given the macro environment, people are looking for ways to operate more efficiently, but that doesn't mean that we are not seeing any new clients in our domestic operations.\n\nAs I mentioned, we signed a brand new travel client who turned to TaskUs to build a center of excellence in Texas. We are going to be hiring hundreds of teammates to support that client between now and the back half of the year. We have also signed multiple smaller deals in the last quarter in our U.S. operations.\n\nSo while overall we have seen a decline in our U.S. operations in Q2, we do see continued interest from some of our new logos.\n\nMaggie Nolan -- William Blair -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Ryan Potter with Citi. Please proceed with your question.\n\nRyan Potter -- Citi -- Analyst\n\nHey, thanks for taking my question. Just wanted to continue on that topic. I know you mentioned you signed a travel client and you have seen some increased interest from traditional enterprise clients. So I was wondering how you go about kind of assessing those in-bounds? Are you trying to only work with kind of the highest growth, highest margin opportunities that come in? And to what extent could some, this kind of traditional enterprise interest be used to offset some of the client specific pressures you are seeing in areas like fintech.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nThanks, Ryan. So we had some concerns after our last call and our discussion about the digital transformation deal that we find with an airline. I think, some people thought that was a sign that we were returning to traditional call center work. It is not.\n\nWe are working with these clients on their digital transformations. Most of these deals are being done at margins that are actually accretive to the rest of our business. So broadly, we are really excited about the enterprise deals that we have closed. We think that there is massive upside as we expand our addressable market and see an increased interest from clients in this space.\n\nAnd as I mentioned on the call, we are finding that most of the interest for our domestic delivery capability today is coming from enterprise clients. So we think that it has-these clients have the ability to drive a disproportionate amount of our revenue growth in the quarters to come.\n\nRyan Potter -- Citi -- Analyst\n\nGot it. And then, one question on your AI services offering, with your TaskVerse platform launching last quarter, I was just wondering if you could give some color on the kind of adoption you have seen on it so far, and how you are kind of going about to attract freelancers to the platform, could M&A be used potentially the help scale its offering and broadly kind of how do you view kind of growth there?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah, so it is, obviously, early days for us, and the TaskVerse, but we have seen great interest in this product from our clients. There aren't a ton of scaled offerings that can do crowd sourced, data labelling and AI services. And there is huge appetite among our innovative clients for disruptors in this space. As I said on the call, we have signed a few really exciting deals, two big tech clients, one of which is brand new to TaskUs.\n\nOne of our top 10 clients in the e-commerce space has also become a user of the TaskVerse platform. So there is huge upside here. And we are starting from zero. So there is-the sky is kind of a limit.\n\nWhen I think about freelancer on-boarding, we are trying to be the best platform for freelancers and the way that we feel we are the best company in the BPO space for our teammates. We have actively recruited freelancers from all over the world. We are working hard to ensure that they are paid promptly, and that they have a healthy flow of tasks to do to keep them busy. So we are really excited a about that as well.\n\nWe are very interested in continuing to pursue M&A across all of our specialized service lines. And we do think that buying other businesses in this space could be a way to supplement not only the crowd that we are building, but also the underlying platform.\n\nRyan Potter -- Citi -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nOur next question comes from the line of Jason Kupferberg with Bank of America. Please proceed with your question.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys, this is Casey, on for Jason. I wanted to ask what is baked into the low end of your full year revenue outlook. So is it that additional client for going to shift offshore? Is it that crypto and equity revenue and volumes like declined significantly further? I know you talked about that like 5%, attrition continues to worsen and therefore headcount growth kind of contracts in the second half. And then, specifically kind of wanted to ask what you guys are baking in or assuming for volumes specifically from ride sharing and food delivery? Thanks.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nThanks so much, Casey. So we have updated our guidance and taken into consideration a range of scenarios. Given the visibility that we have got into Q3 revenues and the confirmed growth for many of our largest clients, we are very confident in our ability to deliver upon the guidance that we are providing today. When we look out into 2023 and beyond, we are very confident in the underlying fundamentals of our clients.\n\nThere is some volatility in the crypto and equity trading spaces in particular, but we have listened to the calls of many of our clients in the on-demand transportation, food delivery, and social media spaces. And those give us optimism that we are going to continue to see a healthy level of growth across all customers. Beyond that, we continue to take share within most of our largest client relationships. So at this stage, those are the things that are giving us a high degree of confidence about our ability to continue to grow faster than the industry in 2023 and beyond.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nOK. And I guess, switching gears a little bit, so I see that your free cash flow, if my math is right, I think you guys actually raised it, so it is maybe 45%, 50% of adjusted EBITDA for 2022 versus I think it was 30% to 40% of a conversion rate prior, if I remember that correctly. Could you just talk a little bit more about like, what are the key drivers of this and kind of what kind of cadence we should expect in 3Q 4Q? And is this kind of the sustainable level we should expect in 2023? Thanks.\n\nBalaji Sekar -- Chief Financial Officer\n\nYeah, so hey, Casey, this is Balaji. So from a free cash flow perspective, like I mentioned before, it has always been important to us, but in the current market environment, it is even more important. We have added free cash flow as an annual guidance metric now, which for 2022, like you said, it is $100 million and almost 50% from a free cash flow conversion to adjusted EBITDA. And the couple of factors that are going be increasing, it is, obviously, going to be the adjusted a margin.\n\nAnd second is the capex that we are going to be investing. And one of the things that we have called out is that this year we are going to be investing more in capex than other years, because we have to catch up capex, which is coming in from previous years. And we expect capex to be somewhere around 7.3% to 7.5% as a percentage of revenues, but on an ongoing basis at least in the medium term, we expect the conversion to be somewhere between 40% to 50% in the medium term. But in the long term, as we start optimizing capex through increasing work from home, and we actually continue to grow offshore, one of the things that we have seen is that the seat utilization is better in offshore geographies.\n\nSo from a long-term perspective, we would expect this conversion to be above 50% of adjusted EBITDA margins.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from the line of James Faucette with Morgan Stanley. Please proceed with your questions.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThanks. I'm a little surprised we have made it this far through the call without the macro question, but just wondering if you are seeing any changes to decision making or decision cycles particularly because of macro uncertainty right now, more so than what you are hearing from your customer say to the public.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nJames, thanks so much for the questions. So our pipeline right now is as big as it has ever been, and it is filled with opportunities to support both our current clients and prospects to help reduce their operating expenditures, but the macro environment has slowed deal velocity somewhat. In the last quarter, there were two very large deals that were at the one yard line. And both of these companies launched internal hiring freezes.\n\nAnd then, went on to put our deal on hold. We are very confident that these deals will get done. I mean, we believe very strongly in the underlying value proposition of helping these companies to reduce opex in the midst of more challenging macro environment. But obviously, that has a direct impact on revenue this year.\n\nSo I think, we probably will continue to see some hesitation particularly in some of these larger deals in the high growth tech space. But over time we think that there will be a broader based adoption of outsourcing as a way to reduce cost.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThanks for that, Bryce. And then, I guess, as part of that same conversation, you and some of your peers have talked about vendor consolidation. Can you talk about what you are seeing in the current environment and how that is contemplated in your outlook? And as your customers are looking to control costs, if that is part of the conversation?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nIt is particularly among our larger clients. We have been the beneficiary of quite a bit of vendor consolidation over the last few quarters. I mentioned, our largest ride sharing client on the call, as just one example of that. So as we look ahead, we think there are going to be continued opportunities for us to take share from our competitors by offering a better value proposition helping our clients to reduce their costs, while delivering with the quality at task us is known for.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThanks for that, Bryce.\n\nOperator\n\nOur next question comes from the line of Matt VanVliet with BTIG. Please proceed with your question.\n\nMatt VanVliet -- BTIG -- Analyst\n\nGood afternoon, thanks for taking the question. I guess, thinking about some of the faster pace or maybe even very recently decided shift to offshoring from a number of your existing clients. Curious how we should think about this impacting revenue, not just for the rest of the year, but into 2023, especially framing it in the light of your largest customer who is, obviously, creating a headwind to growth this year, but was a much more planned out and you have already seen what sounds like upside to that initial plan as you move offshore and adding additional headcount and roles, is that something that you anticipate could happen in 2023 and beyond, as these customers move offshore or does this feel more of a reactionary reduced cost, and we will have to wait and assess into next year or even 2024? Thank you.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah. When we think about the impact on 2023, we know that we face challenging revenue comps in the first half of 2023, when compared to the first half of 2022. And that is because of exactly what you just said, the shift that our largest client, the reductions that we have seen to our U.S. business from crypto and equity trading clients.\n\nBut we remain very optimistic about our ability to continue to grow faster than the industry in 2023, given what we are seeing in the pipeline, given the deals that we have signed with big tech firms, given the interest from enterprise clients. So I think that, right now, the market is volatile, but that volatility should benefit us over time. Now I want to talk a little bit about the domestic operations more specifically at the start of this year, 33% of our revenues came from the U.S. And given the reductions we have seen in Q4, we will get derive about 20% of our revenues now from the U.S.\n\nA question that could follow from that is, well, what will happen in the remainder of that 20%? Over half of that revenue has to stay in our domestic business for regulatory reasons or strong client preferences. And we are continuing to see growth outside of that revenue in the form of the travel deal that we just signed for hundreds of additional roles in the U.S. and a number of other clients who have approached us about launching domestic operations. So while we are seeing reductions in our domestic business at the moment, we remain confident about the importance of our domestic operations to task us long term.\n\nMatt VanVliet -- BTIG -- Analyst\n\nOK. And then, I guess, looking at the AI services, this quarters, slight quarter-over-quarter decline after being very strong grower, the last several. Curious if that is specific to any of the industries you have called out, or are there particular projects that just sort of wind down and haven't necessarily been filled through the pipeline yet? How should we think about the AI services group for not only the rest of the year, but sort of overall demand understanding that the freelance and gig program maybe offset some of that?\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nYeah, so in the AI services area, we had a large portion of that work being done domestically with our largest client, given the transition, we have seen a slight sequential quarter-over-quarter decline, while continuing to grow AI services revenue at a pretty healthy rate year over year. Given the full quarter impact, we will see that again in Q3, but when we look at the total number of clients who are using our AI services, the total number of geographies that we are delivering these services from both of those things continue to grow quarter over quarter. So we remain very, very optimistic about it, the service line.\n\nMatt VanVliet -- BTIG -- Analyst\n\nAll right. Great. Thank you.\n\nOperator\n\nAnd our last question comes from the line of Brian Essex with Goldman Sachs. Please proceed with your question.\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nGreat. Thanks. Good afternoon, and thank you for taking the question. Bryce, I was wondering if you hit on-I totally understand the -- I guess, the reduced revenue from volume-driven business.\n\nBut if I look out over what we see in the private company space, particularly in technology, a lot of these emerging companies have been asked by their investors to reduce spend. So I guess, with regard to the topic of companies looking to reduce spend overall outside the volume-driven business, what do those conversations usually look like? And are there other ways that they are trimming again, outside of that buy-driven business.\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nThank you so much for the question Brian. So to start, 15 of our top 20 clients are public, it is an amazing transformation from just a few years ago when that number was almost inverse. So we have a very large client base that has already gone public and are large enterprises. But when we look at the long tail of our clients, we do have a tremendous number of high growth innovators and many of them are venture funded, and there we are seeing similar trends to what we have seen in our largest customers.\n\nThey are all being asked to find a way to get to profitability. And TaskUs is part of that solution. We have helped a number of our venture funded clients shift work that they were doing in-house to our offshore delivery locations, integrate our automation solutions into their operations as a means of reducing operating expenditures and achieving profitability. So it is a similar tale while there are some hesitation among new clients, we think that over time this situation will actually drive additional growth in that space.\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nGot it. That is helpful. Maybe to follow up to Balaji. If we think about, some of the fluctuations we have seen in FX, could you remind me are you billing a 100% percent in domestic currency? How much might be billed in local currencies outside of the U.S? And how do we think about the impact FX to the customer's ability to afford your solution, as well as maybe impact in margins to the extent that you are paying for labor in offshore locations.\n\nBalaji Sekar -- Chief Financial Officer\n\nYeah, hey, Brian, thanks for the question. So the majority of your revenues are with clients that pays in U.S. dollars, and are building U.S. dollars.\n\nThe small portion of revenues that would be built in Euros is coming through the recent acquisition that we made for with heloo. So the exposure is more in our cost that we incur outside of the U.S. in local currency. So with Philippines being our largest exposure and India being next.\n\nSo in terms of ForEx hedging, our approach has been to do a rolling four quarter hedging program that covers about 50% of our forecast and expenses in the Philippines. We are currently looking at a hedging-establishing a hedging program for India, as well, given the growth in the geography for the last two years. But the appreciation of the dollar, this is the Rupee and the Filipino Peso has been helpful this year, especially to offset some of the big inflation that we have seen in those geometries.\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nGot it. That is super helpful. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlan Katz -- Vice President, Investor Relations\n\nBryce Maddock -- Co-Founder and Chief Executive Officer\n\nBalaji Sekar -- Chief Financial Officer\n\nDave Koning -- Baird -- Analyst\n\nPuneet Jain -- J.P. Morgan -- Analyst\n\nMaggie Nolan -- William Blair -- Analyst\n\nRyan Potter -- Citi -- Analyst\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nMatt VanVliet -- BTIG -- Analyst\n\nBrian Essex -- Goldman Sachs -- Analyst\n\nMore TASK analysis\n\nAll earnings call transcripts"
}