{
  "companyName": "Marqeta, Inc.",
  "companyTicker": "MQ",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/marqeta-inc-mq-q3-2022-earnings-call-transcript/",
  "content": "Marqeta, Inc. (MQ 1.50%)\nQ3 2022 Earnings Call\nNov 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, thank you for standing by. Welcome to the Marqeta third quarter 2022 earnings conference call. As a reminder, this conference call is being recorded. I would now like to turn the conference over to Stacey Finerman, vice president of investor relations, to begin.\n\nPlease go ahead.\n\nStacey Finerman -- Vice President, Investor Relations\n\nThanks, operator. Before we begin, I would like to remind everyone that today's call may contain forward-looking statements. These forward-looking statements are subject to numerous risks and uncertainties, including those set forth in our filings with the SEC, which are available on our investor relations website, including our annual report on Form 10-K for the period ended December 31, 2021, and our subsequent periodic filings with the SEC. Actual results may differ materially from any forward-looking statements we make today.\n\nThese forward-looking statements speak only as of the time of this call, and the company does not assume any obligation or intent to update them, except as required by law. In addition, today's call includes non-GAAP financial measures. These measures should be considered as a supplement to and not a substitute for GAAP financial measures. Reconciliations to the most directly comparable GAAP measures can be found in today's earnings press release or earnings release supplemental materials, which are available on our investor relations website.\n\nHosting today's call are Jason Gardner, Marqeta's founder and CEO; and Mike Milotich, Marqeta's chief financial officer. With that, I'd like to turn the call over to Jason to begin.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nThank you, Stacey. Good afternoon, everyone, and thank you for joining us for Marqeta's third quarter of 2022 earnings call. I'll start with a brief overview of our results for the quarter. Total processing volume, or TPV, was $42 billion in the quarter, representing a 54% year-over-year increase, continuing the rate of growth we saw in the first half of this year.\n\nOur TPV for the first nine months of 2022 was $120 billion, exceeding our TPV for the entire 2021 fiscal year of $111 billion. Our net revenue of $192 million in the quarter represents a 46% increase from the previous year. Growth was strong across multiple verticals in both our Managed by and Powered by Marqeta customers, particularly in digital banking and expense management. Block accounted for 72.5% of our net revenue, up from 69% in the second quarter as the Cash App card continues to grow active users and drive engagement on the platform.\n\nSpecifically, the Cash App users that also have a Cash App card was 35% in the quarter, up from 31% at the end of the year; and a direct deposit inflows for $2 billion in September, up 65% year over year, which helps fuel card spending. These are both products that Marqeta provides to Cash App. As we look ahead at the many opportunities for Marqeta, the trend toward embedded finance is undoubtedly one of the biggest. According to Bain Capital, the value of embedded finance transactions is expected to reach $7 trillion by 2026.\n\nOur leading cloud-native, highly configurable API-first platform is well-positioned to power this trend. We enable our customers to create seamless and customized digital experiences for their users without the limitations and compromises that legacy financial platforms have imposed on innovators in the past. We can serve a wide range of companies looking to expand into financial services and existing financial institutions looking to increase customer engagement through innovation. Marqeta has momentum, and we succeed by ability -- our ability to rapidly expand our platform's functionality to fuel continued growth.\n\nA testament to our strength in providing a flexible infrastructure for companies that look to offer embedded finance is our recent partnership with ONE, the independent fintech start-up backed by Walmart and Ribbit Capital. ONE has chosen Marqeta to enable the delivery of products that help customers get paid, spend, save, and grow their money. Specifically, we will start by powering their ONE Card and Marqeta will look to support them as they expand to other products and services. Connecting payments with investing is an excellent use of embedded finance.\n\nWe are doing exactly this as part of our work with Stash. Stash is focused on helping Americans invest, including small dollar amounts, to build long-term wealth. Marqeta is supporting the company with their Stash, Stock-Back Debit Mastercard, enabling their customers to earn stock on almost every swipe of their debit card. The Stock-Back Debit Mastercard built on the recently launched Stash Core is a proprietary infrastructure platform of which Marqeta is a key piece, which enables Stash to unlock innovation in financial technology, including banking and in the future, new capabilities in credit, savings, lending, and more.\n\nThis launch will help Stash more easily welcome new customers and serve millions of everyday Americans who want to build long-term wealth. We also power the embedded finance evolution by enabling well-established financial institutions to offer their current customer base digitally enabled services to more effectively compete with neobank offerings. This quarter, we began our partnership with Raiffeisen Centrobank, a leading banking network operating throughout Europe, to help power their digital banking brand for Raiffeisen digital bank. The company's customers want a simple digital solution, so they turn to Marqeta's global modern issuing card platform to enable Raiffeisen digital bank's customers to access their accounts across devices.\n\nWe will initially roll out the solution in two countries, Poland and Romania. With our single stack solution, Raiffeisen will able to expand that rollout across Europe over time. We are pleased with our forward momentum to power new embedded finance customers, and we have been offering many of these capabilities for quite some time. Our expertise and scale means our customers place significant trust in our platform to power their business.\n\nWe expect these relationships to last many years into the future. In fact, this quarter, we renewed many key customers across different verticals, including Lydia in financial services; and Klarna in the buy now, pay later, our BNPL space. We continue to build upon our market-leading position and our track record of innovating in the BNPL space, one of the earliest examples of embedded finance. We recently signed a deal with Scalapay, Italy's first unicorn.\n\nThe company is a leading BNPL provider in southern Europe and sought Marqeta's expertise to modernize and simplify their offering. Whereas previously, merchants had to be trained on how to use Scalapay and customers had to set up a new profile on the spot, Marqeta's solution will allow Scalapay to seamlessly expand their network and allow customers to pay using a single-use virtual card. We also recently signed a Canadian expansion deal with Affirm, one of our long-standing customers. To maximize the opportunities in embedded finance, we've expanded our key banking services that our customers can use modularly, Marqeta for Banking, our portfolio of banking products that represents a significant expansion of our platform capabilities.\n\nMarqeta for Banking is a natural evolution from our modern card issuing platform as our customers and prospects look to provide a comprehensive package of innovative digital banking features and card offerings. Marqeta for Banking provides our customers with a suite of bank account and money movement features offer through Marqeta's bank partners, including demand deposit accounts, direct deposit with early pay, ACH, cash loads and fee-free ATMs, bill pay, and instant funding capabilities. These offerings are modular, meaning customers can choose the features that best support their businesses and easily fit those building blocks into their product offerings. Because our innovative products come built into our modern card issuing platform, they create a seamless user experience on our modern platform that operates at a significant scale.\n\nWe will continue to release additional Marqeta for Banking features and products in the future. Our modern card issuing products allow for fine-tuned control by enabling individual customer or transaction-level decisions. We brought the same level of control to the early pay feature, which can give account holders access to certain payments up to two days earlier than the ACH settlement date. Marqeta's early pay feature provides our customers with a new level of control by deciding on a transaction-by-transaction basis on which deposits qualify for this benefit.\n\nThe ability to leverage best-in-class modern card issuing and banking capabilities side by side is an attractive proposition for our customers looking to offer embedded finance. These are our modern card issuing platform alongside Marqeta for Banking our customer, Coinbase, for example, can achieve a level of engagement that benefits every part of their business. By adding a card to the Coinbase platform, they can increase engagement. By adding a deposit account that their customer can easily fund, they can create a more comprehensive customer experience.\n\nInternational expansion is another big opportunity for Marqeta, and we have experienced significant momentum in Europe in recent quarters. Many potential European customers have specific preferences concerning how data is handled. So, we now offer data residency for our European customers, but restore the most sensitive elements of our customers' data on European data services. We can now meet the high data residency standards adopted by many European businesses.\n\nFor example, this was key to our opportunity with Raiffeisen Bank. This ability also bodes well for future business prospects, creating a playbook for offering data residency in new geographies. We believe we are very well-positioned to capitalize on embedded finance. We have been leaders in the embedded finance space for many years.\n\nWe have numerous strong customer relationships in BNPL, neobank, and expense management verticals. In addition, our Marqeta for Banking launch gives us enhanced capabilities to support our customers looking to provide embedded finance. Therefore, investors should expect to hear more about this trend from Marqeta in future announcements. With that, I will turn the call over to Mike for a deeper dive into our financials.\n\nMike Milotich -- Chief Financial Officer\n\nThank you, Jason. Good afternoon, everybody. Marqeta continued to deliver very strong performance in Q3 with TPV growth of 54% and net revenue growth of 46%. TPV's eight-point growth premium versus net revenue was almost entirely driven by our Powered by Marqeta customers, whose TPV continues to grow over 200%.\n\nThe strong net revenue growth was broad-based with 20 of our top 30 customers growing at least 40% in the quarter, but led by Cash App in particular, fueled by their strong active user growth. Our gross profit margin was 42%, while adjusted EBITDA margin was negative 7%. Our adjusted expenses included an unusually large charge tied to an international processing indemnification cost that negatively impacted our adjusted EBITDA margin by 3 percentage points. Net revenue was more than $10 million higher than we expected, mostly due to Cash App outperformance, favorable mix within the on-demand delivery vertical, and stronger-than-anticipated Powered by Marqeta TPV.\n\nGross profit was over $80 million and was about $2 million higher than we expected, fueled by the revenue upside. However, a change in our expected business mix resulted in our gross profit margin being more than 1 point lower than we expected as the revenue outperformance did not translate proportionately to gross profit. Although Block drove 72.5% of our net revenue in the quarter, their share of our gross profit is more than 15 points lower than their share of net revenue. Adjusted EBITDA was also about $2 million better than we expected driven by the gross profit upside, which combined with the stronger net revenue resulted in the adjusted EBITDA margin being more than 1 point better than expected.\n\nQ3 TPV was over $42 billion growing 54%, which is in line with our growth rate in the first two quarters of the year. This consistent growth is a testament to our ability to grow at scale as the year-over-year growth in TPV dollars has increased by about $1 billion each quarter this year as we grow over a sequentially increasing base. In fact, in Q3, we had over 30 days where we processed over $500 million in volume compared to less than 20 days in Q2. Let me share a few TPV performance highlights by vertical.\n\nGrowth in the financial services vertical accelerated more than 10 points from Q2, but it still grew a little slower than the overall company. Within this vertical, spend growth in less discretionary categories continue to significantly outpace growth in all other categories. On-demand delivery growth was similar to last quarter due to continued increases in consumer demand and our customers' expansion into new merchant categories. Lending, including buy now, pay later, grew strongly, although Q3 growth was a little slower than our overall TPV.\n\nGrowth in this vertical slowed versus Q2 due to customers tightening their credit requirements, increasingly tougher comps from the previous year, and one customer migrating a portion of their volume within one of their programs. Expense management TPV nearly tripled year over year. The year-over-year increase in dollars was greater in Q3 than it was in Q2, but the rising comps last year did slow the growth rate in Q3 versus the prior quarter. Spending continued to be helped by the rebound in travel.\n\nNondiscretionary spend categories, such as supermarkets, drugstores, fuel and utilities, remained approximately one-third of TPV this quarter. More discretionary categories, such as retail, travel, entertainment, and home improvement, remained approximately one-sixth of our Q3 TPV and continued to grow more than 10 points faster than other categories. Net revenue was $192 million, growing 46% this quarter. Our net revenue take rate was 1 bp lower than last quarter and 3 bps lower than Q3 2021, mostly due to the growth of our Powered by Marqeta business, whose share of our total TPV increased 2 points versus last quarter and has doubled since Q3 last year.\n\nAs a reminder, in our Powered by Marqeta business, we primarily have a processing relationship with our customer. Therefore, the net revenue take rate is lower than in our Managed by Marqeta business where we service the card program manager. Although the net revenue take rate is lower, the gross profit take rate is similar to several verticals in our Managed by Marqeta business. Q3 gross profit was over $80 million, growing 36%.\n\nIn Q3 last year, we finalized a key network contract, which resulted in a catch-up incentive payment. Without that payment, our gross profit growth would have been over 4 points higher this quarter. Gross margin was 42%, on par with the Q2 margin and lower than the comparable quarter last year due to the timing of incentive payments and less favorable business mix. Q3 adjusted operating expenses were $94 million, growing 46%.\n\nAs I noted earlier, this includes an unusually large item tied to international processing indemnification costs. This item contributed 9 points to the growth of our Q3 adjusted operating expenses. Our expense growth has steadily slowed each quarter this year as we identify efficiencies, and the incremental year-over-year investment required to fuel our growth shrinks as the base of resources within Marqeta expands. We expect this to continue even as we invest in future growth opportunities.\n\nExcluding the unusually large item, roughly three-quarters of the adjusted expense growth continues to be directed toward technology and product resources and investment focused on broadening our capabilities and increasing our platform's resiliency, reliability, and scalability. Q3 adjusted EBITDA was negative $14 million, resulting in an adjusted EBITDA margin of negative 7%. The indemnification costs included in adjusted EBITDA negatively impacted our margin by 3 points. Interest income was $7 million, triple the Q2 amount driven by rising interest rates.\n\nThe Q3 GAAP net loss was $53.5 million. Late in the quarter, on September 14, our board of directors authorized a share repurchase program of up to $100 million. In Q3, we repurchased 1.96 million shares for $13.9 million at an average price of $7.05 per share. Now, let's shift to our perspective on the fourth quarter.\n\nAt the time we provided second half guidance back in August, we expected that the tailwinds that drove our first half upside would continue, albeit with tougher comparables, especially in the fourth quarter. We also surfaced our concerns that customers signed since mid-2021, as well as crypto customers might ramp their businesses more slowly as they cut back on marketing dollars and investments in growth. For the most part, these expectations have proven true. However, in August, we also highlighted that given that many of our customers are leaders within their verticals, it was possible our larger customers might thrive in this environment.\n\nFor the most part, in Q3, that proved to be the case across each of our four major verticals, particularly financial services. Based on our performance in Q3 and October, we are increasing our expectations for Q4. We now expect Q4 net revenue growth to be between 29% and 31%. Remember last year, there was a surge in holiday spending, particularly in BNPL, and the expense management vertical was ramping rapidly, which makes for a tough comp and not something we expect to repeat itself this year given the current macroeconomic environment.\n\nQ4 gross profit margin is expected to be 42% to 43% as our business mix shifts toward large customers who have better economics with us and the outsized growth of our financial services vertical, which carries a lower margin than other verticals. This is a several million-dollar increase in our Q4 gross profit expectation since August. Year-over-year expense growth will continue to slow. Therefore, we now expect Q4 adjusted EBITDA margin to be negative 5% to 6%.\n\nThe improvement in adjusted EBITDA expectations since August is driven by higher gross profit, as well as lower expenses due to realized efficiencies and targeted hiring. Our expectations for the full year 2022 have improved significantly as a result of our outperformance in Q3 and our raised expectations in Q4. We now expect 2022 net revenue growth to be 44% to 44.5%, gross profit margin to be 42.5% to 43%, and adjusted EBITDA margin is expected to be negative 6% to 6.5%. The opportunities for Marqeta to power the embedded finance evolution for both disruptors and incumbents in the U.S., Europe, and beyond are immense.\n\nAs we move into the last quarter of 2022, Marqeta is on a great trajectory as we continue to diversify and scale the business. TPV in the first nine months of the year has already surpassed our total volume in 2021, growing over 50% each quarter in '22. Our net revenue and take rate remained steady this year as we continue to add value for our customers with highly configurable platform, with expanded capabilities and robust program management solutions. Gross profit margins remain right in the middle of our stated long-term range of 40% to 45%, reflecting our operating leverage as we expand.\n\nWe continue to invest thoughtfully and with discipline in new capabilities and resiliency while finding efficiencies as the business scales, which reflects our commitment to improving our adjusted EBITDA margin as we grow and ultimately achieve our long-term target of over 20%. I will now turn it back over to the operator for questions. \n\nOperator\n\nThank you. Ladies and gentlemen, at this time, we will be conducting a question-and-answer session. [Operator instructions] Ladies and gentlemen, we request you to restrict to one question to all participants. One moment, please, while we pause for questions.\n\nOur first question comes from the line of Tien-Tsin Huang from J.P. Morgan. Please go ahead.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nThank you so much. Thanks for going through all the detail. I actually wanted to ask on Marqeta for Banking, if you don't mind, Jason. Just curious how ready that is for commercial applications.\n\nAre you primarily going to pursue de novo opportunities? Or is there an opportunity to work with existing players there? Just trying to get a better sense of how quickly that can ramp up.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nHey, Tien-Tsin, thanks for the question. So, it's both. Marqeta for Banking really just simply represents a natural expansion of modern card issuing. And we believe companies, to some degree, will be financial curve as this company.\n\nI've said that many times in the past, and that's actually what embedded finance is. And these are large companies, such as retail tech companies, and they want integrated platform with card issuing as a way to monetize, as well as other services to provide stickiness and engagement. And so, we approach these products and features in a very Marqeta way, which is modular in nature. Customers get to pick and choose the building blocks what they need for their business.\n\nAnd again, this is an extension of our modern card issuing platform. So, whether it's ACH or DDAs to facilitate spending on a card, that basically drives funding onto the card, and then we'd obviously generate interchange as part of those cards being used. So, you take modern card issuing, you marry that with Banking as a Service, allowance for the sort of fine-tuned control at a transaction level. And then we've added extra features in there like early pay, which gave account holders access to their payroll up to two days earlier.\n\nAnd all of this can be designed on a transaction-by-transaction basis, which deposits qualify for this benefit. And a lot of times, you see these programs where it's just at a program level. So now we can get down to specifically the user. So, we're far from done in the additional list of features and functions we plan to provide.\n\nLike we're continually building, so we're going to hear a lot more about this. And then we would also look to acquire potentially Banking as a Service functionality if you find it the right fit, both opportunistic and strategic. But I can turn it over to Mike, if you have anything to add.\n\nMike Milotich -- Chief Financial Officer\n\nYeah. I think just from a financial perspective, right now, these capabilities are really done with the aim to increase card spend and support our customers. It's -- we look at this as really a great incremental business to our current business. So, the goal is really to increase our win rate with customers by providing this holistic solution from us rather than our customer having to use multiple providers.\n\nBut that said, the -- even the small amounts that we may make today that will be growing over time as more customers adopt this, that will be highly accretive with these capabilities once they're built. So just a little bit more revenue on the same transaction or the same volume with a very low marginal cost. So, as it does expand over time, we expect it to be very helpful financially.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nRight. So, if you don't mind me just clarifying with a quick follow-up. Just with the -- with win, which is a -- with ONE, which is a nice win, sorry, on the card side, right? I suppose there could be opportunity then to promote inflows and other types of cash movement. There could be an opportunity to expand that and obviously generate better outcomes for the ONE Card.\n\nIs that one way to think about it as an example?\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. That's definitely a way to think about it. So, the way our customers work, obviously, if they're de novo products, they get them up and running. They learn about their customer base and the features and functions that they need because they're already integrated into the platform.\n\nWe talk a lot about how you integrate once into Marqeta, you can launch in every geography that we're operating in. And then you can actually create the features. They will add those features over time so that they can better not only drive engagement for their customers or their users, but obviously drive revenue for their business.\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThank you. Our next question comes from the line of Darrin Peller from Wolfe Research. Please go ahead.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nHey, guys. It's great to see these results. Can we just touch on -- outside of Block, the other verticals seem like you have pretty good strength continuing in areas like expense management and certainly in areas like on-demand delivery even still despite the size and the comps. And so maybe just touch on a little more of what you're seeing there.\n\nAnd if we can get into a little more detail, you guys have done a great job being vertical-centric and really differentiating on an industry basis to win business. Are you seeing anything change on that front competitively in that or anything else?\n\nMike Milotich -- Chief Financial Officer\n\nYeah. Thanks, Darrin. No, we're not seeing anything changed. I mean things are actually very stable.\n\nFrom like an on-demand delivery, I'll start there. That is our sort of most mature vertical. The growth was very consistent with last quarter. And as I mentioned in my remarks, what we're really seeing fueling the growth is our customers expanding into new areas.\n\nSo, it's almost like -- they're increasing their acceptance, if you will, particularly in drugstores, convenience stores, retail, which has really helped improve engagement. And then on top of that, from a revenue perspective, it outperformed because we had a favorable business mix that improved the interchange relative to the customer revenue share. If you think about all the different factors that can influence interchange, the way the mix of spending happened this quarter, it was sort of accretive to our revenue versus the volume growth. On the expense management side, it's -- that area of the business is just growing incredibly, incredibly fast.\n\nSo, it's now in the mid-teens of our TPV. As I mentioned, it's double the share from last year. And we have six customers who have TPV over $100 million. So, it's just an area that's growing very fast as businesses look to get more efficient and they want their employees also to have a little bit of a more user-friendly and flexible experience, and that's really what's fueling our success there.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nOK. No signs of change, it sounds like.\n\nMike Milotich -- Chief Financial Officer\n\nNo.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nThat's great to hear. Thank you.\n\nMike Milotich -- Chief Financial Officer\n\nAnd in fact, like -- so as I mentioned, too, Darrin, just to reiterate, our expense management growth in dollars, our TPV growth in dollars was actually even more than it was in Q2. So, the -- it's accelerating in terms of the spend on a year-over-year basis, but because the year-over-year comparison is also growing really fast. The growth is coming down, but it's still, again, almost tripled versus last year.\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nYeah. That's really great. Thanks, Mike.\n\nOperator\n\nThank you. Our next question comes from the line of Timothy Chiodo from Credit Suisse. Please go ahead. \n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nGreat. Thank you for taking the question. You sort of alluded to this a little bit earlier, Mike, but I wanted to dig into it, if we could get maybe just a range. I know it will be hard to put an absolute number on it.\n\nIt's early stages and there'll be sort of a range of products. But generally speaking, it sounds like Marqeta for Banking will be a higher gross margin. In terms of gross profit as a percentage of revenue, it will be a higher gross margin business for you. Could you just put some directional numbers around that compared to current total company gross margins how much higher this could be? Or maybe even just talk about it sort of as a percentage of volume and how it might compare to the current core business, which is clearly much more tied to interchange.\n\nMike Milotich -- Chief Financial Officer\n\nYeah. So, you're right. We expect it to be significantly higher margin than our current business. A lot of these services might be charged on a per-user basis or a per-transaction basis.\n\nSo, it really is just incremental revenue and potentially cost of revenue for the existing transactions and volume are getting already. And so, we do expect this to be -- and even in the cases where we provide it today, we have some customers using some of these services, and it is a much higher gross margin. So, it won't necessarily be a huge revenue growth driver directly. As I sort of reiterated earlier, I think it's much more about making our overall value proposition much more compelling and improving our win rate.\n\nBut in terms of within that incremental revenue we get, it does come at a much higher margin, and therefore, it's very beneficial for us on the bottom line.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nExcellent. Thank you, Mike, And then the brief follow-up also on Marqeta for Banking. Safe to say that the closest competitor to this offering would be along the lines of services that are offered by Galileo. Would it be similar to some of the offerings within Fiserv and FIS or maybe just others that you could just mention that could maybe just contextualize what this looks like and if those are reasonable competitors to think about among others?\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. Those are reasonable competitors. If you think about -- I mean we're all in the business of global money movement, and global money movement for Marqeta began with modern card issuing. And obviously, we consider ourselves certainly the leader in that.\n\nWe created that category and have obviously done really well in it over time. What we find is that our customers want to move money in many different ways. And we've created in a very Marqeta way, which is the native APIs are created. We obviously had a credit to that.\n\nWe've talked about that a lot lately. And a number of different companies have created this, like the ones that you've mentioned. There's probably more out there as well. But we look at it from a position of how Marqeta works with our customers.\n\nThe ability to natively integrate with these APIs into the platform once launch in many geographies, many other ways to move money sort of certainly outside the United States will be coming. So, our strategy in how we approach the market, whether prospects or making our customers even more successful, is how we differentiate ourselves from other competitors.\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nThank you, Jason, Mike. Appreciate both of those.\n\nOperator\n\nThank you. Our next question comes from the line of Ramsey El-Assal from Barclays. Please go ahead.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi. Thanks for taking my question this evening. I want to actually follow up on Tim's question and just again on Marqeta for Banking, ask how the sales pipeline is developing. And more specifically, if you could comment on the cross-sell opportunities and whether the genesis of the offering was sort of meeting the demand that you're seeing in your existing customer base or more sort of a product suite that you think might be an unmet need in the sort of external marketplace.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. So, we have a number of announcements to make in the coming quarters. We recently announced certainly today was the deals with ONE. And we've also talked about Uber and the card there.\n\nWe have addition recent renewals like Lydia. We've talked about Klarna. There's more to come on that front, exciting deal. On the pipeline for credit, especially in international, we talked about our growth within the EU.\n\nAnd we also, like I haven't mentioned, was discussions with large FIs. Obviously, those sales cycles take long. But as we talked about with the Raiffeisen Bank, we're getting to many other parts of that. So, if we think about embedded finance, it's exciting because we believe many companies are going to become financial services companies in that financial services that are in those companies is essentially embedded finance for what we call Marqeta for Banking.\n\nSo again, our strategy has always been platform-centric and then the modularity of that, the ability to add lots of different features and functions that a customer can pull off the shelf, integrate quickly and obviously create a better experience for their customers. So, we believe in this and happily there for a long time. We think embedded finance was something we've certainly been around or have worked in for some time, whether we're supporting someone's core business with a card or we are their core business for the card. And again, this is just expanding our features and functions around global money movement to make sure that we're capturing many opportunities to move money around the world and specifically move money into cards where our customer generates revenue from interchange.\n\nAnd obviously, we've talked about the past year, which is their success is our success. So, we're just excited about how do we create a great strategy around the stickiness of our platform and their ability to succeed.\n\nMike Milotich -- Chief Financial Officer\n\nYeah. I think, Ramsey, one thing we want to try to get in front of is if a customer says, \"Look, we have a very differentiated card issuing capability. But I really would rather use one platform, so maybe I'm willing to sacrifice a little functionality on the card side because I want some of these other banking-like services.\" And so, what we really want to do is take that off the table, right, and say, \"Well, we can provide a holistic solution for you.\" And while we're building those, we are building things that are very Marqeta-like in terms of their flexibility and configurability, but also then you can get our world-class card processing capabilities in a bundle.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGot it. Thanks so much. Appreciate it.\n\nOperator\n\nThank you. Our next question comes from the line of James Faucette from Morgan Stanley. Please go ahead.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThank you very much. Wanted to follow up a little bit on the competition question. But clearly, you have a -- your biggest customer that you'd like to renew when you can. Just wondering if we can get an update on that and kind of what you're seeing from the internal efforts both from them as well as other customers and potential customers, thinking about those as potential competitors and if anything is changing in the landscape or what you need to do versus internally developed solutions.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. So, we'll start with Block. And as we talked about in the past, we have 18 months, I think, at this point, still left on the agreement. We'll share something as soon as possible.\n\nWhen Block decides they want to go build something new, they build it with us. We obviously enjoy that. We invested an incredible amount into our platform, both in tech and product, that our customers like Block can benefit. So, when there's more to share on that, we'll definitely share it.\n\nAnd then around the competition piece, our strategy has been working really well. And I think as we've seen in -- as of late, where the economy is beginning to change, being the market leader, as Mike had mentioned, we -- part of our strategy is to not only land and expand within verticals but really target the top companies in that space, and we've done really well with that strategy, which is in the past, we've talked about starting with commerce disruptors, moving into digital banks, moving into tech giants and then moving into large financial institutions. We see different types of, obviously, competitors. We see ones like the TSYSes of the world that operate with large financial institutions.\n\nWe see smaller players that maybe upstarts from the last two to three years that are really just starting to get traction. But we feel like our strategy has worked really well. We continue to execute against that. We continue to land and expand not only large opportunities like ONE because we built the trust within the market.\n\nBut then again, whether it's embedded finance or Marqeta for Banking, we're finding that our customers don't want to go to other vendors to get technology. They want to stick with us and use the other pieces that we have like the DDA accounts or the ACH feature. So obviously, we continue to renew our customers. We continue to land new customers, and we will continue that strategy as time goes on.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThanks.\n\nOperator\n\nThank you. Our next question comes from the line of Ashwin Shirvaikar from Citi. Please go ahead.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you and congratulations on the good quarter. I was hoping you could kind of go back to the -- sort of the raise in outlook and kind of walk through the factors, maybe -- is it possible to size or rank order them?\n\nMike Milotich -- Chief Financial Officer\n\nSorry, Ashwin, can you -- size and rank order what about our outlook?\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nOh, the factors that led to the change in the outlook. \n\nMike Milotich -- Chief Financial Officer\n\nOh, yeah. Sure. Yes. So yeah, there's a few things.\n\nSo one is that we -- last quarter, one of the key things we said we thought newer customers of ours who are ramping and then -- particularly everything that's going on in the crypto space, that those customers just may not invest behind those programs nearly as aggressively as they may have planned to do in the beginning of 2022. And that largely did play out. But what we also speculated was it could be that the bigger players who have scale already would then step in and capitalize on the fact that there maybe wasn't as much competition in the market as they had grown accustomed to over the last 12, 18 months. And so, a lot of it was just performance -- strong performance by our largest customers, Block being, of course, doing incredibly well.\n\nBut just generally speaking, that's what we're seeing. And so, as we looked at that performance in Q3, we're really then just translating that to Q4. The only difference from a growth perspective is just the incredible holiday season than we had last year. If you look at the kind of growth that we saw just across the economy in retail spending and particularly in BNPL, that's just not something we feel we'll replicate again.\n\nAnd so, the growth rate is coming down, but that's not necessarily representative of the kind of performance that we expect to see just because we are kind of lapping at least once in a decade like holiday season that we had last year.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nGot it. So largely, you're just basically taking the factors that helped 3Q into 4Q, and that's really what it seems like. Got it.\n\nMike Milotich -- Chief Financial Officer\n\nThat's right.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nYeah. The second question was the if we have a downturn, would you expect vastly different trends in sort of Powered by versus Managed by? Is there a macro preference element to how clients view those options?\n\nJason Gardner -- Founder and Chief Executive Officer\n\nWell, so we power a wide range of business models across both consumer and commercial. And as we've talked about, our net revenue isn't overly indexed into discretionary spending. Roughly a sixth of the volume in our platform is for highly discretionary items, which are things like large electronics or travel home improvement. But people still need to spend money on things like groceries, gas and other essentials.\n\nSo, our volume growth is largely driven by customers displacing other forms of payment. And in some cases, changes to the way people pay was accelerated by the pandemic. It may decelerate because of the potential recession or as some would say, we're in a recession now. But there's expense management and corporate cards, there's neobanks and consumers, there's buy now, pay later versus other forms of revolving credit.\n\nSo, we don't know what to expect, but we feel like we're not kind of overly indexed on one versus the other.\n\nMike Milotich -- Chief Financial Officer\n\nAnd I think specifically, Ashwin, in terms of the Powered by versus Managed by dynamics, we add incredible sort of turnkey solution that are Managed by offering for customers that they value. And because we're doing it at scale, I think a lot of customers just look at it and say that the cost -- the amount of investment I would need to make to have those capabilities at the level of service that Marqeta provides, that's actually a good price, right? It would be more expensive for me to do that investment. So just because the economy may be shifting, we don't necessarily think that gets customers thinking more about a Powered by structure because that would require significant investment and know-how for them to put in place versus the -- what -- the solution we can deliver at scale.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Rayna Kumar from UBS. Please go ahead.\n\nRayna Kumar -- UBS -- Analyst\n\nGood afternoon. Thanks for all the helpful details on your call. Just any thoughts on when we can hear an update on your contract with Block? And could you discuss how your conversations are progressing at this point? Thank you. \n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. I mean -- thanks, Rayna. So, we talk to Block every day. We obviously power a lot of products across the portfolio, both in Cash App, Square Card on the merchant side.\n\nSo, there's a lot of conversations we have on a regular basis, and they certainly have adopted a lot of our platform, not only across card issuing and processing but also across embedded banking and Marqeta for Banking. So, as I mentioned, it's about 18 months from the renewal. About April 2024, I believe, is the time the contract is up. And again, I'm not going to comment on the discussions regarding the renewal.\n\nAnd as soon as we have an update, we will absolutely be talking about it.\n\nMike Milotich -- Chief Financial Officer\n\nWe won't hold a lot on you. We promise. \n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. We promise.\n\nRayna Kumar -- UBS -- Analyst\n\nGot it. Thank you. Appreciate all the details.\n\nOperator\n\nThank you. Our next question comes from the line of Josh Beck from KeyBanc. Please go ahead.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nThanks for taking the question. I would ask just about the level of visibility that you have at this point looking forward into next year. Obviously, a lot of your growth, I believe, in any given year is from existing customers. And it seems like you've dialed in certainly the growth rates within some of the verticals.\n\nAnd obviously, you have a pretty good handle on expansion plans at a customer level. So curious on how you would characterize just the visibility. And obviously, the macro is uncertain for everybody. And then just with respect to kind of embedded Q4 opex levels, how we should think about that as a jumping point for investment plans in future years would be super helpful.\n\nMike Milotich -- Chief Financial Officer\n\nI think the -- in terms of your first question, I think -- I mean we're in very regular dialogue with our customers about what they're thinking because for many of them, we really are goal aspect of the service they're providing or how they monetize their service. And so, we're in quite regular dialogue with them about how are they thinking about things, how are they managing their own business and what are the implications for us. So, I would say we have fairly good visibility in that sense. However, as you know, right now in this environment, it's very unclear, right, about what things might be like in three to six months.\n\nSo, we can get their perspective on how they're doing their business planning, but they pretty consistently say, we're -- we'll see, right? And we're going to try to remain as nimble as possible. So, we certainly are aligned with our customers, but that doesn't mean we have a crystal ball. In terms of the opex or the expense levels for Q4 and what that means for next year, there's a couple of things that impact our expenses in Q4. So, one is just, I guess, two weeks ago now, we were at Money 20/20.\n\nThat's a big event for us that drives a lot of pipeline conversations, gets us engaged with a lot of new prospects. And so that's -- we all spend a ton on marketing, but that's one of our major items. And so that's something that happened in Q4. We also -- as our volumes go up just seasonally with the holiday season, we do have a number of expenses that go up just related to our cloud costs and some of our other kind of data and platform tools that are more variable in nature.\n\nSo as the transaction counts pick up, then we will have some additional costs. And then we still are hiring in -- particularly in very selective ways for our key growth areas. And so, we are going to have a decent jumping-off point for next year. And our plan is to be fairly cautious as we proceed from an investment front into 2023, at least initially because of the level of uncertainty, and then we'll try to make adjustments as we go through the year once it's a little more clear what might happen from an economic perspective.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nVery helpful context. Thanks, Mike.\n\nOperator\n\nThank you. Our next question comes from the line of Mike Ng from Goldman Sachs. Please go ahead.\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nHey, good afternoon. Thank you for the question. I just have two. First, I was just wondering if you could give us a little bit of color around TPV performance in the quarter by any top customer cohorts, whether that's top five, 10 or 20.\n\nAnd then second, just on the fourth quarter TPV outlook, is there anything you could talk about as it relates to industry vertical? What may be accelerating or decelerating? And perhaps you could remind us if there are any notable tough comps or anything like that, that we should be aware of. Thank you very much.\n\nMike Milotich -- Chief Financial Officer\n\nYeah. Sure. So, in terms of performance, I would say -- by cohort, I would say our top five customers are -- non-top five customers are still growing at a premium to our top five customers, although it maybe the gap isn't quite as big as it's been in quarters past. As I said, what we're seeing is some smaller customers are maybe investing a little less, and some of the larger customers are capitalizing on that.\n\nSo that gap has closed a little bit, but our non-top five customers are still growing faster. Another way to look at it is -- another way we look at it is our new customers and how they're ramping. And if we look at our customers that we signed in 2019 or later, so we've only been on the platform a couple of years, they are growing about four times faster than customers who have been on the platform for longer. And that growth is well over 100%.\n\nSo, we still have a lot of newer customers on the platform growing quite quickly. And that's obviously helping to sustain our growth. Even -- as I mentioned on the call, even though our base keeps getting bigger and bigger, we've been able to sustain that TPV growth. In terms of on a vertical basis for Q4, there really two areas or three actually of our verticals that have significant lapping.\n\nI would say the one that really doesn't is the on-demand delivery. That has been a more mature business for us in this time. So not huge differences in growth expected. But BNPL certainly has a very tough comp.\n\nI mean the -- I think we've said last year, our Q4 BNPL volume was bigger than our whole first half of 2021 volumes. So, the pickup was incredible. And so that has a very tough comp. Another one is just because of the strong holiday season, some of our customers in financial services who support more everyday spending also saw a big acceleration in their growth.\n\nAnd so again, our point of view, I guess, is that this is unlikely to be as strong as the holiday season we had last year. And so, if you just even look at consumer confidence and sentiment, and so that also will have a tough comp. And then finally, on expense management, that was a relatively new vertical for us in 2021. And so, the growth was incredible, and it was growing literally several hundred percentage points.\n\nAnd so that growth is also coming down. But as I said, even in Q3, it's still growing. The business still like tripled year over year. So, the growth is still going to be very healthy but not four or five times like we've seen in previous quarters.\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nExcellent. Thank you for all that detail. That's very helpful.\n\nMike Milotich -- Chief Financial Officer\n\nYep.\n\nOperator\n\nThank you. Our next question comes from the line of Andrew Bauch from SMBC Nikko Securities. Please go ahead.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nThanks for the time. Wanted to touch upon the adjusted EBITDA margin performance in the quarter. Mike, you called out some targeted hiring and various efficiencies. Just trying to get a sense of -- some of the headlines we've seen around Silicon Valley is presenting a more favorable hiring environment for you today than perhaps you're operating in, just say six to nine months ago and how that can kind of translate.\n\nMike Milotich -- Chief Financial Officer\n\nYeah. There's no doubt that that's something we think will be beneficial to us. I think if you -- I think we've talked about this before. One of the, I think, big advantages we've had this year is actually back in kind of late February, early March.\n\nWe adjusted our plan. So even only a couple of months into the year, we changed our plans because you could see some of the macro warning signs at that time. And we decided to proceed with caution. And so, I think maybe where we benefited as we dialed things back our plans already early in the year, and there may be other tech and fintech companies that you're hearing now doing layoffs that maybe kind of kept their foot on the gas for the first half of the year and then are now realizing that maybe was a mistake.\n\nSo, we did get in front of it, and we are hiring. I would say, you're right. Certainly, the level of competition for key talent is on the decline. And with some of the layoffs that are getting announced, it seems like there's a few weeks now for major tech companies.\n\nThat is something that we're hoping to take advantage and capitalize on that by being able to bring in some super talented people that maybe were -- would have been very difficult to get just six to 12 months ago.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nYeah. I mean at the minimum, they're a governor on compensation growth in the near to medium term.\n\nMike Milotich -- Chief Financial Officer\n\nAgree. And I think also what we would expect to see is -- which is quite helpful, is a lower attrition. We -- obviously, a lot of people like to hire. We've got a lot of very talented people here who have been a big part of the innovation that we've achieved over the last few years.\n\nAnd so, there's a lot of competitors who would like that know-how and that experience. And so that's also something we expect to be a huge benefit. If we can better retain our key talent best, that will certainly help us in 2023.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nThat's great and appreciate the additional color.\n\nOperator\n\nThank you. Our next question comes from the line of Bob Napoli from William Blair. Please go ahead.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nGreat. Thank you. Good afternoon, Jason, Mike, team. Nice numbers.\n\nJason, I just wondered if you could give an update on your search, I guess, for a permanent CEO. It looks like -- because I mean it seems like you're pretty engaged still at this point. And then just any thoughts on your credit platform? Is that an area we're likely to see an acquisition? Thank you.\n\nJason Gardner -- Founder and Chief Executive Officer\n\nYeah. Thank you. I am very engaged on a day-by-day business. I love this company.\n\nI've been running it for over 12 years. And in regards to the CEO search -- so we've met a lot of different candidates over the past few months. I've certainly been working close with the board and the executive team to meet a broad base of candidates from lots of different backgrounds. And I'm really searching again for someone to -- the next CEO to lead the company from one to infinity.\n\nI've led it from zero to one. And I certainly understand like the market wants me to move quickly, but we want to hire the best person, and we will do that at some point. So regarding the search, I'll have something to share when we have it. Regarding credit.\n\nSo absolutely, we are looking at a number of different companies in the credit space. We think this is definitely the future of Marqeta as we've been investing it pretty significantly. We started the journey in credit about four years ago. We now see customers up and running and using it like Greenlight.\n\nWe're excited about that partnership and their ability to succeed. We see this more and more. And there's been a lot of companies that have been started really over the last probably four to five years. So, we have been looking at a lot of different businesses in regards to what's the best talent, what's the best platform, how does it fit within our values, and how we build software and technology and making sure that's a good DNA fit with our value and our quality in our people.\n\nSo more to announce, but I think we have a lot of different options right now in the market that we're taking a look at. And as soon as we have something that we want to zero in on and if we can find a successful path forward, we'll certainly announce it.\n\nBob Napoli -- William Blair and Company -- Analyst\n\nThank you, Jason.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of the question-and-answer session. I would now like to turn the conference to Jason Gardner, founder and CEO, for closing comments. \n\nJason Gardner -- Founder and Chief Executive Officer\n\nWell, thank you, everyone, for joining us for Marqeta's third quarter of 2022 earnings call. Have a great rest of the year. Happy holidays and look forward to speaking with you all in 2023. Take care.\n\nMike Milotich -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStacey Finerman -- Vice President, Investor Relations\n\nJason Gardner -- Founder and Chief Executive Officer\n\nMike Milotich -- Chief Financial Officer\n\nTien-Tsin Huang -- JPMorgan Chase and Company -- Analyst\n\nDarrin Peller -- Wolfe Research -- Analyst\n\nTimothy Chiodo -- Credit Suisse -- Analyst\n\nRamsey El-Assal -- Barclays -- Analyst\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nRayna Kumar -- UBS -- Analyst\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nBob Napoli -- William Blair and Company -- Analyst\n\nMore MQ analysis\n\nAll earnings call transcripts"
}