{
  "companyName": "Taysha Gene Therapies, Inc.",
  "companyTicker": "TSHA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/taysha-gene-therapies-inc-tsha-q2-2022-earnings-ca/",
  "content": "Taysha Gene Therapies, Inc. (TSHA 2.73%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:00 a.m. ET\n\nOperator\n\nGreetings. Welcome to the Taysha Gene Therapies second quarter 2022 financial results and corporate update conference call. [Operator instructions] As a reminder, this call is being recorded today, August 11, 2022. I'll now turn the call over to Dr.\n\nKimberly Lee, chief corporate affairs officer. Please go ahead.\n\nKimberly Lee -- Chief Corporates Affair Officer\n\nGood morning, and welcome to Taysha's second quarter 2022 financial results and corporate update conference call. Joining me on today's call are RA Session II Taysha's president, founder, and CEO; Dr. Frederick Porter, chief technical officer; Dr. Suyash Prasad, chief medical officer and head of R&D and Kamran Alam, chief financial officer.\n\nAfter our formal remarks, we will conduct a question-and-answer session and instructions will follow at that time. Earlier today, Taysha issued a press release announcing financial results for the second quarter ending June 30, 2022. A copy of this press release is available on the company's website and through our SEC filings. Please note that on today's call, we will be making forward-looking statements, including statements relating to the safety and efficacy and the therapeutic and commercial potential of our investigational product candidates.\n\nThese statements may include the expected timing and results of clinical trials for our product candidates, our expectations regarding the data necessary to support regulatory approval of TSHA-120 and the regulatory status and market opportunity for those programs as well as Taysha's manufacturing plans. This call may also contain forward-looking statements relating to Taysha's growth and future operating results, discovery and development of product candidates, strategic alliances and intellectual property, as well as matters that are not of historical facts or information. Various risks may cause Taysha's actual results to differ materially from those stated or implied in such forward-looking statements. These risks include the uncertainties related to the timing and results of clinical trials and preclinical studies of our product candidates, or dependence upon strategic alliances and other third-party relationships, our ability to obtain patent protection for discoveries, limitations imposed by patents owned or controlled by third parties and the requirements of substantial funding to conduct our research and development activities.\n\nFor a list in description of the risks and uncertainties that we face, please see the reports we have filed with the Securities and Exchange Commission. This conference call contains time-sensitive information that is accurate only as of the date of this live broadcast, August 11, 2022. Taysha undertakes no obligation to revise or update any forward-looking statements to reflect events or circumstances after the date of this conference call, except as may be required by applicable securities law. I would now like to turn the call over to our President, Founder and CEO, RA Session II.\n\nRA?\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThank you, Kim. Good morning, and welcome, everyone, to our 2022 second quarter financial results and corporate update conference call. We continue to execute on the advancement of our core clinical programs and are excited to announce important data from our Giant Axonal Neuropathy, or GAN program and Rett Syndrome program. These data include stabilization and recovery of sensory nerve conduction in patients with GAN following treatment with TSHA-120 despite expectations of a rapid and irreversible decline in sensory function in untreated patients observed in natural history.\n\nImportantly, the measure of sensory nerve conduction represent a definitive clinical endpoint. In addition, we now have positive analytical comparability data demonstrating that our commercial grade and clinical trial material are functionally indistinguishable across all key quality attributes. Frederick Porter, our chief technical officer, will provide more details shortly. On the regulatory front, we had positive discussions with the U.K.'s Medicines and Healthcare Products Regulatory Agency, or MHRA, and received feedback that we believe support our regulatory strategy.\n\nWith full comparability data in hand, in conjunction with additional clinical data plus feedback from the MHRA, we believe this provides the most robust package to support our ongoing regulatory engagement. We expect to provide additional regulatory feedback, including from the FDA by the end of this year. For Rett Syndrome, we are highly encouraged by late-breaking neonatal data in preclinical mouse models, demonstrating new normalization of survival and normalization of behavior. As you will hear from Suyash shortly, we believe the totality of preclinical data generated to date, by TSHA-102 is a comprehensive data set in Rett Syndrome that further supports earlier treatment and clinical advancement of this promising product candidate.\n\nWe look forward to reporting preliminary Phase 1/2 clinical data in adult females with Rett Syndrome by the end of this year. Now I'll turn the call over to Fred to discuss updates on our comparability data for TSHA-120 again. Fred?\n\nFred Porter -- Chief Technology Officer\n\nThanks, RA, and good morning, everyone. In the next few slides, I'll review our manufacturing progress for the GAN program and our comparability package that supports the transition to our final commercial manufacturing process. Next slide. Our manufacturing development program for TSHA-120 was kicked off in mid-2021, one we initiated our partnership with our CDMO partner to deliver our commercial-ready manufacturing process.\n\nWe've rapidly executed several tech transfer runs leading up to production of our 500-liter pivotal batch in April of this year. In parallel, we progressed several key analytical development efforts internally to deliver a comprehensive data package to support product release and comparability in line with agency guidance for pivotal stage programs. Next slide. Our commercial grade manufacturing run was highly productive, yielding over 200 vials of finished drug product filled into 2 separate lots that are currently undergoing release testing.\n\nAfter inspection and testing, over 50 patient doses are available for clinical use. In addition to supporting the ongoing clinical study, these lots were enrolled in a comprehensive stability study to provide critical shelf-life data in support of our BLA filing. The 500-liter production also represents our final commercial scale, which aligns with our commercial projections. We believe this high-yielding process supports a favorable cost of goods and ensures us that we will be able to meet commercial demand with a reasonable number of batches annually.\n\nNext slide. In considering the analytical panel for product release and comparability, there are four key areas of importance for gene therapies, strength, purity, potency, and safety. These important attributes have informed the panel of assays that were in the process of validating at our CDMO partner to support both product release and comparability. The analytical method selected aligned with agency expectations in terms of accuracy, precision and robustness for measuring each product attribute.\n\nNext slide. In order to assess comparability of our clinical trial material and the newly manufactured material from our commercial manufacturing process, we've applied this panel of release assays for side-by-side testing with our comprehensive assay panel. Shown here are eight of the most critical attributes that reflect on the purity, potency and safety of our product. First, all results demonstrated that both clinical trial material and commercial grade material are a high purity and lack significant levels of host cell or process contaminants such as protein and DNA or aggregated species.\n\nVector purity was in excess of 95% for all three lots, and host cell protein contamination was below detection. Aggregation of all lots was also very low. Both cell and plasma DNA contamination are also important attributes to discuss with regulatory agencies since carryover represents a theoretical immunogenicity or oncogenicity risk. Residual plasma and wholesale DNA were similar for all lots indicating a consistent product profile for both lines.\n\nEmpty capsids are a key attribute for AAV vectors since empty capsids can stimulate immune responses to the vector and reduce potency. All three lots were highly enriched in full particles and meet recent FDA draft guidance in terms of analytical methodologies and present full capsids. Finally, potency of AAV vectors is a key measure that is intended to correlate with clinical efficacy. We developed several product-specific potency assays to measure functional activity of our product, which is reported relative to a reference standard.\n\nThese assays recapitulate the biological activity of TSHA-120 where the AAV transduction process of cell entry, DNA and packaging, gene transcription and translation occur in an immortalized mammalian cell line. Functional activity is measured by quantitation of TSHA-120 transgene RNA levels or gigaxinin protein expression as two independent and complementary readouts. We observed good agreement with both methodologies and the activity of all three GMP lots against our reference, which gives us confidence that the lots are of high and comparable activity. Overall, these results support our view that our early clinical trial material and commercial-grade material are biochemically and biophysically similar and should perform identically in a clinical study.\n\nWe plan to present these final study results with additional regulatory agencies and anticipate regulatory feedback by the end of this year. Next slide. Recently, regulators have encouraged sponsors to conduct deeper analysis of product contaminants not covered by standard release assays to better assess product safety and comparability. To comply with this guidance, we have added PacBio next-generation sequencing to our product characterization panel to better understand the nucleic acid composition of our products.\n\nThis method not only allows us to identify the source of nucleic acid, but also the fragment size, sequence variability, which also need to be considered when assessing AAV safety and efficacy. Our analysis of clinical trial material and commercial-grade pivotal batches demonstrates that the source and composition of transgene and contaminating host and plasma DNA is nearly identical and provides further support that the nature of our product is unchanged between our early clinical and commercial-grade batches. Next slide. In summary, we have successfully executed six batches of TSHA-120, our pivotal 500-liter scale GMP batch was productive, yielding over five -- excuse me, 50 doses for the high-dose cohort, which positions us for future BLA-enabling activities and commercial production.\n\nImportantly, our comprehensive comparability analysis demonstrated that the clinical grade material and commercial-grade material are nearly identical by key critical quality attribute measures, including next-generation sequencing analysis. We've also made rapid progress developing a product-specific potency method, which is on track for validation and product release, which aligns with regulatory expectations. We feel this progress supports a strong regulatory package that we will discuss with additional regulatory agencies this year, including the FDA. I'll now turn over the call to Suyash to discuss additional program updates for GAN.\n\nSuyash?\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nThank you, Fred, and good morning, everyone. As RA noted earlier, we continue to make notable progress in advancing our clinical programs for GAN and Rett Syndrome and expect exciting milestones throughout the remainder of the year. I'll begin with recent updates on TSHA-120 for GAN. Building on the positive clinical efficacy and safety data and long-term durability data that we reported earlier this year, we are pleased to report new nerve conduction study data for TSHA-120 in GAN.\n\nWe are grateful to our partners of the NINDS for leading the GAN natural history study and the interventional trial under the leadership of Dr. Carsten Bonnemann, principal investigator at the NIH. Next slide. Nerve conduction studies are a neurophysiological measure and the specific measure of relevance to GAN is the sensory nerve action potential or SNAP which is considered a definitive clinical endpoint.\n\nThe test is performed by applying an electrical stimulus to the sensory nerve fibers and recording the actual potential at a point further along the nerve. There are three main parameters. The first is the amplitude of the action potential, which is the peak-to-baseline measurement and functional significance is that this is related to the number of axons in a nerve. With axonal degeneration neuropathies, the primary feature is a markedly reduced sensory nerve action potential or SNAP amplitude.\n\nThe next parameter is latency, which is the time from stimulus to an initial electrical deflection. This can be compromised in the demyelinated neuropathies. Lastly, conduction velocity is the speed with which the electrical signal travels down the nerve. This can be affected by axonal loss, but more so with demyelination.\n\nThe NIH natural history study suggest rapid and irreversible decline in centric function early in life in patients with GAN. SNAPs are within the normal range early in life and then undergo a rapid reduction in SNAP amplitude around the age of symptom presentation. This graph depicts the median SNAP amplitude per age for the natural history population in the NIH study. The horizontal black line represents the lower limit of normal.\n\nAs you can see, the youngest chart on this graph is approximately two years of age and as a SNAP well within the normal range. As children reached the ages of three or four years, which is the usual age of symptom presentation, the SNAP deteriorates markedly. You may recall that the initial symptomatology in the three- to four-year old includes unsteadiness and a wide-based gate, reflecting the fact that they lose the ability to feel the ground beneath their feet. It is, therefore, unsurprising that the nerve conduction studies reflect this symptomatology.\n\nThe first green line depicts the fact that every patient with GAN has an abnormally low SNAP amplitude by the age of four years, reflective of compromised sensory neural function. The second green line indicates that 100% of patients have a fully absent snap by the age of nine years, which will be considered to be irreversible. Next slide. This image is the same data as the previous slide, but with a line of best fit added to demonstrate the rapid decline in SNAP attitude from normal to absent at an early age.\n\nNext slide. Of the patients treated in the efficacy dose onto the study, 42% or 5 of 12 patients had a positive SNAP past the age of nine years and of the last patient visit, which is remarkable considering that none of the natural history of patients had a positive snap past the age of nine years. The specific values for the five patients in question are shown in the graph on the right, where one of the patients demonstrated near-complete recovery and continued on an upward trajectory from a baseline of zero at the time of treatment. Next slide.\n\nMany of the patients who were dosed in the intervational trial had an absent SNAP response and would not be expected to recover. From this graph, you can see that 100% of patients treated with TSHA-120, who had a positive sensor response initially maintained a positive response after treatment rather than continuing to decline to zero as would normally be expected. Once SNAP reaches zero, sensory function is considered non-recoverable. Notably, 100% of these patients, which is three of three, have a positive value at baseline and maintained a positive SNAP at the last study visit.\n\nThe longest span is three years to date and the patients continue to maintain an upward trajectory. Next slide, please. These five graphs demonstrate individually plotted patient SNAP changes from baseline and importantly, includes the patient running data from the natural history study. There is continuing improvement in SNAP amplitude from either a declining snap or an absent snap.\n\nImportantly, and remarkably, two patients had a SNAP amplitude that had been absent for over a year in the natural history study and after dosing, demonstrated consistent and sustained improvement. This recovery of function in a neurophysiological measure that is definitive and consistent over time is contrary to natural history and exciting to see. Next slide. Earlier this year, we shared positive pathology data from nerve biopsies which confirmed the fat treatment with TSHA-120 can stimulate active regeneration of axons.\n\nWe now have the entire data set demonstrating 100% of TSHA-120 treated patients had regenerative nerve clusters present one year after treatment in the biopsies. Peripheral nerve biopsies were obtained at baseline and a one-year post gene therapy transfer and superficial and radial sensory nerve. Analysis of 11 evaluable samples completed to date, consistently demonstrates an increase in the number of regenerative clusters at year one compared to baseline. The remaining two samples were unable to be assessed due to biopsy limitations.\n\nCollectively, these data confirm the presence of regenerating node clusters, suggesting active regeneration of nerve fibers and improvement in disease pathology. This, coupled with the nerve conduction study data provides evidence that the peripheral nervous system can not only respond to treatment, but actually improve as opposed to just stabilize. Here, we have included a representative patient case study showing the superficial radial sensory nerve at baseline and one year post treatment with TSHA-120. At baseline on the left, the arrow identifies a giant degenerating Axon and the star identifies a regenerating cluster.\n\nOn the right is what the nerve looks like one year after treatment. The yellow arrows are indicating regenerative clusters, which as you can see, are notable in number. This pathology data and the neurophysiology are suggestive of recovery of neuronal tissue after administration of TSHA-120 and such endpoints, given their unbiased and definitive nature are often viewed favorably by regulatory agencies. Next slide.\n\nWe believe our GAN program includes a comprehensive set of evidence generated across diverse disease manifestations, supporting a robust clinical package. These include MFM32 motor function assessment of TSHA-120 treatment demonstrating clinically meaningful slowing of disease progression across all therapeutic dose cohorts compared to natural history decline with a durability of effect. Electrophysiologic nerve conduction studies provided definitive clinical endpoint and support recoverability, stabilization and, in some cases, improvement in sensory response in patients treated with TSHA-120. Nerve biopsy histopathology confirmed that treatment with TSHA-120 detected the presence of regenerative nerve clusters suggestive of active regeneration of nerve fibers.\n\nPathological biomarker measurements of rectal nerve fiber layer thickness as assessed by optical coherence tomography, demonstrated stabilization and prevention of the visual loss following TSHA-120 treatment. Visual acuity, as assessed by LogMAR also stabilized after treatment. And lastly, we heard from Fred earlier about how an extensive panel of release assays demonstrated that the clinical and commercial-grade material were comparable across key quality attributes and confirmed by next-generation sequencing. Next slide, please.\n\nNow let's review the MHRA regulatory feedback we have received to date for our GAN program and discuss how this feedback supports our continued regulatory discussions. We believe this initial feedback, coupled with the CMC comparability data that Fred discussed, positions us well to further advance TSHA-120 through regulatory approval. Next slide. A number of recent product approvals and positive regulatory opinions for therapies targeting rare CNS indications and indeed non-CNS gene therapies, especially in the context of unmet clinical need, points to flexibility in the current environment from a regulatory filing perspective.\n\nThis includes a number of agreements from regulatory agencies for the use of accelerated or conditional pathways to approval. Some examples include EliCell with treatment of cerebral leukodystrophy, or STARZ, the treatment of AADC deficiency, SRP-9001 for Duchenne muscular dystrophy and tofersen SOD1-ALS. Next slide. Our discussions with the MHRA have been collegial, collaborative and helpful.\n\nThe MHRA agreed with our commercial manufacturing and release testing strategy, including potency assays. They recommended dosing a few patients with commercial-grade material, which will be released in September 2022. And lastly, it was supportive of our proposal to perform validation work, including patient and family feedback, which is ongoing on the MFM32 as a key clinical endpoint. We believe this positive feedback from the MHRA in conjunction with the totality of preclinical data generated to date for TSHA-120 represents a robust package supporting additional discussions with regulatory agencies.\n\nWe expect additional regulatory feedback, including from the FDA by year-end. Next slide. We continue to work with regulatory agencies with the goal of achieving conditional approval in Europe and accelerated approval in the United States based on EMA and FDA industry guidance for gene therapies in neurodegenerative diseases. Based on key registrational requirements from regulatory agencies, including the FDA and EMA, we have outlined some possible scenarios for approval.\n\nWith the EMA, we believe there is potential to file for conditional approval based on current data set for EMA guidance documents. For the FDA, the first scenario was immediate filing for approval based on the current data set and comparability. Alternatively, we may need to dose a few more patients to demonstrate comparability of clinical effect between clinical and commercial-grade material, which is a similar approval pathway for Zolgensma in spinal muscular atrophy. The last scenario is to perform a new pivotal trial, which we think is unlikely, given the recently published FDA guidance document on gene therapies for neurodegenerative diseases and the extensive long-term safety and efficacy data set available.\n\nMHRA feedback further aligns us with scenario two, which is our base case. We expect to have additional regulatory guidance, including the FDA by year-end. As a reminder, TSHA-120 previously received orphan drug and rare pediatric disease designations from the FDA. Next slide.\n\nNow let's turn to the late-breaking preclinical data we reported today for TSHA-102 in Rett Syndrome. Next slide. As a reminder, Rett Syndrome is an X-linked neurodevelopmental disorder that is characterized by mutations in MECP2, a protein essential for neuronal and synaptic function in the brain. Female heterozygous patients with Rett syndrome on Mosaic carriers of normal and mutated MECP2.\n\nThe challenge in gene replacement therapy of MECP2 is finding the appropriate balance of sufficient physiological expression to correct the deficiency while also avoiding overexpression on the associated toxicity. The estimated prevalence of Rett Syndrome is 350,000 patients worldwide with an instance of 1 in 10,000 female births worldwide. Next slide. Because of this spectrum and risk of toxicity, development of a gene therapy for Rett Syndrome requires a regulated expression of MECP2.\n\nPrevious MECP2 gene therapy approaches, of course, dose-dependent side effects after intra-CSF administration in wild-type and Rett Syndrome knockout mice. We have developed a novel mRNA responsive target sequence called miRARE to regulate the expression of the MECP2 transgene and prevent the risk of overexpression toxicity. We believe our approach provides a superior therapeutic profile to that of unregulated MECP2 gene replacement. Next slide.\n\nTSHA-102 regulates expression of MECP2 is a novel microRNA responsive auto-regulatory element platform, known as miRARE that is exclusively licensed to Taysha developed by Dr. Sara Sinnott and Stephen Gray of UT Southwestern Medical Center. miRARE provides sophisticated regulation of transgene expression, genotypically on a cell-by-cell basis, ensuring controlled expression that avoids excessive levels. miRARE is a targeted panel for endogenous microRNAs, which regulate MECP2 expression.\n\nIn the presence of high levels of intracellular MECP2, endogenous down regulatory micro RNAs are secreted as part of the cell's normal feedback inhibitory process, which then bind the miRARE platform on the construct and reduce output and expression of MECP2 from the construct. This ensures that intracellular levels of MECP2 whether in a wild-type cell or a mutated cell and immune mosaic patient stay within appropriate physiological levels. Next slide. Today, we are excited to share near normalization of survival in neonatal mass bonds of Rett Syndrome following Taysha administration.\n\nSurvival was significantly extended in MECP2 knockout male mice following a single CSF injection after day two of TSHA-102 at 8.8 E10 VG per mouse, which is the human equivalent dose of 2.86 E14 total VG and a little lower than planned for the human clinical trial. Preliminary data demonstrated approximately 70% of the treated knockout males survived study conclusion at 34 weeks of age versus nine weeks in vehicle-treated mice. All cohorts, including vehicle were sacrificed to 34 weeks. Next slide.\n\nWe then looked at the Bird score, which is a composite measure of six different phenotypic abilities that relates to Rett syndrome. These include breathing, gate, general condition, high blend classing, mobility and treme. Over the course of the study, TSHA-102 appeared to normalized behavior, as assessed by the Bird score. Next slide.\n\nThe totality of preclinical data generates the date for TSHA-102 represents the most robust package supporting Rett syndrome clinical advancement for gene therapy. I've just reviewed the recent preclinical study in neonatal Rett knockout mice, demonstrating near normalization of survival, normalization of body weight and normalization of behavior as assessed by Bird score. We have previously discussed the pharmacology data demonstrating significant improvement in survival, body weight, motor function and respiratory health across treatment ages in knockout mouse models and while we were able to ascertain a minimally effective dose. We've also previously discussed toxicology data supporting a favorable safety profile of TSHA-102 in Sprague Dawley wild-type rats up to a six-month time point and the human equivalent doses fourfold over the clinical starting dose.\n\nThe nerve conduction studies performed remains the normal range for all groups at all time points, signifying no evidence of dose or ganglia inflammatory change. And lastly, toxicology data supporting TSHA-102 was well tolerated at human equivalent doses of up to two E15 total VG and demonstrated abroad by distribution to brain, spinal cord and systemically in non-human primates. Perhaps most importantly, the toxicology studies have demonstrated that the down regulatory miRARE platform is working well and that there was minimal expression of MECP2 in a wild-type cell with normal preexisting levels of MECP2. These four preclinical studies together represent a comprehensive and robust package supporting the clinical advancement of TSHA-102 for Rett syndrome.\n\nNext slide. Our first-in-human Phase 1/2 study of TSHA-102 for Rett syndrome, also known as the REVEAL study is ongoing. Centas you've seen a mother and child University Hospital Center in Montreal, Quebec, Canada is the initial clinical site for the study, which is under the direction of principal investigator, Dr. Elsa Rossinyol.\n\nTarget recruitment is up to 18 adult females. It has a 3+3 study design with three randomly selected delayed treatment control participants in each dose cohort, and each cohort may be expanded with up to three additional participants. Next slide. We look forward to preliminary Phase 1/2 clinical safety and efficacy data in adult females by year-end 2022.\n\nWe have completed GMP manufacturing for Rett using our commercial process. And lastly, a study of the pediatric female rep population and the rescue study in rep males are planned for 2023. As a reminder, TSHA-102 has been granted rare pediatric disease designation and orphan drug designation from the FDA and more recently orphan drug designation from the European Commission. With that, I'll turn the call over to Kamran to review our financial results.\n\nKamran?\n\nKamran Alam -- Chief Financial Officer\n\nThank you, Suyash. This morning, I will discuss key aspects of our financial results for the second quarter ended June 30, 2022. More details can be found in our Form 10-Q, which will be filed with the SEC shortly. Next slide.\n\nAs indicated in our press release today, research and development expenses were $23.1 million for the three months ended June 30, 2022, compared to $30.6 million for the three months ended June 30, 2021. The $7.5 million decrease was primarily attributable to a decrease of $3.8 million in third-party R&D primarily related to GLP toxicology studies, a decrease of $3.2 million in R&D manufacturing costs and lower employee compensation expenses of $0.5 million. General and administrative expenses were $9.9 million for the three months ended June 30, 2022, compared to $10.1 million for the three months ended June 30, 2021. The decrease of approximately $0.2 million was primarily attributable to a decrease of $1.1 million in professional fees related to market research, recruiting, accounting and patient advocacy activities.\n\nThis was partially offset by $0.9 million of incremental employee compensation expenses. Net loss for the three months ended June 30, 2022, with $33.9 million or $0.84 per share as compared to a net loss of $40.9 million or $1.09 per share for the three months ended June 30, 2021. As of June 30, 2022, the company had cash and cash equivalents of $66.2 million compared to $149.1 million on December 31, 2021. Taysha continues to expect that its current cash and cash equivalents in addition to full access to existing term loan facility, is sufficient to fund operating expenses into the fourth quarter of 2023.\n\nAnd with that, I will hand the call back to RA.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThanks, Kamran. We remain focused on achieving our anticipated near-term milestones in 2022 and building long-term value. Our programs in GAN and Rett syndrome continue to advance and demonstrate exciting disease-modifying potential as further supported by the new clinical nerve conduction data in GAN and neonatal preclinical data in Rett syndrome presented today. As we look ahead, we expect a regulatory update for our GAN program and preliminary Phase 1/2 data for TSHA-102 in adult females with Rett syndrome by year end.\n\nI will now ask the operator to begin our Q&A session. Operator?\n\nOperator\n\n[Operator instructions] And our first question comes from the line of Joon Lee with Truist Securities. Please proceed with your question.\n\nJoon Lee -- Truist Securities -- Analyst\n\nGood morning, thanks for taking the questions. My name is Joon. I'm just wondering, have there been any discussions with the FDA on regulatory lamina for 120, just thinking mostly in terms of the three scenarios that you've previously laid out on whether or not the FDA might have to redose patients with GMP material. Also, if such discussions have occurred, will the safety data be sufficient? Or has the FDA made or indicated additional need for efficacy biomarker or clinical data? Thank you.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nGood morning. Maybe I'll start and then I'll turn it over to Suyash to provide some additional insight. Where we guided you this morning was that we'll have some additional feedback from regulatory agencies, including the FDA by the end of the year. I think the regulatory feedback that we've noted from MHRA kind of aligns ourselves with what we consider scenario two, which is the need to dose additional patients using the commercial material.\n\nYou know, we kind of see that as our base case, and that's what we've been planning for. The good thing about that is the patients are already identified. They're currently in our natural history study. And what we would do is just roll over patients from the natural history study into the current ongoing trial.\n\nWe would do that once our GMP material is actually fully released, which should happen here in the next few weeks, which we're quite excited about. And the fact that, as we've noted on the call that the original clinical trial material and the new commercial grade material are virtually identical, as all key quality metrics. So I think when you look at all of those things in consideration, I think that lines up nicely for how we're planning to move forward, which we consider scenario two is probably the most likely case. That would be the need to dose a few more patients using the commercial material.\n\nI think ultimately, our discussion with the agencies will really be about how to accelerate whatever the potential filing would be. And I think the use of a rolling submission would be something that I think we would be more encouraged to ask the agencies about. I think this environment, what we're seeing from a regulatory perspective is a good environment, particularly for gene therapy and CNS therapy. The agency has shown significant flexibility.\n\nAnd I think we've listed off a number of those examples, both the FDA and EMA. So we feel pretty good about our approach. Keep in mind, we've now shown you data across multiple functional endpoints; We've now shown new data across pathological endpoints; We've now shown you data across definitive endpoints that include that, again, our hard endpoints, right, that don't include any type of proceeds bias. So with all of that totality of data, coupled with the comparability data that we now have in hand, we feel pretty good about our discussions moving forward with the agencies.\n\nSo I'll pause there to Suyash -- Suyash, do you have anything to add or we could move on?\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nI think you said it all, all right.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nPerfect.\n\nJoon Lee -- Truist Securities -- Analyst\n\nThank you, and then if I could just ask the yield of the 50 doses that you've already manufactured, will that support the highest dose that was tested in clinical trials for all 50 of the doses that are ready to go? Thank you.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThe answer to that is yes. That 50 doses at the high dose, which is 3.5 E to the 14.\n\nOperator\n\nAnd our next question comes from the line of Gil Blum with Needham & Company. Please proceed with your question.\n\nGil Blum -- Needham and Company -- Analyst\n\nSo just a question to clarify and make sure that I fully understand this. The additional regulatory feedback that we will be getting by year-end 2022, is this a change from previous estimates?\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nSo thanks, Gil, for the question and good morning. So our previous guidance was that we would have regulatory feedback by year end. We didn't disclose from what agency we would have that feedback from. So essentially, the feedback that we provided on the call today is in line with our previous guidance.\n\nWhat we've decided to do because of the success of our commercial-grade manufacturing line and the comparability data that we've generated from that, including potency assays, including release assays as well as the additional clinical trial data that we showed you guys today. What we decided to do was essentially hold the submission to the FDA until we had a fully robust baked CMC package. We now have that. I think you would probably consider that package extremely comprehensive again, across all the clinical endpoints that we've shown you.\n\nBut more importantly, I think the CMC data, which is really where I think the crux of the conversation was going to be. The fact that we're seeing virtually identical material across a number of key attributes, including next-generation sequencing, I think it's going to be extremely compelling to the agency. So we wanted to make sure we actually had that data in hand as the manufacturing run got underway, and we saw the progress that it was making and the good progress that it was making, we decided to hold that. And so now we'll be submitting that full data package to additional regulatory agencies including the FDA.\n\nAnd so we expect that to provide the FDA the information to be able to provide clear guidance around what the registration pathway would look like. And for us, we think that aligns with probably most likely scenario two. The use of the accelerated pathway, but the need to dose a few patients using that material, which is actually released in September. So this all lines up nicely and it's pretty consistent with what we said when we talk about what a potential launch date could be.\n\nGil Blum -- Needham and Company -- Analyst\n\nOK. And maybe a question on SNAP. How it's established was SNAP as a surrogate endpoint for function and GAN. I mean it is very -- it is remarkable to see something going from zero to something, but just to help us understand the functional benefits.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nNo, absolutely. Suyash, do you want to answer that, and I can provide some comments after?\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nSure. Yeah. Hi, Gil. I think that this is really the first ever time SNAP amplitude data, SNAP data in general has been presented or published for a large body of patients with GAN.\n\nAnd it is quite remarkable. It's quite -- what is notable here is the consistency of what you see in the natural history and how it mirrors clinical progress of these patients. You saw in the earlier image that around the age of two, the SNAPs are well within the normal range, and they rapidly decline from the age of about two and a half to three to the point where by the age of four every child has an abnormal SNAP. By the age of nine, everyone has an absent SNAP.\n\nAnd what I would say is that this kind of pattern is quite consistent with other axonal neuropathies, another similar hereditary centermost neuropathies where you do see the nerve conduction studies being affected quite dramatically. What I think is important with GAN is the fact that it really mirrors what's happening clinically and correlates very nicely. We've talked before about how patients with this disease generally is symptom free in the first few months of life. They may have slightly delayed motor milestones around the age of two, two and a half, these children present with on steadiness and a wide-based gate and a high staffing gate because they can't feel the ground beneath their feet.\n\nAnd this is exactly what these conduction studies are demonstrating. I think one point I will make is that what you're looking -- and I tried to get into this in the presentation, there are three frames you'll look out with a nerve conduction study -- amplitude, which is the height of the electrical deflection; Latency, which is how quickly the electrical stimulation takes to start; And velocity, which is the actual speed down the actual nerve. And neuro really in that earlier times were used in the demyelinating disorder multiple sclerosis, where you tended to see more effects on latency and more effects on velocity. However, for these axonal neuropathies, where you're losing axonal amplitude as the key parameter and you can see how it correlates very nice in the natural industry.\n\nBut more importantly, actually, clearly stabilizes or even improves -- and you're right to the fact that a handful of patients improved from zero and are still continuing on an upward trajectory -- is very impressive and is also reflected in what I shared in the biopsy data you saw an increasing presence of regenerating the clusters. Let me stop there. I could go on even longer, but let me stop there.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThe only thing that I would add -- and thanks, yes, the only thing that I would add to what Suyash mentioned is, I think it's important to note that Math is a definitive clinical endpoint. Essentially, it's a hard endpoint, and it's functional. And I think when you look at that in correlation of what Suyash mentioned around how it correlates to MFM32, how it correlates to biopsy data, how it correlates to the LogMAR data that we've shown before, I really start to think all these things are moving the exact same way. You really start to put together a really nice clinical package.\n\nAnd really, you have to look at the totality of the data set that's all moving the exact same way. So we feel really good about this. And again, having this data in hand allows us to just have even more robust engagement with regulatory agencies around the most accelerated pathway.\n\nGil Blum -- Needham and Company -- Analyst\n\nThank you. That was very helpful. And then last one on Rett. What would you need to dose male rescue study? That's -- the timing there seems pretty important.\n\nBut if you can and that --\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nIt's a really good question. Suyash, maybe you just want to comment on kind of the phenotype of the males and how they correlate to the knockout animal and then maybe go deeper into Gil's question.\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nSure. Yes. So the important thing here is that the males are knockouts. And for an X-linked disease, this means that they have no MECP2 whatsoever.\n\nIn contrast to the females where the females are mosaics and half of themselves have normal levels of P2 or the other half have mutated or absent that P2. And so in the clinical setting, the males actually are more severely affected. And the vast majority in the human situation actually die in uteri. A handful survive and lots of life through early infancy and may die in the first few months of life or sometimes to live up to the age of two or three.\n\nAnd then so come usually due to respiratory infection or some respiratory compromise. So it's a very, very severe form of Rett. And there aren't many of these patients, the male, knockout males that survived perhaps 200 in the world. So -- and they've also been a fairly, I guess, a forgotten group and the Rett patient community are actually very pleased that's part of our clinical development program, which, as we alluded to earlier in the call, we're starting in avals initially during the course of 2023, we'll start a pediatric girl study, and then we'll also do a pediatric boys study, a rescue study.\n\nAnd the Rett patient community are very happy that we're actually addressing this kind of underserved population. Specifically on your question around GoSkill, it's a really interesting question. On the one hand, there's an argument to go with a higher dose because these boys -- the high dose starting our pediatric -- our girls study, which is starting at five E14 total VG. And from our previous pharmacology mass oncology study, we ascertained the minimally effective dose was around three E14 total VG.\n\nSo we're actually going in above that for the five E14 total VG. There's not going to go slightly higher in the males, but actually, our time is to stop the same dose. That five E14 total VG and the pediatric boys study that I think will be quite significant in improving that phenotype. Likely, we will go to a second dose of a one E15 as well.\n\nGil Blum -- Needham and Company -- Analyst\n\nAll right. Thank you for taking our questions. Good luck. Thank you.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Salveen Richter with Goldman Sachs. Please proceed with your question.\n\nUnknown speaker\n\nHi. Thanks for taking our question and congrats on the progress. This is Tommy on for Salveen. We had a follow-up on the SNAP question.\n\nCould you help us gauge the expected consistency in SNAP across treated patients? For example, if there's characteristics at baseline that might impact the response after treatment. And on the MHRA feedback, how many patients do you think will need to be dosed with the commercial-grade material? And how does this affect the time line? Thank you.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThanks for the question. I'll turn it over to Suyash, maybe I'll provide some additional comments once he's done. Suyash?\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nSure. Yeah. I mean the stats, it's an interesting question. We -- it's hard to know exactly what characteristics of the patients would predict a good response.\n\nAnd it's also hard to know simply because there are not that many patient numbers that have been dosed to be able to ascertain that with that degree of accuracy. What I would say is that the suggestion it makes full sense is that the earlier you treat, the more likely you are to have a response, the younger patient you treat, the more likely you are to have a response. And also, I think importantly, and this makes perfect sense is that if you -- if you can treat before the SNAP is lost or is absent, you're more likely to see an improvement in the -- in this hard endpoint and more likely to see a functional improvement as well. Having said that, very surprisingly, and we were very pleased to see that in a number of patients who actually had an absence of that and an absence of that for a period of time, we actually saw improvements in the nerve conduction SNAP amplitude that continued on lower trajectory.\n\nWith regards to the MHRA, yes, we -- this is -- this was one of the questions that we talked about in detail. It was clear that they wanted us to dose more patients. And this is in line with our thesis of option two, i.e., a handful more patients with clinical trial material. We tried in our discussion, and it was a very collegial, fruitful, long, in-depth discussion across all aspects of the program.\n\nI mean there was over two hours, we talked about the preclinical data, the clinical data in depth. And there's a lot of in-depth discussion on the CMC piece as well. But they would not really be held to a specific number. They essentially said a handful of patients for a period of time for us to come back with a proposal.\n\nSo what we decided to do, and our previous thoughts have always been, it's probably going to be about two to five patients for about six months. So our thinking was less also continue with other agencies and also got the feedback from all agencies we've come up with a proposal on the specific number of patients. But my guess, as I say, is it's going to be around about three to five patients for about six months.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThank you for the question.\n\nOperator\n\nOur next question comes from the line of Mike Ulz with Morgan Stanley. Please proceed with your question.\n\nMike Ulz -- Morgan Stanley -- Analyst\n\nHey, guys. Thanks for taking the question. Just on GAN, you mentioned doing some additional validation work on the MSM32 endpoint. Can you just give us a sense of your plans there and maybe how long that validation work might take? Thanks.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThanks, Mike. One comment I'll make before I turn it over to Suyash is that, that validation work has actually been ongoing for quite some time. So we feel pretty good about the timeline there. And the fact that MFM32 has been used as a regulatorily accepted endpoint in a number of neuromuscular diseases.\n\nSo we also feel good about that there. The particular work on GAN, I'll turn it over to Suyash to discuss further.\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nSure. Thanks. And thanks for the question, Mike. So the -- RA's quite correct, MFM32 has actually validated the pediatric neuromuscular disease in general and has been used several times previously as in supporting evidence in regulatory discussions before.\n\nHaving said that, it's always best to do a formal validation as far as you can for the specific disease in question. So the plan has always been for us to formally validate the MFM32 for Giant Axonal Neuropathy. And we actually talked about this with the MHRA, and they were very open to and accepted and pleased that we've actually started this work. Now there are three pieces to this work.\n\nThe first is to any kind of validation work. The first is a general qualitative feedback that solicited from patients and families and clinicians and PTs and OTs in a structured interview setting. And that work has been completed. And actually, we're just in the process of writing up that work, and we'll be submitting that for publication.\n\nI'm guessing about six to eight weeks' time. So you'll be able to see that work in detail in the future. The second piece is to take all that information and run it through a specific -- there's a way of analyzing this qualitative semi-structured interview data, and this process is for content validation. So that'll be the next step.\n\nAnd then once we've done the content validation, there's another whole additional process to the psychometric validation where we take all the natural history study data, and we take all the data from the interventional study, looked at how the MFM correlates with other aspects of other endpoints, other aspects of the disease and also with the qualitative information that we picked up in the qualitative interviews and in the content validation piece, and then we do a formal sacramental validation. That will get risk numbers of package will usually publish this work and it will end up being quite a significant report that goes in with the actual BLA filing and other regulatory interactions. In terms of timing, the process, it can take -- it can usually take quite a long time, 12 to 18 months to do it properly. Having said that, because we have this large natural history study with 50 patients worth of data, all of them have done the MFM, this truncates the time line somewhat.\n\nSo it's probably going to be, I guess, a 9 to 12-month process from now.\n\nOperator\n\nOur next question comes from the line of Eun Yang with Jefferies. Please proceed with your question.\n\nEun Yang -- Jefferies -- Analyst\n\nThank you very much for squeezing me. I have one question and one -- another very quick question. So first question is for the Rett Syndrome data that we are expecting. You started the study in Canada probably only second quarter.\n\nHow many patient data are we going to be seeing? So that's question number one. And second question is kind of a quick question. So in the past, you consistently said that scenario number two is the most likely regulatory outcome. With that, you anticipated a potential launch by end of 2023 in the U.S.\n\nSo is this still on track? Thank you.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nGood morning, Eun, and thanks for the question. Maybe I'll take the question and if Suyash had anything to add, I'll turn it over to him. But on your first question, we typically haven't commented on how many patients worth of the data that we provide in any of our other indications or data update. So I think we're going to remain consistent with that operating procedure.\n\nWhat we will guide to is that you will have data in Rett Syndrome by the end of the year -- patient data in Rett Syndrome by the end of the year that we'll disclose to The Street. So we're staying consistent with that guidance. Your second question around kind of what we've got into in the past from a timing perspective, again, I think again, I think we're staying relatively consistent. I think the initial regulatory feedback that we've received aligns itself with scenario two.\n\nI think some of the recent discussions that have happened in other indications and other companies with both the FDA and the EMA, there's still a nice flexibility around the use of the accelerated approval pathway. I think the way that our comparability protocol has played itself out as well as the commercial yields or the yields that we've gotten from our commercial launch, all support this notion of being ready to file a BLA as soon as possible. And so ultimately, I think we're still on that same time period. I think what I've guided in the past is always by the end of 2023 or early 2024 from a commercial launch perspective, and I think we're still on that time period.\n\nUltimately this is going to be a discussion point for the regulators, but certainly the preclinical data is all completed. The majority of the preclinical data has been published for quite some time. We now have a strong CMC comparability package that basically shows that our material from the clinical trial and our commercial-grade material are virtually identical by a number of key attributes. And we now have significant clinical data across multiple functional pathological hard endpoints coupled with biopsy.\n\nI think when you look at that, it's probably one of the most robust packages from a rare disease perspective. And so we feel pretty good about it in the fact that all the data is moving the exact same way. So what I'll say is I think we're consistent with that timing. Previously I think I've always guided by the end of the year, the end of 2023 or early 2024.\n\nAnd so I think we're still within that time.\n\nOperator\n\nOur next question comes from the line of Jack Allen with Baird. Please proceed with your question.\n\nJack Allen -- Baird -- Analyst\n\nHi. Thank you so much for taking the questions, and congratulations on all the progress. Just two quick ones. One's really quite straightforward.\n\nI guess I'll start with that. Do you have a meeting with the FDA on the books for the second half of this year as you look to gain that guidance in GAN? And then I just wanted to ask on the SNAP results on GAN. Any comments you can make with regard to the doses those patients received and a dose-dependency you saw on the SNAP results would be great. Thank you so much.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nHey, Jack. Good morning, and thank you for your question. So to your first question, I don't think we would guide to whether we had a meeting or have a meeting on the books. I think what we are confirming is that we will have feedback from the FDA around the regulatory pathway by the end of the year.\n\nWe feel pretty good about that guidance. And I think that is not only the FDA, but that will be also other regulatory agencies. We would be able to provide a pretty robust update on that by the end of the year. So we're staying with that guidance.\n\nBut I do think the data that we've shown you guys this morning, more particularly the comparability data that Fred and his team have done a great job being able to generate, is really what the key outstanding question. I think, you know, probably more so from the analyst community, but also the fact that are you able to produce at commercial scale identical product in order to get those same clinical results? And again, I think the approach to that accreditation has just been phenomenal. And the team has done a great job in generating these results, not only across a bunch of key attributes, but also being able to confirm it by next-generation sequencing. And I think that's a very important point as well, that we're basically seeing identical product.\n\nI look back at the old Zolgensma pathway back in the day when we were having these similar discussions around the clinical trial material generated at Nationwide and then eventually what became the commercial material that was generated at the Libertyville facility. It literally was night and day. It was night and day to what we're actually seeing and what Fred's team has been able to do. So we feel pretty good about going into those meetings, having solved the big question.\n\nThat's always been the big question also around potency assay and Fred and his team along with Suyash and his team now generated a matrix of potency assays across again a number of key quality attributes that we feel extremely good about that are functional in nature and reproducible. And we've now finished that work in-house and have tech transferred that work out to a CRO. So again, everything is moving exactly the way that we'd like it in order to hit the timelines that I just laid out. So we feel pretty good about that.\n\nSo hopefully that answers your first question. Jack, could you repeat your second question?\n\nJack Allen -- Baird -- Analyst\n\nYep. Thank you so much for the call on the first question. That does a great job of answering that. The second question is really briefly, any comments you make around dose dependence of the SNAP result.\n\nI realize there's a limited cohort there, but I'd love to hear about what doses those patients received.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nNo, it's actually a really good question. Suyash, do you want to comment there?\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nSure. Yeah. It's essentially in keeping with what we saw across the other endpoints. So you'll recall there's four different dose cohorts in the study.\n\nThe initial dose, 3.5E13 is more of a safety dose that generally didn't show much efficacy. It was detectable, even though some families said that there's some qualitative improvements. Cohort two was a 1.2E14. Cohort three, 1.8E14.\n\nAnd cohort four was a 3.5E14 total VG. And those three upper doses are clustered quite close together. I think if we designed the study now, we would actually not have full dose cohorts and we would have -- or probably two dose cohorts. We'd have a bigger range between the two.\n\nAnd what I would say is that across all the endpoints, the data from those test scores two, three, and four were generally pretty comparable. And that was also true for the SNAP. We saw nothing for the very low dose cohort, but we saw improvements in the higher dose cohorts is a suggestion that you're teasing out a bit more of a dose response over the SNAP. There's a suggestion that the highest dose is getting a little bit more in the way of improvements on the amplitude than cohorts two or three.\n\nBut in general, cohorts two, three, and four all results in good improvements, both in SNAP and in the presence of regions with no clusters.\n\nOperator\n\nOur next question comes from the line of Yun Zhong with BTIG. Please proceed with your question.\n\nYun Zhong -- BTIG -- Analyst\n\nHi. Thank you very much for taking the question. So I wanted to confirm that the feedback that you received from MHRA does not change your confidence that you will be able to file based on available data when you talk to the EMA and also want to confirm that by year end when you provide feedback, would that feedback EMA feedback as well? Because EMA sometimes can be less flexible in terms of clinical endpoint versus surrogate endpoint that you talked on the call. Thank you very much.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThanks, Yun. Maybe I'll start and then I could turn it over to Suyash that could provide an update. I think from your second question, I think the EMA actually is a little bit -- I think it may be opposite of your assessment. They've actually shown quite a bit of flexibility, particularly around the use of their conditional approval pathway as well as this notion around the totality of data.\n\nWhat I would also say is the fact that there's no surrogate endpoints here. I think what's interesting is we have multiple functional endpoints. We have now shown you guys a definitive hard endpoint. We now have shown you guys data around visual acuity and the stabilization of visual acuity, the stabilization in the loss of retinal nerve fiber thickness.\n\nWe've now shown you guys biopsy data that correlates to all the functional outcomes. And couple that with again, the comparability data that we've laid out. So we feel pretty good about going into those discussions with a very robust package. And just on top of that, I think most important, the safety across let's call it seven years.\n\nThis was the first intrathecally dosed gene therapy trial in history. So we now have seven years' worth of safety data. And the safety has been consistent. And this drug seems to be extremely well tolerated in the clinical setting.\n\nAnd so for us, we feel again, really, really good about it. I think to your first question around will that update by the end of the year include feedback specifically from the EMA, what I will say is we will have feedback from multiple regulatory agencies, including the FDA, by the end of the year. We do plan to engage the EMA within that time period as well. Yun, did that answer your question?\n\nYun Zhong -- BTIG -- Analyst\n\nYes, it did. Thank you very much.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nOK. Perfect. Thank you.\n\nOperator\n\nOur next question comes from the line of Sami Corwin with William Blair. Please proceed with your question.\n\nSami Corwin -- William Blair -- Analyst\n\nHi, guys. Congrats on the progress, and thanks for taking my question. Do you think these additional patients you're going to dose -- if the additional GAN patients you're going to dose will also satisfy the FDA if they wanted additional patients just as clinical material? And then can you just broadly speak about how dosing in the Rett trial is going?\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nSo to answer your second question first, we typically don't guide around first patient dosed or ongoing dosing of patients. We just remain consistent with that and just reiterate the guidance that you will have preliminary clinical data -- patient data by the end of the year. In Rett, we're pretty confident with that. I think most important was the late-breaking pre-clinical data that we showed you guys today, which just, in my opinion, was extremely remarkable in a disease like Rett and in extremely severe mouse model, which is the male knockout model where we saw near normalization of survival and actually never got to a median survival throughout the life of -- throughout the conduct of the study was just extremely encouraging and for me just reinforces the need to keep moving this program forward quickly, but also the ability to be able to get down into that pediatric growth population, which are the most affected patients, but also those pediatric boys, that the fact that we're able to see the results not only consistent from a survival perspective, but also from a behavior being able to normalize behavior as assessed by the Bird score, being able to normalize body weight.\n\nI think taking that data and the neonatal model also correlates to what we've shown you from that large pharmacology study that we presented. We presented this data at ASCPT where, again, we saw improvement in survival, motor function, behavior, but also respiratory function, which was quite remarkable. So for us, we think that again, the totality of data, both efficacy and safety with this program put this program in rarefied air to be quite honest and just really encourages us to move quickly in order to get to those pediatric girls as well as that rescue boy study and to do it urgently for patients. So that's the -- that's our question on Rett.\n\nAnd could you just repeat your question on GAN?\n\nSami Corwin -- William Blair -- Analyst\n\nYeah. Do you think these additional GAN patients you plan on dosing in September once the clinical trial material -- or sorry, once the commercial materials release, do you think that quantity of patients and duration of follow-up will also satisfy the FDA if they wanted additional patients dosed?\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nSure. I'll start and I'll let Suyash take over. I think that's exactly what our plan calls for, is alignment around patient numbers. I think what we had always planned to do was to proactively dose patients, right? As soon as the commercial material is available, which should be here in the next few weeks, we expect this material to be fully released with all the comparability work completed.\n\nWe plan on initiating patient dosing where these patients are essentially already identified. We've had a protocol amendment that went through about four or five months ago, if not longer, that allows us to dose down to age three to actually start dosing younger patients. So it's always been our intent to continue dosing patients, but I would say to get alignment between all regulatory agencies, particularly around the number, but also the duration I think is extremely important. But I think consistent with what these agencies have shown recently, which again, gives us a high degree of confidence, I think the plan that Suyash laid out, which is what we are internally planning for three to five patients for about six months of follow-up, I think should be sufficient.\n\nBut again, we really do need to have that conversation with regulators. I'll stop there. Suyash, do you have anything to add?\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nNot really to add, but just to emphasize the fact that we'll look at all the regulatory agency feedback in totality and conduct the study on an ongoing basis in order to meet all the needs. And my guess is, yes, it'll be three to five patients, six months' worth of data. And that should meet the needs of the MHRA, the EMA, the FDA, and any other agency we're in discussions with.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThe only thing that I would add to Suyash's point is that, again, this timing is consistent with what we've kind of laid out. I think what the big piece and what the seminal ask for us will be is the fact that if we can initiate a rolling submission because again the CMC data, the comparability, the probability data is kind of all completed, the potency assay is completed, that work is being transferred right now. When you start to think about the majority of the clinical data, it's been ongoing for seven years and both from a safety and efficacy perspective across multiple endpoints. Natural history data has been ongoing for two years before that.\n\nRight? So we're approaching almost ten years of natural history data. So it's a big wealth of data. It's a big wealth of data in a relatively small population, which I think we are quite encouraged about. But certainly, the FDA needs some time and other agencies will need some time to go through it.\n\nSo we feel really strongly about this approach around a rolling submission in the use of an accelerated pathway. So that ultimately going to be our act.\n\nOperator\n\nAnd our last question comes from the line of Kristen Kluska with Cantor Fitzgerald. Please proceed with your question.\n\nUnknown speaker\n\nGood morning. This is Rick on for Kristen. Thank you for taking our question. Just a question on the individual patient SNAP data.\n\nIt looks like patient A appeared to show little change from baseline. Could you talk about how you're thinking about the specific case and what it might be telling us potentially about baseline characteristics or time of dosing? Thanks.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThanks for the question. I think what's probably more important is how you relate this toward the natural history and the fact that this patient actually had a positive SNAP three years after dosing, which I think is extremely important. When you look at -- when you contrast this with natural history, virtually every patient in the natural history cohort at this particular time point and this would be consistent with patient A would have zero SNAP. So the fact that we're actually seeing stability in a positive response is extremely remarkable.\n\nSo what I would say is it's a small dataset, but even with patient A doing stability in a positive way that's durable is extremely important, particularly in the context of a relentlessly progressive neurodegenerative disease, essentially. So this is consistent with what we're seeing in the biopsies. But this is in total contrast to what you would see in the natural history. I'll pause there.\n\nSuyash, do you have anything to add?\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nI hear what you're saying. I mean, patient A on its own is actually what we were hoping to see. We would have been very pleased if all patients stabilized because this is a child. If you look at that based on what the dose there, that scores about six microvolts and that is well below the normal limit and is from the actual history data is on a very rapid downward trajectory.\n\nSo that's that would have disappeared probably six months after that time of dosing if they hadn't been dosed. And we saw stabilization. And that's what we're hoping to see. The only reason it doesn't look so good is because the other patients are actually still so much better.\n\nSo, yeah, we were happy with that. We were very happy with our patients' performance, especially in comparison to the natural history, but simply because most of the other patients did significantly better. And once again, just to emphasize the fact that to go from a zero SNAP, if you look at patient B and you look at patient D, those patients have zero SNAP amplitude for well over a year. And for them to improve and for patient B in particular to be close to normal of the three and a half year time period, I'm still on an upward trajectory is really very significant and you would not expect to see this in a neurodegenerative disease that it's probably better.\n\nOperator\n\nAnd we have reached the end of the question-and-answer session. I'll now turn the call back over to Mr. RA Session for closing remarks.\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nThank you, operator. And again, I think we've been quite excited about the progress that the company has made across our core programs in Giant Axonal Neuropathy, Rett Syndrome. I think we will remain focused on these two key programs, moving these programs forward, particularly in the case of TSHA-120 GAN toward an accelerated regulatory pathway. We'll provide guidance and feedback from regulatory agencies by the end of the year, including from the FDA.\n\nBut we're quite excited with the data that we've shown you guys today. I think, again, for us, this allows us the opportunity to have the most robust package and robust discussion with these agencies really around the totality of the data set that all is moving the exact same way. I think the data that our CMC group, led by Fred Porter, our chief technical officer, presented today again shows the fact that we're getting almost virtually indistinguishable drug from our clinical trial material to our commercial scalable process. Again, continue to support this notion around like-for-like material.\n\nAnd then turning to our Rett Syndrome program, we feel extremely encouraged by the late-breaking preclinical data that we've shown you guys today, which is showing near normalization of survival in a very severe mouse model. And again, we look forward to reporting preliminary clinical data by the end of the year from our ongoing Phase 1 last two studies. So I wish you guys a wonderful rest of the week, a wonderful day, and we look forward to connecting here in the near future.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKimberly Lee -- Chief Corporates Affair Officer\n\nRA Session -- President, Founder, and Chief Executive Officer\n\nFred Porter -- Chief Technology Officer\n\nSuyash Prasad -- Chief Medical Officer and Head of Research and Development\n\nKamran Alam -- Chief Financial Officer\n\nJoon Lee -- Truist Securities -- Analyst\n\nGil Blum -- Needham and Company -- Analyst\n\nUnknown speaker\n\nMike Ulz -- Morgan Stanley -- Analyst\n\nEun Yang -- Jefferies -- Analyst\n\nJack Allen -- Baird -- Analyst\n\nYun Zhong -- BTIG -- Analyst\n\nSami Corwin -- William Blair -- Analyst\n\nMore TSHA analysis\n\nAll earnings call transcripts"
}