{
  "companyName": "Nikola Corporation",
  "companyTicker": "NKLA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/nikola-corporation-nkla-q3-2022-earnings-call-tran/",
  "content": "Nikola Corporation (NKLA -9.62%)\nQ3 2022 Earnings Call\nNov 03, 2022, 9:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Nikola Corporation's third quarter 2022 earnings call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce Nikola's director of investor relations, Henry Kwon. Thank you.\n\nHenry, you may begin.\n\nHenry Kwon -- Director, Investor Relations\n\nThank you, operator, and good morning, everyone. Welcome to Nikola Corporation's third quarter 2022 earnings call. With me today are Mark Russell, chief executive officer; Michael Lohscheller, president of Nikola; and Kim Brady, chief financial officer. The press release detailing our financial results was distributed shortly after 6 a.m.\n\nPacific Time this morning. The release can be found on the Investor Relations section of the company's website along with presentation slides accompanying today's call. Today's discussions include references to non-GAAP measures. These measures are reconciled to the most comparable U.S.\n\nGAAP measures and can be found at the end of the Q3 earnings press release we issued today. Today's discussions also include forward-looking statements about our future expectations and plans. Actual results may differ materially from those stated and factors that could cause actual results to differ are also explained at the end of today's earnings press release and on Page 2 of our earnings presentation. Forward-looking statements speak only as of the date on which they are made.\n\nYou are cautioned not to put undue reliance on forward-looking statements. We will now begin a brief video presentation followed by prepared remarks from Mark Russell, Michael Lohscheller, and Kim Brady.\n\nMark Russell -- Chief Executive Officer\n\nGood morning, and thanks for joining the call. What an incredible journey we're on. Most of you know that we announced my retirement earlier this year. Having been involved with Nikola either as an investor or as an executive from the beginning, I've been reflecting on the extraordinary challenges we've experienced and the truly amazing things we've accomplished over the years.\n\nI'm so grateful that I've been part of it all, and so thankful for the privilege of being part of this team. Nikola is an awesome team of truly incredible individuals, world-class people who are dedicated in their careers to pioneering sustainable zero-emission commercial transportation. These are the people that give me the confidence to be stepping back. In fact, since we announced this transition things have gone so well that we are handing the reins over early, and Michael Lohscheller will become CEO effective today.\n\nThat said, I won't be going very far. I'm still one of Nikola's largest shareholders, and I'll remain on Nikola's board. I'll continue to do my best to support this team, and our strategy in every way I can, but it is with deep confidence that I now hand the balance of this call and the CEO's baton over to Michael Lohscheller, who has been prepared over the course of his extraordinary and diverse career to now lead Nikola to the next level. Michael?\n\nMichael Lohscheller -- President\n\nThank you, Mark, and good morning, everyone. Thanks for joining us on this call. I am honored to succeed Mark Russell as CEO at Nikola and to drive forward the company's mission. Under Mark's leadership, Nikola has achieved many significant milestones and we look forward to his continued guidance as a member of our board.\n\nAs I assume my new role as CEO at Nikola, I would like to share some thoughts on both immediate and long-term strategic goals and objectives. First, I will discuss my views on our immediate objectives and how we are tracking them. Then I will discuss how meeting our immediate objectives will set us up for our long-term aspirations. Kim will also address in greater detail additional current challenges in the commercial space.\n\nIn production and manufacturing, we have made tremendous progress in increasing our daily production. Supply chain management has seen lots of improvements in the past quarter. We shifted from air freight to ocean freight on imported components. We localized purchases of many critical components during the quarter.\n\nWe also started to diversify our supplier base. The results are beginning to show on our P&L, which Kim will discuss later in detail. In R&D, we are making good progress in our fuel cell truck development. This quarter, we started to produce the beta builds of our fuel cell trucks.\n\nThe betas contain a number of improvements over the alphas based on customer input. From winter testing of the alphas, we have improved water management in our fuel cell and exhaust systems. We also improved the range efficiency and torque of the betas. So I believe we are on a good path in R&D supply chain management and production systems.\n\nWhere we can improve is on the commercial side of the business. It's clear that there are macro headwinds right now that at some point will turn into macro tailwinds. We must take proactive steps to make sure that we have a commercial program in place that will allow us to fully benefit when the market dynamics become more favorable. I believe we can achieve this by increasing our dedicated sales efforts to better understand our customers and their needs.\n\nWe need to become less dependent on dealers and instead lead them in our commercial management. To improve our distribution, we hired eight additional staff in Q3. We will continue to intensify our dedicated sales coverage in the coming quarters and believe this will strengthen us for the fuel sales truck market, where we anticipate greater growth opportunities will be in the future. This short and medium-term execution will lead us to our long-term aspirations.\n\nOur long-term strategic focus will be on growing our global presence in the hydrogen supply and infrastructure business. Our fuel cell trucks will enable us to accelerate the transition to clean energy, and we have made some important decisions on this front. As one of my first actions since becoming Nikola's president, I appointed Carey Mendes as president of Nikola's energy business. Carey has more than 20 years of operational experience in the energy industry.\n\nHe spent 12 years at BP, where he played a key role in growing BP's Renewable Energy business. Since his appointment, Carey has begun to oversee all aspects of our energy business in Nikola. I'm also very excited to share with you that in the beginning of October, we announced the appointment of Andrew Vesey to our board of directors. This signals another step toward executing our long-term goals.\n\nAndrew joins us with over 40 years of experience in the energy industry. He has been focused on the acceleration of a decarbonized energy future and we are confident that his knowledge and insight will help us to execute on our strategy as we move forward. We closed on the Arizona production hub land purchase on September 30th. And now we are making progress on the permitting and zoning requirements.\n\nWe have also made good progress on ordering electrolyzers and liquefaction equipment. Our hydrogen infrastructure will support our track customers after we launch our fuel-cell tracks in the second half of 2023. And this infrastructure will also help support third-party demand. The Arizona hydrogen production hubs planned initial capacity will be 30 tons per day and expand 150 tons per day once completed.\n\nBy 2026, we are targeting to achieve at least 300 tons of hydrogen supply with 50 to 60 fueling stations nationwide. We are making progress on hydrogen refueling stations and building on our announcement last quarter of three locations. We also announced our collaboration with E.ON to form a joint venture. The joint venture will provide hydrogen supply and refueling infrastructure for our fuel-cell trucks in Europe.\n\nAs you may know, E.ON is one of Europe's largest operators of energy networks and energy infrastructure, and we look forward to bringing an integrated mobility solution to our customers. We signed a term sheet with E.ON to solidify the collaboration and we are currently working to finalize the terms. Our European strategy will build on the asset-light partnership approach that we began in the U.S. with our U.S.\n\nstrategic partners. As you saw in the video, our fuel cell trucks generated strong interest from potential customers at the IAA in Hannover, Germany in September. IAA is the largest and the most important transportation and logistics show in the world. And together with our European partner in IVECO, we presented the European Tre BEV and FCV beta on the Nikola and IVECO stand.\n\nThe incredible level of interest for our fuel cell trucks, once again validated our conviction on the critical role that Nikola plays in the global transition to a hydrogen economy. In this transition, we believe that our future trucks will stimulate demand for hydrogen and help accelerate the rate of hydrogen adoption in the greater economy. I'll now share a few opportunities that we are well-positioned to capitalize on. The recently passed Inflation Reduction Act in the U.S.\n\nprovides a number of benefits to Nikola and these will be additive as our business plans were created without assuming them. In Europe, the European Parliament Transport and Tourism Committee has recently agreed to target one hydrogen refueling station per 100 kilometers along the Trans-European Transport Network core and comprehensive network by 2028. This new target is more ambitious than the original proposal, which had cost for one refueling station every 150 kilometers. The European Union's regulatory development will play an important role in speeding up hydrogen deployment there and provide Nikola with significant opportunities to replicate our U.S.\n\nstrategy in Europe. Onto some details of what we have done on the vehicle front in Q3 now. On future vehicles, our TTSI pilot testing, which began in June has locked over 9700 miles to date. We began pilot testing with Walmart in August, and it has locked over 5500 miles to date.\n\nIn Q3, we produce six beta trucks and expect to produce 17 beta trucks for the full year by the end of Q4. On our TRE BEVs, we produced a total of 75 trucks in Coolidge during Q3 and delivered 63 to our dealers. We began pilot testing the TRE BEV with SAIA in August, and to date, the trucks have locked over 1600 miles. We also began pilot testing the TRE BEV with Walmart in September, and the trucks have also locked over 2700 miles to date.\n\nWe are also very excited to share that we received a purchase order of 100 Tre BEV from Zeem Solutions, a leading provider of zero-emission EV fleet-as-a-service provider, yesterday. The trucks will be delivered in 2023. We are still on track to complete Phase 2 of our Coolidge, Arizona manufacturing facility by the end of Q1 2023. The nameplate capacity of our Coolidge plant when Phase 2 is completed will be approximately 20,000 units a year.\n\nThe facility will be capable of assembling both baths and fuel cells on the same line. We also plan to establish a line for the assembly of our Bosch fuel cell power modules. Regarding Phase 3 of our Coolidge expansion front, after assessing the macro uncertainties in the market, we have taken another look at our previous assumption on scaling in Q4 2022 and fiscal year 2023. As we discussed during our second-quarter earnings call, we can now confirm that we are deferring our Phase 3 Coolidge expansion plan to 2024.\n\nKim will provide details on the numbers. And with that, I will hand it over to Kim.\n\nKim Brady -- Chief Financial Officer\n\nThanks, Michael, and good morning, everyone. Let me begin with the financial overview for the third quarter. Our Q3 revenues were in line with our expectations, and our gross loss was less than expected. In Q3, we reported revenues of $24.2 million on deliveries of 63 Tre BEVs and one MCT compared to deliveries of 48 Tre BEVs and four MCT in Q2.\n\nCost of revenues came in at $54.4 million resulting in a gross loss of $30.2 million with a negative 124% gross margin in Q3 from negative 161% in Q2. Gross margin came in significantly better than our guidance of negative 240% to negative 250%. The gross loss improvement of 37% from Q2 is driven by lower material overhead expenses and improved overhead cost absorption on higher revenues during the quarter. Our material overhead expenses, which consist mainly of inbound inventory freight and duty, came in favorable as our dependence on air freight as a percentage of total freight came down to 33% in Q3 from 84% in Q2.\n\nWe should also mention one item regarding our cost of sales in Q3. As we shared in our Q2 earnings call, our acquisition of Romeo Power involved providing up to $20 million in a temporary price increase for each battery pack delivered through transaction close. This amount came to $11.9 million in Q3. This pack price increase was not recognized as a part of our cost of revenues for the quarter but was capitalized in prepaid expenses and other churn assets on the balance sheet as a part of future purchase price consideration.\n\nHad this amount been recognized on the P&L, our Q3 gross margin would have been about negative 174%. We will share more on Romeo's impact on our cost structure later in the call when we discuss Q4 guidance. At the SG&A level, the most significant cost driver during Q3 was the change in our management compensation structure. On August 15, our board of directors approved an amendment, the executive employment agreements with our C-suite executives.\n\nUnder the new scheme, each of the affected executives had existing market-based stock awards with stock price milestones of $40 and $55 canceled, and the performance period applicable to the shares with a $25 stock price milestone was extended by 12 months from June 3, 23 to June 3, 24. Under U.S. GAAP, if a market-based stock award is canceled without the concurrent grant or offer of a replacement award, the cancellation is treated as a stock repurchase for no consideration. We recognize 55.8 million in market-based RSO awards for the cancellation of the $40 and $55 tranches for all executives representing the remaining unamortized expense of these awards as of the cancellation date.\n\nQ3 EBITDA came to negative $221.7 million and adjusted EBITDA came to negative $105.9 million. Equity in net loss of affiliates came to $2.0 million in Q3 for $1.3 million in Q2. The loss was driven by net losses at Nikola's IVECO Europe JV due to the expanded scope of the JV's product development and vehicle engineering activities that we refer to in our Q2 earnings call. Our net loss for Q3 was $236.2 million, and the loss per share came to negative $0.54 on a GAAP basis and negative $0.28 on a non-GAAP basis on the balance sheet.\n\nWe ended the third quarter with $403.8 million in cash and restricted cash from $529.2 million at the end of Q2. Regarding available liquidity, our existing ELOC facilities with Tumim remain at $312.5 million. We also have entered into an equity distribution agreement or at the market facility where Nikola may offer and sell up to 400 million of common stock. We received approximately $100.5 million of gross proceeds under the ATM during the quarter.\n\nIf we consider cash, E-Lock, and ATM, our total access to liquidity stood at $1.01 billion as of the end of Q3, representing an improvement from $841.8 million at the end of Q2. We believe this liquidity excess is more than sufficient to cover our spending and positions as well for the following 12 months. Next, we want to turn your attention to our working capital as we have now completed two quarters of Tre BEVs deliveries. Our accounts receivable in Q3 came to $37.7 million from $16.7 million at the end of Q2.\n\nOur inventory increase from $52.1 million in Q2 to $81.1 million at the end of Q3 driven by purchases of components and raw materials to support Tre BEV production in Q4, 2022 and 2023. Our typical vendor payment terms to our vendors range from 30 to 45 days. Together with our dealers, we are working to reduce the number of days in our payment terms on future deliveries to minimize the working capital impact. As we aim to achieve a target of keeping 12 months of liquidity on hand at the end of each quarter, we will continue to seek the right opportunities to replenish liquidity on an ongoing basis while trying to minimize dilution to our shareholders.\n\nWe are also considering how we can potentially reduce spending without compromising our critical programs for 2023. Regarding the Romeo merger update, we completed our exchange offer to purchase all outstanding common shares of Romeo and subsequent acquisition. The transaction closed on October 14th, and Romeo is now a sub-assembly plant for Coolidge. We are currently focused on post-acquisition integration, including manufacturing line optimization and productivity improvements, addressing customer contracts, and aggressively reducing BOM enclosure costs and non-personnel cost.\n\nWe anticipate recording noncash impairment charges on Romeo's assets as of September 30, 2022, currently estimated in the range of 0 to $75 million. These such potential charges would decrease the amount of Nikola's bargain purchase price gain on the acquisition, which was previously estimated as $83 million based on Q2 pro forma financials. The actual amount of the impairment charge and its effect on any bargain purchase price gain is an estimate only at this point and not fully known at this time and will be based on financial purchase price counting reflected in Q4 financial statements. Moving on to Q4 and fiscal year 2022 full-year guidance.\n\nAs an early disruptor in zero-emission BEV trucks, we've learned many lessons this year. In the second and third quarters, we delivered 111 trucks to dealers and while we are pleased with our progress on truck production and interest from our end customers, we will be unable to deliver 300 trucks to dealers by the end of 2022. We would like to share some of our observations and the reasons why we are revising our fiscal year 2022 delivery guidance. First, as discussed on the Q2 earnings call, while our Mobile Charging Trailers and E-Skids can help customers get started on electrification, continue to scale up to fleet-level charging infrastructure, remains a hurdle and often involves a lengthy process which usually requires regulatory approval and support from the local power provider and municipality.\n\nThis is further impacted by uncertainties over macroeconomic conditions, resulting in end customers reluctant to make significant capital investments in the necessary charging infrastructure. We anticipate these headwinds will continue to be a significant limiting factor in the customer uptake rate for Tre BEVs, especially for the remainder of this year and likely to 2023. This dynamic appears to be more about customer investments in charging infrastructure, timing, and less about their willingness to transition to zero-emission trucks. Second, the Q4 gross margin will deteriorate from Q3 once we start consolidating Romeo Power into our financials.\n\nWhen we announced the acquisition on August 1, we summarized the potential long-term benefits from the merger to be approximately 30% cost reduction in non-sale related battery pack cost by the end of 2023. However, our BOM cost for the battery pack enclosures will increase temporarily for the next five quarters as Romeo Power was subsidizing Nikola's battery packs by approximately $110,000 per truck. We are converting from machine battery pack enclosures to casted enclosures, which we expect to lower the BOM cost significantly. This requires validation and testing once the first article is produced.\n\nThis effectively means we will not see the benefits of significant battery pack cost savings until the end of 2023. But we have a clear line of sight and when our cost savings initiatives are complete, we expect battery pack cost to drop by at least $110,000 per truck. Third, at this point, the Tre BEV truck cost per unit is meaningfully higher than the average selling price per unit. This is expected for a new technology product and an early stage of adoption.\n\nAs we continue to scale our business, we anticipate production costs to decrease. However, in light of current macroeconomic conditions, we are evaluating the rate of scaling production in Q4 2022 and 2023 to minimize a situation where the more Tre BEV trucks we sell, the greater the gross loss in the short term. Ultimately, we need to scale at the right level to further decrease Tre BEV truck costs per unit and achieve greater operating leverage in direct and indirect labor and manufacturing overhead. With that backdrop, our Q4 consolidated financials will include Romeo's cost structure.\n\nThroughout Q4 and 2023, we plan to include supplemental information in our earnings deck to provide visibility to the ongoing cost structure of Romeo's operation. We plan to produce approximately 120 to 170 trucks in Q4 as we currently hold enough inventory in Coolidge to meet that production target. Due to a high level of uncertainty surrounding the timing of our Q4 delivery, we've decided not to provide volume or revenue guidance. However, whatever we produce in Q4, we believe we will be able to recognize as revenue in Q4 and 2023.\n\nWe anticipate our gross margin being between negative 240% and negative 280%. R&D Expenses should be in the range of $82.5 million to $87.5 million, including approximately $5 million for Romeo. And SG&A expenses will likely be in the range of $85 million to $90 million, including approximately $25.5 million per Romeo. The stock-based compensation will be roughly $58 million, including approximately $16 million for Romeo due to the acceleration of RSUs and PSUs as part of the merger agreement for former executive officers.\n\nCapex for Q4 should be in the range of $30 million to $40 million. Michael mentioned that the nameplate building capacity of Coolidge is about 20,000 units per year, including BEV and fuel cell electric vehicle. Upon completion of phase two in first quarter 2023, this capacity should be sufficient to achieve our internal production targets for 2023, 2024, and 2025, which we have yet to disclose. Accordingly, we can confirm that Phase 3 build-out will be deferred, reducing our anticipated cash burn by $345 million in 2023.\n\nFurthermore, as we adjust to the current macro environment of inflation, rising interest rates, and increased commodity prices, we made the difficult decision to reduce headcount by 7% this month or approximately 100 employees. I, along with the full management team, express our gratitude to these impacted individuals, and are working hard to support them through this transition. Though it was not easy, this decision allows us to better align our headcount with strategic priorities that will improve productivity and reduce BOM with greater focus and discipline. Regarding 2023 expectations.\n\nAs previously alluded to, we are operating in a highly unusual and challenging environment, especially for early EV OEMs and H2 infrastructure providers. After carefully considering and weighing the above factors, we have determined that we are better off delivering fewer BEV trucks and preserving cash until the visibility becomes more apparent and the planned BOM cost savings are achieved in 2023. Accordingly, we are proactively reducing volume expectations for Tre BEV trucks in Q4, 2022, and 2023. We will provide you with more details on our 2023 projected BEV truck deliveries when we announce our fourth-quarter results.\n\nDuring this time, we will be prudent stewards of capital, while improving efficiency and negative gross margins. Furthermore, we are also looking to significantly reduce our opex and capex spending in 2023 by 20% to 30% from the 2022 level. To be clear, we are running at full speed to ensure the Tre FCEV truck schedule is not compromised, and we can achieve the start-up production in the second half of 2023. This concludes our prepared remarks.\n\nWe will use the remainder of the time to address your questions. But before we open the line to analyst questions, we would like to take this opportunity to answer some questions from our retail shareholders. Henry?\n\nHenry Kwon -- Director, Investor Relations\n\nThank you, Kim. The first question was combined from two separate questions asked by two investors that address what we feel are identical issues. When will Nikola's products be in production and when will Nikola start delivering the vehicles?\n\nMichael Lohscheller -- President\n\nWe began commercial deliveries of our Tre BEV to dealers in Q2. And customer deliveries of these electric trucks are currently being made by our dealers and have mainly gone to end customers in Southern California. To be clear, these are not demo deliveries, but trucks used by our customers in their day-to-day business in their fleets. These deliveries have been made for two quarters now.\n\nOn our fuel cell trucks, we are currently producing the beta version of our demo trucks and are on the schedule to make commercial deliveries to customers in the second half of 2023 in the U.S. and the first half of 2024 in Europe.\n\nHenry Kwon -- Director, Investor Relations\n\nThe next question is, is there any chance of salvaging the GM deal are striking a new deal with an existing auto manufacturer to start production of the Badger?\n\nMichael Lohscheller -- President\n\nUnderstandably, there is much confusion around the Badger since we never formally announced that we will be dropping it. To make it clear here, we are no longer developing the Badger because our commercial truck and energy infrastructure business is our strategic focus. As an early stage growth company, we cannot divert capital to the Badger, a light truck that aligns more with passenger vehicles.\n\nHenry Kwon -- Director, Investor Relations\n\nThe next question is, what is the plan for the company to get out of the red and instill confidence back in investors?\n\nKim Brady -- Chief Financial Officer\n\nAs discussed current macroeconomic headwinds create some uncertainty, which affects both our top-line growth and costs. We are working hard to increase sales to our end customers by strengthening our sales capabilities. We are also taking steps to reduce our BOM cost and cost burden at the cost of goods sold level by improving operating leverage as we scale. However, this will be challenging in an environment of high inflation and higher commodity since the end customers are reluctant to increase their costs.\n\nAccordingly, we cannot provide guidance on when we expect to reach profitability but we will share our thoughts with you as things stabilized in the coming quarters.\n\nHenry Kwon -- Director, Investor Relations\n\nThe next question is, investors need complete transparency after recent events involving the company. What is your plan to bring investors back on your side?\n\nKim Brady -- Chief Financial Officer\n\nWe are committed to open and transparent communications with all of our investors, this platform to ask questions being an example of their commitment. We aim to always communicate clearly about our progress and milestones and are receiving some positive feedback from investors. We have seen a significant increase in institutional investment owners' spin on our stock versus six quarters ago. So we see that as a positive trend.\n\nMarket conditions lie outside of our control, but we will continue to take steps to ensure that you are well-informed about our progress on a timely basis.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instructions] Thank you. Our first question is from Douglas Dutton with Evercore ISI.\n\nDouglas Dutton -- Evercore ISI -- Analyst\n\nJust curious if you have any more insight now that Romeo's acquired. What is the exit rate or one-half run rate in '23 that we should look out for deliveries?\n\nKim Brady -- Chief Financial Officer\n\nDoug, thanks for the question. As you know, we're making a very good progress. With Romeo, we're very much focused on post-acquisition integration. And we have been able to actually meet target and what Romeo committed prior to acquisition they have delivered.\n\nAnd so right now, we have the ability to manufacture approximately three trucks and have a capacity to increase that to five trucks. So we feel pleased in terms of targets and we expect additional manufacturing improvements, including greater review, greater efficiency and so we anticipate that we can improve on what Romeo has achieved to date. And we'll be able to share that with you more in Q4 earnings call.\n\nDouglas Dutton -- Evercore ISI -- Analyst\n\nAnd then do you think the 2K truck run rate is still -- or the 2K truck total deliveries and '23 is still feasible? You mentioned previously that you had the cell and pack capacity for that. It sounds like it's not a production issue and it might be more of a cost issue now on the pack side. So what needs to happen on the cost side for us to reach that 2000 total delivery number for the Tre BEV in '23?\n\nMichael Lohscheller -- President\n\nAnd, Doug, we talked a fair amount about our cost challenges, especially with temporary price increase for battery pack enclosures, as you know that increase our cost for cost of goods sold per unit by $110,000. And so we have a significant gap between average ASP and cost per unit so we are losing money, as you know. And so as we think about 2023, very challenging environment and we are more concerned about, especially with respect to our BEV trucks, reducing that loss. We think that's prudent.\n\nWe think that's what a wise word of capital would do. And so we have debated about this internally, and we think it's important that at least for the next five quarters, we're very thoughtful about this. And so we're not prepared to provide any guidance at this point. We will provide greater visibility in our Q4 earnings call, but we want to make sure that we have -- that we are well-prepared as we think through 2023.\n\nIt's still a bit unclear. We know that market could get worse, and so we are trying to be prudent.\n\nOperator\n\n[Operator instructions] Our next question is from Bill Peterson with J.P. Morgan.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nMark, good luck in your transition to retirement. And, Michael, welcome onboard and good luck navigating these challenging times. My question is for you, Michael, on strategy. In the video, you discussed the importance of both having BEVs and fuel cells as part of the portfolio.\n\nHowever, given the cash position, I mean, taking into consideration the margins that Kim outlined, these could be challenging beyond '23 so. And then not only that, the learnings from the BEVs have likely already been designed in the fuel cells. And then you all talked about all the challenges around infrastructure and lead times. I mean, there's impact to the grid with BEVs.\n\nAnd then there's competition, right? Competition from other newcomers and as well as even established players. Ultimately, I'm not really sure if Nikola is going to have a different product. I guess the question is kind of twofold. I guess why at this stage are BEVs even important in the portfolio? And if things don't improve, what would the company consider in terms of just, I guess part of the metaphor, but like pulling the plug as it were on the BEV program? I mean, so you already said you're going to be losing more money every time you ship a product, I mean, why should this be considered to be one of the two important legs of the company? And I guess even in the press release, you're kind of highlighting more and more about hydrogen.\n\nI think a lot of people that own the stock for the long term, believe that's kind of the right thing to think about. So why, have the BEV program at this stage looking forward?\n\nMichael Lohscheller -- President\n\nThanks for the question. And well, I mean, very straightforward. First of all, I mean, zero-emission mobility is our strategy. And we feel good that we have two legs to stand on, as I said in the video because at the end of the day customer will decide, right? What we see is in terms of customer feedback, some customers really like the BEV, in particular, once they have the infrastructure set up, they like the range.\n\nThey like the total cost of ownership. At the same time, there are customers who prefer longer range with the fuel cell. In terms of learnings from the BEV, I think it's obvious. I mean, you need to have really an integrated mobility solution for customers.\n\nSo meaning you need to provide the truck and the infrastructure for the BEV and for the fuel cell, obviously including the hydrogen. That's why I also want to put a lot of emphasis on the hydrogen piece of our business because I feel it's very much an entry into our business. So for example, when I was in Europe at IRA a lot of energy customers came to us and talked to us and also asked for the truck. So in summary, I think we feel very good about these two offers.\n\nCustomers will decide, I mean, if you look at our data in terms of BEV and fuel cell, also in terms of LOIs, MOUs, fuel cell is higher. I think there is a lot of opportunity for the fuel cell. But I feel very good that we have these both alternatives because let the customer at the end decide.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nCertainly, following the progress on that. Thanks for the color there. I mean, shifting to hydrogen, again, you kind of really -- it looks like you highlighted a lot of this in the press release and it's understandable. For the initial tranche of the 30 tons per day, when would you expect to achieve that? And I guess, how should we -- or the investor community, how should we think about the ramp to 300 tons per day? And maybe more importantly, as it relates to Nikola, what is Nikola's contribution in terms of the capital expenditures and maybe you can give some color on what kind of capex is required for a given sort of output? And I guess what kind of cost structure should we assume by around the '26 time frame?\n\nMark Russell -- Chief Executive Officer\n\nLet's think about this. We have been very clear to the market that our focus and our strategy when it comes to hydrogen infrastructure is capital efficient and asset-light. That means we are going to seek partners, both strategic and financial partners for hydrogen production hub as well as dispensing locations. That means we may have small piece of warship, what we are focused on, is making sure that we control hydrogen molecules, that's really important for us.\n\nSo coming back to our Arizona Hub, 30 tons per day for Phase 1, likely this will be available sometime toward the end of 2024, possibly early 2025. We understand in late 2023, as we actually have our fuel cell truck being delivered to customers, California will be our first market. And we have worked with potential hydrogen providers as well as we will have Mobile Trailers to meet the needs of our customers in early -- in late 2023.\n\nOperator\n\n[Operator instructions] Our next question is from Chris McNally with Evercore.\n\nChris McNally -- Evercore ISI -- Analyst\n\nSo just wanted to do a follow-up on the comments around Romeo and some of the subsidies that you're now learning on -- learning about post-acquisition. Can you just remind us for your original 2023, how much of the pack capacity was coming from Romeo as opposed to the more recent deal with Proterra or internal pack?\n\nMichael Lohscheller -- President\n\nIn terms of the way we are thinking about this is that especially for U.S. BEV truck, we anticipate all of our battery modules and packs will be coming from Romeo. What we have discussed with Proterra is that they will focus on providing modules and packs for BEV trucks as well as fuel cell trucks in Europe. And so we have a very clear delineation and we're very much focused on improving manufacturing operations, increasing yield, and making sure that we improve execution so that ultimately we are able to significantly improve output and delivery of modules and packs from Romeo.\n\nChris McNally -- Evercore ISI -- Analyst\n\nAnd then, Kim, is there now an ability to sort of increase the scope of the Proterra relationship? Because it just -- quick math on 110,000 would essentially -- it sounds like, Romeo was, on a cost basis, sort of well out of the bounds of industry numbers on $1 per kilowatt basis for pack. Is it just not something that's feasible in the short-term to increase for North American deliveries as we use a Proterra?\n\nKim Brady -- Chief Financial Officer\n\nAs you know, it takes time for validation and testing. And so when it comes to Proterra, it's their design of packs and modules. And so it's really the timing that we're concerned about. And as you know, Romeo, really, this was a small company, it did not have that scale to be able to reduce their cost in terms of manufacturing efficiency.\n\nAnd when we asked, we suspected, we knew that most of the Romeo contracts were existing contracts, we're essentially last leaders, we have been able to address a lot of those contracts so that we are very much focused on simply supplying battery miles and past nickel.\n\nChris McNally -- Evercore ISI -- Analyst\n\nAnd then I guess the final call, I mean now that's internal, can you talk about the steps because I mean some of the cost figures, it could be almost $300 per kilowatt to reduce that number to something that's more market standard, to get you back to your point, it's -- at some point in '23 or '24 into a gross margin positive position, what specifically would need to we be doing to the Romeo process?\n\nKim Brady -- Chief Financial Officer\n\nThat's a great question. When you think about miles and packs, the biggest cost component here is what we call pack enclosures. Currently, that's being machined. We are converting that to testing, we believe we can drop approximately 90% of our cost.\n\nAnd there are about 15 other components that we know that we'll be able to drop. So we have a very detailed plan component by component. But the biggest contributor in terms of rapid costs, will be pack enclosures. So I've alluded that right now packing enclosure costs increase in the short-term for the next five quarters will likely be around 106,000.\n\nWe believe we can drop about 85% of that, just in terms of addressing junction box, as well as the enclosure\n\nAnd time frame for that 80% is that sort of a target by the end of the year '23?\n\nChris McNally -- Evercore ISI -- Analyst\n\nEnd of 2023 obviously, we're going to push hard, we're going to be aggressive. But once again, it requires validation testing. So it's really the validation and testing that takes along. Now we're going to try to optimize that as much as possible.\n\nAnd we'll keep you posted but right now, our anticipation is that by Q4 2023 will be able to achieve those costs and will provide the transparency.\n\nKim Brady -- Chief Financial Officer\n\nAnd just to that, I mean the Romeo acquisition is such a big benefit because you think about this we do supply chain together, we do engineering together, we do manufacturing together so we have line of sight of several cost reductions in the most prominent one was the one Kim was highlighting but I mean strategically is such a big benefit having such an important component as a battery in house and we integrate every function, right, And therefore we see good line of sight for cost reduction. Of course, we're trying to do as fast as we can here.\n\nOperator\n\nOur next question comes from Jeff Osborne with Cowen & Company.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nMost of my questions have been asked already. I wanted to dig a bit into the European factory as well as what's your battery strategy there. Will you be making those same battery packs that you just described earlier or buying those from a third party?\n\nMichael Lohscheller -- President\n\nYeah, I mean, thank you for the question, Jeff, and, and Europe is obviously an important business for us. I mean, everything going on in Europe indicates like probably the pressure on CO2 is even higher than here. So for us is a very important business. And the setup together with IVECO is really strong because we have a joint venture with them in England where we have a factory together.\n\nWe have all the learnings from the BEV and also the future, which we transfer now from here to Europe. We have a dealer network with the IVECO dealers. So I think this is good. And in Europe, we will use the Proterra battery going forward, right, and also try to localize as many elements as possible so that we have a real competitive setup in Europe.\n\nBut I feel very good about Europe and also opportunities going forward.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nAnd I got the opex and capex commentary for '23. I wanted to better appreciate, is there an ability to potentially also defer the fuel cell facility from Bosch, and just import those from Germany themselves as opposed to making them, what would be the cost for ramifications if you were to do something like that?\n\nMark Russell -- Chief Executive Officer\n\nHey, Jeff, we don't actually make our fuel cell power module, as you know, we assemble them, so we buy components from Bosch. So the investment that we make at Coolidge is really the assembly line with respect to fuel cell power module.\n\nOperator\n\nOur next question is from Bill Peterson with J.P. Morgan.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nYeah, thanks for taking that follow-up. I actually wanted to come back to -- you have a commentary earlier about trying to -- it seems like you're pivoting more toward direct sale versus dealers. I guess I'm wondering of all the products you've delivered so far, are they still all at dealers at the moment waiting for delivery to end customers? What percentage has kind of gone to end customers? And I guess can you tie it back to the focus on, I guess, the end customers as opposed to the dealer network? Can you just expand on the strategy, please?\n\nMichael Lohscheller -- President\n\nYeah, thanks, Bill, for the question. So a few remarks on the dealer network. I mean, first of all, I think it's a very big benefit that we have a good dealer network in particular in terms of the service element, right, because in the truck business it's all about uptime. If you have an issue with the truck, you want to have service immediately.\n\nSo I think it's a very important element that Nikola was able to set up this dealer network, right? Now, of course,, we want to speed up and make sure this is going as fast as possible. But I'm also pushing hard on like a direct context to customers, in particular big fleet customers, right? And we were very pleased that we announced yesterday the order with Zeem. I mean, 100 BEV trucks I think is a very important proof point for us that we are on the right path here and to deliver them in 2023. But I think that dealer network is important.\n\nWe will continue like this, but I want to push harder on direct sales, direct contact to the customer and then manage that in the best possible way.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nAnd then maybe --\n\nMichael Lohscheller -- President\n\nYeah, sure. In terms of dealer inventory and also deliveries to customers. So we made good progress as indicated in terms of production, supply chain, all that is fine and now obviously most of our trucks are with dealers. But we also have -- dealers have delivered also trucks to end customers.\n\nOverall, we have around 97 trucks in dealer inventory and 14 have gone to end customers, and that's actually a process, right? So I think we ramp up very well on the production side, inventory now with dealers. And now the next step is to end customers and we delivered already 14 to end customers in the third quarter.\n\nMark Russell -- Chief Executive Officer\n\nSo, Bill, just to add some additional insights. As you know, this is progression. First, we're going to build trucks. Second, we're going to deliver to our dealers, and they're going to make sure that they have inventory.\n\nAnd then ultimately, dealer delivers to customers -- end customers. But some of the challenges that we talked about is that end customers, especially for certain customers, they lack charging infrastructure. So we are working with them. Clearly, that takes time.\n\nAnd so that's one of the biggest challenges that we are coordinating and working directly with our customers and dealers to make sure that we're providing solutions. In addition to that, there's also reimbursement process, which is somewhat complex and it also is fairly lengthy. And so we just want you to recognize the timing aspect, which is really important. And that's the reason why when we think about our Q4 and when we have not provided guidance, because there's significant timing here that's really not certain.\n\nAnd then obviously, with cost we are thinking about how many BEV should we really sell? That's a big question. So we're working both sides and addressing that. But clearly, as Michael talked about, we have added additional sales staff so that we can provide force amplification to our dealers as well as interacting with our customers, especially for what we call strategic corporate accounts. In addition to that, dealers are now getting up, they are adding sales staff on their side, so this all has taken time in terms of process.\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nNo, I think that's well understood. I think, ultimately, I guess, related to the cost, lack of infrastructure, lack of readiness, is it prudent for us to assume just pretty low shipments to dealers, given they probably have the channels filled, right? I mean, I don't know what kind of orders you need to fulfill or what the backlog is at this stage, but should we just assume a low run rate for the reason all of -- all of what you said cost readiness and so forth?\n\nMark Russell -- Chief Executive Officer\n\nI would say, it is still pretty mature. As you know, typically in the automotive industry the wholesale inventory at dealers is at typically around 30% of wholesale revenue or even 35%. Right now, we have so few units that's still out there, and we're building out our dealership. And so 90 units is not pretty low inventory, 97 units entered Q3.\n\nAnd so we just want you to recognize that it's just -- right now, that's very low units. And as we talked about, we'll move those units in Q4 and in '2023.\n\nOperator\n\nThere are no further questions at this time. I would like to turn the floor back over to Michael Lohscheller for any closing comments.\n\nMichael Lohscheller -- President\n\nThank you, everyone, for joining us today. I'm excited to begin the next phase of Nikola's journey. While there are macro uncertainties and headwinds facing us in the short term, we remain disciplined and are committed to focusing on the following. Continuously improving our production systems and supply chain management, as I indicated before, we are making good progress here.\n\nR&D on our trucks, we are also making good advancements in developing our fuel cell trucks and improving our electric trucks. Commercial engagement on vehicle sales, we plan to intensify our focus here to take more control over our distribution strategy. Our hirings will begin this intensification process. These short and medium-term executions will lead us to achieve our long-term objectives in the energy business, which is also making good progress.\n\nThanks again for joining us today. We look forward to seeing you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHenry Kwon -- Director, Investor Relations\n\nMark Russell -- Chief Executive Officer\n\nMichael Lohscheller -- President\n\nKim Brady -- Chief Financial Officer\n\nDouglas Dutton -- Evercore ISI -- Analyst\n\nBill Peterson -- JPMorgan Chase and Company -- Analyst\n\nChris McNally -- Evercore ISI -- Analyst\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nMore NKLA analysis\n\nAll earnings call transcripts"
}