{
  "companyName": "FedEx",
  "companyTicker": "FDX",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/21/fedex-fdx-q2-2023-earnings-call-transcript/",
  "content": "FedEx (FDX -1.34%)\nQ2 2023 Earnings Call\nDec 20, 2022, 5:30 p.m. ET\n\nOperator\n\nGood day, everyone, and welcome to today's FedEx Corporation second quarter fiscal 2023 earnings call. Today's call is being recorded. And now, at this time, I would like to turn the call over to Mickey Foster, vice president of FedEx investor relations. Please go ahead.\n\nUnknown speaker\n\nYou may start.\n\nMickey Foster -- Vice President, Investor Relations\n\nGood afternoon and welcome to FedEx Corporation's second quarter earnings conference call. The second quarter earnings release, Form 10-Q, and stat book are on our website at FedEx.com. This call and the accompanying slides are being streamed from our website, where the replay and slides will be available for about one year. Joining us on the call today are members of the media.\n\nDuring our question-and-answer session, callers will be limited to one question in order to allow us to accommodate all those who would like to participate. I want to remind all listeners that FedEx Corporation desires to take advantage of the safe harbor provisions of the Private Securities Litigation Reform Act. Certain statements in this conference call such as projections regarding future performance maybe considered forward-looking statements within the meaning of the act. Such forward-looking statements are subject to risks, uncertainties, and other factors which could cause actual results to differ materially from those expressed or implied by such forward-looking statements.\n\nFor additional information on these factors, please refer to our press releases and filings with the SEC. Please refer to the investor relations portion of our website at fedex.com for a reconciliation of non-GAAP financial measures discussed on this call to the most directly comparable GAAP measures. Joining us on the call today are Raj Subramaniam, president and CEO; Mike Lenz, executive vice president and CFO; and Brie Carere, executive vice president and chief customer officer. Before we begin, I'd like to take a moment to remember our colleague, Jeff Smith, who passed away on November 17th after a courageous battle with brain cancer.\n\nJeff's contributions to the investor relations and FedEx team were immeasurable, and our hearts remain heavy at his loss. He will be greatly missed. Separately, I'd like to congratulate Elizabeth Allen on her upcoming retirement at the end of the month after 32 years at FedEx. Elizabeth has been instrumental to the investor relations team, and she will be missed by her FedEx colleagues and the investment community alike.\n\nAnd now, Raj will share his views on the quarter.\n\nRaj Subramaniam -- President and Chief Operating Officer\n\nThank you, Mickey, and good afternoon, everyone. Let me begin by thanking our more than 550,000 employees who are working diligently to deliver another strong peak season for our customers. I'm extremely proud of the team's ability to sustain excellent service this season while we continue to transform our global network. BZ to the FedEx team.\n\nI'm encouraged by our second quarter results and the momentum underway against our Deliver Today, Innovate for Tomorrow strategy. We exceeded our Q2 earnings target and cost action goals shared in September even as the environment remained challenged. At the same time, there is more work to be done. The declining demand trends we saw at the end of Q1 softened further in the second quarter, and we are moving faster and with more determination than ever to accelerate our cost actions.\n\nToday, we will provide more detail on those cost actions and our plan to structurally transform our network to be nimbler, leaner, and more efficient, supported by our DRIVE program. Turning to Slide 6 for a snapshot of the quarter. Volumes declined across all segments, primarily in Express down low double digits. As such, revenue was down 3%, driven by a decline at FedEx Express, which was partially offset by growth at FedEx Freight and FedEx Ground.\n\nAdjusted operating margin and EPS declined, with volume weakness partially offset by higher yield and cost management actions. All of this said, we knew coming into this quarter that we would continue to be challenged by volume softness and high inflation. I'm exceptionally proud of the team's execution to date, which enabled us to exceed the second quarter earnings and cost targets. A great example of our meticulous focus on cost actions was the results at FedEx Ground, where despite volume being down 9% in the quarter, we were able to grow both operating income and margin; and at FedEx Freight, due to operating margin improved 320 basis points due to the continued focus on revenue quality, aligning the cost structure to lower volume levels, and delivering an outstanding customer experience.\n\nNow, I'll provide an update on our aggressive and decisive plan to cut costs in fiscal '23 relative to our June plan. In Q2, we achieved over $900 million of savings, exceeding the cost target we shared with you last quarter. This brings our total year-to-date progress to $1.2 billion. As we look to the remainder of the fiscal year, we have identified additional savings, bringing our target for fiscal year '23 to be approximately $3.7 billion in cuts.\n\nTurning to Slide 8. As we execute these cost actions, we are also laser-focused on delivering upon the superior service that has defined FedEx throughout our nearly 50-year history. As I mentioned, our team is performing exceptionally well this peak season with ground, time, and transit in the U.S. at just two days.\n\nFedEx Ground is delivering holiday shipments faster to more locations than our nearest competitor. Our Ground service is now back to pre-pandemic levels supported by continued enhancements to our route optimization and package handler scheduling technologies. Service levels also continue to improve at Express. In Europe, we have made strong progress, with Italy, France, Germany, Spain, and the U.K.\n\nshowing sustained high levels of service performance. The service challenges at Paris' Charles de Gaulle Airport have been largely alleviated, and we are capitalizing on efficiencies in the network to further improve service. We're taking swift action to address the remaining issues for our intra-Europe service, including the reopening of our Netherlands ground hub in October, which will continue to improve transit and depressurize the rest of the network, and completing the Novara, Italy road hub in February of 2023. Moving to Slide 9, I'll now provide an update on our ongoing structural transformation.\n\nWe have spent 50 years building our networks and growing our portfolio. As a result, we now have the most extensive network of any provider in the industry. We are now focused on optimizing this network to realize our full value potential. This includes advancing our global transformation through DRIVE, our comprehensive program to support long-term profitability and deliver on our fiscal year '25 financial targets.\n\nDRIVE is how we are executing that strategy, achieving more than $4 billion in annualized structural cost reductions by fiscal year 2025. I'm confident I have the full commitment of our executive team for leading DRIVE with purpose and a sense of urgency and with Sriram Krishnasamy, our chief transformation officer, who's facilitating the program. We've identified 14 specific focus areas, which we call domains, to target for efficiency improvements. Each is led by an executive sponsor and is aligned around our strategic vision for the business.\n\nWe are measuring success against each domains FY '25 permanent cost savings target, in addition to using clear operational metrics to track financial and service-level progress. Our focus within DRIVE is in three main areas: FedEx Express, FedEx Ground, and shared and allocated overhead expenses. At Express, the team is transforming the network to be more agile, efficient, and digitally led. An initial priority is to optimize the global air network, where we expect to generate approximately $400 million in savings.\n\nThis work includes deploying digital assets that allow us to efficiently balance our purple-tail airplanes and third-party lift as we build the network of the future. We are also addressing our Express pickup and delivery operations globally to improve efficiency. In February, we will implement a new U.S. network design that will improve P&D efficiency and result in cost savings of approximately $300 million annually.\n\nIn Europe, where we expect over one-third of Express' DRIVE savings, we have spent the last several years bringing the networks together. With integration behind us, we have shifted to optimization. We are adjusting our network, deploying route productivity tools, and investing in digital capabilities for planning and automation. Additionally, we are rightsizing our intra-Europe air network and improving processes to enhance the end-to-end customer journey.\n\nThis will all serve to improve both service and profit of our European business. Now, turning to FedEx Ground. We are focused on every portion of the package lifecycle. For instance, in line haul operations, we are planning new tools, technology, and processes to drive increased packages for trailer.\n\nWithin Ground, we have a dock domain. This team's responsibility is to improve packages for labor hour. In Q2, that metric increased 3.5% year over year, and we expect continued improvement as we deploy additional capabilities. Across both the Express and Ground focus areas, we are leveraging our operational insights platform.\n\nThis provides the foundational data, tools, and insights critical not only for delivering DRIVE savings goals but also for sustaining those savings and transforming the way we operate. Finally, shared and allocated overhead expenses are a significant opportunity. This includes procurement and digitizing and centralizing support functions. One example of digitizing support functions is our ability to reduce customer service calls by redirecting customers to best-in-class digital applications.\n\nA win for FedEx and a win for our customers. Within procurement, we are reducing spend through our operate collaboratively model and creating a central function to optimize our enterprise spend. For example, we are setting up a cross-opco initiative to consolidate our contract transportation spend to realize value in the second half of fiscal year '23. In conclusion, there is strong momentum underway as our team focuses on cutting costs immediately and structurally transforming our network.\n\nWe will continue to provide updates on our DRIVE progress, and we plan to host a DRIVE deep dive call in the first half of calendar 2023 to provide additional details on our ongoing transformation. Now, let me turn it over to our chief customer officer, Brie Carere, to discuss recent market trends and our commercial strategy in more detail.\n\nBrie Carere -- Executive Vice President and Chief Marketing and Communications Officer\n\nThank you and good afternoon. As expected, the operating environment in the second quarter was challenging. The trends we saw toward the end of the first quarter persisted through November. As a result, we experienced lower demand for FedEx products and services.\n\nBut we acted with urgency to adjust our network while continuing to deliver for our customers. Revenue at FedEx Express was down 6% year over year, primarily due to volume and yield softness in Europe and Asia. In Europe, we're making steady progress as volume trends improved quarter over quarter. I'm confident in our momentum as we have a robust sales pipeline in Europe.\n\nWe are leveraging our faster road network and our unique ability to bundle parcel and freight. As we anticipated, the softening demand created yield pressure, especially in Asia. Despite volume softness, I am pleased with the team's ability to manage volume, share, and margin in our Trans-Pacific lane. At FedEx Ground, revenue was up 2% due to higher yield, driven by fuel surcharges, base rate increases, and improved product mix.\n\nIt was partially offset by lower volumes. We once again delivered strong service levels and best-in-market transit times. At FedEx Freight, we delivered solid performance despite the operating environment beginning to moderate. Pricing discipline across the LTL industry is strong, and we expect the market to remain rational.\n\nRevenue was up 8% as the team remains laser-focused on driving improved revenue quality and profitable share growth. While navigating the current environment, FedEx Freight continues to innovate. We're expanding dimensional capture and piloting dimensional weight-based pricing. We believe that simplified pricing is the future of the LTL industry, and we're leading in this transformation.\n\nI also wanted to provide an update on our enterprise pricing strategy and the initiatives to improve revenue quality. We remain disciplined. We are focused on growth in the right segments to optimize network profitability. We announced a 6.9% general rate increase in September, and I remain confident in a continued high capture rate.\n\nWe are also continuing to leverage surcharges to align our pricing to cost. Our recent announcements for demand-based large package and U.S. export fuel surcharge are good proof points. I'm also very pleased with the team's progress to create new capabilities.\n\nA great example is the partnership between pricing and Dataworks to build a price anomaly detection engine. The team has had success detecting overbilling and correcting invoices before they are sent to our customers. This is a significant customer experience improvement. We are now adapting these capabilities to identify underbilling opportunities, which will increase revenue quality.\n\nAs we look toward the back half, service improvement has translated into good momentum for our sales team. In addition, we have a robust pipeline aligned with our strategy, which includes small and medium and European segment targets. And Q4, we will be lapping the impact of the beginning of the war in the Ukraine, as well as the air integration disruption we experienced in the region. As a result, our year-over-year volume comps will improve as we move through the back half of this fiscal year.\n\nHowever, in Asia, we do expect to face continued yield pressure due to lower demand for priority services. In the current economic environment, the market is increasingly shifting to deferred services. We have the deferred portfolio to capture the shift in demand, and our DRIVE program will ensure we have the right cost to serve to profitably manage through this market transition. In conclusion, we remain prudent in our expectations for volume and yield in the second half of the fiscal year.\n\nThat being said, our service value proposition relative to our competition will remain strong. And in fact, our relative market position will improve in the back half of the year. And with that, I'll turn it over to our chief financial officer, Mike Lenz.\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nThanks, Brie. I'll start on Slide 16. In the second quarter, we delivered improved alignment between variable costs and lower revenue amid a more challenged volume environment that impacted our profitability. Second quarter revenue was approximately $700 million below the lower end of the range we expected coming into the quarter.\n\nApproximately 300 million of this variance was due to an accelerated decline in forwarding revenue at FedEx Logistics. The remaining variance versus our Q2 outlook was driven about half by Express and the balance by Ground and Freight combined. We have moved faster to offset this shortfall with cost reductions, reducing the lag between incremental volume softness and the savings offsets realized. This, combined with an additional $200 million in discrete cost actions, led to improved earnings relative to our Q2 outlook.\n\nTurning to the transportation segments. Starting with Express, profitability continues to be pressured. Adjusted operating income declined 65% due to lower volumes as cost reductions lagged accelerating volume declines. Volume pressures were partially offset by yield management actions.\n\nPackage yield grew 8% year over year, primarily driven by higher fuel surcharges and base rates, partially offset by exchange rate impacts. Yield improvement slowed from Q1 levels across nearly all products and regions. At Ground, operating income increased 24% and operating margins expanded 130 basis points to 7.1%, supported by yield growth of 13% as higher fuel surcharges, product mix, and pricing initiatives drove improvement. Our cost reduction actions, combined with solid execution by the Ground team to adjust near-term variable costs amid greater volume declines, also supported margin improvement.\n\nThese factors were partially offset by increased costs, including higher purchase transportation and other operating expenses. And at Freight, the team continues to drive strong profitability, with operating income increasing 32%. This was driven by yield improvement, including higher fuel surcharges, partially offset by decreased shipments, as well as higher wage rates. Turning to Slide 17, I'd like to build on what you heard from Raj on our near-term cost savings, reviewing our progress by category.\n\nAs mentioned, we've identified $3.7 billion in discrete cost reductions relative to our plans going into fiscal '23, which is $1 billion higher than our prior projection. Express is where we have the most work to do and where the majority of the reductions are focused. A large portion of those savings is coming from reduced flight frequencies. Year to date, we've reduced eight international routes and 32 U.S.\n\ndomestic routes while parking five additional aircraft. This translates into pulling down U.S. domestic flight hours by 6% and international flight hours down 7% in the second quarter year over year. Moving to 18, in addition to the expense actions, we are also lowering our FY '23 capital spend forecast by an incremental $400 million to 5.9 billion, which represents an approximate $900 million reduction from our initial plans for the year.\n\nWith the lower demand environment, we're deliberately deferring and slowing the pace of projects as we maintain the emphasis on using our assets more efficiently and reducing our overall capital intensity. Our liquidity remains a source of strength, and we ended the quarter with 4.6 billion in cash. We continue to generate solid cash flows, supporting our capital return strategy. We executed a $1.5 billion accelerated share repurchase transaction, which will be completed by the end of this calendar year.\n\nOur capital return strategy reflects our commitment to reducing capital intensity and creating value for shareholders while continuing to reinvest in FedEx for today and tomorrow. Provide additional context for the changes in demand during the first half and what we are planning for in our outlook, on Slide 19, we've shown first half monthly volume trends for our major product categories. Volume declines continue to accelerate across major product categories, both in the U.S. and internationally, throughout the second quarter.\n\nAs we look to the second half of the year, we expect volume declines to begin moderating at Express and Ground by the end of the third quarter, with comparisons easing further in the fourth quarter as we lap the onset of softer volumes. Yield growth will be increasingly pressured as year-over-year fuel surcharge comparisons normalize and customer demand shifts, most prominently in Asia. This brings me to our outlook on Slide 20. While we continue to aggressively drive cost reduction actions, we expect business conditions to remain challenging in the second half of FY '23.\n\nOur current expectation for full year adjusted earnings per share is between $13 and $14. On a quarterly basis, we expect results to follow our historical seasonal pattern with lower earnings in the third quarter versus the second quarter and highest in the fourth quarter. Second quarter adjusted expenses were essentially flat year over year as inflation impacts particularly fuel offset our activity reductions on an absolute basis. As we move through the second half, we project year-over-year expenses to increasingly decline as our cost initiatives accelerate in conjunction with lapping certain inflationary increases.\n\nIn closing, I'd like to reiterate that the entire team continues to aggressively identify and implement both immediate cost reductions, as well as structural cost efficiencies, to drive improved performance. With that, we'll open it up for your questions.\n\nOperator\n\nThank you. [Operator instructions] And we'll first hear from Tom Wadewitz of UBS.\n\nTom Wadewitz -- UBS -- Analyst\n\nYeah. Good afternoon. Wanted to see if you could give a sense of what drives the additional 1 billion in cost takeout. And then, I don't know if you look at the broader frame.\n\nRaj, you talked about some of the split, but can you give like the detail or a bit of breakout from Express, Ground, and shared services on the $4 billion number also? Thank you.\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nHey, Tom, this is Mike. So, first, for the additional $1 billion for FY '23 relative to our plans coming into the year, that's mostly at Express. It's a combination of further flight reductions; incremental sort cancels, particularly post-peak; adjustments to our ground operations, primarily in the pickup and delivery space. And then I guess another piece I'd highlight, too, was further reductions at our FedEx services -- shared services organization, where they're doing a great job of really clamping down on costs relative to what we were contemplating earlier in the year.\n\nAs it relates to the 4 billion in DRIVE that we've highlighted, 1.4 billion is for Express, 1.1 billion is Ground, and then 1.5 billion is in the shared and allocated expenses. And keep in mind that as we approach those, those are structural cost reductions that are irrespective of the demand environment assumption that you would make going forward so that we can achieve a path toward the FY '25 objectives that we outlined. Thanks for the question.\n\nTom Wadewitz -- UBS -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nNext, we'll hear from Helane Becker of Cowen and Company.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nThanks very much, operator. Hi, everybody, and thanks for the time this afternoon. Just one question related to the reduction in capex. Mike, you talked you're moving -- just to clarify, you're moving that to the right and you will still spend that money.\n\nYou will just not spend it this current fiscal year. Is that correct?\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nSo, we certainly have deferred a number of facility projects and initiatives. So, that is a component there, as well as looking to pause other certain major projects that are at a phase of completion as we evaluate the changed circumstances. Another piece of it is a change in our aircraft payment schedule as well. So, we've pushed that out further, but the number of deliveries remains unchanged, just the timing on that sense.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nOK. And then can I just ask a follow-up on -- with respect to salaries, wages, and benefits? I sort of thought the there was some decline there that looked, you know, kind of OK. Could you just explain that because you also said during your prepared remarks that salaries were actually up, so kind of missed that?\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nWell. So, Helane, we will see mitigating in terms of the year-over-year increase in wage rates relative to what we were seeing earlier in the year. And in addition, as we flex down the network -- networks, particularly post-peak, we'll have a ramp down in terms of the resources deployed there, as we typically do, but certainly going to move quickly as we come past the successful peak that we're in the middle of right now. So, expect further progress in that line going forward as well.\n\nHelane Becker -- Cowen and Company -- Analyst\n\nOK. Thanks. Thank you.\n\nOperator\n\nAnd next, we'll hear from Jordan Alliger of Goldman Sachs.\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nYeah, hi. So, question on the $13 to $14 range. Maybe some more perspective. Obviously, a beat in the second quarter.\n\nYou're upping the cost saves by $1 billion. I mean, how do we think about that from a conservative perspective? Is it conservative? And, you know -- or maybe some context in your view of the economy? I mean, are we assuming a recession in those numbers because, you know, it would seem, especially with a moderate decline in volume, that the cost savings are basically all the second half operating profit? So, I'm just wondering if you've kind of taken a very conservative approach. Thank you.\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nSure. Thanks, Jordan. Well, I would highlight, you know, certainly, the environment remains fluid. We outlined our expectations on the trajectory of volume and yield and considered a range of outcomes within the corridor for both of those.\n\nAnd in conjunction with the cost takeout you highlighted there, we're very confident with the $13 to $14 range. So, while it's true the volume declines, we expect those to moderate as we move through the rest of the year, particularly in Q4, we're going to have more yield pressure relative to the increases we saw in the first half of the year. So, when you bring all three of those elements together, that's what gets you to the bottom-line projection there that we've highlighted. But I guess I would also say that while the declines moderate on the volume, we're, in essence, projecting the same demand profile that we're currently experiencing.\n\nSo, hopefully, that puts it in full context for you.\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nYeah. Thank you so much.\n\nOperator\n\nNext, we'll hear from Ken Hoexter of Bank of America.\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nHey, good afternoon. If we could just take that maybe a step further. It seems like of that -- I think Jordan just hit it on the -- that you have 1.2 billion of savings so far. So, of your 3.7 target now, that the 2.5, that means all of the second half savings.\n\nI just want to clarify the $7.30 or whatever, $7 or $8 seems like it's all from cost savings, right? And so, the newfound $1 billion, does that mean you were targeting maybe $10 to $11 of earnings before that given that you -- you know, that gets you the back half? And I guess, Mike, if you can kind of specify what of that is then structural versus, you know, adjusting for, you know, takeout given the pace of volumes you're seeing.\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nOK, Ken. How I would address that is, as you saw in the second quarter, the revenue environment was below our expectations. So, therefore, we are assuming that going forward into the second half of the year, which motivated further near-term takeouts of costs relative to what we had planned for FY '23. Though we will project revenues to be down year over year in Q1, but we're also going to see a ramp-up in absolute expense reductions as we move through Q3 and even more so into Q4.\n\nSo, that's the absolute basis when you look at it for year over year.\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nAnd so, that -- are these -- again, just to clarify that, is that -- does that mean these are just reactions to the slowing revenues? And so, it's cyclical versus -- I'm just trying to understand your -- the -- you know, I think investors want to understand what is structural moves that FedEx is making here versus just reacting to the decelerating revenue environment. Is there a way to clarify that?\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nWell, Ken, maybe, you know, we talked about permanent reductions of $1 billion from FY '23, and that recognizes we were operating in very unique circumstances over the last year and a half, two years. And so, those takeouts would not return under any range of normalized demand scenarios that you might consider. And of course, most of that, that's at Express. You know, I mentioned that we parked five additional aircraft at -- during the second quarter.\n\nBy the end of the fiscal year, we're projecting to park 11 additional aircraft. So, hopefully, that gives you a little more context for how we're thinking about, you know, resizing the network. And most of those will be widebodies.\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Condolences on Jeff. He will be missed. And good luck to Elizabeth.\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nThank you. We really appreciate it.\n\nOperator\n\nNext, we'll hear from Scott Group of Wolfe Research.\n\nScott Group -- Wolfe Research -- Analyst\n\nHey, thanks. Afternoon. Mike, can you just talk about the margin expectations for the segments in the back half? Can Ground continue to improve? Can Freight continue to improve? Can Express get back to margin improvement? And then, Brie, you were -- sound like you were talking about pricing slowing. I wasn't sure if that was a parcel comment, an LTL comment.\n\nSo, if you could just give us a bit more color. Thank you.\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nOK, Scott, I will start. Express margins will remain pressured in the second half. I would say more so in the third quarter versus the fourth quarter given some of the factors we outlined, including ramping up more of the discrete cost reductions into the fourth quarter. We're fully seeing traction in Europe, plus lapping the challenges from last year with the air network integration, as well as lapping the volume inflection there.\n\nSo, you know, Express remains a -- where we have the most work to do. I would say, at Ground, we're past the rapid growth and labor challenges that the Ground team was executing on over the last two years. And now, they are laser-focused on driving improved productivity and efficiency within a declining volume environment. And so, we saw great progress in that regard here in the second quarter and expect to see continued going forward in the second half of the year.\n\nSo, hopefully, that gives little dimensions to the pieces of it. Brie, if you want to take --\n\nBrie Carere -- Executive Vice President and Chief Marketing and Communications Officer\n\nSure. Fair question, Scott. So, from a yield perspective, let's talk front half versus back half. When we look at the domestic parcel market, we are still anticipating in the back half that we will have yield growth for both Express and Ground in the parcel market, although less growth than we did in the first half.\n\nThe same holds true for FedEx Freight domestically. Back half, we are still anticipating yield growth and the inflationary environment, although much less than the front half. And then as we go to the international markets, the largest change that we will experience in the back half is we are anticipating that we will see our Asia yields decrease in the second half. Now, I want to be really clear that we've accounted for that within the range that Mike has given us, and we also anticipated this.\n\nAnd the Asia team does a really good job of managing volume, yield, and margin. And our Trans-Pacific lane is still a very profitable and healthy lane for us. So, it is within the range, but that's how we're thinking about yield front half versus back half.\n\nOperator\n\nNext, we'll hear from Brandon Oglenski of Barclays.\n\nBrandon Oglenski -- Barclays -- Analyst\n\nHey, good evening, everyone. And I second Ken's thoughts on Jeff and Elizabeth. Guys, can you just help us understand? I mean, if you're going to achieve 3.7 billion this year, isn't that very similar to the 2025 DRIVE target? I think that might be the confusion that a lot of folks aren't fully understanding here. And, Mike, we heard you that a billion are permanent this year, but can you talk to maybe the other 2.7 billion that might come back, but then, you know, you're going to set in an incremental 3 billion between now and then? Thank you.\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nSo, Brandon, let me -- first, thanks for the kind comments regarding Jeff and Elizabeth. We will certainly miss both of them. Let me give a little more context about the 3.7 billion reduction. Appreciate that's reference to our plans coming into '23.\n\nAnd the purpose of that was to illustrate the scope and magnitude of the cost initiatives that we have undertaken to address the changed circumstances from where we started the year. So, we highlighted we have $1 billion of the permanent reductions in a demand environment as we are today. You know, much of the structure, the flight takedowns that we have made at Express, you wouldn't see those coming back. I think you may recall we said, you know, there were always be -- anticipate that there will be cyclical ups and downs.\n\nBut as we come out of the current circumstances, when it comes back, it would come back in a different way, and we would be using less of our own purple-tail lift and more of partner lift in order to flow traffic in the most efficient manner possible. So, you know, again, the 4 billion of DRIVE, think about that in the context of a greater emphasis on cost reduction rather than the degree of modest revenue growth we were assuming back in June when we outlined the goals for FY '25. So, that's what the focus is there to that structural cost reduction across a range of demand scenarios that you could envision.\n\nOperator\n\nAnd next, we'll hear from Allison Poliniak of Wells Fargo.\n\nAllison Poliniak -- Wells Fargo Securities -- Analyst\n\nHi. Good evening. Just want to follow up on the last comment. So, just to clarify, the fiscal '25 target, certainly that balance of revenue and cost, you know, based on sort of the macro deceleration, that algorithm clearly changed in terms of how you reach those targets for fiscal '25 just given some of the structural cost actions and challenging growth right now.\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nYou hit it absolutely, Allison. We are -- that's why we have ramped up the degree and intensity around the structural cost reductions. We made great progress to date in identifying those and are looking to use the insights. As we've made progress on those, to identify even more, and if the environment changes, then we will react as you saw we did in the second quarter here to adjust even further in the near term as well.\n\nOperator\n\nNext, we'll hear from David Vernon of Bernstein.\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nHey, good afternoon, guys, and thank you for taking the time. So, Raj, I was wondering if you could maybe kind of bring this stuff up a level, right? If we're talking about $13 to $14 in adjusted earnings in this fiscal year, is that a base from which you can start to build in fiscal '24 and '25, or are we still got a little bit of risk in terms of chasing the ball down the hill from a from an economy standpoint? And then as you think about the longer-term targets that you put out there, is there any, you know, contemplation of actual changes to the product portfolio or the composition of the many different companies that make up FedEx as part of this transformation effort, or are we just kind of doing the same sort of mix of stuff a little bit better?\n\nRaj Subramaniam -- President and Chief Operating Officer\n\nSo, David, thanks for the question. And so, I'll just say that I'm just delighted to see how fast we're performing in terms of taking our structural costs down. So, the -- I'm just going to comment on the DRIVE program here because that's what gets us going to that FY '25 goals. Our strategy simply is to drive profitable growth and reduce our structural cost while we innovate digitally that helps us get to those goals.\n\nAnd all of this is built on a strong foundation of service. DRIVE is how we execute that, and I'm extremely thrilled to see the progress we have made and the level of engagement of the entire executive team. We have shown on the slide earlier the 14 domains, each with an executive sponsor. KPIs are identified.\n\nWe have about 1,200 people involved. And this is not a one-and-done exercise. You know, this -- all the way from initial idea to an executable plan with KPIs, this is like a conveyor belt. And then there's a significant amount of will, skill, and rigor as teams move toward execution.\n\nSo, this is very important as we think about our FY '24 and '25. We are fundamentally focused on restructuring our cost base, driving profitable growth, and improving our operating margin performance. So, we can't control what the external environment is. We are focused on things we can control.\n\nAnd, you know, the base that we have in '23, you know, we will use that to come out of this external environment situation much, much better than we went in. And the DRIVE program is a significant component of that. And we will talk to you more about that, you know, in our DRIVE deep dive update for you in the first half of calendar '23. We are constantly looking at the portfolio to see what opportunities there exist.\n\nAnd when there's something to talk to you about that, we will definitely communicate. Thank you, David.\n\nOperator\n\nNext, we'll hear from Stephanie Moore of Jefferies.\n\nUnknown speaker\n\nHi. Good afternoon. [Audio gap] Many thanks for taking our questions. I guess I want to take maybe a higher-level macro question here.\n\nYou mentioned continued yield softness in Asia. Surprised, I guess, to hear that the China reopening wasn't mentioned at all, the potential tailwinds. I'm kind of curious what your guided thoughts are in terms of what's continuing to drive that Asia softening as China is potentialy coming back online as an economy and then maybe noticing that we haven't talked about broader economic outlooks and you guys stop giving the monthly economic updates. Maybe if you had any thoughts on just general U.S.\n\neconomic conditions here looking over the next 12 months. Thanks.\n\nRaj Subramaniam -- President and Chief Operating Officer\n\nThank you very much. Let me hit it high level, and then if Brie has additional details, she can jump in right afterwards. On the macro aspects of it, you know, one of -- two things we flagged were that the industrial economy is slowing around the world and with Europe being the hardest hit and that there is an e-commerce reset, and both those things happened exactly like we said were going to happen. The good news was we are -- we reacted.\n\nWe move faster to adjust to these circumstances, and we are absolutely focused on what we can control. And again, I'm very, very proud of the progress we have made. And -- but, again, we know there's more work to be done. And, you know, we will continue to improve our cost structure.\n\nRegarding China, we haven't seen any fundamental change in the volume profile one way or the other in the last few weeks. We are obviously monitoring this very, very carefully, and it's very too early for us to make any further comments on this at this time. Brie, anything to add here?\n\nBrie Carere -- Executive Vice President and Chief Marketing and Communications Officer\n\nNo, I think that's exactly right. You know, we have the team poised and ready to benefit from any potential. But right now, the demand signals have been pretty consistent over the last couple of weeks. And so, that's how we're planning for the back half.\n\nOperator\n\nNext, we'll hear from Jack Atkins of Stephens.\n\nJack Atkins -- Stephens, Inc. -- Analyst\n\nOK, great. Thank you for taking my questions. So, I guess, Raj, this one's for you. And I love Mike's thoughts as well.\n\nBut I would be curious to kind of get your take on structurally what's changing as you look out over the next several years with how the company is allocating capital. I get that, you know, there's a greater emphasis on capital efficiency overall. And, you know, I think everyone appreciates the fact that you guys are monitoring the capex issue very carefully. But as you think about your decisions to invest for both organic and inorganic opportunities, you know, there have been some challenging sort of investments over the past decade.\n\nHow is the sort of the framework around how you're thinking about capital allocation changing, if at all, as you look forward, Raj?\n\nRaj Subramaniam -- President and Chief Operating Officer\n\nOK. Thank you, Jack. Listen, we are -- the DRIVE is the way we work, and every project that we now go through has got to go through a significant hurdle to make sure those plans are approved. And then obviously, that has to make sense from a financial perspective and from our -- from ROIC perspective.\n\nSo, you know, the good news, so far, is that the projects that have come through here have -- you know, were, you know, very high returns. And that changes the fundamental way we think about how we go forward here. So, Mike, I don't know if you want to add to that.\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nJack, look, the high rate of growth, particularly at Ground over the past few years, that's in the rearview mirror. And so, we will not be spending as much on facility expansion going forward. The major replacement initiatives we have in front of us over the next couple of years, which ramp down in FY -- beyond FY '25, are our fleet modernization. We have no firm orders beyond FY '25 for new aircraft and the modernization of our Memphis hub, which is, as Richard likes to call it, the heartbeat of the Express network, that will be completed in a few years as well and that will yield efficiencies over the long term.\n\nSo, those are major elements within the capital allocation that we have a clear line of sight of those coming down. And hence, you know, as we outlined, we fully expect to be at the 6.5% in '25 and lower beyond that. And hence, we were committed to improving our payout ratio and up the dividend as a reflection of the trajectory and the path that we're headed down in that regard.\n\nOperator\n\n[Operator instructions] We'll next hear from Chris Wetherbee of Citi.\n\nChris Wetherbee -- Citi -- Analyst\n\nThanks. Good evening. You know, Raj, I wanted to get your take on what you think about the domestic economy. It seems like the step down in volume activity in the second quarter seem to be more driven by domestic across the segment.\n\nSo, I'm curious if you're seeing some of the softness that you had originally flagged in the late summer and into the fall in international sort of cascading here into the U.S. Are there maybe some specific customer actions or revenue quality actions that you're taking here in the U.S.?\n\nRaj Subramaniam -- President and Chief Operating Officer\n\nWell, let me just talk about the macroenvironment. I think the main macro issue in the United States is really the e-commerce reset. If you were to just follow along here, prior to the pandemic, e-commerce represented about 16% of retail. During the pandemic, it peaked at about 22%.\n\nAnd ever since, it's been kind of going down. We are probably, what, 18% or 19% right now. It's still higher than 16, but not quite as 22. So, that's the part of the reset that's going on in the U.S.\n\ndomestic package business. Of course, we have also taken certain revenue quality actions on some of the segments of the traffic, specifically FedEx Ground economy. And that's the only other part that would be unique to FedEx. But other than that, you know, this is -- I would say, the biggest macro here is e-commerce reset.\n\nOperator\n\nAmit Mehrotra from Deutsche Bank has our next question.\n\nAmit Mehrotra -- Deutsche Bank -- Analyst\n\nThanks. Hey, everyone. Thanks for taking my question. So, Mike, I just wanted to ask maybe a couple of quick ones.\n\nSo, I wanted to understand the drag in Express coming from the European Ground business. So, basically, the legacy TNT business because I understand, you know, there's cyclicality in the air network and you're bringing flight hours down, which is great. But I'm just trying to understand, you know, what the legacy TNT business, what the overall impact that has had or will have on kind of the Express proper protocol. I don't know if that means that you can give us an idea of what that business is making or losing or the contribution of that business to the overall Express profit.\n\nBut I think that would be helpful. And then the follow-up I wanted to ask was on the Freight business. And, you know, I don't ask a lot of questions about the Freight business, but it's a big piece of the profit pool today. I don't know if Lance is on, but what I noticed is that the yields in the Freight business were down sequentially, which is something we typically haven't seen quarter on quarter.\n\nAnd of course, this is in the context of FedEx being part of kind of that pricing war 12 years ago in the LTL business. Is this an indication that FedEx is lowering price to get more volumes in Freight? Can you talk about the pricing discipline in the Freight business, both with respect to FedEx and also with the industry as you see it as well?\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nSure, Amit. Thanks. I will address Europe first, and then I'll let Brie address your question about the LTL business. So, look, the opportunity in Europe is a significant driver of the upside potential for Express.\n\nAnd we've highlighted the challenges that we had earlier in the calendar year. We have worked past those. The team has momentum there. The leadership team is very focused on winning business, driving more efficiency and productivity, both in the air and in the ground network, and fully confident that we will see significant contributor to improvement in Express profitability going forward, with some initial traction on that coming in in Q4 in terms of seeing year-over-year improvement.\n\nSo, that is absolutely an opportunity for Express, and we certainly are confident of getting there. It's taken longer than we would have anticipated, and we've had some events develop along the way. But we're past those, and we're looking forward. Brie.\n\nBrie Carere -- Executive Vice President and Chief Marketing and Communications Officer\n\nThanks, Mike. Fair question. From a FedEx Freight perspective, when we looked at Q2, the one thing that we did see that was slightly different from Q1 is weights actually were slightly down in Q2. From a revenue quality perspective, however, we have to remember, number one, that we are seeing all of the public carriers behave very rationally and the market is very disciplined; number two, within that market, FedEx Freight has the premium value proposition.\n\nWe have two types of service. So, we have a great opportunity that is very profitable for FedEx to allow customers to move from our priority to our economy service, and we've got two great growth opportunities within FedEx Freight. We've got FedEx Freight Direct, which we're still seeing high demand for, and we've got a very profitable service into Canada that we're very focused on. So, we are going to continue to be disciplined.\n\nWe absolutely know the history, and we are focused right now on doing our part to be very disciplined within the industry.\n\nOperator\n\nNext, we'll hear from Scott Schneeberger of Oppenheimer.\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nThanks very much. Raj, one for you and then one for Brie. Raj, you've given a good overview with regard to DRIVE. I'm just curious when in the first half we may expect this update call and what type of information we'll receive there.\n\nThese 14 domains you're targeting, maybe you could speak to, you know, the top 3 or 5 there? I'd be curious to hear. And then, Brie, the question for you is, you spoke about improving service levels and a really good pipeline for small- and intermediate-sized businesses. Could you delve into that a little bit more on how that's working for you and the sales team domestically and in Europe? Thank you.\n\nRaj Subramaniam -- President and Chief Operating Officer\n\nWell, thank you, Scott. On the -- yes, on the DRIVE part of the equation, you know, we have -- again, as I said, we are very excited about the progress we're making here. The -- some of the -- you know, there are 14 domains. Under Express, we have the air network domain.\n\nThis is about fundamentally restructuring our Express air network to be more agile and flexible to changes in demand and also recognizing that deferred parcel and freight will be a bigger component. So, how do we change our networks, firstly, to improve overload density, and then how do we use partner networks, especially to move deferred traffic? And then also looking at the domestic U.S. network to see what other efficiencies we can get there using technology. The other one is Europe is part of the domain here and is clearly a big area for focus for us.\n\nWe have, you know, $1.1 billion of this as FedEx Ground. There are, you know, very interesting opportunities there, whether it is through line haul or dock productivity, things like that. And then, of course, back-office shared services is $1.5 billion with this procurement, you know, and improving our efficiency across the board. So, you know, I don't want to take the time here to go through all the detail, but I will -- you know, we will set up a time.\n\nI know we haven't decided on an exact date yet. But at that meeting, we will be going to give you more detail. We'll talk to you about specific KPIs that we will track going forward and, you know, give you a full flavor of what this program is all about. And, Brie.\n\nBrie Carere -- Executive Vice President and Chief Marketing and Communications Officer\n\nThanks, Raj. So, I love this question. Let's talk about our momentum. Here in the United States, as we talked about, we've had a great peak.\n\nThe Ground team and I, I know the operators who are listening, I know we're not done yet. I know we have a very, very busy week still to execute. But as I sit here right now, we've had just stellar service in the field, and I couldn't be more proud of the team. So, as we kind of turn the chapter on this calendar year to next calendar year, domestically, we have the very best value proposition.\n\nWe're faster than our primary competition. We have this great new feature, which is getting great response in the field for picture proof of delivery. We have Sunday service. We have brand new digital capabilities called estimated date of delivery, which gives our e-commerce retailers greater accuracy on their delivery times.\n\nAnd we're getting really great feedback. And as you all know, our primary competitor has to manage through a significant labor conversation. So, we're going to come out of this peak very, very strong, and we are very confident in the momentum that Jill and her team are building in January. The same is true as we look into Europe.\n\nWe have got quarter-over-quarter momentum. We've got three primary lines of business that we sell. In the domestics, we are optimizing -- from a domestic perspective, we are there for the profitability of international, and we have an opportunity to optimize those networks and put some volume in the domestic networks. And service is excellent in the domestic networks in Europe, and I'm really pleased with Karen and the team there.\n\nFrom an intercontinental perspective, we have a product called FedEx International Connect Plus, and it has done really well for us, and the team has continued to get the right business from Europe into the United States. And then from an intra-European perspective, that has been where we're challenged. But I'll tell you, the brand has done a lot of hard work for us. Customers want to do business with FedEx, and quarter over quarter, we've seen service improvement.\n\nAnd with that, we have seen our pipeline and the confidence grow. And I believe that you will continue to see quarter-over-quarter improvement out of our European division. So, yes, I'm looking forward to January, and I think we have the best sales team in the business to go and execute the plan I just talked about.\n\nOperator\n\nOur final question for today will come from Brian Ossenbeck of J.P. Morgan.\n\nBrian Ossenbeck -- JPMorgan Chase and Company -- Analyst\n\nHey, good evening. Thanks for taking the question. Maybe just to follow up with Brie. Can you talk about your confidence in getting that high capture rate from a domestic price perspective and how you're going to balance that with utilization in the declining volume environment? And maybe you can talk a little bit about competition and if you think there's room to see more of that creep in here as more packages go that are lighter weight and in shorter distance and the e-commerce growth you continue to see.\n\nAnd then separately, you mentioned the Teamsters negotiation. We'd really like to hear more about how you're approaching that, both in the near term to make sure that you're able to protect your own service and longer term if that presents any opportunities to gain share.\n\nBrie Carere -- Executive Vice President and Chief Marketing and Communications Officer\n\nYeah. So, from a pricing perspective, right now, we do anticipate a high capture on our GRI here in the United States and around the world. Our GRI was 6.9 in the U.S., and it's about that around the world, a little bit higher in some places, a little bit lower. With the inflationary environment, most customers understand the need for a high GRI.\n\nThat being said, I really got the team focused on two things. One, as I mentioned a moment ago, is differentiation. We command a higher yield when we have a better service and a differentiation, and the marketing team is very, very focused on executing that so we can command a higher yield in the market. Two, as I talked about in June and then I also talked about the anomaly price detection engine, we are building new capabilities to make sure that we align cost and price really closely, and we're continuing to build some new features out this year, which will also help us get a lift from a revenue quality perspective.\n\nWe want to be really, really balanced. We also acknowledge that some of our customers are going to have to choose our deferred portfolio, and we're working really hard to get the cost and the margins right in that product. As far as how we're going to handle the negotiations, we're going to do it professionally and with grace. We want to bring customers on that want to do business with us for the long term.\n\nAnd so, of course, for our target segments, small business, healthcare, B2B, we want them to be prepared. We want to protect, first and foremost, our loyal base right now. And, you know, Jill and her team will have really thoughtful conversations with those customers and make sure that they know we are here for them if they plan ahead and they want to do business with us in the long term.\n\nOperator\n\nThis concludes the Q&A portion of today's call. I will now turn the call back over to Raj Subramaniam for closing comments.\n\nRaj Subramaniam -- President and Chief Operating Officer\n\nWell, thank you very much. And I'll just say in closing that our team is moving with urgency to accelerate our ongoing transformation. We have made strong progress to date, and we'll build on this momentum as we move into the back half of the year. We all know there's a significant opportunity ahead, and I'm very confident in our team's ability to execute.\n\nThank you all for your time today. Thank you for your interest in FedEx. And happy holidays, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nUnknown speaker\n\nMickey Foster -- Vice President, Investor Relations\n\nRaj Subramaniam -- President and Chief Operating Officer\n\nBrie Carere -- Executive Vice President and Chief Marketing and Communications Officer\n\nMike Lenz -- Executive Vice President and Chief Financial Officer\n\nTom Wadewitz -- UBS -- Analyst\n\nHelane Becker -- Cowen and Company -- Analyst\n\nJordan Alliger -- Goldman Sachs -- Analyst\n\nKen Hoexter -- Bank of America Merrill Lynch -- Analyst\n\nScott Group -- Wolfe Research -- Analyst\n\nBrandon Oglenski -- Barclays -- Analyst\n\nAllison Poliniak -- Wells Fargo Securities -- Analyst\n\nDavid Vernon -- AllianceBernstein -- Analyst\n\nJack Atkins -- Stephens, Inc. -- Analyst\n\nChris Wetherbee -- Citi -- Analyst\n\nAmit Mehrotra -- Deutsche Bank -- Analyst\n\nScott Schneeberger -- Oppenheimer and Company -- Analyst\n\nBrian Ossenbeck -- JPMorgan Chase and Company -- Analyst\n\nMore FDX analysis\n\nAll earnings call transcripts"
}