{
  "companyName": "General Mills",
  "companyTicker": "GIS",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/20/general-mills-gis-q2-2023-earnings-call-transcript/",
  "content": "Editor's Note: General Mills held two different calls for its earnings presentation and Q&A. This transcript has been updated to reflect information from both calls. \n\nGeneral Mills (GIS -0.63%)\nQ2 2023 Earnings Call\nDec 20, 2022, 9:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to the General Mills second quarter fiscal 2023 earnings Q&A webcast. During the presentation, all participants will be in a listen-only mode. Afterwards, we will conduct a question-and-answer session. [Operator instructions] As a reminder, this conference is being recorded Tuesday, December 20, 2022.\n\nI would now like to turn the conference over to Jeff Siemon, VP of investor relations. Please go ahead.\n\nJeff Siemon\n\nGood morning! This is Jeff Siemon, Vice President of Investor Relations. Thank you for listening to General Mills’ prepared remarks for our fiscal 2023 second-quarter earnings. Later this morning we will hold a separate, live question-and-answer session on today’s results, which you can hear via webcast on our investor relations website. Joining me for this morning’s presentation are Jeff Harmening, our Chairman and CEO, and Kofi Bruce, our CFO. Before I hand things over to them, let me first touch on a few items.\n\nOn our website, you will find our press release that posted this morning, along with a copy of the presentation and transcript of these remarks. Please note that today’s remarks will include forward-looking statements that are based on management’s current views and assumptions. The second slide in today’s presentation lists several factors that could cause our future results to be different than our current estimates. And with that, I will turn it over to Jeff.\n\n\nJeff Harmening\n\nThank you, Jeff and good morning, everyone. Let me start by summarizing today’s key messages.\n\nBuilding on a good start to the year in Q1, we delivered strong results in our second quarter, including doubledigit growth in organic net sales and adjusted diluted earnings per share. We also delivered a second consecutive quarter of gross margin expansion, representing continued progress toward restoring our prepandemic margin profile.\n\nThe operating environment remains volatile. While we’ve seen some modest improvement in recent months, it is still far from pre-pandemic conditions, particularly at our up-stream suppliers. In this context, our team continues to execute well and we remain focused on advancing our Accelerate strategy and delivering on our fiscal 2023 priorities.\n\nGiven our strong first-half results and positive momentum on our business, we are once again raising our fullyear guidance for organic net sales, adjusted operating profit, and adjusted diluted EPS growth.\n\nSlide 5 summarizes our financial performance for the second quarter and the first half of fiscal ’23. We drove 11 percent organic net sales growth in the quarter, fueled by strong net price realization in response to significant levels of input cost inflation. Adjusted operating profit was up 7 percent and adjusted diluted EPS was up 12 percent, each in constant currency. Our first-half results were also strong, with double-digit growth in organic net sales and adjusted diluted EPS.\n\nOverall, while it’s encouraging to see some signs of supply chain improvement recently, we expect the pace of change in the operating environment to remain high for the foreseeable future. As we’ve said in the past, our job is not to predict the future better than our competition, but instead to be better able to adapt to change and deliver winning results regardless of the environment. That has been our recipe for success in recent years, and we’re focusing on continuing that success in fiscal 2023 and beyond.\n\nWe are continuing to drive our Accelerate strategy this year by executing on the three priorities outlined on slide 7:\n\nI’m pleased to say that we are making progress against each of these priorities through the first half.\n\nWe’re competing effectively once again in fiscal 2023, building on four consecutive years of strong market share performance. We are holding or gaining share in 37 percent of our priority businesses through the first half, but that includes a share decline in Cereal, where we’re comparing against our unusually strong share gains in the U.S. a year ago when a key competitor was dealing with significant service challenges. On a 2-year basis, our market share in Cereal is still up, and after adjusting for that change, we are holding or gaining share in 54 percent of our priority businesses, including a broad array of platforms in the U.S. and internationally.\n\nIn addition to executing for today, we continue to make strategic investments to strengthen our brands and our competitive advantages for the future.\n\nAnother important way we are investing for the future is through our commitment to Standing for Good. For decades, General Mills has taken action to reduce hunger and food insecurity in our communities through grants, corporate contributions, and food product donations.\n\nWe work with food banks in more than 40 countries to expand food security and build long-term resilience for the future. One example is Feeding America. General Mills was a founding member of this U.S. hunger-relief organization more than 40 years ago. More recently, we supported the creation of Feeding America’s MealConnect, a solution for the nation’s charitable food system that allows member food banks to coordinate and receive donations from their local food businesses and grocers.\n\nAs the only food-rescue technology available nationwide, MealConnect serves more than 12,000 nonprofits and has enabled the recovery of more than 3.5 billion nourishing meals since its launch in 2014. In addition to providing monetary support, General Mills helped co-create MealConnect’s Logistics function, which works to reroute rejected or damaged — but perfectly safe — food products for donation at food banks.\n\nStanding for good is a critical pillar of our Accelerate strategy and is an important way we are investing for our future — for our company, our planet, and for our communities.\n\nSwitching gears, I’d like to spend a few minutes highlighting several businesses where we are consistently competing effectively and investing for the future, led by North America Retail.\n\nAs we’ve shared in the past, we’ve built a multi-year success story in Cereal behind strong innovation, renovation, and investment in what we believe are the best brands in the category. In fact, annual Nielsenmeasured retail sales for our U.S. cereal business are up 20 percent since fiscal 2018 to more than $3 billion dollars. We’ve gained two-and-a-half share points over that time and solidified our #1 position in the category.\n\nWe’re bringing more compelling news and innovation to the cereal category in fiscal 2023. Cheerios, which is by far the largest brand in the category, continues to keep its heart-health messaging fresh for consumers, while Cinnamon Toast Crunch, the second-largest brand in the category, is engaging new consumers with its crazy squares. In addition, we’ve launched 3 of the top 5 new products in the category so far in fiscal ’23, and we are particularly excited about our second-half innovation plans. Our new Minis platform brings consumers miniature versions of their favorite cereal brands, providing a fun, new way to enjoy the big flavors they love. We’ve seen exceptional retail acceptance for these new products and they’re already among the top turning items in their first few weeks on shelf.\n\nWe’ve grown retail sales for our Pillsbury U.S. Refrigerated Dough business by nearly 50 percent over the past five years, to nearly $2 billion dollars, and we’re working on our 5th consecutive year of market share gains after having added 5 points of share in the past 4 years.\n\nPillsbury provides convenience and joy to families — for special occasion and everyday meals. We’re having another strong key baking season this year, and we’re bringing the brand more regularly into consumers’ everyday meal routines.\n\nOur most recent messaging with consumers highlights the many ways to conveniently “make homemade” using Pillsbury dough products outside the oven. And we are leveraging our data and connected commerce capabilities to personalize our messages. For example, by targeting our “make homemade” messaging to consumers who recently purchased an air fryer, we were able to drive lower cost-per-click and convert a higher share of our new Pillsbury consumers, further building confidence in the value of our first-party data.\n\nOur Fruit Snacks platform is an underappreciated local gem in our portfolio…like Pillsbury dough, but on a smaller scale. Here, too, we’ve generated tremendous growth in recent years, with our retail sales in U.S. fruit snacks up nearly 70 percent since fiscal 2018 to more than $800 million dollars, and our market share up almost four-and-a-half points to 54 percent of the category.\n\nWe accomplished these results despite being capacity constrained for much of that time. But we completed a $100-million-dollar capacity expansion on fruit snacks in Q1, which has allowed us to execute new channel expansion plans for e-commerce and convenience stores.\n\nYear-to-date, we’ve driven a 44 percent increase in our e-commerce retail sales on fruit snacks by optimizing our online shelf and consumer experience, leveraging our connected commerce capability. We’ve also expanded our fruit snacks presence in impulse channels, launching new peggable packaging that has helped us drive a 12-point increase in fruit snacks market share in convenience stores.\n\nWith strong momentum, growing consumer demand, and plans for further capacity expansion ahead, we are excited about the continued runway for growth on fruit snacks.\n\nAnother business that has a long runway of growth is Blue Buffalo pet food. The trends toward humanization and premiumization in the pet food category are strong and will continue to grow – in the U.S. and around the world. We are focused on leading and expanding our presence in high-quality, natural feeding and treating for dogs and cats.\n\nWe are led by our purpose to Love them Like Family, Feed them Like Family, which is the reason Blue Buffalo ranks as the #1 brand pet parents are likely to recommend, the top brand pet parents will pay more for, and the most Loved and Trusted Natural Brand in the category. This has helped us drive terrific growth since we acquired the business in 2018, with our Pet net sales up by $1 billion dollars through fiscal 2022.\n\nWhile we continue to believe in the long-run growth opportunity for our Pet business, we experienced an unexpected headwind in Q2 in the form of inventory reductions at some key retailers. As a result, while our allchannel retail sales grew at a high-single-digit rate in the quarter, our net sales were essentially flat.\n\nBeyond the unexpected retail inventory decline, our Pet results in Q2 largely reflected the continued impact of the capacity limitations and resulting customer service challenges that we called out on our first-quarter earnings call. Because of these service challenges, we pulled back on media and in-store support so as not to amplify our issues with on-shelf availability. While these headwinds have been felt across our Pet business, they’ve been particularly acute on our Dry Dog Food and Treats sub-segments.\n\nAs we move into the second half of fiscal 2023, we expect to get back to double-digit net sales growth on Pet, supported by better customer service, stronger product news, increased brand support, and stable retail inventory levels. We expect our customer service will improve because of the external manufacturing capacity we’ve added on dry dog food and treats. To further improve service, we recently added a new distribution center and expanded capacity at our existing warehouses.\n\nWe initially prioritized customer service improvement on Life Protection Formula, which makes up more than half of our dry dog food retail sales, and we’ve seen encouraging volume growth on that business in Nielsenmeasured channels in the past 6 weeks. We’re now expanding our service improvement focus to the rest of our Dry Dog portfolio and to Treats, leveraging our increased capacity.\n\nImproved customer service will also allow us to step up our media and in-store support, including a strong double-digit increase in media investment on Pet in the back half. And we have an exciting lineup of innovation and renovation launching across dog food, cat food, and treats.\n\nOur back-half news on Pet starts with significant renovation and innovation on our Wilderness dry dog food line. We’re adding 20 percent more meat to our core Wilderness dry dog food products, and we’re ramping up spending behind this news. We’re also launching Wilderness Premier Blend, a new, super-premium offering that includes kibble, plus a new, proprietary tender meaty piece that dogs love, in a convenient all-in-one solution pet parents will love too.\n\nOn cat food, we’re renovating our core dry portfolio and relaunching it under the Tastefuls equity. This launch builds on the success of the Tastefuls wet cat food line we introduced in 2021. Blue Tastefuls now offers a complete portfolio of feeding options for cats that provides the perfect combination of great taste and healthy ingredients. The new packaging is just starting to hit shelves now, and we’ll support the news with media and in-store activations in the coming months.\n\nAnd on Treats, our added capacity will help us drive improved customer service on our Nudges, True Chews, and Top Chews products, which now carry the Blue Buffalo shield. With better on-shelf availability, we’ll be able to turn on national media support and in-store merchandising, leveraging the Blue Buffalo master brand, which will help amplify awareness of these highly differentiated products.\n\nWe remain bullish about the growth prospects for our Pet business. With a retailer inventory reduction and the worst of our capacity and service challenges behind us, and with exciting innovation and brand-building investment behind the strongest natural brand in the category, we’re poised to continue Pet’s track record of outstanding growth — in fiscal 2023, and over the long term.\n\nTaking a step back, I continue to be pleased with how we’re executing our Accelerate strategy to drive profitable growth on our core while continuing to reshape our portfolio.\n\nNow let me turn it over to Kofi to provide more details on our second-quarter results and our increased guidance.\n\nKofi Bruce\n\nThanks, Jeff. And hello everyone.\n\nOur second-quarter financial results are summarized on slide 18. Note that there were a handful of events that impacted our year-over-year comparisons this quarter. These included the acquisition of TNT Crust, as well as the divestures of our European yogurt business, our international dough businesses, and the Helper and Suddenly Salad business in North America. We also had an impact from the international Häagen-Dazs ice cream recall that we announced last quarter. We do not expect any further material impact from the recall in the remainder of the year.\n\nNow let’s move on to our Q2 results. Reported net sales of $5.2 billion dollars were up 4 percent, and organic net sales grew 11 percent in the quarter, reflecting continued positive price/mix in response to significant input cost inflation, partially offset by lower volume.\n\nAdjusted operating profit of $880 million dollars was up 7 percent in constant currency, with benefits from positive price/mix partially offset by higher input costs, lower volume, and higher SG&A expenses, including a double-digit increase in media investment. Adjusted diluted earnings per share totaled $1.10 in the quarter and were up 12 percent in constant currency.\n\nSlide 19 summarizes the components of our net sales growth in the quarter. Organic net sales were up 11 percent, reflecting 17 points of positive organic price/mix, partially offset by a 6 percent decline in organic pound volume. Foreign exchange reduced net sales by 1 point, and the net impact of acquisitions and divestitures was a 5-point headwind to second-quarter net sales.\n\nNow let’s turn to our segment results, beginning with North America Retail on slide 20.\n\nNAR continues to perform exceptionally well, with our brands delivering for consumers and the business executing successfully amid ongoing volatility in the operating environment. Organic net sales grew 13 percent in the quarter, driven by positive price/mix, partially offset by lower volume. Despite elevated levels of inflation-driven pricing, elasticities continue to remain below historical benchmarks.\n\nGrowth in NAR this quarter was broad based, with double-digit net sales growth in U.S. Snacks, U.S. Meals and Baking Solutions, and U.S. Morning Foods, and mid-single-digit net sales growth in Canada in constant currency. We continue to compete effectively, with 67 percent of our North America Retail priority businesses holding or growing share so far this fiscal year, when adjusting for Cereal on a two-year basis.\n\nSecond-quarter constant-currency segment operating profit increased 24 percent, driven by positive price/mix and HMM cost savings, partially offset by high input cost inflation, lower volume, and higher SG&A expenses.\n\nSlide 21 summarizes our Pet segment results. As Jeff mentioned, Pet net sales in Q2 were negatively impacted by a reduction in retailer inventory. All-channel retail sales were up high-single digits in the quarter.\n\nWe expect Pet net sales growth to accelerate in the second half behind increased capacity, improved customer service, strong innovation and renovation news, and increased brand-building investment. Additionally, we expect retailer inventory levels to remain stable in the back half of the year.\n\nOn the bottom line, second-quarter segment operating profit totaled $87 million dollars compared to $132 million a year ago, driven primarily by high-teens input cost inflation, a significant increase in costs related to capacity expansion and supply chain disruptions, and lower volume, including the impact of the retailer inventory reduction. These headwinds were partially offset by positive price/mix. We expect to deliver profit growth on Pet in the back half with stronger volume performance, less headwind from capacity and supply disruption costs, and better alignment between price/mix and inflation.\n\nMoving on to our North America Foodservice segment results on slide 22, organic net sales grew 17 percent in the quarter. As we expected, this quarter’s performance included greater price/mix benefit on our non-flour business compared to Q1, and less benefit from market index pricing on bakery flour, which is dollar profit neutral.\n\nSegment operating profit for the quarter was up 20 percent, driven by positive price/mix, partially offset by higher input costs and higher SG&A expenses.\n\nSecond-quarter International segment results are summarized on slide 23. Organic net sales were up 5 percent this quarter, driven by good growth in Brazil, our Distributor markets, and Europe & Australia, partially offset by a decline in China due to continued consumer mobility restrictions due to zero COVID policy as well as the impact of the international ice cream recall.\n\nSecond-quarter segment operating profit totaled $18 million dollars compared to $59 million a year ago, driven by higher input costs and lower volume, including the impact of divestitures and the ice cream recall, partially offset by positive price/mix and lower SG&A expenses. With comparisons against the Yogurt divestiture and the Ice Cream recall now behind us, we expect to generate profit growth in International in the back half of F23.\n\nSlide 24 summarizes our joint venture results in the second quarter. Cereal Partners Worldwide net sales were up 2 percent in constant currency, driven by favorable price/mix, partially offset by lower volume. HäagenDazs Japan net sales were down 10 percent in constant currency as the business lapped strong new product performance last year.\n\nSecond-quarter combined after-tax earnings from joint ventures totaled $25 million dollars compared to $33 million dollars a year ago, primarily driven by unfavorable foreign currency exchange as well as lower constant currency profit at HDJ, partially offset by favorable CPW price/mix.\n\nTurning to total company margin results on slide 25, our second-quarter adjusted gross margin increased 100 basis points versus last year to 33.2 percent, driven by positive price/mix and HMM cost savings, partially offset by mid-teens input cost inflation, higher other cost of goods sold, and supply chain deleverage. While this is our second quarter of gross margin improvement, our adjusted gross margin is still below pre-pandemic levels, and we have more work to do to restore our historical margin profile.\n\nAdjusted operating profit margin increased 60 basis points in the quarter to 16.9 percent, driven by higher adjusted gross margin, partially offset by higher SG&A expenses.\n\nSlide 26 summarizes other noteworthy Q2 income statement items:\n\nOur first-half F23 results are summarized on Slide 27. Net sales of $9.9 billion dollars were up 4 percent, including a 5-point headwind from net divestiture and acquisition activity and 1 point of unfavorable foreign currency exchange. Organic net sales increased 11 percent, driven by positive organic price/mix, partially offset by lower organic pound volume. Year-to-date adjusted operating profit of $1.8 billion dollars increased 8 percent in constant currency. And adjusted diluted earnings per share of $2.21 were up 13 percent in constant currency. \n\nTurning to the balance sheet and cash flow on slide 28.\n\nOn slide 29, you can see our increased guidance for fiscal 2023. We now expect organic net sales to increase 8 to 9 percent, reflecting better volume performance and improved price/mix relative to our prior outlook. We continue to expect elasticities will remain below historical levels over the remainder of this fiscal year.\n\nWe now expect adjusted operating profit to increase 3 to 5 percent in constant currency, reflecting stronger topline performance. We continue to expect total input cost inflation of 14 to 15 percent of total cost of goods sold, HMM cost savings of 3 to 4 percent of COGS, moderately lower supply chain disruptions versus last year, and increased investment in brand building and other growth-driving activities.\n\nConstant-currency adjusted diluted earnings per share are now expected to increase 4 to 6 percent. This updated outlook reflects stronger profit growth and higher net interest expense, which is now expected to total more than $400 million dollars for the full year, reflecting rising interest rates. Our guidance for both adjusted operating profit and adjusted diluted EPS both include a 3-point net headwind from divestitures and acquisitions and an estimated 1-point headwind from the ice cream recall.\n\nFinally, we continue to expect free cash flow conversion will be at least 90 percent of adjusted after-tax earnings.\n\nLet me now turn it back to Jeff for some closing remarks…\n\nJeff Harmening\n\nThanks, Kofi. Let me close with a few thoughts.\n\nI continue to be pleased with how we’re executing our Accelerate strategy and driving profitable growth, including delivering strong results again in Q2. We’re competing effectively, building on four consecutive years of positive market share performance, and we continue to invest for the future. While we have work to do to overcome some short-term headwinds in Pet and International, we’ve taken actions to drive stronger results in those segments in the second half of this year.\n\nI’m also pleased that we are once again raising our guidance for the full year, building on our strong first-half results and compelling plans for the back half.\n\nThank you for your time this morning. This concludes our prepared remarks. I invite you to listen to our live question-and-answer webcast, which will begin at 8:00 a.m. Central time this morning and will be available for replay on our Investor Relations page at GeneralMills.com.\n\nJeff Siemon -- Vice President, Investor Relations\n\nThank you, Kelly, and good morning, everyone. Thanks for joining us today for the Q&A session on our Q2 fiscal 23 results. I hope you all had a time to review the press release, listen to our prepared remarks, and view the presentation materials, which were made available this morning on our IR website. Please do note that in our Q&A session, we may make forward-looking statements that are based on our current views and assumptions.\n\nPlease refer to this morning's press release for factors that could impact forward-looking statements and for reconciliation of non-GAAP information, which will be discussed on today's call. I'm here with Jeff Harmening, our chairman and CEO; Kofi Bruce, our CFO; and Jon Nudi, group president of our North America retail segment. Let's get to the first question, Kelly. So, please get us started.\n\nThanks.\n\nOperator\n\nThank you, sir. [Operator instructions] Our first question comes from Andrew Lazar with Barclays. You may proceed with your question.\n\nAndrew Lazar -- Barclays -- Analyst\n\nThank you. Good morning, everybody, and happy holidays.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nHappy holidays, Andrew.\n\nKofi Bruce -- Chief Financial Officer\n\nHey, Andrew.\n\nAndrew Lazar -- Barclays -- Analyst\n\nI think just to kick it off, I guess, I appreciate that capacity constraints can often lead to a gap between shipments and retail takeaway, but obviously, the differential in pet was far greater than anticipated. So, I'm trying to get a sense of why would retailers pull back on orders when capacity is constrained, and demand remains so strong. And does this pose any risk ultimately to the demand side of the equation? And then I've just got a quick follow-up.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYeah. Sure, Andrew. Thanks for the question. I would say, ironically, in the second quarter, a lot of what occurred, in fact, we anticipated, including retail sales and the fact that we were capacity constrained.\n\nAnd as we look ahead, we guided to double-digit growth for the second half of the year, by which I mean starting in Q3, given the strong level of innovation we have and the fact capacity is online, and we've got really good advertising and marketing support. The one thing that was different than we expected was a drawdown in retail inventory you pointed out to. But we don't -- first of all, most importantly, we don't think that this is a long-term trend. We think it is something to happen this quarter.\n\nIn terms of the rationale why, I would say, in general, the retailers have carried a little bit less inventory across the board during this time only because with inflation, what you don't want to do is carry a lot of working capital. And so -- but certainly not 8 points worth of differential. The other reason I would say is that because we lack capacity, there are a lot of categories like treats, for example, where normally we would merchandise a lot during this time of year, but we couldn't do that. And so not only do we not -- were we not able to service demand, but we had to pull back on merchandising.\n\nAnd a lot of times, retailers carry more inventory when they're going to merchandise. And so, you really see that in our treats business. And then the third reason is we had a couple of big retail customers and we have a more mass merch orientation that didn't take inventory coming into the season because they had warehouses full of other things. It's a little bit different customer set than our North America retail business, for example.\n\nAnd so that's why we don't see it on the North America retail side. So, those are really the laundry list, if you will, of reasons why inventory was less. But as you can imagine, we've done a very deep dive on inventory levels by customers. And I can tell you, we don't think there's going to be a repeat performance of that nature in the third quarter.\n\nIn fact, that's why we're comfortable guiding up double-digit sales growth again.\n\nAndrew Lazar -- Barclays -- Analyst\n\nThank you for that clarity. And then, I think you were looking for flattish gross margins or so for the full year if we were thinking about last quarter's conference call, obviously, with the upside to gross margins in this quarter despite the pet constraints on profitability. Could we see gross margins likely up year over year for the full year at this stage? Thanks so much.\n\nKofi Bruce -- Chief Financial Officer\n\nSure. Andrew, this is Kofi. Thanks for the question. Certainly, as we look at our revised guidance, that's within the range of possibilities.\n\nAnd while we're not giving specific guidance on gross margin, we're very comfortable we're making good progress against our long-term goal of getting our margin back to pre-pandemic levels. We're still about 150 basis points back there. So, we're going to continue to drive at the things that will help us improve the margin profile as we go forward.\n\nAndrew Lazar -- Barclays -- Analyst\n\nThanks. Have a great holiday.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nThank you, Andrew.\n\nOperator\n\nOur next question comes from Ken Goldman with J.P. Morgan. You may proceed.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nGood morning, Ken.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nHi. I wanted to just ask, you seem confident, understandably why, why the deload won't happen again, and thank you for the clear explanation, Jeff, on what the drivers were. I'm just curious, as you progress into your third quarter, it might be a little early to ask because we're still not at Christmas. But are you seeing any refilling of inventory levels by retailers? If you addressed this already, forgive me, but just trying to get a sense of sort of more real-time data as to what's going on.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYeah. I think a couple of points, Ken. Yeah, we are early in the quarter. Having said that, there are a couple of things that give us confidence in our forecast for the third quarter.\n\nThe first I would start with Life Protection Formula, which is our biggest dry business. And we've seen -- over the last six weeks, we've seen demand really rebound quickly. And that's important because that's the first business that we could bring back up to appropriate service levels. And so, that gives us confidence.\n\nIn addition to that, we -- I did tell you we were going to grow double digits in the third quarter. And I can report that we're only about three weeks into December. So, it's -- but three weeks is not nothing, and I can tell you, we're on track to deliver what we said we're going to do in the third quarter, which again gives us more confidence that we're going to be able to do what we say we're going to do and that we've seen the pipeline of inventory start to refill itself because we're able to service the business better, and it's especially true on treats.\n\nJeff Siemon -- Vice President, Investor Relations\n\nAnd Ken, I'd add just to put some numbers on it, this is Jeff Siemon. For Life Protection Formula, the movement in Nielsen-measured channels in the last month is up almost 20% and volume has been positive and accelerating recently now that we've gotten service back in the 90s. So, just to put some dimensions on it, it's been encouraging to see that business grow basically in line with or even ahead of where the category is growing overall.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nThank you. And then a quick follow-up. Just how do we think about the impact of adding more production from co-manufacturers and maybe restepping on the marketing pedal for your pet food business in the third and fourth quarters, obviously, hopefully, there will be a better volume turnaround, and that will help as well? I'm just trying to get a general sense of, I guess, how to model those margins given all the puts and takes.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nSo, let me start and then Kofi can give you some more thoughts on the margin. I would say how to think about the whole basket. I would say, clearly, we anticipate our reported net sales to improve to double digits in the second half of the year behind all of the activity we talked about. Given that we went -- we've gone externally both in treats and more importantly, in dry dog food to get capacity sooner, that obviously helps our service levels.\n\nExternal capacity doesn't tend to be as profitable. So, I wouldn't anticipate our gross margins to rise as proportionately as our sales would rise. But the benefit is that we're getting back, and we're satisfying pet parents sooner. The other thing I would say is that to the extent that we increase advertising in the third quarter, and I think we have some really nice advertising.\n\nWe're going to increase that double digits in the third quarter. I wouldn't expect our operating profit margin to rise as fast -- it should get better, a lot better, but it probably won't rise as fast as the sales growth in the near term, but that's a choice that we're making. And our choice is to get back to growth first and making sure we can get that flywheel going again. So, Kofi, you want to add any color to that?\n\nKofi Bruce -- Chief Financial Officer\n\nYeah. And that said, we do expect profit growth in our pet business in the back half of fiscal '23. Some of the key things you'll see is we'll expect price/mix to catch up with inflation. We've got another effectively round of pricing coming through at the beginning of calendar year '23.\n\nWe don't expect the pressure on supply chain to be as acute. So, we won't see as much sort of drag from other cost of goods sold. And of course, we're not expecting the inventory depletion and the pressure that and deleverage that comes with that headwind. So as a result, we would expect our second half top-line growth should give us still a solid profit growth even if it's slightly behind the top-line growth.\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nThanks so much. Happy holidays.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nThank you.\n\nKofi Bruce -- Chief Financial Officer\n\nYou, too.\n\nOperator\n\nOur next question comes from Max Gumport with BNP Paribas. You may proceed.\n\nMax Gumport -- Exane BNP Paribas -- Analyst\n\nHey, thanks for the question, and happy holidays. And going -- sticking with pet, you just mentioned another round of pricing you expect to come online in CY '23, I believe, and there's a narrative that the pet food industry in the U.S. could be on the horizon of getting more competitive due to potential supply/demand imbalances. I'm wondering if you can provide any color on what you're seeing on that front.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYeah, Max, thanks for the question. As we -- when you say more competitive, first of all, I would say that category is always competitive. There are a lot of great competitors in the category. Having said that, I suppose the question comes down to, you're talking about price competitive or something like that.\n\nWhat I would say is that we continue to see the premium end of the category grow. And we see Blue Buffalo's present life protection formula, again, continue to accelerate once we get supply back online. And in general, we see the premium part of the category doing quite well. And it's a category that really lends itself is a fairly inelastic category.\n\nAnd that's because pet parents really, really care about what they feed their pets. And so, I don't anticipate between the nature of the category and the fact that we're still seeing inflation. Our inflation for the company in the back half of the year will be up double digits. And so, it's not as if we're answering into a deflationary environment.\n\nWe're all still making -- we're all still kind of recovering service levels. So, the supply chain -- we're not in an overcapacity situation. Supply chains still have some catching up to do. So, because we see inflation, because of the nature of the consumer, because of the nature of the supply chain, even though it's always a competitive category, I wouldn't see it getting more competitive in terms of pricing in the near term only because of all of those factors.\n\nMax Gumport -- Exane BNP Paribas -- Analyst\n\nGreat. Thanks very much. And one follow-up. So, you mentioned that you expect the price elasticities to remain below historical levels during the remainder of FY '23 and also that they're particularly benign in North America retail.\n\nI'm wondering what you're seeing on this front in your international businesses, particularly European cereal as we've heard some commentary of a return to normal levels of elasticities in those markets from other industry participants. Thanks very much.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYeah. I guess I would say, in general, not commenting on cereal specifically, I guess, but in general in Europe. First of all, we say the economic situation in Europe is more challenging than it is here, particularly driven by energy prices and unemployment, that's a little bit higher than it is in the U.S. So, I would start with that.\n\nThe second, I would say, is that elasticities in Europe tend to be a little bit higher than they are in the U.S. normally, and we're seeing that in this environment as well. And that kind of plays itself out across categories. And so, whether it's cereal or bars or ice cream.\n\nSo, we -- so, I would say the situation in Europe is a little more challenging than it is here, but it really has to do with a combination of macroeconomic backdrop, combined with elasticities in general, tend to be a little higher. But I would say directionally, we're seeing the same kinds of things there that we see here.\n\nMax Gumport -- Exane BNP Paribas -- Analyst\n\nGreat. Thanks very much and happy holidays.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYup. Thank you. Happy holidays.\n\nOperator\n\nOur next question comes from Robert Moskow with Credit Suisse. You may proceed.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHey, good morning. [Inaudible]\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nHi, Rob.\n\nHi. You mentioned some new pricing actions in pet. Do you expect to take more pricing actions in North America retail as well? The public comments from the grocers sound increasingly concerned about higher pricing and the impact on their consumers. So, I wanted to know if there's any blowback on that.\n\nAnd then also, in the past, there's been unusual deloading in January by some retailers to protect balance sheets. I think you mentioned it here today. Do you see any risk of that happening as well?\n\nSo, Rob, I would say as it relates to pricing, I mean, we've announced some pricing on pet. We've announced that to our retail customers already to take effect, I think, February 1. So, we've announced that already. In terms of -- but I will also remind you that when we started the year, we said that for most of this fiscal year, we've taken most of the pricing that we need to take in the market already for this fiscal year.\n\nSo that also remains true. But I will also say in the back half of the year, we're expecting double-digit inflation. So, it's not as -- it may decelerate from where it is now, but then decelerating to double digits is not exactly zero. And even as we look across a longer horizon, I don't want to play Nostradamus with inflation rates.\n\nWhat I will say, though, is even looking out past six months, it's pretty clear to us that we'll still see an inflationary environment. It may or may not be as robust as it is now, but it will still be an inflationary environment, driven quite a bit by wage increases. So, it's hard for us to see an environment where we don't see inflation. Even if that inflation -- those inflationary levels may not be exactly what we've experienced over the last six months.\n\nAnd so, as we look at our business, we'll continue to look at pricing. But the key is that the pricing has to be justified. And this has always been the case. But it has to be justified based on the cost that we're seeing.\n\nAnd we find with our retail customers if we can justify the cost that we're seeing and that they know that we're investing in the growth of our categories, which we are through double-digit consumer spending increases, launches like minis and cereal and like the innovation we have in Pillsbury and in Blue Buffalo, then the conversations are a lot more productive than otherwise. So that's, I guess, what it was a long-winded answer to a fairly straightforward question on pricing. With regard to retailer inventories, I would say we have seen a little bit less retail inventory because of this inflationary environment. But I would say as we look forward, we've probably seen -- I don't think that's a risk to our go forward either on Blue Buffalo or our business in general.\n\nSo that's kind of some generalities. Jon Nudi, anything you want to add to that?\n\nJon Nudi -- Group President, North America Retail\n\nNo, I think you hit it. I would just say that our SRM capability is something I'd point to is much more sophisticated than it was a few years ago. So, as inflation continues to come, we'll leverage the entire toolbox. So, it's not just list pricing, it's promotional optimization and mix and pack price architecture.\n\nAnd by leveraging all those tools, we believe that we'll be able to combat inflation as we move forward as well. And in terms of retailers, as Jeff mentioned, I mean, is pricing has never been easy. And even over the last couple of years that we've seen significant inflation. But if we can bring in a strong market basket story, we have had success moving pricing through the market.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nCan I ask a follow-up? In the past, have you been able to go to retailers and show labor inflation internally and use that as a rationale for raising price? It seems like that's something new.\n\nJon Nudi -- Group President, North America Retail\n\nYeah, Rob, I think the scale of the inflation is different today, right? So, we're seeing a double-digit inflation. And historically, over the last decade or so, we haven't seen a lot of inflation. It's been low single digits. So, it really hasn't been a conversation because there really hasn't been enough inflation to take significant action.\n\nI think with the scale of the inflation we're seeing today and the sophistication, as I mentioned as well, we're able to really break down where we're seeing inflation and some things are starting to moderate. But at the same time, you're seeing things like labor, certainly, sprout remains sticky, and it's in the equation. And we've gotten more sophisticated but our retailers have as well. So again, I think we have really good constructive conversations that are really based on facts at this point.\n\nJeff Siemon -- Vice President, Investor Relations\n\nRob, where we see that impacting us is not so much our own labor, but it's the labor at our suppliers, which translates through their pricing to us. So, yes, there's labor inflation in our own facilities, etc., but the much bigger aspect of labor is upstream at the supplier base.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nGot it. Makes sense. Thanks.\n\nOperator\n\nOur next question comes from Michael Lavery with Piper Sandler. You may proceed.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nGood morning. Thank you.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nGood morning.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nI just wanted to come back to the elasticities and maybe understand a couple of things better. You say you don't expect to sort of revert to more normal levels over the second half. I guess -- or at least over the year. And is that just because half the year is done? Or what are you seeing something different maybe structurally? What's driving that expectation? And what would you consider a more normal level to be?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nI think what drives our assumption, Michael, and frankly, it is an assumption, is that we still see the conditions for an elasticity -- relative inelasticity, not complete inelasticity, but relative inelasticity in the marketplace. And those conditions are a continuation of inflation. And even if they're not what we experienced in the first half, they're still double digit. The second is the supply chain, still having supply chain disruptions.\n\nAgain, our service level is in the high 80s. So, that's certainly a lot better than they were a year ago, which was where they were in the 70s, but it's certainly not at 98% either. So, a continuation of supply chain challenges. And also, consumers to be under pressure.\n\nIn fact, it's highly possible consumers will be under more pressure over the next six months. And when that happens, consumers tend to eat at home more rather than eat out more. And so, it's very possible we'll see -- continue to see trading into food eaten at home. So, those are the factors that we see and drive our assumptions that there won't be a significant change in elasticities over the next six months.\n\nBut look, those are the assumptions based on what we see right now.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. Great. That's helpful. And I know China is fairly small, but just would love to get an update on maybe what you're seeing there.\n\nObviously, in the second quarter, there were some of the lockdown, I guess, pressure or the -- certainly, food service challenges from those restrictions. As it's kind of evolving there, any update on the latest of what you're seeing in China and how we should think about that?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nWell, there's been a fairly significant policy change by the Chinese government on COVID and zero COVID. And it's going to be a ride, I think, for the next few months because we've had a population that's gone from relatively no COVID to quite a bit of COVID in the marketplace. And so that now people don't lock down as much. But I think when you have as much COVID as they have, we'll see not as many people venturing out, which is very good for our Wanchai Ferry dumpling business, which is half of our business and not as good for our Haagen-Dazs business.\n\nAnd so, I want to think about that business over the next few months, I think it's going to be a wild ride. But I would think that our dumpling business will do quite well. And our Haagen-Dazs business will maybe be a little bit more challenging over the next few months, but they're about equal in size.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nSince they pivoted on policy, they've conveniently stopped giving information on case counts. But so, I guess, yeah, is it pretty chaotic there? I mean, I guess we're just in for a few months of some uncertainty, but it sounds like you're positioned on either side of that pretty well.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nI think so. I think in the grand scheme, it won't be material for General Mills, the shift from one to another. It may be a little more material for our Chinese market, but it won't be for the company in aggregate. In terms of the case counts, I don't know, but they're clearly going up, and they're going up, they're going up rapidly for the moment.\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nOK. Thanks so much.\n\nOperator\n\nOur next question comes from Pamela Kaufman with Morgan Stanley. You may proceed.\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nHi. Good morning. I wanted to come back to the pet segment. And just to revisit what gives you confidence that you can return to double-digit growth in pet in the second half of the year.\n\nAnd can you decompose how you're thinking about the drivers of that growth? I mean, can you grow volumes with the capacity that you've secured? Or do you expect volumes to continue to decline with the growth driven predominantly by the pricing?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nSo, Pam, what gives me confidence are a combination of factors. And I think the key -- the first key factor is the restoration of our supply chain and of our capacity. And this particularly important in our treats area, and -- but it's also important for dry dog food and cat food as well. But I would start with treats and then go to dry dog and cat food.\n\nSo, the first piece of confidence is that we have gained enough capacity to actually be able to grow volumes in the second half of the year on both of those platforms. And so that's the first piece. The second, though, then it has to be backed up by good marketing. I feel really good about our innovation, really good about what we're doing on the Wilderness brand, I feel good about our change to Tastefuls and cat dry food.\n\nI feel very good about our partnerships with our retail customers to get our treats business kick-started again. We have great products on treats. We've rebranded a lot of what we had bought from Tyson to Blue Buffalo. And so, the branding is really good.\n\nWe've got good programs with our retail customers. So, I feel good about our ability to drive our treats business. And then we're going to increase our brand building by double digits. And we've actually already seen a return to volume growth on Life Protection Formula, and we didn't have innovation on that.\n\nWe didn't have advertising increases on that. All we had is supply. So, I feel like the key is supply and then building on top of that really good innovation, strong in-store execution on treats, and good advertising at good levels on top of that, that gives me quite a bit of confidence that we'll be able to turn around the Blue Buffalo business in short order. And as we've seen through this whole time, even though our second quarter was not what we wanted and not what you all expected, the brand remains really good.\n\nAnd we've done a lot of brand testing. The brand remains really good. The trends toward humanization are really good. So, the tailwinds in the category are still there for us behind a good brand and increased supply and marketing.\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nOK. That's helpful. And you pointed to a lot of innovation that's coming within the pet segment. Is there anything in particular that prompted your plans to step up innovation or were these initiatives already in the works? And how should we think about the margin impact of the innovation? You mentioned you're adding more meat to Wilderness.\n\nHow are you planning to offset these costs? And what is the margin profile versus the existing portfolio?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nWell, I would say on the innovation front, we've had innovation that we've been willing to put in the marketplace for some time. But obviously, we haven't been able to supply the base business where we wanted to. So, adding innovation on top of that is probably not a good idea. In fact, I think the people listening should take a sign of confidence that we can supply our business better because we're bringing this innovation to the marketplace.\n\nAnd we certainly wouldn't do that if we didn't think we could supply it. That would be my first point of innovation. So, we've had this plan for a while. When it comes to the product renovations themselves, I mean, Wilderness is a high-priced, high-margin business.\n\nAnd so, to the extent that the pet parents want more meat in the product, which they do, and we're giving that to them. That should do wonders for our margin profile. In fact, I would tell you that the most important thing that we can do to enhance our margins in pet is to grow pounds. And so, to the extent that we have the supply and the news on a high-price, high-margin brand, that should be just what the doctor ordered for the margins for the pet business.\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYup.\n\nOperator\n\nOur next question comes from Chris Growe with Stifel. You may proceed with your question.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nHi, good morning.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nHi, Chris.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nHi. I want to start first, if I could, with a question on the gross margin, perhaps for Kofi, but just to understand, the sequential change in the gross margin from 1Q. And again, your gross margin was up nicely year over year, and that's been quite unique in the industry. I just want to get a sense of any factors that are worth considering that occurred sequentially.\n\nAnd obviously, the one that stands out, I think, would be around pet. Was that one of the sequential drivers of the softer gross margin absolute performance or any other factors that are worth noting there, if you could, please?\n\nKofi Bruce -- Chief Financial Officer\n\nSure, Chris. You have the plot. Certainly, pet is a contributing factor, but there are also some other structural things around mix of our business as we move from Q1 to Q2. We have a lot more volume from businesses such as soup and baking products, which is, as you know, are heavily merchandised in that seasonal window, so those tend to drive us to a structural step-down in margin as we move from Q1 to Q2.\n\nAnd the other factor, as you rightfully noted, was the acute pressure on pet margins in this quarter.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you for that. And I just had one more follow-up on the pet profit. And you had indicated that the second quarter would be a little softer.\n\nYou had some costs related to getting third parties and co-manufacturing ready, some inventory, and warehousing costs. I guess I just want to get a sense of this second quarter pet profit performance was unique. You'd planned on some of that occurring. So, are a lot of those costs then sort of embedded in the business? Do you have any ongoing costs related to the co-manufacturing outside just that's a lower margin way to supply your business?\n\nKofi Bruce -- Chief Financial Officer\n\nSure. So, I would expect some of those costs to be structural for sure as we go forward. We'll have external supply chain costs related to the step-up in volume that we're getting. But not all of those costs will carry forward.\n\nSome of these costs were related to disruption and enrollment of additional warehousing capacity in that window. So, we would expect, in aggregate, that the drag from those costs will reduce as we step into Q3 and Q4 for this year, which is part of the reason why we also expect profit growth and profit margin improvement as we step into those quarters.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you for the color.\n\nKofi Bruce -- Chief Financial Officer\n\nYou bet.\n\nOperator\n\nOur next question comes from David Palmer with Evercore ISI. You may proceed.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThanks. Just another angle on that gross margin question. If we look at this quarter, your gross margin is still down maybe 80, 100 basis points from pre-COVID levels, tons of cross-currents there, but I'm wondering how you're thinking about that gap and your ability to get back to pre-COVID levels on gross margin. And the things I'm thinking about are you mentioned the supply chain friction costs, but there's going to be maybe some categories out there where you're going to be pricing to protect profit dollars.\n\nAnd so, there's some math going against you. So, I'm wondering if you'll need to see some easing in some key commodities in certain categories. But the other thing I'm also thinking about is you've had some very strong growth in some of your highest-margin categories. So, I could imagine a scenario that you'd be -- particularly as you're doing as well as you're doing with dough that you could be above past peak as you get past some of these friction costs.\n\nSo, any commentary there would be helpful.\n\nKofi Bruce -- Chief Financial Officer\n\nSure, sure. I'll try to do justice to your question. So, as you think about the path forward, obviously, you hit on the first thing and sort of one of the precedent conditions will be a return to something that is a much more stable and closer to historical level of supply chain disruptions. We're still probably running about two times our historic levels well off of the peak of six to seven times where we were last year, but still enough to be meaningful and significant.\n\nAnd we would also expect that once we get out of a short-supply environment, it will be easier to get at HMM and more fully utilize that lever. And that we would expect some of the pandemic-era costs related to servicing the business in a more stable environment will become easier and lower. So structurally, we view our job to kind of claw back about 150 basis points of margin versus our sort of pre-pandemic level. I think the stable environment from a supply chain standpoint will be one of the first and the most important things.\n\nAnd then second, it will be probably a return to more historic levels of inflation, moderation of inflation, which -- who knows when that's coming. But we're certainly positioning our business to make sure that we're taking the cost out as we have the opportunity to do so.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nAnd just a separate follow-up. You talked about investments in your prepared remarks in digital and other capabilities. Could you just give us a sense about what you think the benefits will be from those investments and when and where we'll see that? Thanks.\n\nKofi Bruce -- Chief Financial Officer\n\nSure. So, a lot of the focus of our investments in digital and technology to enable our marketing activity and as well our supply chain efficiency. So, we'll see benefits both in gross margins, and we would expect to see that deliver on growth. And then, I'll ask Jon if he wants to weigh in since we're seeing a lot of investment in our North America retail business.\n\nJon Nudi -- Group President, North America Retail\n\nYeah, absolutely. So as Kofi mentioned, supply chain is a big focus and there's a lot of opportunity for efficiency there. Now, the marketing side is really something we call connected commerce, and it's really the funnel -- the top of the funnel is how we generate demand. And in a digital world, more and more of our marketing is becoming digital marketing, performance-based marketing.\n\nSo, we've invested heavily to acquire first-party data and really make sure that we have a strong marketing engagement platform that we can then serve up relevant messaging at scale and really customized for our consumers. We're seeing really incredible returns from that. Further down the funnel, at the bottom, was actually the transaction that we're kind of ambivalent whether it's in-store or online. The margins are the same.\n\nWe actually overindex from a share standpoint online. But we've developed quite a few digital tools to really understand the digital shelf. We grew up in a world that -- a bricks-and-mortar world that we understand Nielsen and the drivers of our business, digital is different, right? So, we had to develop the dashboards for our teams to really look at the metrics that matter, make sure the digital shelf is correct, make sure that our search metric is where they needed to be. And a lot of that is now digitized.\n\nIt's on our leaders' computers every day in a dashboard form, and they're making real-time adjustments to the business. So, I think you're seeing it actually translate into strong performance in the market today, and will continue to become even more sophisticated as we move forward and continue to invest in this capability.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Cody Ross with UBS. You may proceed.\n\nCody Ross -- UBS -- Analyst\n\nGood morning. Thank you for taking our questions. Can you just clarify or quantify how much the retailer inventory reduction was in pet this quarter? And then also, I apologize if I missed it, which channels or retailers was the inventory reduction in?\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nI'll answer the first part of that question for you. The second one, I'll take a polite pass. On the first part, our retail sales, Cody, were about -- up about 8% during the quarter, and our reported net sales were flat. And so, the difference between that 8 percentage points was a reduction in retailer inventory for the variety of reasons that I stated earlier.\n\nIn terms of which customers and retail, I'm not going to get into a customer-by-customer kind of dissection of that.\n\nCody Ross -- UBS -- Analyst\n\nUnderstood. Thank you for that. And then you mentioned in your prepared remarks adding capacity in fruit snacks and in pet treats and dog food. Can you just discuss holistically across your business how much capacity you are adding? And can you walk us through the planning and analysis that is done to determine which categories that you choose to add more capacity in? Thank you.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nYeah. From a high level, I mean the -- what I would tell you, the best returns that we can generate as a company are adding capacity on platforms that we already know and that are already growing. And the litmus test for me is that if they're growing before the pandemic and they're growing during the pandemic, the chances they grow after a pandemic are quite a bit higher. And you see that in our pet food business, you see that in fruit snacks, you see that in Totino's, you see that in Old El Paso.\n\nAnd so, we have a variety of businesses. You've seen that in our cereal business. And so, we have a variety of businesses that we've seen continued growth, and we've run out of capacity. And frankly, as soon as we've generated capacity, I think fruit snacks is a good example.\n\nWe've added capacity and you will probably need more given the high level of demand. So that's kind of how we look at it. We make sure that all of these growth investments are value enhancing for our shareholders. But to the extent they're growth businesses and are good margin businesses and all of the above are -- meet that criteria, then we're more than happy to invest in our own internal capacity.\n\nCody Ross -- UBS -- Analyst\n\nThank you very much for that. I'll pass it on.\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nThank you.\n\nJeff Siemon -- Vice President, Investor Relations\n\nOK. I think that's all the time we have for this morning. So, Kelly, I think we can go ahead and wrap up. Thanks, everyone, for the time and the good questions, and happy holidays to everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJeff Siemon -- Vice President, Investor Relations\n\nAndrew Lazar -- Barclays -- Analyst\n\nJeff Harmening -- Chairman and Chief Executive Officer\n\nKofi Bruce -- Chief Financial Officer\n\nKen Goldman -- JPMorgan Chase and Company -- Analyst\n\nMax Gumport -- Exane BNP Paribas -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nJon Nudi -- Group President, North America Retail\n\nMichael Lavery -- Piper Sandler -- Analyst\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nCody Ross -- UBS -- Analyst\n\nMore GIS analysis\n\nAll earnings call transcripts"
}