{
  "companyName": "Reynolds Consumer Products Inc.",
  "companyTicker": "REYN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/reynolds-consumer-products-inc-reyn-q2-2022-earnin/",
  "content": "Reynolds Consumer Products Inc. (REYN -1.09%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:00 a.m. ET\n\nOperator\n\nGreetings, and welcome to Reynolds Consumer Products Inc. second quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to your host, Mark Swartzberg, investor relations.\n\nPlease go ahead, sir.\n\nMark Swartzberg -- Vice President, Investor Relations\n\nGood morning, and thank you for joining us for Reynolds Consumer Products second quarter 2022 earnings conference call. On the call today are Lance Mitchell, president and chief executive officer; and Michael Graham, chief financial officer. For our agenda today, Lance will focus on market conditions and our fundamentals, and Mike will review our quarter and outlook. Together, our remarks will be approximately 20 minutes, then we will open it up for your questions.\n\nDuring the course of this call, management may make forward-looking statements within the meaning of the federal securities laws. These statements are based on management's current expectations and involve risks and uncertainties that could cause actual results and outcomes to differ materially from those described in these forward-looking statements. Please refer to Reynolds Consumer Products' annual report on Form 10-K and other reports filed from time to time with the Securities and Exchange Commission and its press release issued this morning for a detailed discussion of the risks that could cause actual results to differ materially from those expressed or implied in any forward-looking statements made today. Please note management's remarks today will focus on non-GAAP or adjusted financial measures.\n\nA reconciliation of GAAP measures to non-GAAP financial measures is available in the earnings release posted under the investor relations heading on our website at reynoldsconsumerproducts.com. The company has also prepared a few presentation slides and additional supplemental financial information, which are posted on Reynolds' website under the investor relations heading. This call is being webcast, and an archive of it will also be available on the website. While we would like to answer all of your questions during the question-and-answer session, in the interest of time, we ask that you ask one question and a follow up and rejoin the queue if you have additional questions.\n\nNow, I'd like to turn the call over to Lance Mitchell.\n\nLance Mitchell -- President and Chief Executive Officer\n\nThank you, Mark. We delivered another quarter in line with our earnings expectations in what continues to be a very dynamic environment. First half and second quarter highlights include continued share strength across our business, share gains in branded waste bags, branded disposable tableware and multiple cooking and baking categories, a return to shipments aligned with consumption, further narrowing of the price to cost gap across most of our business, including a further improvement in waste bag profitability, delivery and expansion of revolution savings. A substantial slowdown in foil consumption has been challenging.\n\nHowever, category declines have been moderating since late June, our branded volume share is growing again, and a number of corrective actions are underway to address this issue. In addition, lower cost inventory had a positive impact on foil margins as we head into the holiday season. I will go into our foil plans and other revenue drivers in a moment. But before I do, I want to highlight a few things about the environment and our unique advantages and position within it.\n\nOur category advisors are diligently working with our retail partners to support our categories and drive traffic. And as you would expect, consumer behavior during these dynamic times is top of mind. That means we are having numerous discussions about the optimum balance of brand and private label, promotions, tax sizes and features and displays. I also want to point out that our price leadership and the cumulative value of our pricing actions, together with declines in aluminum and polyethylene rates, are producing a closer alignment between price and cost, which we have been pursuing since late 2020.\n\nThis translates into an anticipated margin expansion and earnings growth in the fourth quarter, and a significant increase in flexibility to invest in trade, advertising and other category drivers as we plan for the holidays and next year. Michael will elaborate on that shortly. Now, let's talk about our main drivers of growth, pricing, consumer demand, innovation and manufacturing and supply chain capabilities. In the area of pricing, we began increasing foil promotions in June, motivated by the historically strong impact of promotions, and we are encouraged by the consumer and retail response.\n\nWe are implementing additional promotional activity over the balance of the year, including a substantial step-up in October, in order to drive holiday-related demand. We've announced another round of pricing for our tableware products to offset the additional cost increases for polystyrene resin and an additional increase for Hefty brand waste bags. In terms of elasticity, the foil category is demonstrating the largest increase in elasticity, prompting many of our actions. Our other categories are also seeing increased elasticity by comparison to what we were seeing earlier in the year, and we are watching them all closely.\n\nChanges in consumer consumption in our categories has been more dynamic than we have seen historically. We will continue to respond with corrective measures. Turning to consumer demand. As you know, our products are in 95% of U.S.\n\nhouseholds, and we have benefited from the changes in habits triggered by the pandemic. We've been meeting these changes in habits. And as I said earlier, we are uniquely positioned to respond to new opportunities as economic conditions change. We rely on consumer market research, which allows us to better understand who is driving our categories and their needs.\n\nWe stepped up these capabilities during the pandemic and made a number of discoveries. For example, an increased portion of men and younger consumers are more active in the kitchen and home than they were prior to the pandemic. That's a major opportunity in any economic environment. And here are a few examples of how we're responding to it in this environment.\n\nIn foil, as I said, we're stepping up promotions, allowing us to hit lower retail price points and increased purchase frequency. We're also increasing features and displays to drive usage and targeting advertising to reach younger consumers. In waste and storage, we're seeing strong back-to-school demand in branded and private label products and driving the Hefty brand through innovation, larger pack sizes, distribution gains and additional advertising. And in disposable tableware, we're driving party cups with particular emphasis on the club channel.\n\nThe third driver of our growth is innovation. Our standout innovations continue to be Hefty Fabuloso and Hefty ECOSAVE, each of which continues to demonstrate high velocity while also gaining distribution. Other notable contributors in the quarter and year-to-date include new Hefty Fabuloso 4 and 8 gallon waste bags for use in additional rooms of the house, and private label waste bags with odor control. Hefty Fabuloso and Hefty ECOSAVE are delivering as major platforms for innovation, and we plan to expand them.\n\nAnd in terms of new innovation, we just introduced Hefty Compostable Printed Paper plates, Reynolds Kitchen Compostable Wax Paper. And other Reynolds innovations are in the pipeline, and we plan to introduce a wide range of branded and private label products, offering sustainable solutions that are wins for consumers, retailers and RCP alike. Our fourth driver is manufacturing and supply chain capabilities. Staffing and supply chain conditions continue to be challenging, but they are stabilizing and much improved versus late 2020 and 2021 levels.\n\nBefore I pass the call to Michael, I'd like to leave you with the following. We're well positioned for changing economic conditions, and we're responding with promotions, pack sizes, advertising and other pieces of the marketing mix to meet our consumers' increased emphasis on affordability. The gap between our pricing and material, manufacturing and logistics cost increases is nearly closed, and we are in course for margin expansion and earnings growth in the fourth quarter in 2023. This means not only a return to earnings growth, but also increased flexibility to invest in our categories and drive future innovation and consumption.\n\nWe are executing with excellence and our mission to simplify daily life so consumers can enjoy what matters most. I'm extremely proud of the RCP team as we navigate through these dynamic times. We are well positioned to realize the benefits of the actions we've taken over the last two years. With that, over to you, Michael.\n\nMichael Graham -- Chief Financial Officer\n\nThanks, Lance, and good morning, everyone. I'll briefly review our second quarter results, then I'll turn to our guide and why we are well positioned for margin expansion in the fourth quarter and 2023. Net revenues in the second quarter were $917 million, an increase of 5% over second quarter net revenues of $873 million in 2021, primarily driven by price increases and partially offset by a decline in volume. Adjusted EBITDA for the second quarter was $118 million, down 20% versus last year's second quarter of $148 million, driven by lower volume, primarily due to declines in foil consumption as well as higher materials, manufacturing, logistics and advertising costs.\n\nSignificant price increases across our entire portfolio offset all material cost increases and a large portion of increases in manufacturing and logistics costs. We expect to close the remaining gap between price and materials, manufacturing and logistic cost increases in the third quarter, and to see an additional margin benefit in the fourth quarter driven by anticipated progressive easing and aluminum cost and implementation of additional pricing. Adjusted earnings per share for the quarter was $0.26. Turning to our segment performance.\n\nDetails are in our press release and 10-Q, so let me give you the highlights. The 5% increase in net revenues was driven by low- to mid-teen increases in pricing in each of our business segments, which was partially offset by a 9% volume decline driven by Reynolds cooking and baking, and to a lesser extent, declines in two other segments. Our overall price increase of 14% is consistent with the year-to-date increase of 13% and reflects our effectiveness in recovering all material cost increases and a large portion of increases in our manufacturing and logistics costs in the second quarter. As you know, in May, we expected a mid to high single-digit volume decline in the second quarter.\n\nAnd as Lance reviewed, slowing foil consumption was a substantial headwind in the quarter. The 19% decline in Reynolds cooking and baking volume also reflected a decline in low-margin reroll volume and an additional headwind from timing of retailer replenishment early in the quarter, whereas volume declined 3% in Hefty waste and storage driven by lower waste and food bag usage as consumers are spending less time in their homes. And as Lance mentioned, branded waste bag volume and dollar shares are up in the first half. Volume was flat in Hefty Tableware as gains for Hefty disposable plates and private label party costs were offset by declines in other disposable tableware.\n\nAnd Presto Products volume declined 7%, driven by lower waste and food bag usage. Turning to our outlook. For the third quarter of fiscal '22, we expect net revenues to grow 8% to 12% on $905 million in prior year, driven by price increases and a low to mid-single-digit volume decline. Adjusted EBITDA of $110 million to $120 million.\n\nAnd adjusted EPS to be in the range of $0.21 to $0.25 per share. For the fourth quarter of fiscal 2022, we expect net revenues to grow 9% to 17% on $1.021 billion in the prior year, driven by price increases and flat to slightly down volume. Adjusted EBITDA of $220 million to $240 million and an adjusted EPS to be in the range of $0.59 to $0.66 per share. For the fiscal year 2022, we now expect net revenues to be up 8% to 11% on $3.556 billion in 2021, driven by price increases and a mid-single-digit volume decline, including the impact from timing of retailer inventory replenishment, primarily in the first quarter of this year.\n\nAdjusted EBITDA of $560 million to $590 million, adjusted EPS to be in the range of $1.32 to $1.43 per share, and net debt to be $1.9 billion to $2 billion at December 31, 2022. And as a reminder, our capital allocation priorities are unchanged. As Lance said, elasticities have picked up, particularly in our foil business. And so those assumptions are reflected in our guide.\n\nWe continue to closely monitor elasticities and how they may change in other categories given the inflationary environment. In terms of other key assumptions, we assume rates for key commodities are stable to easing by comparison to end of July levels and estimate incremental cost pressures of approximately $525 million for the year, which is a $75 million increase by comparison to our expectations we reported in the first quarter results. We estimate depreciation and amortization of $120 million for the year, interest expense of $70 million and an effective tax rate of 25%, and a capital spending of $135 million to $145 million, down from our previous estimate of $150 million to $170 million, driven by extensions and timing of select capacity and other investments. In terms of phasing, our incremental pricing and cost comparisons have us positioned for substantial margin expansion that we expect in the fourth quarter.\n\nAs I just reviewed, first half results reflected narrowing of the gap between pricing and cost increases. We expect that trend to continue in the third quarter and for our implemented pricing to fully offset increases in material manufacturing and logistics costs. We also expect SG&A to be up in the third quarter versus prior year due to increases in variable compensation and advertising costs. As we enter the fourth quarter, we expect to see progressive easing of aluminum costs driven by existing inventory positions and fourth quarter gross margin is expected to also benefit from the implementation of recently announced pricing.\n\nNow, before I hand the call back over to Mark and your questions, I want to leave you with a few thoughts on recovery of pre-pandemic profitability. We anticipate achieving pre-pandemic levels of profitability in 2023. We estimate this to be in the mid $900 millions when adjusting to current volume levels compared to pre-pandemic gross profit of $880 million. We expect closing of the gap between price and cost increases, as I discussed when reviewing the guide, to the be a major catalyst.\n\nIn addition, as Lance mentioned, the cumulative value of price increases is significant. Together with our category leadership positions and the anticipated easing of commodity costs, we expect this will allow us to increase category investment while also gaining additional margin. And we are expanding revolution cost savings based on our comprehensive business review, identifying and targeting additional procurement, manufacturing and logistic savings, giving us added scope for investment in margin growth. In closing, we continue to manage through a very challenging environment.\n\nI'm encouraged about the actions we have taken as well as the implications for the future results. And with that, I'll hand the call back over to you, Mark.\n\nMark Swartzberg -- Vice President, Investor Relations\n\nThanks, Michael. As I turn it over to the operator for your questions, I'd like to remind you that we ask that you ask one question and a follow-up, and then rejoin the queue if you have additional questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from Kaumil Gajrawala with Credit Suisse. Please proceed with your question.\n\nTheo Brito -- Credit Suisse -- Analyst\n\nHi. This is Theo Brito for Kaumil. So you're now guiding to volumes to be down mid-single digits this year. Can you maybe just remind us what was your expectations before? And more importantly, what gives you confidence in the new volume outlook please? Thank you.\n\nLance Mitchell -- President and Chief Executive Officer\n\nSo the answer to the first question was down low single digits. And what gives us confidence in our new volume guide is, this is a very dynamic environment. And as I mentioned in the prepared remarks, elasticities have picked up in much of our business, particularly foil. But as I also said in our remarks, our category advisors are actively addressing changing consumer needs with our retail partners, and we're seeing an encouraging response to the corrective actions in the foil category.\n\nSpecifically, we have maintained all points of distribution that have historical share position. Our category declines have begun moderating, and we're gaining volume share as we picked up these promotions. The EQ volume for 12 weeks ending June 26, with which -- for Q2, essentially, the category was down 12.2% and Reynolds Wrap was down 15.6%. The EQ volume for the four weeks ending July 31, the category is down 5.6% and Reynolds Wrap down 4.4%.\n\nWe plan to continue increasing foil promotions, features and displays through year-end, including a substantial pickup in October to take advantage of lower foil costs and holiday-related demand. And after many months lagging Reynolds Wrap price increases, we've seen private label has begun taking prices up. And some of the other drivers in our other three business units, we expect our performance in the club channel, which is strong, to continue, and that's particularly important for Tableware. Hefty Fabuloso continues to gain momentum with new distribution and introduction of multiple new pack sizes.\n\nWe are stepping up advertising across our portfolio of Hefty waste and storage products and evaluating increases in promotions. And we're also introducing new low-price-point pack for above sizes and additional value-pack sizes. The changes in consumer consumption in our categories has been more dynamic than we've seen historically, and we're continuing to watch it very closely and we continue to respond with corrective measures.\n\nOperator\n\nOur next question comes from Lauren Lieberman with Barclays. Please proceed with your question.\n\nLauren Lieberman -- Barclays -- Analyst\n\nGreat. Thanks. Good morning, everybody. I still just wanted to go back to the reason for the lowered EBITDA and earnings outlook for the year because the conversation on yes, the volume declines in foil are worse, but we talked about this before and that you would turn the promotion on.\n\nI know you called out the higher cost basket. I'm just curious the sources of that big change because it just feels like 3Q is a little bit of a shock. And I frankly thought there was maybe a little bit more visibility inherent in the business model. So I'm curious mostly about 3Q.\n\nThanks.\n\nMichael Graham -- Chief Financial Officer\n\nYeah, so the main driver of our guide down is lower volume expectations as we are more in a more inflationary environment and therefore, elasticities have gone up. We estimate approximately three points less volume than we previously expected. Those three points represent about $40 million of loss contribution margin. That's all of the $40 million decline in our EBITDA.\n\nAnd when you look at the lower end of our guide of 615 and the midpoint of our current guide of 575. So in terms of the three key -- the third quarter EBITDA -- in terms of volume, as Lance said, we're in a dynamic environment. And the elasticities have picked up in all of our categories, particularly in foil. But as we look at the commodity curve, the value of the pricing we bought -- have implemented, and we are expecting a significant increase in earnings in Q4 relative to Q3 as a result.\n\nSpecific to Q3, in aggregate, the year-over-year benefit of pricing and revolution is fully neutralized cost increases year over year with the other segments compensating for Reynolds business, where we are still working through some of the higher cost aluminum. So that has to be worked through in the subsequent quarters. So this leaves our volume and SG&A. We expect volume declines in low -- in the range of low to mid-single digits, which is a headwind, but there are some offsetting margin benefits from improved innovation.\n\nAs an example, Hefty waste bags, Fabuloso, we got to also have the Reynolds Kitchens have performed very well, and we're expecting the same moving forward. So year on year, the decline really boils down to higher SG&A, with most of our total year-over-year increases falling in the back half. The key drivers are increased advertising and market research and higher compensation costs. Some of which is timing related.\n\nLauren Lieberman -- Barclays -- Analyst\n\nOK. So just to step back for a sec, volumes in foil or cooking and baking being worse than expected in 2Q created a delay in the time line for what you previously expected for moving through some of that higher cost inventory through the P&L.? So that's...\n\nMichael Graham -- Chief Financial Officer\n\nYou got it.\n\nLauren Lieberman -- Barclays -- Analyst\n\nOK. OK. And then the SG&A piece that you were saying, Michael, I'm sorry, I was still -- like, my brain was spinning on the inventory piece. So there's also some higher SG&A that you built in because you're investing more than you'd maybe previously or planned? Or is that already happening?\n\nMichael Graham -- Chief Financial Officer\n\nYes.\n\nLauren Lieberman -- Barclays -- Analyst\n\nYeah, OK. OK. Great. And then for 4Q, then you get the margin expansion because you're -- the timing is back to as planned in terms of moving to that lower cost inventory and to the incremental pricing?\n\nMichael Graham -- Chief Financial Officer\n\nSo let me go back to the SG&A point. The year-over-year decline was down to higher SG&A with most of that total year-over-year increase falling in the back half, right? The key drivers are increased advertising and market research and higher compensation costs.\n\nLauren Lieberman -- Barclays -- Analyst\n\nOK, great. OK, I'll leave it there and pass it on. I'm fine. Thanks, guys.\n\nMichael Graham -- Chief Financial Officer\n\nOK. Thanks, Lauren.\n\nOperator\n\nOur next question comes from Robert Ottenstein with Evercore. Please proceed with your question.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nGreat. Thank you very much. Can you talk a little bit about the competitive environment for trash bags? What you see your competition doing, how the promotional feel looks like? And what you need to do to kind of get that business on a better path?\n\nLance Mitchell -- President and Chief Executive Officer\n\nYeah, Robert, thank you for the question. We have seen a much more constructive environment in the competitive dynamics in the waste bag category. As you heard in my prepared remarks, we are announcing another price increase on Hefty waste bags. So when that is completed, we will be recovering almost all of our costs, including labor and logistics as well as resin, assuming the resin curve holds in that category.\n\nSo we've seen that a very much more positive environment as it relates to the pricing dynamics across the category, and it's going to come down to how the consumer consumption plays out as we go forward.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nHow do you feel about your share trends?\n\nLance Mitchell -- President and Chief Executive Officer\n\nThe share trends in the first half were positive. And the last four weeks, it's been pretty flat.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nOK. And going over on the aluminum foil side, how do you see that category playing out in terms of consumer choices between private label and branded. And do you see a path for consumers going back more heavily to branded?\n\nLance Mitchell -- President and Chief Executive Officer\n\nAs I mentioned in the prepared remarks, we have seen pricing of private label increasing. And so to put specific numbers on it, the last 12 weeks, private label increased 2.5 share points, but in the last four weeks, it's been flat. So when we put these promotions in place, which has gotten our price points lower and as we've seen private label prices increasing, we've seen that the price gaps narrow, and we've seen that shift back to a more stable position between brand and private label in the category.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nOK. And then if I can just sneak one more in. Given this dynamic environment, right, which you say that the -- it's -- you've never seen or that it's at least more dynamic than in the past, a lot of elasticity, is your -- are your conversations with the retailers different in the past, the retailers looking at the category in any way more differently than they had in the past?\n\nLance Mitchell -- President and Chief Executive Officer\n\nI think what we're looking at with the retailers is making sure that we get the price points correct, right? And what happened in foil, when you see a category that declined 15 points in a quarter, that's historically something we've never seen, a double-digit decline in the category. So our discussions with them has been about how do we get the price points right in this inflationary environment. Reynolds Wrap 75 foot pre-pandemic traded below $4 on a unit basis, a 75 square foot flagship product. As we've taken pricing to compensate for very high cost of aluminum, it went up to almost $2 a pound.\n\nThe price points went up above $5. So we're not promoting well below that, looking to get below $5 and into the mid-4s as we get into Q4. And that will be driven by the investments we will be able to make with lower aluminum costs as we go through that inventory. But we'll do that on a sequential basis to ensure that we also have the opportunity to ensure our margins stay strong.\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nOur next question comes from Andrea Teixeira with J.P. Morgan. Please proceed with your question.\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nThank you. Good morning. So Lance, I wanted to go back to your comments on private label. Has your mix moved back to that portion of the business and your price in private label has improved to your point about pricing moving up? Do you see that as an improvement on a sequential basis for your margin.\n\nAnd then a follow-up on the cooking and baking, given the mid-teen -- I believe you said mid-teen consumption decline in the quarter, do you have a sense that, obviously, inventory levels in retail build up? And then if you see that, what is baked in, in your guidance into the fourth quarter, you could say, in October, you're going to be pushing more pricing and promo? And if you can inform us also in terms of pantry destocking, if you see folks, especially cost where you have a big presentation there or a big pack if things have improved sequentially. Thank you so much.\n\nLance Mitchell -- President and Chief Executive Officer\n\nWell, there's three questions in there. I want to make sure I understood the first one, which was about private label shift. You're speaking about foil? Are you looking at all of our categories and are you asking about are we margining up our private label? I didn't quite understand what you wanted -- the question about the private label.\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nYes. Sorry, let me parse out. I think -- if you could focus on foil and trash bags, I guess those are the most important for us. If you can -- because I did see the commentary about Presto not performing that well.\n\nSo I guess, probably what you're seeing is that Presto brands have taken a little bit of share at that point, as I mentioned. But just to check on the price gap commentary that you gave just before.\n\nLance Mitchell -- President and Chief Executive Officer\n\nSo on foil, yes, we did see a shift to private label in the second quarter as we had pricing that was significantly moving faster up than private label, like, I quoted last 12 weeks, it was up 2.5 points in private label share versus us. But in the last 4, it's flat. So as we put the promotions in place and got below the $5 price points and across all of our sizes, we have been able to, at this point, see that flattening and no longer shifting to private label. In waste bags, it's actually the other direction.\n\nIf you look at the last 12 weeks, branded share and waste bags has improved one point and in the last four is 0.4. So there's not been a shift in the waste bags to private label in our current outlook or in the current history, I should say. So does that get to your question on the private label shifts?\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nYeah, Lance. The one thing on the private label share that you mentioned on aluminum foil, did you capture that? Because you obviously produce around 40% of your sales in private label. Did that shift more favorable to you or it's mostly your competitors?\n\nLance Mitchell -- President and Chief Executive Officer\n\nI see. OK. So in foil, that is one of the categories that we don't have a very strong position in private label. We've got some capacity constraints, and we have chosen to really focus on the brand in that particular category.\n\nSo no, we did not pick that up.\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nOK. And then on the -- that's fair. And then on the cooking and baking inventory levels, both at retail and pantry. I know you had prepared us that this was an issue back in the first quarter.\n\nJust wondering how that evolves into the second, as you exited the quarter, into the third quarter.\n\nLance Mitchell -- President and Chief Executive Officer\n\nYeah. Well, we continue to monitor our retailers' inventories through direct access to a number of inventory tracking tools. And we did see the retail below the foil and other products as we anticipated in Q2. But for the last two months, we've been shipping in line with consumer demand.\n\nWe do know that retailers are, of course, continue to evaluate their own inventory levels and we're watching that closely.\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nRight. But then would you say you're shipping according to demand, the demand is still down?\n\nLance Mitchell -- President and Chief Executive Officer\n\nYes. But it's moderating, as I mentioned, it's a 4%, right? So it's significantly different than it was in Q2. And we have that...\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nAll right. I'll...\n\nOperator\n\nOur next question is from Mark Astrachan with Stifel. Please proceed with your question.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nYeah, thanks, and good morning, everyone. So I want to maybe come on some of the previous questions in a slightly different way. So back to your commentary on achieving pre-pandemic profit levels next year. I guess maybe to think about it, how should we model or view the retention of pricing if inputs come down either in line with expectations or more? And relative to what you all have said from a historical standpoint, which I think was maybe just under 40% retention of price if you go back to '18, '19.\n\nHow does that play out going forward? And sort of related to that, if I'm doing the math, right, for your guidance, pricing still has to pretty meaningfully accelerated on a two-year basis over the balance of the year. So how does that factor in and could potentially elasticity, which is worsening, get worse even than expectations?\n\nLance Mitchell -- President and Chief Executive Officer\n\nWell, I'll answer the first part of the question, and I'll let Michael explain a little bit more about 2023 and our outlook for 2023. But we are -- we have historically been able to maintain and improve our margins and keep pricing as commodity costs go down, and we believe that we will be able to do that in 2023 and in Q4. In total, when you look at the price increases that we've taken over a two-year period of time, it's almost $1 billion. So there's a lot of opportunity to be able to margin up within that $1 billion and at the same time, invest in our categories to maximize promotions and advertising.\n\nAnd Mike, do you want to talk about 2023?\n\nMichael Graham -- Chief Financial Officer\n\nYeah, and specifically around the gross profit. So we anticipate achieving pre-pandemic levels of profitability in 2023. We estimate this to be around in the mid-$900 millions when adjusting to our current volume levels compared to pre-pandemic gross profit of about $880 million. We expect closing the gap between pricing and cost increases.\n\nAnd as I discussed in reviewing the guide to be a major catalyst. In addition, as Lance mentioned, the cumulative level of our price increases is pretty significant. Together with category leadership positions and easing of commodity costs, we expect this will allow us to increase category investment while also gaining additional margin.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nOK. Got it. Just one other follow-up on that last point on one of the pieces -- the last point, Michael. So you said volume is still being off or, I guess, the '23 comments are contingent on volume still being up versus pre-pandemic levels.\n\nI get you all surprised at the volume degradation that we've seen in '22 and kind of the world continues to normalize. How do you think about the likelihood that you retain those incremental volumes?\n\nLance Mitchell -- President and Chief Executive Officer\n\nYeah. So we've done some extensive studies with IRI consumption forecast production model to look at the effect of this volume, how much of it is impacted by pricing and how much of it is impacted by reopening. And in most of the categories, it's 60% elasticity and 40% reopening. In foil, it's 76% elasticity and only 24% reopening.\n\nSo we believe there's been a fundamental shift in the pandemic in the use of our categories and we get the pricing right on elasticity, that volume will continue to be above pre-pandemic levels.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nGot it. OK, thank you.\n\nOperator\n\nOur next question comes from Bill Chappell with Truist Securities. Please proceed with your question.\n\nBill Chappell -- Truist Securities -- Analyst\n\nThanks. Good morning.\n\nLance Mitchell -- President and Chief Executive Officer\n\nGood morning.\n\nBill Chappell -- Truist Securities -- Analyst\n\nI'm sorry to keep kind of hammering on the same issue on foil. But I mean, on that last kind of comment of 76% of the business is elasticity or the issues of elasticity? I mean, it's hard to kind of buy into that number. I'm just trying to think fundamentally about the foil category, there's not really a substitute for the category. I mean, if prices are high, and you're still cooking or using foil, you still need to use a cook foil and -- it doesn't seem like all of your business has gone to private label.\n\nSo I'm just trying to understand how that works out, how you haven't had demand destruction? And I guess the question is, do you think you've made a mistake of pricing too far, too fast in -- versus just kind of riding out a short-term rise in aluminum costs?\n\nLance Mitchell -- President and Chief Executive Officer\n\nWell, on the second part of the question, aluminum more than doubled during 2022, it went up to over $2 a pound. So if you did the math on that, the earnings structure by not taking our price up would have been significant, like $75 million. And so we had really no choice but to follow that pricing up. It's just an unfortunate consequence of the commodity drive up that we had to do that from a pricing standpoint.\n\nWhat gives us confidence is both the last four weeks as well as back in 2018 when we crossed the price point when aluminum spiked at that point, it went above another price point. And when we got it back lower, we got the demand back. We do know from our research that consumers are not leaving the category. They are stretching out their purchase cycle by deloading and having less use occasions.\n\nIn some cases, they're buying the lower pack sizes. And in some cases, the more affluent consumers are buying larger pack sizes. And the conditions vary by consumer. But they're not leaving the category.\n\nTo your point, we've done a lot of study on that, there's not a real substitute there. So getting the price points back will get the purchase frequency back more normalized.\n\nBill Chappell -- Truist Securities -- Analyst\n\nOK. And I guess on that same, I don't fully understand why private label has taken so long to price. I mean, you would assume they have worse purchasing power of aluminum than you do and would want to maintain their price gaps and margins as much as they could. So any color as to why they've taken so long? Has been a weak point for the -- for you?\n\nLance Mitchell -- President and Chief Executive Officer\n\nThat is a question we have asked ourselves over the last year, and it remains a mystery to us. I don't have an answer to that question. I can only speculate that we believe that some retailers were comping off each other on their store brands and they ate the margin, waiting for the others to move. And that was part of the equation.\n\nThe other part of the equation may have been the amount of lower cost aluminum that they had in inventory during the runoff, so they felt that -- the producers felt like they could wait before they took the pricing. We have got no confirmation other than anybody's hedging. So that is not a scenario that we've believed could have impacted the timing for the private label producers.\n\nBill Chappell -- Truist Securities -- Analyst\n\nOK, great. I'll turn it over. Thanks.\n\nOperator\n\n[Operator instructions] Our next question comes from Jason English with Goldman Sachs. Please proceed with your question.\n\nJason English -- Goldman Sachs -- Analyst\n\nHey, folks. Thanks for slotting me in. I got three kind of rapid fire questions, I guess. So thank you for the mid-900s number on gross profit.\n\nI think we're all going to step back, say mid-900s gross profit, put $350 million or so on SG&A, $110 million in D&A and walk away saying that you're expecting somewhere in the low 700s from an EBITDA perspective. Is that meaningfully off base?\n\nLance Mitchell -- President and Chief Executive Officer\n\nThe SG&A number is a bit low because we will have more advertising than that. So I'd say closer to $400 million.\n\nJason English -- Goldman Sachs -- Analyst\n\nOK, that's helpful. And then in terms of the fourth quarter, you put a sales range out there that's really wide -- but you put a volume number, at least the comments suggest that you've got a pretty tight expectation on volume. I think you said sort of flat to down slightly. Your total sales, plus 9% to 17% suggesting you see at least probably a 500 basis point range on price, which is sort of unusual.\n\nUsually, price, you got better visibility on volumes where the uncertainty lies. What's going on there? What drives the exceptionally wide range?\n\nMichael Graham -- Chief Financial Officer\n\nYeah, the overall revenue range takes into consideration of potential on volume fluctuation. The indicated volume guide is the midpoint of the expected volume performance. So in order to hit the 17% revenue growth, volume will need to end -- need to be up. And on the flip side, if we do a 9%, volume would need to be down.\n\nJason English -- Goldman Sachs -- Analyst\n\nOK. That's helpful. And in terms of volume, if I do a three-year CAGR on Q2, which is effectively like if I do it versus 2019, your volume is down 6% versus 2019. So the whole notion that you're like going to be able to have profit of a higher volume base in this quarter certainly calls it into question.\n\nIs there something unique sort of timing-wise that would -- why this quarter is not reflective of sort of a round trip back to not only pre-COVID but actually below pre-COVID levels?\n\nLance Mitchell -- President and Chief Executive Officer\n\nNo, I don't see that. The 6%, I haven't done the math on that, so we're going to have to go back and look at -- it's down 50 basis points, right?\n\nJason English -- Goldman Sachs -- Analyst\n\nYes. Well, 2Q '20, you were up 3% volume. 2Q '21, you're up 1%. Now you're down quite a bit.\n\nLike you compound those, it's not positive. It's a negative number. But it sounds like we can follow up offline.\n\nLance Mitchell -- President and Chief Executive Officer\n\nWe'll need to. We'll do some math.\n\nJason English -- Goldman Sachs -- Analyst\n\nYeah. Good stuff. I'll pass it on. Thank you.\n\nOperator\n\nOur next question comes from Peter Grom with UBS. Please proceed with your question.\n\nPeter Grom -- UBS -- Analyst\n\nHey. Good morning, everyone. I hope you're doing well. So I guess I want to follow up on Jason's question in terms of the '23 guidance.\n\nI mean, Lance, you mentioned kind of the flexibility, the pricing actions we'll provide looking out to '23. You mentioned promotions decreased as -- but I guess -- how do you really think about the preference from here? Because it seems like you're -- if you're just assuming $400 million in SG&A, you're flowing through a lot of upside to earnings growth of -- if you're taking the $950 million of gross profit or so. Is that the right way to think about it that you're kind of really expecting potentially north of 20% EPS growth looking out to next year?\n\nLance Mitchell -- President and Chief Executive Officer\n\nYes. I think you're in the ballpark, yeah.\n\nPeter Grom -- UBS -- Analyst\n\nOK. That's helpful. And then I guess I just want to follow up on Lauren's question regarding the gap between prices and cost pressures and thinking through the 3Q earnings guidance. I mean, can you maybe just break out more specifically what you're expecting in terms of gross margin versus higher SG&A that would drive EPS and adjusted EBITDA to be down strong double digits.\n\nI know you mentioned higher incentive comp and ad spent. But just any commentary specifically around those two items would be really helpful.\n\nMichael Graham -- Chief Financial Officer\n\nYeah, So I think that the reference is that, overall, our SG&A is going to be up. The -- with the primary driver of that is being overall compensation.\n\nPeter Grom -- UBS -- Analyst\n\nYeah. OK. Thank you so much.\n\nOperator\n\nLadies and gentlemen, we have reached the end of the question-and-answer session. And I would now like to turn the call back over to Lance Mitchell for closing remarks.\n\nLance Mitchell -- President and Chief Executive Officer\n\nThank you, everybody, for your questions. We appreciate your time this morning. Our business is well positioned for any economic environment, and we anticipate earnings growth in the fourth quarter. I want to thank our employees and our retail partners for their dedication and their contributions during these challenging and dynamic times.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Swartzberg -- Vice President, Investor Relations\n\nLance Mitchell -- President and Chief Executive Officer\n\nMichael Graham -- Chief Financial Officer\n\nTheo Brito -- Credit Suisse -- Analyst\n\nLauren Lieberman -- Barclays -- Analyst\n\nRob Ottenstein -- Evercore ISI -- Analyst\n\nAndrea Teixeira -- J.P. Morgan -- Analyst\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nBill Chappell -- Truist Securities -- Analyst\n\nJason English -- Goldman Sachs -- Analyst\n\nPeter Grom -- UBS -- Analyst\n\nMore REYN analysis\n\nAll earnings call transcripts"
}