{
  "companyName": "Rekor Systems, Inc.",
  "companyTicker": "REKR",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/rekor-systems-inc-rekr-q2-2022-earnings-call-trans/",
  "content": "Rekor Systems, Inc. (REKR -17.81%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to today's Rekor Systems, Inc. conference call. My name is Latanya, and I will be your coordinator for today. [Operator instructions] As a reminder, this call is being recorded for replay purposes.\n\nBefore we get started, I would like to read you the company's abbreviated safe harbor statement. I would like to remind you that the statements made in this conference call concerning future revenues, results of operations, financial positions, markets, economic conditions, products and product releases, partnerships and any other statements that may be construed as a prediction of future performance or events are forward-looking statements. Such statements can involve known and unknown risks, uncertainties and other factors, which may cause actual results to differ materially from those expressed or implied by such statements. We ask that you refer to the full disclaimers in our earnings release.\n\nYou should also review a description of the risk factors contained in our annual and quarterly financial filings with the SEC. Non-GAAP results will also be discussed on this call. The company believes the presentation of non-GAAP information provides useful supplementary data concerning the company's ongoing operations and is provided for informational purposes only. I would now like to turn the presentation over to Mr.\n\nEyal Hen, CFO of Rekor Systems. Please proceed, sir.\n\nEyal Hen -- Chief Financial Officer\n\nGood afternoon, and thanks for joining us. Today, we'll discuss Rekor's results for the three and six months ended June 30, 2022 and provide you with an update on key business topics. Our CEO Robert Berman will be on the call with me today and will provide additional color on our business after I go over our relevant metrics. In the second quarter of 2022, we continue to accelerate growth in recurring revenue under our new sales model.\n\nAs explained previously, since the third quarter of 2021, we've been shifting our emphasis from point-in-time revenue to recurring revenue. While we continue to engage in point-in-time hardware sales in appropriate circumstances, our new model emphasizes providing software and data services on a subscription basis. This has had a near-term impact on our overall revenues. But with the strong growth we are seeing in recurring revenues, we're confident about the positive impact it will have on our overall strength and stability for the long term.\n\nWith that in mind, let me get into some of the details in the financial results for the second quarter ended June 30, 2022. Highlights include the completed acquisition of Southern Traffic Solutions, STS. Revenue for the three months ended June 30, 2022 was consistent at $4.3 million. Revenue for the six months ended June 30, 2022 was $7.9 million, compared to $8.5 million in the same period last year, a decrease of 6%.\n\nRecurring revenue for the three and six months ended June 30, 2022 increased to $1.2 million and $2 million, respectively, compared to the same period last year. This increase represents growth in recurring revenue of 133% and 115% for the three- and six-month period ended June 30, 2022 compared to the same period last year. Performance obligations increased to $31.9 million as of June 30, 2022, compared to $22.6 million as of December 31, 2021. As you can see, in less than a year, since the change in our sales model, we have reached a point where the growth in our recurring revenue has essentially compensated for the decline in point-in-time revenues.\n\nThe percentage of recurring revenue reflected in total revenue was 48% for the three and six months ended June 30, 2022, compared to 21% for the three and six months as of June 30, 2021. As I mentioned, we expect to continue point-in-time hardware and software sales in appropriate circumstances. And that may result in strong increases in product revenue in future quarters like the increase we saw in the first quarter of 2021. But with our current emphasis on building SaaS-based revenue through subscription sales, we expect to generate a stable base for long-term growth, well beyond what we could have achieved under the previous model.\n\nTotal operating expenses for the six months ended June 30, 2022 were $28.2 million, compared to $10 million during the same period in 2021. Increases in operating expenses stems from significant increases in payroll and payroll-related expenses. The additional headcount due to the Waycare acquisition played a part in this increase. And we added new hires to our engineering, sales and marketing teams as we integrated their technology into our growing suite of product and service offerings.\n\nWith the acquisition of STS, we're continuing to enhance and improve our line of products with important investments that will enhance its competitive edge. However, in view of the near-term opportunities that this acquisition has provided us with, we expect to narrow and consolidate sales and marketing efforts and defer some development efforts, as Robert will discuss later. Our adjusted gross margin for the three and six months ended June 30, 2022 and 2021 decreased to 38.5% from 67.7% and 41.5% from 61.1%, respectively. The decline in margin for the quarter ended June 30, 2022 is primarily attributable to increased investments in winning and implementing new projects as we focus on larger implementation in order to quickly expand our technological presence in key areas.\n\nWe expect to see an improvement in our adjusted gross margins as our land-and-expand strategy continues to evolve in the future. Adjusted EBITDA for the three and six months ended June 30, 2022 and 2021 decreased to a loss of $11.2 million from a loss of $2.9 million and a loss of $20.5 million from a loss of $6 million, respectively. This increase in loss was due to the investment to position Rekor for future growth that I've just discussed. Since we changed the revenue model, we have released enhanced key performance indicators to help provide visibility and more concise view into our success and progress.\n\nWe hope that over time, these KPIs will provide our shareholders with a better insight into our business. As noted in our financial highlights, our recurring revenue for the three and six months ended June 30, 2022 increased to -- by 133% and 115% compared to the same period 2021. In the first half of 2022, we won $5 million of new contracts. This is a decrease of 14%, compared to $5.8 million of new contract value won during the first half of 2021, related primarily to the decrease in point-in-time hardware sales discussed earlier.\n\nThe decrease in total contract value was also partially related to our willingness based on our experience with renewals to accommodate customers as budget constraints require shorter-term subscription than we had previously offered. As of June 30, 2022, remaining contract performance obligations were $31.9 million. We expect to recognize approximately 57% of this amount over the succeeding 12 months. This represents an increase of $9.4 million or 41%, compared to $22.6 million of performance obligation as of December 31, 2021.\n\nThis increase in performance obligation was primarily due to our STS acquisition. As we continue to focus on building relationships and expanding our presence, we acquire customers through pilot programs, which are typically short in nature. As we continue to convert and expand our pilot programs to larger-scale contracts, we will expect to see these KPIs improve. Moving to our financial condition and liquidity.\n\nOur cash balance on June 30, 2022 was $14 million, down from $25.8 million as of December 31, 2021. Working capital on June 30, 2022 was $7.3 million, down from $17 million as of December 31, 2021. The decrease in working capital was primarily due to a decrease in cash and cash equivalents. This decrease was primarily due to the increase in our loss from operations as we position the company for future growth and also reflects cash used in the acquisition of STS.\n\nThe decrease in cash was partially offset by a net cash inflow of $20.4 million as part of our 2022 at-the-market sales agreement. In summary, we are passionate about our growth prospects and continue to experience a strong momentum in our market. As Robert will discuss with you next, we are concentrating our investments now on rapidly increasing our margins and fully expect them to improve significantly. We remain focused on creating shareholder value and making decisions that will benefit our long-term shareholders.\n\nWith that, I will now turn the call over to Robert. Robert?\n\nRobert Berman -- Chief Executive Officer\n\nThank you, Eyal. Good afternoon, everyone, and welcome. So let's talk about our revenue and expenses. About this time last year, we made the decision to concentrate on developing a stream of recurring revenue, and we said there would be trade-offs.\n\nWhen you go from depending primarily on point-in-time revenue model to recurring revenue model, you can expect to have a negative impact on near-term revenue growth. The question is, how long does it take for growth in recurring revenue to make up for reductions in the point-of-time revenue? With the success of our efforts over the past few quarters, I think we are at the point where we've achieved that transition. As Eyal just described, in less than a year, we were able to transition from where recurring revenue were 21% of our total quarterly revenues to one where recurring revenues generated 48% of our total quarterly revenue. While total revenue for the second quarter of 2022 was essentially the same as the corresponding period of 2021.\n\nBut that's not the only thing we have to be focused on. At the end of the day, we want to emerge as a highly profitable enterprise. We haven't invested in major technology advances just to provide us with a slight edge in a narrow, crowded market segment. We've set our sights high and want to exploit high-value propositions that were never feasible before.\n\nSo at the same time, we've been concentrating on building a more stable revenue base. We've been concentrating on developing a package of solutions that can both make the roadways of the future measurably safer and more efficient and provide us with a profitable return on investment. With the acquisition of Waycare and now STS, we've been able to dramatically increase our geographic coverage and enhance our customer base. We are now working jointly with many of the world's largest roadway services and vehicle manufacturing companies to deliver cutting-edge products and services around the world.\n\nAnd in just the last three months, we won assignments from three state DOTs to provide different types of innovative new services. As the world seeks to reimagine and rebuild the infrastructure of the past, Rekor is already an active partner helping to define its future. Rekor is well on the road to becoming the trusted operating system for digital infrastructure on our roadways. Our Rekor One brand captures multiple sources of data, examines patterns and provides insights, decisions and actions to support multiple missions using AI to continuously reinforce the learning curve.\n\nWe pull in the data from our devices and third-party data sources and from existing infrastructure. Our brain then uses its AI and puts our proprietary IP and machine learning to work to intelligently process this big pool of data and visualize not only what is happening but what might happen. This results in actionable insights for our three key market segments: transportation management, urban mobility and public safety. In and of itself, that doesn't make us profitable right now.\n\nIt's given us the tools we need to become profitable over the next year. As you know, we play a significant role in the improvements envisioned by the Infrastructure Investment and Jobs Act, which are just beginning to be funded as we speak. The main focus of that initial funding will be the data collection and analysis. This will not be a \"build and then it will come\" reimaging of our nation's infrastructure but a data-driven reimagining of infrastructure looking for advances in efficiency and safety.\n\nWe've been developing the proprietary technologies and capabilities needed to address this massive undertaking in a way that's both constructive and profitable. We've been doing this by developing a modular platform that can be ingesting enormous amounts of data and deliver mission-critical digital infrastructure solutions and insights to government and commercial users. And we've been positioning the company to deploy it profitably over the remainder of 2022. In Q2, we saw a lot of what I just mentioned.\n\nRekor was selected for the launch of a multiyear program with the Missouri Department of Transportation, MoDOT, to not only make roads less congested and safer but to help rid the state of severe traffic crashes, all key objectives of Missouri's Show-Me Zero Strategic Highway Safety Plan for '21 to 2025. Rekor's Transportation Management Platform was certified by AWS as Well-Architected to improve traffic and incident management, increase public safety and security and optimize urban mobility. The certification objectively validates Rekor's solutions as achieving highest distinctions in security, reliability, performance efficiency and scale for customers to adopt and deploy with confidence and also opens up new growth channels through AWS's extensive global partner network and marketplace. Rekor was also selected by the Israel National Infrastructure Company for AI-driven intelligent infrastructure on Israel's highways.\n\nAs the core system, we're integrating and processing data into a single source of truth. Rekor's traffic management solution will bring digital and physical infrastructure together to extract the most data possible from the roadway and the environment. The project will use data from multiple Rekor Edge-based optical roadway sensors and consolidate this real-time traffic analytics data with seven other diverse real-time data sets, including dash cam footage, public transit analytics and video footage of roadway incidents enhancing traffic enforcement and incident response capabilities. We also completed the acquisition of STS near the end of June.\n\nThe impact of this acquisition isn't really a factor in our Q2 earnings, but it is expected to be an important contributor to our profitability as we move forward. Historically, STS has annually generated $15 million of revenue, of which 50% is recurring, and $3 million of EBITDA. And we have every reason to expect to build on this. This acquisition combined two complementary companies with the primary objective of accelerating Rekor's path to profitability going forward.\n\nPutting 30 years of traffic engineering and data collection expertise from STS together with Rekor's next-generation artificial intelligence, machine learning technologies, has positioned us to become the leader provider of data services for the agencies in the U.S. that are working right now to plan intelligent infrastructure of the future. In just the last few weeks since the acquisition, STS has already significantly expanded its relationship with the Florida and Ohio DOTs to incorporate the roadway AI that Rekor brings to the table into their operations. So with Waycare and STS acquisitions, we've secured our position as a cutting-edge technology provider, as well as a trusted source of data services for departments of transportation throughout the United States.\n\nOur next task, particularly under current market conditions, is to ensure that we use that position to become profitable as quickly and efficiently as possible. So before we open it up for questions, I'd like to address the current state of the capital markets and its impact on our plans for growth. There's no doubt that the uncertainty in these markets has resulted in a downturn that has impacted just about every public company, especially technology companies. Like many, many other companies in the tech space, we will have to do more with less.\n\nWe are in an economic environment that demands more intensity, and we've already been taking steps to do -- maintain our growth using fewer resources. Since the acquisition of STS, we've been working to consolidate operations, concentrate on near-term profitability and steadily reduce headcount growth. Many of our teams are going to shrink so that we can shift energy to other areas inside the company. And we've given our leaders the ability to decide within their teams where to restructure, where to double down and where to backfill attrition.\n\nIn this process, we'll be prioritizing the positions we're in to take advantage of the funding that's beginning to flow from the Infrastructure Investment and Jobs Act. We expect to see both cost efficiencies and continued revenue growth reflected in the future quarters as we continue to unlock the value from the unique opportunities for growth the last year has provided us with. So despite the current challenges, I'm very confident for the long term. Now I'd like to turn the call back to our operator who will moderate the Q&A session.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Mike Latimore with Northland Capital Markets. Please proceed.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nGreat. Thanks very much. So on the Florida and Ohio expansions, can you just elaborate on those a little more and maybe mention how much incremental business came from those expansions?\n\nRobert Berman -- Chief Executive Officer\n\nSure. Eyal?\n\nEyal Hen -- Chief Financial Officer\n\nSo Mike, this contract does not have dollar attached to it. We just signed this contract. And it's not yet a public information that we can disclose. What we can say, as we announced before, extend these contracts, we increased our relationship with these significant DOTs.\n\nAnd once we have more numbers and more information to share, we definitely will share it with the market.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nOK. And then, the focus on near-term profitability, when should we think about you're hitting, say, EBITDA breakeven? Is that a first quarter of '23 kind of time frame? Or what are you thinking there?\n\nRobert Berman -- Chief Executive Officer\n\nMike, I think...\n\nEyal Hen -- Chief Financial Officer\n\nSorry. Go ahead, Robert.\n\nRobert Berman -- Chief Executive Officer\n\nNo. Go ahead, Eyal.\n\nEyal Hen -- Chief Financial Officer\n\nI said, as Robert mentioned in the earnings release, we are working to make our organization more efficient. We cannot provide yet the exact time. But we believe that some time in the next 12 months, we'll be breakeven.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nOK. And then, just last, just a clarification on the -- you guided that STS has been doing about $15 million of revenue. Should we -- as we kind of model it out over the next 12 months, is that what we should put in our models? Or will there be a little step back as you've got to integrate or maybe an uptick from some of these expansions?\n\nRobert Berman -- Chief Executive Officer\n\nMike, that's a good question. And I think, it's fair to say that -- look, STS was a pioneer in data services. So as you may know or some of you may not know, but all the states are mandated to collect traffic data for the Federal government each year. And STS pioneered about half a decade ago the idea of installing systems that include inductive loops and other things in the roadways for the states and then selling the data back to them and the stuff that they collect as opposed to just putting in a system and selling it as a contractor and then maintaining it, right? So they've got a fairly large footprint throughout the Southeastern United States and very strong relationships with our customers for decades.\n\nAnd by the insertion of Rekor's technology into that process and elimination of the old antiquated ways of collecting that data, I think within the STS footprint, we're going to see growth, right? So that's why we bought STS because there's a trusted relationship there. You don't just walk into a DOT and start working with them the next day where they are going to be comfortable with the data you're giving them. They've got to trust your integrity and have a history with you. So I think, the growth is going to come from the combination of Rekor and STS together by introducing our technology into STS's business and footprint.\n\nAnd I think, we'll see growth as a company in general. And then, that's what we're seeing with the expansion with Florida right now and also in Ohio.\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. Our next question comes from Zach Cummins with B. Riley. Please proceed.\n\nZach Cummins -- B. Riley Financial Inc. -- Analyst\n\nHi. Good afternoon. Thanks for taking my questions. Eyal, just talking about gross margins during the quarter, I know we took down to 38.5%.\n\nI think, a lot of that is upfront costs associated with some of these project implementations. But can you talk about just maybe if there's any other impacts to gross margin in the quarter? And as you start to get more of these pilots converting to revenue, what's going to be more of a, I would say, normalized gross margin range, especially with STS in the fold in the future? Thank you for the questions.\n\nEyal Hen -- Chief Financial Officer\n\nZach, good question. As you mentioned, yes, the gross margin decline is really an upfront cost that we have. And as we announced in the past, we believe that STS together with the current businesses we have will contribute to our gross margin and increase for the midterm to about 60% to 70% gross margin. That's what we anticipate.\n\nThat's what we always say. And for the long run, once we have more data services revenues coming in, we do anticipate to be on the 70% to 80% gross margin.\n\nZach Cummins -- B. Riley Financial Inc. -- Analyst\n\nUnderstood. And Robert, with you prioritizing profitability here in the near term, I mean, I know it's still kind of early days in terms of your strategy. But can you give us any sort of insight into maybe which specific areas that you're considering kind of maybe reducing some spend or even cutting back some head count? And I know that you're going to be having a more focused approach when it comes to kind of near-term revenue opportunities. So can you speak to, I guess, just which opportunities would be the low-hanging fruit or the fastest time to revenue for you in the sales force?\n\nRobert Berman -- Chief Executive Officer\n\nI think that's a really good question. It's a fair question. And it's an important question. Look, we've spent three years building technology because we believe that the world was going to move toward bringing infrastructure into the digital age.\n\nAnd we're seeing that now. And you're going to see that with this $1 trillion infrastructure spend that we're doing here in the U.S., they're going to bring infrastructure into the digital age. So all the things that we've done over the last three years, some were transactional, some were point in time, all of them related to different components of this platform that we were building. Some were hardware components that we couldn't get on the market from hardware suppliers, had to develop ourselves.\n\nOthers were related to our software algorithms, firmware within the hardware and so on and so forth. I think what's happening at this point is we're comfortable in saying that we can start to drop away from all of those other businesses and put less focus on those things and put all of our effort in what we started out to do, which is to be a data services company building an operating system for the roadways. That's what we're doing as of the beginning of Q2 of this year, and that's what we're going to continue to do throughout the rest of 2022 and into 2023. And I think, what that means is that we expect more and more of our revenues every quarter to come from data services, OK, from the aggregation of data, the repurposing of data and the sale of data to both commercial and governmental customers.\n\nHigher margins, longer-term contracts of much greater value and -- and that's what's going to bring us to profitability. And what that requires is a robust engineering department to support the products that we've built. So some of our cuts and reductions may not come so much on that side of the business as they will more on the operating side, where we were doing these one-off transactions and installations of systems that really weren't core to our business. But we did them because we had to test our products and our platform and our hardware and our software in live environments, right? So we can pare all that back now and we can get focused on what we set out to do, which is to be a data services company and an aggregator and a repurposer of data and seller of data, right? So we've been at this only for three years, and I'm proud of the fact that we were able to get to this point in three years.\n\nAnd I think, when we picked up Waycare, we brought in all that external data into our platform, our brain, as David likes to call it, who's on the call with us. And then, STS is basically the horse that's going to get us into the market with their footprint, OK, on the other side. So we can focus on all that now. So that's where it's going to come from, Zach.\n\nIt's going to come from focusing on data services and less so on all the other stuff that's point in time and transactional. And I think, it's really that simple. And we can do that now. We can do that now.\n\nZach Cummins -- B. Riley Financial Inc. -- Analyst\n\nUnderstood. That's helpful. Thanks, Robert. And final question for me is in terms of the contract that you announced with the Florida DOT a few weeks ago, it seems like a pretty significant opportunity.\n\nBut can you talk about if this opens the door to other agencies within Florida or if this sort of contract is something that could be replicated in different states? Just speak a little more to kind of the opportunity beyond even just that Florida contract.\n\nRobert Berman -- Chief Executive Officer\n\nIt's a contract that relates to, again, data, OK, and managing and monitoring what happens on bicycles and pedestrian pathways, and there's a safety component to it. And absolutely, it can be replicated not only in Florida but in other states and throughout Florida. And with the way the contract is structured, we have the liberty of designing the system to meet their needs and introducing components of safety into it, using tools that they had not had the ability to do before. And our understanding of it, through STS, the way the DOT works is it's a contract that's multiyear, but the funding is there for it.\n\nIf they can see the utility of the products, then they'll do it all immediately and then just reup it and move it to another piece of the state. So that's a good question, Zach. And that's the whole point of all of this, all of these things that we're doing. I would encourage everybody on this call to look at not the value of the contracts that Rekor has been announcing, but look at the nature of the contracts the Rekor is announcing.\n\nThey're quite unique. And I don't think you're going to find any other company saying some of what we're doing. So that's the nature of that contract, Zach. It relates to bikes and pedestrians and the data around that and also a safety component.\n\nAnd then, using the new technology to change the way it's been done in the past and bring a safety component to it. So hopefully, that's helpful.\n\nZach Cummins -- B. Riley Financial Inc. -- Analyst\n\nYeah, very helpful. Well, thanks again for taking my questions, and best of luck with the rest of the quarter.\n\nRobert Berman -- Chief Executive Officer\n\nYeah, Thank you.\n\nOperator\n\n[Operator instructions] Our next question comes from KC Ambrecht with Shay Capital. Please proceed.\n\nKC Ambrecht -- Shay Capital -- Analyst\n\nHi. Thanks very much for taking the question. Just following up on some of these other revenue opportunities. Could you just kind of briefly update us on where we are with the border patrol contract? Any update on Mastercard just kind of rolling out? Is there any visibility on that? And then, if there's any other reseller opportunities that the company might be able to kind of tap into to supplement some of the revenues?\n\nRobert Berman -- Chief Executive Officer\n\nYeah, thanks, KC. I mean, look, first with Custom Border Patrol, again, no control over it. What we know is the same thing that everybody knows, what they post publicly, which is that they've now selected the four primary contractors, of which Rekor is partnered with all of them. And they've now said that they're going to make the announcement at -- they expect sometime later this fall.\n\nWhat we have said publicly and folks do know is that we're partnered with the incumbent, and they continue to use our technology and extended it just into very early next year, I guess, assuming they're thinking as well that there'll be a decision whether they win again or whether somebody else takes it over. So that's what we know, OK? With respect to Mastercard, we continue to pilot with them. I can't speak to -- I guess, they're doing what they do. And again, everything else that we've worked on this point of time, transactional, like those things, they're all great.\n\nThey're healthy. They bring in money, they bring in revenue, they bring in margin, KC. And they're good questions and sure, we'll focus on them if the opportunity is there. But we don't want to get distracted by those things if we haven't been working on them.\n\nWe want to get focused on what we're doing with the states and data services, so that's kind of where it is. Eyal, do you have anything to add?\n\nEyal Hen -- Chief Financial Officer\n\nNo, no. Sorry. Robert said it all.\n\nKC Ambrecht -- Shay Capital -- Analyst\n\nThank you. Just -- and then just one last question just on the STS deal. It sounds like a great deal and you're seeing these other things kind of plug into it. When we think about profitability in the next 12 months, I guess, by 2Q of next year, how does that look though? Do we just kind of put together the revenues of the two companies and then they accelerate? Or we put together the expense base or we reduce the expense base? Like can you just kind of help us kind of get there optically from 10,000 feet?\n\nRobert Berman -- Chief Executive Officer\n\nI think that you can look at STS and you can assume there's going to be growth and probably at a higher margin, OK, because we're introducing new technology into the way they do what they do. And I think, with respect to our expenses, you're going to see our SG&A stabilize with -- across some of the verticals inside the company and come down in others. So it's going to be a combination of those two things. And look, we've said we think we can get there within 12 months.\n\nSo we're talking about this time next year or sooner. And we believe that. And we think, again, it's going to come from a combination of revenue and stabilizing expenses or having slight reductions.\n\nKC Ambrecht -- Shay Capital -- Analyst\n\nOK. And one last question. Just on the KPIs you guys have kind of talked about. Do you know when we're going to have a time when we get a little bit more visibility on when these contracts convert from pilot to contract and how the pricing is going.\n\nRobert Berman -- Chief Executive Officer\n\nYeah, I think, you'll start seeing that. I mean, look, we've owned STS for less than, I think, two weeks of the quarter. And we saw a contract there, right? So I think, again, the nature of it, KC -- and these are good questions. The nature of that business in that world, and it's not just STS, it's the -- just the world of the way things are done with regard to infrastructure, these are usually three-, five-, seven-year contracts, right? So they're much larger, the dollar values are higher.\n\nAnd I think, hopefully, that's what you're going to start seeing from us. And I think that's going to reflect in both the performance obligation, as you've seen here, just with a couple of weeks of STS being part of Rekor, as well as the annual recurring revenue. So we expect those two KPIs to continue to grow. And then, as the margins recover, then you're going to see how the company gets there, I think.\n\nKC Ambrecht -- Shay Capital -- Analyst\n\nOK, thanks very much.\n\nRobert Berman -- Chief Executive Officer\n\nYeah, thank you.\n\nOperator\n\nOur next question comes from Ray Yako, a private investor.\n\nUnknown speaker\n\nThanks for taking my call. I've been a shareholder for a while. But can you touch on the pilots that were mentioned about 10 months ago, the Philadelphia Navy Yard; Winchester, Virginia; and I believe the other one was Chattanooga, Tennessee? And also, roughly how many pilots are ongoing at this time?\n\nRobert Berman -- Chief Executive Officer\n\nThese pilots are still ongoing and there are others, but that's a good question. We've shifted our business thinking with respect to pilots. There's a point in time when technology is new and a company is young where -- look, you'll do anything you can to deploy your technology and to work with a customer, right? And you do pilots that are very low revenue or no revenue. We've gotten past that now, so we're not doing those kinds of pilots anymore.\n\nI think, what you're going to see is the company going straight to contracts now, so I wouldn't look at pilots. I think, a lot of what we did with these pilots prove the technology, and they got us to where we are with certifications like with AWS that we talked about on the call and other things that are helping propel it forward. So I think, again, our thought process is to move away from pilots to -- look, we can do this. So do you want to use the company's products, right? So I think that's where we are.\n\nBut most of what you talk about is still ongoing and expanding. I mean, in Philadelphia, they keep adding components to the pilot there. And there was an introduction of a commercial component into that. So we look at those things like laboratories in a way.\n\nSo they were long-term pilots, six months or better, so they're still in process.\n\nUnknown speaker\n\nAnd my final question is, are you still open to any future acquisitions if the opportunity arises?\n\nRobert Berman -- Chief Executive Officer\n\nThat's a really good question. And I'll tell you that from where I sit here today, and this is just my view, I don't see it. I think, we have the pieces we need now to scale this business. And I think, our focus is going to be on scale and growth and profitability.\n\nAnd if an acquisition came along, it would have to be directly related to what we're doing every day and be accretive immediately and add lots of business, but not for the purposes of why we acquired Waycare when we were integrating it and not why we acquired STS. We have the pieces that we need now to do what we need to do.\n\nUnknown speaker\n\nOK, that's all I have. Much thanks, and I appreciate you keeping the investors up to speed as often as you do. Thanks again.\n\nRobert Berman -- Chief Executive Officer\n\nYeah, thank you.\n\nOperator\n\nThank you so much. There are no further questions in queue at this time. I would like to turn the floor back over to Mr. Robert Berman, chief executive officer.\n\nRobert Berman -- Chief Executive Officer\n\nThanks, everybody. Appreciate the time and patience and -- just in closing, again, we've been at this for three years, spent a lot of time and effort and resources thanks to the support from our shareholders and all the stakeholders in the company. And we've built some great technology, and I think now is our opportunity to deploy it and monetize it. And we're really excited about where we sit, given what's happening in the industry with respect to the changes with the way people and governments look at infrastructure and also the way the car companies look at the way their vehicles that they sell travel across those roadways.\n\nSo we think we're well-positioned and hopefully, we'll be able to prove that with the results of our operations over the next 12 months. So thank you, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEyal Hen -- Chief Financial Officer\n\nRobert Berman -- Chief Executive Officer\n\nMike Latimore -- Northland Capital Markets -- Analyst\n\nZach Cummins -- B. Riley Financial Inc. -- Analyst\n\nKC Ambrecht -- Shay Capital -- Analyst\n\nUnknown speaker\n\nMore REKR analysis\n\nAll earnings call transcripts"
}