{
  "companyName": "Equinix",
  "companyTicker": "EQIX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/equinix-eqix-q3-2022-earnings-call-transcript/",
  "content": "Equinix (EQIX -1.55%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Equinix third quarter earnings conference call. [Operator instructions] Also, today's conference is being recorded. [Operator instructions] I would now like to turn the conference over to Katrina Rymill, senior vice president of corporate finance and sustainability. You may begin.\n\nKatrina Rymill -- Senior Vice President of Corporate Finance and Sustainability\n\nGood afternoon, and welcome to today's conference call. Before we get started, I'd like to remind everyone that some of the statements we'll be making today are forward-looking in nature and involve risks and uncertainties. Actual results may vary significantly from those statements and may be affected by the risks we identified in today's press release and those identified in our filings with the SEC, including our most recent Form 10-K filed on February 18, 2022, and 10-Q filed on July 29, 2022. Equinix assumes no obligation and does not intend to update or comment on forward-looking statements made on this call.\n\nIn addition, in light of Regulation Fair Disclosure, it is Equinix' policy not to comment on its financial guidance during the quarter, unless it is done through an exclusive public disclosure. In addition, we will provide non-GAAP measures on today's conference call. We provide a reconciliation of those measures to the most directly comparable GAAP measures and a list of the reasons why the company uses these measures in today's press release on the Equinix IR page at www.equinix.com. We have made available on the IR page of our website a presentation designed to accompany this discussion, along with certain supplemental financial information and other data.\n\nWe'd also like to remind you that we post important information about Equinix on the IR page from time to time and encourage you to check our website regularly for the most current available information. With us today are Charles Meyers, Equinix' CEO and president; and Keith Taylor, chief financial officer. Following our prepared remarks, we'll be taking questions from sell-side analysts. [Operator instructions] At this time, I'll turn the call over to Charles.\n\nCharles Meyers -- Chief Executive Officer and President\n\nThanks, Katrina. Good afternoon, and welcome to our third quarter earnings call. We had another outstanding quarter as global demand for digital infrastructure continues to grow, and customer preferences trend convincingly toward architectures that are highly distributed, persistently hybrid, deeply cloud connected and increasingly on demand, all factors fueling the Equinix position as a trusted partner in digital transformation. This vigorous demand backdrop fueled another great quarter, delivering record gross and net bookings with strong demand across all three regions, resulting in our 79th quarter of consecutive revenue growth and further demonstrating the resiliency and durability of our business even in the face of a complex and challenging macro environment.\n\nIt is increasingly evident that the global pandemic has been a catalyst for a fundamental shift in how customers view digital transformation and its importance as a strategic imperative. And this commitment to digital transformation continues even in the face of a broader dynamic of belt tightening as companies look to do more with less and see digital as a catalyst to both maximize revenues and optimize costs. While we continue to closely monitor macro conditions and adapt our execution accordingly, the fundamentals of our business remain exceptionally strong. Our expansive global reach and robust interconnected ecosystems continue to attract a wide and diverse customer set as they prioritize digital investments and embrace Platform Equinix as a point of nexus to support hybrid and multi-cloud.\n\nThis wave of digital infrastructure demand and our highly differentiated value proposition are translating to a robust pipeline, a highly favorable pricing environment and low churn, all fueling record performance across the business year to date and setting us up for a strong trajectory as we look to 2023 and beyond. As customers navigate rising interest rates and broad-based inflation, they're benefiting from our scaled purchasing power and our sophisticated capabilities in hedging, risk management and sustainability. Our operating scale and scope give us a variety of levers to manage an increasingly dynamic environment, hedging currency, power and interest rates, investing in advanced procurement teams, expanding renewables coverage and taking a programmatic approach to improving the efficiency of our world-class data centers, an advanced set of capabilities supported by a strong and flexible balance sheet. Specifically, on power, we have had a keen focus in this area and continue to feel confident in our position.\n\nOur approach to multiyear hedging is affording Equinix the visibility and predictability to communicate to customers in advance of expected power price increases and is allowing us to deliver cost points to customers that remain highly favorable against spot rates in many markets as volatility persists. While our aim remains to dampen this volatility for our customers through hedging, we do expect meaningful increases in power costs in many markets. And per our contracts, the full impact of these additional power costs will be passed on to customers. Overall, we believe we remain in a good position relative to competitors and the broader market.\n\nTurning to our results. As depicted on Slide 3, revenues for Q3 were $1.84 billion, up 11% over the same quarter last year, driven by strong recurring revenue growth. Adjusted EBITDA was up 11% year over year with AFFO meaningfully ahead of our expectations due to strong operating performance. Interconnection revenues continue to outpace the broader business, growing 13% year over year.\n\nThese growth rates are all on a normalized and constant currency basis. Equinix continues to extend its leadership as the most interconnected platform with four on-ramp wins this quarter, bringing the total in our portfolio to more than 200 on-ramps across 44 markets. We now have 11 metros across Platform Equinix enabled with on-ramps from all five of the leading cloud providers. No other competitor has more than one.\n\nIn addition to placing critical networking nodes and on-ramps at Equinix, hyperscalers are also integral to our go-to-market motion as customers continue to aggressively migrate workloads to the cloud and demand cloud proximity for their own private cloud implementations. As indicated in our recently published Global Interconnection Index, current trend lines indicate that more than 80% of Global 2000 companies will be interconnecting with more than four hyperscale providers and over 30 SaaS providers or other business partners on average by 2026. We're continuing to invest behind the momentum we're seeing in our data center services business with 46 major projects underway across 31 markets in 21 countries. We continue to build capacity under our xScale offering, including 10 ongoing xScale projects that we expect will deliver another 80 megawatts of capacity once opened.\n\nThis quarter, we added six new projects, including new data center builds in Barcelona, Tokyo and our first organic build in Jakarta, Indonesia. Our new IBX in Jakarta will add a strategically important high-growth market to our platform as we look to enable local businesses and global organizations to unleash Indonesia's digital potential. This commitment to market-leading reach continues to drive our business with customers operating in all three regions now accounting for an amazing 64% of our recurring revenues. Key customer expansions this quarter included StackPath, a leading edge computing platform provider, which expanded into Dubai and Mumbai to support the growth of its worldwide edge compute, delivery and security offerings; a win with a global multinational airline leveraging Equinix to connect to their federated ecosystem of partner airlines; as well as a significant multi-metro expansion with one of the world's largest custodian banks, deploying across all three regions and utilizing the full suite of Equinix digital services.\n\nOn that note, our digital services portfolio saw continued momentum as companies increasingly demand infrastructure and interconnection services that can be delivered as a service and on demand. Equinix Metal had a strong bookings quarter as customers leveraged flexibility and agility across multiple metros. Wins this quarter included a major design win with a global SaaS provider and a significant expansion with a leading pediatric treatment and research facility using Network Edge and Equinix Fabric to create an edge hosting environment in key U.S. metros and enable seamless and high-performance connectivity to their cloud partners.\n\nIn Q3, we added an incremental 7,300 interconnections and now have over 443,000 total interconnections on our platform. Equinix Fabric had another strong quarter as interconnection diversity continues to increase. Expansions this quarter included Colt Technology Services further expanding its footprint in Europe and interconnectivity with Equinix Fabric to optimize performance for its customers, as well as a financial software tools and enterprise applications provider implementing a global network optimization project leveraging Equinix Fabric. Internet Exchange saw peak traffic up 8% quarter over quarter and 28% year over year to greater than 27 terabits per second, representing the largest peak traffic growth since prior to the pandemic.\n\nOur channel program delivered a sixth consecutive record quarter, accounting for 37% of bookings and approximately 60% of new logos and remains a critical vector in how we are expanding our reach and scaling our go-to-market engine. We continue to see particular strength from strategic cloud technology and systems integrator partners like AWS, Cisco, Dell, Google, HPE, Infosys and Microsoft. This segment accounted for approximately half of our channel bookings and continues to grow in both deal dollar -- deal and dollar volume. With these partners, we jointly offer a blend of IT and networking technologies that allow customers to interconnect seamlessly with hyperscale cloud and other as-a-service providers and benefit from solutions that deliver optimal performance, cost, security, agility and scale across our global platform.\n\nChannel wins included a U.K. insurance firm with Equinix partner, Softcat, for a data center consolidation and modernization project at our London campus where technology elements from HPE, Cisco and Palo Alto Networks are being brought together in a cloud-adjacent architecture, all directly interconnected to Microsoft and AWS. Now let me turn the call over to Keith and cover the results for the quarter.\n\nKeith Taylor -- Chief Financial Officer\n\nThanks, Charles, and good afternoon to everyone. As you can see from our results, the Equinix team continues to execute for our customers, our communities and for our investors. Our go-to-market engine delivered record gross and net bookings in Q3, closing over 4,200 deals with more than 3,000 customers. Our success is derived from the breadth of our service offering, the scale of our growing platform, the quality of our operations organization and the focus of our investing for the longer term.\n\nFor the quarter, our net bookings performance moved up significantly both compared to our Q3 expectations and the same quarter last year due to strong gross activity, a favorable pricing environment, lower-than-expected churn and the strength of our digital services offerings. Again, we had net positive pricing actions. Consequently, our consolidated MRR per cabinet increased to greater than $2,000 per cabinet despite the weaker foreign operating currencies. A note: the expected price increases or PPIs discussed by Charles are not in either our reported or our guided numbers.\n\nThese price increases will be passed through to our customers in 2023. Over the past couple of months, we've been communicating with our customers about the pending power price increases. And most recently, we've notified them of the expected range of their power cost increase at the market level. The dialogue with our customers highlighted the value of our multiyear power planning and sourcing efforts, which is expected to meaningfully dampen the impact of inflated energy cost to many of our customers, both relative to the competition and the broader market.\n\nFinally, notwithstanding the strong bookings performance in Q3, our forward-looking pipeline remains healthy. And our backlog and our book-to-bill interval remains constant, allowing us to remain confident as we look ahead into Q4 and plan for 2023. So given the momentum in our business, we're again raising our underlying guidance across each of our core financial metrics for the year. Now while our business remains well-positioned and resilient, we continue to keep macro factors top of mind.\n\nConsequently, we chose to increase the liquidity position of the company. At quarter end, we had over $2.5 billion of unrestricted cash in our bank accounts and full access to our $4 billion line of credit, increasing the financial and operational flexibility of the business. Our net leverage remains low at 3.5 times our adjusted EBITDA, creating plenty of balance sheet flexibility. Now let me cover the highlights for the quarter and note that all comments in this section are on a normalized and constant currency basis.\n\nAs depicted on Slide 4, global Q3 revenues were $1.841 billion, up 11% over the same quarter last year, above the top end of our guidance range on an FX-neutral basis, largely due to strong recurring revenues. Q3 revenues net of our FX hedges included a $9 million impact when compared to our prior guidance rates, largely due to weaker euro and British pounds. Global Q3 adjusted EBITDA was $871 million or 47% of revenues, up 11% over the same quarter last year, above the top end of our guidance range due to strong cash gross profit and lower-than-planned operating costs, including professional fees and consulting costs. Q3 adjusted EBITDA net of our FX hedges included a $5 million FX impact when compared to our prior guidance rates and $4 million of integration costs.\n\nGlobal Q3 AFFO was $712 million, above our expectations due to strong operating performance and lower net interest expense and included a $5 million FX impact when compared to our prior guidance rates. Global Q3 MRR churn was 1.9%, a continued reflection of our disciplined sales execution to put the right customer with the right application into the right asset. For Q4, we expect MRR churn to continue to trend at the lower end of our 2% to 2.5% per quarter range. Turning to our regional highlights, whose full results are covered on Slides 5 through 7.\n\nAPAC was the fastest-growing region on a year-over-year normalized MRR basis at 19%, followed by the Americas and EMEA regions at 11% and 10%, respectively. The Americas region had another great quarter with strong gross bookings, lower MRR churn and favorable pricing trends led by our Washington, D.C. and New York metros. In August, we added Lima, Peru to our platform as part of the Entel acquisition, expanding our Latin American footprint to a fifth country and extending the Equinix platform to 32 countries and 71 markets globally.\n\nOur EMEA region delivered another record bookings quarter with strong pricing and robust channel activity led by our Amsterdam, Dublin and Frankfurt markets with strength in our IT services and enterprise verticals. And finally, the Asia Pacific region had a strong quarter with robust exports from Japan. As part of our Future First sustainability strategy, we're very proud to announce our partnership with the Centre for Energy Research & Technology at the National University of Singapore to explore sustainable technologies and alternate fuel sources for data center infrastructure. And now looking at our capital structure, please refer to Slide 8.\n\nOur balance sheet increased slightly despite the weaker non-U.S. operating currencies to $29.3 billion, including an unrestricted cash balance of $2.5 billion. Our cash balance increased quarter over quarter due to strong operating cash flow and about $800 million of ATM activity settled in the quarter. As stated previously, we'll continue to take a balanced and opportunistic approach to accessing the capital markets when conditions are favorable.\n\nOn the debt side of the house, on the heels of the rating upgrades from both Fitch and Moody's last quarter, S&P increased their debt tolerance for the company by one leverage turn, thereby increasing the level of flexibility from our balance sheet. We're pleased and appreciative of the rating improvements over the past quarters and look forward to our continued dialogue with our rating agencies. Turning to Slide 9. For the quarter, capital expenditures were approximately $553 million, including recurring capex of $50 million.\n\nIn the quarter, we opened six retail projects in Istanbul, Madrid, Manchester, Melbourne, Paris and Toronto and two xScale projects in Frankfurt and London. We also purchased land for development in Monterrey, Mexico. Our capital investments delivered strong returns, as shown on Slide 10. Our 160 stabilized assets increased recurring revenues by 7% year over year on a constant currency basis.\n\nThese stabilized assets are now collectively 88% utilized and generate a 29% cash-on-cash return on the gross PP&E invested. And finally, please refer to Slides 11 through 15 for our updated summary of 2022 guidance and bridges, including the anticipated financial results from the Entel Peru purchase. For the full year 2022, due to strong momentum that we're seeing in the organic business, we now expect our revenues to increase between 10% and 11% on a normalized and constant currency basis over the prior year. Relative to our prior guidance, we're increasing our underlying revenues by $15 million due to strong recurring revenue performance.\n\nWe expect 2022 underlying adjusted EBITDA to increase by $46 million compared to our prior guidance due to strong revenue performance and lower operating spend. We now expect to incur $20 million of integration costs in 2022. We're raising our underlying 2022 AFFO by $52 million to grow between 10% and 11% on a normalized and constant currency basis due to strong operating performance and lower net interest expense. And as a result, our AFFO per share is now expected to grow between 9% and 10% on a normalized and constant currency basis, above the top end of our prior guide, including the impact from our Q3 ATM activity.\n\nFinally, 2022 capex is now expected to range between $2.1 billion and $2.3 billion, including about $190 million of recurring capex and about $135 million of on-balance sheet xScale spend, down slightly due to timing of expansion spend. So let me stop here. I'm going to turn the call back to Charles.\n\nCharles Meyers -- Chief Executive Officer and President\n\nThanks, Keith. Our results this quarter continue to reflect strong execution by our global team and highlight the unique position that Equinix enjoys in facilitating digital transformation. As we continue to deliver exceptional business results, I want to also highlight our significant progress in advancing our Future First sustainability commitments. This quarter, in addition to our continued investments and commitments around environmental sustainability, we're very pleased to have launched the Equinix Foundation, an employee-driven charitable organization working to advance digital inclusion through philanthropic grant making and strategic partnerships.\n\nThe foundation reflects our ongoing commitment to social sustainability, and we are excited about the work we can do to build a better, more inclusive, more sustainable world, harnessing and amplifying the passion of our people to help close the digital divide in our communities across the globe. As we advance Q4 and position for 2023, our highly differentiated position continues to drive strong momentum, robust customer demand and a deep, high-quality pipeline. We are delivering sustained growth at the top line and AFFO per share while maintaining our clear focus on driving operating leverage across our business. We continue to effectively exercise multiple growth levers, including expanded market reach, enhancement of our product portfolio, accelerated new logo capture through our multichannel go-to-market engine, pricing adjustments that reflect our exceptional value and a commitment to a bold innovation and sustainability agenda, all of which demonstrates the resilience of Platform Equinix and highlights our ability to deliver distinct and durable value to our customers and our shareholders.\n\nSo let me stop there and open it up for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Jon Atkin from RBC Capital Markets. Go ahead. Your line is open.\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nThanks. Got two questions on energy. One is, Keith, if you could maybe refresh us on what portion of cash opex this quarter was for energy? And then on the PIs that you're pushing through starting next year, can you talk a little bit about to what extent it applies to customers that are in the middle of their contracts versus renewables and new contracts? Thanks.\n\nKeith Taylor -- Chief Financial Officer\n\nSo Jon, I'll take the first one. I think I'll pass the second one to Charles. It's roughly 13%. Again, it moves around quarter on quarter and it's also dependent on -- in some cases, the currency movements.\n\nBut for this year, you should see the range anywhere sort of from 12% to 13% on a per revenue dollar basis.\n\nCharles Meyers -- Chief Executive Officer and President\n\nYeah. And on the PIs, Jon, the -- look, the way our contracts reads, we're not impaired in any way from putting those through -- during the -- of course, the contract. So they're not limited to when you take renewals. So just sort of backup and give you a view on, we talked a little bit about it in the script, but I think that we will give you details, more details when we do the '23 guide.\n\nBut I think thanks to some really incredible work by our teams, we feel really good about where we are on that -- on the PI issue and on power generally. I think we're about 90% plus, or more than -- well over 90% hedged in our deregulated markets, and we're going to be topping off those positions in the coming weeks and months. And we've already communicated those planned increases to customers, and are generally able, as Keith mentioned in his script, they will provide them with cost points that are meaningfully advantageous relative to current spot in those markets. So I think we're going to -- we're in a really good position there.\n\nI think we're going to be able to pass a few. Obviously, they're not yet passed through, because we're still operating at our hedge rates from this year. But as they adjust, we've given them the advanced visibility to what they expect to see. And I think broadly speaking, they knew it was coming.\n\nAnd I think in a lot of cases, they're pleased to see that it's not quite as bad as they had feared it might be.\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nAnd if I could ask a little bit about cloud, we saw slowing growth at two of the three largest CSPs, not just percentage, but even in terms of like incremental revenue dollars. And I wondered what does it mean for your business in terms of maybe affecting the pace of cloud repatriation? And more broadly, as you look at your cabinet adds, how much of that would you attribute to things like Cloud Repatriation versus new logos versus just existing customers upsizing maybe talk a little bit about those moving parts?\n\nCharles Meyers -- Chief Executive Officer and President\n\nYeah, Jon, I do think Cloud Repatriation does happen, but I think it's probably getting more airtime than maybe it's -- it really is appropriated. I mean I think we're still very early in the movement of clouds from traditional IP architectures into cloud. And that's what we continue to see and well, I recognize, we did see some slowdown from the cloud providers: one, that was impacted significantly by currency. And two, I think a lot of it has -- as I look through those reports, and heard that was sort of reductions in usage base volume, what are likely sort of non-mission critical workloads.\n\nAnd so I think that -- as I talked to CIOs, their commitment to moving to cloud based architectures, their commitment to moving significant percentages of their overall workloads to public cloud, and then integrating that with private cloud infrastructure that needs to be cloud proximate is still full tilt. And in fact, I talked to a CIO that said that they had -- just a Fortune 200 type CIO, but they had an application state that was 4,000 plus applications. And when I asked him how many of those had been migrated to cloud, it was in the range of 200. And so a long way to go.\n\nAnd so if you look at the -- just the quantum of growth that's happening in the cloud, in any given quarter, they're adding just the top five providers or adding $3 billion to $4 billion of incremental recurring revenue. And so I think it is still a long way to go. And I think that we continue to be particularly relevant as people think about the way things used to work in IT architectures, they all live nicely together in a rack next to each other in an enterprise data center. Well, as soon as you start migrating workloads to the cloud, and then trying to interface them with your data and applications that you're still managing on your own, things don't work quite the same.\n\nAnd that's what we're seeing in our pipeline, people are saying, hey, I've got to have my hybrid, my private cloud proximate. It's got to be distributed. The applications all have to work together. And so I think we're still going to continue to see vigorous demand for this migration to hybrid and multi cloud for the foreseeable future.\n\nOperator\n\nOur next question is from Simon Flannery from Morgan Stanley. Go ahead. Your line is open.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nGreat. Thank you very much. Good evening. Just a couple if I could.\n\nJust continuing on, it's great to hear that strong demand trends, are you seeing any softness anywhere, any kind of whether it's Europe or whatever? One of your competitors talked about small enterprise is on pressure at the margin there. It seems like -- there's certainly some caution around the uncertain and macro environment. And if you put through some of these power price increases that changed some of the profitability dynamics for some of these companies. And then just on margin, some really good performance I saw in, particularly in the Americas this quarter.\n\nMaybe you can update us on the 50% target, and how Singapore is playing out as we exit 2022? Thanks.\n\nCharles Meyers -- Chief Executive Officer and President\n\nSure. There's a lot there, Simon. But let me try to cover it. And if I forget any of it, just bring it back up.\n\nBut any softness, look, we are not blind to sort of the challenging macro conditions in which we're all operating, that's for sure. But I would say that our bookings, trajectory, or sales execution, our pipeline, quality of pipeline, volume of pipeline, all continue to be very solid. And that is across regions, and it is across sectors. And I think that the phenomenon that I was just describing an answer to Jon's question is an exceptionally horizontal one.\n\nPeople just moving to these new cloud-first hybrid IT architectures and I think seeing the relevance of Equinix in that. And so are there customer segments or types that are having more challenges. That we could get that question a lot. I do think that we're less exposed to either start-ups or small company, that's typically not our sweet spot of our business.\n\nWe're really more on enterprise level, both service provider and enterprise architectures, and how people are rethinking those globally. And so we continue to see a strong level of demand. And so I think we're less exposed to that, perhaps, and then maybe public cloud providers and others that on small or start-up-type businesses that might be impacted. In terms of power and Europe, generally, I would say our European business is performing very well.\n\nAnd yes, we do expect that power is going to -- and again, it hasn't yet impacted that. We haven't rolled those through. One, a couple of comments on that. One, our history is that we've rolled pricing through in interconnection.\n\nIn fact, if you look at the non-financial metrics, we've increased MRR per cab in Europe, $100 over the last four quarters. And that's driven by interconnection pricing, that's driven by mix of business, etc. But the European business is performing very well. I do think it will create a pinch for people that they're going to have to pay for more for power.\n\nBut just put that into context, we think that a lot of our customers are going to see monthly increases that are really modest dependent on how concentrated they are in highly impacted markets. But we think that even in worst cases, where people are in a high impact market, they might be impacted by, call it, 15% to 20% of their monthly bill. And so for most people, we don't believe that is something that will impact their overall commitment to their digital transformation. But it does create, and we think -- so we think that we're going to -- to be able to continue to sustain the demand levels that we're seeing.\n\nAnd then the last piece on margin. Again, we're kind of what we would expect we were actually slightly ahead in Q3, of where our expectations would have been. And Singapore is actually slightly better than what we expected for the full year. But thankfully that's sort of coming to an end.\n\nThis is the last quarter where we'll see that. I think we'll be able to now make the adjustments that we needed to make in terms of passing through the appropriate price increases in full, in the markets impacted beginning in 2023. As I said, I think we're going to be able to do that in a way that customers, even though they're certainly not going to applaud those price increases, I think, as they look at it, in a lot of those markets, they're feeling it as consumers and they're feeling at a very acute level. And I think they're going to realize -- they're starting to realize what I think the benefits of our hedging programs are in terms of dampening that volatility for them.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much.\n\nKeith Taylor -- Chief Financial Officer\n\nAnd Simon, let me just add a couple of other quick points, if I may in addition to what Charles said. First and foremost, the objective to get to 50% margin targets, as sort of Charles alluded to, we're doing better than we anticipated in the Americas. Singapore is better than anticipated. And overall, we're running the business with a great deal of discipline.\n\nAnd I say that with emphasis. And so number one, we're seeing margin profile that's better than you might have otherwise anticipated. Two, when you sort of look into the fourth quarter, we're making some discretionary decisions to accelerate costs into the fourth quarter. But after that we continue to drive the business with greater efficiency.\n\nAs it relates to the 50% EBITDA margin target, just I've said this on a number of -- in a number of non-deal roadshows, and one-on-one discussions with investors. We're not shifting our emphasis to 50% EBITDA. We believe that we can get there. In fact, the performance of the business post the Analyst Day, we're actually doing better than we thought than we anticipated at that point in time.\n\nBut you've got a very volatile and fractious market. And so we got to deal with the consequences there. But if you look at it from a value on a per share basis, we are as good, if not better than we told you we are going to be. And so I think that's really important.\n\nAnd then the last thing I just want to leave you with is to sort of an adjunct to what -- again, what Charles said. The whole dialogue around small customers, in part of the reason that we disclose in our prepared remarks, the amount of transactions we did it to give you a sense of just the volume of activity. And so we did 4,200 transactions, again, with 3,000 customers. As we said in the last quarter, our pipeline is as strong as it's ever been.\n\nAnd in fact, I said it was healthy this quarter. It's actually we -- our pipeline is bigger this quarter than it was last quarter. And so we're really optimistic about the business and where we position ourselves and we can continue to drive value into the overall equation. And again, we're long-term focused, we want to drive value into the investor and we're very much focused on AFFO per share.\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nRight. Thank you.\n\nOperator\n\nOur next question is from Michael Rollins from Citi. Go ahead. Your line is open.\n\nMike Rollins -- Citi -- Analyst\n\nHi. Good afternoon. First, on the stabilized constant currency revenue growth 7% year over year, can you unpack that in terms of what was driving the strength between whether it was utilization, just overall pricing, interconnection, etc.? And then second topic is on capital allocation. And just curious in the wake of higher rates, if you're considering any changes to the pace and breadth of the development strategy.\n\nAnd as the AFFO dollars are approaching the combination of non-recurring capex and the cash dividends, what does Equinix want to do with the balance sheet flexibility that you were describing earlier in the call? Thanks.\n\nCharles Meyers -- Chief Executive Officer and President\n\nYeah, I'll let Mike -- or I mean I'll let Keith take the second part of that, Mike, and then let me talk a little bit about stabilized assets. And he can talk a little bit more on the balance sheet side and rates, etc. But the -- look, it was a tremendous quarter obviously on stabilized assets. 7% is particularly strong.\n\nThere is still a little bit of juice in there on the Singapore piece, but it was -- but it's definitely even without that significantly above kind of where we've been trending. And I think it's kind of a combination of all those factors that you're seeing pricing at interconnection, utilization, power density, all of those things probably really playing in. So -- and I think you're starting to now see the beginnings of seeing price actions. You're not seeing the PPIs, the power price increases, because those will roll through in '23.\n\nBut as we've talked about, we are -- we've already adjusted list pricing on a number of our products. You're starting to see that roll through in renewals, and you're seeing it on other products that are around interconnection, etc. And so I think you're starting to see that as you saw, broadly speaking, utilization is trending up nicely. In fact, if you look over the last four quarters, EMEA and APAC are both up 5%.\n\nAnd so Europe is down about 2%, but a lot of capacity added in that region, right? And so I think we're continuing to get more out of the assets that we've deployed, continuing to feel very good about the pricing environment, continuing to dense people up driving good commercial decisions. And I think that's really showing up in the stabilized assets. We also had a couple of retired assets, that in there, they're probably also further ramp. And then the last piece, I would say is churn continue to trend.\n\nWe haven't talked a lot about that. But boy, I think we've always said, look, the right to -- get the right customer, right application, right asset, that's the way to drive churn down. And I think we've seen that affect over the last -- many quarters, and continue to feel really good about that. We had obviously elevated levels to churn in the Verizon assets, which I think was really impacting our stabilized asset performance for a period of time, and have now really come through the back end of that really nicely.\n\nAnd I think feel really good about -- I candidly, I'm like -- I'm not sure that current level is, that's a little above the range that we've typically guided you guys to, but we will certainly take it and are pleased with the performance.\n\nKeith Taylor -- Chief Financial Officer\n\nAnd Michael, just going to the -- maybe just a couple of things. One of the things that you've probably noted in our same-store reporting in the earnings deck is you can see that a lot of the value on a stabilized basis is coming from colocation and interconnection. In fact, interconnection on a stabilized basis is up 10% year over year on a constant currency basis, whereas colocation is up 7%. It's been diluted a little bit by the other services, which is only up 5%.\n\nAnd then nonrecurring is down quarter over quarter largely because of the one-off nonrecurring fees that we get from the xScale business. But overall, you're seeing the strong -- just to validate what all that Charles said, it's just you can see it in that slide just perfectly. As it relates to the balance sheet, if you wouldn't mind, I would like you to reframe the question just one last time. I want to make sure we get it right and respond to.\n\nSo could you just ask that question again on where we are vis-a-vis our capital allocation?\n\nMike Rollins -- Citi -- Analyst\n\nYeah, thanks. And it was two parts. First, if you're considering any changes to the pace and breadth of your development strategy in the wake of higher rates. And then as the AFFO dollars are approaching the combination of the nonrecurring capex and the cash dividend, what do you want to do with the flexibility on the balance sheet that you were describing earlier in the call?\n\nKeith Taylor -- Chief Financial Officer\n\nYeah. So thank you on that. So first and foremost, I think we fancy ourselves as pretty darn good capital allocators. We -- also we want to invest in the highest returning investment we can make as in the organic business, and we're going to continue to focus on that.\n\nNo surprise, this quarter, we have 46 projects currently underway across 31 markets in 21 countries. So we remain very active and we want to continue to grow and expand the business horizontally. At the same time investing quite openly on the vertical side of the investment, which is digital services. So you're going to see a combination of the two and as we look into 2023 we will give you more guide on that.\n\nBut suffice it to say that we -- there is an appetite to continue to invest in the business. And we really get to enjoy the cash flows we generate in the business, and low payout ratio to basically self fund that for all intents and purposes. So I feel extremely good about that. As you look forward then, again, we are trying a little bit excess cash right now.\n\nWe saw an opportunity in the market, in the quarter, pardon me, to pull down a little bit of our ATM. And so we settled some stuff that we did in Q2 this quarter. And then we also we sold some in the quarter in and of itself at 690 -- I think the average was $697 a share. And so we chose to do that because we knew we're going into periods of volatility.\n\nAnd we wanted to make sure that we could fully effect the use of our cash flow and invest in the long-term growth of business, which is really an expansion capital, while also investing in digital services. So that's what you're going to continue to hear us talk about. And then we're also being very judicious about -- I've spoken quite openly about we want to raise more debt even in the current environment. But the question is, where do we source that debt from? And can we take advantage of different markets around the world based on prevailing cost to borrow? That's all -- you'll hear more about that.\n\nBut suffice it to say, I think you'll see more debt activity over the coming quarters than otherwise. You'd see with ATM. And then just as it relates to investment in capital, yes, I know the cost of capital is moving up. But we -- the benefit of our model is and for all the reasons you just heard Charles speak about, we get a really good return on our assets, our stabilized assets are getting 29% on them and on a gross PP&E invested.\n\nSo anytime we increment that, knowing that we're keeping our costs well in check here, that you're going to get a nice incremental return. And so from our perspective, we're not arbitraging over our cost of capital. We're driving real value into the business for our customers and for the future. And as a result, we want to continue to make that investment.\n\nAnd we'll be very wise about what we raise in the form of capital to fund our growth, knowing that you've got a dividend that's growing, and you've got a business that's growing. And as a result, we got to fund not only the business and also the capital redeployment back to the investor. So I think it's a great question you're asking. We spent a lot of energy on it.\n\nI've got a fantastic treasury team that work underneath us. And we're looking at all ways to source our capital and fund value on a per share basis to the business. And so stay tuned.\n\nCharles Meyers -- Chief Executive Officer and President\n\nMike, the -- you guys are pushing a lot of the buttons here. So I want to offer an anecdote that I think is really powerful. And that is kind of when I'm out and talking to customers and with sales teams, it's pretty amazing. Because what I hear from sales teams, their number one concern, not enough capacity.\n\nThey're like -- we're worried, we're going to run out of capacity we need, are you building more capacity? I'm not hearing, hey, what are you going to do to my quota is next year? We know the answer to that question. I'm not hearing, hey, passing through these power increases is challenging. What I'm hearing is, we need more capacity, we need to continue to invest in the business. When are we going to get more coverage on digital services, I want to cover more markets.\n\nWe need to respond to our customers' needs. And so I think it's just a reflection, we're pushing utilization up, that's starting to create some pinch points. And so from our perspective, as we look at how the business is performing, continue to invest in organic growth prudently and appropriately. And always in with a keen eye on the macro environment.\n\nIt's still best and highest and best use for us.\n\nMike Rollins -- Citi -- Analyst\n\nThanks.\n\nOperator\n\nOur next question is from David Barden from Bank of America. Go ahead. Your line is open.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good afternoon, everyone. This is [Inaudible] on for Dave. Just, Charles, maybe just on those comments that you just made in terms of building out more capacity.\n\nAre you seeing any issues just similar to what's going on in Northern Virginia and other areas of the world of power transmission issues or power procurement issues?\n\nCharles Meyers -- Chief Executive Officer and President\n\nYeah, it's a great question. The answer is yes. I mean I think you're seeing that markets around the world are thinking about how to allocate energy. They're also thinking about the sustainability impacts of data centers in their markets, and how they want to sort of -- how they want to think about providing energy and permitting to support those, etc.\n\nSo obviously, that's a key area of focus for us. I do think that overall, we're in a very good position. I think that not only do we have really well established relationships across those markets, we have a level of commitment. And I think specification on the sustainability side, that people I think feel comfortable that we are going to make the commitments necessary to support digital transformation in their markets, and digital growth in their markets in a way that's responsible.\n\nAnd so I think that's going to continue to be a differentiation for us. But we could -- and the other thing is, is that our market -- or our business and our business model are very different when it comes to power. They need to support, for example, a hyperscale facility that's going to support one or two customers and allocating that power entirely to those is very different than the power situation we find ourselves in. We have a much greater level of flexibility in terms of looking at how we're using power, moving a power around over time.\n\nAnd so I think there's some additional flexibility for us there. But the short answer is, yes, that is a dynamic that I think is not unique to Northern Virginia. We feel very good about where we are in that market, by the way, just in terms of our position there. But it is something that I think is going to be on people's minds.\n\nAnd I think we're -- on the capacity question, we're even seeing that churn -- people who were planning churn are now unplanning it. And because I think they feel like they -- that had an ensuring that they have capacity and sometimes under existing terms, or something that is close to those existing terms is a strategic decision for them. And I think we're continuing to see favorability in churn for those reasons.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. Thank you. And then maybe if I could just ask one more. Just you completed Entel and then you announced a smaller deal on Latin America.\n\nDo you just kind of walk us through the Latin America strategy and where you kind of see that that business going?\n\nCharles Meyers -- Chief Executive Officer and President\n\nSure. Generally, I would say that we feel like that the Chile edition with Entel was our strategic one that sort of fills out the LatAm portfolio in a really powerful way. And so I think we feel good about the level of coverage that we have there. That's not to say there wouldn't be potentially incremental opportunities there.\n\nBut our businesses in Brazil -- our business in Brazil continues to thrive. Obviously, current -- market currency wise, it can be challenging and has been for years. But the growth there has been really strong, and our differentiated position in that market continues to be very good. So I think that continue to invest in that business.\n\nWe're happy with the early returns on our business in Mexico. As Keith said, we've made some investments there for land and continue to see that as a -- with additional market opportunity there. Excited about the early returns. And that's one of the things we see on these businesses.\n\nWe underwrite them to a certain level of performance. And almost always we're seeing that the power of bringing those assets into our channel -- our channel, broadly speaking mean, our direct teams and our partners and giving them access to those, we are hit -- we're really typically hitting bookings velocities that are much better than what we underwrote, too. And so we feel good about that. But yeah, I think we feel good about LatAm.\n\nI think there's potentially incremental opportunity. But if I were to prioritize where I think we were more likely to make incremental M&A activity, it would be in probably maybe some other parts of the world. And we've talked about those in a variety of places. Southeast Asia, I think is continuing to reshape a bit and is a market that both organically and potentially through M&A, we would find attractive.\n\nIndia is a market that I think we will continue to invest in organically and potentially inorganically. And obviously, we've got a starting point in Africa that we are very excited about. But there's more potentially to do there. So I think that's -- I kind of went a little beyond your question there, but that's a little bit of a frame on the M&A world.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nThat's great. Thanks so much, Charles.\n\nOperator\n\nNext question is from Aryeh Klein from BMO Capital Markets. Go ahead. Your line is open.\n\nAri Klein -- BMO Capital Markets -- Analyst\n\nThank you. Maybe following up on churn, it's been low for a while here, as we move into potentially tougher macro and you ask customers to absorb kind of the full brunt of the price increases. Is that something that that you would expect to tick up?\n\nCharles Meyers -- Chief Executive Officer and President\n\nNo. So I mean we really don't see that. I think that we've seen: one, I think the history of our business and this is a pretty empirically validated is that our demand tends to be pretty inelastic. And so I think that's likely to be particularly true relative to the power price increases, which I believe in hope will be at least to some degree, transitory.\n\nNow whether or not we get back to energy level pricing levels that were -- we were at before, I don't know. But I think that -- I don't -- we don't currently see that as a driver for people to say, oh, well, we're going to churn out of our capacity. So I think it increases the level of focus that people have on efficient utilization of the capacity they have deployed. And I think they see that same dynamic a little bit in cloud, right, which is people are saying, hey, we got to tighten up on our cloud bills, we got to -- we're going to reduce usage on non-mission critical workloads.\n\nAnd I think you're seeing some of that impact in that business. Our business is much more on fixed contracts. We're starting -- we have a little bit of usage based revenue in some of our digital services. But I don't foresee us ticking up in churn in any meaningful way as a result of sort of the pricing adjustments.\n\nI think that we're going to continue to see people very committed to their digital transformation. I think like -- that will be an element of inflationary forces that our customers are going to deal with, much like we and every other company is dealing with out there. But I think it boils down to kind of how you -- what priorities you place, and we really feel like digital transformation, and the move to hybrid and multi cloud is, as I -- as we said in the script, both a revenue maximizing driver and a cost driver, in many cases, in terms of doing more with less. So we feel like the demand profile is going to continue to be strong.\n\nAnd again, our ability to forecast churn has been very, very good. And so we're not going into that blind. We continue to have confidence there. But we'll have to continue to monitor very, very closely and see how the market responds.\n\nBut I think our history and an empirical data would indicate that we have a market that's pretty inelastic from a demand perspective.\n\nAri Klein -- BMO Capital Markets -- Analyst\n\nThanks. And then, Keith, I think you mentioned some of the timing related to some spending during the quarter. Looking at Q4, the margin for the quarter are toward the lower than they've been in a long time, the implied margin. How should we think about the spending in the fourth quarter and how that may be carried into 2023?\n\nKeith Taylor -- Chief Financial Officer\n\nWell, yeah, as I said in the prepared remarks, there's an element of discretionary spend that we accelerated in the quarter. I think of that in the $20 million to $30 million range, and then you've got a pretty long range in the -- and then -- in the quarterly guide. So I would say, like, look at the underlying performance, you've got some seasonal costs to that that sort of take place in the fourth quarter that we absorbed. But overall, the business continues to perform better than we anticipated.\n\nThe margin profile, or the cash generated in the businesses is stronger than we were planning. And as a result, we use that as an opportunity to accelerate costs, and put us in a pretty good spot as we start to think about 2023.\n\nCharles Meyers -- Chief Executive Officer and President\n\nJust to give you a little more transparency on, so -- what some of those are, we're pulling forward some R&M, pulling forward -- just finishing out some projects that we are focused on both on the go-to-market side, and on the product side to -- to really give us that, the momentum going into next year. We gave a little bit more -- little wider berth to the teams on T&E in Q4. Because we really continue to believe that getting our teams reconnected both to our customers and to each other is important. And I think we're really seeing the dividends of that.\n\nAnd so -- but we're -- we definitely have not lost the plot in terms of our focus on operating leverage. In fact, if you look at our SG&A line, it's flat quarter to quarter and that's in the face of increasing investment in sales and marketing. And so that implies that we're sort of tightening down on G&A. And even though we're adding headcount in very targeted areas to support a very healthy organic performance of our business, we're also really tightening down in areas of the business in recognizing that we continue -- have to continue to have a focus on automation and simplification and efficiency.\n\nAnd we got to get that G&A leverage that we need in the business over time. So we -- there's -- we're trying to make good balanced decisions on that front. And, again, we'll give you more perspective and cover what that means. But feeling very good about the trajectory of the business as we exit toward the end of the year.\n\nAri Klein -- BMO Capital Markets -- Analyst\n\nOK. Thanks for the color.\n\nOperator\n\nThe next question is from Sami Badri from Credit Suisse. Go ahead. Your lines open.\n\nSami Badri -- Credit Suisse -- Analyst\n\nThank you. Keith, earlier, you said that you have been having conversations with your customers regarding those PIs. And you said that you have been sharing with them some ranges. I was hoping you could kind of share with us what those ranges actually are, just so we have an idea of magnitude when we enter 2023.\n\nAnd then I think there was a question about general activity and trends. And I apologize if this is a duplicative question, but the tech sector is reporting some elongated lead times and some sales cycles extending to a certain degree, there are even IT budgets to require board level approvals, which are just slowing some things down. I was hoping you could tell us if that -- those are the things that you're seeing or not at this stage. And then I have one follow-up.\n\nKeith Taylor -- Chief Financial Officer\n\nOK. Well, let me maybe just start with the ranges. So first and foremost, we want to have a go-to-market engine, the customer facing teams wanted to have some dialogue with the customers on sort of power increases. And so first of all, it was really everybody is seeing what's going on in the broader market, particularly in Europe.\n\nAnd as a result, making sure that you're sort of advising the customers that there is going to be effective power increase at some point. The second value was effectively, look, depending on where you are, one market is very, very different than other markets. Some are regulated, some are unregulated. This is the sort of the range that you should expect.\n\nAs both Charles and I have mentioned, we've got a sophisticated hedging program. We basically solidified what we think is a good portion of exposure for next year. And so we have specific information on that. And so we give them a range of what that could be.\n\nAnd again, as market specific, is volume-specific as application specific, again, customers, there's going to be a wide range for these customers depending on where they operate. And the third value will be in the not-too-distant future here is your specific increase. And so part of it is just making sure that the customer is fully understood that we're communicating with them. And we got it with -- and we give them enough time to understand what was going to happen, particularly as they start to think about their -- sorry, 2023 planning cycle.\n\nAnd so that was -- that's the first part. To give you something specific about what -- look, I could tell you, in some markets, if you look at spot, you're talking about multiples of increase, particularly in the U.K. market. That's not where we are as a company.\n\nWe've done a very good job of buying forward and making sure we have a good position with. And I think our customers, as we said, we think we will be in a better spot relative to our competition. and we will be certainly well below what I think prevailing market rates are. So that's the positive.\n\nThat is a European discussion. As you look at Asia and Americas, it's a different dialogue. You've got a much more structured increase. And overall, I feel very good about that.\n\nI think one of the things that you should walk away though, is understanding that the company is almost wholly hedged for next year. And certainly, Europe is even more hedged than the broader company. And so that's the one thing, I think, is really worth noting here. Because last year, we had some exposure to Singapore.\n\nWe feel much better where we are going into '23 on Singapore. As we said to Michael, we would go to -- come back to the market and the market would come to us and all indications is the market is coming to us. And as a result, we will pass-through those incremental costs as well. So hopefully, that helps you a little bit, Sami, but I can't give you a specific range.\n\nIt's very -- it's market and customer-specific.\n\nCharles Meyers -- Chief Executive Officer and President\n\nWe will give -- I mean, obviously, we will get more as those tighten up and as we get -- as we go into the call in February, we will give you a lot more transparency there.\n\nKeith Taylor -- Chief Financial Officer\n\nYeah. Sami, what was the second question? I think it was going to go to Charles on that one.\n\nCharles Meyers -- Chief Executive Officer and President\n\nYeah, it was around the general trends in extended cycles and are we seeing tighter IT budgets and those kind of things. Look, as I said, what we are seeing is generally a substantial commitment to the digital transformation agenda. And that doesn't mean people aren't seeing the need to tighten their belt on IT in other ways, but typically, we see that they are not -- they are trying very hard not to sort of distract their agenda in terms of the move to hybrid multi cloud as the [Inaudible] choice. And I was just reading something from Gartner the other day in terms of just looking at how important is a particular IT project to your sort of digital agenda? And what is it going to do to impact your competitiveness to drive top line growth to save money, etc.? And we continue to see a vigorous commitment to those kinds of things.\n\nAnd so -- and we have -- generally -- and Keith talked about this, both in terms of our cycles -- sales cycle and our backlog have not seen extensions of either of those things. And so sales execution has continued to be very, very good. Pipeline continues to be strong, pipeline execution and conversion continues to be strong. And so we're not saying it doesn't exist, although we're -- but what we would say is that the demand profile and how it's translating for us in bookings and pipeline is very, very good.\n\nAnd we're continuing to invest in the business accordingly.\n\nSami Badri -- Credit Suisse -- Analyst\n\nGot it. Thank you for the color on both of those. My last question is more on bare metal. And you mentioned how you have a new SaaS customer coming on using the service, and you also have a healthcare enterprise or a customer using service.\n\nAnd one of your private data center peers recently introduced a metal service and product so I kind of want to just understand what's the vision here for Equinix and the metal solution overall? Like are you guys trying to grow this two, three times? Is this going to become a much more integrated or interconnected piece to everything you do? I just want to understand what the kind of the pipeline or the road map is there.\n\nCharles Meyers -- Chief Executive Officer and President\n\nSure. Well, it definitely, I think, can be two to three times and more than that than its current size, for sure. I think it can be -- so we definitely believe it's a meaningful business going forward for us. I also think we want to see it be more fully integrated.\n\nIn fact, I think that is feedback we're getting from our customers is we love your individual digital services, but they don't work as effectively as an integrated platform as we would like. And so Scott, who franchise who joined us is sort of out there talking to customers, hearing what's on their mind, that has been a topic. And we're really continuing to align our product and development agenda to ensure that we are addressing the needs that the customers have. And so we do believe that an integrated platform, if you look at network edge, fabric and metal, we think that's a compelling combination of offerings for customers as they look to implement digital transformation strategies in hybrid and multi cloud.\n\nAnd so -- but I think it's important that we really continue to view that as giving them the right sort of portfolio of services to meet their needs. We think that actually public cloud will be a great home for a significant portion of their workloads. We definitely see sometimes repatriation back to either a colo-based solution or a metal type-based solution that allows sort of different level of economic scaling and utilization is something that happens. But we are -- we want to respond to the needs of the customer and have the right solution for them.\n\nAnd so when that's cloud, that's great. Move the workloads to the cloud, we will give you the connectivity you need to connect it to the data and other applications you need to have it perform well, and we will distribute that infrastructure around the world. And so I think us being able to go in with that trusted advisor status with the customer is really what's driving the business. But we definitely see a big opportunity in metal and I think -- and with the broader digital services portfolio as continued.\n\nAnd as we've said in the past, it's growing at a multiple of the rate of our -- of the broader business.\n\nSami Badri -- Credit Suisse -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nAnd our last question today is from Matt Niknam from Deutsche Bank. Go ahead. Your line is open.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nHey, thanks for taking the question. And I'll keep it to one because I know we're over the hour. You're tracking a 9% to 10% -- not a problem. So I know you're tracking a 9% to 10% constant currency growth on AFFO per share this year.\n\nBut there's obviously headwinds from rising interest rates and higher power costs. And I know you've mentioned you intend to pass those through. But the question is really what confidence level do you have in the ability to stay within that 7% to 10% AFFO per share growth range for next year with a number of headwinds out there? Thanks.\n\nCharles Meyers -- Chief Executive Officer and President\n\nSure. Clearly, we are not going to give you a sort of a guide for next year, and we will give you that early. I guess I'd sort of reposition the question to simply tell you that if you look at our performance of what we said we would do at Analyst Day -- at the Analyst Day and what we've now done, I think we continue to feel really good about the trajectory of the business. Top line growth is strong, stronger than outside of the bounds of what we had said.\n\nI think that -- and I think that's really on the strength of underlying business momentum. And so -- we feel really good about the trajectory going into next year from a top line growth standpoint, too. I think growth will be a little wind assisted on PPIs next year, but I think we will give you clear transparency on what that is. But I think it's going to be on top of really strong underlying momentum in the business.\n\nAnd we think that's translating into the AFFO per share sort of growth that we think is needed and attractive. And then you combine that with a healthy dividend yield -- and we think it's a great story. So generally, I would say feel good about the momentum. Top line growth is good.\n\nWe are going to continue to focus on operating leverage. And we think, therefore, we are going to be able to deliver strong performance on an AFFO per share basis. Keith, anything to add there?\n\nKeith Taylor -- Chief Financial Officer\n\nAnd Matt, the only other thing I would say is one of the things that, again, you talked about normalized constant currency. And so on a constant currency basis, we're taking roughly relative to where we started the year about $180 million hit to the top line because of currency movement, and about $85 million to the EBITDA line. So it gives you a sense that what we're absorbing. So the performance of the business is doing much better than we had anticipated.\n\nAnd you can see that coming in so many different places, including the Americas business. I think when the -- I think the other thing that's going to certainly aid many of us, particularly those that are U.S. domiciled, as currencies start to move the other direction, which I suspect that they will at some point, that you're also going to get wind at your back from currency. So not only do you have the momentum coming from what Charles alluded to, but I also think that you've got -- you're going to have currency movement when other -- where other sort of central banks move their rates up to the U.S.\n\nor the U.S. starts to slow down on their rate increase. And that's going to be, I think, a real benefit to the business. And as I said before, if you just take our top three currencies, you take them back to our traditional parity level, not a deviation higher or lower, I mean you're really talking about a significant increase in revenues just from currency movements.\n\nOf course, we hedge ourselves and we do a really good job of currency hedging. But I wanted to leave you with that thought as well. It's not just about the pure execution to the business on how we are operating it, but also there's some currency movement that I think is going to benefit us as well.\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nThat's great. Thank you.\n\nCharles Meyers -- Chief Executive Officer and President\n\nThanks, Matt.\n\nKatrina Rymill -- Senior Vice President of Corporate Finance and Sustainability\n\nThank you. That concludes our Q3 call. Thank you for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKatrina Rymill -- Senior Vice President of Corporate Finance and Sustainability\n\nCharles Meyers -- Chief Executive Officer and President\n\nKeith Taylor -- Chief Financial Officer\n\nJon Atkin -- RBC Capital Markets -- Analyst\n\nSimon Flannery -- Morgan Stanley -- Analyst\n\nMike Rollins -- Citi -- Analyst\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nAri Klein -- BMO Capital Markets -- Analyst\n\nSami Badri -- Credit Suisse -- Analyst\n\nMatt Niknam -- Deutsche Bank -- Analyst\n\nMore EQIX analysis\n\nAll earnings call transcripts"
}