{
  "companyName": "Robinhood Markets, Inc.",
  "companyTicker": "HOOD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/robinhood-markets-inc-hood-q3-2022-earnings-call-t/",
  "content": "Robinhood Markets, Inc. (HOOD 1.12%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nHello, everyone, and good day. Thank you for standing by. Welcome to the Robinhood third quarter 2022 earnings conference call. [Operator instructions] Please be advised that today's conference call is being recorded.\n\nI would like to now hand the conference call over to Chris Koegel, our vice president of investor relations. Go ahead.\n\nChris Koegel -- Vice President, Investor Relations\n\nThank you, Halley. Welcome, everyone, and thank you for joining us for Robinhood's third quarter 2022 earnings call. With us today are CEO and co-founder, Vlad Tenev; and CFO, Jason Warnick. Before getting started, I want to remind you that today's presentation will contain forward-looking statements about our financial outlook and our strategic and operational plans.\n\nActual results could differ materially from our expectations and we have no duty to provide updates unless legally required. Potential risk factors that could cause differences, including regulatory developments that we continue to monitor are described in our press release issued today and related slide presentation on our investor relations website, our Form 10-Q filed August 30, 2022, and in other SEC filings. Today's discussion will also include non-GAAP financial measures. Reconciliation to the GAAP results we consider most comparable can be found in the earnings presentation on our investor relations website at investors.robinhood.com.\n\nWith that, let me turn it over to Vlad.\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nThanks for the intro, Chris, and thanks to everyone for joining. Six months ago, we set an ambitious goal for us to return to adjusted EBITDA profitability by the end of the year. I'm proud to announce that we achieved this milestone a quarter ahead of schedule, and I'm incredibly proud of our team. In Q3, we generated adjusted EBITDA of $47 million.\n\nIn spite of a tough macro backdrop, we were able to simultaneously decrease costs, increase revenues and demonstrate diversification of our business model. We feel our cost structure is in a good place. So we're now fully focused on delivering great products and service for our customers and growing our business. I'll tell you more about our plans here.\n\nBut first, let's take a look at how our customers are doing. Amidst the challenging macro environment, customers continue to trust us with billions of dollars of net deposits each quarter as they invest through the cycle for the long term. Excluding those deposits, our customers' portfolios, on average, slightly outperformed the NASDAQ and S&P in Q3. These factors drove customer assets under custody, up by about 1% to $65 billion despite equity market values declining again this quarter.\n\nThis environment highlights the importance of serving our customers' financial needs through the cycle and of diversifying our business beyond trading. So let me tell you more about some of the products we're working on across brokerage, crypto and money. Starting with brokerage. Today's high interest rates can be challenging for customers with mortgages, student loans and car payments.\n\nAt the same time, they present an opportunity for our customers to earn one of the highest yields available on their uninvested cash at levels not seen in over a decade. In September, we introduced a fantastic interest rate for our gold members, 3% on cash via our sweep program with no balance limits, none of the time commitments that CDs have and FDIC insurance of up to $1.5 million, six times what you get from a typical bank account. We're really excited about this product because it helps customers earn on their cash even when they're not investing. And so far, we like what we see with gold cash sweep balances up by over $1.5 billion since we raised rates.\n\nAnd following today's Fed rate hike, we'll raise the interest rate for gold customers even higher. This is just another one of the investments we're planning for the coming years to make Robinhood Gold the best deal in financial services. We also want to provide great value for customers, investing for the long term at Robinhood, so we're excited to launch Robinhood Retirement, just in time for the New Year and the heart of IRA season. For our customers looking to open a new retirement account or roll over an existing IRA or taking their first steps in long-term investing, we're excited to share this product with you, and we know you'll love it.\n\nFinally, I want to share some of the great work our brokerage team has been doing for our advanced customers. Recall, our advanced customers are customers who trade more actively and use more sophisticated products like options. We're one of the very few platforms that offer options trading with no contract fees. And this is incredibly valuable for customers who place a lot of option trades.\n\nIn case you don't know about this, most companies charge something like a $0.65 per contract fee for each option trade. And that's in addition to payment for order flow at about the same levels we generate. And while that may not sound like a lot of money, not paying those fees saved our customers over $600 million in the past year. We love saving money for our customers like this and think customers of a lot of other firms are paying way too much to trade options.\n\nNow, at the start of the year, our advanced customers were, on average, less satisfied with our service than our other customers. So we listen to their feedback and double down on building products designed for them, starting with hyper extended trading hours and stock lending. We kept hearing they wanted more trading data, tools and analytics in the app. So in August, we rolled out advanced charts.\n\nWe built these natively to give advanced customers quick, simple, customizable and in-depth analysis that they want for trading without cluttering the user interface. Additionally, while churn is at the lowest level in years, a leading driver of advanced customer churn was not being able to trade options in cash accounts. So we are pleased to roll out this feature in July. And in the past six months, we've seen a flip where advanced customers now have higher satisfaction with the Robinhood experience than our other customers.\n\nOf course, there's always more to do, and we're continuing to invest to make Robinhood a fantastic platform for everyone. Now, let's move to crypto. We want everyone to have safe, easy and low-cost access to the power of the decentralized web, which we believe is the future operating system of financial services. So after building a wait list of more than one million people since May, we're excited that we rolled out the beta of the Robinhood Wallet, our self-custody Web 3 wallet to the first 10,000 customers last month.\n\nWhile it's early, we're hearing from customers that they love the simple and intuitive mobile experience and they really love the no gas fees.  They also tell us that they'd like us to add more blockchains to increase the breadth of coins available for them to swap and trade. We're encouraged to see this enthusiastic early response and we'll keep enhancing the wallet. And we're planning to roll the Robinhood Wallet out internationally. So we're excited that this will be our first product available to people all over the world.\n\nWe also continue to roll out more coins over the past quarter in a deliberate and considered manner. One of these was our first stable coin USDC from Circle. As part of this rollout, we're creating a new free educational program called Learn and Earn that gives our customers the ability to earn crypto simply by learning about it. We're excited to roll this out and give our customers even more reasons to engage with our awesome educational content.\n\nNow, let's talk about Robinhood Money, which includes our cash card as well as tools to move money in and out of Robinhood. While it's still early for our cash card, which launched in March, we have over 500,000 customers today. We're focused on continuing to improve the experience. So more customers use the cash card as the top card in their wallet.\n\nLooking ahead, we're excited to be introducing the new card to our six million legacy cash management customers soon, so they can also enjoy the enhanced benefits. Another Robinhood staple that customers have loved for years, is our seamless instant deposits. And this is something that we continue to invest in, including giving gold customers the ability to make instant deposits of up to $50,000. We realized that some customers want to be able to withdraw their money instantly as well rather than wait up to five business days for traditional ACH transfers.\n\nSo last month, we started rolling out instant withdrawals, providing customers with a new option to withdraw cash instantly to participating banks at a competitive 1.5% price point, while always maintaining the ability to use free ACH transfers. We think customers will really like the experience and pricing of our new expedited service as well as having expanded choice of money movement options. We're excited to roll this out more broadly, and we're going to keep you posted on our progress here. Stepping back a bit, we've seen and managed through a lot of change in the past year, change in the economy, geopolitics, financial markets and change in Robinhood as well.\n\nWe've gone from an environment of easy money to one of foucs and constraint in the outside world and within Robinhood itself. And while it's been hard, I think this transformation has been incredibly positive for the company. Despite significantly trimming our headcount and expenses, we've seen our fastest product velocity and iteration speed and our service quality for customers is the best I've seen. Our focus remains on building exceptional products that give ordinary people control over their financial lives and giving open access to tools once reserved for the rich.\n\nI'm lucky to be working with such a talented team. And I again wanted to congratulate them for driving us to adjusted EBITDA profitability one quarter ahead of schedule. With that, let me turn it over to Jason.\n\nJason Warnick -- Chief Financial Officer\n\nThanks, Vlad. It's good to speak with everyone today. In the third quarter, we stayed focused on serving customers, growing our business and driving long-term shareholder value. In spite of the macro environment, our team continued to deliver on our 2022 road map, which helped maintain steady net funded accounts and drive strong net deposits.\n\nAnd as Vlad mentioned, we generated positive adjusted EBITDA in Q3 by continuing to increase revenues and lower costs. I'm pleased by the progress we've made through the first three quarters. Let's look at the third quarter, starting with business results. Net funded accounts were 22.9 million, up about 60,000 from Q2.\n\nMonthly active users were 12.2 million, down 1.8 million from Q2. Despite the difficult environment, we're encouraged by our continued industry-leading engagement and low churn through another volatile quarter. We've also seen net funded accounts continue to tick up in October and MAUs increased to 12.5 million. Turning to assets under custody.\n\nThey were $65 billion, up about 1% from last quarter. AUC grew as strong net deposits more than offset the impact of lower market valuations. In October, we saw AUC move back up to about $70 billion. Looking more closely at net deposits, they were $2.7 billion in Q3, which translates to a 17% annualized growth rate.\n\nWe've continued to see net deposit strength in October with customers contributing over $1.5 billion in the month. This is encouraging for long-term asset growth as the combination of strong net deposits in rising markets can drive meaningful asset growth over time. Now, let's look at Q3 financial results. Adjusted EBITDA was positive $47 million.\n\nThis improved by $127 million from Q2 and over $190 million from Q1, and our adjusted EBITDA margin increased more than 60 points over the past two quarters. These improvements were driven by higher revenues and lower costs that drove operating leverage. While delivering positive adjusted EBITDA this quarter was an important milestone, I'd emphasize that we're early in our journey to drive higher profits over time. Now, let's review our Q3 revenues.\n\nTotal net revenues were $361 million, a 14% increase from Q2. This was primarily driven by higher net interest in transaction revenues, partially offset by seasonally lower other revenues. Q3 ARPU was $63, up from $56 last quarter. Now moving to transaction-based revenues.\n\nThey were $208 million, up 3% sequentially. Notional volumes increased in equities and options but decreased in crypto. For October, we saw trading levels across the three categories roughly in line with September. Looking at net interest revenues, which is a growing part of our revenue mix, it reached a new high of $128 million in Q3, up over 70% from Q2 and driving over 35% of total revenue as the Fed continued to increase rates.\n\nI'd like to highlight a couple of things. First, interest-earning assets were up to over $17 billion as of the end of last week, driven by growth in our cash sweep balances, partially offset by strong customer net buying into the market. As of the end of last week, our cash sweep balances were up to $3.7 billion, including $2.4 billion in gold. One of the things that's really exciting is the majority of the increases in gold suite balances are from new deposits with the rest largely coming from upgrades to gold.\n\nSecond, our fully paid securities lending program, which just launched in May is off to a good start. It generated about $4 million of revenue in Q3, already reaching 15% of revenues from our margin securities lending. Looking ahead to Q4, we're encouraged by what looks likely to be another quarter of net interest revenue growth. As we consider what we see today for the forward Fed curve, customer balances and deposit rates,as well as a decrease in our margin book and securities lending so far in the quarter, we anticipate Q4 net interest revenues will be up by roughly $25 million from Q3.\n\nWe could certainly come in higher or lower than that level, so we'll have to see how Q4 plays out. Also, I'd like to note that we've added customers cash sweep balances to our monthly metrics for Q3 and going forward. This should help give additional insight into how our net interest revenues are trending as we move through each quarter. Moving on to other revenues.\n\nThey were $25 million, down $17 million from Q2, primarily due to the seasonal decrease in proxy-related revenues. The largest driver of these revenues are gold subscribers, which finished Q3 at $1.1 million. We're really excited to be investing in our gold program with our high-yield offer of 3% on customer sweeps driving strong net deposits. We like this early signal, and we're looking forward to finding more ways to add value to the gold program.\n\nNow let's look at expenses, starting with opex prior to share-based compensation. They were $425 million in Q3, which includes $90 million of restructuring charges. If we look at opex prior to SBC and restructuring, they were $335 million, which was an improvement of over $90 million versus Q2. Progress was primarily driven by reductions in workforce and third-party labor and improvements in several other cost categories, including technology infrastructure.\n\nGiven our progress, we expect Q4 opex prior to SBC to be in the range of $350 million to $370 million, which includes planned increases in marketing. I'd note that this Q4 level is roughly $100 million below where we started the year, reflecting the progress we've made getting to a leaner operating position. Turning to share-based compensation. It was $110 million, which is net a $53 million reversal from our August workforce reduction.\n\nFor Q4, we expect SBC will be in the range of $150 million to $190 million. As for dilution, I'd like to share a couple of updates here. First, we're adding new disclosure to our quarterly earnings presentation for our diluted share count, which is up by a little more than 4% through the first three quarters of this year. For year-end, we expect diluted shares to be in the same zone as Q3.\n\nSecond, looking to next year, we're planning for our diluted share count to grow by 4% or less, assuming no change in our stock price from today's level. Now to capital management. I want to share an update on our Ziglu acquisition. While the parties are working hard at it, there's some regulatory uncertainty as to whether the deal will close.\n\nWhat we know at this point is that the deal won't close this quarter. I'd emphasize that we like several pathways to international expansion, including launching our Robinhood Wallet globally early next year. So we remain excited about the opportunity to serve customers around the world over time. In the current environment, it also remains important for us to have a strong balance sheet and cash position.\n\nThat's why we like our position with no debt, over $6 billion of corporate cash and improvements in our cost structure. This combination provides strength, flexibility and financial runway to continue serving our customers, execute on our product road map and evaluate potential acquisitions. As I mentioned last quarter, we have roughly $2.5 billion of excess cash above our risk scenarios. In closing, I'm really pleased with the progress in Q3 and optimistic about the opportunities ahead of us to deliver value for customers and shareholders.\n\nWith that, Chris, let's move to Q&A.\n\nChris Koegel -- Vice President, Investor Relations\n\nAll right. Thank you, Jason. Leading into this quarter's Q&A session, we'll start by answering about a dozen questions of the top questions from shareholders from Say Technologies ranked by number of votes. We'll pass over any questions that were already answered on the call and group together questions that share a common theme.\n\nAfter that, we'll turn to live questions from our analysts. So I'll kick it off with one of our top questions from Say Technologies. I'm going to pair together two questions. The first is from Don Arti who asks, will retirement accounts be offered this year? And also another from Srikant asks, are there any plans to add Roth IRA accounts to Robinhood?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nI'll field that one. The short answer is yes to both. So we're excited to roll out retirement just in time for the tax season. The team has been working hard at it.\n\nI think you'll really like what the product is going to look like and the value prop for customers. And we're polishing it and making sure that it looks great. But we feel good about rolling it out just in time for the tax season.\n\nChris Koegel -- Vice President, Investor Relations\n\nGreat. And will that include Roth IRAs as well, Vlad?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYes, it will. So we'll have additional context as we get closer, but we think people are really going to like it.\n\nChris Koegel -- Vice President, Investor Relations\n\nTerrific. All right. The next question also on product. Are there any -- Brian Y.\n\nasks, are there any plans to add bonds to available investments?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nThanks, Brian. While we don't have near-term plans to offer bonds. We do have a lot of solutions for customers that want exposure to fixed income products. So of course, we already offer bond ETFs.\n\nAnd as I mentioned in the call, we have a very competitive offering for gold customers where we pay them interest on their uninvested cash. So that rate has been 3% since the last Fed rate hike and will actually increase even further after today's Fed rate hike. In terms of bonds and adding more instruments to Robinhood, we haven't been hearing a lot of customers requesting those specifically. That said, we understand that with retirement and as we continue to add more tools for long-term investors who are diversifying, we might begin to see more feedback about that.\n\nSo we're obviously always listening to customers and we're able and excited to add the products that they care about most. So we're going to continue to keep an eye on that.\n\nChris Koegel -- Vice President, Investor Relations\n\nAll right. One more product question from John S., who asks, are there any plans to launch a credit card at Robinhood?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nFor credit cards, we don't have any near-term plans here. But today, we offer a debit card with rewards and merchant incentives, and also two-day early pay if you direct deposit your paycheck. So this was introduced with the launch of the Robinhood cash card earlier this year. So we recognize customers may want access to credit, particularly in this environment.\n\nSo we're going to be looking at that, but no immediate near-term plans for credit cards.\n\nChris Koegel -- Vice President, Investor Relations\n\nOK. Thanks, Vlad. The next question is a capital question, so probably for you, Jason. So Erfan A.\n\nasks, are you planning to give dividends in the future?\n\nJason Warnick -- Chief Financial Officer\n\nWe don't think giving dividends is the best use of our capital right now. We're focused on using our cash to drive growth through product development and international expansion. We also like the flexibility to grow via acquisitions. But over time, we'll continue to evaluate whether returning to cash to shareholders is the right move.\n\nBut again, right now, it's -- we're focused on growth as a higher priority.\n\nChris Koegel -- Vice President, Investor Relations\n\nAll right. Thanks, Jason. Another question from Brian Y., who asks, when will we see a return of IPO access?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah, I'll field this one. So in terms of IPOs that we offer on the Robinhood platform. We have some selection criteria. And the fact of the matter is this has been a really slow year for IPOs that would be big enough in terms of market cap to feature to our customer base.\n\nSo understanding that this is cyclical as soon as the IPO market turns around and we see more IPOs that meet those criteria, we're going to be hard at work to bring those to our customers so that they can participate.\n\nChris Koegel -- Vice President, Investor Relations\n\nGreat. Ottanu who asks a couple of questions in a two-parter. Let's take those separately. So in part one, he asks, when will Robinhood go global?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYes, I'll take that one. Thank you for the question, Ottanu. The short answer is next year. So we plan to roll out the Robinhood Wallet internationally.\n\nSo that will be available internationally or early next year. And this will actually be our first product available to customers all over the world. And as Jason mentioned, there is some regulatory uncertainty that we continue to work on our Ziglu acquisition.\n\nChris Koegel -- Vice President, Investor Relations\n\nAll right. And Ottanu also asks, when do you think Robinhood might regain its IPO valuation?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYes. Thanks, Ottanu. So as we think about shareholder value, we recognize that the stock performance as well as the overall market has been hard for shareholders this year. And we're hard at work, adding value to our business.\n\nSo let me tell you how we're thinking about this. First, we're very focused on our cost structure. And as you guys have seen, we've made a lot of progress here in the last couple of quarters, and it's going to be important for us to manage the as we grow from here. Second, we've got a lot of improvements that we've made to existing products.\n\nWe've introduced new products. And we have really tremendous progress here as well. As I mentioned earlier in the call, the product velocity, the improvements in service quality and product quality for our existing products has been some of the best that I've seen since starting Robinhood. And I expect that to continue.\n\nAnd we're going to be focused and constrained, and we're probably not going to be able to get to as many things as if the market was doing a little bit better. But I think the things that we do get to are going to be tremendous, and we're going to continue to have good velocity, and we think if we keep doing both of these things, if we keep improving the product quality of our existing products and rolling out really impactful new products, we're going to deliver a lot of shareholder value over time.\n\nChris Koegel -- Vice President, Investor Relations\n\nAll right. Thanks, Vlad. Maybe the next one is for Jason. So John P.\n\nasks, can you talk about how rising interest rates affect the business and where you see the business benefit -- benefiting from higher roots?\n\nJason Warnick -- Chief Financial Officer\n\nSure. I can take this one. Our two biggest areas that we generate revenues are from trading activity on the one hand and interest revenues. With interest rates increasing, we've seen trading come down recently.\n\nBut we have about $17 billion in assets that generate interest. So when rates increase, those assets generate more interest revenue for us. But it's not just us that benefits from rising interest rates. Customers also benefit.\n\nAs Vlad was talking about today, we've increased the rate that gold members can earn on their cash. It's currently 3%, and we're really excited to increase that further now that the Fed increased rates further today.\n\nChris Koegel -- Vice President, Investor Relations\n\nAll right. Thanks, jason. The next one is from Heckman P. who asks, when will 24-hour trading be offered at Robinhood?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah, I'll field that one. This is something that I'm very excited about. So I mean, Robin Hood has really been about modernizing stock trading and bringing it into the 21st century from the time we got started. So we were the first to introduce the zero commission model, we made it seamless to use on mobile.\n\nAnd one of the things that's particularly archaic right now is the fact that stock trading in U.S. equities, which is such a large and vibrant market is structured around East Coast working hours. So our goal is to modernize that and deliver 24/7 round-the-clock stock trading, making investing accessible whenever people want. We think this is particularly going to be important as we start offering our services internationally.\n\nSo at Robinhood today, and this is as of earlier this year, people can trade for over half of the day. So starting at 7:00 a.m. to 8:00 p.m. Eastern.\n\nWe're now beta testing even longer trading hours, which include 4 a.m. to 7 a.m. Eastern. So extending it by three hours in the early mornings.\n\nAnd so once that's launched, customers will be able to trade for 16 hours a day. And so you're continuing to see us make progress. And the goal is to get to 24/7 trading as soon as possible. So plenty of exciting work happening there.\n\nChris Koegel -- Vice President, Investor Relations\n\nAwesome. Thanks, Vlad. OK. Next question, Marcus G.\n\nasks, the media has been dunking on Robinhood through various docs, podcasts, Reddit, etc. How do you plan on countering the negative opinions out there and bringing these people back into the fold?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah. Thank you for that, Marcus. So if you really look back, I think a lot of the negative sentiment that you're seeing goes back to the mean stock rally around January of 2021, so nearly two years ago. And at that point, we had to make a very difficult decision to take away the buy button on some stocks, and we didn't earn too many fans through that to put it mildly.\n\nAnd it's been hard work to regain trust. We've made a lot of progress. I think a lot of it starts from improving the quality of the service, listening to customers, showing that we are a reputable and reliable and solid platform for them. And we've been measuring this actually.\n\nWe've seen that we've made a lot of strides in customer Net Promoter Score. Every time we improve the service offering, we improve customer support, particularly when we added 24/7 live phone support and followed that up with chat, we see these measures pick up. So we made a lot of progress. But as they say, trust takes a while to build and rebuild and we're focused on the long term, and we believe that the work that we're doing to make our service better and particularly for advanced customers is starting to pay significant dividends for us.\n\nSo I know it's a long answer, but we believe that in this case, as we continue to do the right thing, build exceptional products, the sort of like media and Reddit and social media recognition is going to follow that.\n\nChris Koegel -- Vice President, Investor Relations\n\nAll right. Thank you, Vlad. One more question from Sajan P. who asks, Robinhood has always spoken about being a safety first company, with wallets set to launch in 2023 and the addition of new coins.\n\nCan you talk about how Robinhood will keep its investors safe from similar phases of licensed like Celsius?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nSure, Sajan and thank you. It's great to see you asking good questions, earnings call after earnings call. So stepping back, the goal of Robinhood crypto, as we've stated, is to be the safest, most trusted and lowest cost on-ramp to the decentralized web. So I think this is a great example of building the trust that we were just talking about.\n\nWe're very selective about the coins that we list on the platform. We have a rigorous coin listing framework, which we believe is best-in-class. We're also not engaged in crypto lending. We custody coins.\n\nAnd with the Robinhood wallet that we just introduced the 10,000 beta customers. We give customers the option to sell custody as well. And we're also in regular contact with the SEC about the crypto offering. So you'll see us continue to take a deliberate approach, and we hope that customers understand and appreciate that we're moving carefully.\n\nAnd sometimes, that means moving a little bit slower than a lot of these other crypto companies. But again, we want to be extremely deliberate and to help protect customers and their money.\n\nChris Koegel -- Vice President, Investor Relations\n\nOK. Thanks, Vlad. Let's do one last question. So Caleb P.\n\nasks, where do you see Robinhood in five years?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah, this is a great question. So coming back to our mission, the mission of Robinhood is to democratize finance for all. And what that means to us is really building exceptional products that give ordinary people control over their financial lives and giving open access to tools that were previously available only to the wealthy. And so if you look out five years, what would we like Robinhood to do? The first thing is we'd like Robinhood to be -- to serve our customers' entire portfolios and entire wallet.\n\nSo we'd like you to find value and direct deposit in your paycheck into Robinhood and using Robinhood for all of your spending for you to use it for saving. Of course, all of the investing that we offer right now, but also long-term retirement and passive. So we want Robinhood to be the highest value and best user experience tool for you to manage all of your money. The second thing is we want Robinhood to be the default choice for your first financial account.\n\nSo that entails always being focused on the next generation of customers. We don't want to just be a millennial-focused company and grow with our customers because I think that's the recipe for eventually being irrelevant. So every every generation, we have to continue to adapt our offerings and be top of mind as our customers think about opening not just their first investing account, but also the first place they deposit their paycheck and the first account they used to the spend out of. And then also, we're going to be a global company.\n\nSo we think crypto is a big part of that, and we're excited to continue to invest there. We've been making a ton of investments in the past year despite it being crypto winter. And we want Robinhood to serve the entire world and offer low-cost, extremely simple and affordable and easy-to-use services to a much broader market. And if you look at it, the U.S.\n\nis actually fairly well served here. We've got lots of people around the world that can't even benefit from a functional financial system. So we think there's not just a big opportunity, but a big a big part of our mission is serving those customers overseas. So there's going to be a lot of work done to invest and innovate in crypto and to expand international as well.\n\nChris Koegel -- Vice President, Investor Relations\n\nAll right. I think that's good for today's questions from Say. Thank you, everyone, for your questions. We appreciate all the thoughtful engagement from our shareholders and customers.\n\nAnd now it's time to open up the line for analyst questions. So we'd ask each analyst to limit their questions to one question and one follow up. I'll now ask Halley to please open up the line.\n\nOperator\n\n[Operator instructions] Our first question comes from Josh Beck from KMCM -- or sorry, KBCM. Your line is now open.\n\nJosh Beck -- KBCM -- Analyst\n\nThank you for the question. Yeah, I guess, I really wanted to kind of just dig into the expense side of the equation. Obviously, you've made real strides and obviously, we're able to hit that EBITDA target ahead of schedule. As we look forward into next year, not really expecting guidance, but just qualitatively, how should we think about the baseline of Q4 as we kind of move forward?\n\nJason Warnick -- Chief Financial Officer\n\nYeah. Thanks, Josh. So it's Jason. I'll take that one.\n\nSo we provided guidance in my remarks that in Q4, we'll take our opex, excluding share-based compensation to the range of $350 million to $370 million. I think, Paul, we don't have guidance yet. We're busy doing planning for next year. But qualitatively, what I'd tell you is that we like where we're at in terms of our cost structure.\n\nWe think it's much leaner and more scrappy of a position than how we started 2022. And you should expect that we'll continue to carefully manage our cost base as we grow from here. We'll make the investments that we think are prudent for growth, but we're going to do it with a lean and scrappy mindset.\n\nJosh Beck -- KBCM -- Analyst\n\nOK, very helpful. And then for a follow-up, maybe just a little bit of a product question. Certainly, the money product and the cash card updates were encouraging, I believe, half a million customers already since the launch earlier in Q1. How do you think about a ceiling for where that could go? Obviously, it's encouraging to see that out of the gate.\n\nBut I don't know if the survey work that you've done or pace of adoption. Just curious on how that could progress moving forward?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah, I'll take that one. So as I mentioned earlier, we're really excited about serving our customers' needs more broadly than investing. So we see the opportunity to actually evolve the cash card to be people's primary spending account. So we'd like our customers to direct deposit their paychecks.\n\nAnd we've started building things to make that process easier, like two-day early pay and also the ability to auto invest your paycheck. And it's starting to see good adoption among our existing customers to the point where we have over six million customers on legacy cash management, and we feel really good about starting to move those customers over. And I think at that point, the cash card will have exposure to a significant portion of our customer base. This is earning the right to be someone's paycheck direct deposit institution of choice is going to take time.\n\nWe know that this is a new product for us. but we're very excited about the team and the strategy ahead for 2023. So I think you're going to like what you see out of the cash part.\n\nOperator\n\nThank you. Our next question comes from the line of Devin Ryan from JMP Securities. Your line is now open.\n\nDevin Ryan -- JMP Securities -- Analyst\n\nGreat. Good afternoon, everyone.\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nHey, Devin.\n\nJason Warnick -- Chief Financial Officer\n\nHey, Devin.\n\nDevin Ryan -- JMP Securities -- Analyst\n\nSo first question, nice to see cash building again on the balance sheet. I think with all the hard work you've done on expenses. Jason, I know mentioned interest in M&A just given the pretty harsh reset we've seen valuations, I just love to get an update on how you're thinking about the M&A market today, where opportunities may be emerging? I know a number of companies are much further away from getting to profitability? And then just remind us on some of the priorities, whether that be deals that scale customers or add new adjacent capabilities?\n\nJason Warnick -- Chief Financial Officer\n\nSure. I'll start and we'll see if Vlad has anything to add. So we love our strong balance sheet position, $6 billion in cash. I think we're in a really good position to be looking at growth, not just through investments in new products organically, but also through M&A transactions.\n\nIt's a variety of types of companies that we might look at, whether it's acquisitions that are focused at kind of rounding out our portfolio of licenses or technology, but then also just with the vision of democratizing finance for all and that being so much more broad than simply trading I think there's a number of ways that we could extend the product offerings that Robinhood offers to customers through M&A. So we've got a solid team. We're paying really close attention to the opportunities that are out there, but we're going to be diligent in the way that we deploy our capital.\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah, I just -- I would say, we feel really good about our position. We've been very patient. And I think that patience has really sort of been very positive in this environment as we're continuing to see more and more opportunities out there of, in some cases, high-quality companies trading at prices that are sort of a fraction of what they were earlier this year.\n\nDevin Ryan -- JMP Securities -- Analyst\n\nYup. OK. Great. Just a quick follow-up here, another kind of product-centric, but you talked a little bit about some of the enhancements to the gold offering and good to hear about some of the momentum there.\n\nThe higher interest rate seems like you can add tangible value to that offering. So I guess, is the cash that you're seeing coming into that, is that from just existing customers seeing the value? Or is that actually driving new customer growth there? And then bigger picture around gold, what are some of the other areas that you're maybe seeing opportunities where you could enhance the gold value add?\n\nJason Warnick -- Chief Financial Officer\n\nYeah, I'll take the first part, for sure. So we're seeing a really nice uptick in deposits in the gold sweep accounts. And we're finding that the majority is from new deposits with the rest largely coming from upgrades to gold. So really exciting for us.\n\nIt's encouraging to see the overall balance of our interest-earning assets increasing and that's even with some offsets with strong net buying into this market by our customers. In terms of gold enhancements, I'll comment, but glad you can weigh in. I think that there's a lot of opportunities across the products that we offer today to make gold really appealing. Essentially, we'd like to have gold be the best deal in financial services.\n\nAnd I think whether you look at the cash card or crypto and other areas of our business, there's opportunity for us to invest here. stepping back, gold was a product a couple of years ago that we added a number of features to. We saw a lot of interest by customers at the time to join gold. But frankly, over the last couple of years, we've had other priorities as we dealt with the super high growth that our business was experiencing.\n\nAnd we're changing that. We increased the sweep balance rate for gold members to 3%. We're going to take it even higher, and we're encouraged to find other ways to add to that value proposition.\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah, the only thing I would add is that gold started out as a product intended for active customers primarily with value props like margin trading and higher instant deposits as well as Level 2 market data and sort of more advanced data. And the competitive interest on uninvested cash is kind of the first foray into making the product useful to people that aren't active investors. And I think as you see us continue to diversify our product suite and enter into other products. We're asking our teams to really keep in mind what what value we can make so that gold customers do get the best deal in financial services.\n\nAnd so gold is kind of becoming a little bit more of our planning process as we roll out these new products. I think we see lots of opportunities where customers can get an even better deal or kind of transition their usage of Robinhood into more of like an all-you-can-eat model and get more simplicity from how they use their product.\n\nOperator\n\nThank you. Our next question comes from the line of Richard Repetto from Piper Sandler. Your line is now open.\n\nRich Repetto -- Piper Sandler -- Analyst\n\nYeah. Good evening. Hey, Vlad and hey, Jason and team. \n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nHey, Rich.\n\nRich Repetto -- Piper Sandler -- Analyst\n\nSo my question is on the stock-based comp. I guess it's mainly for Jason, but you significantly outperformed in -- I guess, in 3Q, you lowered your target by, I think, almost 20% by -- if you look at the midpoint of stock-based comp by $135 million. So I'm just trying to understand was the reversal bigger than expected? Or has there been any change -- and you do have stock-based comp going up a little bit in 4Q, but has there been any change in strategy or culture in regards to the stock-based comp? What sort of drove this whole performance, I guess?\n\nJason Warnick -- Chief Financial Officer\n\nYeah, I think there's a few things that go into share-based compensation. First is just the effect of awards that have been historically granted I made comments last quarter that about half of our share-based compensation last quarter was from the pre-IPO awards that were granted to founders that are significantly out of the money. You mentioned the workforce reduction that has an impact, but also just lower rate of hiring. When you -- when we've historically given share-based awards to new employees.\n\nThose are four-year awards historically, and that can be very expensive as you're ramping up your workforce. And so slowing that way down has had a positive effect. And then I would say that given what's happened in the stock market, we also look kind of offsetting that. We also look to make sure that we continue to retain our top talent.\n\nAnd so additional awards were necessary here in the back part of the year, which helps bridge why it's going up on a net basis, net of the reversals in Q3.\n\nRich Repetto -- Piper Sandler -- Analyst\n\nGot it. That's very helpful. And then, Vlad, I guess I'm trying to tie a lot of things together here. Revenue looks like let's just assume trading is at a sort of trough level or a level that shouldn't change too much.\n\nYou get NII come up, so you got more revenue coming you brought your expenses done. Now your positive adjusted EBITDA. And I guess the question is, with cash is strong with this? And -- do you -- what's the new adjusted EBITDA? You passed the breakeven point a quarter early, but what's the target going forward? Do you try to build cash? Or do you sort of get back into the investment mode a bit more to grow expenses? Or how are you viewing your adjusted EBITDA targets going forward?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah, maybe Jason can take this one, Rich, and I can add some color if needed.\n\nJason Warnick -- Chief Financial Officer\n\nYeah, sounds good. Rich, I think we like our opex position now. And like I said earlier to Josh's question, we're going to have a mindset of being lean and scrappy as we grow from here. But that doesn't mean that we're not going to make thoughtful investments and deliberate investments to drive to drive growth.\n\nWe're in the middle right now of our 2023 planning. So I'm just not in a position to kind of talk about expense guidance for next year. But it's not a fun experience to bring down the costs the way that we've done. And so as we go forward, we're going to be very mindful to be deliberate in the way that we increase costs going forward.\n\nBut there's a lot of opportunity ahead of us. We'll make appropriate investments from here.\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah. And I would just say that the balance we aim to strike at kind of the beginning of the year when we set the adjusted EBITDA positive goal was to get our cost structure in a good place and to demonstrate that we can be a sustainable business in tough economic times. And then we actually know that we can do quite well when economic times and monetary policy is a little bit looser. And I think we're proud of the progress there.\n\nAnd we wanted to do that while also taking advantage of the environment where a lot of other companies are pulling back to accelerate our own momentum. So as you've kind of seen, we've continued to improve the product offering dramatically. We've rolled out new products this year. And so we're happy about the balance and we're going to continue to invest to drive customer growth and revenues and shareholder value in the future.\n\nOperator\n\nThank you. Our next question comes from the line of Steven Chubak from Wolfe Research. Your line is now open.\n\nSteven Chubak -- Wolfe Research -- Analyst\n\nHi. Good afternoon. So Jason, you're going to have to bear with me. This is going to be a mouthful, but I really do want to spend some time unpacking the NII guidance that you offered up just recognizing that the revenue upside from higher rates really shined through this quarter.\n\nIt just makes the NII guidance a little bit tough to reconcile, feedback from others suggest I'm not alone. And I was just hoping to unpack some of the component pieces, recognizing earning assets per your earlier comments are actually trending higher in 4Q, even with the more competitive sweep offering, still, it's only a small proportion, less than 25% of your earning assets that have any sort of deposit beta attached. And the average Fed funds is going to be up north of 125 bps in 4Q just based on the hikes that have transpired thus far. So just trying to reconcile all those component pieces with the $25 million sequential increase, which just feels quite light?\n\nJason Warnick -- Chief Financial Officer\n\nYeah, I appreciate the question. And what I can tell you is that you start with roughly $16 billion, $17 billion of interest earning assets. Included in there is our margin book, and we've seen that come down a bit in October to below $4 billion. And so we're factoring in the variability of that as we think about guidance for the rest of this quarter.\n\nAdditionally, in October, securities lending has been pretty soft. And so we're being pretty cautious there as well as we think about how the rest of the quarter will play out. And then, of course, with the Fed rate increase, while we'll enjoy increased rates on a large portion of our interest-earning assets, as you mentioned, we also intend to pass some value back to customers in the gold sweep product. So those are kind of the moving parts, and we think $25 million incremental.\n\nFirst of all, we're really pleased that it's growing and that overall net interest earning assets are growing as well.\n\nSteven Chubak -- Wolfe Research -- Analyst\n\nThat's great. And just for my follow-up on the sec lending piece. You actually saw a really nice uptick in tech lending revenues, especially in light of what was a very challenging environment. based on what we've seen from others.\n\nNow that we're a few quarters into the fully paid sec lending program, I was hoping you could provide some sort of update on how you're thinking about sizing that future revenue opportunity confidence around your ability to deepen penetration with your existing client base?\n\nJason Warnick -- Chief Financial Officer\n\nYeah. So we continue to be really optimistic about the fully paid securities offering. We had $4 million of revenue this -- in Q3 from fully paid securities lending. And that's after just a handful of months of launching that product.\n\nWe're already at 15% of the revenue that we're generating from margin sec lending, which has been around for several years. So it's still very early. It is a difficult market out there and it's evolving. But we have a lot of optimism that this could be a meaningful portion of our securities lending revenue over time.\n\nOperator\n\nPerfect. Getting the next person available. Our next question comes from Michael Cyprys from Morgan Stanley. Go ahead, Michael.\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Good afternoon. Just a question on the adjusted EBITDA margin in the quarter, 13%.\n\nJust curious how you think about that going forward from here. Is this low-teens margin profile sustainable? And how do you think about what the right margin profile is for Robinhood longer term?\n\nJason Warnick -- Chief Financial Officer\n\nYeah, it's Jason. I'll take that one. Looking over the long term, I don't see any structural reason why we wouldn't have margins that are kind of in line with what you see at others in the industry. It's going to vary depending on the period and as we roll out new products and how that affects our mix of business.\n\nBut we'll manage our costs, we'll build for the future with new products. And over the long term, we think will drive pretty attractive margins for shareholders.\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nAnd then can you -- as a follow-up question, can you talk a little bit about customer acquisition costs, how your approach has been evolving? Maybe you can help quantify how much it's been costing and how you're thinking about allocating your budget there?\n\nJason Warnick -- Chief Financial Officer\n\nYeah, so we're increasing our spending in marketing in Q4. You might have seen us with some television ads that have recently started and we tried to signal that last quarter that we begin doing that. Historically, the vast majority of our customers have come to us through referrals and word of mouth. And that's driven really attractive tax and returns, and digital paid ads has also been an area that we focused on for marketing.\n\nWhat we found in periods of relative high interest in investing that it really pays to kind of lean in to paid advertising. But in periods like we're in right now of lower interest in investing, we haven't found it to really make economic sense to lean in and spend more for growth. And so we've been cautious there, and it's something that we're going to watch carefully. But in the near term, what we're doing is really focusing on some brand-building advertising.\n\nAnd if you haven't seen it, check out our advertisements, we really like them.\n\nOperator\n\nThank you. Our next question comes from the line of Craig Siegenthaler from Bank of America. Go ahead, Craig.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nThank you. My first one is on the Web 3 digital wallet launch. Sorry if I missed it, but when are you going to open up to more than the initial 10,000 on the wait list? And also, I think you characterized the waitlist as one million plus. Is it significantly larger than one million?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nI think the number is actually public. So if you go to robinhood3.com, you should be able to get the real-time wait list figure. So yes, as I mentioned, we've rolled it out to 10,000. We're watching the feedback closely.\n\nWe're going to be rolling out to more in the coming months. And we're getting some really, really good feedback from customers. We can tell that they really like the no gas fees. They like the user interface and the experience and they're giving us useful feedback on multi-chain and other things.\n\nSo we're not in a hurry. We could roll it out faster if we wanted to, but we want to make sure that the product improves, it is really, really good when it's generally available. And we expect that to to happen early next year.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nAnd then just as my follow-up, another one on the digital wallet. I'm curious what capabilities you're going to be offering for NFTs both in terms of viewing NFTs and connecting to NFT marketplaces? And do you see this as a potential big differentiator for your crypto offer?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nWe have been hearing from some of our crypto enthusiasts that they want at the very least to be able to view their NFTs in wallet. I think trading NFTs in app is a little bit complicated with the recent Apple guidance. So we're keeping an eye on that. But I think it's highly likely that we'll add the ability to view NFTs and for people to custody them.\n\nOperator\n\nPerfect. And our final question comes from the line of Benjamin Budish. Benjamin, your line is now open.\n\nBen Budish -- Barclays -- Analyst\n\nHi. Thanks for taking my questions. I kind of wanted to ask another follow-up on the digital wallet. I know you guys aren't giving any kind of forward guidance in terms of opex for next year.\n\nBut can you maybe talk a little bit about the investment required to take that product internationally?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah. I mean, the great thing about the Robinhood Wallet is, we've got a very lean team working on it. Of course, there's the requisite kind of compliance and infrastructure you need, but it's essentially a software product. And so the nature of it being noncustodial and blockchain-based means that it's kind of international by default.\n\nAnd the experience is simple and very straightforward and kind of really targeted toward the value prop of great UX and gasless swapping of tokens. And so we've kind of built it with the idea of being international native from the beginning, which I think makes it much more straightforward.\n\nBen Budish -- Barclays -- Analyst\n\nGreat. And maybe I'll kind of follow up just on the same topic. In terms of eventually launching a stock trading or options trading or anything else internationally. Do you think there's a lot of that investment is applicable in terms of what you have to do for -- to comply with KYC and AML regulations and the like? Is there a lot that will translate directly or is that going to be a separate sort of compliance and infrastructure build-out?\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah, I think for the custody solution and the brokerage, so custodial crypto and brokerage, it's a little bit different. But certainly, there's value that we'll get from rolling out the noncustodial wallet internationally and from creating kind of a more simple and focused staff because it's very likely that in some jurisdictions, we'll be crypto first and others will be brokerage first. But we're not going to be able to -- we're unlikely to make all of the Robinhood U.S. features available in every jurisdiction, at least on the outset.\n\nJason Warnick -- Chief Financial Officer\n\nBefore we end the call, I just want to finish by saying that we've made the decision to take our gold sweep interest rate to 3.75%. So we think that's just absolutely tremendous for customers, and we're excited to deliver that to them.\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nYeah, I think that's a great value in this environment. That's a hard rate to beat.\n\nOperator\n\nPerfect. Well, I would like to thank you, everyone, for your questions. I would like to turn it back now to Vlad for closing remarks.\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nWell, thank you, everyone, for joining. As always, we've appreciated the questions. Congrats to the team again for a strong quarter and delivering adjusted EBITDA profitability a quarter ahead of schedule, and we're getting back to work. There's a lot more to do to deliver on democratizing finance for all.\n\nSo thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Koegel -- Vice President, Investor Relations\n\nVlad Tenev -- Chief Executive Officer and Co-Founder\n\nJason Warnick -- Chief Financial Officer\n\nJosh Beck -- KBCM -- Analyst\n\nDevin Ryan -- JMP Securities -- Analyst\n\nRich Repetto -- Piper Sandler -- Analyst\n\nSteven Chubak -- Wolfe Research -- Analyst\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nBen Budish -- Barclays -- Analyst\n\nMore HOOD analysis\n\nAll earnings call transcripts"
}