{
  "companyName": "Amyris",
  "companyTicker": "AMRS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/amyris-amrs-q2-2022-earnings-call-transcript/",
  "content": "Amyris (AMRS -1.29%)\nQ2 2022 Earnings Call\nAug 09, 2022, 9:00 a.m. ET\n\nOperator\n\nWelcome to Amyris' second quarter 2022 financial results conference call. This call is being webcast live on the events page of the investor section of the Amyris' website at amyris.com. As a reminder, today's this call is being recorded. You may listen to a webcast replay of this call by going to the investor section of Amyris' website.\n\nI will now like to turn the call over to Han Kieftenbeld, the chief financial officer of Amyris. Please, go ahead.\n\nHan Kieftenbeld -- Chief Financial Officer\n\nThank you, Maria, and good morning, everyone. Thank you for joining us today. With me on today's call are John Melo, president and chief executive officer; and also Eduardo Alvarez, chief operating officer to support our Q&A session today. We issued our results in a press release this morning.\n\nThe current report on Form 8-K furnished with respect to our press release is available on our website, amyris.com in the investors' section, as well as on the SEC's website. The slides accompanying this presentation can also be found on the website and were posted today for your convenience. Please turn to Slide 2. Please note that on this call you will hear discussions of non-GAAP financial measures, including but not limited to underlying sales, revenue, gross margin, cash, operating expense, and adjusted EBITDA.\n\nReconciliations of these non-GAAP measures to the most directly comparable GAAP financial measures are contained in the financial summary section slides of the presentation or the press release distributed earlier today. During this call, we will make forward-looking statements about future events and circumstances, including Amyris' outlook for 2022 and beyond, Amyris' goals, and strategic priorities, anticipated transactions, and other future milestones, as well as market opportunities and growth prospects. These statements are based on management's current expectations and actual results, and future events may differ materially due to risks and uncertainties, including those detailed from time to time in our filings with the Securities and Exchange Commission, including our 10-Q for the second quarter of 2022. Amyris disclaims any obligation to update the information contained in these forward-looking statements, whether as a result of new information, future events or otherwise.\n\nI'll now turn the call over to John. John?\n\nJohn Melo -- President and Chief Executive Officer\n\nThank you, Han, and good morning, everyone. Thank you for joining us today. I'll provide an update on our business performance and our path forward over the next six quarters, before asking Han to provide a detailed update on our financial performance, our cost reduction initiatives, and our funding outlook. I will summarize, and then we will turn to Q&A, joined by Eduardo Alvarez today.\n\nSlide 4. Our second quarter was another solid quarter of core revenue growth and operational execution. We delivered on our business objectives and completed our heavy investment phase, as we previously communicated. Our revenue and gross margin were in line with our expectations.\n\nOur costs were higher than we originally anticipated, as we decided to make the necessary investments to build inventory, and accelerate the brand development of a much larger than anticipated expansion with Walmart in North America. Our consumer business delivered 108% growth in the second quarter over the same period in 2021 and has grown 113% during the first half compared to the same period last year. Our gross margin was in line at just under 60%, and we are very focused on moving the consumer brands to profitable operating contributions by the end of this year. Our technology access revenue has also continued strong growth driven by our industry leadership and the production of clean sustainable chemistry.\n\nOur ingredients demand has outpaced our capacity. We sold all that we could produce during the first half and are entering the second half with an estimated $15 million of backlog orders for ingredients, in addition to the contracted demand for the rest of the year. This backlog has started shipping in the third quarter as we benefit from the added capacity and the lower production cost of our new state-of-the-art bio-fermentation factory in Barra Bonita, Brazil, now producing and shipping products. Gross margins for the quarter continued in line with our expectations for the first half.\n\nIn the second half of the year, we expect gross margin expansion underpinned by Barra Bonita production, the transition of approximately 70% of our consumer products from third-party contract manufacturers into our own production. And a reduction in packaging costs, and also much reducing China sourced components, which have resulted in significant airfreight charges during the first half. We invested approximately $140 million in strategic and structural investments during the first half of this year. This included $55 million in capex for Barra Bonita, $25 million in cash for two consumer manufacturing plants, and supply chain infrastructure, and $45 million in working capital to build six months of extra inventory to avoid supply chain-related out-of-stock issues for our retailers, and $15 million in expense to build and launch three new brands in the third and fourth quarter of this year.\n\nTo sum up the second quarter, we delivered strong operational performance. We started our Barra Bonita bio-fermentation plant, as previously communicated. We closed two acquisitions, including a new consumer production facility in Brazil, that's scheduled to start production this month. And we shipped consumer products from Reno, we started the process of transitioning to lower-cost fulfillment, and are also moving components sourcing for consumer products from China to Brazil, where we can deliver a lower cost and more resilient supply chain to support our growth.\n\nWe also made significant progress with the set up of infrastructure for our expansion into Europe. Our heavy investment phase is complete, we are now executing significant cost reductions that are enabled by the investments we made, along with the scale we've now achieved in our consumer business. We will start to see these benefits from these actions flow through our financials in the third quarter with a fuller impact during the fourth quarter. We understand that in addition to building a great business, we also need to do a much better job managing expectations with the financial community.\n\nWe are delivering on our internal plans and need to also deliver on market expectations and analyst models. A year ago our consumer business was 49% of our revenue and now it is 66%. Our consumer business delivers over one-third of the year's revenue during the holiday season. This type of seasonality, along with the additions we are making to the portfolio and the changes to our cost structure, make our business very challenging to model accurately.\n\nWe will add more explicit quarterly guidance, in addition to our annual outlook to avoid some of the disconnects we experienced in recent quarters, we have no need to disappoint and we will fix this. Han will cover in more detail our financial performance outlook and our specific cost reduction initiatives to enhance our financial performance. I'd like to transition to our plan and strategy for the next six quarters and our long-term outlook. Let me start with our consumer business.\n\nI'm now on Slide 5. We have built the fastest growing consumer business and health, beauty, and wellness with a strong portfolio of brands that each is leading in their respective categories. This business is expected to deliver $250 million in 2022 revenue. Based on our current performance and quarterly growth rate, we expect to deliver core revenue of around $250 million in the fourth quarter of 2023.\n\nOr think of it as a $1 billion annualized revenue run rate by the fourth quarter of 2023. We expect this core revenue to operate with a gross margin in the 60% range, a more than 10% improvement versus 2022. This includes our core cost initiatives and current portfolio and channel mix. At this level of revenue, we would expect around a 20% operating profit margin in 2023, increasing to around 30% operating margin by the end of 2024.\n\nOur consumer business sells one product every two seconds. We added over 3 million customers in the first half alone and have some of the best performing SKUs in the categories and markets we participate in. For example, our Biossance serum was the best-selling serum on Tmall in China during the month of April and our Biossance Vitamin C Rose Oil is one of the best-selling Vitamin C skincare products in North America. Our strategy with our consumer portfolio is simple, create brands that can achieve a $1 billion market valuation in categories like skin care, hair care, color cosmetics, and menopause, where we can deliver the best performing products in the category at an accessible price, and select partners that have access to a unique community so that we can grow awareness and revenue most efficiently.\n\nWe need to control our destiny to build a truly great company that delivers real products that consumers want and need. And to make the full impact on our planet, that synthetic biology is truly capable of. As an example of our leadership in building clean consumer brands, we have just completed an agreement with David Beckham to develop a leading men's clean skin, hair, and wellness brand. David is a great addition to our current portfolio with over 75 million Instagram followers globally and a real passion for sustainability.\n\nWe expect to have this brand in the market at the end of 2023. Our current consumer portfolio has an estimated market-based valuation of over $2.5 billion dollars. Our homegrown brands like Biossance, Pipette, JVN, Rose Inc, and Purecane deliver over 75% of our consumer revenue. Our acquisitions have also done well.\n\nAs an example, Costa Brazil is growing over 300% this year. And MenoLabs is delivering over 200% growth this year at the highest gross margin of any brand in our portfolio. We are constantly making resource allocations and we will not invest in brands that don't perform. Long term, we expect our portfolio to be about 12 brands in categories where we can win and sell through an omnichannel strategy with our direct-to-consumer leading and revenue contribution in our retail partners led by the leading retailers in the world in their respective geographies.\n\nSlide 6. Building and operating the best-performing consumer brands has enabled us access to the world's leading retailers. We are in process of significantly expanding our relationship with Walmart as an example. We now have Pipette in over 4,000 Walmart stores.\n\nWe are expanding rapidly in Walmart with Purecane and will launch for 4U by TMRE later this year. The 4U brand is a great example of collaboration. We are building a brand for Walmart to meet a critical need of delivering the best performing products that are sustainably sourced for their consumer. This is the start of a relationship that has the potential to be one-third of our North American revenue in 2023 and beyond.\n\nLast week, Walmart was the leading retailer in our portfolio in terms of top units sold for a single brand. We sold 37,121 units of OLIKA across Walmart alone during last week. The best external comparison for our consumer business is the Unilever Prestige business, what we can conclude from public data is that we are executing on a consumer business that has a like financial profile to theirs. We are doing this one-third faster than they did and for 90% less capital.\n\nOur brands are delivering stronger growth they perform cleaner and better products and are delivering better loyalty. They have about 12 brands in this portfolio and started building this business in 2014 and they reached $1 billion and revenue in 2021. We started in 2016 and expect to reach $1 billion in run rate for the fourth quarter of 2023. We are growing at a faster rate, spending significantly less for our growth, and delivering a similar financial profile faster, better, and cheaper.\n\nThis is what our Lab-to-Market technology has enabled us to achieve with the consumer. Slide 7. Let me now turn to technology access and our ingredients business. In the first half, we did not have enough manufacturing capacity to meet demand.\n\nWe have over $15 million of demand backlog that will start shipping during the third quarter because of the successful Barra Bonita start-up. We are the world's lowest-cost producer of sustainably sourced natural ingredients. Our ingredients are typically contracted for the next 10 years and we will run Barra Bonita at full production capacity for the foreseeable future. Barra Bonita started Vanillin production in June and has delivered our best Vanillin fermentation performance to date.\n\nWe just recently started production of our second molecule at Barra Bonita. This is our 14th molecule to reach an industrial scale. A confidential molecule that is another breakthrough for the fragrance industry. This production has also started well.\n\nBoth of these are demonstrating the excellent performance of our team at Barra Bonita and the real breakthrough in manufacturing technology that we have designed, built, and are now operating. This year alone, we are scaling more new ingredients than any other company in our sector has scaled in their entire history. The competitive comparison is simple, we develop and produce molecules while the rest of the sector is making organisms. Organisms are a catalyst on the path to making what consumers and customers really want and need, that's molecules.\n\nThat's why we generate more revenue industry-leading growth and stronger margins than most in our sector. We are strategically advantaged with our business model and the value we capture from the value chain. You can see this in our core revenue in the second half as we start really meeting demand with Barra Bonita. You can also see this in the value, we've demonstrated, we can get from providing marketing rights to our molecules.\n\nLast year we generated $50 million to $100 million in value for each molecule, we provided long-term marketing rights for with our strategic transactions. This year you'll see this value significantly increase as we sell marketing rights to two molecules to two more of our molecules. We are scaling and commercializing three to five molecules annually and have a pipeline of over 25 in active development. We are delivering what the world needs, sustainable chemistry for a healthier planet.\n\nIn these transactions, we remain the manufacturer and continue to generate a long-term revenue and margin stream from these products and their underlying technology. This is the royalty built into our technology. This royalty alone is more valuable we see any competitor generating from their small slice of many programs for organisms business model. Let me now end with our second-half financial actions and sources of capital.\n\nSlide 8. We are leaders in synthetic biology delivering molecules that are making the world healthier for all. We have the best-performing consumer brand portfolio in clean health, beauty, and wellness markets. We have a clear path to a business that delivers $1 billion in run-rate revenue by the fourth quarter of 2023, based on the continued successful execution of our strategy.\n\nWe are committed and confident in non-equity funding to ensure, we achieve the full value of our technology platform and realize the future of the business we have built. We are executing on and have visibility to over $700 million of non-equity funding and cash inflow from earnout. To continue executing our growth strategy. We have term sheets for up to $250 million of term loan financing.\n\nWe expect to close this before the end of this quarter. We have made very good progress on the strategic transaction to sell marketing rights to two of our molecules. We expect to close this transaction before the end of this year and the transaction is expected to result in about $350 million of upfront cash and around $400 million of total value. In addition to these two sources of capital, we expect over 230 million in earn outs from the strategic transactions we completed in Q1 and Q2 of last year.\n\nWe are working through advancing some of this earnout into this year with the remainder becoming available annually over the three-year earnout period. We are fortunate to be performing on the high end of the earnout calculation based on the demand for our clean, sustainable molecules. In addition to non-equity funding for our continued execution, we are also executing on a significant cost and efficiency agenda. The successful start-up of Barra Bonita and the investments we made in supply chain and manufacturing assets earlier this year have enabled us to execute several actions that significantly reduce our cost base going forward, these are our fit-to-win actions.\n\nThese actions are expected to deliver $50 million of adjusted EBITDA improvement in the second half of this year, and $175 million of full year adjusted EBITDA on improvements for next year. These include price increases, a significant reduction in COGS, and a significant reduction in our SG&A without impacting our consumer growth. Han will cover the fit-to-win agenda in more detail. Eduardo Alvarez is leading a major part of our fit-to-win activities and is with us this morning for the Q&A session.\n\nLet me summarize and transition to Han. We are focused on three priorities, delivering industry-leading growth and maintaining market leadership for our technology, delivering cost improvements to realize the full benefit of our scale and consumer brand leadership, and funding our business near-term with non-equity sources of capital. Our guidance for the year remains unchanged with we expect to deliver over 150% growth year on year of our consumer business and around 40% growth in our technology access activity. The combination of our fit-to-win agenda and our continued business performance should result in a clear path to positive adjusted EBITDA in 2023.\n\nOur second half has started strong with July delivering our best consumer sales performance to date this year. We have great traction on our cost actions and clear visibility on our funding. Han will now provide a review of our financial performance and additional detail around our transformation agenda and what you can expect. Han?\n\nHan Kieftenbeld -- Chief Financial Officer\n\nThank you, John. Please turn to Slide 9. This morning, I will be covering three topics as follows. Firstly, I will discuss our Q2 financial results as it relates to revenue, gross profit, operating expense, and cash.\n\nSecondly, I will describe five new business actions that John mentioned, that we are undertaking to much improve our financial performance, we refer to these as fit-to-win. And thirdly, reiterate our outlook for the year. I will use most of my time to focus on discussing and connecting items one and two. Let me start with revenue.\n\nThis is Slide 10. As John described, our second quarter was another solid quarter of core revenue growth and a new record in consumer growth. Core revenue, which includes consumer and technology access revenue and excludes strategic transactions and other one-off items increased 54% to $65.2 million when compared to Q2 of 2021. Core revenue included record consumer revenue of $43 million, which increased 108%, and technology access revenue of $22.2 million, which increased 3% versus the prior year.\n\nWe have now completed 14 consecutive quarters of revenue growth with our consumer business, principally from organic growth. Also, we are significantly outperforming the beauty and personal care sector, with the peer group growing anywhere between 2% and 26%. In Q2, the first of the same quarter of last year, again, we grew 108% and 31% on a like-for-like basis. Technology access revenue growth of 3% was due to technology license revenue from the F&F earnout, partially offset by lower Squalene and Hemisqualene revenue due to capacity constraints that we have previously discussed.\n\nA major milestone in unlocking our ability to increase technology access growth rates was achieved during the quarter as our plant in Barra Bonita was commissioned. Barra Bonita will help to address the supply constraints we have experienced and also address most of the negative margin impact we have seen from sourcing products from third-party manufacturing. The growth in consumers is meaningful and is now two-thirds of our core revenue, this was just one-third at the end of 2019. The creation of demand is coming from more brands, new formulations, more stores, and doors, and finally, international expansion.\n\nWe need to make sure we can meet the demand with the improvements we are making in our supply chain and also deliver with much better unit cost economics, which brings me to my second item, which is gross margin. We are on Slide 11. At Amyris, we have historically talked about non-GAAP gross margin measure, which includes direct product COGS, but not all aspects of making and delivering the products such as certain freight charges. It is also a measure that you can more easily correlate to GAAP financials.\n\nWe plan to move to gross profit in the New Year so we can align our disclosures all at the same time. Non-GAAP core gross margin of $28.4 million or 44% of revenue increased from $16.5 million or 39% of revenue in Q2 of 2021. The increase in gross margin in the second quarter of this year reflects a year-over-year increase in technology license revenue, which was partially offset by a lower average consumer gross margin due to brand portfolio and channel mix. Also higher ingredient input costs due to unfavorable contract manufacturing economics and lower R&D collaboration revenue.\n\nAdditional impacts not shown here but are of note given that the impact profitability is the significant increase in freight and logistics. Due to higher rates and increased air freight to support three new brands and build six months of safety stock to address external supply chain challenges, those were the three important factors. The direct cost of goods sold grew by about $11 million and freight by about $12 million, of which $8 million was airfreight. A significant portion of the cost increase can be attributed to operating and growing at pace, and also the challenge of supply chain cost by COVID.\n\nThe takeaway regarding gross profit is that we made strategic investments in our manufacturing and supply chain footprint, both on the consumer and ingredient side. Now is the time for us to recalibrate our cost base. I'll quantify those opportunities when I address our fit-to-win initiative, this brings me to my next topic, which is operating expenses, we're on Slide 12. We're operating eight brands today and anticipate three launches in the second half of 2022 compared to four brands a year ago.\n\nTo support top-line growth, we have significant investments as a result of which our cash operating expense has grown as well to about $136 million, an increase of $74 million versus the prior-year quarter. These increases were driven by a new few significant factors. The increases were principally related to selling expense and driven by a combination of increased headcount, both organic and from acquisitions. Significant investments in both existing and developing brands for paid media and advertising, expanded retail and e-commerce sales in the US and internationally, growth-driven consumer order fulfillment, and shipping expense.\n\nAnd lastly, comparatively low prior year travel expense due to COVID 19. Shipping and handling or pick-pack and ship, as John calls it, increased by 6 million for the same quarter of last year due to significant growth in DTC orders. The fourth and last item here I wanted to discuss is cash. As a result of our elevated expansion, our use of cash in the quarter was also elevated, principally due to investments in brand marketing of both new and existing brands.\n\nAdditionally, we deployed significant cash for the construction of Barra Bonita, this was $33 million in the quarter that we self-funded. We used $186 million, of which $125 million was related to EBITDA. We funded inventory for consumer goods, both in terms of packaging and finished material, which was partially offset by a decrease in ingredient inventory and increased payables. Capex continued to be a significant component because of the construction of the Barra Bonita plant, as I just mentioned.\n\nWe completed the interfaces, which is the Brazil consumer facility, and the beauty, which is retail and treatment acquisitions. The combined total of capex and M&A investment was $43 million in the quarter. As John indicated, the use of cash in the first half has been significant and we plan to address it with clearly defined actions. So let me now turn to fit-to-win, Slide 13.\n\nWe have taken a number of actions that logically correlate to the items that I've highlighted as part of the quarterly financial results. Fit-to-win consists of five initiatives that are positioned to provide focused execution and acceleration in areas most material to our cost base, margins, and EBITDA because of our portfolio and our scale, we find ourselves at this important point in time to leverage what we have built for a much better cost structure and cash conversion cycle. Number one, price increases. We expect this to deliver $10 million in the second half and just over $30 million in the full year of 2023.\n\nWe have already increased prices on some of our ingredients and these will have full effect in Q3 and Q4. Additionally, we will raise prices in our consumer portfolio. Number two, marketing cost reductions. We look to capture the benefits of our growing economies of scale in our support model, $21 million in the second half and $65 million for the full year '23, and beyond.\n\nWe have identified substantial opportunities to reduce all the marketing spending as a result of the rapidly changing digital media landscape and through portfolio leverage. Number three, COGS reduction for our ingredients. This means that we will leverage Barra Bonita's precision fermentation capability to reduce production and shipping costs by $10 million in the second half, and $30 million for full year '23. Number four, COGS reduction in consumers.\n\nSimplify and drive scale across our consumer brands and cost structure. Consolidated production of a large part of the portfolio at our two plants, simplified components, and packaging. This will have an effect of $5 million in the second half and $30 million on an annualized basis in 2023. Fifth and last, shipping and fulfillment.\n\nOptimize our footprint for distribution, lower cost for pick-pack and ship. We expect $4 million in the second half of this year and $15 million full year in 2023. Again, this is predominantly a cost for our consumer business and DTC direct-to-consumer in particular. As John mentioned, together these initiatives, when compared to the first half, are expected to deliver $50 million of adjusted EBITDA to the second half.\n\nIn addition to the cost-benefit, these changes will also result in a much more robust supply chain to avoid some of the costly issues we have dealt with during the first half of this year. During the first half, we developed a strong foundation through significant investments in our manufacturing and supply chain footprint, the scale we achieve with our consumer portfolio, and the performance of our brands with consumers. This is a foundation which now allows us to accelerate these improvements that I just described. Moving to Slide 14 on the outlook.\n\nRegarding revenue, we are reiterating our full year core revenue. Consumer revenue is expected to grow more than 50% year over year and technology access is estimated to grow around 40% versus the prior year. Finally, regarding capital funding, as John mentioned, we have visibility on $700 million of which we expect to secure $200 million in non-equity financing in Q3, $350 million from a strategic transaction expected by end of Q4, and the remainder from earnout no later than the early part of 2023. Thank you all for listening today.\n\nJohn has concluding remarks before we open the line for questions. John?\n\nJohn Melo -- President and Chief Executive Officer\n\nGreat, Han. Thank you. We have built the leading consumer brand portfolio and we are delivering the best growth in consumer health, beauty, and wellness markets. We have the brands, consumers, and retailers want, and the products the world needs for all of us and our planet to be healthier.\n\nWe have the assets and are executing on a clear path to a $1 billion revenue business that delivers a 20%, or better operating margin by the end of 2023. We're achieving market leadership and we know, we can do better and will do better. And we appreciate your support. With that, let's turn to Q&A.\n\nMaria, can you help us move to Q&A?\n\nOperator\n\nThank you. [Operator instructions] We ask that you please limit yourself to one question and one follow-up. At this time, we will pause momentarily to assemble our roster. Our first question comes from Colin Rusch with Oppenheimer.\n\nPlease, go ahead.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThanks so much. Thanks so much, guys. Having gone through these sorts of cash cycles with you guys a couple of times in the past and noting that you've had visibility of these sorts of transactions, can you give us just a little bit more detail on this $200 million in 3Q here, in terms of the maturity of those conversations, your ability to close quickly? And how much variability there is around the actual number?\n\nJohn Melo -- President and Chief Executive Officer\n\nColin, thank you. I'll provide a quick update and then Han can jump in. The conversation is well along. We have term sheets, one of which is fully executed.\n\nWe are deep in the process and we've agreed on a timeline to close, and we don't see anything right now that would get in the way of that. So our confidence level is very high. And like you can imagine as a company, we're not going to sit and take risks and not have something happen. So we also have complete access to shareholder, key shareholder financing if necessary.\n\nSo we're well positioned and again, very focused on just executing our plan. And really delivering on the fit-to-win agenda, which we think gets our cost structure and one of the most advantaged places for the kind of assets we're currently performing with. Han, would you like to add anything else to that?\n\nHan Kieftenbeld -- Chief Financial Officer\n\nNo, I think that's right. We both said we had visibility and we are pretty confident that we can execute on this in the third quarter, so.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nOK. That's super helpful. Then on the product side, obviously, you guys have ramped into sugar and you've seen some substantial diversity of these end products. But I guess in terms of mix and channel, can you give us just a better sense of how the revenue is broken down by category within the consumer space, and some of the leading channels? I know you offered some details on Walmart here, but I just want to get a sense of the resiliency of that revenue growth across segments as we go forward.\n\nJohn Melo -- President and Chief Executive Officer\n\nLet me, first maybe start with a channel conversation, Colin. And I'd say our number one channel in absolute revenue is obviously our direct-to-consumer business and we see that continuing to be quite robust. I think the second single biggest channel we have currently is Sephora as a retail partner and we see the two workings very closely together. Consumers discover new brands at Sephora and then they build a long-term relationship with the brand assuming the product works.\n\nAnd we see that the relationship continues with purchasing and relationship management on our direct-to-consumer side. As a matter of fact, a little factoid that we don't talk about much, about half of our direct-to-consumer traffic is our customers who discover the brand ads, the four to begin with. We see our channel structure expanding and we see Walmart becoming a third leg, our DTC Sephora, and Walmart. And really for our more mass brands, as well as some of the specialty work that we're developing for Walmart in partnership with them.\n\nSo that's kind of how we see the channel structure evolving. And I think what you've seen this quarter really the last couple of quarters, which is about a 50/50 mix from a revenue generation, from our direct-to-consumer versus all other channels. And all other channels, whether they're online or offline, are about the same margin structure, right? I think currently we're probably most challenged in margin structure working in the China market, which is growing significantly for us. Last year we did about $2.5 million in China and this year we're forecast for about $15 million out of the Chinese market.\n\nSo significant growth there. Our Brazilian market is also growing significantly but really challenged in margins because of the fact that we import into Brazil most of the products we sell. That is changing as we speak, we're actually moving to our plants in Brazil to make in Brazil, and ship out of Brazil, which will be a significant shift to our margin structure, not only in Brazil but outside because of the lower cost of production we've been able to achieve in the Brazilian market. And then, we see a lot of international expansion, if you think about the UK market is really taking off for us in a very big way.\n\nI think we're just scratching the surface in the UK. We're going into Douglas in Germany, 130 stores in the month of August and September, actually, where the German launch of the Biossance brand. So just in general, really robust across geography, across retailers, and the balanced mix is really driven by our omnichannel strategy. When you think about categories, skincare today is obviously our biggest category.\n\nHaircare is growing very, very rapidly. I would not be surprised if by the end of next year haircare and skincare are equal in revenue contribution for us as a company. And then, excuse me, and then, what I would say, Colin, is there are some specialty areas like menopause. We like the menopause category a lot.\n\nWe think we have some unique insight. We think we have a great partner and we think we have some great science, especially with the new ingredient that we created specifically for women in menopause. So if you think about menopause this year, like last year was a category that didn't exist. This year we'll do about $25 million, in menopause.\n\nAnd then I would expect next year for us to do somewhere between $50 million and $75 million in menopause. So think about specialty categories third, and then kind of tied first and second, skin and hair as we end next year. I don't know if that helps or not, Colin.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nYep. That's exactly what I needed. Thanks so much, guys.\n\nJohn Melo -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Steven Mah with Cowen & Co. Please go ahead.\n\nSteven Mah -- Cowen and Company -- Analyst\n\nGreat. Hey, thanks for taking the questions. I've got a question on the consumer revenue guide, given Q2 was only about 108% growth to hit 150% plus growth in consumer for this year. So the second half assumes a pretty aggressive step up versus the first half.\n\nCould you provide a little bit of color on how you're maintaining your confidence around this guide?\n\nJohn Melo -- President and Chief Executive Officer\n\nYeah. I mean, and this is an important point, Steven, thank you for being on the call. We could see in a lot of the analysts' models that there isn't a lot of cadence in the quarterly revenue connected to what our actual business activity is. So and I think it's all around exactly the question you asked.\n\nOK, so there are two significant factors going into the second half. I mean, first of all, the fourth quarter on a like-for-like basis is about double what the third quarter is in consumer revenue. And that's been the case, just looking at our history and that's all driven by seasonality really around two or three days in the fourth quarter that drives the holiday season. I think the second factor, which is super important for us this year, we have three new brands that launched late in the third beginning of the fourth quarter, including a major shift-to-trade with Walmart in a brand we've developed for Walmart called for 4U by TMRE.\n\nThe three new brands alone generate over $20 million of revenue in the fourth quarter that did not exist at all and don't exist now in our portfolio. So think about it as three new brands, $20 million or more from the new brands, and then a 50% jump from third quarter to fourth quarter on the established space just based on holiday and seasonality. So when we think about the forecast we've given, we actually think about what the third and fourth quarters do historically, what our current traction is, and a layer of newness. The last point I'll say is something new this year is we have just finished significantly expanding our selling footprint inside of Sephora for the Jonathan Van Ness brand and for the Biossance brand.\n\nIf any of you have visited Sephora over the last week, you'll see us in front of the store, you'll see us with much bigger displays and all of that on the back of the productivity, we're delivering for Sephora in-store because of demand for our brands, So significantly greater selling footprint in our number one market in the world, North America, and then significant expansion geographically. We have Singles Day in China, which will be a huge day for us. And then we have the expansion going on in the UK, we have the expansion in Brazil that happens in the third and fourth quarter with several new brands going into Brazil. And then we have Douglas in Germany, which is 130 stores, very good selling space with our top brands.\n\nSo those are the components, Steven, that make up the difference in layers going into the second half of the year from a revenue perspective and consumer.\n\nSteven Mah -- Cowen and Company -- Analyst\n\nOK. Got it. That's very helpful. And maybe just a follow-up question on the consumer, can you talk about your impact of your fit-to-win, where you're going to be raising the prices? Can you talk about the impact of those price increases given the inflationary environment and pressure on the consumer? Thank you.\n\nJohn Melo -- President and Chief Executive Officer\n\nYeah, we are -- it's a great question. And I hope that the result is the same we've seen in our ingredients, which is we raised our prices on two of our top ingredients and demand has gone up in the second half based on orders placed. So, I'd expect the consumer to be quite robust and that we're being very strategic about where we're raising prices. So -- and to make it simple, we have SKUs that I'll call them entry-level SKUs, 100% Squalane in the Biossance brand is a good example.\n\nIt's a competitive product, it's priced compared -- and it's something that we use to acquire customers. On the other hand, we have specialty products like Vitamin C Rose Oil, which is unique. We're the only ones who make the performance and deliver the performance in Vitamin C Rose Oil that our product delivers. And it's a product that's in high demand everywhere that we're now launching into, and then obviously continued to be number one across North America.\n\nSo in that in that product, we believe there's more price elasticity and a bigger opportunity for us. The other thing I'd say is just about all of our competitors have already put price increases through, and we're seeing them hold pretty steady in their performance, especially in the prestige space. So I guess there's more to be seen, Steven. But I would tell you that based on what we see so far, we think there's a solid position to maintain our growth while putting a price increase through.\n\nSteven Mah -- Cowen and Company -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nOur next question comes from Sameer Joshi with H.C. Wainwright. Please go ahead.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nHey, John. Hey, Han. Thanks for taking my question. I just wanted to dig a little bit deeper into the gross margin improvements.\n\nOne of the factors you said impacted gross margins was a brand portfolio mix and channel mix. How are you overcoming that? Or is this mix baked in your forward expectations?\n\nJohn Melo -- President and Chief Executive Officer\n\nTwo things. The mix is baked in. And if you think about what the mix really means, you'll notice second -- or first quarter to second quarter a shift in direct-to-consumer in the mix of total sales. You don't see this, but I'll highlight it, there was also a pretty significant jump in China sales.\n\nSo you think about the geographic mix, you think about the channel mix, DTC versus store. And then thirdly, the portfolio mix, which is probably the lowest impact of the three on the total margin profile for the second quarter. But that mix really talks to, we added on the beauty and we added some other aspects to the portfolio that have a lower margin profile than, say, a Biossance or a MenoLabs, which are MenoLabs north of 70% gross margin, and Biossance in the mid-60s. Our opportunity right now is with all the actions we've spoken about, we have a significant opportunity to put the gross margin for consumers at or above the top of the range of the guidance we had given at the beginning of the year, and that's really what we're focused on.\n\nAnd, we've given you a couple of examples, but I'll just highlight a major one. Just in packaging for the Biossance brand, which is our biggest revenue generator, we are in the process of implementing a change that will take out 30% to 40% of packaging cost. And to give you a sense of what that means, packaging costs are about two-thirds of the cost of goods for the Biossance product line. So, some people will say to me, like, why am I worried about packaging? Well, in the consumer business, packaging matters a lot.\n\nPackaging take pack and shipping are actually the majority of the cost of goods where the ingredients themselves are, less than a third of the total cost of goods for the products we make. So I hope that helps in giving you a sense of how the mix plays out. And then, what we're doing about the margin structure, which is enabled by the investments we made. There is nothing Han talked about in the fit-to-win strategy or an agenda that is not already enabled by investments made.\n\nAnd what we're really talking about is executing those investments and pulling through the benefits of those into our financials in the second half.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nNo, this was helpful. Thanks for that. And then my other question is about the slight impact on the technology access revenues, were impacted by the production company timing of the F&F ingredient going forward -- well, part of the question is, is this related to the Brazil facility? And part two is going forward, how would you be managing these impacts from a timing perspective?\n\nJohn Melo -- President and Chief Executive Officer\n\nYeah, great question. The ingredients enablement is all about the Barra Bonita facility. And I'll give you an example of how intense the pressure has been, in our core molecule Farnesene, and is a great example, we have not had the Farnesene to support our major customers. And if I just give you a few examples, I mean, Hemisqualane which Farnesene derived, since about the mid -- middle of the first quarter demand has just skyrocketed.\n\nWe've actually sold every drop of Hemisqualane in our entire channel. We've got a backlog of Hemisqualane that I've never seen in my life because when we launched Jonathan Van Ness, just about everybody brand that mattered, and every haircare brand that mattered, started inquiring with us about how they could access Hemisqualane, and we're just out of supply, so that is one key driver. The second is Squalane, we're seeing significant growth in Squalane around the world that we've not been able to supply in the last few quarters that we see coming through. And the third example, which is also a Farnesene-derived molecule, is the polymer we supply Kuraray, which is a critical polymer for several tire manufacturers.\n\nAnd we've had an order on the books for Kuraray now, since the beginning of the year that we finally will be able to fulfill. So it is all about Barra Bonita, Farnesene is a key driver of that, but it's not just Farnesene. I mean we have just last quarter, like 2x to 3x the demand for the RebM sweetener that we've been able to deliver on. We've got Ingredion basically pounding on our door telling us we need double the RebM that you're supplying us and we need it yesterday.\n\nSo we have RebM, we have Farnesene, and we have more demand for Vanillin than we've been able to produce. Just to give you some examples of what's in the cards that we really will enable supply with Barra Bonita. And that is why Barra Bonita is working at full throttle, as we could see for the foreseeable future. As of about August 15th, we'll have the three biggest lines operating and delivering products at Barra Bonita.\n\nThose three main lines are super flexible, they're super advanced engineering for fermentation, and they are equal to the total manufacturing capacity of our old [Inaudible] facility. Just to give you a sense of scale, we have two additional lines which are smaller that we'll be bringing up between now, and the end of the year. And we're already starting the expansion project to bring in several large tanks into Barra Bonita that will give Barra Bonita about 3x the capacity of our old [Inaudible] plant over the next 12 to 18 months. So I hope that gives you a sense of about what is actually been holding back our ingredient revenue, how we see it being unlocked, and where we see the product going.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nGot it. And if I may, just one last question for the mid to longer term. How do you see revenues growing from 2023 onwards? Just, if you can just have a longer, broader picture?\n\nJohn Melo -- President and Chief Executive Officer\n\nLook, I don't see a significant change to our growth rate between now and call it 2024, or 2025. I mean, obviously, when you look at the absolute numbers, I don't know that we'll be growing consumers by 150% a year for that entire period. But when you look at our absolute revenue growth, being at 50% to 70% top-line revenue growth for the company is something I expect and we have assets to be able to deliver on. And more importantly, we have strength in the brand in channel partners, and in technology to execute on that.\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nGreat. Thanks for that. And good luck. Thanks.\n\nJohn Melo -- President and Chief Executive Officer\n\nThanks, Sameer.\n\nOperator\n\nOur next question comes from Rachel Vatnsdal with JPMorgan. Please go ahead.\n\nRachel Vatnsdal -- JPMorgan Chase and Company -- Analyst\n\nGreat. Hey, guys, thanks for taking the questions. So first, just a follow-up on Steven's question about the consumer guide. So you're reiterating that consumer revenue growth is greater than 150% for the year.\n\nAnd I believe you stated during that May conference circuit that you guys are going to be north of $250 million of consumer revenue this year, which really implies more like 170% growth. So just given some of the puts and takes in the macro environment that's played out so far during the year, is this still a viable number for consumers? Or should you really dial it back to that 150% growth?\n\nJohn Melo -- President and Chief Executive Officer\n\nI would say, Rachel, we have -- as you can imagine, all the same concerns everybody else does. It'd be crazy for us not to be thinking about some of the pressures on the consumer. We've been very surprised at the robustness of our consumer. And a lot of what we're seeing is a trade-down, right? We're seeing consumers that were buying luxury trade into prestige.\n\nAnd we're seeing prestige, especially for our consumer brands, because they're new, they have newness, and they're delivering on the customer promise. On the consumer promise, we're seeing them hold up. I am not seeing across our brand portfolio any change that would signal we would need to back off that guidance as we sit here today. We are monitoring it very carefully.\n\nLook, a great example of that is Walmart, where -- it's been public, some of the challenges Walmart has faced on its shelves and with its consumers. However, when it comes to beauty and personal care, they're not seeing that slowdown, they're not seeing that impact. And we see ourselves playing into that performance at Walmart, being an example of a retailer. If I think about the UK market, it is on fire right now for beauty and personal care.\n\nIf I think about the China market, it's had significant challenges, and yet we've been able to deliver and really have a brand that's outperforming other prestige brands in China. So very conscious of the environment we're playing into. I'm observing a couple of interesting things, which is it appears that the inflationary pressure is either peaked or starting to back off a bit. And I'm seeing consumers that even though are concerned and uncertain about the financial future are still taking care of themselves.\n\nThey're taking care of their skin, they're washing their hair regularly. And our products are becoming a bigger and bigger part of them doing that. And one of the things that's very clear, women are not putting hot flashes on pause during the financial uncertainty, and that is a key market. We haven't shared this widely, but MenoLabs, our acquisition actually has done super well for us.\n\nIt'll deliver around near or just above $20 million this year in revenue. But more importantly, over 60%, about 67% of its business is on a subscription that consumers are just continuing to grow. And I don't see that slowing down. So I have the concerns that you've expressed, but I'm not seeing it impact our revenue to date on consumers.\n\nRachel Vatnsdal -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thanks. And then on gross margin, can you just walk us through what was the gross margin contribution for consumer versus technology access this quarter? And then, on that $1 billion run rate for core revenue by the end of 2023, you mentioned that that would come in at about a 60% gross margin. So how should we think about that gross margin contribution from consumer versus technology access at that point as well? Thanks.\n\nJohn Melo -- President and Chief Executive Officer\n\nYeah. I'll let Han quote the adjusted gross margin numbers for the quarter, consumer versus ingredients. And then I'm happy to share with you what that looks like in '23.\n\nHan Kieftenbeld -- Chief Financial Officer\n\nYeah. So just a quick bit of color there, on consumer in total, we were just under 60% this quarter, so that was a consumer in the aggregate. As John mentioned earlier, we had obviously a channel mix, portfolio mix, and a number of things. But that's pretty much consistent actually with the first quarter, but that's the totality.\n\nIn terms of technology access, of course, the pieces you have to repeat because it's important is the ingredient products portfolio. We have our technology licenses that include the earnout, as well as the collaboration revenue in that some gain there. Technology access was and -- because R&D revenue or collaboration revenue and the license revenue is 100% kind of margin accretive, you can get a little bit of flux from quarter to quarter, more so than certainly, we see with the consumer portfolio. In Q2, it was just around 18%, one-eight.\n\nSo those are the two numbers that you should know.\n\nJohn Melo -- President and Chief Executive Officer\n\nAnd to cap that off, I'll just say that, when you look at the fourth quarter of '23, you can expect around 80% or so of that to be the consumer, and then the rest of it to be technology access from a revenue perspective, and from here to there, based on our fit-to-win agenda, you can expect to see margin expansion on for consumers pretty significant, I'd say probably close to a 1,000 basis points and then also about a 1,000 basis points, an expansion on the ingredient side for a different reason, ingredient side, because of Bonita. And then, consumer because of packaging supply chain and the move to our own manufacturing. So those are the drivers in the fit-to-win agenda. Again, about a 1,000 basis point expansion in gross margin for each one of the categories and about an 80/20 mix of consumer versus technology access as we exit 2023.\n\nI hope that helps.\n\nOperator\n\nOur next question comes from Randy Baron with Pinnacle. Please go ahead.\n\nRandy Baron -- Pinnacle -- Analyst\n\nHi, guys. Can you hear me?\n\nJohn Melo -- President and Chief Executive Officer\n\nYes, we can. Randy, thank you.\n\nRandy Baron -- Pinnacle -- Analyst\n\nI really appreciate all the granularity that was given today, but I don't want to bury the lead. So given that SG&A has been elevated but you're going to take out $50 million in costs. Where do you see cash at the year-end of 2022?\n\nJohn Melo -- President and Chief Executive Officer\n\nLook, if I'm aggressive, I'd say north of $400 million. If I'm super conservative, I'd say south of $300 million. That's kind of where I see it going. And that is based on the execution of the two items we've highlighted.\n\nCompleting the term loan, which we are confident of and well on track for. And then secondly, completing our strategic transaction, we are also very confident, we made a lot of progress and are now on track to close. As communicated earlier, before the end of the year. So I think that's how we look at it, Randy, a low end of $300 million, a high end of $400 million.\n\nAnd obviously, if we're super successful and advance more of the earnout into this year, it could be north of that, but that at least gives you a range to work with.\n\nRandy Baron -- Pinnacle -- Analyst\n\nYeah, that's great. And part of that obviously is the molecule monetization that you've mentioned, previously you had said that was going to be $250 million today, you said north of $300 million. I'm wondering at a high level if you can talk about just what changed, and why you think that value has gone up?\n\nJohn Melo -- President and Chief Executive Officer\n\nLook, we were in a process. I mean, I'm using process loosely. We didn't hire a bank, but we had several people in the process when I first communicated that strategic transaction for ingredients. And then since then, we've logged on to a specific buyer, we've advanced the pricing of the deal and the valuation of the molecules.\n\nSo I'm now able to give you a more confident range, where I think we'll come out, first on what we where we are for upfront cash, and then where we are for earnout and long-term value.\n\nRandy Baron -- Pinnacle -- Analyst\n\nThat's great. Have you given a range for what you think the upfront kind of cash number will be as part of that monetization?\n\nJohn Melo -- President and Chief Executive Officer\n\nYeah, I have said that -- I actually hunch it on the call, which is $350 million is the upfront number.\n\nRandy Baron -- Pinnacle -- Analyst\n\nWow. That's great. OK. And then the last thing for me, on Beckham is super exciting.\n\nI mean, that's thrilling to hear given his reach, and obviously, the [Inaudible] brand is as well. I'm just curious, is the structure of those going to be more JVN 100% owned by Amyris? Or more Rose Inc., where they're some equity kind of owned by them? How is that going to look? Thanks so much.\n\nJohn Melo -- President and Chief Executive Officer\n\nBoth are brands where they have a share, and then specifically with TMRE, it was really important and for all the right reasons, which I support wholeheartedly, that Walmart has a black female-owned brand on their shelf. So we've actually structured TMRE very differently than our other deals. However, the way the economics work and the transfer pricing keep us whole on economics, and actually enable a very interesting business for both her, us, and Walmart.\n\nRandy Baron -- Pinnacle -- Analyst\n\nThank you.\n\nJohn Melo -- President and Chief Executive Officer\n\nThanks, Randy.\n\nOperator\n\nOur next question comes from Graham Tanaka with Tanaka Capital Management. Please go ahead.\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nThank you. Thank you. Thank you for your answer so far. Equal employment opportunity employer, let's give Eduardo a chance to speak.\n\nWe're very excited about your start-up about Barra Bonita. It sounds like it's going ahead of expectations if you could discuss what the risk is there, and versus expectations not only on production but yields and cost sold? Thanks.\n\nEduardo Alvarez -- Chief Operating Officer\n\nGood morning, Graham. Good. Good to hear from you. I think as John mentioned, Barra Bonita has started really well.\n\nWe are producing two products between now and the end of the year, we have a total of six that we will be producing. It'll encompass us, as we look at it around 60% of our total production for this year. So that gives you a sense of how quickly scaling up. The performance for the first two products has been, as we expected, the productivity and the yields are with a number.\n\nAnd a really exciting thing that I can comment on is our resilience, in terms of the turnaround times, and the ramp-up times that we have experienced. We can't, forecast everything that we will see. But I really have started very well. John mentioned, for example, our Hemisqualane and Squalane challenges in the first half.\n\nWe are on track to double the production in the second half for those two products as an example of the scale-up and resilience that we expect to see it, Graham.\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nThat's great. How about the cost of goods? So what? What kind of costs are you seeing at Barra Bonita? Or expected of Barra Bonita, perhaps by the fourth quarter, as you get to a steady state relative to the CMOs? I don't know how specific --\n\nEduardo Alvarez -- Chief Operating Officer\n\nYeah.\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nBut it looks like they -- thank you.\n\nEduardo Alvarez -- Chief Operating Officer\n\nYeah. If you think about the fit-to-win actions that Han talked about, we expect $30 million on a run rate basis of $10 million by the end of the year. The major benefits we see in the cost of goods sold have to do with start with the production costs. We are seeing material improvements in the productivity and the scale of the plant.\n\nWe see a lot lower energy costs than we have seen in our other facilities. And frankly, from a labor perspective, also a great advantage also in productivity. So, we can -- I can't disclose the specific unit cost, but I can tell you materially the $30 million that we are forecasting on an annualized basis is a very doable number and we are going to definitely be there in at least half of the products that I mentioned. I would just want to say of the six products that I talked about, Graham, two of them are brand new.\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nYes.\n\nEduardo Alvarez -- Chief Operating Officer\n\nTwo of them are brand new. John already mentioned one, a confidential fragrance. And we'll have one more by the end of the year that you'll be hearing more about.\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nThat's really great. And, one of the things that I've been particularly curious about is you've talked about how you're adding a lot of company-specific, company design -- Amyris designed processes and technologies Barra Bonita that I assume you did not show to the CMO's, how much of an advantage is that going to give you? And I always would view that as almost a permanent cost advantage versus the Amyris?\n\nEduardo Alvarez -- Chief Operating Officer\n\nYeah, It -- one example of it, in one of the lines that we have, I think John mentioned, it's really going to basically our turnaround time is so efficient and the design is so resilient that we're going to basically run three campaigns between now and the end of the year as an example. So yes, we do have a lot of know-how that we put into the plant. The design is vertical, so it allows you also to have far more resilience in between the stages of production. And frankly, I think the most important thing is our people.\n\nWe are -- John mentioned the team on the ground is incredibly experienced and focused to -- Barra Bonita is not just a great asset for Amyris, it's a great asset for the planet and a source of tremendous pride for Brazil. It's a -- we are hiring the best in the industry because we have delivered and have a track record for -- just doing great for business and for the planet. Thank you, Graham.\n\nJohn Melo -- President and Chief Executive Officer\n\nGraham, the only thing I -- Graham, the only thing I would add because the one thing I love about Eduardo, is he's so understated and he just executes, right? But the one thing I want to add, just to give you a color, I'll just pick one molecule because it's the highest volume molecule in our portfolio. It's Farnesene, not because we sell it as Farnesene, but because we sell as the intermediate into many other markets we sell into. Farnesene alone, the cost of Farnesene out of Barra Bonita is two-thirds less than what our cost of Farnesene has been the first half of the year.\n\nEduardo Alvarez -- Chief Operating Officer\n\nYes.\n\nJohn Melo -- President and Chief Executive Officer\n\nThat's just one simple example of how that then flows through and impacts our business. This is a major game changer.\n\nEduardo Alvarez -- Chief Operating Officer\n\nYeah. And that that percent is not uncommon. I think that's a very material, very significant, and representative change across the portfolio.\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nOK. So that's really terrific and looking forward to -- so actually, could I ask what kind of roughly flat utilization rates, do you expect in the third and fourth quarters? And when do you reach a steady state? Thanks.\n\nEduardo Alvarez -- Chief Operating Officer\n\nLook, I mean, -- I have to hit the steady state by the next couple of months. I think it's hard to say what the final utilization is. I can tell you, we have started really well. And so I wouldn't be surprised that we are in the upper 70s.\n\nBut, it'll be very interesting to see as I mentioned, two of them are new products, and that often creates a little bit more variability. Our design is to run this plant 80% plus 90% close to it.\n\nJohn Melo -- President and Chief Executive Officer\n\nIt's probably better to really break it down into two parts, which is for the tanks we've brought on, we're operating high 80% utilization and the total plant will be about actually how fast we can get everything else up and running, which as Eduardo highlighted, in the next couple of months, we want that plant fully up and we want to see utilization across all tanks. Would really the downtime being the ability to put in new strains to make new molecules.\n\nEduardo Alvarez -- Chief Operating Officer\n\nExactly.\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nThanks. Yeah, I understand. That is a normal part of batch processing. Then you will be doing the switching.\n\nAnd I assume that's why you have eight tanks and talk about five lines, so -- for clean and prep. But I -- a lot of investors are actually wondering when you put the new large 600,000 a liter tank then that you have already sitting somewhere in mothball, I guess, or maybe you pulled it out of mothballs. When do you install those? Because people are now worried about, can you meet demand next year?\n\nEduardo Alvarez -- Chief Operating Officer\n\nI think John mentioned, we are actively looking at next year. If you ask me what quarter -- I really need to just -- I'm in a bit wait -- it won't be an issue of engineering and construction is really with more around also making sure that we got the right production window because we also -- we would be producing full blast. So we would have to balance it in the pecking order of our plan. But we would be we expect it to be fully in production by next year.\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nThat's great. OK. To switch subject to. One more question, John, is the molecule exclusivity sales? I think a lot of people have a little confusion about how that fits into the long-term business model and plants.\n\nAnd it looks like -- if you could talk about what your plans are, for how many molecules that you could sell? You're not selling the molecule. I understand you're selling just exclusivity for that, right? Or that option a particular luckier partner will be able to will have the option to pay up more for that molecule, because they're the only ones that are going to get it off of Bonita lines. So, what does that do to the gross margin targets for ingredients which we used to think were 27% going to 35% to 40%? Does that, take it up higher to say 50% gross margin if you add back the implied margin from the sale of the exclusivity rights? Thanks.\n\nJohn Melo -- President and Chief Executive Officer\n\nYeah. We've given guidance or direction on the margin for our technology access, based on what we see the go-forward portfolio looking like. So I wouldn't give any more detail on that for now. I think the important thing that -- I don't think we've made very public is in the way these deals are structured, continuous cost improvement from strain improvements and process improvement actually are accretive to us and not the buyer.\n\nSo we end up actually having an opportunity for margin expansion built into the deal structure in the way in the way they're set. And, for some molecules, that's pretty meaningful for others, we're the point where there isn't really much more juice to get out, other than just getting more and more efficient with the process in the plant. But I just wanted you to know, that it's not that future margin potential is all gone, and we've already embedded that into the near-term outlook for margin structure based on the portfolio moves we see. I think the last point I would add around that question, Graham, is, I mean, you can imagine with the level of the portfolio we have, we're not done.\n\nAnd I think the whole strategy of technology, specifically molecules funds consumer growth because consumer growth has a lot more margin. And what we've demonstrated so far is a lot of sustainability in our growth going forward, that that's a strategy we see that has a lot of legs. We've already been approached for another molecule in our portfolio that we expect to be, what we end up doing some time in 2023. So there's a lot more to go.\n\nWe're by no means done and it's all about a simple strategy. We use amazing technology to make and scale products, we make and scale them long-term, and we monetize the marketing rights because we can't market to everybody everything all the time, and we need to focus our own direct capability on the consumer and let our partners focus on the B2B to sales.\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nGreat. Thank you very much to involve me here. Good luck. Thanks.\n\nJohn Melo -- President and Chief Executive Officer\n\nGreat. Thanks, Graham. Thank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to John Melo for any closing remarks. Please go ahead.\n\nJohn Melo -- President and Chief Executive Officer\n\nThank you, Maria. Appreciate your help during this call. And, I'd like to thank everybody for joining us today and for your continued interest and support. If we did not get to your question, please follow up with our investor relations team.\n\nWe'll make sure, we get back to you with a response. And then, we will be working with and I'm sure -- in some of the near-term conferences, we'll be making our quarter targets quite public so that our internal targets hopefully match or are very near what our modeling is on the outside. And we can all win together. And I really appreciate again your support and I'm looking forward to a great second half and having the big investment cycle behind us, and really realize the full potential of what we built.\n\nThank you so much. Great day to everybody.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHan Kieftenbeld -- Chief Financial Officer\n\nJohn Melo -- President and Chief Executive Officer\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nSteven Mah -- Cowen and Company -- Analyst\n\nSameer Joshi -- H.C. Wainwright and Company -- Analyst\n\nRachel Vatnsdal -- JPMorgan Chase and Company -- Analyst\n\nRandy Baron -- Pinnacle -- Analyst\n\nGraham Tanaka -- Tanaka Capital Management -- Analyst\n\nEduardo Alvarez -- Chief Operating Officer\n\nMore AMRS analysis\n\nAll earnings call transcripts"
}