{
  "companyName": "Yum! Brands",
  "companyTicker": "YUM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/yum-brands-yum-q3-2022-earnings-call-transcript/",
  "content": "Yum! Brands (YUM -1.47%)\nQ3 2022 Earnings Call\nNov 02, 2022, 8:15 a.m. ET\n\nOperator\n\nHello, everybody, and welcome to today's Yum! Brands, Inc. 2022 third quarter earnings call. My name is Drew, and I'll be coordinating your call today. [Operator instructions] I'm now going to hand over to Gavin Fielder, chief strategy officer and interim head of investor relations, to begin.\n\nPlease go ahead.\n\nGavin Felder -- Interim Head of Investor Relations\n\nThanks, operator. Good morning, everyone, and thank you for joining us. As a reminder, I will be covering for Jodi Dyer while she is out on maternity leave. On our call today are David Gibbs, our CEO; Chris Turner, our CFO; and Dave Russell, our senior vice president and corporate controller.\n\nFollowing remarks from David and Chris, we'll open the call to questions. Before we get started, I would like to remind you that this conference call includes forward-looking statements that are subject to future events and uncertainties that could cause our actual results to differ materially from these statements. All forward-looking statements are made only as of the date of this announcement and should be considered in conjunction with the cautionary statements in our earnings release and the risk factors included in our filings with the SEC. In addition, please refer to our earnings releases and relevant sections of our filings with the SEC to find disclosures and definitions of non-GAAP financial measures and other metrics that may be used on today's call, as well as reconciliations of non-GAAP financial measures.\n\nPlease note that during today's call, all system sales growth and operating profit growth results exclude the impact of foreign currency. Next, I'll provide an update on the financial reporting treatment related to our exit from Russia. As a reminder, as of the beginning of the second quarter, we elected to remove the Russia business from key performance metrics. This negatively impacted our third quarter unit growth by 2 percentage points and our system sales growth by 3 percentage points.\n\nAdditionally, these units were removed from our same-store sales calculations and thus do not impact same-store sales results for the third quarter. For the purposes of this call, all references to system sales growth and unit growth results for the quarter are adjusted to remove our Russia business from the prior year base. We continue to include Russia in GAAP measures for KFC, including royalty revenue and expenses to support the Russia business and expenses incurred relating to the transfer of ownership of the business. As a result of our decision to exit our Russia business, we have reclassed net operating profits from the operating segments subsequent to the start of the conflict to corporate and unallocated and reflected as a special item within the other income and expense line.\n\nFor more information on our reporting calendar for each market, please visit the financial reports section of our website. We are broadcasting this conference call via our website. This call is also being recorded and will be available for playback. Please be advised that if you ask a question, it will be included in both our live conference and in any future use of the recording.\n\nWe would like to make you aware of upcoming Yum! investor events in the following. Disclosures pertaining to outstanding debt in our restricted group capital structure will be provided at the time of our Form 10-Q filing. We will be hosting an investor day in person on Tuesday, December 13, 2022, at the New York Stock Exchange. The event will also be webcast via our website at investors.yum.com.\n\nFourth quarter earnings will be released on February 8, 2023, with the conference call on the same day. Now I'd like to turn the call over to David Gibbs.\n\nDavid Gibbs -- Chief Executive Officer\n\nThank you, Gavin, and good morning, everyone. Our strong top line momentum this quarter highlights clear demand for our iconic brands. We delivered 10% system sales growth, underpinned by 5% same-store sales growth and 6% unit growth. While the broader macro environment evolves, our brands continue to thrive by being distinctive, creating excitement for consumers and by delivering exceptional value and convenience.\n\nThe investments we have made in areas such as consumer insights, marketing analytics, and new technology platforms allow us to act with pace and confidence to meet the needs of consumers around the world. I'm particularly thrilled about the performance of the KFC and Taco Bell division that were both standout performers this quarter. KFC did an excellent job in driving transaction growth through its omnichannel approach, leading to a sequential improvement in comps from the prior quarter. Taco Bell is winning, thanks to its ability to generate and amplify standout moments in culture and translate the resulting top line growth into impressive restaurant-level margins.\n\nI'm also excited to share that we opened a total of 979 gross units across 74 countries, proof that our development engine is powerful and diversified. As these results show, our committed and well-capitalized franchise partners are seeing opportunities to invest in the growth of our brands for the long term. Next, I want to provide an update on our Russia business. As Gavin mentioned, we have a signed purchase agreement to transfer ownership of our Russian KFC restaurants, operating system and master franchise rights to an existing KFC Russia franchisee.\n\nFollowing the completion of the transaction, we will have ceased our corporate presence in Russia. I want to say that I'm incredibly proud of how our local teams have managed through this extremely difficult time and prioritized the safety of our people in the region. Our No. 1 priority is our people, and they will always be at the center of every decision we make.\n\nNow I'll talk about two of our growth drivers, our Relevant, Easy and Distinctive Brands, or RED for short, and our unrivaled culture and talent. Then I'll provide an update on our Recipe for Good. Chris will share the details of our third quarter financial results before discussing our bold restaurant development and unmatched operating capabilities growth drivers. First, I'll discuss our RED Brands.\n\nBeginning with the KFC division, which accounts for 51% of our operating cost. System sales grew 12%, underpinned by 7% same-store sales growth and 7% unit growth. As these results prove, this business can perform well in a multitude of environments, even as certain pockets of the local portfolio experienced tightened macro pressures. At KFC's International business, which represents 46% of our operating profit, our system sales grew 14%, driven by an 8% increase in same-store sales.\n\nThis represents a significant acceleration from the 1% same-store sales growth in the second quarter. We saw notable strength in the Middle East, India and Africa, thanks to momentum across our digital channels and a focus on operations and value. Our Middle East market is truly on fire, where system sales grew an impressive 46% with strength across all channels, including a ramp-up in the use of kiosks and Click & Collect. Our India market saw system sales grow 45% during the quarter with customers enjoying the convenience-driven seven-minute Express takeaway guarantee.\n\nIn Africa, where system sales grew 31%, the team is focused on providing an easy and convenient digital experience for consumers. They've done an outstanding job rebranding their Click & Collect channel, as well as rolling out kiosks across the market to drive sales, underpinned by compelling sharing offers like the all-in-one feast. At KFC U.S., we brought back our famous $5 Mac & Cheese Bowls as a value-oriented item this quarter. The reboot of this much-loved product helps drive a positive 2% same-store sales comp.\n\nAdditionally, for a limited time, we launched a $6 two-piece drum and thigh combo, which has driven positive results and a meaningful sequential improvement in transactions. Moving on to our Taco Bell division, which represents 34% of our operating profit. We saw extremely strong momentum with system sales growing 9%, led by 6% same-store sales growth and 5% unit growth. At Taco Bell U.S., system sales grew 8% for the quarter, underpinned by a 7% same-store sales growth and 2% unit growth.\n\nThe brand is bringing to life its one-of-a-kind menu through creative innovation in a way that only Taco Bell can. This was most evident with the team adding products to its $2 cravings menu such as the cheesy BB burrito while innovating with premium offers like the grilled cheese burrito. Taco Bell is a brand that is truly relevant, easy and distinctive. With the unique ability to stand for value with the current economic environment, you have a broad-enough range to appeal to consumers across every demographic.\n\nAs we enter the fourth quarter, we're even more excited about the momentum in Taco Bell U.S. with the relaunch of the Mexican pizza, which occurred in mid-September. At Taco Bell International, system sales grew 26%, driven by 30% unit growth and 5% same-store sales growth. In the third quarter, five markets delivered double-digit system sales growth, marking another milestone in Taco Bell's international expansion journey.\n\nYear to date, we've opened 111 net new units, almost double the number opened at this point last year. We're driving scale in key markets, helping our franchisees leverage their size to optimize marketing spend, expand development capabilities and gain local sourcing efficiencies. Next, at the Pizza Hut division, which accounts for 15% of our operating profit, our system sales grew 5%, led by 5% unit growth and 1% same-store sales growth. At Pizza Hut International, which accounts for 8% of our operating profit, system sales grew 6%, underpinned by 8% unit growth and 2% same-store sales growth.\n\nAcross our markets, we are focused on finding ways to expand our reach to become a more everyday brand. For example, as a leading everyday value offering, the Pizza Hut India team launched a fun flavor pizza costing roughly $1. More broadly, the My Box value platform is proving to be a key traffic driver through innovation and giving customers the option to customize with new entrees and sides. The platform helps us lean in on the individual meal and lunch occasion and is now live in over 50 countries.\n\nI'm also pleased to say that our emerging markets are seeing a recovery in traffic and demand as we lap the impact of COVID. Pizza Hut U.S., which accounts for 7% of our operating profit, saw system sales growth 2%, driven by 1% same-store sales growth. A key focus for this business has been to provide our customers with the ability to access our brands wherever they are. As part of this initiative, we continue to partner with third-party aggregators and integrate them into our POS systems with 90% of our system using at least one-third party marketplace.\n\nIn addition, we are working to ensure we have the right value offerings to meet consumer demand and maintain franchisee profitability. This effort led to the introduction of items such as the $6.99 medium one topping pairs deal and the return of the Big Dinner Box as an abundant family value offering. Lastly, at The Habit Burger Grill, same-store sales trends on a 3-year basis have sequentially improved since the second quarter. Additionally, we continue to see consumers download our mobile app, leading to a 10% increase in app downloads since last quarter.\n\nDigital sales at The Habit now account for 33% of mix. The team is making good progress, growing new sales channels and forming direct relationship with our customers. Moving on to our unrivaled culture and talent growth driver. As we've mentioned on previous calls, we have been celebrating our 25th anniversary as a publicly traded company in various forms throughout this year.\n\nI'd like to acknowledge the important role our unique people-first culture and world-class talent have played in our success over the last 25 years. Our culture, which is focused on recognition and collaboration, is a key differentiator across our portfolio of iconic brands. It continues to drive retention and recruitment of amazing leaders who are developing others, growing their careers and ensuring the continued strong performance and success of our brand. I'm proud of Yum!'s deep bench of outstanding leaders and how our commitment to growing our people from within has driven a healthy increase in promotions and new opportunities for our teams.\n\nOur culture continues to attract top external talent as well. We recently welcomed former Mars Inc. executive, Allyson Park, to our global leadership team as Yum!'s chief corporate affairs officer, overseeing communications and public policy, as well as our ESG strategy, an area of increased importance as we continue driving our recipe for good. At Pizza Hut, we welcomed former Starbucks executive, Shannon Garcia, as the brand's global chief operating and transformation officer, a role that will evolve the way in which the brand works with its markets to add value and operate with a digital-first mindset.\n\nThese are just two examples of the incredible talent that our culture enables us to attract from outside and within our industry. When it comes to our Recipe for Good, we continue to invest in critical work that's focused on our three priority areas of people, food and planet. I'm proud of our commitment and the progress we're making on the execution of our ESG agenda. For example, when it comes to our climate efforts, we moved Yum!'s U.S.\n\noffices, as well as all of our company-owned restaurants to renewable electricity. We're now conducting a global study on renewable energy markets to identify low-carbon solutions at our restaurants worldwide. And in August, Pizza Hut U.S. announced an exciting partnership with Dairy Farmers of America on an innovative farm-level sustainability project to provide participating farmers with the technology and data needed to help reduce greenhouse gas emissions.\n\nWith iconic brands and unmatched scale, I truly believe that we're in a unique position to make a significant impact in the areas we are prioritizing. To wrap up, I'm excited about the momentum in the business that we demonstrated this quarter. The power and resilience of our brands was clear as we continue to prove we can perform well in any environment. With our diversified global scale, world-class franchise partners and unmatched operating capabilities, I am more confident than ever in the future success of our business.\n\nWith that, Chris, over to you.\n\nChris Turner -- Chief Financial Officer\n\nThank you, David, and good morning, everyone. Today, I'll discuss our financial results, our bold restaurant development and unmatched operating capability growth drivers, followed by our capital strategy. I'll begin with our third quarter financial results. System sales grew 10%, with broad-based strength evident across our portfolio.\n\nSame-store sales grew 5%, while units grew 6%. Core operating profit grew 8%, which includes a three-point headwind from the removal of Russia profits this year. Ex-special general and administrative expenses came in at $259 million, tracking in line with our expectations for $1.1 billion of G&A expense for fiscal 2022. Impressively, our Taco Bell store level margins were 24%, trending above third quarter last year and above pre-COVID levels.\n\nWith respect to reported operating profit, FX had a negative $39 million impact, and we now expect a full year FX headwind of approximately $100 million. Third quarter EPS, excluding special items, was $1.09, an 11% decrease versus the prior year. In addition to a 3 percentage point impact from foregone operating profits in Russia, EPS growth was also negatively impacted by 9 percentage points from the aforementioned FX, 9 percentage points owing to a higher tax rate and 6 percentage points from lower year-over-year unrealized gains associated with our investment in Devyani. Our ex-special tax rate this quarter was higher than usual at just under 27%, largely due to adjustments recorded in the quarter associated with prior year taxes.\n\nGiven these adjustments, we now expect our full year tax rate to land between 23% and 24%. Overall, given the same strength of our global business, we continue to expect to grow core operating profit in the mid-single-digit range for the full year. As we mentioned on the past two quarterly calls, whereas not for the loss of Russia profits, we would expect core operating profit growth to be high single digits this year, in line with our long-term growth outlook. Now let me share some more detail on unit growth and our bold restaurant development growth driver.\n\nThis quarter, we opened 979 gross new units with encouraging momentum across our brand portfolio. At KFC, we opened 485 gross new units with China, India, the Middle East and Thailand leading the charge. Our Pizza Hut International division saw incredible development progress this quarter, opening 344 gross new units, setting a third quarter development record. This puts Pizza Hut International's year-to-date gross openings at 879 units, which is $280 ahead of this time last year.\n\nChina, India and Turkey led Pizza Hut development with each market adding more than 30 gross new units. The Taco Bell division opened 98 gross new units this quarter, led by strong international development, achieving a Q3 record of over 50 gross new units. For Taco Bell International, I'm excited to share that this quarter, both the India and U.K. markets joined Spain in the ranks of countries that now exceed 100 units.\n\nWhile Taco Bell U.S. development remains robust, we expect international development to lead Taco Bell's unit growth this year. Despite the uneven macro pressures across our markets, our development remains strong as our franchisees use market disruptions as opportunities to grow. We are partnering closely with our franchisees to navigate challenges in the supply chain and higher construction costs.\n\nWe are leveraging both our sourcing expertise and scale to secure equipment and realize favorable pricing on key items. Our teams are highly focused on balancing long-term profitability for our franchisees and offering value for our customers. With the power of our well-capitalized and committed franchise system and the unique global scale we have at Yum!, we remain confident in our ability to grow in any economic environment. Next, I'll discuss our unmatched operating capabilities and the three pillars of our digital strategy, easy experiences, easy operations and easy insights.\n\nI'll start with an update on our easy experiences pillar, which focuses on delivering exceptional customer experiences through technology and dedicated operational programs. QSR magazine ranked Taco Bell and KFC in the top 3 for fastest drive-thru times in the U.S. In fact, Taco Bell drive-thru times were 9 seconds faster year over year. KFC division kiosk sales also stood out this quarter with a more than 40% increase in sales year over year and 6% system sales mix, an impressive result considering that only 15% of KFC restaurants currently have kiosks.\n\nWe are also encouraged that the Tictuk platform is expanding beyond chat ordering with its e-commerce engine with a front- and back-end website and mobile app that is serving some of our smaller international countries. We recently went live with Tictuk's e-commerce engine in KFC Mexico and saw an increase in conversion rates post launch. We expect Tictuk's e-commerce engine will be live in 18 countries by year-end. Moving on to our easy operations pillar that centers on the team member and franchise partner experience.\n\nWe completed the integration of our second delivery aggregator into the Pizza Hut U.S. system this quarter, building on our initiative to partner with third-party aggregators and provide our customers with more options to access our brands. Further adoption of third-party aggregators for delivery as a service has also helped ensure that we can meet customer expectations during peak delivery hours and save valuable time for our team members who can then spend more time elevating the customer experience. Additionally, the global rollout of Dragontail's smart kitchen management and driver tracking system continues to progress at an impressive rate.\n\nLastly, I'll cover our easy insights pillar, which leverages the power of data and analytics to allow our teams to make smarter decisions. Kvantum, the marketing analytics company we acquired last year, continues to roll out to markets around the world. We are now leveraging Kvantum's media optimization platform across nearly 60 brand-country combinations, covering more than 60% of our system sales. Notably, Pizza Hut Australia has seen a double-digit increase in return on media spend after deploying Kvantum's advanced media mix analytics platform.\n\nOur brand teams are also using Kvantum's expanded suite of tools in areas such as customer analytics, pricing optimization and market intelligence. Next, I'll provide an update on our balance sheet and liquidity position. Our net leverage ratio ended the quarter at five times despite the exclusion of our Russia business. Though capital markets continue to adjust to higher interest rates, we are proud of the work our treasury team has done to put us in the enviable position of having no significant maturities over the next three years and approximately 94% of our debt fixed.\n\nAs we've said before, our capital priorities remain consistent: invest in the business, maintain a healthy balance sheet, pay a competitive dividend and returning the remaining excess cash to shareholders via share repurchases. Our capital expenditures for the quarter, net of refranchising proceeds, were $51 million. Our full year expectation for net capital expenditures is now approximately $200 million, reflecting $50 million in refranchising proceeds and roughly $250 million in gross capex. With regard to our share buyback program, we repurchased 1.4 million shares in the quarter at an average share price of $116 per share, totaling approximately $157 million.\n\nAdditionally, during September, the board of directors approved a new share repurchase authorization of up to $2 billion through June 30, 2024, that will take effect upon exhaustion of the current authorization. To close, I'm excited about the continued growth we saw this quarter and the momentum in our diversified development across the portfolio. This once again shows that our iconic brands and world-class franchise partners are well-positioned to navigate any economic environment. Before wrapping up, I'd like to remind everyone that our investor day is taking place in person at the New York Stock Exchange on December 13.\n\nWe look forward to seeing you then. With that, operator, we are ready to take any questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question today comes from Dennis Geiger from UBS. Your line is now open.\n\nDennis Geiger -- UBS -- Analyst\n\nGreat. Thanks for the question. I wanted to ask about the strength in the U.S. business.\n\nAnd maybe, David or Chris, could you talk a little bit more about what you're seeing across the brands in the U.S., what you're seeing from a consumer behavior standpoint and I guess really how that guides how you're thinking about the resiliency of the brands in the U.S. going forward? Thank you.\n\nDavid Gibbs -- Chief Executive Officer\n\nYeah. From a consumer standpoint, obviously, you saw the top line results we reported this quarter. We're very pleased with them. They're very strong.\n\nSo generally around the world, we're not seeing any concerns from a consumer standpoint. Then if you dig deeper into what's going on in the U.S., it's been well documented that there's a little bit of a K-shaped recovery. And we're seeing a little bit of that. We're higher in consumers having a little bit more demand.\n\nBut the great thing about our business is our brands are so well-positioned to succeed in any environment. And in particular, our business is 80% globally based on Taco Bell U.S. and KFC International. Those two businesses make up 80% of our profit.\n\nThey're incredibly well-positioned to deliver value to consumers with appealing brands. So in the U.S., this K-shaped recovery, there's a little bit of K-shaped demand for value on the high end. The demand is more for premium value. That's why you're seeing us do things like the Double Steak Grilled Cheese Burrito at Taco Bell, which is at a higher price point than normal, but still a great value and a big part of our success in Taco Bell.\n\nAnd then on the low end, in Q3, you still have KFC go back to Mac & Cheese Bowls with some success that moves the needle. So that's a value offering, but at a price point that's appealing to a low-end consumer but still not just discounting our core product, something interesting that consumers are flocking to. And the cravings menu in Taco Bell is the same thing where we're offering burritos for $2. So as far as the consumer environment for us and our industry and for our brands, which are particularly well suited to navigate it, it Looks good.\n\nNow I know in other industries, like in other parts of retail, if you bought some furniture a couple of years ago, you probably pulled your demand forward and that -- they're not going to have the same demand today. We don't have that issue in our industry because if you bought lunch two years ago, that's not influencing your decision today. And your decision today is more determined by how we stack up versus your options. We know that we're a really attractive option versus grocery, which is experiencing a lot of inflation.\n\nSo this is a good environment for us.\n\nOperator\n\nOur next question today comes from John Glass from Morgan Stanley. Please go ahead.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nGood morning. Chris and David, is 6% unit growth the new 5%? I guess I'm thinking about durability of that growth rate as you think out. And just remind us, one, when you think about sort of targets for growth rate, what's the time horizon? Ultimately, the base effect of large numbers catches up with such a large system. So is it a three-year target, five-year? How do you sort of frame that internally? And Chris, can you also just talk about cost of capital? Cost of debt has gone up.\n\nIs that a worrisome impediment to growth over the intermediate term as the rate environment changes? Thanks.\n\nDavid Gibbs -- Chief Executive Officer\n\nThanks, John. I'll take the first part of that and then let Chris talk about some of the capital issues out there. Look, I don't think the law of large numbers, if we're anything close to catching up on that in our efforts, we continue to put up impressive development numbers. You saw this -- the numbers this quarter and our year-to-date numbers today are roughly in line with what we had last year at this time, showing -- which was a record for us and for the industry, we believe, showing the strength of our development.\n\nAnd it is broad-based. The amount of development that's occurring outside of China continues to climb nearly 60% now, and that's in 74 countries last quarter. So this is broad-based. We think we have tons of opportunities around the world for all the foundational reasons you would want.\n\nThe returns that our franchisees are getting are strong. Taco Bell, being voted the best franchise opportunity out of the 500 that are ranked in the U.S. And then Yum! China, I think last night on their earnings call talked about the great two-year KFC paybacks and three-year Pizza Hut paybacks. So with those kinds of returns, we know we're going to continue development.\n\nWe have visibility into the pipeline and we feel good about it despite all the challenges in the environment. As far as the pace of development, we're pleased with the strength that we have and even in the face of losing the development that we had in Russia. So the development story is good, and we know it's a big part of Yum!'s growth equation going forward. I'll turn it over to Chris just for a few comments on the capital challenges.\n\nChris Turner -- Chief Financial Officer\n\nYeah. So John, on the capital side, I'll take it in two buckets. One, just following up on David's comments around franchisees and unit development. Just a couple of additional thoughts there as it relates to capital.\n\nDavid mentioned in many of our markets around the globe, we had very strong returns that are significantly higher than interest rates or even with small moves in interest rates, these are still highly attractive investments for our franchisees to make. And keep in mind that our franchisees on average compared to many other systems are larger, more sophisticated, more well-capitalized and more growth-minded. They're able to look through near-term noise in the market and actually take advantage of these types of disruptions in the marketplace to accelerate their growth. And so we're very pleased with the state of our franchisee base and our partnership with our franchisees, plus we have the strongest development team in the business.\n\nSo we're working with them to navigate through that, but we feel good. In terms of cost of capital for our balance sheet, our balance sheet at Yum! remained strong and very resilient. I think we proved that as we navigated the last few years. We're proud of the cash that we return to our shareholders.\n\nAnd we're set up well right now in this higher interest rate environment. We have no maturities, as we mentioned earlier, through 2026. 94% of our debt is fixed. We've also, over the last few years, created more capacity in some of the lower cost areas of our capital structure that we could access if needed.\n\nRight now, we're at five times leverage. But to be clear, going forward, we're not wedded to five times leverage. We're going to do what optimizes returns for our shareholders. We review our strategy regularly with the board.\n\nSo when it comes time -- the next time that we would consider issuing debt, we'll look at where rates are at that time, we'll look at a set of other factors, and we'll make a decision on whether issue or whether to grow into a slightly lower leverage ratio. But just know, we're going to do what optimizes returns for our shareholders.\n\nOperator\n\nOur next question is from John Ivankoe from J.P. Morgan. Please go ahead.\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nHi. Thank you. Also a capital question, if I may. Obviously, there's a lot of focus on new unit development, as there should be.\n\nClearly, the same-store sales around the world, particularly KFC International, really does support underlying franchise system that should and I'm sure is doing very well. But the question is on the existing base of assets, especially the existing base of assets that might be 10-plus years old, I mean just how the overall system is from a capital perspective. Are there any major projects that are happening in some major countries around the world that maybe we just haven't heard about? And does it make sense? Would it make sense for Yum! to co-invest with its franchise system around the world? Obviously, we all see the U.S., but you have a lot of big countries around the world where maybe putting some capital in the existing base of assets could be something that could drive longer-term brand value and shareholder value as well.\n\nChris Turner -- Chief Financial Officer\n\nYeah, a good question on the existing asset base. We're, as we just discussed, a tremendous unit grower, but we also want to make sure that our current asset base remains fresh and relevant, provides a great experience for our customers. Of course, whenever you're growing at 6% units, every year, that's a new chunk of new stores that are being added to the system. Plus we have programs with our franchisees where they got requirements around remodeling and keeping the asset base fresh.\n\nIn terms of the responsibility for that, that lies with our franchisees, and it's part of their approach to being in our business, investing in stores. They know they've got to make investments over time to continue to keep the asset base refreshed, and our brands are working hard with the franchisees to do that.\n\nOperator\n\nOur next question comes from Jon Tower from Wells Fargo. Your line is now open.\n\nJon Tower -- Wells Fargo Securities -- Analyst\n\nHey, this is Jon. How's it going? Just a quick question. We heard from one of your larger global competitors about the need to potentially offer franchisee relief to some of their partners in Europe over the next, say, 12 months or so. And the picture is kind of reminiscent of what we heard during COVID times due to the inflationary pressures in that market.\n\nSo I'm curious to learn what you're hearing from your operators in that market and what they're doing to brace for the potential volatility ahead. And frankly, maybe if you could even frame your own operating profit exposure to that region, that would be helpful as well.\n\nChris Turner -- Chief Financial Officer\n\nYes. So obviously, in Europe, right now, there are some challenges, particularly on energy inflation, they're facing, our franchisees. Europe is an important growth market for us in the long run. We have meaningful but moderate exposure in the context of our global portfolio.\n\nEurope, as a geography, is about mid-teens percentage of our sales and our operating profit. The business continues to be strong from a top line perspective there. If you look at KFC Europe, we had 25% system sales growth in Q3. Now the U.K.\n\nwas a little bit of a different story where those energy inflation is a bit more pronounced, and you've got that holiday overlaps continuing throughout the year. So we had slight negative sales there. Same thing in the Pizza Hut business, strong in other parts, U.K. a bit more impacted.\n\nBut we are working closely with our franchisees. We know this is going to be a challenge for them to navigate. And we manage the business on a franchisee by franchisee basis. So our teams in Europe are partnering with them, setting the commercial plans for the business to help navigate those inflationary challenges.\n\nOperator\n\nOur next question is from David Tarantino from Baird. Please go ahead.\n\nDavid Tarantino -- Robert W. Baird and Company -- Analyst\n\nHi. Good morning. My question really is about the sales strength you saw for both KFC and Pizza Hut, especially when you factor out China. You saw a pretty material acceleration in the comps relative to pre-COVID levels.\n\nSo I guess on a three-year comp basis, a pretty big step-up. And I wonder if you could just talk about what you think drove that step-up from the second quarter and how sustainable that trend might be. Thanks.\n\nDavid Gibbs -- Chief Executive Officer\n\nYeah. Thanks, David. I'll just comment on a couple of things. And of course, in the speech, I already mentioned the foundational things that are driving our business that will continue to drive it this quarter and in future quarters, like the progress that we're making on technology and digital.\n\nBut beyond that, I guess what I would highlight is outside the U.S., while we had good growth in both developed and emerging markets, our emerging markets are really starting to perform strongly. We were plus 20 in emerging markets outside the U.S. ex-China. So that was a big driver, and that was expected.\n\nWe talked about this on previous calls that as these markets recover from COVID, we expected outside growth. The really encouraging thing about that is that's actually plus 16% versus 2019. So not just a recovery but real growth versus the 2019 baseline. And then in the U.S., obviously, Taco Bell has been a steady high performer, but KFC, I think, did a better job on value with the Mac & Cheese Bowls this quarter.\n\nPizza Hut, as we've talked about in previous quarters, has done -- has made progress on embracing third-party aggregators to solve some of that delivery challenge. So we saw a meaningful improvement in their trends on delivery sales. So that all added up to, as you mentioned, good strong growth around the world.\n\nOperator\n\nOur next question is from Andrew Charles from Cowen. Please go ahead.\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nGreat. Thanks. Dave, across the U.S. portfolio, you guys are obviously leading the value across all three brands, and I'm curious how you see the industry evolving as we look at the end of 2022 and into early 2023.\n\nDo you expect the domestic quick service industries focused on value to further intensive buy in a difficult traffic backdrop? Or do you think value activity is going to be challenged by just the high COGS and robust labor backdrop?\n\nDavid Gibbs -- Chief Executive Officer\n\nYeah. Look, it's hard to predict anything over the last few years in this environment. The one thing that I can predict though is our brands are incredibly well-positioned to navigate any environment. We've demonstrated that over the last few years, and I feel confident as we move forward.\n\nValue does seem to be more of a factor today than it might have been six or nine months ago, and that's just more of a return to normal for the industry rather than it is an exaggerated emphasis on value. But as I mentioned in my earlier comments, the scale that we have, our purchasing ability, the appeal of our brands, the fact that the vast majority of our business is at Taco Bell U.S. and KFC International piece that are so strong and so successful at navigating value give us great confidence that we will be able to continue to thrive in any environment. And there is a little bit more of an emphasis on this premium value, which is good for the industry, where products that aren't at the absolute lowest price can still be very appealing to consumers as long as the overall equation, the experience, the convenience, the craveability of the food is all there.\n\nGavin Felder -- Interim Head of Investor Relations\n\nOperator, we have time for one more question.\n\nOperator\n\nOur last question today will be from David Palmer from Evercore. Please go ahead.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThanks. Question on Pizza Hut U.S. What have been the learnings with regard to third-party delivery marketplaces and drivers as a service, the contribution to growth from that? But also, what concerns did you have going into it with your franchisees? And how has it played out versus your plan? And then related to the unit growth thing, I'm wondering -- you highlighted Pizza Hut International having a strong unit opening quarter, but I'm wondering about the U.S. stabilizing and how you're feeling about that being a driver to your net opens as we go into '23.\n\nAnd thank you.\n\nChris Turner -- Chief Financial Officer\n\nYeah. Thanks, David. I'll take -- on Pizza Hut U.S. first.\n\nAs David mentioned, the addition of aggregators has been one part of solving the delivery capacity challenge that we mentioned earlier in the year. We talked about how at the beginning of the year, we view this more as a capacity challenge than a demand challenge. And we've used our relationships with the aggregators, both being on their platforms and working with them on delivery as a service, as one mode to solve that. Plus, I think we've mentioned that we have also adjusted some of our hiring practices and our HR practices or our franchisees have to attract more drivers into their jobs, things like reducing the time it takes to apply for a job at Pizza Hut.\n\nBoth of those have contributed to us having significantly more delivery capacity in the market. If you look at Q2, we had a 23-point gap between our carryout growth and our delivery growth. In Q3, we actually extended our carryout growth, but the gap narrowed to 17 points. That means delivery was significantly higher, and I think that's just attributable to both of those levers giving us more delivery capacity into the system.\n\nThere's one other benefit from the aggregator platforms, which is we get an incremental customer who sees us on those marketplaces. And so that's probably been a bit of an impact there as well. And we've mentioned earlier that we've seen franchisees, who adopted these faster, run a little bit ahead of the system. So I think that is part of what's driving growth in the Pizza Hut U.S.\n\nsystem. On the unit growth question, obviously, we had strong unit growth in Taco Bell U.S. Pizza Hut U.S. and KFC U.S.\n\nhave stabilized. And in the long run, we expect all of our markets around the globe to be focused on driving units. And so the teams are working on strategies to do that. But right now, those businesses are in a stable place from a unit standpoint as you see in the results this year.\n\nDavid Gibbs -- Chief Executive Officer\n\nYeah. To wrap up, obviously, a very strong quarter for Yum!. We're pleased with the results, led by our great teams in the field. We've got an investor conference coming up, and it's actually the first investor conference that we've had in four years given the delays from COVID.\n\nSo we're really eager to get to spend some time with all of you in New York on December 13. In particular, we've got some new leaders in the business that you'll get to hear from live in person for the first time. I'm very excited about letting them tell the great growth stories that we have going on all around the world. A great quarter, and thanks for your time today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGavin Felder -- Interim Head of Investor Relations\n\nDavid Gibbs -- Chief Executive Officer\n\nChris Turner -- Chief Financial Officer\n\nDennis Geiger -- UBS -- Analyst\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nJohn Ivankoe -- JPMorgan Chase and Company -- Analyst\n\nJon Tower -- Wells Fargo Securities -- Analyst\n\nDavid Tarantino -- Robert W. Baird and Company -- Analyst\n\nAndrew Charles -- Cowen and Company -- Analyst\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nMore YUM analysis\n\nAll earnings call transcripts"
}