{
  "companyName": "TherapeuticsMD, Inc.",
  "companyTicker": "TXMD",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/therapeuticsmd-inc-txmd-q2-2022-earnings-call-tran/",
  "content": "TherapeuticsMD, Inc. (TXMD -0.71%)\nQ2 2022 Earnings Call\nAug 15, 2022, 8:30 a.m. ET\n\nOperator\n\nFor the TherapeuticsMD second quarter 2022 financial results conference call. [Operator instructions] I would now like to turn the call over to investor relations for TherapeuticsMD, Lisa Wilson. Lisa?\n\nLisa Wilson -- Investor Relations\n\nThank you, operator. Good morning, everyone, and thank you for joining today to discuss our second quarter financial results and business update. This morning, TherapeuticsMD issued a press release announcing its second quarter 2022 financial results. The press release and accompanying presentation are available on the company's website TherapeuticsMD in the investors and media section.\n\nOn today's call from TherapeuticsMD are chief executive officer, Hugh O'Dowd; interim chief financial officer, Michael Donegan; and chief commercial officer, Mark Glickman. I would like to remind everyone that certain statements made during this conference call may be forward-looking statements. Such forward-looking statements are based upon current expectations and there can be no assurance that the results contemplated in these statements will be realized. Actual results may differ materially from such statements due to a number of factors and risks, some of which are identified in our press release and our annual, quarterly and other reports filed with the SEC.\n\nThese forward-looking statements are based on information available to TherapeuticsMD as of today, and the company assumes no obligation to update these statements as circumstances change. An audio recording and webcast replay for today's conference call will also be available online in the investors and media section of the company's website. For the benefit of those who may be listening to the replay or archived webcast, this call was held and recorded on August 15, 2022. With that, I'll turn the call over to TherapeuticsMD's CEO, Hugh O'Dowd.\n\nHugh O'Dowd -- Chief Executive Officer\n\nThank you, Lisa, and thank you, everyone, for joining our call today. Today, I'd like to share our progress against our goals and highlight the key milestones met during the second quarter. Our total net revenue for the quarter was $28.6 million, an increase of 24% over the second quarter of 2021. At the same time, our total operating expenses during the quarter declined by $11.4 million, or 21%, while gross profit rose by 26%.\n\nThe second quarter of 2022 also saw us complete the divestiture of our vitaCare business unit. In just five weeks, our organization went from deal announcement to closing. With the proceeds from these efforts, the company has been able to repay $120 million of debt during the second quarter, and TXMD is now a far more focused business dedicated to advancing the health of women throughout all stages of their lives. Our final accomplishment to note is the U.S.\n\nFood and Drug Administration's approval of our supplemental new drug application for ANNOVERA, which increases our current and future supply. With this approval, we expect a significant reduction in manufacturing batch rejections and an increase in future product supply that will enable the company to better meet customer demand for ANNOVERA. Now that I've discussed these achievements, I wish to spend a moment acknowledging another key event of the quarter. As you all know, in May, we entered into a definitive agreement to sell the company to EW Healthcare Partners, However, the transaction did not garner sufficient support from our shareholders.\n\nOur recent financing with Rubric Capital Management and accompanying maturity extension have provided us with additional runway, such that our board of directors and management team remain forward-looking in evaluating all options, including seeking partners to refinance our current debt or pursuit of other strategic alternatives, all this to enable us to serve our two primary constituencies, our patients and our shareholders. And with that, I'll turn it over to our interim chief financial officer, Michael Donegan, to discuss our financial results in greater detail. Michael?\n\nMichael Donegan -- Interim Chief Financial Officer\n\nThanks, Hugh. On April 14, we completed the divestiture of vitaCare prescription services for $142.6 million, net of transaction costs, and recognized a gain of $143.4 million on the sale. Included in the net proceeds was $11.3 million of customary holdbacks, which are recorded as restricted cash on the balance sheet. We used $120 million of the proceeds to pay down our outstanding loan and may also receive up to an additional $7 million in earn-out consideration, contingent upon vitaCare's financial performance through 2023.\n\nI'll now turn to our second quarter 2022 financial results. Our total revenue for the quarter was $28.6 million, an increase of $5.6 million or 24.2% compared to the second quarter of 2021. For the quarter, sales of ANNOVERA were $18.3 million, an increase of $8.7 million or 91.2% compared to the second quarter of 2021. This increase was primarily due to an increase in sales volume, partially offset by a decrease in the average sales price.\n\nSales of IMVEXXY were $6.7 million for the quarter, a decrease of $3.2 million or 32.2% compared to the second quarter of 2021. This was primarily due to decreases in sales volume as well as average sales price. Sales of BIJUVA were $2.7 million for the second quarter, an increase of $0.5 million or 23.1% compared to the second quarter of 2021. The increase was a result of money received under the Theramex license agreement and an increase in overall sales volume, partially offset by a decrease in the average sales price.\n\nPrescription vitamin sales were $0.9 million for the second quarter, a decrease of $0.5 million or 35.5% compared to the second quarter of 2021. This is due primarily to decreases in sales volume and average sales price. Gross profit for the second quarter of 2022 was $23.8 million, an increase of $5 million or 26.2% compared to the second quarter of 2021, and this is due primarily to the increase in product revenue. In addition, product gross margin improved overall as a result of a change to the sales mix, with increased sales volume for ANNOVERA and BIJUVA and decreased sales of IMVEXXY.\n\nTotal operating expenses for the quarter were $42.7 million, a decrease of $11.4 million or 21.1% compared to the second quarter of 2021. This is driven mostly by the vitaCare divestiture as well as companywide effort to reduce overall operating expenses. Selling and marketing costs were $23.7 million for the second quarter, a decrease of $8.5 million or 26.4% compared to the second quarter of 2021 due to lower brand spending for IMVEXXY and ANNOVERA, reduced compensation and employee benefit expense and lower consulting expenditures, partially offset by higher education, conference and software development costs. General and administrative costs were $17.4 million for the quarter, a decrease of $2.5 million or 12.4% compared to the second quarter of 2021.\n\nThis decrease was due primarily to lower costs associated with compensation and employee benefits, information technology and rent, partially offset by a net increase in overall professional and consulting fees. R&D costs were $1.6 million during the quarter, a decrease of $0.4 million or 21.4% compared to the second quarter of 2021. And this is due to lower compensation and employee benefit expenses, partially offset by higher lab research costs. As we refocused our resources toward the continued commercialization of our pharmaceutical products, R&D expenditures have declined.\n\nAs mentioned earlier, we recognized a gain of $143.4 million on the sale of the vitaCare business during the second quarter of 2022. Other nonoperating expenses totaled $11.7 million, an increase of $4.2 million or 56.7% compared to nonoperating expenses of $7.5 million for the second quarter of 2021. This increase was a result of higher amortization of deferred financing costs, offset by lower interest expense due to lower average debt balance and lower interest prepayment fees due to the March 2022 amendment to our financing agreement. More details regarding the amendment and our debt and financing arrangements can be found in our 10-Q.\n\nNet cash used in operating activities was $15.4 million for the second quarter. And as of June 30, 2022, we had $26.3 million in cash. In August, we announced a $15 million investment from Rubric Capital Management to fund near-term operations. At the same time, we entered into an agreement with Sixth Street Specialty Lending to extend the maturity date of our debt to September 30, with the option to further extend the maturity date until October 31 and November 30, 2022, if we receive additional equity capital of $7 million per extension.\n\nI'll now turn the call over to our chief commercial officer, Mark Glickman, to provide more detail around our commercial progress. Mark?\n\nMark Glickman -- Chief Commercial Officer\n\nThanks, Michael. As we disclosed earlier in the year, we managed to keep up with demand through a difficult period of sporadic inventory shortages. As you can see, the demand for ANNOVERA not only held up, but demonstrated strong growth when the product became more readily available. Now that we have ample inventory in stock, ANNOVERA hit an all-time high of 901 prescriptions in the last week of the quarter.\n\nDespite the inventory issues, ANNOVERA prescriptions grew 28% compared to the second quarter of 2021, carried in part by a strong June. Due to the new targeting and sales focus we mentioned last quarter, new prescribers grew at an accelerated rate of 1,487 during the quarter, and total prescribers have now surpassed 12,000. These are all signs of strong demand and the potential for growth. In addition, on July 28, president Biden issued an executive order to protect access to reproductive healthcare services.\n\nAt the same time, the three agencies -- Health and Human Services, the Department of Labor and the Treasury Department, took steps to clarify protections for birth control coverage under the Affordable Care Act, which guarantees coverage of women's preventative services including, among other things, hormonal methods like birth control rings and pills. With the current environment in the state of flux, this is great news for ANNOVERA and for women's health in general. As the only long-lasting, procedure-free, patient-controlled option for women, we continue to believe ANNOVERA is positioned to play a significant role in the contraceptive market. We are also starting to see the results of the revamped field force targeting and accountability focused initiatives we rolled out in quarter 1.\n\nOn the next slide, you'll see that total prescriptions from IMVEXXY declined slightly during the quarter, in line with expectations as we shifted our targets and focus. We are, however, encouraged by what we believe are the early results of the new focus as evidenced by an uptick of prescriptions in June, and we expect this course to continue. IMVEXXY also had quite a strong quarter regarding new prescribers by adding 1,606 payers and exceeding 30,000 prescribers since launch. With BIJUVA, we are excited with the early results of the targeting, and this slide reflects what we expected to see.\n\nDuring the quarter, BIJUVA prescriptions grew around 5% over Q1 2022, rebounding from a previously declining trend line. This slide here demonstrates accelerating month-over-month growth in new-to-brand prescription, which is directly related to targeting and strategy changes. Market research indicated that BIJUVA, with the correct targeting, messaging and effort, would be a highly sought-after therapy for women with VMS symptoms, and we are seeing the early successful signs of those efforts. I'll now turn the call over back to our CEO, Hugh O'Dowd, for concluding remarks.\n\nHugh O'Dowd -- Chief Executive Officer\n\nThank you, Mark. In summary, we delivered a solid quarter of operating performance amid a backdrop of considerable ambiguity, while our focus remains steadfast on serving our patients and shareholders. On behalf of the management team and our board of directors, I wish to thank our employees for their dedication, spirit and incredible commitment to our mission of empowering women of all ages through better and affordable healthcare. Thank you.\n\nOperator\n\nThank you. [Operator instructions] Our first question will come from Douglas Tsao with H.C. Wainwright. Please go ahead.\n\nDouglas Tsao -- H.C. Wainwright and Company -- Analyst\n\nHi. Can you hear me?\n\nHugh O'Dowd -- Chief Executive Officer\n\nHey, Doug. Loud and clear.\n\nDouglas Tsao -- H.C. Wainwright and Company -- Analyst\n\nOK. Great. Sorry, there's a little static. So maybe as a starting point, obviously, you sort of used the word ambiguity.\n\nJust maybe can you talk to -- and I apologize if you maybe touched on it, I've just been bouncing from another call, that employee retention rates, especially in the sales force just given some of that uncertainty, and certainly, some of that still continues to persist.\n\nMichael Donegan -- Interim Chief Financial Officer\n\nHey. Doug, let me start and I'll offer Mark a moment to amplify my response. But we remain encouraged and committed. And so even though in the presence of some level of ambiguity in 2Q, that strong operational performance where we delivered a solid quarter is on the back of our committed field force and really strong revitalized, and frankly, transformed commercial effort.\n\nSo I think with that backdrop, I just wish to acknowledge that our employees have really been fighting through a very fair amount of ambiguity given that we had a number of key events occur in the quarter, inclusive of the tender process. So I think it's just clear to acknowledge that in reality. Having said that, I think we remain confident in our team. Mark, would you wish to offer more comments?\n\nMark Glickman -- Chief Commercial Officer\n\nYeah. Thank you. Hey, Doug. So we're -- like you aware of the possibility with the uncertain times of turnover.\n\nSo we're working hard on communication and various schemes to ensure that our incentive scheme, to ensure that our field force stays engaged and that we give them the rationale to stay and be successful. As of right now, turnover is at a very reasonable rate and we hope to plan to continue that.\n\nDouglas Tsao -- H.C. Wainwright and Company -- Analyst\n\nOK. Great. And then just on ANNOVERA, and I might have missed this, obviously, really strong performance from a revenue standpoint this quarter. Did that -- and obviously, we're seeing the scripts upturn.\n\nI mean that's pretty transparent to us. But just how much do you think that this revenue performance is actually reflective of end demand? Is this sort of like a real base that we're going to continue to build off of? Or should -- was there some sort of dynamics in terms of inventory levels and shipments with the new rings becoming available that we should be aware of?\n\nMark Glickman -- Chief Commercial Officer\n\nThanks, Doug. It's Mark again. That was volume. The ANNOVERA number was volume.\n\nObviously, we had the sporadic inventory concerns. We obviously had to refill channels. We still are in that state. It feels and it looks, weekly, everything has settled down.\n\nThere's ample inventory in the channel. And we are seeing a resumption of the demand that we expected to see prior to any inventory concerns. As far as the quarter and the revenue, I do believe that the revenue was based on demand, there definitely is a restocking in the channels because demand was actually running ahead of inventory for a while here. So we restocked the channels, but that was all demand-based.\n\nThere was -- and we do plan on seeing that moving forward.\n\nDouglas Tsao -- H.C. Wainwright and Company -- Analyst\n\nWhy you didn't...\n\nHugh O'Dowd -- Chief Executive Officer\n\nDoug, what I would supplement those remarks is, if you really look at the monthly TRxs in the fall, and that was commencing the early days of the transformation work that Mark and his team had undertaken, we saw TRxs respond. Then what happened? We had the challenge where we had supply issues. And that really, for us, was a Q4, Q1 event, as we previously described. As we've been able to dig ourselves out and ultimately secured for us, the SNDA FDA approval, this then was a fundamental moment to pivot where we could return to proper supply levels.\n\nAnd now you see TRxs once again retracking to that previous effort. So I believe Mark's answer is really on target, and I just offer that data to supplement his remarks. Sorry, you had another question.\n\nDouglas Tsao -- H.C. Wainwright and Company -- Analyst\n\nYeah. No. And just -- and I know in some of the tender documents, there was a reference to some concern that there were higher rejection rates. I saw that there was a slide in terms of -- you sort of commented on the TRICARE situation.\n\nDo you feel right now that you're going to sort of have a handle on that and we're going to -- that shouldn't be an impact on sort of the -- not necessarily the short-term results, but just a long-term peak opportunity for the product?\n\nHugh O'Dowd -- Chief Executive Officer\n\nDoug, can you clarify? We want to make sure we answer the right question. We didn't hear you well. You're pointing to a specific issue from the denied or can you just rephrase?\n\nDouglas Tsao -- H.C. Wainwright and Company -- Analyst\n\nSo in the tender documents, I think there was a reference by one of the -- somebody looking -- a party that was looking at participating in the process, expressing concern around rejection rates. And I was just looking just to understand where you feel right now, and specifically to ANNOVERA, that they -- there was a comment that ANNOVERA rejection rates were somewhat higher, which was affecting their valuation of the company. And I was just wanted to get your sense of where you feel rejection rates are and how that should affect the -- or our sort of long-term assessment of the product opportunity for ANNOVERA, which based on the near-term performance, looks quite good?\n\nHugh O'Dowd -- Chief Executive Officer\n\nThat's very helpful. Mark, please share.\n\nMark Glickman -- Chief Commercial Officer\n\nYeah. So -- and now we aware of what you're referring to. So rejection rates: A, were very high for to since launch; and b, have been the focus of the commercial team really going back into the last quarter of last year. ANNOVERA is -- the great news is ANNOVERA is an incredibly unique product that serves a place in the market.\n\nBut that also -- that uniqueness in the pharmaceutical industry, having a once-a-year retail solution for women's contraceptive needs, really creates an issue within the retail and the pharmacy environment, we have addressed and found the root cause of those rejections. I won't get into too much detail here. I can assure you it was not a coverage issue. It was not an intention of the managed care plans to reject the product.\n\nIt was more around the idiosyncrasy of ANNOVERA being a once-a-year retail product. We can't find another analog that's like ANNOVERA, and that's a good thing. But we did it. We found it.\n\nWe knew we had a rejection issue when we looked at Symphony data. We found the root cause. We addressed it. We addressed it with our payer partners, and we do not believe that's going to be an issue moving forward.\n\nDouglas Tsao -- H.C. Wainwright and Company -- Analyst\n\nOK. And then I just know you had conversations with some of the large shareholders and people who are participating or have become more involved in the story about their sort of vision for the company and -- can you maybe share some thoughts on that?\n\nHugh O'Dowd -- Chief Executive Officer\n\nSo I think if you're referring to our time after the conclusion of the tender process, what can we say? I think we believe that the pipe, together with our financing agreement extension, enables the company to maintain our operations, number one. And two, really meet the demand of our novel portfolio, while our board of directors and our management team evaluate all options to strengthen the company's long-term financial position. That's what we're setting about doing right now. With respect to any details of the Rubric deal and the maturity extension with Sixth Street, we have ample discussion in our recent SEC filings.\n\nAnd I'd encourage all investors to please read those.\n\nDouglas Tsao -- H.C. Wainwright and Company -- Analyst\n\nOK, great. Thank you very much. I'll hop out of the queue for now.\n\nHugh O'Dowd -- Chief Executive Officer\n\nDoug, Thank you.\n\nOperator\n\nI'm showing no further questions in the queue at this time. I would now like to turn the call back over to management for any further remarks.\n\nHugh O'Dowd -- Chief Executive Officer\n\nWe'd like to say thank you for everyone joining our call today. We appreciate the opportunity to share with you our narrative, and thank you for your time. Take care and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLisa Wilson -- Investor Relations\n\nHugh O'Dowd -- Chief Executive Officer\n\nMichael Donegan -- Interim Chief Financial Officer\n\nMark Glickman -- Chief Commercial Officer\n\nDouglas Tsao -- H.C. Wainwright and Company -- Analyst\n\nMore TXMD analysis\n\nAll earnings call transcripts"
}