{
  "companyName": "GrafTech International Ltd.",
  "companyTicker": "EAF",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/graftech-international-ltd-eaf-q3-2022-earnings-ca/",
  "content": "GrafTech International Ltd. (EAF 1.71%)\nQ3 2022 Earnings Call\nNov 04, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to the GrafTech third quarter 2022 earnings conference call and webcast. [Operator instructions] This call is being recorded on Friday, November 4, 2022. I would now like to turn the conference over to Mike Dillon, vice president, investor relations and corporate communications. Please go ahead.\n\nMike Dillon -- Vice President, Investor Relations\n\nGood morning, and welcome to GrafTech International's third quarter 2022 earnings call. On with me today are Marcel Kessler, chief executive officer; Jeremy Halford, chief operating officer; and Tim Flanagan, chief financial officer. Marcel will begin with comments related to our operations in Monterrey, Mexico; Jeremy will then discuss safety, sales, and operational matters; Tim will review our quarterly results and other financial details; Marcel will then close with comments on our outlook. We will then open the call to questions.\n\nTurning to our next slide. As a reminder, some of the matters discussed on this call may include forward-looking statements regarding, among other things, performance, trends, and strategies. These statements are based on current expectations and are subject to risks and uncertainties. Factors that could cause actual results to differ materially from those indicated by forward-looking statements are shown here.\n\nWe will also discuss certain non-GAAP financial measures, and these slides include the relevant non-GAAP reconciliations. You can find these slides in the Investor Relations section of our website at www.graftech.com. A replay of the call will also be available on our website. I'll now turn the call over to Marcel.\n\nMarcel Kessler -- Chief Executive Officer\n\nGood morning, everyone. Thank you for joining GrafTech's third-quarter earnings call. Before we dive into GrafTech's third-quarter performance, I would like to begin with a detailed discussion about our operations in Monterrey, Mexico. First, I want to thank the entire GrafTech team, and in particular, all our employees in Monterrey for their efforts to address the situation and the continued focus on moving our business ahead.\n\nAnd I would also like to thank our customers for their ongoing support and understanding. In a nutshell, here is the update on the current status. First, Monterrey's manufacturing operations remain suspended, and we are pursuing all possible avenues to get the site reopened. At this point, we don't know when operations will resume.\n\nHowever, we remain confident in our ability to ultimately resolve this situation. Second, Monterrey is 30% of our total annual production capacity and currently the only site that produces the pin stock utilized for all our electrodes. We are working to restart our facility in St. Marys, Pennsylvania, as well as pursuing other mitigation strategies to produce 100% of our pin needs when fully implemented.\n\nThird, unless Monterrey reopens, our business performance will be significantly impacted for the first two quarters of 2023 with a reduction in sales volume of 50% or more before recovering in the back half of the year. Fourth, we expect to be able to meet our LTA commitments in 2023. Fifth, we have ample liquidity to see us through this challenge. And sixth, while the situation with Monterrey is very unfortunate, we remain optimistic about the longer-term outlook for GrafTech.\n\nWe have sustainable competitive advantages including substantial vertical integration into petroleum needle coke, long-term demand tailwinds and the talented and experienced team. We will emerge stronger from the short-term challenge. Let me provide more detail on each of these six points. Our facility in Monterrey has been operating since 1959, has over 550 employees and represents approximately 60,000 metric tons or 30% of our total annual electrode production capacity.\n\nMonterrey's operations can produce a broad portfolio of products, including various sizes of grad electrodes and pins. As we have previously reported on September 15, inspectors from the environmental authorities for the state of Mexico visited our facility in Monterrey. At the conclusion of this visit, the inspectors issued a temporary suspension notice. Other than to allow for a safe wind-down of all operations, the suspension notice was effective immediately.\n\nIn early October, we obtained clarification that certain nonproduction activities, including the movement of inventory were permitted to continue. Apart from these permitted activities, operations have been halted since that time. The findings of the inspectors focused on procedural errors related to certain operating licenses and permits. I believe that it is important to point out that at no time during or after the inspection, has it been alleged by the relevant authorities that our operations exceeded any existing emission standards.\n\nIn the past several years, we have invested over $10 million upgrading on the res side to continuously improve our environmental performance. Also, we have previously initiated our voluntary participation in Mexico's federal clean industry certification program. These efforts are part of our commitment to the community that we believe GrafTech has demonstrated in its long history in this area. We strongly disagree with the conclusion to suspend our operations and we believe this measure is in no way commensurate with the findings of the state inspectors.\n\nFurther, we do not believe a suspension notice should legally be applied to this situation. While we are complying with the suspension notice, we are vigorously defending our rights to resume operations. To that end, we are pursuing all available legal remedies as well as engaging in dialogue with the respective state and local authorities involved in these matters. As I mentioned in my introduction, Monterrey is currently the only site that produces the pin stock needed for all our electrodes.\n\nEach electrode requires one pin to be utilized by our customers. We are actively pursuing multiple alternatives and mitigation strategies as it relates to internal production and external sourcing of pin stock. These include accelerating a potential restart of our St. Marys, Pennsylvania facility.\n\nAs many of you know, our St. Marys site was previously a full-scope electrode and pin production facility. Production at St. Marys was rationalized at the time of lower demand in the electrode industry.\n\nOver the last few years, we resumed operation of certain functions at St. Marys. We are now actively pursuing approvals for operating permits to restart the facility for pin production. With these permits and an incremental investment of about $8 million, St.\n\nMarys will be able to resume operations, supplying 100% of the pins for GrafTech electrodes. We expect that any MAX mitigation activities, including this potential restart of St. Marys will take the first half of 2023 to be fully implemented. However, until our Monterrey operations are resumed or our St.\n\nMarys facilities operational or other mitigation activities are successfully implemented, our ability to fulfill customer orders will be significantly impacted, particularly as we get into the next year. The impact will be less significant for the fourth quarter as existing pin stock inventory is supporting our ability to fulfill most customer needs in the near term. For next year, if Monterrey remains suspended, sales volume will be reduced by 50% or more in the first half of 2023 compared to the first half of 2022, but will recover after that. We expect to be able to meet our LTA commitments throughout 2023.\n\nAs we move into the second half of 2023, assuming our mitigation activities related to pin production are fully implemented and depending on market conditions, we anticipate that sales volume levels will recover. With over $130 million in cash on hand as of today, we have ample liquidity to see us through all reasonable scenarios. Also, there has been no impact on our ability to borrow under our existing facility, on our borrowing costs or on our borrowing needs. While we are deeply disappointed with the current situation and the uncertainty that it has caused, we believe that ultimately, the reason and the rule of law will prevail and our Monterrey facility will resume operations.\n\nAs I said at the start, looking forward, we remain optimistic about the longer-term outlook for our business. We have a great team and sustainable competitive advantages. We will be able to leverage these competitive advantages to capitalize on long-term industry tailwinds generated by the steel industry's efforts to decarbonize. I will provide further comments on our outlook at the end of our prepared remarks, but let me first turn the call over to Jeremy now who will be followed by Tim as we provide commentary on our third-quarter performance.\n\nJeremy Halford -- Chief Operating Officer\n\nThank you, Marcel, and good morning, everyone. I'll start my comments with a brief update on health and safety excellence, which is a core value at GrafTech as people are our most important asset. While our overall performance in this area continues to place us in the top quartile of operators in the broader manufacturing industry, our year-to-date reportable incident rate does not meet our high standards. We will continue to emphasize the need for further improvement in this area as safety must be fundamental to everything we do.\n\nWe remain steadfast in working toward our goal of zero injuries. Let me now turn to Slide 5 for an update on steel industry trends as context for our third-quarter results. During the third quarter, we saw further softening of key performance indicators for the steel industry. In the third quarter of 2022, global steel production, excluding China, was 198 million tons, representing a 9% decline compared to the same period in the prior year.\n\nGlobal capacity utilization rates declined to 64% commensurate with a lower production. These third-quarter data points represent the lowest such production and utilization levels in the past eight quarters for the global steel industry. We continue to see diverging steel industry trends in different geographic regions. This includes weakness in Europe as macroeconomic conditions further deteriorate in large part due to the ongoing conflict between Ukraine and Russia.\n\nConversely, U.S. trends remain comparatively healthier and more stable, although utilization rates have softened somewhat in the most recent periods. Turning to our third quarter performance, starting on Slide 6. Our third-quarter production volume was approximately 38,000 metric tons, representing a 5% year-over-year decline and a 14% sequential decline from the second quarter.\n\nDuring the third quarter, we executed our planned annual maintenance work at our two European facilities, which drove the sequential decline. The suspension of our Monterrey operations had only a modest impact on our production volume for the third quarter. We sold approximately 36,000 metric tons of graphite electrodes in the quarter, which is an 18% decline from the third quarter of 2021. Along with softening electrode demand driven by the current macroeconomic conditions, the suspension of our Monterrey operations contributed to the year-over-year decline in sales volume.\n\nSpecifically, approximately 4,000 metric tons of predominantly non-LTA customer orders that were scheduled to ship from our Monterrey location at the end of the third quarter were delayed to the facility suspension that began in September. Third-quarter shipments included 23,000 metric tons sold under our LTA at a weighted average realized price of $9,400 per metric ton, and 13,000 metric tons of non-LTA at a weighted average realized price of $6,000 per metric ton. This non-LTA pricing represented an increase of more than 30% compared to the third quarter of 2021 and was in line with the first half of 2022 consistent with the expectations we provided on our most recent earnings call. Net sales in the third quarter decreased 13% compared to the third quarter of 2021.\n\nThis reflected the lower sales volume and a shift in mix from LTA to non-LTA business, partially offset by the higher non-LTA pricing. FX also had a slight unfavorable impact on our net sales performance during the quarter, reflecting the strengthened U.S. dollar versus the euro and Japanese yen, as a portion of our sales are denominated in these and other foreign currencies. However, the FX top-line headwind was more than offset on the bottom line by a benefit to COGS related to euro-denominated spending in our European operations.\n\nAs we move through the fourth quarter, we expect our weighted average non-LTA pricing to remain comparable to the year-to-date level of approximately $6,000 per metric ton. However, we anticipate a further sequential decline in our sales volume for the fourth quarter, reflecting softness in the graphite electrode demand due to current market dynamics we have discussed. In addition, the suspension of our Monterrey operations will constrain our electrode and pin production capabilities, impacting our ability to fulfill certain customer orders. As referenced in our press release this morning, we expect this constraint will have an impact on our fourth-quarter sales volume in the range of 10,000 to 12,000 metric tons.\n\nFactoring all of this in, we anticipate our total graphite electrode sales volume for the fourth quarter will be in the range of 25,000 to 28,000 metric tons. Let me now turn it over to Tim to cover the rest of our financial details.\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nThanks, Jeremy. Net income totaled $93 million in the third quarter or $0.36 of earnings per share. Adjusted EBITDA was $129 million, a decrease of 25% compared to the third quarter of 2021, reflecting the lower sales volume and higher year-over-year costs. Adjusted EBITDA margin was 42% in the third quarter of 2022.\n\nLet me expand briefly on costs. We continue to be impacted by global inflationary pressures, most notably for certain raw materials, energy and freight. For the third quarter, we experienced a year-over-year increase of approximately 24% and recognized COGS per metric ton, excluding depreciation and amortization. Although this represented a 5% sequential increase compared to the second quarter of 2022, this was below our previous estimate of a 7% increase.\n\nAs we look ahead, we expect sequential cost inflation persist at a similar 5% rate in the fourth quarter on a cost per metric ton basis as higher-priced inventories sold during the quarter. This also factors in the absorption of certain fixed costs related to our operations in Monterrey. For 2023, if Monterrey will remain suspended, we anticipate further significant cost increases for at least the first half of the year, primarily reflecting cost to execute the previously discussed mitigation strategy related to producing pin stock, as well as incremental absorption of certain fixed costs due to the anticipated decline in 2023 sales volume. We continue to focus on prudently managing our operating and discretionary spending as we navigate the near-term challenges in the operating environment.\n\nTurning to cash flow. In the third quarter, we generated $68 million of cash from operations and $52 million of adjusted free cash flow. Both measures decreased compared to the third quarter of 2021, reflecting higher working capital and lower net income. The year-over-year increase in cash used for working capital reflected a timing-related decline in accounts payable and increase in inventory driven primarily by higher costs.\n\nTurning to Slide 8. During the third quarter, we opted to retain our free cash flow and did not make a voluntary prepayment on our term loan. This was done to support the financial flexibility as we continue to navigate near-term challenges including the suspension of our Monterrey operations. Our gross debt to adjusted EBITDA ratio was 1.5 times as of September 30, as compared to 1.6 times at the end of 2021.\n\nOn a net debt basis, we ended the third quarter at a ratio of 1.3 times. During the quarter, our total liquidity increased to approximately $435 million, consisting of $109 million of cash on hand and $326 million available under our revolving credit facility. As of today, our total liquidity has further increased now and is now over $450 million. As Marcel previously indicated and as we look forward, we have ample liquidity between cash on hand and the availability under our existing credit facility to navigate this challenging situation.\n\nNow turning to Slide 9. Maintaining a prudent disciplined capital allocation strategy remains a long-term priority. This includes reducing debt to further strengthen our balance sheet and support our strategic flexibility while also returning capital to our stockholders and investing in our business. While we elected not to pay down our debt or repurchase stock in the third quarter, a significant portion of our cash flow generation has been utilized for these purposes on a year-to-date basis.\n\nIn the first half of the year, we reduced our term loan balance by $110 million, and we repurchased $60 million of our common stock. Combined, these activities account for nearly three-quarters of our free cash flow generation through the first nine months of the year. In addition, we continue to expect our 2022 capital expenditures to be in the range of $70 million to $80 million, although the composition of our spend has somewhat changed to reflect our current priorities. This includes an acceleration of investment to support the restart of St.\n\nMarys, as Marcel previously discussed. We will remain prudent in managing our capex spend prioritizing those projects with the highest return on investment. Now let me turn it back to Marcel for his perspective on the outlook.\n\nMarcel Kessler -- Chief Executive Officer\n\nThank you, Tim. As we have indicated, the current environment for the steel industry remains in flux. Global steel prices continue to retreat from recent highs and global steel production, excluding China, has declined 5% year to date compared to 2021. As Jeremy indicated, we continue to see the working steel industry trends in different geographical regions, but indicators for nearly all regions have softened since our last earnings call.\n\nAs a result, while we remain bullish on graphite electrode demand over the long term, the outlook for 2023 is more cautious. The near-term outlook is further challenged by the cost pressures that Tim spoke to which we expect to peak for our business during 2023. In addition to the current suspension of our Monterrey operations, the ongoing shift in mix from LTA to non-LTA business creates another near-term headwind. While these challenges are clearly significant, we remain confident in our ability to overcome the near-term headwinds and are optimistic about the longer-term outlook for our business.\n\nWe are pursuing all avenues and remain confident in our ability to achieve a resumption of our Monterrey operations, and we are aggressively working toward multiple mitigation strategies at the same time. Given that the Monterrey suspension is at least in part of matter, we won't be able to provide much more information during the Q&A beyond what I laid out in my opening comments. However, we hope to be able to provide more detail and clarity on the situation as soon as possible. As we progress, we will continue to align our operating and capital expenditures with the current environment.\n\nWe remain committed to maintaining a strong balance sheet and have ample liquidity to see us through the near-term challenges. Longer term, we continue to expect the steel industry's efforts to decarbonize will drive the continued shift to electric arc furnace steelmaking supporting long-term demand growth for graphite electrodes. The recent announcement of planned EAF capacity additions by steel producers globally, excluding China, could result in an annual incremental graphite electrode demand of over 200,000 metric tons by 2030. The actions we are taking to invest in our product and service capabilities will optimally position us to benefit from that demand growth.\n\nOur vertical integration into petroleum needle coke production through our Seadrift facility is a critical differentiator from our competitors and foundational for our ability to deliver high-quality graphite electrodes. In closing, when I first spoke to you a quarter ago, I shared the reasons I was excited to join GrafTech. It's industry-leading position, a distinct set of capabilities and competitive advantages and a talented and dedicated team that is committed to serving our customers. All of this is still in place today.\n\nIn fact, the results I have seen in our employees over the past couple of months makes me proud to be part of the GrafTech team. I am confident in our ability to deliver shareholder value over the long term. That concludes our prepared remarks. We will now open the call for questions.\n\nOperator\n\n[Operator instructions] First question comes from David Gagliano at BMO Capital Markets.\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nSo I just had a few clarification questions. First of all, on the pin situation, every graphic electrode needs to pin and the commentary was volume down 50% if things don't change in Monterrey. So I'm assuming that the pins are being purchased from a third party, is that correct?\n\nMarcel Kessler -- Chief Executive Officer\n\nSo as I indicated in my prepared remarks, the impact for Q4 will be modest because we do have quite a bit of existing inventory. Beyond that, we are actually exploring various mitigation strategies. So I talked about the restart of St. Marys.\n\nWe are also looking at producing pins at European facilities, and we are looking to procure third-party pin stock.\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nOK. So what -- so what needs to happen for volumes to only be down 50% in the first half of those options, if that makes any sense? I'm trying to figure out how much of that is already capable of being produced versus how much do you have to actually figure out where you're going to get the pins for to produce it.\n\nMarcel Kessler -- Chief Executive Officer\n\nJeremy, do you want to take that one?\n\nJeremy Halford -- Chief Operating Officer\n\nSure. Yes. Thanks, Marcel, and thanks for the question, David. The substantial majority of the pins that are required to achieve what we're talking about are already in inventory in one form or another.\n\nSo this is not something that we are going to be dependent on third parties or some other source for achieving the level of achievement that Marcel talked about. We have a substantial amount of inventory. We have kept a substantial amount of inventory all the way along of pins and pin stock, and we will be processing that through the other facilities in order to achieve what Marcel was talking about.\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nOK. And then just on the restart of St. Marys just for pin production. What -- there was a commentary around -- well, there's -- I have a few follow-ups here.\n\nFirst of all, if for whatever reason, St. Marys doesn't restart permits or whatever -- and I don't know how much of an issue that is, what would happen the second half volumes of '23? That's one of the questions. And then the other question, there was a commentary that volume should improve in the second half. And is that on the assumption that St.\n\nMarys restarts and that's why volume should improve in the second half of '23? And then the third question regarding St. Marys, at least, from my seat is why not this restart everything? What's the difference in terms of capital cost and permitting and restarting graphite electrode production in St. Marys as well?\n\nMarcel Kessler -- Chief Executive Officer\n\nSo let me tackle the first two, and then we'll get back to the third question. So with regards to the second half, we feel confident that a combination of our mitigation strategies will be in place that will lead to production and sales volume recovery. So it will be the restart of St. Marys and/or the starting of pin production at one of our European facilities and/or the securing of sufficient third-party pins.\n\nSo it is not so dependent on the St. Marys' restart. And then I would also like to reiterate our confidence that we think we will believe that Monterrey will reopen.\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nOK. And regarding restarting all St. Marys?\n\nMarcel Kessler -- Chief Executive Officer\n\nSo with regards to restarting all of St. Marys, that's clearly something we are investigating. It will require a different set of permits that would likely take longer, and will also require additional incremental spending. But I think we are clearly on track to go there as well, but we probably won't be able to see that come to implementation before 2024.\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nOK. OK. And then just switching gears to the costs. I have no idea what a pin costs in the public domain or in the whatever domain pins are traded.\n\nBut my question is just generally speaking, we got the 5% per unit cost increase for the fourth quarter of 2022 quarter over quarter. In the first half of 2023, if Monterrey say shut given all the fixed cost absorption and things like that, what's a reasonable range for expectations there for unit cost increases in the first half of 2023, say, for example, versus 4Q 2022?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nYes, Dave. So just on the cost side, right, we continue to work through the mitigating strategies that Marcel says. And obviously, we'll have to continue to work through the economics of each of those because they do vary by strategy. So I'm not going to provide any more guidance at this point in time on what we think the 2023 costs look like.\n\nBut I think the other thing to take into consideration is, is that fixed cost absorption, right? So with sales volume down fixed costs at our existing operations being spread over that volume, that will have an impact as well beyond the 5% that we're talking about kind of on a normalized inflationary run rate that we look like. But I think just talking about costs for a second, more broadly, we're seeing inflation into the fourth quarter. Certain areas, we'll probably see some inflation into 2023. But on the flip side, we are starting to see some moderation in some of the key areas of our business, whether it's the underlying brent price for D CAN oil, we think we're starting to see favorability on freight rates.\n\nThe routes that are important to us are starting to show some downward trends which we would expect to continue, as well as longer-term pitch pricing some of the raw materials we've talked about in the past.\n\nOperator\n\nNext question comes from Arun Viswanathan of RBC Capital Markets.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nI guess the first set of questions is just around some of the market developments. So spot prices now have kind of hovered around the $6,000 per ton range. Where is needle coke? And I guess, how do you see the spot price evolving from here? Steel prices have also kind of continued to modestly move lower or consistently move lower. Yes, how should we think about kind of the price evolution in the electrode and needle coke markets from here?\n\nJeremy Halford -- Chief Operating Officer\n\nYes. Thanks, Arun. We've really seen needle coke prices really be pretty resilient. We've seen tracking the import statistics.\n\nWe've seen continued transaction somewhere in the high $2,000s. I think we had put a high end of the range around $2,900 last time we spoke. We're still in that range, maybe a very small amount of moderation, but still in that $2,700, $2,800 a ton. And as we look forward, as you know, we expect to see continued acceleration for demand in needle coke driven by, on the one hand, more graphic electrode demand from the growth in EAF steelmaking.\n\nBut as we've talked about a couple of times, rapid growth of needle coke demand for use in the electric vehicle industry, where graphites the key material used in lithium-ion battery anodes.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nOK. So it sounds like needle coke should continue to move modestly higher because of strong demand. OK. And then again, so how does that translate to the electrode side? I mean, should we kind of just keep in mind that 3:1 rule of thumb? Or is it unlikely that electrodes would be as resilient because maybe there's some excess supply? Or how should we think about how electrode prices should trend?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nYes, Arun, I think as you look forward, I think those rules of thumb probably hold true longer term. And as needle coke prices trend upwards, we would see an upward demand or upward push on electrode pricing as well. I think in the short term, I think you have a bit of a dislocation because of, call it, the global uncertainty that's in the market right now, particularly in Europe, where those rules of thumb don't always hold true in the very near term. So you may have a little bit of short-term dislocation.\n\nBut I think over the long term, upward trends in needle coke pricing will drive electrode pricing higher.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nOK. And then maybe you could just help us understand or get your perspective on contracting. Unfortunately, the Monterrey facility is not running full out. So your volumes are going to be down in the first half.\n\nAnd so maybe that limits the kind of commercial opportunities that you can put forward to your customers, is that true? And are you kind of now operating more at a kind of shorter time frame, maybe one to three months of visibility? Or how are you thinking about setting up the next couple of periods of the order book? Is there other options for you in front of you?\n\nJeremy Halford -- Chief Operating Officer\n\nYes, thanks. It's an important question, Arun. And one of the things that I want to make clear is that while we need to consider the near-term supply constraints related to the Monterrey situation, none of this changes our commercial strategy. We continue to believe that we are unique in the market in our ability to offer a variety of different contracting terms to our customers.\n\nthat's supported by our vertical integration, and that's a key differentiator, our ability to provide that certainty to our customers. And while in the very near term, we're dealing with the Monterrey situation, we have absolute confidence in our ability to resolve this current environment we're in, and it's not changing our commercial strategy at all.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nOK. And then lastly, just there are some -- you've called out weakness in Europe now for a couple of quarters, and it sounds like it has continued to remain weak and potentially even worsen in Q3 and Q4. What is it going to take for that market to improve? And is that one of the main things you guys are watching? Or are some other regions more important? And just curious if this does continue, how do you think about your own footprint, just given that you do have a lot of production over there? And are there options to, again, start-ups in some of your other facilities a little bit quicker or shift production there? What's your outlook for Europe and when this kind of starts to improve?\n\nMarcel Kessler -- Chief Executive Officer\n\nSo with regards to the outlook in Europe and how that will be resolved, I think much changes on the conflict in Ukraine. It creates so much uncertainty for the European economy overall. And for energy prices in Western Europe, in particular, right? I think that the key resolution point would be an easing or resolution of the conflict in Ukraine. And obviously, we are not able to make any predictions around that.\n\nWith regards to our operating footprint, I think in the short term, we are obviously dependent on our European manufacturing sites. Until we have been able to restart St. Marys first for pin production and then in the medium term, hopefully, for electro production as well. Now we do take some solace in the fact that our electrodes factories in Europe are some of the most efficient and especially energy-efficient ones out there.\n\nOperator\n\nNext question comes from Alex Hacking at Citi Research.\n\nAlex Hacking -- Citi -- Analyst\n\nThanks for all the color on Monterrey. That was quite helpful. Let me ask Dave's cost question maybe a slightly different way. Roughly what percentage of your overall cost structure today is fixed versus variable?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nThanks, Alex. Yes. So consider roughly a third if you think about it in broad strokes, is the way I would think about that. Now obviously, we do have the opportunity over extended periods of time to adjust that fixed cost structure, right? But that's the way I would think about it kind of from a broad brush perspective.\n\nAlex Hacking -- Citi -- Analyst\n\nOK. That's very helpful. On the Seadrift needle coke side. Like if my math is correct and you're selling 50% electrodes in theory, you would have excess needle coke.\n\nCan you sell that into the marketplace?\n\nMarcel Kessler -- Chief Executive Officer\n\nIt's something that we are considering. Yes. Short answer, but we can't give you any specific estimates around that at this point.\n\nAlex Hacking -- Citi -- Analyst\n\nOK, sure. And then just another one on Seadrift, if I may. If I remember correctly, the decant oil hedges kind of roll off around the end of this year, I think. What's the -- is that correct? And what's the incremental cost impact as moved to spot pricing next year?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nYes. So the hedges at -- the hedge effect stopped in the midpoint of this current year, and we'll see the P&L effect roll through the first two quarters of next year. You're probably looking at somewhere about $100 a ton, give or take, on the hedge benefit that will be will be gone after the second quarter of next year.\n\nAlex Hacking -- Citi -- Analyst\n\nOK. A couple more. I apologize for peppering your questions. On the electrode market, if you're down to 50%, that's 80,000-ton annual rate of electrodes that's gone from this market, right? It's 800,000 tonnish market ex China, if my memory is correct.\n\nI mean, are your customers expressing concern about their ability to source electrodes in this scenario? Is the electrode market potentially tightening up because of this?\n\nMarcel Kessler -- Chief Executive Officer\n\nSo it's an excellent question. Now given the weakness especially in Europe, but also more broadly around the world with -- in the steel markets that we've spoken to. I think that we don't really see any short-term tightness. In addition, given the slowdown that we have seen in the industry, the inventories that many of our customers are actually up significantly, so which gives them quite a bit of buffer.\n\nSo I don't think there's unlikely to be a shortness in the market in the first half of 2023. Jeremy, anything you could add to that?\n\nJeremy Halford -- Chief Operating Officer\n\nNo, I think you hit the key points, right? We see a reasonable amount of inventory being held by our customers given the softness that they've been experiencing, and that will bridge through any tightness that we would be creating in the near term.\n\nAlex Hacking -- Citi -- Analyst\n\nOK. And then all these answers are very helpful. I appreciate it. And then just final one.\n\nI think the answer here is no. Are there any covenants on any of your debt tied to EBITDA or anything like that?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nYes. Just going back and kind of reiterating what Marcel said in the opening commentary, no impact on our ability to borrow as it exists today, our cost of borrowing. So we're in good shape from a liquidity perspective at this point in time.\n\nAlex Hacking -- Citi -- Analyst\n\nBut there's no covenants or anything like that, right, just to be clear?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nI mean we haven't got some are covenants, and we've laid those out in the 10-Q. We have a springing covenant on our revolver that isn't in jeopardy at this point in time.\n\nOperator\n\nNext question comes from Curt Woodworth of Credit Suisse.\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nWith respect to the Monterrey process, I realize maybe there's limitations in what you can say. But just in terms of the legal precedents for issues like this or a time line of things to sort out this issue. Is there any more color you can say? And is it the type of thing where, depending on the outcome of the case you would just have to resolve an issue, pay a fine and restart? Or if you could just walk through maybe some of the more procedural dynamics, just to help us understand a little bit around timing and how we should think about it?\n\nMarcel Kessler -- Chief Executive Officer\n\nYes. So, Curt, I don't think we are able to provide a lot more detail on the legal path. I think it's important pointing out that I think our priority focus here is to resolve this through discussions with the Mexican authorities and regulators. And jointly developed agreed-upon plan for reopening, which will hopefully be -- we'll hopefully be able through that in the near term, right? I think any legal path that we are pursuing in parallel will likely take longer.\n\nI think that's all I can say. The priority is active engagement with the authorities, and we are doing that, their ongoing active conversations on a regular basis to make sure that we can agree on a plan to reopen.\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nOK. Understood. And then with respect to your energy position, I think my understanding that was about 15% of COGS last year with most of that. I think two-thirds power, and I believe you entered into fixed-price annual power contracts, so you're relatively hedged for the year.\n\nCan you give us any sense of have you entered into four power price agreements for next year? Are you going to be more exposed to spot and just given where the energy curves are today? Can you provide any color on what the potential year-on-year impact on your energy cost of goods sold would be for next year?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nYes. Thanks, Curt. Yes, your recap of what we've said in the past is spot on in terms of about 15% of our total cost and two-thirds of that is power versus natural gas. So we do move into next year, and I think we previously commented that we were less fixed as we head into next year that is.\n\nSo where we sit today, we're about 50% fixed on our power needs in our Pamplona and facilities and about 25% fixed on our natural gas needs heading into next year, and we continue to work through opportunities to further lock in some of those power prices. And I think more broadly, as we look at that European power market, we saw prices peak back in August and have come down significantly here over the last, call it, 60 days or so, and we're probably sitting around $120 a megawatt hour now. So it's an improvement from where we were. Certainly, there's still a long way to go in Europe with respect to power prices.\n\nBut we continue to manage it. We continue to work with our vendors and third parties to try to lock up as much of that as we can.\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nAnd can you just give us any perspective on dollar -- magnitude of dollar cost increase given where the spot price is today, just to help us calibrate our models, if not --\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nI guess what I would offer without getting into specifics of projecting out next year's cost, I mean, what we've locked in is a rate commensurate with what we have this year.\n\nOperator\n\nThe next question comes from Matt Vittorioso at Jefferies.\n\nMatt Vittorioso -- Jefferies -- Analyst\n\nJust thinking about cash flow for 2023. Obviously, we've all got to do some work on our models for 2023 EBITDA given some of the moving parts on the cost side, but just thinking about capital spending, you talked about being able to potentially flex that. So wanted to see what you thought you could bring capex down to in 2023. And along those lines, are there costs associated with restarting Monterrey, if you got to go ahead sometime in the first half of '23 to restart Monterrey? Is there cost to take that out of some sort of cold idle? Or how do we think about bringing that facility back online from a capital perspective?\n\nJeremy Halford -- Chief Operating Officer\n\nThanks. Maybe I'll take the first half of that, which was your question about bringing Monterrey back from a cold idle to fully restart it, then I'll hand it over to Tim to talk about the balance of it. The quick answer is that no, there shouldn't be a disproportionate amount of costs associated with bringing it out of -- bringing it out of its current idle mode. We have assets that were behaving the way that we expected them to and we would look to restart them exactly as they were.\n\nAnd so there's no extended warm-up period or anything like that, as you might see in other large capital asset businesses. So I wouldn't anticipate any substantial cost increases associated with that.\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nYes. Maybe I would just add more broadly on capital, right? We're saying this year, we're going to spend $70 million to $80 million, and we've talked about kind of what makes up that in the past. I think -- on a normal run rate basis, our sustaining capital or maintenance capital is probably in that $50 million to $60 million range. And certainly, we have the ability kind of within that number, right, to flex that down further to the extent that we need to do that.\n\nBut I think it's important and we'll continue to make investments in kind of our key projects as we move forward beyond what Jeremy just talked about in St. Mary's in particular, we've got some projects in Pamplona that will significantly reduce our natural gas consumption and lower our overall cost input as we move forward. And both of those projects are ongoing now and will continue into next year. So it's a balance of what we need to spend money on, just to keep the plants running in an efficient and safe manner, as well as those that generate a big ROI and balancing cash needs as well.\n\nMatt Vittorioso -- Jefferies -- Analyst\n\nThat's helpful. And then I guess just big picture on the capital allocation going forward, you did highlight that debt reduction will remain a priority. And clearly, given the volatility we're going to see in earnings over the coming 12 months that makes a lot of sense, I would think, share buybacks maybe on the shelf for at least the time being. But on the debt reduction side, at times, your bonds have traded into the mid-70s.\n\nWondering if that might be an avenue to pursue debt reduction buying back bonds at a discount, is that something you would consider?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nYes. I mean I think when we broadly think about capital allocation, we look at what is best for the organization and more broadly, our shareholders at large. And certainly, if there's an opportunity to take debt out at a discount. You look at that, but you weigh the cost benefit of pulling forward nearer-term maturities.\n\nSo I think what's important is that commitment we have to our shareholders and stockholders for a disciplined approach. You said it, we're going to continue to focus on the balance sheet. I think frankly, the work we've done over the last two years gives us the confidence to maneuver and work our way through the challenges that we're facing right now, and that's why we've done what we've done in the past. So right now, I don't think there's any plan to change that strategy on a longer-term basis.\n\nMatt Vittorioso -- Jefferies -- Analyst\n\nAnd do you guys have a maybe just a big picture target for what you're saying debt reduction is a priority? Steel, in general, is a volatile industry to participate in. Like how do you think about the right amount of debt for this enterprise over the long run?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nYes. I mean, again, I think we've been pretty consistent in the past when we've said our leverage target is no more than 2.5 times -- 2 to 2.5 times. And right now, our current leverage is 1.5 times on a gross basis or 1.3 times on a net basis. So we feel like we're in a good spot.\n\nWe kind of stick with that target. Longer term, we think that allows us to kind of work through any cycles that the steel industry has and positions us well with a strong balance sheet going forward.\n\nMatt Vittorioso -- Jefferies -- Analyst\n\nGreat. And maybe just one more quick one. On the cash flow front for 2023, again, lots of moving parts. I understand it's hard to pin things down.\n\nBut as we think about volumes coming off meaningfully and just the business not necessarily operating under its normal course, any working capital implications from that -- from these disruptions in one way or the other, either positively or negatively impacting cash flow, anything that jumps out at you?\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nYes. I don't want to comment on 2023 at this point in time. I think we've given some kind of directional indicators as the way we think '23 is shaping up absent the restart of Monterrey. But certainly, we think in the first half of the year, when volumes are down and then they pick up in the back half of the year, that will have an impact on working capital.\n\nIf we look out to the fourth quarter, right, we talked about the volume decrease that we're expecting in the fourth quarter. So we're going to be carrying some additional inventory in the back half or in the fourth quarter. So I would say working capital is relatively flat as we head through the fourth quarter.\n\nOperator\n\nThis concludes our question-and-answer session. I will now turn the call back over to Mr. Kessler for closing comments.\n\nMarcel Kessler -- Chief Executive Officer\n\nThank you, operator. I would like to thank everyone on this call for your interest in GrafTech, and we look forward to speaking with you the next quarter. Have a great weekend, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Dillon -- Vice President, Investor Relations\n\nMarcel Kessler -- Chief Executive Officer\n\nJeremy Halford -- Chief Operating Officer\n\nTim Flanagan -- Chief Financial Officer, Vice President of Finance, and Treasurer\n\nDavid Gagliano -- BMO Capital Markets -- Analyst\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nAlex Hacking -- Citi -- Analyst\n\nCurt Woodworth -- Credit Suisse -- Analyst\n\nMatt Vittorioso -- Jefferies -- Analyst\n\nMore EAF analysis\n\nAll earnings call transcripts"
}