{
  "companyName": "AECOM Technology",
  "companyTicker": "ACM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/aecom-technology-acm-q3-2022-earnings-call-transcr/",
  "content": "AECOM Technology (ACM -0.08%)\nQ3 2022 Earnings Call\nAug 09, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to the AECOM third quarter 2022 conference call. I would like to inform all participants; this call is being recorded at the request of AECOM. This broadcast is the copyrighted property of AECOM. Any rebroadcast of this information in whole or part without the prior written permission of AECOM is prohibited.\n\nAs a reminder, AECOM is also simulcasting this presentation with slides at the investors section at www.aecom.com. [Operator instructions] I would like to turn the call over to Will Gabrielski, senior vice president, finance, treasury, and investor relations.\n\nWill Gabrielski -- Senior Vice President, Finance and Investor Relations\n\nThank you, operator. I would like to direct your attention to the safe harbor statement on page one of today's presentation. Today's discussion contains forward-looking statements about future business and financial expectations. Actual results may differ significantly from those projected in today's forward-looking statements to the various risks and uncertainties including the risks described in our periodic reports filed with the SEC.\n\nExcept as required by law, we undertake no obligation to update our forward-looking statements. We use certain non-GAAP financial measures in our presentation. The appropriate GAAP reconciliations are incorporated into our materials, which are posted to our website. Any references to segment margins or segment adjusted operating margins will reflect the performance of the Americas and international segments.\n\nWhen discussing revenue and revenue growth, we will refer to net service revenue or NSR, which is defined as revenue excluding pass-through revenue. NSR and backlog growth rates are presented on a constant currency basis unless otherwise noted. Today's remarks will focus on continuing operations. Financial impacts from the previously announced exit of our operations in Russia are excluded from today's discussion.\n\nOn today's call, Troy Rudd, our chief executive officer, will review our key accomplishments, our strategy and our outlook for the business, Lara Poloni, our president, will discuss key operational successes and priorities; and Gaur Kapoor, our chief financial officer, will review our financial performance and outlook in greater detail. We will conclude with a question-and-answer session. With that, I will turn the call over to Troy Rudd.\n\nTroy Rudd -- Chief Executive Officer\n\nThank you, Will, and thank you, all, for joining us today. I want to begin by acknowledging the unwavering commitment of our professionals to our clients and to our shared purpose of delivering a better world. We take great pride in what we do. To that point, we are proud to have once again been ranked as the No.\n\n1 company in our industry on Fortune's World's Most Admired Company list, and have recently been recognized as one of the World's Most Ethical Companies by Ethisphere. I'm also pleased to report that this month's Engineering News Record affirmed our ranking as the No. 1 environmental engineering services firm. placing us well ahead of our professional services peers.\n\nOur teams are the best in the industry. A great example of this is the nomination of Shailen Bhatt by President Biden to lead the Federal Highway Administration. Shailen is a great industry talent and reflects the caliber professionals that reside at AECOM. The proof point of how the strength of our professionals translates to value creation using our EPS growth.\n\nWe grew adjusted EPS 31% last year and 28% year-to-date through the third quarter. Turning to the business, five key themes underpin our confidence. First, we are consistently delivering on our financial and strategic priorities. These include accelerating organic NSR and backlog growth, gaining market share, expanding margins and delivering strong per share earnings and free cash flow growth.\n\nI'm proud of the discipline our leaders have exhibited in balancing organic growth with margin expansion and profit growth while we continue to invest in the business. When you look around the industry, you can see these characteristics make us quite distinct. Second, our Think and Act Globally strategy has transformed how we operate and how we deliver by prioritizing collaboration and innovation and emphasizing return on time and on capital. This has translated into a record high win rate, design backlog and pipeline of opportunities.\n\nThird, our investments in digital advisory and program management have expanded our addressable market, deepened client engagement and enhanced the value of our technical capabilities. As a result, we are supporting clients more broadly across the life cycle of their investments and enhancing value for both us and our clients. Fourth, the markets in which we operate remain strong despite recessionary pressures. A global infrastructure investment renaissance, investments in environment, sustainability and resilience, and adaptation to a post-COVID new normal are secular mega trends that will continue to create growth opportunities for several years to come.\n\nFinally, our balance sheet is in great shape. This is a competitive advantage that creates certainty and allows us to deploy capital to drive value creation. Please turn to the next slide and a review of our financial performance. Organic NSR growth accelerated to 6% and was driven by a strong backlog, accelerating funding in our markets and strong execution.\n\nI should note that our growth does not yet reflect any material impact from IIJA funding, which I will discuss shortly. Importantly, we are driving increased profitability as revenue growth accelerates. Our adjusted operating margin was 14.6%, an increase of 50 basis points over the prior year. We are investing at a high rate to expand our capabilities and prepare for increased funding.\n\nOur margins remain the highest among our peers, which in turn maximizes the value of revenue growth. Adjusted EBITDA and adjusted EPS increased by 7% and 18%, which were both a little ahead of our expectations. Free cash flow was also strong at $183 million. On a year-to-date basis, our free cash flow increased by 15%, and on a per share basis increased by more than 20%.\n\nIn addition to the investments in organic growth, we've returned more than $400 million to shareholders so far this year. Over the past four quarters, we have returned cash equivalent to 6% of our market capitalization. As our results demonstrate, we have created competitive advantages that are differentiating our performance. Despite an unexpected market headwind from unprecedented U.S.\n\ndollar appreciation, we have raised the midpoint of our fiscal 2022 adjusted EPS guidance for the second time this year, and we have reiterated our fiscal 2024 financial targets. As we have consistently proven, our teams are agile and the inherent attributes of our business model and strategy result in a more predictable and resilient business. Please turn to the next slide. Now, turning to our backlog, key wins and pipeline.\n\nOur backlog in the design business, which accounts for 90% of our NSR and profit, increased by 10% and total backlog is now more than $41 billion, a 5% increase. This performance reflects our high win rate and our focus on pursuing and winning high-quality backlog. Our book-to-burn ratio in the quarter was 1.2 times, led by 1.5 in the Americas Design business. With this performance, there are a few key wins and trends that demonstrate the success of our strategy.\n\nTo that point, we were recently selected for a nine-figure program management contract for one of the largest greenfield transportation projects in the United States. Our bid emphasize collaboration across the business. In addition, we embedded key digital elements into our proposal, including the program management digital toolkit we announced last quarter to create a differentiated offering for the client. We also had several wins that showcase our sustainability and decarbonization initiatives in the transportation sector.\n\nWe were selected by the Arizona Department of Transportation to develop a statewide plan to deploy EV charging stations. In addition, we were selected by New Jersey Transit to provide design and engineering services to advance the agency's zero-emission strategy. Electrification and vehicle automation are key growth markets for AECOM, and we are leading with innovation. We have developed proprietary digital tools to accelerate growth.\n\nFor example, ev-readi is a tool to help clients integrate electrification of transit systems into existing infrastructure. These tools are in the market today, helping clients advance their strategies, which is furthering our reputation as a partner of choice. I'm also pleased to report that we were selected for a substantial water reuse project in California. Persistent droughts have pressured water supply, and this is a signature win that showcase our leadership in the water reuse market ahead of a substantial expected spend in the coming years.\n\nFinally, our leadership in the growing PFAS remediation market was reflected in a win to design a PFAS treatment system for the city of Madison, Wisconsin. We will be tailoring the design to match IIJA requirements and best position the project for future IIJA funding. This project is emblematic of a number of wins and opportunities we are pursuing, with smaller upfront work being awarded as our clients' position for the greater IIJA funding, now becoming available. Please turn to the next slide.\n\nTurning to trends across our markets. In the U.S., there has been $114 billion of IIJA funding announced as available, and notices of funding opportunities are accelerating. Consistent with our prior forecast, we expect funding will most meaningfully benefit our markets in fiscal 2023 and beyond. Today, clients are beginning to mobilize for this expected growth.\n\nWe can see this momentum in our pipeline where identified opportunities have increased by nearly 40%, and we expect bid submissions to accelerate in coming months as a result. The strength in federal spending is coming in an opportune time. Our state and local clients, which represent 23% of our NSR, are also in a strong position. Budgets are at record levels which creates a backdrop for predictable market growth for us against the broader market volatility.\n\nTurning to our international markets, in the U.K., we are benefiting from the key framework positions we have secured over the past several years, supporting strong growth in the quarter and confidence as we look ahead. In the Middle East, work is progressing on our large multiyear program management and design contracts for the substantial investments being made in NEOM and AlUla. We also grew in Australia and Hong Kong, where demand for large-scale transportation projects remain strong. However, in Mainland China, the ongoing uncertainties created by COVID policies continue to impact us, though we are managing through this with the performance of other parts of international business.\n\nBroadly across the business, we are delivering high-value organic growth in a highly disciplined way despite the ongoing fierce competition for talent in our industry. Our disciplined approach is resulting in profitable growth. Please turn to the next slide. As our results demonstrate, we are operating from a position of strength with great momentum in both our business and across our markets.\n\nOur investments in digital, advisory and program management have created new opportunities, differentiate us from peers and expanded our addressable market. Our deliberate capital allocation policy has resulted in strong shareholder value creation. We have not been distracted by risky and expensive M&A. Instead, our focus is squarely on executing our profitable growth strategy, as well as returning cash to shareholders through stock repurchases at a discount to peer and M&A valuations and our quarterly dividend program.\n\nUnderpinning all of this is our strong balance sheet, which is a competitive advantage. Taken together, we are well positioned for sustained growth and success, which supports our financial guidance for this year and through 2024. With that, I will turn the call over to Lara.\n\nLara Poloni -- President\n\nThanks, Troy. Please turn to the next slide. To echo your comments, our Think and Act Globally strategy has transformed how we operate and go to market in several ways. First, we have created a culture that inspires and demands collaboration, and as a result, we are collaborating like never before.\n\nWhen we pursue a must-win opportunity that can transform our position in the marketplace, we bring the totality of our global capabilities and experience to bear, which has resulted in a record win rate, market share gains and created a positive client feedback loop that is reinforcing this approach. Second, we are investing at high levels in the professional and technical development of our nearly 50,000 people. This includes regular technical academies where our experts share best practices and technical know-how to our teams. The result is even greater alignment on our vision and greater collaboration across disciplines.\n\nWe are ensuring our clients get the best of AECOM's capabilities every single time. Third, we are attracting and retaining the best talent in the industry. We emphasize the superior career opportunities at AECOM to meaningfully benefit clients and communities. In addition, we have enhanced our benefits, and we are supporting our employees' desire for increased flexibility through our Freedom to Grow initiative.\n\nI am pleased to report that our efforts are paying off. In a recent companywide survey, 75% of our employees said they would recommend AECOM as a Great Place to Work. Fourth, we are building our capabilities to address growing demand for environment, sustainability and resilience priorities. We are winning projects that reflect our multi-disciplined leadership in this area.\n\nA great example of this was our selection to provide environmental master planning services for the Greater Toronto Airport Authority. Our client is pursuing ambitious sustainability targets, and we are best suited to help them deliver. Across all pursuits, our focus on environmental improvements, positive social impacts, energy savings, productivity enhancements, digital solutions and overall efficiency are becoming instrumental in our success. And I am pleased that our leadership position in this area remains very strong.\n\nIn fact, last week, our No. 1 position in the environmental engineering and science markets were reaffirmed by Engineering News-Record, and we improved to the No. 2 environment firm overall, eclipsing all of our professional services peers. Finally, our growing suite of digital AECOM products and tools have deepened our engagements with our clients.\n\nFor instance, our proprietary IIJA digital tool is helping clients best position for specific funding programs, and is also allowing us to engage with clients earlier and more meaningfully in their programs. Importantly, our headcount of digital experts and data scientists is over 2,500 strong and growing. Few firms can bring innovative solutions at this scale to their clients globally so quickly which creates enduring competitive advantages. With a strong foundation in place and further progress on our strategic priorities, we are confident that AECOM will continue to lead the industry with our expectation of delivering growth over the long term.\n\nWith that, I will now turn the call over to Gaur.\n\nGaur Kapoor -- Chief Financial Officer\n\nThanks, Lara. Please turn to the next slide. We delivered another strong quarter, demonstrating the strength of our professionals and benefit of our Think and Act global strategy. Organic NSR increased by 6%, year-to-date adjusted EBITDA increased by 9%, and year-to-date adjusted EPS increased by 28%.\n\nOur margins were also strong and continue to lead our industry, reflecting our focus on high returning organic growth opportunities and our culture of continuous improvement. Year-to-date, our operating margin has increased by 60 basis points to 14% and we are on track to deliver at least 14.1% margin for the full year, consistent with our guidance. The underlying outperformance of the business gives us confidence to consistently deliver on our commitments. This performance and outlook further supports our expectation for approximately 6% NSR growth in fiscal 2022 across the company.\n\nPlease turn to the next slide. NSR growth in the Americas was 4% with strength across the business. We also had 1.5 book-to-burn ratio in the design business and contracted backlog increased by 19% in the Americas. Our wins and pipeline were strong.\n\nAnd when combined with the expected increase on IIJA funded projects and strong state and local budgets, we continue to expect NSR growth to accelerate into fiscal 2023 and beyond. With respect to profitability adjusted operating margin was 18.5%, which reflects strong execution and the high quality of our backlog. Please turn to the next slide. The International segment delivered 8% NSR growth, which included growth in all of our largest geographies.\n\nBacklog increased by double digits highlighted by Europe, Middle East and Australia. Contracted backlog also increased and is near a record high, which is a great leading indicator of growth. Margins expanded to 8.8%, up 150 basis points from the prior year. This was the eighth consecutive quarter of sequential margin improvement, reflecting tremendous progress on our goal of achieving a double-digit margin in this business.\n\nPlease turn to the next slide. Turning to cash flow, liquidity and capital allocation, our capital allocation policy is unchanged. We are investing at a high level in key initiatives to drive growth, expand margins and competitively differentiate ourselves. We are continuing to deploy substantially all available cash flow to share repurchases and dividends.\n\nDuring the quarter, we bought back 105 million of stock, and through the first three quarters, we have bought back nearly 400 million of stock. In total, we have now bought back approximately 25 million of shares over the past two years or more than 15% of our outstanding shares. Including our July payment, we have also paid more than 60 million of dividends this year. As a reminder, it is our intent to grow our per share dividend by a double-digit percentage annually for the foreseeable future.\n\nOur ability to deploy capital is supported by strong cash flow and balance sheet certainty. Operating cash flow was $205 million in the quarter and free cash flow was $183 million. Our business has inherent attributes that lend to consistently strong cash flows through cycles. These include a highly variable cost model, strong backlog visibility, a high-quality and diverse client base and a highly agile culture.\n\nAs such, we expect to achieve free cash flow within our guidance range for an eighth consecutive year. We also have a strong balance sheet, which creates certainty for us as debt markets and rates have been more volatile of late. We have a high degree of certainty on cost of 80% of our debt over the next several years, and we have no bond maturities until 2027. We believe our balance sheet is a competitive advantage.\n\nPlease turn to the next slide. Turning to our financial outlook. Despite unanticipated external headwinds, we are delivering. As a result, we are increasing our adjusted EPS guidance for 2022 for a second time this year, and we now expect to deliver between $3.35 and $3.50, which would reflect 21% growth at the midpoint.\n\nWe have also narrowed our adjusted EBITDA guidance to between $890 million and $910 million or 8% growth at the midpoint. While we could point to foreign exchange or other factors that are impacting the market, the business is outperforming our initial expectations. I should note that for modeling purposes, our NSR guidance is on a constant currency basis. but you should factor in approximately 300 basis points to your revenue forecast for the fourth quarter to reflect the impact of foreign exchange translation.\n\nThe impacts to margin and profitability are already captured in our guidance. We continue to deploy our strong cash flow to buy back our stock, though I will note that our guidance does not incorporate any benefit from incremental share repurchases we expect to execute in the balance of the year. Our accomplishments to date and favorable long-term market trends support our confidence in our long-term 2024 financial targets, including our expectations for at least 19% adjusted EPS CAGR from fiscal 2021 to 2024. With that, operator, we are ready for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from Sean Eastman of KeyBanc Capital Markets. Please go ahead.\n\nSean Eastman -- KeyBanc Capital Markets -- Analyst\n\nHi, everyone. Thanks for taking my questions, and nice quarter. I wanted to hone in on the win rates, which have been hovering around all-time highs all through this year. I mean, obviously, from a headline perspective, that sounds positive, but I wondered if this elevated win rate is optimal.\n\nI mean, particularly with end market activity levels continuing to accelerate. I wondered if perhaps the returns targets embedded in bids actually need to be raised as we go into next year.\n\nTroy Rudd -- Chief Executive Officer\n\nSean, thanks for the question. So there's certainly a balance to be struck in terms of what your expectations are and what you're focusing on. But I mean, no doubt a high win rate is an important thing because it allows us to maintain that balance for investing in the business and invest in the future and also finding that balance of improving our margins. So that's No.\n\n1. No. 2, is we're very deliberate in terms of what we're focused on. It's -- while our win rate is very high, a really important element to that is the quality of the backlog that we're winning.\n\nWe are winning projects that are complex, they are long in durations, they're for key clients. They're -- and differentiating ourselves by the level of importance in the communities that we're working in. And ultimately, those wins are momentum changing for the business. And again, not all wins are equal.\n\nAnd so, when we talk about that high win rate, we believe that's important because it talks to the -- our thinking about disciplined investing, but also again, the quality of the backlog is important because the things that we win change the momentum of the business and they have this flywheel effect that want more people to join, clients are more interested in what you're doing and it attracts larger and better opportunities. So we're focused on two of those elements, and that second element of quality backlog doesn't typically come through in the numbers we discuss, but it's an important element of what we're doing.\n\nSean Eastman -- KeyBanc Capital Markets -- Analyst\n\nAnd then I wondered just relative to the tight hiring environment, would you say this is becoming more or less of a concern as it relates to that being a governor on growth over the next 1 to two years versus, say, the start of the year?\n\nTroy Rudd -- Chief Executive Officer\n\nYeah, again, I would -- we think of it as a governor on growth, there's no question about that. Because while we're doing things to improve the way that we deliver and how we deliver so that we can create, again, more capacity in our people's days to work. There's no doubt that in our industry, there certainly is a constraint on experienced and seasoned professionals to deliver the work that we do. So we think about this in a couple of different ways.\n\nOne is we're entirely focused on investing in our people and creating the greatest opportunities for them. and we think about that, the employee value proposition to attract the best to the firm. And then, the other things we've been doing is, again, investing in digital to extend the capacity of what our people do. And then, we're working to invest in capability centers.\n\nSo we can become better at distributing the work around the network and become more efficient. And those are the three things we're focused on to try to address that constraint. But certainly, in the short term, it is a constraint. As we go forward, we expect that it will still be a constraint.\n\nBut in the world where people are saying we're in a recession or projecting a recession, that those conditions could change.\n\nSean Eastman -- KeyBanc Capital Markets -- Analyst\n\nOK and I'll just -- and I'll just sneak one more in. I mean, obviously, there's a lot of tailwinds in the business exiting fiscal '22, but I feel like we probably need to calibrate the model around the moves in FX rates so far this year. So this is maybe one more for Gaur, but what are the known kind of bridge items there going into fiscal '23? We have this 300 basis point drag on NSR from FX in the fourth quarter. How does that roll into next year? And are there any margin nuances associated with that that we should be aware of?\n\nGaur Kapoor -- Chief Financial Officer\n\nSean, thanks for the question. This is Gaur, I will respond to that one. You're right, FX has been a headwind for us in the third quarter, and we expect it to continue in the fourth quarter, put it into perspective for six months FX is a headwind of approximately $15 million. But as we said in our prepared comments, our operational outperformance during the year is allowing us to overcome it.\n\nIf it weren't for the FX headwind, we would be at the top end of our range we have provided, committed to. If you look forward and say, these spot rates will hold, there's no doubt it will be an impact to FY '23. But currently, we're going through our planning process. Can't really comment on what FY '23 bridge will look like, but in the coming quarter, we will definitely provide more clarity to it.\n\nSean Eastman -- KeyBanc Capital Markets -- Analyst\n\nOK, thanks, guys. I'll turn it over. Appreciate it.\n\nGaur Kapoor -- Chief Financial Officer\n\nSure. Thank you for your question.\n\nOperator\n\nOur next question comes from Michael Feniger at Bank of America. Please go ahead. Your line is open.\n\nMichael Feniger -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Thanks for taking my question. Just with -- you guys reaffirming the 2024 EPS target, $4.75, I know this just got touched on earlier. But just for the moving pieces for us to think about with next year and to get to 2024, is it smooth and linear for us to kind of get to that 2024 number? Obviously, you mentioned FX.\n\nShould we have to invest a little bit more, hire more people, invest in the growth that we could see even more in 2024 and get that operating leverage? I guess I'm just trying to think about where we are exiting this year and to that 2024 number, how we should kind of be thinking about the step-up over the next two years there.\n\nGaur Kapoor -- Chief Financial Officer\n\nSure. Michael, this is Gaur, I'll take that question as well. So we just reconfirmed our 2024 long-term targets. No additional comments specific to that.\n\nBut consistent with what Troy said earlier in his comments, we've really created a platform here that's providing us a competitive edge. And let me explain what I mean by that. Not only are we winning better than our share in the market, we're winning what we want in the market. We're operating at the top of our peer group in terms of execution of projects, delivering on margins and making strategic decisions on various other matters.\n\nA great example of that is capitalization of our balance sheet, where we have created certainty on interest costs and a capacity to use. And all these things are driving to that competitive edge that we want. And it's all backed by the investments we're making in the business to allow for sustained value creation.\n\nMichael Feniger -- Bank of America Merrill Lynch -- Analyst\n\nMakes sense. And I think I just -- I think this is -- my next question kind of touches on that. And Troy, you mentioned it a little bit earlier. We are seeing a very big step-up in M&A across the engineering space.\n\nEven last night, another one of your peers made another acquisition announcement. I mean how does AECOM view just the pickup in the sector broadly in acquisitions. Is AECOM missing out. Or do you feel you have enough of an investment and breadth to compete? And basically, are there any indirect benefits for AECOM as all this M&A is occurring for you just to go and deliver your strategy? Anything we should kind of be thinking about as we see all these acquisitions happening around you over the last 12 to 24 months?\n\nTroy Rudd -- Chief Executive Officer\n\nYeah, that's a great question. So first of all, we have confidence in the strategy that we've adopted. And I think that we've been showing, again, discipline in what we're doing, and it's coming through in our results. And I'll describe it a couple of different ways.\n\nFirst of all is that we think that investing in organic growth, and ultimately, that means investing in our people and our markets and our clients and doing things that create a long-term competitive advantage for us are the right things to do. And it's coming through in our results. And when you think about what we're trying to accomplish in the long term is, we're trying to be -- we're trying to again, to get the highest return that we can the capital that we invest. We're trying to do it with the least risk possible.\n\nAnd we believe that in this environment, invest in organic growth and returning to shareholders is the right way to go about doing that. And again, I'll just make this simple comment, which is I think our job is to create long-term competitive advantage. And when you create long-term competitive advantage, no matter how people are allocating capital, it pays off. And to create that long-term competitive advantage, we believe the right way to be doing this is into investing in our own business.\n\nAnd we believe that's again, the least risky way to do that. At the end of the day, how it pays off is it pays off in your EPS, your cash EPS CAGR. And when we compare ourselves to our peers that are doing M&A, we see ourselves as having the highest cash per share, EPS CAGR. And so, ultimately, it gets confusing when you look at companies doing M&A and how they're growing when you compare it to how we're doing it organically, but at the end of the day, we end up having a higher cash EPS CAGR.\n\nAnd then, another really important point is you said, does it impact your ability to compete? Well, heck, no. We're already No. 1 in the markets that we're in. And even with our competitors doing M&A, we reaffirmed our position.\n\nFor example, as the #1 engineering environmental engineering firm, and we increased that gap, surprisingly. So again, in terms of our ability, our need to do M&A to compete, we don't need to, because we're No. 1. Thank you for your question.\n\nOperator\n\nOur next question comes from Andrew Kaplowitz at Citi. Please go ahead.\n\nAndrew Kaplowitz -- Citi -- Analyst\n\nGood morning, everyone. Can you update us on what's going on in your international business in terms of margin, you've obviously recorded your highest margin segment this quarter. But as on NSR, that was the lowest so far this year. So we know you've been taking restructuring, I think, for real estate consolidation.\n\nIs that the biggest reason on a higher margin? If so, where are you in that progression, or is it more mix related?\n\nGaur Kapoor -- Chief Financial Officer\n\nYeah, Andy. This is Gaur, I'll take that question. The restructuring that we took, just to clarify, it's predominantly for our global business center where it's our captive center and we provide support services globally. It impacts all of our businesses.\n\nAnd there are some duplicate real estate IT costs as we renew leases that come through that are also going through it. But it's duplicate costs that are going through. Specific to the international margin question that you asked, that has been a focus of ours. We are being very tactical by investing in the business, PM and advisory opportunities, digital and focused execution where, again, probably going back to the last question that was asked, we're not interested in building scale just for the purpose of having scale.\n\nWe're interested in driving sustained shareholder value. And this is, again, a continuing result of what you're seeing, our commitment not only to get to double-digit margins in international, but just like we are in the Americas, to be the leader of the pack in margins as well.\n\nAndrew Kaplowitz -- Citi -- Analyst\n\nAnd Gaur, maybe I could ask you about free cash flow. Obviously, almost $330 million through Q3. I know you've said in the past that you're trying to smooth out cash over the quarters, but given just usual seasonality, wouldn't you be at the high end of the $450 million to $650 million if you deliver a normal Q4? And then just maybe a clarification on capital deployment. If this Inflation Reduction Act does pass, do you think there's a 1% excise tax on share repurchases.\n\nDoes that impact your behavior at all around repurchases?\n\nGaur Kapoor -- Chief Financial Officer\n\nSure, I'll take both of those questions on cash flow and on the tax repurchase tax. So first on the cash target, we've delivered on our cash commitments seven years in a row, and this year will be no different. We will deliver on it. Our priority is not only on delivering on that annual commitment, but making sure we have the best phasing possible so we can take advantage of our capital allocation strategy as efficiently as possible.\n\nAnd Andy, yes, our cash flow, if you look year-to-date is up 15% year over year because of that phasing. But we have 40,000 to 50,000 projects at any given point in time. It's not 10 or 20 that can really pull through and gives us the confidence that we will be in a certain place. But what we do have confidence, and like I said, we've delivered seven years in a row on our commitments either at or above our commitment, and this year will be no different.\n\nNow, specific to the tax repurchase tax. We're always going to be committed in investing in what provides the best shareholder value creation opportunity. And for us, that's looking at ROIC, it's looking at EPS growth to deliver the best TSR. Our stock continues to be undervalued, even though we have consistently outperformed our commitments.\n\nAnd we see no change in that. The plan put forth, no doubt is unfortunate. It impacts individual investors who own AECOM shares through investments with institutions. So it's a triple taxation.\n\nAnd let's see where it goes.\n\nAndrew Kaplowitz -- Citi -- Analyst\n\nAppreciate the color. Absolutely perfect.\n\nOperator\n\nThank you for your question. Our next question comes from Steven Fisher of UBS. Please go ahead.\n\nSteven Fisher -- UBS -- Analyst\n\nThanks. Good morning. Your contracted backlog was up double digits year over year, but it was down sequentially. I think some of that was FX and maybe some of the building construction business.\n\nI guess what's your take on the trajectory of the contracted backlog from here? And I know you've highlighted that as an important leading indicator for the business. So just curious what you're expecting going forward on that.\n\nTroy Rudd -- Chief Executive Officer\n\nYeah, Steve. Thanks for the question. Again, I think you actually made the important point for us is that contracted backlog is a leading indicator of the future. And so, again, we look forward and we think that certainly is going to be helpful as we exit the year and head into next year.\n\nBut there's a couple of other things that I think are important as well to indicate the future trajectory of the business. And one of those that we haven't spoken about is just pipeline. And we're constantly looking at how our pipeline is doing, giving us an indication of what the longer-term future looks like. And certainly, we're seeing our pipeline.\n\nIt's been increasing mid-single digits consistently over the last three quarters. But what's really interesting in that is that when we look at what we referred to as the part of the pipeline that we believe is moving to later stages. We see sort of a significant increase in that pipeline and what's moving to those to later stages that we're going to bid on in the relatively near future, and that has increasing at a faster rate. So when you take that combination together, an increase in pipeline and an increase in the things that we're going to be bidding on in the relatively near future and our contracted backlog, all of those things point to good long-term trends for our business.\n\nSteven Fisher -- UBS -- Analyst\n\nOK. That's helpful. I guess maybe to follow up there, to what extent does that pipeline commentary include the construction -- the building construction business? I guess I'm curious if that has maybe kind of bottomed from here? Have you kind of stress tested what that business could mean? I know it's only like 9% to 10% of overall revenues, but do you think it's now kind of maybe stable from here in the backlog, or do you see things in the pipeline that will actually get that to grow again going forward as well over the next handful of quarters?\n\nTroy Rudd -- Chief Executive Officer\n\nYeah, Steve, good question. Look, when I made in my comments, I was referring to the entire business, but I'll address CM separately. And the fact is, is that the backlog is a little lumpy as it grows. But nevertheless, in the quarter, our book-to-burn was one times, and that backlog has been growing consistently when you take out the lumpiness.\n\nBut to your point about what do we see in the future? Our pipeline in the Construction Management business is at an all-time high. And so, it's been increasing as well, consistent with what we see in the design -- the global design business. So that's -- again, that's also good news across our entire portfolio. And just a couple of comments around why we see that at all-time high.\n\nI think it's the nature of our diverse portfolio that we have. That business, if I look at 80% or 85% of the work they do, it falls in the categories of aviation, office and residential buildings, sports venues. And within that, there's actually a large investment to be made in the U.S. and convention centers, which is something that I don't think was being invested in certainly during the pandemic.\n\nAnd now we're seeing a fairly significant and broad opportunity and investment cities are making in convention centers to attract people to these cities and promote hospitality. So when we look at, again, our construction management business, the pipeline is at an all-time high. So we feel -- again, we feel good about that. The other thing about our construction management business is we have been winning and right now, we sit with, I think, a little more than three years of work in our backlog, almost four years of work.\n\nSteven Fisher -- UBS -- Analyst\n\nOK. Nice try. Very helpful. Yeah.\n\nOperator\n\nThank you for your question. Our next question comes from Sabahat Khan at RBC Capital Markets. Please go ahead.\n\nSabahat Khan -- RBC Capital Markets -- Analyst\n\nThanks. Good morning. Just, I guess, a question on the International segment. I know you've been working as an organization toward improving those margins for some time.\n\nI guess, given where they are today, how much of that is kind of the restructuring and the reorganizing work you've done? And I'm assuming there's some contribution from these bigger projects like NEOM there. Just thinking over the long run, that some of those projects cycle out, is there a further reorganization or just kind of fixing up that business? And how much is this -- how much of the margins do you think are more structural that will kind of stick through over the next two, three, four years?\n\nTroy Rudd -- Chief Executive Officer\n\nAnd I would think about -- again, our international business, the work that we've been doing over the last few years to strengthen that business has paid off. First of all, that business is very strong. So our international business is very strong, and it's winning large transformative projects at a very high win rate. And I don't see the trajectory of that business changing.\n\nThere are great long-term opportunities around the world for that business to be pursuing with our customer base and the business is very healthy. But like, again, all businesses -- our entire business, we're always looking for opportunities to make sure that we continue to drive efficiency and improve the overall business. But that's not going to be massive changes, but we're always looking to make incremental changes. But again, I just -- I look at our international business, and it's an incredibly healthy and strong business for the long term.\n\nSabahat Khan -- RBC Capital Markets -- Analyst\n\nOK. And then, just some of your commentary earlier around the pipeline, can you maybe give a little bit of color on how the feedback or the mix of the business you're building across public versus private. Is it more tilted toward one side? And have you seen any change in tone at all based on where kind of the macro is headed at all?\n\nTroy Rudd -- Chief Executive Officer\n\nSure. I guess, first, that's an easy question to answer. So we really don't see a significant change in the mix between private and public customers. Our government customers represent about 60% of the work that we do, and it's fairly consistent in our backlog.\n\nAnd then, in terms of the overall mix, think about it this way as, our mix of business is really driven by the longer-term mega trends that we've been talking about. I mean, there just clearly is a significant investment that's coming across the globe in infrastructure. And that's feeding our transportation, our water, our environment business and our buildings in places business. So it's a very -- again, it's a very diverse investment, infrastructure and we're well positioned for that.\n\nSo there's nothing unusual in the trends that we're seeing, but those trends are broad, and they benefit of the entire business.\n\nSabahat Khan -- RBC Capital Markets -- Analyst\n\nOK. Thanks so much for the call.\n\nOperator\n\nThank you. Our next question comes from Michael Dudas at Vertical Research. Please go ahead.\n\nMichael Dudas -- Vertical Research Partners -- Analyst\n\nGood morning, gentlemen. Just in your prepared remarks, I think, Troy, you mentioned about NSR growth in Americas Design was I guess, 6% this quarter and you said it's accelerating into 2023. So I assume with similar numbers fourth quarter and can that growth, I guess, given the backdrop that you've positioned, accelerate from that 6%? Just early look into 2023.\n\nGaur Kapoor -- Chief Financial Officer\n\nMichael, this is Gaur. I was the one who commented. Americas organic growth was 4% in Q3, and we did reconfirm that we will approximately have 6% MSR growth companywide, consistent with our commitments. And that's at constant currency.\n\nNo comments on FY '23, but a couple of things you could take a look at is what Troy alluded to earlier. Our contracted backlog is up significantly. Specifically in the Americas, it's up 8% year over year. That provides us a lot of confidence going into Q4 and into Q3 on accelerating growth before the IIJA funding hits the ground.\n\nMichael Dudas -- Vertical Research Partners -- Analyst\n\nGot it. I understand that. Second question, can you remind us what you do for your clients and your exposure to clean energy and certainly all the buzz and noise out of last has been with all of the excess funding that's going forth. How does AECOM get in that mix? And is that an area that can support maybe some differentiated growth for you guys over the next several years.\n\nLara Poloni -- President\n\nYeah, Michael, it's Lara here. I'm happy to take that question. We are investing significantly in our technical capability. And a great example of that is a new global leader for offshore wind.\n\nWe see significant wind opportunities across all of our operations. And then, there's obviously so much activity in the EV space as well, and that's another great example of where we're applying some of our digital tools in particular. So the combination of continuing to invest in technical capability in some of these rapidly growing areas in conjunction with the application of the digital tools I think gives us a lot of confidence about the growth in that segment of our business.\n\nMichael Dudas -- Vertical Research Partners -- Analyst\n\nIs it going to be a better growth than some of the other areas because it's from maybe a different base or just the fact that you're going to be adding some more skill sets and tools to be able to penetrate some market share there?\n\nGaur Kapoor -- Chief Financial Officer\n\nMichael, this is Gaur, so I'll take that. We don't break our growth targets into that level of detail, but we do provide our long-term guidance. No doubt to Lara's point, based on the investments we're making, we do expect to receive some significant return on our investments as we move forward based on our pipeline.\n\nMichael Dudas -- Vertical Research Partners -- Analyst\n\nGreat. Thanks. Thanks, everyone. Thanks, Mike.\n\nOperator\n\nOur next question comes from Adam Thalhimer at Thompson Davis. Please go ahead.\n\nAdam Thalhimer -- Thompson Davis and Company -- Analyst\n\nHey. Good morning, guys. Nice quarter. Troy, I think you said something.\n\nIt might have been a transportation comment at the pipeline of identified programs is up 40%. Is that right?\n\nTroy Rudd -- Chief Executive Officer\n\nI don't think I said the transportation pipeline was up 40%. What I mentioned was is within our pipeline, we have different categories of pipeline. And so, think about it as the initial prospect all the way through to placing the bid. Kind of in the middle of that, we have a clear line of sight to projects that are coming to market.\n\nI'm going to use our own terminology, which is, again, it's our own terminology, but we view that as a place where that work is in the capture phase. And so, we know that it's coming to market, and we're going to bid it. And so, our pipeline, when we look at, it's not linear in terms of its growth. We see lumpiness in that phase.\n\nAnd that piece of our pipeline is up 40% year over year, which means that there's a big lump of stuff that's going to come to market, and we expect that to come to market in '23. And so, again, that bodes well for the long-term health of the business.\n\nAdam Thalhimer -- Thompson Davis and Company -- Analyst\n\nHow do we think about that in terms of your win rate? That gives a big number, plus 40%.\n\nTroy Rudd -- Chief Executive Officer\n\nI would be very positive. I think you look forward and you think, well with the win rate, the things that we're doing to create long-term momentum in the business and create competitive advantage, that certainly bodes well for the long-term health of our backlog of the business and the business itself.\n\nAdam Thalhimer -- Thompson Davis and Company -- Analyst\n\nSo stay tuned. OK. And then, just quickly, the Arizona charging award, I was just curious what's your scope on something like that? Are you looking at the resiliency of the grid in addition to just the -- just the charging infrastructure?\n\nTroy Rudd -- Chief Executive Officer\n\nYeah. So it's -- again, it's a broader advisory engagement. I'm not going to talk about the specific scope of a client engagement, but it certainly is an advisory engagement to help build the plan for the state to figure out how do they build toward their defined EV goals in the future. When you think about that that really is a really important part of what we do.\n\nWe look around the world and we see people define these large long-term ambitions, but as we've seen over the last number of quarters is that, a lot of people have yet defined the solid path to get to the end state. And so, think about this as there's an important goal that the state of Arizona has set. And we're working with them to build a long-term plans for them to get there. And so, it's fairly broad in its ultimate approach.\n\nAdam Thalhimer -- Thompson Davis and Company -- Analyst\n\nGot it. OK. Thank you, Troy.\n\nOperator\n\n[Operator instructions] Our next question comes from Jamie Cook at Credit Suisse.\n\nJamie Cook -- Credit Suisse -- Analyst\n\nHi. Good morning. Nice quarter. Most of my questions have been asked.\n\nI guess, Troy, just your portfolio today, obviously, and your focus is very different relative to the prior AECOM. Just wondering if we are to go into a recession or in a recession, which parts of the business do you think would be most impacted? And how resilient would AECOM's earnings be just given some of the secular growth tailwinds and maybe internal levers you have to structurally improve margins?\n\nTroy Rudd -- Chief Executive Officer\n\nOK. Thanks, Jamie. So again, first of all, say that when there is a recession, everybody's impacted by the recession. But I would describe us as not being as impacted as others and for a couple of different reasons.\n\nOne is I think even within a recession or recessionary trend that we see a lot of funding that is coming into infrastructure and it's coming in to continue to transform the world in terms of environmental and social improvement. And frankly, there are some longer-term trends post-COVID. And so, even if there is a broad recession, we look at this and say, well, with inside that recession, the things that we do are going to receive funding and funding for the long term. So that bodes well for the long-term health of the business even in a recession.\n\nBut then I look at as you described, right, there's some attributes to the business that put us in a very good position to work our way through that. One is our backlog. We have long, live backlog in the business. We also have an asset-light business, and a business that can be made all agile to react to shorter-term market volatility.\n\nAnd then, the other thing that happens is, again, just sort of being where we are in the No. 1 position in our industry is customers typically coalesce around the No. 1 company in terms of a recession. So the recession usually hits the smaller organizations or in organizations that don't sort of sit at the top of a particular industry.\n\nAnd then, I'll just point out that we certainly have had experience with this in the past. But if you go back to 2008, there was a recession, and it was fairly dramatic. The AECOM business at that time was a consulting business, and a design business, and we grew 2009 through 2012. So I think that's threw a proof point to the resiliency of the business for recession.\n\nJamie Cook -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is a follow-up question from Sabahat Khan. Please go ahead.\n\nSabahat Khan -- RBC Capital Markets -- Analyst\n\nGreat. Thanks. There's a little bit of commentary earlier on the call around the labor situation. I guess, how are you planning for that just given some of the potential recession concerns but also with the IIJA ramping up next year? Kind of how are you balancing the two and making sure you have enough people and see it when the demand flows through?\n\nLara Poloni -- President\n\nThanks for the question. It's Lara. I'm happy to take that one. I think we're pretty optimistic.\n\nJust in this last quarter, design headcount increased by over 4% year-on-year. So we have -- it's certainly one of our focus areas at the moment. And not only have we really ramped up in terms of talent acquisition capability. But another key part of our strategy is the enterprise capability centers, where we are building long-term capability and centers of technical expertise.\n\nAnd a great example of that, we see continuing trend for transit, for example, or the pent-up demand and congestion in all of the world's major cities. We have our #1 position in transit. So we have quite deliberately built up capability centers in Madrid and the U.K., for example, to have that capability for the longer term. So it's a combination, obviously, of short-term hiring in local markets, supplemented by our enterprise capability center strategy, which gives us a lot of confidence.\n\nSabahat Khan -- RBC Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nAt this time, there are no further questions. I'd now like to pass over to Troy Rudd, CEO, for any final remarks.\n\nTroy Rudd -- Chief Executive Officer\n\nGreat. Well, thanks, everyone, for joining us today. And again, I'm just going to finish the call by complimenting the people here at AECOM. They've done a fantastic job in finding the right balance between pursuing profitable growth today and for the long term, while continuing to recognize that we can continue to improve by expanding margins, and while doing all of that, continuing to make investments in the business to drive a long-term competitive advantage.\n\nSo I thank them all for their dedication to our mission. Everybody, have a nice day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nWill Gabrielski -- Senior Vice President, Finance and Investor Relations\n\nTroy Rudd -- Chief Executive Officer\n\nLara Poloni -- President\n\nGaur Kapoor -- Chief Financial Officer\n\nSean Eastman -- KeyBanc Capital Markets -- Analyst\n\nMichael Feniger -- Bank of America Merrill Lynch -- Analyst\n\nAndrew Kaplowitz -- Citi -- Analyst\n\nSteven Fisher -- UBS -- Analyst\n\nSabahat Khan -- RBC Capital Markets -- Analyst\n\nMichael Dudas -- Vertical Research Partners -- Analyst\n\nAdam Thalhimer -- Thompson Davis and Company -- Analyst\n\nJamie Cook -- Credit Suisse -- Analyst\n\nMore ACM analysis\n\nAll earnings call transcripts"
}