{
  "companyName": "MINISO Group Holding Limited",
  "companyTicker": "MNSO",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/miniso-group-holding-limited-mnso-q4-2022-earnings/",
  "content": "MINISO Group Holding Limited (MNSO -2.10%)\nQ4 2022 Earnings Call\nAug 25, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by and welcome to MINISO Group Holding Limited earnings conference call for the fourth quarter of fiscal year 2022 that ended June 30th, 2022. [Operator instructions] Please note this event is being recorded. Now I like to hand the conference over to your host speaker today, Mr. Eason Zhang, director of capital markets.\n\nPlease go ahead, Eason.\n\nEason Zhang -- Director of Investor Relations\n\nThank you. Hello, everyone. And thank you all for joining us. We have announced our quarterly financial results earlier today.\n\nAnd earnings release is now available on our Investor Relations website at ir.miniso.com. Joining us today are our founder and CEO Mr. Jack Ye, and CFO, Mr. Steven Zhang.\n\nBefore we continue, I'd like to refer you to the Safe Harbor statements in our earnings press release which also applies to this call, as we've been making forward-looking statements. Please also note that we'll discuss non-IFRS measures today, which we have explained and reconciled to the most comparable measures reported on the International Financial Reporting Standards in the company's earnings press release. And filings with the U.S. SEC and Hong Kong Stock Exchange.\n\nWith that, I will now turn the call over to Mr. Ye. Please go ahead.\n\nJack Ye -- Chairman and Chief Executive Officer\n\n[Foreign language] Thank you. Hello, everyone and welcome to MINISO Group June quarter 2022 earnings conference call. This marks the last quarter of fiscal year '22 and the first time we have announced results as the dual primary listed company in the U.S. and Hong Kong.\n\nThanks to the efforts of our dedicated team. We completed our listing in Hong Kong on July 13th this year. Our listing in Hong Kong was an important math arrangement from the perspective of -- prospects protecting the interests of our existing shareholders, and proactively responding to the evolving regulatory environment. We believe it will also provide us with more broader financing channels to drive the company's future development, help us expand our shareholder base, and promote the sustainable healthy development of our business.\n\nOn behalf of the company, I like to express my gratitude to each and every employee for their dedication and to our investors who have always cared for support in MINISO. Going forward, we're confident that we will create long-term value for shareholders by enabling everyone to better enjoy life and a little bit of surprise. So as we have repeatedly emphasized in our earnings conference calls over the past few quarters that retailers are capable of passing through economic cycles. Our business model has demonstrated great resilience despite the pandemic weighing our near-term results.\n\nDuring this quarter, we have been promoting our brand upgrade efforts in China. And the gross margin of our domestic operations in the June quarter increased by about 3% from the same period of last year, as we have launched a new portfolio of high gross margin consumption-based products. During this quarter, as the domestic of our retail sector faced unprecedented challenges, which focused on growing the recovery of our overseas business, which achieved nearly 50% year-over-year growth in revenue and accounted for 34% of the company's total revenue the highest since the outbreak of the pandemic in early 2020. Benefiting from these two drivers, our overall gross margin reached a record high of 33.3% in this quarter.\n\nOur recent business performance demonstrates that our globalized presence has given us much greater flexibility when facing pandemic-related uncertainty in China, as we continue to unleash the operating leverage of our directly operated overseas business and further our efforts to reduce costs and improve efficiency. Our adjusted net profit increased by 57% year over year to RMB 220 million in the June quarter, which is double the figure from the prior-year quarter. Our adjusted net margin reached its highest level of the past 10 quarters at 9.6% returning to a level similar to what we have achieved before the pandemic. Next I will show in detail the development of our respective business segments during the quarter.\n\nFirst, I will cover our domestic corporations, revenue in this quarter was RMB 1.41 billion, of which revenue from offline business was RMB 1.28 billion which, compared to RMB 1.82 billion and RMB 1.63 billion in the same period last year, respectively. We estimate that the GMV lost due to the impact of the pandemic was about RMB 700 million and the corresponding loss of accounting revenue was over RMB 400 million. More specifically, our sales decreased by nearly 30% year over year in April and May as a result of the reduced traffic to shopping malls, many of which were able to operate due to local government restrictions. In April, an average of 300 AD or 12% of MINISO in China were able to operate.\n\nNumber was down by about 100 in May but still accounted for nearly 9% of stores. Going into June as key cities gradually reopen, talking more our traffic recovered rapidly and meant toward resume normal operations. Temporary store closures were further down to 60 or 2% of our stores. Our sales in June recovered to 94% level from the same period last year.\n\nThat figure was nearly 90% in Tier 1 and Tier 2 cities and whereas in Tier 3 and below cities we saw year-on-year growth of nearly 1%. E-commerce revenue in quarter was RMB 113 million as important complement to your offline channels. Revenue itself is not the most important KPI for e-commerce instead we focused more on its profitability which has been increasing over the past few years through our reasonable control of traffic acquisition costs. The MINISO retail partner mobile app demonstrated great resilience during pandemic outrage.\n\nAs MINISO retail partners with minimal inventory risk and always received their revenue share on time, the working capital pressure is much lower than the other franchising models. This quarter, despite the tremendous pressure of the pandemic, our business development team, they added 79 stores on net basis and contained the corporate store closure ratio to about 1.1%, the lowest level of the past eight quarters. In the fiscal year 2022, the number of store closure in China decreased by 40 compared with the prior year. As the control measures were stricter in Tier 1 and Tier 2 cities, new MINISO stores in China in this quarter came entirely from Tier 3 and below cities for the remaining four months of 2022, while dynamically adjust the stalls in pace according to pandemic development in China to lower operational risk for MINSO retail partners.\n\nMoving on to MINISO overseas operations, revenue for June quarter was about RMB 780 million an increase of almost 50% year on year, revenue from our distributor business model increased by more than 30% year on year, revenue from our directly operated business model increased by about 70% year on year. During the June quarter, the overseas markets was down into recovery momentum, and overall sales increased by 52% year on year and recovered to over 90% over the same period in 2019. Our distributor markets increased by 45% year on year and have already recovered to nearly 100% over the same period in 2019 where sales in our direct operated markets increased by nearly 80% year on year and have recovered to 80% over the same period in 2019. By region, sales in Europe increased by nearly 40% year on year and more than doubled that in the same period in 2019.\n\nSales in North America increased by nearly 170% year on year, up 13% from the same period in 2019. Sales in Latin America increased by nearly 60% year on year, up more than 10% from the same period in 2019. Sales in the Middle East and North Africa increased by nearly 30% year on year, up 60% from the same period in 2019. And sales in Asian countries, including China increased by over 50% year on year, recurring to nearly 60% of the same period in 2019.\n\nAsian countries excluding China is so far the only market that has not fully recovered to pre-COVID levels in sales. By country, sales in both the U.S. and Canada increased by nearly 170% year on year, Mexico increased by over 50%, while India nearly tripled. MINISO entered its 105 market in June quarter and added 57 overseas stores on net basis, compared to 35 stores in the same period last year.\n\nThe overseas market has entered that now the post-pandemic era and with a strong demand growth from distributors, we have speed up this pace of opening overseas stores this year. Although due to the Russia/Ukraine conflict and the geopolitical tension, which has delayed some of our distributors store opening plans. We are still confident that number of new overseas stores open in the calendar year of 2022 on net basis will be significantly higher than in 2021. Under the current high inflation environment in overseas markets, consumers tend to look for more value, which creates great market opportunities for us.\n\nWe adhered to the productive team philosophy and will continue to enhance our overseas design capacity by sending our domestic product teams overseas to further strengthen our product design capabilities and develop localized products. At present, we have the preliminary capabilities to launch products in a 7:1:1 manner in major overseas markets. Our next focus is on Latin America, North America, Southeast Asia, and Europe. While our goal is to provide more and more localized products to consumers there.\n\nWe will continue to leverage China's strong supply chain capabilities and benefit from exporting the Chinese supply chain overseas. As we continue to cultivate in overseas markets, we have launched the MINISO store image 3.1 project to improve the visual competitiveness of our stores in some of these markets. We also practically assist overseas distributors in refining their operating strategies. Taking our distributing and as an example has achieved improved performance by shifting smokers from tourist areas to local communities to reduce reliance on tourists.\n\nNext let's talk about TOP TOY. We continue to execute our established strategy in order and made steady progress. Although our revenue of TOP TOY increased by 43% year on year, while its online business contributed 15% of revenue in this quarter. In response to the pandemic in China, TOP TOY stepped off some promotional campaigns.\n\nAs a result its merchandise gross margin was about 42% in June quarter, which although lower than the previous quarters is still a house level. While quarterly, the sales mixed between TOP TOYs proprietary products and certain third-party products has been moving toward a more reasonable level mentioned our consistent product strategy. Proprietary products accounted for nearly 20% of TOP TOY sales and the gross margin of proprietary products remain over 60%. Looking back over the 2022 fiscal year, our key operating metrics have demonstrated that we are in a healthy growth space.\n\nWe added by 514 stores on net basis representing 11% year-on-year growth, revenue exceeded RMB 10 billion up 11% year over year. Gross profit exceeded RMB 3 billion up 26% year on year. Gross margin reached 30.4%, up 3.6 percentage points year on year. Adjusted net profit RMB 720 million up 51% year on year and net margin was 7.2% up nearly two percentage points year on year.\n\nLooking forward to 2023 fiscal year, we are still optimistic about our future revenue and profit growth despite continued uncertainty from the pandemic as positive outlook comes from our long-term confidence in China's economic development. Our unchanged ambition for our retail business and our consistent determination to achieve globalized development. Lastly, as you may have noticed, we issued a letter of apology last week, in which we moved over the inappropriate marketing tactic not only days before becoming a listed company and announced a correction plan. In the future as a dual primary listed company, we will strictly comply with the regulations of both exchanges, which creates a greater level of compliance requirements for the company going forward.\n\nOur continuous raise of compliance standards that govern our operations to guarantee the sustainable success of our core business. That concludes my prepared remarks. I will now turn it over to CFO for financial review.\n\nSteven Zhang -- Chief Financial Officer\n\nHello, everyone. Thank you for joining us today. I will walk you through the financial results in June quarter, as well as the full fiscal year 2022. Please be noted that all the numbers are in RMB unless otherwise stated.\n\nAnd I will also refer to some non-IFRS measures, which has excluded the share-based and compensation expenses. Revenue in June quarter reached RMB 2.3 billion above the midpoint of our guidance range, which was RMB 2.1 billion to RMB 2.4 billion, which implies a better-than-expected performance in our domestic operation in June. Revenue from China was RMB 1.5 billion, including RMB 1.4 billion from MINISO grants and the RMB 95 million from TOP TOY brand and RMB 28 million from others. Of these revenue from MINISO brand experienced a year-over-year decline of 23% consistent with the decline trends of GMV and offline traffic to shopping malls.\n\nRevenue from TOP TOY increased by 33% year over year. During this quarter, TOP TOYs sales was significantly impacted by the outbreak of omicron virus due to the concentration of stores in Tier 1 and the Tier 2 cities. As we have included in the previous call in May, although the impact of the pandemic on short-term performance is inevitable as we continued to follow our established strategy and made a steady performance in refined, TOP TOYs business model products and only channel strategy. For our overseas market, its revenue increased by 49% year over year to RMB 785 million.\n\nIf we look at the financial year 2020, the year-over-year increase in revenue was also about 50% which demonstrated that recovery trends of our overseas operation is very clear. For full fiscal year 2022, total revenue reached 10.1 billion, an increase over 11% from fiscal year 2021. Revenue from our domestic operations was RMB 7.4 billion increased by 2% from a year ago. Of this, revenue from domestic operations increased by 15% in the first half of fiscal year 2022 and decreased by 10% in the second half due to the spread of omicron in China.\n\nRevenue generated from TOP TOY was RMB 447 million, representing an increase of 355% year over year. Gross profit in June quarter was RMB 772 million representing an increase of 21% year over year. Gross margin was 33.3%, compared to 25.8% in the same period of 2021. There was three reason for the year-over-year increase in gross margin.\n\nFirst, it was primarily due to the revenue mix the change. This quarter, we have seen almost eight markets contribute 34% of total revenue, it is the highest level since the December quarter of 2019. Secondly, we launched the more profitable product in relation to MINISO strategic brand upgrades in this quarter. And the third reason is about the inventory clearance activities throughout the year that aim to take all the negative impact of the pandemic in ‎Guangdong.\n\nOur full year gross profit was RMB 3.1 billion, up 26% year over year. Gross margin was 30.4%, compared to 26.8% in the fiscal year 2021. Selling and distribution expense in June quarter was 346 million, representing an increase over 31% year over year. The year-over-year increase was primarily attributed to, first, increase the largest expense in relating to our recovery international operations.\n\nSecond, increase the personnel-related expense. And the third, increase the license expense relating to our newly launched IT products, partly offset by our saving in promotion and advertisement expense due to our reduced marketing effort in China to take all the resurgence of COVID-19. For the full year, selling and distribution expense was approximately RMB 1.4 billion, representing an increase of 29% year over year. The year-over-year increase was primarily attributed to, first increase of personnel-related expense.\n\nSecond, increased license expense relating to our enlarging IT library and the enriching offering of IT products. And third, increase the promotion and advertisement expense mainly connecting to a strategical brand update of MINISO in China. G&A expense in June quarter were RMB 180 million, representing a decrease of 5% year over year. The year-over-year decrease was primary due to decreased personnel-related expenses.\n\nFor full year G&A expenses were RMB 785 million, representing an increase of 19% year over year. The year-over-year increase was the primarily due to, first, increase the depreciation and amortization pays, mainly related to the land use rights of the company in the headquarter building project and the second increased personnel-related expense, which were partly offset by a decrease of Office operating expense as a result of expense control measures taken by the company to take all the resurgence of COVID-19 in China. Turning to profitability. Operating profits in June quarter was RMB 272 million representing an increase of 45% year over year.\n\nOperating margin was 11.7%, compared to 7.6%, a year ago. For full fiscal year 2022, operating profit was RMB 882 million, representing an increase of 120% year over year. Operating margin was 8.7%, compared to 4.4% in the fiscal year 2021. Adjusted net profit in June quarter was RMB 223 million, representing an increase of 57% year over year.\n\nAdjusted net margin was 9.6%, compared to a 5.7% in the same period over 2021. For full year, adjusted net profit was RMB 723 million, representing an increase of 51% year over year. Adjusted net margin was 7.2%, compared to 5.3% in fiscal year 2021. Adjusted basic and diluted earnings for ADS in June quarter were 0.72 up 50% year over year.\n\nFor full year adjusted basic and diluted earnings per ADS was 2.40 and 2.36 respectively, representing an increase over 43% and 40% year over year respectively. Turning to cash position, as of end of June, we had a cash position of RMB 5.8 billion. On August 17th, 2022, our board of directors approved a special cash dividend in the amount of approximately $53.5 million or RMB 360 million up 20% year over year. Our capital allocations revenue in the future, we will balance the new growth opportunity and our commitment to bring stable return to shareholders.\n\nTurning to working capital, turnover of inventory and trade receivable remain stabilized. And the new listed company on Hong Kong Stock Exchange, we follow the common practice adopted by the public company in the Hong Kong market. And we will no longer provide a guidance on revenue growth going forward. That being said, as we approach the last month of the September quarter, we have observed encouraging sales and recovery in China, which has stabilized at a healthy level during the past several weeks.\n\nLooking forward into the coming quarter, we expect our bottom-line performance, we will further normalize because of our disciplined execution over brand upgrade and a steady recovery of overseas operations. Thank you and this concludes our prepared remarks. Operator, we are now ready to take questions.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. Your first question today comes from the line of Michelle Cheng of Goldman Sachs. Please go ahead.\n\nMichelle Cheng -- Goldman Sachs -- Analyst\n\n[Foreign language] So my question is about brand upgrades. So brand upgrade actually drive the gross margin quite significantly in the past quarters. So can management comment on strategies into second half? And what's the gross margin update and whether there's any related operating expenses for the brand upgrade? Thank you.\n\nJack Ye -- Chairman and Chief Executive Officer\n\n[Foreign language] OK. Thank you, Michelle, for the question. This is Jack, and for questions, as we have communicated in our last call back in March. All MINISO brands strategic upgrade will count from three weeks in product and channel and in marketing.\n\nIn terms of products, we will continue to improve the gross margin of newly launched products, especially those inter-based consumption products in our regular based as planned. As mentioned just now know, as all domestic gross profit margin increased by about 3% year on year, this quarter, to about 54% from nearly to Q1 last year. So our current plans is that by the end of fiscal year 2023, which is this time next year, we plan to have improved our gross merchandise margin by another five percentage points close to 60%. In terms of channels, we plan to systematically optimize offline business and profitability in the Tier 1 and Tier 2 cities and to help our retail partners to reduce operational risk.\n\nAnd in terms of marketing, we originally had marketing plan in the September quarter as we communicated, and the budget was around RMB 50 million or so. But however, considering the current domestic situation of the pandemic, and its possible outbreak -- restrict control measures will continue for some time. So we have decided to delay or postpone these market compares and to save a pot of cost. And this will have positive impact on profit in September quarter.\n\nSo I hope this help answer your question. Thank you.\n\nMichelle Cheng -- Goldman Sachs -- Analyst\n\n[Foreign language]\n\nOperator\n\nThank you. The next question is from the line of Anne Ling from Jefferies. Your line is open. Please go ahead.\n\nAnne Ling -- Jefferies -- Analyst\n\n[Foreign language] Now let me translate in English. Just regarding your letter to the public regarding like minimize some of these like sort of \"the Japanese interest\". So, what exactly, as a strategy regarding how do we change in terms of the operation? Our concern is that whether all these changes will impact your image or your performance or your brand equity from the consumers angle both for overseas as well as the domestic client. So I would like to get more information about what is your plan? Thank you.\n\nJack Ye -- Chairman and Chief Executive Officer\n\n[Foreign language] OK. Thank you, Anne, for your question. This is Jack. So, in terms of your question was about the correction plan of this event.\n\nSo, we have three specific measures. The first is, strengthening the internal control environment of our distributors in overseas markets, and especially, in relation to the political sensitive issues. And we will establish our headquarters our globalized headquarter of branding center. And we have all these marketing person in overseas market report to headquarters, and this headquarter, it will regularly organize related trainings for the frontline personnel.\n\nAnd the second is on the operational side. And we have given a timeline in the correction plan that the rectification shall be completed before the end of March next year. And the third is from product level. So we will explore more Chinese culture or China's traditional elements embedded products and planned to launch a series of Chinese IT products to overseas markets.\n\nFor your second question about the impact on our sales, in Chinese market -- in domestic markets, we have not observed any impact from those China and overseas markets. So in China in July, the total GMV was about 95% of last year. And if you look at the first three quarters of August, it was planned year over year. And as we mentioned earlier, in last several quarters this recovery from sales in China net income from the recovery the foot traffic to shopping malls where our ASP remains -- gross or low single digit.\n\nAnd in terms of overseas market, if you look at the July and the first three weeks of August. The total GMV in overseas distributors increased by about 30% to 40% on year-over-year basis. And if you look at our directly operated business, the year-over-year growth was even higher about 50%. Thank you for your question.\n\nAnne Ling -- Jefferies -- Analyst\n\n[Foreign language] Is there any additional costs involved in this exercise?\n\nJack Ye -- Chairman and Chief Executive Officer\n\n[Foreign language]\n\nAnne Ling -- Jefferies -- Analyst\n\n[Foreign language]\n\nEason Zhang -- Director of Investor Relations\n\nThank you, Anne. And this is Steven, let me quickly translate for Steven. So, for the interim control measures, there will be some but we do not think that it will increase our related expense significantly and will not impact our earnings. Thank you.\n\nOperator\n\nThank you. The next question is from the line of Lucy Yu from Bank of America Merrill Lynch. Your line is open. Please go ahead.\n\nLucy Yu -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] So we are facing potential recession in U.S. and Europe. should we worry about the impact of recession on our business and whether that will impact our overseas expansion plans? Thank you.\n\nJack Ye -- Chairman and Chief Executive Officer\n\n[Foreign language] Thank you, Lucy. This is Jack. I will cover this question. So in terms of the question on the store expansion in overseas market, we have to say that commonly we see a strong demand from our overseas distributors and the pipeline is also strong.\n\nBut we also have to be frankly speaking that the Russia/Ukraine complex and the evolving geopolitical risks in some of overseas markets are now impacting in different ways and aspects to our distributor store opening plan, and some of them have delayed store expansion plan in this quarter. But if you look at the past several years, from fiscal year 2020 to fiscal year 2022, our overseas markets net added 375, 121, and 163 stores. So we are now quite confident that in fiscal year 2023, the net addition of our scores in overseas market as a whole will be significantly higher than that in 2022. Thank you.\n\nLucy Yu -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language]\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEason Zhang -- Director of Investor Relations\n\nJack Ye -- Chairman and Chief Executive Officer\n\nSteven Zhang -- Chief Financial Officer\n\nMichelle Cheng -- Goldman Sachs -- Analyst\n\nAnne Ling -- Jefferies -- Analyst\n\nLucy Yu -- Bank of America Merrill Lynch -- Analyst\n\nMore MNSO analysis\n\nAll earnings call transcripts"
}