{
  "companyName": "Intapp, Inc.",
  "companyTicker": "INTA",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/intapp-inc-inta-q4-2022-earnings-call-transcript/",
  "content": "Intapp, Inc. (INTA 0.65%)\nQ4 2022 Earnings Call\nSep 07, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Intapp fiscal fourth quarter 2022 webcast. At this time, all participants are in a listen-only mode. After the speakers' presentation, it will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would like to hand the conference over to your speaker today, David Trone, senior vice president, investor relations. Please go ahead.\n\nDavid Trone -- Senior Vice President, Investor Relations\n\nThank you. Welcome to Intapp's fiscal fourth quarter and year-end 2022 financial results. On the call with me today are John Hall, chairman and CEO of Intapp; and Steve Robertson, chief financial officer. During the course of this conference call, we may make forward-looking statements regarding trends, strategies, and the anticipated performance of our business, including guidance provided for our fiscal first quarter and full year 2023.\n\nThese forward-looking statements are based on management's current views and expectations, current assumptions made as of today's date, and are subject to various risks and uncertainties, including those described in our SEC filings and other publicly available documents that are difficult to predict and could cause actual results to differ materially from those expressed or implied by such forward-looking statements. Intapp disclaims any obligation to update or revise any forward-looking statements, except as required by law. Further, on today's call, we will also discuss certain non-GAAP metrics that we believe aid in the understanding of our financial results. A reconciliation to comparable GAAP metrics can be found in today's earnings release, which is available on our website and as an exhibit to the Form 8-K furnished with the SEC prior to this call.\n\nWith that, I'll hand the conversation over to John.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nThank you, David. Good afternoon, everyone. Thank you for joining us. We're pleased to be here with you to share the results of our fiscal fourth quarter and full year fiscal 2022.\n\nI'm proud to say that we had a fantastic first year as a public company with great results across the business, including our tremendous cloud ARR growth of 48% year over year. We added new clients, grew our existing clients, released new applied AI applications on our cloud platform, and beat our guidance every quarter. We enter fiscal year '23 with strong momentum. Intapp targets the $3 trillion technologically underserved professional and financial services industry.\n\nWe bring our clients in this market, our purpose-built industry cloud platform that is highly differentiated from traditional CRM and ERP systems because it's designed specifically for the unique partnership model of these firms and their unique business model, which is driven by each professional's highly specialized market knowledge and expertise. Our platform enables these professional firms to arm their professionals with the full collective knowledge of the firm to better compete in their marketplace in order to generate greater returns and revenues to operate more efficiently and profitably, all while managing the highly specialized risk and compliance requirements across these regulated industries. Our target firms across our markets are continuing to demonstrate strong fundamental demand for our purpose-built solutions and industry cloud platform. Looking at our results for Q4 and for fiscal year '22, it's clear that our value proposition is resonating and demand for our platform and the competitive strength of our solutions remain strong.\n\nAs I noted earlier in Q4, our cloud ARR grew 48% to $162.9 million. Cloud now represents 60% of our total ARR of 270.5 million, which is up 27% year over year. In the quarter, we earned SaaS and support revenue of 52.7 million, up 34% year over year, and total revenue of 75.5 million, up 23% year over year. We ended our fiscal year serving more than 2,100 premier firms across our target verticals.\n\nOK. Starting with products. Our continued innovation helped fuel growth throughout fiscal year '22 and set us up for continued product leadership in fiscal year '23 and beyond. We continue to add valuable product capabilities to our industry cloud platform.\n\nThis enables us to increase the value of our platform to each client. During fiscal year '22, we captured this value as we landed many new clients. We also captured this value by expanding through cross-sell and upsell to our existing clients, driving net revenue retention. Our client-led innovation also opened new markets for us as we extended the capabilities of our cloud platform.\n\nIn one example, we launched new functionality in our DealCloud solution to directly support the unique, complex needs of real estate investors. Over the year, we continue to expand that capability to fully support real estate deal execution with enhanced visualization of pipeline and properties, map-based property discovery, and tools that streamline market and deal analysis. Alternative real estate investor Kayne Anderson, with $9 billion under management, selected DealCloud to replace a competing CRM. They told us that the increased efficiency between DealCloud and their former solution is night and day.\n\nIn another example, we launched a new relationship intelligence capability across the Intapp platform. Relationship intelligence uses Intapp's applied AI technology to answer the key question: What is our firm's best way to get into this prospect firm and to navigate to this key person? Relationship intelligence leverages metadata from the firm's contacts, email, and meetings, enabling individual dealmakers to better nurture and harness the entire firm's network of professionals to grow their business. Already we see dozens of clients taking advantage of these new capabilities, including HgCapital, a leading international software and services investor with over $55 billion in assets under management. They are using this new capability to identify and leverage the relationships of employees across the firm to form a competitive advantage for the entire firm.\n\nIn another example, we launched the Intapp collaboration and content suite, combining the capabilities gained through the Repstor acquisition with Intapp's industry cloud platform, extending our capabilities natively into Microsoft Office 365 and Teams. This solution solves complex security, compliance, and governance requirements, all of which are critical issues for professional and financial services firms of all sizes as they increasingly move to Office 365 and Teams. OK. Let's turn to new markets.\n\nOur capabilities, along with the strength of our industry cloud platform, created opportunities for us to expand into new markets during the year. Picking up on real estate, as part of our client-led innovation strategy, we worked with our large multistrategy private capital clients to define and develop valuable new real estate capabilities on the platform. In addition to providing a unique, whole solution to the large multistrategy firms, these new features have enabled us to target and win new clients who are dedicated to real estate investing, including Municipal Acquisitions, a private real estate investment firm based in Washington, D.C.; and Sienna Investment Managers, the alternative investment platform of holding company GBO, among many others. We believe the long-term opportunity to support the investors' and advisors' ecosystem that invests in real assets is significant and is a natural extension to our success serving the growing private equity industry.\n\nFinally, the acquisition of Repstor in June 2021 and the subsequent launch of Intapp documents for corporate legal has provided us entry into the in-house legal market. Building on the capabilities of our collaboration and content suite, we launched the solution in May to deliver intuitive and collaborative matter lifecycle management for in-house legal departments. These solutions allow in-house legal teams to streamline management of critical documents and information, enabling them to reach better decisions faster. We now have in-house legal clients across a wide range of sectors, including insurance, professional services, manufacturing, biotech, and more.\n\nLarge clients include a multinational, European-based sportswear manufacturer and a FTSE 100 listed insurance company. Turning to partnerships. Another key accomplishment in fiscal '22 was the expansion of our partner ecosystem. Our partner ecosystem includes data providers, technology solutions, and professional services partners who enhance the value that we provide to our clients.\n\nIn February, we entered an exciting new chapter in our decade-long history with Microsoft. We announced a new strategic partnership that validates our industry cloud leadership in the market and amplifies our ability to combine our purpose-built solutions with the Microsoft software that firms use every day. We have committed to programs to help our clients move to the cloud securely with joint migration support and deeper integration between our platform and Microsoft workforce solutions. Our clients have shared their enthusiasm for the critical role that we can play in helping them leverage their own investments with Microsoft and continue to move to the cloud.\n\nThen in April, we expanded our partnership with KPMG to help us support Intapp's growing base of large enterprise-class and global firms. Intapp's industry cloud platform, combined with KPMG's scaled capabilities and cloud transformation services, will enable us to deliver essential solutions and services to make our joint clients' complex digital transformation programs successful. As an example of our partnership, KPMG recently announced a global alliance ecosystem, highlighting Intapp and Microsoft, to further empower the future of legal services for both law firms and in-house legal departments. Turning now to M&A.\n\nDuring fiscal '22, we added two important technology capabilities to our industry cloud platform through acquisition. As I mentioned, we acquired Repstor in June 2021. We successfully integrated this business over the past year and are seeing increasing demand from clients across our target market to better leverage their investment in Office 365 and Teams. We are seeing adoption across all the industries we serve, including at Big Four accounting firms.\n\nWe are -- where we are delivering on the modern workplace vision, dramatically improving collaboration. In June, we acquired a technology called Billstream that automates critical billing workflows. Integrated into the Intapp platform, this technology extends our solution for operations and finance teams. Billstream eliminates manual billing steps, enabling our clients to achieve more profitable delivery of work.\n\nThe addition of Billstream allows our clients to derive even greater value from our purpose-built industry cloud platform. We've seen strong client interest, particularly from the hundreds of clients who already rely on us for their operations and finance needs. Turning to industry recognition. In fiscal '22, third-party validation for our innovation came in the form of several industry awards.\n\nOur DealCloud solution was recognized, winning top honors with the Best Deal Origination award at the U.S. 2022 Private Equity Wire Awards, and DealCloud won two 2022 Private Equity Wire European Awards for Best Fundraising and Best Deal Origination Technology. Finally, our OnePlace solution was named 2022 Legal Tech Trailblazer by the National Law Journal. As you can see, fiscal '22 was a year of expansion for Intapp on many fronts.\n\nOn the people front, we're pleased to have welcomed many new team members to support our growing client base. An important part of our culture and differentiation with our clients is that our Intapp people are recognized as true experts in the industries that we serve, and we continue to build on that leadership. We also expanded our board. In February, we welcomed Beverly R.\n\nAllen, general counsel and chief compliance and privacy officer at Inovalon, a leading provider of cloud-based platforms empowering data-driven healthcare, as a new director. Beverly possesses a deep understanding of cloud-based platforms designed to address complex, regulated industries and their unique client challenges. And we're proud to have her on our board. On the client front, we're excited to have added so many new logos globally throughout the year while cross-selling and upselling our existing accounts, driving strong net revenue retention.\n\nThe client list is long, but some examples include Graphite Capital, a leading U.K. mid-market private equity firm, who is now using DealCloud to boost the efficiency of deal management, value creation, and investor relations; Hannes Snellman, a Nordic law firm who selected our OnePlace solution for risk and compliance; a large, independent global business advisory firm with over 6,600 employees who turned to intent to improve compliance and business intake in their complex European and regulatory environment; and one of the largest private equity firms in the world based in Europe, who signed a sizable agreement to implement DealCloud. And we continue to expand in Asia-Pacific, adding new logos like ADV Partners, a Hong Kong-based private equity firm who selected DealCloud to manage deals and investor relations across multiple locations. And we've also increased our presence in Australia and expanded our go-to-market capabilities in Singapore to pursue the significant growth opportunity we see in the Asia-Pacific region.\n\nIn conclusion, we're proud of our performance in '22, which launches us into fiscal '23 with strong momentum. We are serving an extremely durable end market with our deeply differentiated industry cloud platform. Our subscription revenue model is highly predictable, and we see continued opportunity, both to add new clients across a broad TAM and to deliver greater value to expand significantly within our existing client base. We have a great growth opportunity to drive cloud adoption and modernization across all these industries.\n\nI'd especially like to thank our clients, our partners, our investors, our board, and our global employee team whose teamwork and dedication led to such a successful first year as a public company. Thank you all very much. OK. Steve, over to you.\n\nSteve Robertson -- Chief Financial Officer\n\nThanks, John, and thanks, everyone, for joining us today. As John noted, we had another strong quarter with our cloud ARR, up 48% year over year, and our total ARR, up 27% year over year. Before I go through our financials, as a reminder, I'd like to quickly review a few fundamentals of revenue recognition in our financial model. Cloud ARR is recognized as SaaS revenue, ratably, following a new sale or renewal.\n\nOn-premises ARR is recognized in two parts: 50% as subscription license revenue, recognized upfront at the time of the sale or renewal, and 50% as support revenue recognized ratably and included in our SaaS and support revenue line. Because it is recognized ratably, SaaS and support revenue is more predictable quarter to quarter, while subscription license revenue can vary based on the timing of revenue recognition. OK. Moving to our numbers.\n\nQ4 SaaS and support revenue was 52.7 million, up 34% year over year, reflecting both sales to new clients, and upsells and cross-sell to existing clients of Intapp's purpose-built cloud solutions. Subscription license revenue was 13.4 million compared to 14.4 million in the prior-year period, reflecting our plan to migrate on-premises clients to the cloud over time. Professional services revenue was 9.4 million as compared to 7.4 million in the prior-year period, in line with the growth of our software implementations year over year. As a result, total revenue is 75.5 million, up 23% year over year.\n\nBefore discussing gross margins, expenses and profitability, please note that I will be discussing non-GAAP results for Q4 going forward. As a reminder, our financial results, along with a reconciliation between GAAP and non-GAAP results, can be found in our earnings press release and its supplemental financial tables. Total non-GAAP gross margin was 68.2%, as compared to 70.1% in the prior-year period, due to the absolute and relative decline of our high-margin on-premises license business, as compared to a cloud business in the quarter, as well as the decrease in the services gross margin as a function of several factors, including increased travel expense and use of subcontractors for the quarter. Non-GAAP operating expense was 55.3 million, a 13 million increase year over year as we continue to invest in sales, marketing, and product development to support our growth.\n\nNon-GAAP sales and marketing expense was 24.6 million, a 5.9 million increase year over year, as a function of increased headcount and increased marketing program spend to capture new business in our growing markets. Non-GAAP R&D expense was 16.2 million, a 3.6 million increase year over year, as we increased the headcount and made investments in our product roadmap. Non-GAAP DNA expense was 14.5 million, a 3.5 million increase year over year, in line with expected expense increases associated with being a publicly traded company. Non-GAAP operating loss was 3.9 million, as compared to our fourth quarter fiscal '21 non-GAAP operating profit of 0.6 million, primarily reflecting planned growth investments in the business.\n\nNon-GAAP net loss per share was $0.04 in the fourth quarter of fiscal '22, as compared to a loss of $0.19 in the fourth quarter of fiscal '21, primarily reflecting a year-over-year reduction in interest expense and an increase in the weighted average share count. Moving to our full year results for fiscal '22. Cloud ARR grew 48% year over year to 162.9 million. At June 30, 2022, Cloud ARR represented 60% of our total ARR, up from 52% a year ago, reflecting our cloud-first business focus and the market's ongoing shift to the cloud.\n\nTotal ARR grew 27% year over year to 270.5 million. We continue to execute our land and expand model. And at June 30, 2022, we had more than 2,100 clients, 506 of which had ARR of more than $100,000, up from 420 in the prior-year period. In addition, at the end of the fiscal year, we had 41 clients of more than $1 million in ARR, up from 31 clients at the end of fiscal '21.\n\nDue to the steady increase in ARR from upsell and cross-sell motions, we achieve an average net revenue retention rate of more than 114% in fiscal year '22, up from an average of more than 110% in fiscal year '21. SaaS and support revenue increased 34% year over year to 193 million, reflecting continued strength in the sale and adoption of our cloud solutions. Subscription license revenue was 44.2 million, primarily reflecting renewals of our subscription license business. This is a modest decrease year over year, in line with our strategy to migrate legacy clients to the cloud when they are ready.\n\nProfessional services revenue increased 42% year over year to 34.9 million. In total, revenue increased 27% year over year to 272.1 million. Before discussing full year gross margins, expenses, and profitability, please note that I will now be discussing non-GAAP results. As a reminder, our GAAP financial results, along with the reconciliation between GAAP and non-GAAP results, can be found in our earnings press release and its supplemental financial tables.\n\nNon-GAAP gross margin was 68.1%, down from 69% in the prior year. As a result of a change in the mix of our SaaS and support, subscription license, and services revenue. Overall non-GAAP operating expense was 192.3 million, a 52.1 million increase year over year, as we invested in a variety of resources in support of the growth of the business while absorbing the costs of going public. As a result, non-GAAP operating loss was 7.1 million, as compared to an 8 million operating profit in the prior fiscal year.\n\nNon-GAAP net loss per share was $0.12 in fiscal '22, as compared to $0.56 in fiscal '21, primarily reflecting a year-over-year reduction in interest expense and an increase in the weighted average share count. Turning to the balance sheet. We ended the fourth quarter with 50.8 million in cash and cash equivalents, as compared to 37.6 million at the end of fiscal '21. In terms of cash flow, our unlevered free cash flow was 15.4 million for fiscal '22, as compared to 9.4 million for fiscal '21, as we remain committed to positive free cash flow on an annual basis while investing in the growth of Intapp's business.\n\nNow turning to guidance. For the first quarter of fiscal '23, we expect SaaS and support revenue of between 55 million and 56 million and total revenue in the range of 76 million to 77 million. We expect a non-GAAP operating loss in the range of 1 million to 2 million and a non-GAAP net loss per share in the range of $0.03 to $0.05 using a basic share count weighted for the quarter of approximately 63 million common shares outstanding. For the full year fiscal '23, we expect SaaS and support revenue of between 238 million and 242 million and total revenue in the range of 324.5 million to 328.5 million.\n\nWe also expect a non-GAAP FY '23 operating loss in the range of 1 million to 5 million, and a non-GAAP net loss per share in the range of $0.08 to $0.12, using a basic share count weighted for fiscal year '23 of approximately 64 million weighted common shares outstanding. With that, John and I look forward to taking your questions.\n\nOperator\n\n[Operator instructions] Please stand by while we compile the Q&A roster. Our first question will come from the line of Kevin McVeigh from Credit Suisse. Your line is open.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nHey, thank you so much, and really just congratulations on the exceptional results and outlook. I wonder if you could talk -- maybe start a little bit with just the net revenue retention. When I picked up the number, it seems like it came in at about 114%, up from 110. And what's interesting, though I would think, maybe just tie that in because obviously some of the law firms, things like that, some of the more discretionary parts of the business I'm sure slowed around M&A, things like that, or IPOs.\n\nBut you folks are clearly powering through that. So, maybe help us understand what's driving that a little bit if we could start there.\n\nSteve Robertson -- Chief Financial Officer\n\nSure. I'll take that, Kevin. First of all, yeah, we were actually a little north of 114%. I think what we said was we averaged more than one-fourteenth for the year.\n\nAnd we, as you may remember, we raised our range a little bit a quarter or two ago. I think what's driving it really is a balanced set of cross-sell and upsell motions in the business. I mean, typically in the professional services business, it's more about cross-sell of new capability and functionality. And typically, in the financial services business, at least recently, we have a lot of upsells in terms of new users.\n\nWe get some of those in both sides of the business, but those are the leading drivers in both those two. And I think we feel that this is a, you know, good sign. The business is strong and the people -- it's just part of the land and expand strategy that's working pretty well right now.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nReally exceptional. And then, can we talk a little bit just about Billstream, and then I'll get back in the queue. I mean, I remember from the IPO, I think that was one of the parts of the offering that -- there was a gap in terms of the billing and things like that. Is there any way to think about the revenue associated with that and then from when you acquired it? And then ultimately what the potential can be as you extrapolate that across your existing client base?\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nThanks, Kevin. I'll take --\n\nSteve Robertson -- Chief Financial Officer\n\nWell -- go ahead, John.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nI'll take the concept, Steve, and then you can do some numbers. But generally speaking, you're right. This was an area that we identified in the IPO. And prior to that, we knew we had client demand for, and we actually acquired this technology from one of our closest services partners who had a very similar development model to ours that was really client driven.\n\nSo, we're very excited about this. It extends the capabilities of the Intapp platform for the firms who are using us in the operations and finance area. We've had a long history of being very strong in the time recording, AI-supported time recording category, and this moves us one step down the line toward the -- what they call the prebilling process, which helps the professionals figure out how they're going to present bills to their clients and get paid. So, it's an expansion of an existing capability, and it's very consistent with our land-and-expand concept.\n\nSteve Robertson -- Chief Financial Officer\n\nYeah. And I would just add, it's a relatively modest acquisition, Kevin, in terms of size. We are optimistic about it. We baked into our thinking for our guidance the impacts in the near term from this.\n\nBut, yeah, it's positive and that down the road, we would expect some good things from this combination.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nThanks, again, and just great job. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question will come from the line of Koji Ikeda from Bank of America. Your line is open.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nHey, John. Hey, Steve. Thanks for taking the questions. Congrats on a nice finish to the year here.\n\nWanted to ask a question on the guidance really and the confidence. What's giving you that confidence in the guidance for fiscal '23? You know, you did talk in the prepared remarks a lot of great data points on new logos, expansion deals, and even the momentum heading into fiscal '23. But given all the macro issues out there and the recession fears out there, what is giving you that underlying confidence in your guidance, you know, not only from an absolute number, but you essentially raised the growth rate to 20% at the midpoint.\n\nSteve Robertson -- Chief Financial Officer\n\nWell, I'm happy to start, John. And maybe you could -- I mean, Koji, look, the business is it truly is strong across the board. We do have some visibility out into the year in terms of our pipeline and the opportunities we're seeing in the field. Our -- yes, everyone's had some concerns about recession, and we understand.\n\nBut you know, our business, in particular, there's certain parts of the equation in the world that really aren't a factor for us, we feel. You know, we're not subject to oil shocks and logistics supply chains. And our clients are doing pretty well and are really looking to adopt our solutions and put them in and make themselves better as a firm. So, we're just seeing good balanced opportunities across the board.\n\nWe certainly run scenarios in a lot of directions about what might happen and feel pretty good about this guidance. We really do.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGreat. And then can -- \n\nJohn Hall -- Chairman and Chief Executive Officer\n\nI would only add --\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nOh, yeah, go ahead. Sorry.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nI would only add that we are looking at the possibility of inflation and recession effects on the business. But we did grow through the 2008, 2009 recession successfully as a bootstrapped business. This end market is relatively durable and has weathered downturns in the past much better than many of the other industries. So, I think it's part of our general positioning toward the professional services industry that helps us in the situation.\n\nWe're going to watch it.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nOK. Got it. Thanks, John and Steve. And just one follow-up here.\n\nThinking about services margin, you know, looks like subscription gross margin is still pretty strong at 80% plus, but services a little bit of a drag on overall gross margins. So, how do we think about margins in the services business kind of going forward from here? Thanks, guys.\n\nSteve Robertson -- Chief Financial Officer\n\nYeah. Actually Koji, I'll add to that question, it is a very important focus for ours in the coming year. We are going to -- those margins will get better as the year goes on. We are very focused on that.\n\nWe've talked for a while about having built a big organization and services that's capable of managing a much bigger book of business and to do so well. And we feel we are now at that place, and we expect to drive better margins consecutively all year long in the services business. So that's a key focus for us.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nYeah.\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks, John and Steve. Thank you so much.\n\nSteve Robertson -- Chief Financial Officer\n\nYeah.\n\nOperator\n\nOne moment for our next question. Our next question will come from the line of Matthew Kikkert from Stifel. Your line is open.\n\nMatthew Kikkert -- Stifel Financial Corp. -- Analyst\n\nHi. This is Matthew on for Parker. Thanks a lot for taking my questions. First off, I want to continue talking about the really nice NRR increase that you saw, the 4-basis-point increase over the past year.\n\nYou know, you mentioned upselling and cross-selling as drivers there. But are there any specific products, applications, or verticals that are also driving a majority of that expansion?\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nThanks, Matthew.\n\nSteve Robertson -- Chief Financial Officer\n\nWell, I -- John, did you want to --\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nGo ahead.\n\nSteve Robertson -- Chief Financial Officer\n\nYeah. I was just going to say, it actually is fairly balanced between let's say professional services and financial services. And as you know, we tend to land in a number of different places and then, therefore, expand in a number of different places. I wouldn't -- I don't think I would call out anything in particular.\n\nI think it is an aggregate -- my view is as an aggregate sense that the market sees our solutions as valuable, and we, you know, land and people are ready to continue to buy and to add to their solution set with us. It may be that our increasing cloud percentage of our business makes that a little bit easier and quicker to do, which is positive, but I wouldn't call out anything particular.\n\nMatthew Kikkert -- Stifel Financial Corp. -- Analyst\n\nOK, great. And then secondly, I was wondering if the current macroeconomic conditions have impacted the pace of any cloud migrations for any of your clients, or has it been pretty steady?\n\nSteve Robertson -- Chief Financial Officer\n\nThe cloud migrations had been pretty steady. Typically, we are doing them now often when a client is ready to buy some new cloud functionality. A number of our clients, for example, might be what we call hybrid clients. They have both some on-premises and some cloud business.\n\nThey want to buy some more cloud business, and that's the time at which it makes sense to migrate everything to the cloud. But that's been pretty steady quarter after quarter in line with our expectations in the modeling and the discussions we've had with everybody, and we see that continuing.\n\nMatthew Kikkert -- Stifel Financial Corp. -- Analyst\n\nOK. Thanks for answering the questions and congratulations on the quarter.\n\nSteve Robertson -- Chief Financial Officer\n\nThanks.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. [Audio gap] come from the line of Brian Peterson from Raymond James. Your line is open.\n\nUnknown speaker -- Raymond James -- Analyst\n\nHey, guys. This is Chase on for Brian. Congrats on the great quarter. We've seen a couple of banks out this week announcing that they're returning to office.\n\nI was just curious kind of high level, how you guys are thinking if there's any kind of impact on your end as banks start to get back to the office if they're looking to take on bigger projects or whether that's migrations or bigger upgrades, expansions, etc.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nYeah. That's an interesting question. We have started going back to the office more frequently ourselves. And obviously, some of the banks have asked their folks to come in five days a week.\n\nI don't think we've seen a ripple effect of that to the buying patterns so far. I will say that the whole COVID work-from-home change really adjusted folks' expectations of how their technology environment needed to support them in a hybrid experience or even in a highly mobile experience. And so, a lot of the demand that we're getting is still coming from this mindset change that they had to get to the cloud, and they had to get a modern infrastructure for their people because the chalk of working from home instantly a few years ago was just not satisfactory to a lot of the firms of all sizes across these industries. And so, I think that's helping us generally as a trend.\n\nAnd we'll see what the total work-from-home shift to potentially going back to the office full time has, but so far, we've seen very strong demand across the board, regardless of whether people are in a hybrid model or asking people to go back all the way.\n\nUnknown speaker -- Raymond James -- Analyst\n\nGot it. Makes sense. And then just one follow-up. You mentioned building out the go-to-market motion in Singapore in your prepared remarks.\n\nI was curious how you're thinking about kind of the initial sales hiring target that you had to fiscal year. Thank you.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nSo, I don't think we're breaking out specific numbers there. We have been in Asia-Pacific over the past decade, serving the market from Sydney, Australia, and that office has continued to grow. And as we've encountered more word of mouth and referrals, which is the general way that our business has grown into some of the other parts of Asia, Singapore was a natural place for us to expand to. So, we've opened an office there and we've put a group there.\n\nWe've actually won some clients there before we opened our office. So that's helped us. And now we're going to serve part of Asia-Pacific from that location. And we've got good demand across the region, which is exciting for us.\n\nUnknown speaker -- Raymond James -- Analyst\n\nGood to hear. Congrats on your quarter. Thanks, guys.\n\nSteve Robertson -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Terry Tillman from Truist. Your line is open.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah. Can you all hear me?\n\nSteve Robertson -- Chief Financial Officer\n\nYes.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah. Hey, John, Steve and David, and congrats from me as well. I have two questions. First question is the cloud ARR, tremendous growth, you're going to have to deal obviously with the law of larger numbers, but anything you can share about, just given what you've got with your pipeline, the market opportunities, the expanded products, how we should think about the cloud ARR momentum continuing through the year, and is there any seasonality? And kind of related to cloud ARR, could that have a continued nice step-up, the 60%, how to think about the step up from 60%? And then I had a follow-up after that.\n\nI think that became a three-part question.\n\nSteve Robertson -- Chief Financial Officer\n\nWell, I'm happy to start. The step-up will continue regularly as we go forward. We're selling all new cloud and those percentages from 60 will keep moving up regularly. And then on top of that, we're doing some modest migrations every quarter and every year as we've discussed.\n\nI don't think there's any meaningful seasonality. I mean, there's a little bit. We have had a history of a little bit of seasonality in professional services, as you may remember, but generally speaking, this should march pretty sequentially pretty regularly. And yeah, other than the law of large numbers, as you say, we don't see anything stopping the momentum we're having now in the cloud sales business.\n\nSo, we would expect pretty good -- pretty reasonable continued progress there.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nOK. Got it. And you have two major kind of flagship product areas serving different markets, but I mean, I've been impressed today to hear about some brand-new things going on, real estate investments and kind of just real asset markets and then potentially into this in-house legal market. Can you kind of stack rank those two opportunities and just share with us, maybe how needle moving they could be individually as it relates to cloud ARR? Thank you.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nThanks, Terry. We're excited about both of them. On the real estate side, historically, the DealCloud business got started mainly in the private equity firms, the classic private equity firms. And over the years, we've moved up to some of the largest of those.\n\nAnd when you get upmarket, you enter a category of firm that's doing many different investing strategies of which private equity is just one and real estate is another adjacent. And some of our largest clients asked us, can you help us with real estate too? And as we looked at it, we discovered how similar the coverage model is, and the whole industry-specific data architecture that we have in the industry graph data model that we built into the system that really differentiates it from the traditional CRMs was perfect for supporting them with the real estate investing strategy as well. So, we had to change some of the data that we bring in. We had to create some more capabilities to look at real estate-specific information like geographic map information, but we were able to do that.\n\nAnd once we were able to serve some of these large multistrategy firms with a more well-rounded whole solution, we were able to enter the real estate investing category generally, including the firms that invest specifically in real estate and don't have, for example, a private equity component to their business. And it's a huge space in private capital. So, it's a growth area for the private model of asset management is just the way that private equity is a growth model versus traditional public markets. And we have a fantastic system that serves that.\n\nSo, we think there's going to be a lot of growth there for a long time. Private equity is still growing itself, and there's more within that, that we can build out going forward. So, we're very excited about that as an expansion for us. And then in-house legal, we have a long history serving the law firms, the large partnerships that are working on legal deals, advising on deals and disputes.\n\nAnd there's a circulation of professionals from the law firms to the in-house legal departments and back over the careers of these folks. And we've had more and more referrals and demand from people who said, oh, I used Intapp in my law firm. Can I use it here too? And it turns out -- that's a very large section of the lawyers working in corporate deals in-house. And so that's a space where we're getting natural client-led market expansion to a second adjacency.\n\nAnd we're excited about both of them because they're good examples of this industry-specific data architecture serving, the professionals working in a whole range of areas. And it's one of the reasons why we think that this SAM and TAM that we're chasing is actually quite a significant underserved industry where the professionals working on these deal types and the advisors advising on these deal types across the market have just been underserved over the years. So, we're optimistic about what we can do in each of those in addition to the markets that we started in.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nThat's great. Thanks for the color.\n\nOperator\n\nThank you. One moment for our next question. And our next question will come from the line of Brian Schwartz from Oppenheimer. Your line is open.\n\nBrian Schwartz -- Oppenheimer and Company -- Analyst\n\nYeah. Hi, John and Steve. Thank you for taking my questions this afternoon. One for John and then one for Steve.\n\nJohn, I was just wondering if you talk a little bit more about what you're seeing in the evolution of the pipeline specifically, just curious if you're seeing the same cadence of the number of opportunities or projects that are entering the top of the funnel, then say, what you saw three months ago or even earlier this year. And then the question for Steve is just in regards to kind of the guidance as you thought about the guidance. I was just wondering if you pushed it all for more pipeline coverage when you formulated your guidance given kind of the potential issues that could emerge given the macro conditions that we're facing here in the second half of the calendar year. Thanks.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nThanks, Brian. So, we're watching the pipeline carefully. We have not seen an impact from macro change on the number of deals or sales cycles and it gives us some confidence that there's some strong fundamental demand here. Obviously, everybody is watching the economy and we'll see what happens, but so far specific to your question, no, we haven't seen a change in the last three months or otherwise.\n\nSteve Robertson -- Chief Financial Officer\n\nYeah. And Brian, no, I don't think that we are pushing anything here in terms of guidance, in terms of more coverage. I think we are seeing more pipeline -- we've been seeing more pipeline for a while, which is why we feel comfortable here in part with our guidance and the way that business is moving here for momentum perspective and it's balanced. And as John just said, we've got some new opportunities that are starting to develop.\n\nSo, no, I think, but we certainly -- look, we've run scenarios. We've thought about and tried to think -- work through some of the macro issues out there and we've landed in a place we feel comfortable with, definitely, so not pushing here necessarily at all. Just this is how it feels the way the business is running right now.\n\nBrian Schwartz -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nThank you. There are no further questions in the queue. I'd like to turn the call over to John Hall for any closing remarks.\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nWell, thank you all for spending some time with us. We're excited to be kicking off fiscal '23 with some strong momentum here. I'd like to say thanks again to the whole team for helping us execute, especially successful first year as a public company, and to you all for spending some time learning about us and covering us. We'll look forward to talking to you in just eight weeks at the Q1 report.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid Trone -- Senior Vice President, Investor Relations\n\nJohn Hall -- Chairman and Chief Executive Officer\n\nSteve Robertson -- Chief Financial Officer\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nKoji Ikeda -- Bank of America Merrill Lynch -- Analyst\n\nMatthew Kikkert -- Stifel Financial Corp. -- Analyst\n\nUnknown speaker -- Raymond James -- Analyst\n\nTerry Tillman -- Truist Securities -- Analyst\n\nBrian Schwartz -- Oppenheimer and Company -- Analyst\n\nMore INTA analysis\n\nAll earnings call transcripts"
}