{
  "companyName": "Academy Sports and Outdoors, Inc.",
  "companyTicker": "ASO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/academy-sports-and-outdoors-inc-aso-q2-2022-earnin/",
  "content": "Academy Sports and Outdoors, Inc. (ASO 0.25%)\nQ2 2022 Earnings Call\nSep 07, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to the Academy Sports and Outdoors second quarter fiscal 2022 results conference call. [Operator instructions] I will now turn the call over to Matt Hodges, vice president of investor relations for Academy Sports and Outdoors. Matt, please go ahead.\n\nMatt Hodges -- Vice President, Investor Relations\n\nGood morning, everyone and thank you for joining the Academy Sports and Outdoors second quarter 2022 financial results call. Participating on the call are Ken Hicks, chairman, president, and CEO; Michael Mullican, executive vice president and CFO; and Steve Lawrence, executive vice president, and chief merchandising officer. As a reminder, statements in today's earnings release and the comments made by management during this call may be considered forward-looking statements. These statements are subject to risks and uncertainties that could cause our actual results to differ materially from our expectations and projections.\n\nThese risks and uncertainties include but are not limited to the factors identified in the earnings release and in our SEC filings. The company undertakes no obligation to revise any forward-looking statements. Today's remarks also refer to certain non-GAAP financial measures. Reconciliations to the most comparable GAAP measures are included in today's earnings release which is available at investors.academy.com.\n\nUnless otherwise noted, comparisons are 2021 with 2019 comparisons also provided where appropriate to benchmark performance given the impact of the pandemic in 2020 and 2021. I will now turn the call over to our CEO, Ken Hicks.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThank you, Matt. Good morning, and thank you all for joining us today. Our performance this quarter was in-line with our expectations. We remain confident that the durability of our strong assortments and everyday value model positions us well to deliver consistent sales and profitability growth going forward.\n\nThis growth is supported by operational excellence, healthy inventory levels, a strong balance sheet, new store expansion, and omnichannel advancement. The Academy team remains focused on executing our priorities to achieve our vision of becoming the best sports and outdoor retailer in the country, while delivering a great experience for our customers and creating value for our stakeholders. Part of our plan to achieve this vision is by expanding our footprint and bringing more fun to the rest of the country. I'm excited to announce, we opened our second store of 2022 in Panama City, Florida during the second quarter.\n\nIt is our first location in this market and our 13th store in Florida. So far in the third quarter, we've opened two additional stores, one in Richmond, Virginia, a new market for us, and another one in Atlanta, Georgia, an existing market we continue to build out. These stores, bring our total open so far this year to four stores with five more expected to come in 2022. While it is early, the new stores opened in 2022 are overall exceeding our initial sales expectations, which is a good indication that customers are drawn to our broad assortment of top national and high-quality private brands at an everyday value.\n\nThanks to all of the team members who helped execute these highly successful store openings. We're excited to be in a growth mode and expect to open nine new stores this fiscal year and 80 to 100 stores over the next five years. Academy stores have the highest store productivity in our peer group making our new stores a compelling use of our capital with a high return on investment. As I mentioned on the last call, our expansion plans consist of three distinct opportunities.\n\nFirst is building scale in existing fast-growing markets like Atlanta, Georgia, where we've opened two new stores in the past four months and now have 12 locations. Second is expanding into adjacent markets like Panama City, Florida, where we just opened and Lexington, Kentucky, where we will open a new store later this fall. And third is opening a new markets such as Richmond, Virginia, where we opened in mid-August, and West Virginia later this year. As we continue to expand the store base over time, we believe this will increase brand awareness leading to market share gains as well as omnichannel growth due to our high penetration of buy online, pickup in-store sales.\n\nI'll now provide a high-level overview of our second quarter results. The quarter presented similar macroeconomic challenges as the first quarter and the team demonstrated once again their ability to perform in a tough environment. Our reported sales and negative 6% comp versus last years were in line with our expectations. These results were strong 36% sales increase versus 2019 through the second quarter as the business continued to substantially outperform our pre-pandemic levels of sales and profits.\n\nOur best customers have remained resilient throughout the challenging economic environment, while our value offering continues to resonate. We expect the sales trend compared to 2019 to hold for the remainder of 2022. While each of our four merchandise divisions sports and recreation, footwear, apparel, and outdoors saw a decrease in their year-over-year sales when compared to the second quarter of 2019, each merchandise division grew by at least 20% with outdoors and sports and recreation, each increasing by more than 45% over 2019. This highlights the fact that each of our merchandise divisions remains substantially higher than pre-pandemic levels.\n\nSteve will discuss our merchandise results in more detail later in the call. During the quarter, we were very pleased with our positive e-commerce sales performance, which grew 12% versus last year. We continue to invest in technology to accelerate our omnichannel growth and create a seamless engaging customer experience. For example, we've added new mobile payment options like Google Pay and Apple Pay in full, and we will be launching store wayfinding on our app later this year.\n\nWe will continue to invest in and deploy technology across our stores, omnichannel and supply chain to enhance the customer experience. These investments are yielding strong results as we continue to see our omnichannel business grow, store productivity increase, inventory assortment and in-stocks improve, and our customer survey scores at record levels. Our adjusted earnings per share were $2.30. This was driven by our ability to sustain our gross margin rate above 35% and effectively control costs.\n\nOur gross margin rate is expected to remain in line with our full-year guidance, leading to strong cash flow generation and profit growth. Looking ahead to the third quarter and the remainder of the year, we had a good back-to-school season and expect comparable sales to continue to sequentially improve as we go through tailgating, hunting and follow sports and move into the holidays. As I've stated before, Academy Sports and Outdoors is a different company from four years ago and is poised to utilize its operational excellence and strong balance sheet to profitably grow through new store expansion and omnichannel growth. I'll now turn the call over to Michael to provide more details on our second quarter financial results, discuss our capital allocation efforts, and provide an update on our 2022 guidance.\n\nMichael?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nThanks, Ken. Good morning, everyone. Academy once again delivered solid earnings-per-share growth on an expected sales decline, demonstrating our earnings potential and our ability to deliver strong results in a challenging environment. In the second quarter, comparable sales declined 6%, an improvement over the first quarter, while earnings per share increased by 12% compared to last year.\n\nNet sales were $1.69 billion, a decline of 5.8% compared to the second quarter last year. The sales decline was a result of fewer transactions this quarter compared to the prior year, but was partially offset by an increase in average ticket driven by higher unit prices. On our last call, we discussed how we are benchmarking performance of 2019, which was our last normalized year prior to the pandemic. In the second quarter, sales increased approximately 36% versus 2019, which was consistent with the 36% growth we reported in the first quarter.\n\nIn addition, the overall shape of the sales curve neared the 2019 trajectory, but at elevated volume levels. Our e-commerce sales increased 12% compared to Q2 2021, making it the fourth consecutive quarter of double-digit sales growth. The penetration rate continues to improve as well, ending at 10% of sales compared to 8.4% in Q2 2021. When compared to Q2 of 2019, our e-commerce business has grown approximately 245% and the penetration rate has increased by 610 basis points.\n\nOmnichannel is an important part of our long-term growth strategy and we continue to invest and enhancements to academy.com the mobile app and our store-supported omnichannel sales such as ship to store, BOPIS, and ship from store. These investments will further enhance the customer experience, expand the Academy's reach to new customers and drive further operational efficiencies. We also expect academy.com to get a sales lift from an increase in brand awareness as we open more stores in adjacent and new markets. As Ken mentioned, our new store openings are ramping up.\n\nYear to date, we have opened four of the nine stores currently planned for 2022. The early success of the new stores demonstrates our confidence that our business model of providing a broad value-based assortment of top national brands and private label products for the whole family resonates with customers. In tough economic times, customers tend to seek out value. So we believe we are well-positioned to meet that need with our broad selection of good, better, best products at compelling price points.\n\nAll of the new stores are expected to meet our general new store operating model. So we anticipate these stores will first have a return on invested capital of at least 20%, second, ramp to maturity in four to five years; and third, the EBITDA accretive after the first full year being opened. During the second quarter, our existing store productivity was once again very strong. Trailing 12-month sales per square foot were $356 and trailing 12-month operating income per store was $3.4 million.\n\nAs a reminder, 100% of our existing stores are profitable and accretive to earnings, which gives us great confidence in our future growth potential. Moving to gross margin. Our gross margin dollars were $596 million with a rate of 35.3% only 60 basis points below last year's 35.9% which was the highest in the company's history. Through our merchandising efficiencies, we increased our merchandise margins compared to last year.\n\nThe increase in merchandise margins was offset by an increase in e-commerce shipping and freight costs compared to Q2 2021. This increase was driven by the growth of our e-commerce business and also from higher import costs as private label sales were a higher percentage of our total sales mix. During the quarter, SG&A expenses were 20.1% of sales, a 160 basis point decrease compared to Q2 2021. The change was primarily a result of lapping the non-recurring expenses associated with the accelerated share vesting in the second quarter of 2021.\n\nExcluding this non-recurring expense, SG&A expenses increased 70 basis points, primarily due to fixed cost deleverage. Operating income for the quarter was 15.2% of sales or $256.7 million flat to last year or 43% higher than all of fiscal year 2019. In total, we delivered net income of $189 million for Q2. On an adjusted basis, net income was $195 million making this quarter the second most profitable quarter in Academy's history.\n\nSecond quarter GAAP diluted earnings per share were $2.22 per share compared to $1.99 per share in Q2 2021. Adjusted diluted earnings per share were $2.30, compared to $2.34 per share in Q2 of 2021. Now for an update on our balance sheet and liquidity position. We ended the quarter with $400 million in cash and had no outstanding borrowings on a $1 billion credit facility.\n\nDuring the quarter, we generated $161 million and net cash from operating activities. Given our strong cash generation, we were able to execute on each of our capital priorities by repurchasing 5.6 million shares for approximately $200 million paying a dividend of $0.075 per share, investing in our strategic growth and performance priorities and maintaining a strong cash balance. In addition, the board recently declared a dividend of $0.075 per share payable on October 13, 2022, stockholders of record as of September 15, 2022. Regarding inventory, our planning and allocation initiatives have ensured that we are properly stocked with the best value and assortment across all categories for the fall season.\n\nOur ending inventory balance was $1.3 billion, a 17% increase compared to the second quarter of last year. When compared to Q2 of 2019, inventory dollars were up 8.4% and units declined by 12% on a sales increase of 36%, demonstrating that while sales have increased significantly, we have effectively managed our inventory. That brings us to guidance. Based on our results and current trends, we are reiterating our full-year net and comparable sales guidance while updating our earnings per share forecast to reflect the reduction in our share count.\n\nThe updated full-year guidance is as follows. Net sales are still expected to range from $6.4 billion to $6.6 billion, with comparable sales down 6% to 3%. Our gross margin rate for the full year is still expected to range from 33% to 33.5%. GAAP net income is still expected to range from $550 million dollars to $615 million.\n\nGAAP diluted earnings per share are now expected to range from $6.50 per share to $7.25 per share. Adjusted diluted earnings per share which excludes certain estimated expenses such as stock compensation and store preopening expenses are now expected to range from $6.75 per share to $7.50 per share. The earnings per share estimates are calculated based on an updated share count of $85 million diluted weighted average shares outstanding for the full year. The EPS outlook does not include any further repurchasing activity for the year.\n\nWith that, I will now turn the call over to Steve for more details around our merchandising and operations performance. Steve?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nThanks, Michael. As you heard earlier, our Q2 sales came in at $1.69 billion, which is a 6% decline versus 2021. Breaking the sales down by category, our best performing division in the quarter was sports and recreation, which was down 2.5% versus '21, but up 47% versus 2019. The team sports business continued to be extremely strong with football, golf, baseball soccer, all being key contributors.\n\nWe also saw strength in some of the recreation categories such as water sports and outdoor furniture. Fitness remains the most challenging category in this area of business but we've seen it stabilize over the past couple of quarters at over a 30% increase versus 2019 pre-pandemic levels. The footwear division was our second-best business at down 4% versus last year, but up 22% versus 2019. Similar to sports and rec, we saw continued strength in our team sports cleated business where demand continues to outpace supply.\n\nOther bright spots included children's shoes, only big brands such as Crocs, Skechers, Adidas and Puma, which all ran increases for the quarter. We're also excited to launch HEYDUDE in all stores in July to some time for back-to-school. We're seeing strong early results and expect HEYDUDE to be a sales driver versus the remainder of the year. Apparel sales came in down 6% versus last year, but were up 29% versus 2019.\n\nReceipts and inventory levels steadily improved over the course of the quarter. The outdoor license apparel business has led the way in this division during Q2. Our athletic apparel business was a little softer during the quarter, which we primarily attribute to not having the optimal mix of lightweight tops and shorts inventory as we entered the quarter. We did see the trend improve as we turn the corner into back-to-school selling season, we believe our inventories are better balanced and well-positioned to drive sales in the back half of the year.\n\nOur outdoor business was down 9% versus last year, but was up 46% versus 2019. Camping was the strongest business in this category running a positive comp for the quarter. Both our Field and Stream businesses were down versus last year, but in aggregate continue to run well above 2019 levels. The supply chain across most of our outdoor business has improved and while not totally back to normal, we are seeing inventory and in-stocks maintained at much higher levels than we had been at over the past couple of years.\n\nWe believe our improved inventory position in both these categories positions us to take advantage of the upcoming earning season along with the holiday gift shopping opportunity. Turning to margins. We continue to hold on to most of the gains we've made over the past couple of years. Gross margin rate for the quarter came in at 35.3%, which was down 60 basis points versus 2021 was up 420 basis points versus our 2019 baseline.\n\nBeneath the surface, our merchandise margin was up 20 basis points versus last year, which was the same increase we ran in Q1. All the hard work the teams have done over the past couple of years around approved buying and planning and allocation disciplines have allowed us to absorb the uptick in promotions during Q2, while still seeing increases in our merchandise margins. Looking forward, we expect the second half of the year to be more promotional than the first half and we've accounted for this increased discounting in the guidance Michael discussed earlier. That being said, we expect to maintain most of the margin gains for the past couple of years and we're confident that our everyday value pricing coupled with our promotional strategy, Hicks is very competitive and allows us to maintain our position as the value leader in our space.\n\nMoving on to inventory. Our teams have done an outstanding job in managing through what continues to be a challenging environment. We ended the second quarter of inventory up 17% versus last year, only up 8% versus 2019 in terms of dollars and down 12% units. Similar to the last quarter, the primary driver of the delta between inventory dollars and units versus 2019 is the increase in bigger ticket hard goods categories as part of our inventory and sales mix.\n\nOutdoors, sports and rec have grown to 53% of the business this year compared to 49% of total sales in 2019. Reminder of the variance is driven by the expansion over time of the better and best offerings in our assortments along with some cost inflation. Heading into the back half of the year, our inventories are much better balanced across various businesses with in-stock improvements across every category. Additionally, the overall quality of our inventory is in a much better position this year and many of the key brands that we ran late in last year such as Nike, Adidas, Under Armour and YETI.\n\nMany of our fall holiday receipts last year landed 30 days to 90 days later than we would have liked. We moved the initial sets for these businesses back to the traditional timeframes when you walk our stores, you will see that we're ready to take advantage of the natural fall traffic will come in shopping for hunting and tailgating along with polar categories such as outerwear, fleece and fire pits. Another sales driver for us is continuing to lean into new brands and initiatives that resonate with the sports and outdoor customers in our markets. In addition to the aforementioned HEYDUDE launched it back-to-school, you'll see several new brands and ideas popping up across the stores, such as [Inaudible].\n\nWe're also fun trends inspired by TikTok such as the SplatRBall craze which we rolled out to all stores. Probably the idea we're most excited about, it's a second major limited-time cross-brand collaboration that we just launched, which is our Shiner Plus Magellan capsule products. We partnered with Shiner Brewing, which is headquartered in Texas, but widely distributed across our footprint to deliver our most extensive collaboration ever. We position this initiative at the front of our stores a couple of weeks ago to help kick off the tailgating season.\n\nCategories in this collection included co-branded items such as t-shirts, fishing shirts, hats, koozies, chairs, canopies, grills and even coolers. So we've been on the floor a couple of weeks, but it has sold extremely well. We believe building collaborations with brands that resonate with the Sports Now for consumer can be a traffic drive initiative that we add to our playbook moving forward. Teams have worked hard to stabilize the supply chain and get back in stock and we should be able to maintain a much better inventory position across virtually every category throughout full and heading into holiday.\n\nOur everyday value offering when coupled with the softwood promotional cadence on key seasonal categories continues to set us apart from our competition and reinforce our position as the value leader in our categories. We also believe that more controlled distribution by key vendor partners will continue to be a tailwind for us by following shoppers looking for the best national brands in sports and outdoors into our stores. Finally, we continue to remix our marketing spend and lean into more digitally targeted advertising while reducing reliance on traditional broadcast and print. This will continue to improve our overall marketing reach and effectiveness.\n\nIn closing, we believe that we have the proper strategies in place and are well-positioned to drive the business, pick up market share during the remainder of the year. I'd now like to turn the call back over to Ken for some closing comments. Ken?\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThanks, Steve. In closing, we've demonstrated consistent strong operational and financial performance in any environment, which is the direct result of the many improvements we put in place long before the COVID-19 pandemic to achieve our vision of becoming the best sports and outdoors retailer in the country. I'm pleased with the sequential improvement in our comp sales and profitability versus Q1 and believe that Academy is well-positioned to be the everyday value retailer of choice. We also have tremendous growth opportunities ahead of us, whether new stores, omnichannel or existing stores from operational improvements with numerous avenues of growth and the cash flows to support it.\n\nI would like to close by thanking all of the Academy Sports and Outdoors team members for their continued hard work and commitment to our vision of becoming the best sports and outdoors retailer in the country. We remain excited and confident about Academy's future and appreciate your support. Thank you, and we'll now open up the call for your questions.\n\nOperator\n\n[Operator instructions] Our first question come from the line of Chris Horvers with J.P. Morgan. Please proceed with your questions.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks, and good morning. Can you talk a little bit about what you've seen in terms of consumer behavior around trade down? You mentioned you had a good back-to-school season, but how did the consumer behave when gas prices spiked and then receded? Did that trend versus 2019 stay consistent over the quarter and is that also true on a quarter-to-date basis?\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nHi, Chris. Thank you. We are seeing, the consumer continue to be interested in our category sports and outdoors and what we are seeing is interesting in that there's somewhat of a barbell effect that those consumers that are interested and the enthusiast are buying continue to buy at the higher end. But we are seeing some of the consumers shift to our private label.\n\nAnd so that's why as Steve said our private label business was better in the quarter and so they are looking for the value that that's offering. But that's said, we continue to see the consumer shopping for the categories that we sell and one of the things, I think that's important is we sometimes talk about what's discretionary and what's not discretionary. And I think many of the businesses that we have, the consumer, even in tough times, the kids still going to play baseball and soccer. The person who's into outdoors is still going to go camping or fishing and the families are still going to barbecue.\n\nAnd so we're seeing a lot of those categories continue to be strong and at a much higher level than they were pre-pandemic.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nThis is Steve. I'll just add a couple of pieces of color. So to Ken's point, you see on one hand private label be very stronger in the quarter. On the flip side, you see a brand like YETI, that really strong business, which is one of the more premium brands in our assortment.\n\nSo it is kind of a bifurcated result there. I would also say you asked around kind of the shape of the quarter, one of the things certainly as we go through quarter by quarter, month by month, you see a little bit of variance, one month maybe is a little better than that 36% average, another month maybe a little bit below that, but it keeps returning back to that roughly 36% increase versus 2019 and that's really kind of how we forecast the business as we look forward.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYes. This is Michael. Just really quick one to add. A lot of that strength in private label has been driven by newness in the private label with Freely, Right of Way, Magellan Pro and some others.\n\nSo we're certainly happy with the way that we're managing that business.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then, my follow-up is for you Michael. As you think about -- probably thinking about working capital this year and free cash flow generation. And how do we -- should we think about a minimum cash balance as we think about the potential for additional share repurchase later this year.\n\nObviously, at this point, you're probably full of inventory, so you got maybe a seasonally low point from a cash balance perspective, but one would expect -- one would think that cash becomes a source of funds into the back half of the year and so just try to think about the potential for additional share repurchases?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYeah. A couple of things. Look, I think others are full of inventory. We have the right amount of inventory in a good level.\n\nWe've managed that well as we compare it to 2019. Look, I think one of the many positive that this quarter illustrated is our tremendous earning potential in a tough environment and again some really tough comparisons. In addition to having the most profitable quarter we've ever had from an earnings per share standpoint. We were able to post EBIT and net income rates that led the sector.\n\nIn fact, I think in specialty retailer there at the tip top of the head, we have a double-digit free cash flow yield, which makes these discussions on capital allocation possible. We certainly have the cash to invest. With that in mind, our approach hasn't changed. We are generating enough cash to do everything approach to capital allocation.\n\nThe first thing that we consider is the point that you mentioned around stability. We want to maintain a cash flow that allows us to be nimble in a variety of environments. I think we've done that. We're there and we plan to manage that way.\n\nThen got a $1 billion less debt than we had a few years ago. Secondly, we want to make sure we can fund our growth initiatives. And conservatively, we have the ability to add hundreds of more stores. We announced plans for 100 within the next five years.\n\nWe mentioned last quarter that Conyers was the best store than we've had that we could go back and find. Panama City opened in the second quarter that topped Conyers. So we certainly feel like we've got the store opening program figured out and want to make sure that we're hitting our targets there for 100 in the next five years. academy.com has grown 250% since 2019 posted its fourth quarter and a row of double-digit growth, we're going to continue to fund academy.com.\n\nWe can do all of those things. We still have cash left over to return to shareholders, which we did in the second quarter. The board announced an additional $600 million repurchase authorization and we've -- in the past few years bought back three times what we raised in the IPO. We're going to take to evaluate it, be opportunistic.\n\nWe certainly think the stock is a good value, which is why we purchased a fair amount last quarter and we'll continue to look at that. The punch line is we can do all three.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks very much. Best of luck.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThanks, Chris.\n\nOperator\n\nOur next question is coming from the line of Simeon Gutman with Morgan Stanley. Please proceed with your questions.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey. Good morning, everyone. Hope you're good. I wanted to ask about the promotional environment.\n\nYou mentioned that you still did well despite the uptick. Maybe talk about if there's anything structural that you could point to that's changed pre-COVID? And then dig in a little bit to it, is it because the mix is helping? Is it the magnitude in each category or initial markups higher? So just a way to think about why this backdrop can continue?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nYeah. This is Steve. I'll take first stab at answering the question. So we've talked a lot about in previous calls.\n\nStructurally, we've done a lot of work beneath the surface to be better managers of our business, which I think has given us the lion's share of the increases. We've had multiple initiatives cross merchandising, planning and allocation in terms of better inventory management, better flow, better localization efforts. We've really dramatically improved our markdown process, timing and cadence to get much more current with our inventory. So I would say a lot of those things are structural and are kind of stick to the ribs and we think we're going to help to sustain the margins.\n\nI'd also say that another thing that I think helps within the quarter is we don't have inventory overhang to deal with. We've been very, I think smart about how we've managed the inventory up 17% certainly versus last year. I think it's up 8% versus where we were in '19 and dollars were down about 8% units, actually 12% units. So we've really been thoughtful about as the supply chain is starting to get a little more normal although not quite back to normal, making sure we control those inventories.\n\nSo I think that allowed us to be very thoughtful about putting promotions back in as we've made it to be competitive. We certainly think that the back half of the year is going to be more promotional than it was last year, certainly around holiday. We've got that baked into our guidance as we think about it. And then the offsets we have are the structure improvements I mentioned.\n\nYou mentioned mix, mix helps out a little bit as the soft goods side of the business becomes a bigger percentage of the total. But we feel really good about where we're positioned and our ability to deal with promotional environment that we see ahead of us.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThere are a couple of other things, I think that have helped us. One is our suppliers in some cases have cut back from some of the promotional people who were more promotional and they're no longer in the business and therefore promotions have become more rational. We will continue to utilize our value proposition and have promotions at key times and react to promotions that are out there competitively. But we have not seen the level that there was prior to the pandemic and that's been beneficial.\n\nBut I think the most important thing is what Steve said that the actions that we've taken to improve our operations in the planning allocation, pricing are a bigger factor. And those are stick to your ribs as Steve said, but also those use AI to continue to improve over time, so they will last. We will continue to get improvements from them for some time to come.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAnd then maybe a follow-up, thinking about the backdrop for demand in the category either rebasing or digesting the consensus models and that it's basically rebasing this year and then grows next year. You mentioned fitness as a category that you're starting to see units, I think, flatten out. Can we look at that as an example that you're seeing stabilization in some of the big COVID winners? And then is it fair to say, all clear that as a category we can start to see that grow again?\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYeah, Simeon. I think it's important to realize it is -- people talk about normalization. It's really not normalization, it's stabilization. You use the exact right word.\n\nAnd so it's stabilizing at a higher level. And we do anticipate those starting to pick up and grow again. People didn't buy a treadmill in 2020 because they thought they were going to buy one in 2023 that has stabilized at a higher level and we believe that we'll pick up those categories like that will pick up as we go forward.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nOne additional piece of color to that, so to Ken's point, you take categories like fishing and firearms and ammo and fitness and bikes and trampolines and all those categories that were COVID winners. They certainly searched during the pandemic. They're dropping versus a wider stabilizing kind of at that level. But the point I think to make is on average we're off about 36% versus '19.\n\nIn aggregate, all of those categories are well above that number.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYeah. Ken has used his analogy of going from Denver between Galveston and Denver. They've kind of rebaseline to somewhere on the Colorado Plateau. substantially higher than 2019 and at much higher levels.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYeah. He won't let me use towels anymore because it's just not everybody knows where that is. The Colorado Plateau is, I think, are relevant.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThanks, guys. Good luck.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question is coming from the line of Michael Lasser with UBS. Please proceed with your questions.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks for taking my question. In light of the gross margin performance this quarter, does that change how you think about the long-term sustainable run rate gross margin for the business you previously size that 32% to 33%. Is it higher now?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nWell, it certainly can be. But I think right now, we'll stick with what we've said in the past. I mean that's -- we feel very good about the 32.5% to 33% and it certainly where this year is playing out, we could be stronger than that. But I don't think there's any long-term change in our perspective.\n\nIt depends, frankly on the level of promotion that comes into the marketplace. We feel very comfortable with things that we can control around managing our inventory and our merchandise mix.\n\nMichael Lasser -- UBS -- Analyst\n\nAnd then my follow-up question is, if we trended out the three-year geometric stacks. It would suggest that Academy is going to have a flat comp by the fourth quarter. Is that the right way for us to be modeling and projecting the business over the next few quarters? Thanks.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYeah. I mean, we'll stand by the guidance that we provided and you can kind of sort through that. But certainly, we would expect to see some sequential improvement throughout the year.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you very much. Good luck.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nThanks, Michael.\n\nOperator\n\nOur next question is coming from the line of Daniel Imbro with Stephens. Please proceed with your question.\n\nDaniel Imbro -- Stephens, Inc. -- Analyst\n\nYeah. Hey. Good morning, guys. Thanks for taking the questions.\n\nI wanted to ask a different one on inventory. You mentioned inventory is up 8% versus '19, I think sales are up 36%. I guess my -- how much of that is reflective of strategically, you guys running just more efficient stores? And how much of that is maybe inventory you want or maybe sales you left on the table due to a lack of inventory? Where should or where would you like inventory to be maybe versus that headroom?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nI'll let Steve take this because his team has been the one that's been -- that's managed it. But I'll just say very quickly, we're very comfortable with the inventory that we have. Yes, it is strategic. I mean, we have the opportunity to be more efficient with our inventory and we've been speaking about that for several years, but I'll let Steve kind of take it from here and talk about some of the stuff they're working on.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nYeah. So I think we feel actually very comfortable with where we're sitting today. It's up 8% in dollars, I think it's down 12% units. If you went back to our stores back in '18, '19, what you would have seen was, what we call top stock.\n\nThere was a lot of inventory brown corrugated boxes stacked on top of the gondola runs. We were carrying too much inventory. It was very inefficient. The goods would come in, that go into the top stock.\n\nWe didn't know where all the inventory was because it was written in cardboard boxes. So that 12% reduction in units really came out of that top stock. And so what you're seeing now, I think, is a much more efficient flow of goods through the distribution center to the store that hits the back dock, it goes out onto the sales floor versus going into some sort of top stock or back stock situation. So we feel really good with the unit inventory that we're carrying.\n\nWe feel it's appropriate to where we are right now.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nLook, you can always jam the stores and squeeze a couple of basis points of comp out of the equation, but that's not how we're going to play the game. We're comfortable with the way we're managing it. We're going to drive a profitable business and flow inventory and operate more efficiently.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nAnd just one last thing, we're not perfect in terms of where our inventories, I mean there's still a couple of calibers and ammo and firearms here and there that were a little light on. We still probably could use a little more cleated inventory. But in general, we're back in stock in most of the categories and where we'd like to be.\n\nDaniel Imbro -- Stephens, Inc. -- Analyst\n\nOK. Great. That's helpful. And then as a follow-up, I wanted to ask on the new stores.\n\nI think you guys mentioned Panama City is even outperforming the one in Atlanta. Are you seeing outperformance in certain categories? And I guess, I'm curious what are you learning in terms of marketing spend? Are you able to be more strategic than you thought? Just trying to think as we move forward, how -- what kind of room for efficiencies on the cost to build marketing? Can you improve upon on the store opening cadence as we think about accelerating it over the next years.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYeah. I'll start and let Michael pick up, but we are learning. One of the reasons why we open the fewer number of stores this year and we started with one, two, and we'll open more this fall was we are getting a better understanding of what to do on all of the aspects that you had. When we open a new store, the mix quite frankly usually starts out on the hard lines of the store as people learn about us and then the soft lines catch up.\n\nSo we are seeing that trend continue in most of the stores. Although in some of the stores, soft lines have been a better portion. We are getting smarter about the marketing that we do and because of the way we're opening stores, our marketing is going to vary and it's one of the reasons why we mentioned we opened a store in Shore Bank, which -- I mean short pump, which is an area where we had not been in before to understand how we go into a new area versus an area like Atlanta where we had a presence and people knew what Academy was. And those are helping us and we're going to evolve and improve the marketing.\n\nThe good news is that as we said, overall, they're performing ahead of expectations. And another good thing is we are not having issues getting people to work in the stores, say, we appear to be a place where people look forward to working and want to work in the store. So I think that we are seeing a good result, but there's still a lot of things that we can learn from them. And one of the things that Steve and Michael are doing is after each of the openings we've had pretty intensive after-action reviews even though they were good openings to really take the lessons learned so we can improve.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nNot a lot to add there other than keep in mind, we haven't done this since 2019 and most of the team that's working on it is new. So everything we do, we're going to learn from it. This is very much a test and learn here. We've got new markets.\n\nWe've got existing markets. We've got adjacent markets. We're going into takeover spaces for the first time early in about a decade. Panama City was a takeover space in a good area of town.\n\nWe've got stores in more urban environments and we've got a team that's got an appetite to learn. So we're using this year as a learning year as we ramp. And all of the things that Ken said, we're focused on marketing, merchandising and across the board. We've got a team that gets together after every one of these and goes to the key learnings we can maximize our success going forward.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nI'd say the biggest change between store openings this year versus what we opened in '19 would be two things. First, localized assortments. I think we're better at localizing assortments than we were three or four years ago. And so the question you asked is, do we see certain categories not perform others? Yeah.\n\nI mean, when you go into Panama City fishing, it's doing heck a lot better there than it did at Conyers, right? And that's because we went in, had a good sister store process, really studied the market and built a bigger fishing assortment for that store versus we would for Conyers. I'd say the second piece is, if you go back our marketing spend and our focus three or four years ago was broadened, blasted, broadcast, newsprint and we're a heck of a lot more efficient in our targeted marketing and seating the market would look like customers. And so I think both of those things are really different in our playbook currently than what we're doing a couple of years ago.\n\nDaniel Imbro -- Stephens, Inc. -- Analyst\n\nGreat. Thanks so much, guys. Good luck going forward.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThanks, Daniel.\n\nOperator\n\nOur next question is coming from the line of Greg Melich with Evercore. Please proceed with your questions.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nHi. Thanks. My first question was about supply chain. Could you just quantify how much of a headwind that was in the quarter? I realize it drove the gross margin decline, but give a number?\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYeah. I'll call between 10 and 20 basis points. The headwind was really related to the increase in private label penetration, which is a good thing. So that was really the cause of the headwind.\n\nIt wasn't due to container costs or anything like that. It's the penetration of private label, which grew.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nGot it. So there's sort of a net offset there in terms of mix, but --\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nExactly.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nYou take ownership of it.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThere's also margins with that.\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nYeah.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nAnd I guess supply chain, that could continue as long as the private label mix is improving. Is there anything else on container costs or diesel costs?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nNo. The punch line there is, it's better than we planned it. It's worse than last year. Worse than last year, but better than we planned it, getting better.\n\nBut certainly, I don't think we're going back to last -- the way last year looked anytime soon. Again, we contracted some rates. So we feel like we've got pretty good visibility to the cost. We're not in the spot market at all really anymore.\n\nSo we feel like we've got that a line of sight to it.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nGot it. And then you talked a bit about planning for more promotions? I guess I'd love to know a little more color on which categories you think the market is most at risk for that increased promotionality?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nI don't know if I could narrow it down to a specific category. What I will tell you is obviously the fourth quarter every year is the most promotional quarter of them all. We've seen a lot of pullback in promotions over the past two years versus where we were in 2019 and prior. Our anticipation is as supply chain starts to get a little better in stocks or in a better place.\n\nWe saw last two years candidly a pull forward of demand in early November and in December when people saw something they bought it and they didn't have to incentivize the promotion to buy it because they were afraid it wasn't going to be there closer in the holiday. I think people are starting to get back into the place where they're used to seeing the shelves full, people in stock. So I think that's going to probably incentivize people to be a little more promotional earlier on. We've accounted for that in our forecast and how we're thinking about it.\n\nIt's not isolated to one category. It's where promotions lie. We have an underlying base of our business and everyday value that we don't promote off of that's kind of our underlying value proposition. But we do have CECL categories that come in and go out that tend to lend themselves to be a little more promotional and we bake that in.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nGot it. Thanks, and good luck.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nThank you.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThanks, Greg.\n\nOperator\n\nOur next question is coming from the line of Robbie Ohmes with Bank of America. Please proceed with your questions.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning, guys. I wanted to follow up on the commentary about the unit prices are driving the ticket. Could you give any color on how much price increases are supporting ticket and is that sort of price increases on a lot of categories and like items or is it reflecting significant mix changes versus last year? And also like how do we think about sustaining the unit price increases as we start to anniversary them? Thanks.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nI'd say a couple of things to that. If you look at the -- we said that our inventory in dollars is up 8% versus '19, down 12% units, which obviously implies a higher average unit cost. When we break that down, the biggest chunk of that is mix change having more inventory in the higher ticket things, outdoor, sports and rec. The second one we called out is also an investment and building a better and best layer to some of our assortments.\n\nYou take a category like baseball or in the past, we didn't really sell bats and gloves north of $100 that now makes up a bigger chunk of our business and it's by the way a very productive piece of our business. And I'd say probably the smallest contributor to that delta would be cost price increases that have been reflected in retail changes on our side. So we certainly have taken those cost increases just like everybody else in the marketplace has. We've been very thoughtful about how we price the goods.\n\nAnd so far, we really haven't seen resistance to that. Our AURs are up in the mid-single digits and we feel like we accounted for those price increases. I'll point out also being the value leader in our space is really important and we spent a lot of time making sure that our prices are as good if not better than our competition in the day out, day out -- day out basis. We have price-scraping tools.\n\nWe monitor this all the time constantly looking at this and we're committed to make sure that the cost increases we're seeing will pass along thoughtfully, but we're not going to let ourselves lose that value proposition or leadership that we have in our space.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nThat's really helpful. Just a quick follow-up. A lot of other retailers have kind of called out that there was a shift in back-to-school that's benefiting the third quarter. Are you guys seeing the same thing?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nI would say that we certainly have seen the back-to-school categories do very well at the tail end of July heading into the back-to-school time period. We try not to give inter-quarter guidance. But one of the things we keep anchoring back on is that trend versus '19 being kind of that 30s range. We've seen that continue through.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nOne of the things, Robbie, that you have to keep in mind, in most of our markets are back to school is earlier than what it is on the East Coast. We had kids going back to school literally the end of July. And almost all of them were back to school by the middle of August. And I don't think any of them are like you may have in the east to west coast where they're after Labor Day.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nThanks. That's really helpful.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYeah.\n\nOperator\n\nOur next question is coming from the line of Brian Nagel with Oppenheimer. Please proceed with your questions.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi. Good morning. Congratulations on the nice quarter. Thanks for taking my questions.\n\nThe question I have, just stepping back and I know we have a lot of -- focusing on this demand environment. As you step back and look at your business and how -- and which -- basically this stabilization now at a higher level -- higher than pre-pandemic level. You think -- is it more a function of just changes in consumer behavior or is it more a function of the substantial alterations that you've made in your company and the merchandising? And then the follow-up question, I have and some other -- and as a whole of other people's questions, but with regard to private label, as you're seeing stronger demand for private label. Is that -- should we think about that in the case of Academy? Is that the consumer trading down or is that just the consumer reacting to now a much better built-out private label offering from your company?\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nWell, I think with regard to the consumer and I'll let Steve talk about what we've done with private label. It's actually both of the situations that you put forward are there. There is definitely a shift in the consumer behavior. And I don't -- this is a long-term trend and it has to do with health, and the people's desire for experience and we are in both of those areas and the consumer is more interested in their health and wellness.\n\nSo they're being more active and they're interested in experience and that is what we sell and that's important. That said, at the same time, that trend was going on. We made fundamental changes to the business and became a much better business. I've said many times, we're different companies than we were four years ago and that how we operate the business, all of the systems and things that we've done to improve that, the merchandise we offers as Steve said earlier about good, better, best and making sure that we keep that consumer with us.\n\nAnd with regard to the categories that we sell, we got out of peripheral categories to be able to focus on sports and outdoors that the people are interested in that go with the trends. So you put those two things together, I guess the term people use as a perfect storm. We were benefiting from that.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nI would add a third one, the competitive environment is different. You look at some of the brands we carry, there's more controlled distribution than it was two or three years ago. You look at some of the categories we carry that competitors have pulled out of some of those categories or really downplayed those categories. And so I think it's probably the combination of those three things that allows us to believe that we're going to hold on to this and that it's structural and long term.\n\nTerms of the health of the customer and trade down, I mean, we spent a lot of time talking about that. I mean, certainly, the strength in the private label could indicate there was some trade to value in our assortment. But we also saw strength in a lot of our better national brands and what we do believe is that our position as high provider in the space and having a good range of good, better, best well positions us to capture trade-down customers as well as hold on to existing customers because they can trade up and trade down.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nBut to the questions to ask, what we've done with the private label. We have continued to offer terrific value and things like our BCG brand and the Academy chair and wagon, which are terrific values for our customer. But the addition of Freely and Magellan Pro have added to the strength of our private brand and continue to fill niches that really we didn't have in our assortment. And that has also been a big support of what we've done in the private brand.\n\nAnd things like what we did with Whataburger and what we're doing Shiner, that's not the chop liver, that's a nice volume with some of the exciting ideas that we've added.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nI got you. Thank you very much. Appreciate all the color. Congrats again.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nOK. Thanks, Brian.\n\nOperator\n\nOur next question comes from the line of John Heinbockel with Guggenheim. Please proceed with your question.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nSo, guys, let me start with, what work have you done with regard to wallet share? You know, by different cohort, maybe looking at enthusiast, casual customer. And I'm curious, even with some of your better customers, how big do you think the opportunity is with their wallet? Is that still pretty significant?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nI think we know that within our existing customer base relative to our competitors, we capture a higher share of wallet and we think that goes back to our value. So I think there's always opportunity one of the things that we strive to do is that a broad and complete assortment offer a one stop convenient shopping experience. And we think as we continue to deliver on that, that opens up the opportunity for more cross-class across the store to get a higher share of the customers' wallet and at the same time pick up other customers who are trading into our store.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nYeah. We are seeing both new customers. We continue to have about the same number of new customers this year as we did last year. But with our existing customers, our core customer is spending more with us and continues to spend more with us and shops more frequently.\n\nAnd we are able to retain them because in the past, OK, the kids starts out in t-ball, but as they move up, it used to be, we didn't have a product for them, but now as Steve said, we're selling much better gloves, Marucci bats, same thing in camping. I was in a store the other day and a couple was looking at the north-based tents. And I said are you campers, well, we bought the Magellan pit and now we want something that's better. So we're able to offer more to that customer with our assortment.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nOne other key thing, I'll pile on here because I don't want to lose it. We are more popular with families than are peers. And so not only can we trade individuals in the different categories across the store because of our diverse assortment, we can trade the whole family into different categories across store. So we think that's a big advantage for us.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nAnd then maybe secondly, right, I know AUV rise up over 30% since '19. I'm curious, what's happening to the four-wall store model? Like, imagine, right, the new stores are opening up at higher levels than you might have imagined two or three years ago. Is that changing the economics significantly, right in that simple direction? Yeah. Long as I was going to add when you think about gating factors on growth, right, because if that's true, but you've got the capital, what is the gating factor just people at this point, but would limit whether you can do 20 or 25 a year?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nYeah. We certainly have the most productive and profitable model in the business before we've had the run of success and now it's just, of course, amplified the best sales per square foot in the category, most four-wall profit in the category. We want to accelerate our growth. We've got the capital to your point.\n\nWe have the appetite to do it. We want to do it well. And that's why we're taking a very measured approach. Again, I'll go back to an earlier question.\n\nThis is a test and learn year. And we're taking the time to do that before we step on the gas. But certainly all the studies that we've put together there is an ability to add up to 800 stores in the country at some point. And we're certainly going to do it in a responsible manner.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nIf you do the math on the 8,100 stores as we progress through the five-year period, we're going to continue to increase the number of stores that will open each year.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nAnd be able to grow like we're growing and still deliver the free cash flow yield that we have that's to tell you that we can certainly do more. We just want to make sure we're doing well.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThat's the key to it.\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nThank you.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThank you, John.\n\nOperator\n\nOur next question has come from the line of Anthony Chukumba with Loop Capital Markets. Please proceed with your questions.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGood morning. Congrats on the strong quarter and thanks for fitting me in. I guess I was just -- I just had a question in terms of how are you thinking about your holiday marketing strategy particularly given the fact that like you said you do expect it to be more promotional. I mean are you going to continue to shift your marketing spend more to digital? Are you going to lean more into your Academy credit card? Like how are you thinking about that?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nI'd say yes to all of the above. I mean our marketing spend and approach has been evolving a lot over the past three to four years. We were, as I mentioned earlier, very print-centric, very broadcast-centric going back to 2018, 2019. And when you look at where we are today, I think at the time we looked at it may be like 2% to 3% of our marketing at that time was targeted.\n\nAnd when you look at where we are today, the preponderance of the marketing is targeted it's digital. So that shift in spend has been ongoing and continues as we move forward. And I think you'll see us really lean into that as we go into holiday.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nOne of the things that that does that's actually good is, when you use to do new print you had to have your pricing and everything done literally a couple of months in advance. We can now respond and react to what's going on in the market down to a category, to specific items and make sure that we aren't giving things away we don't have to and at the same time maintain that value proposition that we have.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nIt makes us more nimble and just more efficient overall.\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nGot it. Very helpful. Keep up the good work, guys.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nThank you.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThanks, Anthony.\n\nOperator\n\nOur next question has come from the line of Seth Basham with Wedbush Securities. Please proceed with your questions.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot and good morning. When you guys think about merchandise margin gains versus 2019 and clearance gains, well, think about our margin gains and the components of improvement because of lower promotions industry and less clearance in your business, which of those has been a bigger driver of improvement?\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nI would say it's the structural improvement in terms of better management of inventory, better management of clearance, that is the biggest share of it. I would say, smaller piece of it would be lower promotions in the marketplace. That being said, it's kind of hard sometimes to disentangle the two. But when we do the work and try to go through it, it is definitely structural improvements or the lion's share gains.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. OK. And when you think about the go forward then in terms of the negative potential impact to your merchandise margins going forward. Do you think it would be potentially bigger from normalization of inventory levels impacting clearance or would it be promotional normalization in the marketplace?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nYeah. I think the way that we look at it, we have the structural improvements that we quantify. We believe there could potentially of the 500 basis point roughly gain that we've had. We think depending on what the environment looks like, what our competition does and how we have to respond it could be 100 to 200 basis points of give back from greater promotion.\n\nThat's how we look at it internally.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. As it relates to get back from normalization of clearance levels?\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nYes.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nBoth.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nIt's kind of exactly yes, competitive. Again, where you've got a counterpunch to maintain share to keep up with others. The other thing that I'd add, Seth, is we still haven't gotten the full impact from a normalized merchandise mix. It's hard good to still outperforming to where it has performed historically in '18and '19.\n\nSo until parallel becomes a greater piece of the mix, we should a margin benefit from that and private label exactly.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nUnderstood. Thanks a lot, and best of luck.\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nYou got it. Thank you.\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nThank you very much, Seth. And I think that will be our last question. We went around a little bit over, appreciate everybody's time and appreciate the interest. We feel we have a very strong story and excited about the future and hopefully you all are too.\n\nAnd as we head into the fall season, we're working hard and moving forward and you all have some fun out there.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Hodges -- Vice President, Investor Relations\n\nKen Hicks -- Chairman, President, and Chief Executive Officer\n\nMichael Mullican -- Executive Vice President and Chief Financial Officer\n\nSteve Lawrence -- Executive Vice President and Chief Merchandising Officer\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nDaniel Imbro -- Stephens, Inc. -- Analyst\n\nGreg Melich -- Evercore ISI -- Analyst\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nJohn Heinbockel -- Guggenheim Partners -- Analyst\n\nAnthony Chukumba -- Loop Capital Markets -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nMore ASO analysis\n\nAll earnings call transcripts"
}