{
  "companyName": "Chewy, Inc.",
  "companyTicker": "CHWY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/chewy-inc-chwy-q2-2022-earnings-call-transcript/",
  "content": "Chewy, Inc. (CHWY -1.44%)\nQ2 2022 Earnings Call\nAug 30, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. Thank you for attending today's Chewy Q2 fiscal year '22 earnings call. My name is Hannah, and I will be your moderator for today's call. All lines will be muted during the presentation portion of the call with an opportunity for questions and answers at the end.\n\n[Operator instructions] I would now like to pass the conference over to our host, Robert LaFleur, vice president of investor relations. Please go ahead.\n\nRobert LaFleur -- Vice President, Investor Relations\n\nThank you for joining us on the call today to discuss our second quarter 2022 results. Joining me today are Chewy's CEO, Sumit Singh; and CFO, Mario Marte. Our earnings release and letter to shareholders, which were filed with the SEC earlier today, have been posted to the Investor Relations section on our website investor.chewy.com. On the call today, we will be making forward-looking statements, including statements concerning Chewy's future prospects, financial results, business strength, investments, industry trends, and our ability to successfully respond to business risks, including those related to inflation and its effect on the economy and our industry.\n\nSuch statements are considered forward-looking statements under the Private Securities Litigation Reform Act of 1995 and are subject to certain risks and uncertainties, which could cause actual results to differ materially from those contemplated by our forward-looking statements. Reported results should not be considered an indication of future performance. Also, note that the forward-looking statements on this call are based on information available to us as of today's date. We disclaim any obligation to update any forward-looking statements, except as required by law.\n\nFor further information, please refer to the Risk Factors section and other information in Chewy's 10-Q and 8-K filed earlier today and in our other filings with the SEC, including our annual report on Form 10-K. Also, during this call, we will discuss certain non-GAAP financial measures. Reconciliations of these non-GAAP items to the most directly comparable GAAP financial measures are provided on our Investor Relations website and in today's SEC filings. These non-GAAP measures are not intended as a substitute for GAAP results.\n\nAdditionally, unless otherwise noted, results discussed today refer to the second quarter of 2022, and all comparisons are accordingly against the second quarter of 2021. Finally, this call in its entirety is being webcast on our Investor Relations website. A replay of this call will also be available on our IR website shortly. I'd now like to turn the call over to Sumit.\n\nSumit Singh -- Chief Executive Officer\n\nThanks, Bob, and thank you all for joining us on the call today. We are proud of our Q2 performance and ability to deliver double-digit top-line growth and margin expansion during a period when accelerating inflation placed incremental pressure on an already stressed consumer. Across the pet category, pricing escalated throughout the second quarter. Consumers in the pet category responded to growing economic uncertainty by curtailing some of their purchase activity, leading to industrywide declines in unit volume.\n\nEven as consumers pull back in select areas, Chewy outperformed broader industry trends on the strength of our market leadership in nondiscretionary recurring revenue categories like food and healthcare, the product categories that are most important to pet parents. Chewy grew Q2 net sales by 13% to $2.43 billion, reflecting our ability to drive steady demand in nondiscretionary categories. Demand that is anchored by the superior value proposition that we offer pet parents and the predictable nature of our Autoship program. Collectively, these categories represent more than 80% of our overall business, which provides us with distinct structural advantages in the current environment.\n\nAt the same time, we saw softer demand in the second quarter for discretionary products with longer replacement cycles, such as hard goods, which offset some of our positive momentum in food and healthcare. Altogether, Chewy's strength and competitive advantages in the pet category were evident in Q2 as customer engagement metrics such as Autoship and NSPAC set new records at 73.1% of net sales and $462, respectively. Shifting to profitability. Q2 gross margin was 28.1%, an improvement of 60 basis points both year over year and sequentially.\n\nThis improvement was led by pricing, which continued to strengthen in the second quarter as the favorable delta between price and cost increases widened by approximately 100 basis points compared to last quarter. Additionally, moderating fuel costs and our ongoing efforts to improve supply chain and logistics capabilities also contributed to the strong second-quarter gross margin performance. Specifically, during the second quarter, we improved systemwide inventory placement which reduced average delivery distance, improved delivery speed, lowered costs, and enhanced customer experience, which I will expand on shortly. Q2 adjusted EBITDA was $83.1 million and adjusted EBITDA margin was 3.4%, a year-over-year increase of 230 basis points and a sequential improvement of 90 basis points reflecting our gross margin expansion, greater marketing efficiency, and improved execution in several SG&A functions that we will detail shortly.\n\nMoving next to our customers. We ended the quarter with 20.5 million active customers, in line with the expectations we shared on our last call. Our Q2 net adds reflect gross customer additions that have come off their pandemic highs and the retention behavior of the large cohorts we acquired during the pandemic. The number of gross customers that we added in Q2 2022, was mid-single-digit percentage points higher than their comparable pre-pandemic cohort from Q2 2019, even as softer demand across discretionary categories put some pressure on customer acquisition.\n\nOnce we fully cycle the effects of elevated pandemic pet adoptions and the macro environment recovers, we believe the customer acquisition headwinds related to discretionary demand levels will abate. Additionally, retention rates on the customers we acquired during the pandemic in 2020 and 2021 are still running low single-digit percentage points lower than their comparable pre-pandemic cohorts which continues to affect total net adds due to the large size of these cohorts. Having said this, we are encouraged to observe that the complexion of the new cohorts that we have acquired so far in 2022 is more consistent with the long-term retention profile of our pre-pandemic cohorts. Notably, we believe that the dynamics that are impacting both gross adds and retention are temporary in nature.\n\nAnd it is important to remember that over the long term, our business model produces incredibly sticky customers, which result in retention curves that stabilize after the first two years of a customer's relationship with Chewy. Now, moving on from financials, let me update you on several innovation areas across Chewy. Let's start with supply chain, logistics, and transportation. As I have shared over previous earnings calls, we have multiple initiatives underway to improve profitability and customer experience by improving inventory placement, reducing inbound and outbound freight costs, and driving incremental fulfillment cost leverage through automation.\n\nTo this end, we successfully launched our third automated fulfillment center last month located in Reno, Nevada. The benefits from automation continue to expand across our network and our pace of realizing these benefits continue to accelerate. For example, based on the learnings from our first two automated FC launches, we expect that it will take Reno half as long to ramp up to its comparable performance benchmarks as it took for our first automated FC. As we expand our network of automated FCs, these facilities are handling an increasingly larger share of our outbound shipment volume, and they are doing so at progressively lower variable costs per package.\n\nFor example, during the second quarter, nearly 25% of our outbound network volume shipped from our first two automated FCs at a variable cost per unit that was approximately 15% lower than our legacy network. By this time next year, a third of our outbound volume is expected to shift from automated FCs. Based on these trends, as we have shared with you in the past, we are confident in our ability to realize the 40 to 60 basis points of targeted SG&A leverage over time from our three existing automated FCs. We expect to benefit from further SG&A leverage as we open additional automated FCs in 2023 and beyond.\n\nOn the transportation front, we recently launched our second import-routing facility, this one on the East Coast. With facilities on both coasts, we are now able to optimize freight distribution to our FCs and reduce inbound freight costs on more than three-quarters of our import volume. Elsewhere in Transportation, Chewy Freight Services, or CFS also continued to grow in the second quarter. As a reminder, CFS is our linehaul initiative, where we operate a portion of our own middle-mile network.\n\nIn Q2, we carried triple the volume that we did last quarter, which led to reduced costs and improved delivery performance. Looking forward, we will keep adding capacity to this program throughout the remainder of the year. Combined, these automation and transportation initiatives are generating savings in cost per package and improvements in delivery performance and customer experience. Next, let's move on to Chewy Health and the progress we are making in our mission to make pet healthcare more affordable and accessible and to improve the lives of pets and pet parents.\n\nFirst is the successful public launch of CarePlus, our wellness, and insurance program. After a two-state soft launch in June, we are now up and running in 31 states as of today, with expectations to complete our nationwide rollout by the end of the year. While it is still early days, we are pleased with the initial customer response to our bespoke insurance and stand-alone wellness plans. Innovations like CarePlus that improve customer experience, increase engagement, and enhance retention are the cornerstone of our customer strategy.\n\nOur primary goal this year is to iterate and learn all we can about this new space from our customers and partners. So, while CarePlus won't have a meaningful financial impact on 2022, over the longer term, we believe CarePlus will provide us an opportunity to help grow the historically underpenetrated pet insurance TAM and gain market share in a high-margin business. We look forward to sharing more with you on our insurance rollout in the quarters to come. Next is Practice Hub.\n\nI am pleased to share that we now have over 1,000 practices using the platform up from approximately 300 in March of this year. As a reminder, with Practice Hub, we have designed a complete e-commerce solution for veterinarians that can be integrated with their existing practice management software. Our proprietary app allows vets to easily create, preapprove and manage both medications and diet prescriptions all in one place and then earn recurring revenue when customers place an order in clinic or purchase their items at home on chewy.com, with Chewy handling all inventory, fulfillment, shipping, and customer service. And finally, I'd like to note an important and proud milestone for our corporate philanthropy program.\n\nChewy Gives Back. At the end of July, we reached the $100 million mark for pet food and essential supplies donated to over 9,000 nonprofit animal welfare organizations that serve pets in need throughout the U.S. Over the past 10 years, we have donated 96 million meals and helped feed millions of rescue pets. Before turning things over to Mario, let me conclude with the following: the operating environment, including what we faced in the second quarter remains dynamic and evolving.\n\nAs pet parents pull back in some areas, they refocus their spending on categories centered on the health and well-being of their pets. The strength and durability of our value proposition positions Chewy well to compete and take additional market share in this environment. Looking ahead, we believe these same strengths which include market leadership across recurring demand categories such as food and healthcare and rapid innovation in service of customers will enable us to keep winning in pet, a category that has proven its durability throughout economic cycles. As we continue to navigate the challenges and opportunities ahead of us, our team remains focused on running the business toward incremental growth and profitability and on making decisions that deepen engagement and improve customer experience for millions of pets and pet parents.\n\nTo that end, we remain guided by our mission to be the most trusted and convenient destination for pet parents and partners everywhere. With that, I will now turn the call over to Mario.\n\nMario Marte -- Chief Financial Officer\n\nThank you, Sumit. Second-quarter net sales increased 12.8% to $2.43 billion. Nondiscretionary categories like consumables and healthcare was the primary driver of growth this quarter, representing 83% of our net sales. While hardgoods' sales declined year over year as consumers rationed their dollars toward staples and nondiscretionary items, it is worth noting that our hardgoods business today is up substantially from pre-pandemic levels, with net sales up nearly 70% compared to Q2 2019.\n\nLooking forward, we believe that the current dynamic that we are observing in discretionary categories like hardgoods is temporary in nature and that demand will improve as consumer sentiment recovers and pet household growth returns to historical levels. Second-quarter Autoship customer sales increased 17.3% to $1.78 billion, outpacing net sales growth by 450 basis points. As a percentage of total net sales, second-quarter Autoship customer sales reached an all-time high of 73.1%, increasing 280 basis points year over year and 90 basis points sequentially. Second-quarter net sales per active customer or NSPAC reached another record, increasing $58 or 14.4% to $462.\n\nSince the beginning of the pandemic in early 2020, our NSPAC has increased by over $100 as we gain an ever-growing share of our customers' pet spend. We ended Q2 with 20.5 million active customers, an increase of 2.1% year over year. On a sequential basis, active customers were effectively flat versus Q1 2022. As we expected, Q2 net active customer growth was muted as gross customer adds come down from the elevated levels we saw in the pandemic, and as we continue to work through them modestly lower retention rates of our COVID cohorts.\n\nMoving to profitability. Second-quarter gross margin expanded 60 basis points, both year over year and sequentially to 28.1%. As Sumit detailed in his remarks, growth in pricing during the quarter exceeded escalating cost inflation. Our gross margin performance also continues to reflect the progress we are making in our supply chain and logistics initiatives.\n\nAs we move into Q3, we expect the positive price cost delta that we saw in Q2 to narrow as some costs catch up to the price increases that we saw in the second quarter, providing less of a gross margin tailwind in the back half of the year. Continuing on to opex. SG&A, which includes all fulfillment and customer service costs, credit card processing fees, corporate overhead, and share-based compensation, totaled $517 million in the second quarter, or 21.3% of net sales, compared to 20.3% in the second quarter of 2021. Excluding share-based compensation, SG&A totaled $477.2 million or 19.6% of net sales, an increase of 50 basis points versus the second quarter of 2021 and flat on a sequential basis.\n\nLet me elaborate on the modest year-over-year deleverage of SG&A, excluding share-based compensation. First, larger basket sizes and improvements in fulfillment center productivity fueled by our deliberate strategy to invest in automation collectively drove 80 basis points of positive SG&A leverage in the second quarter. Offsetting the improvement in variable fulfillment cost productivity are two items. The first, which contributed to approximately 20 basis points of year-over-year deleveraging reflects higher fixed costs associated with the ramp-up of the facilities we have opened in the past year, including a new pharmacy in Pennsylvania and a new automated FC in Reno, Nevada.\n\nSecond, of the upfront investments we began making in the second half of 2021 in personnel and technology to support our growth and profitability initiatives in areas like healthcare, fresh and premium, supply chain, and transportation. This contributed approximately 110 basis points of year-over-year deleveraging. Consistent with what we have shared in the past, we expect these investments to begin scaling as we exit 2022. Second-quarter advertising and marketing expense was $144.2 million or 5.9% of net sales, a 210-basis point decline over the second quarter of 2021.\n\nThis year-over-year improvement is a function of both the spike in ad costs we saw in the second quarter of last year and the moderating consumer demand, particularly in hardgoods that we have observed in the second quarter of this year. Looking forward, we expect advertising and marketing to remain in the range of 5% to 7% of net sales as we continue to be ROI-driven and focused on the long-term value contribution of new and existing customers. Wrapping up the income statement. Second-quarter net income was $22.3 million, a year-over-year increase of $39 million.\n\nNet margin expanded 170 basis points to 0.9%. Second-quarter adjusted EBITDA increased $59.8 million versus Q2 2021 to $83.1 million, and our adjusted EBITDA margin expanded 230 basis points to 3.4%. Sequentially, we added $22.5 million to our Q1 results and expanded adjusted EBITDA margin by 90 basis points, building upon this year's gross margin expansion and our discipline around opex. Moving on to free cash flow.\n\nSecond-quarter free cash flow was near breakeven at $1 million, reflecting $49.2 million in cash flow from operating activities and $48.2 million of capital expenditures. Capital investments were primarily comprised of investments in our new automated FC and Reno and ongoing technology projects. We finished the quarter with $607 million of cash and cash equivalents on the balance sheet and between cash on hand and availability on our ABL, our liquidity stands at $1.1 billion. That concludes my second-quarter recap.\n\nSo, now let me cover our third quarter and full year 2022 guidance. For the reasons that we have articulated throughout this call, we believe that we will continue to see differences in demand patterns between discretionary and nondiscretionary categories throughout the balance of the year. As such, we are revising our full-year top-line expectations. At the same time, we are raising our profitability outlook for the year.\n\nAnd as always, our current guidance reflects the balance of the opportunities and risks we see today. We expect third-quarter net sales to be between $2.44 billion and $2.46 billion, representing year-over-year growth of 10% to 11%. We now expect full-year 2022 net sales to be between $9.9 billion and $10 billion, representing year-over-year growth of 11% to 12% or $1 billion to $1.1 billion in absolute dollar growth over 2021. We are raising our outlook for full year 2022 adjusted EBITDA margin to 1.75% to 2%, up from our prior range of breakeven to 1%.\n\nAs you update your models, here are a few housekeeping items to keep in mind. We expect net active customer growth to remain muted for the balance of the year given the impact of softer-than-anticipated nondiscretionary demand on customer acquisition and the ongoing impact of lower retention for our COVID cohorts. We now expect full-year 2022 gross margin to expand approximately 30 to 50 basis points from our full-year 2021 gross margin of 26.7%. That said, our run rate gross margin for the second half of the year is likely to be lower than the first half as product cost increases catch up to the last round of MAP increases and we move through the normal increase in promotional activity that we see during the holiday season.\n\nWhile mindful of the economic backdrop, we continue to make investments in margin-expanding growth initiatives to further improve customer experience. At the same time, we continue to strengthen our core operations, and we are already seeing the tangible bottom-line results from many of these efforts, returns that are expected to multiply in the years to come. As we navigate through the current environment, we remain as confident as ever in our ability to drive sustainable, profitable growth and further our leadership in the pet category. And with that, I'll turn the call over to the operator for questions.\n\nOperator\n\nCertainly. [Operator instructions] The first question is from the line of Stephanie Wissink with Jefferies. Please proceed.\n\nCorey Grady -- Jefferies -- Analyst\n\nHi. This is Corey on for Steph. Thanks for taking our questions. I wanted to ask about retention still running low single digits below pre-pandemic levels.\n\nCan you break down the components of the retention headwind? Maybe how much is from out-of-stocks, how much might be tied to pet owners shifting back to brick-and-mortar? And how much might be tied to issues that you can potentially solve for the coming years? And what's the outlook for retention getting back to pre-pandemic levels? Thanks.\n\nSumit Singh -- Chief Executive Officer\n\nCorey, this is Sumit. We aren't breaking it down into those specific components, but I can tell you that supply chains continue to improve. And so, we don't really see that as a headwind, and the retention trends or the attrition trends are starting to stabilize as we've come out of Q1 -- as we've come out of Q2. So, we believe this is normal recycling of our normal cycling of consumers as the economy opens up against the incremental headwind of inflation and the macroeconomic factors that we're cycling through now.\n\nObviously, a large portion of those consumers that were acquired were also discretionary customers, which as we can -- as you can tell from the script and from what's going on in the marketplace, is impacted and continue to do so as we move through the year. So, when we look at the BU level, consumers that are interacting with the nondiscretionary categories, including in these cohorts, that represent high LTV-type customers are, in fact, getting better in terms of retention. So, that's the plus and the minus that we're seeing in the overall stability in this particular metric. If you notice the numbers for Q2, it's essentially all driven by gross adds delta as we move between Q1 and Q2.\n\nSequentially, our gross adds between Q1 and Q2 are down as we've -- as a historical trend. So, this quarter is much more related to that, even when our gross adds are running ahead of pre-pandemic levels, as the script alluded to by mid-single digits, there's still a little bit of a yin and yang that's playing through right now. Hope that helps.\n\nMario Marte -- Chief Financial Officer\n\nAnd, Corey, this is Mario. Let me add to one thing that Sumit said. In terms of the mix of customers when they first joined the platform in the first purchase, the effect of the more favorable mix we're seeing in the last couple of quarters as more customers purchase consumables or healthcare products in their first order with us, you would start to see that one year out. That retention, they're counted as an active customer for the next year, we start to see that affecting or the positive effect of that more than one year out.\n\nCorey Grady -- Jefferies -- Analyst\n\nThat's really helpful. And then for my follow-up, I wanted to ask about just the impact from out-of-stocks in the quarter, how you're thinking about the impact of out-of-stocks in the back half? And then when do you expect stock rates to recover at this point?\n\nSumit Singh -- Chief Executive Officer\n\nYou know, we're seeing what we've anticipated and forecasted in our Q1 call, which is supply chains are getting better at the rate that we expected. We do expect to come out of this year, materially improve from the way that we entered the year. But really in terms of crew stabilization, I think 2023 is a better year to look to.\n\nCorey Grady -- Jefferies -- Analyst\n\nGot it. Thank you.\n\nSumit Singh -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from the line of Brian Fitzgerald with Wells Fargo. Please proceed.\n\nBrian Fitzgerald -- Well Fargo Securities -- Analyst\n\nThanks, guys. The improved inventory placement. Wondering if there is ongoing runway there for further improvement. You've noted that it will take some other supply chain initiatives CFS, import-routing kind of multiple quarters to play out.\n\nSo, just wondering if there are similar dynamics there and maybe kind of the classic, what inning are we in, in terms of inventory -- improved inventory placement? Second question related to fulfillment centers is the learnings from the automated fulfillment centers and then you're expecting Reno to take half as long to ramp from your first automated. Amazon has kind of intimated to us kind of takes about -- you get to a two-thirds level of capacity and then you have enough things running through the warehouses and fulfillment centers where you can really start to hone your optimization. Wondering, is there a similar dynamic? We have to build these things. We have to input the optimization.\n\nYes, we learned to optimize and automate better, but we also have to get to kind of a critical mass of volume flowing through them to affect our optimization. Thanks.\n\nSumit Singh -- Chief Executive Officer\n\nHey, Brian, nice to hear from you. On the -- let me hit kind of gross margins in broadly because I think the context is important to be able to answer the question that you asked. So, when you compare year over year, in addition to strengthened pricing this quarter, our study and continued growth across higher profitable businesses like healthcare and Autoship is contributing year-over-year gross margin increase. In addition to that, as you noted, our continued work and success with the logistics and supply chain initiatives is helping offset some of the 100 to 150 basis points higher freight and fuel costs that we had outlined for you in the Q1 call in May.\n\nDuring the first half -- now to answer your question, during the first half, we believe that efforts that are helping improve inventory placement and other experience initiatives, we believe have now mitigated roughly one-third of that headwind. And so, that's sort of the impact. At this point, we're continuing to observe how Q2 plays through. There's obviously some controllable elements in terms of how we execute against these initiatives.\n\nAnd there's also some natural glide paths across how inventory positions improve across the supply chain, and how fuel positions moderate as we move through the year. So, it's a little bit hard to kind of forecast. So, I think I'll keep my comments to, in the first half, we've actually already seen -- or we've mitigated roughly a third of that 100 to 150-basis-point impact. In terms of your second question, do you want to take it, Mario?\n\nMario Marte -- Chief Financial Officer\n\nYeah. Let me add one more thing to what Sumit said and where we are in the inning, I think it's your question, Brian. If you think about the approximately one-third of the headwind that we said we mitigated so far this year. We have said in the past that by the end of next year, we expect to have mitigated most of the headwind.\n\nSo, that gives you an indication of the inning if that's what you're looking for. So, there's more to come on that.\n\nSumit Singh -- Chief Executive Officer\n\nYeah. We are pleased with the progress that we're making, and we believe it's optimal and the teams are doing a really nice job executing behind these initiatives. In terms of your automation question, look, I think the -- our ramps are in the 1G network before we'd launched automation, we've gotten to the point where we'd rapidly ramp up a fulfillment center within a matter of quarters. And we play booked the launch and the ramp really efficiently.\n\nAnd the 2G sites that are fully automated networks, obviously, there's a lot more -- there's a bigger and steeper learning curve that we've gone through. And so, from that point of view, Reno ramping up in half the time is impressive given that we've only launched two of these so far. In terms of the volume density that we need, yes, the concept broadly is the same, which is as volume flows through, you see greater utilization, and therefore, greater leverage of productivity come through as well. Whether the numbers are two-thirds or not, I think it's a little bit different in the world where we're pushing stable volume, and we have predictability in terms of the Autoship that provides us the base load to be able to forecast better, labor plan better, eliminate kind of special cost variability as we move through our network and then deliver those orders effectively, including with high utilization on trucks.\n\nSo, that's a little bit of a structural advantage that we believe the network has that throws off the leverage that we're talking about here. Hopefully, that helps.\n\nBrian Fitzgerald -- Well Fargo Securities -- Analyst\n\nYeah. Very helpful. Thanks. Very clear.\n\nThanks.\n\nSumit Singh -- Chief Executive Officer\n\nThanks, Brian.\n\nOperator\n\nThank you. The next question comes from the line of Mark Mahaney with Evercore. Please proceed.\n\nJian Li -- Evercore ISI -- Analyst\n\nThis is Jian for Mark Mahaney. Thanks, guys, for the question. So, I want to kind of circle back on the COVID cohort. Thanks for the explanation about just like why it's inherently, it's gotten some higher churn than prior cohorts.\n\nBut is there any other kind of factors that we should think about, about this cohort in terms of like Autoship penetration in terms of the trajectory of NSPAC growth, if you can just like talk about anything else that we should look out for? And also, the second question is the -- I kind of talked about the benefits of pricing. Can you just like expand on two-way pricing -- true strategy for the pricing pass-through? Are you able to pass the majority of the price cost inflation? And how has that impacted this quarter's acquisition or retention? Thanks.\n\nMario Marte -- Chief Financial Officer\n\nYeah. I'll take the first one, and Sumit will take the second one. This is Mario. So, in terms of the COVID cohorts, look, the good news here is that we saw the one-year rate declined by low to single -- low-single digits, as we said before, and that has stabilized over the last several quarters.\n\nSo, from that end, that's a good development on the COVID cohorts. Why are we seeing changes or differences between those cohorts and pre-pandemic cohorts? The answer is, initially, they build bigger baskets, they order more, they spend more. When we look at their NSPAC behavior over time, I can tell you, we look at this on a regular basis, and there's no meaningful difference between those cohorts and previous cohorts. So, the NSPAC curves look very similar over time.\n\nYou may have slightly fewer customers, of course, as we've said, but the customers that stay with us are spending more. So, from a NSPAC curve, if you do the math there, they will look very similar. In terms of the Autoship behavior, nothing there to note. So, I'll kind of leave it in those two points that I mentioned.\n\nSumit Singh -- Chief Executive Officer\n\nIn terms of your question on pricing, the pricing dynamics that we saw in Q2 was as follows. First of all, to hit the question directly, yes, we're pleased with the ability, our ability to manage through the inflation and effectively portfolio price just very similarly to how we were playing Q1. What we saw in Q2 was product cost inflation accelerated in Q2 as Q2 progressed, similar to what the broader economy also saw. In this case, the costs were known increases.\n\nThere were anticipated increases. And in that anticipation these cost increases, the industry and us in many places, we pre-emptively priced them in. And the result was escalating strength in pricing that outpaced cost inside of the quarter, which is why you heard us make that comment. Our team executed sharply in a timely manner and broadly speaking, we observed strong industrywide discipline around these pricing slopes.\n\nIt is important to call out that our competitive positioning within the industry actually improved during the quarter as we outpaced the industry in terms of growing units sold and net revenues. Our Q2 sales growth was driven year over year by increases in both unit volume and pricing growth, whereas when you follow the industrywide volumes, the unit sold actually declined. So, pricing contributed to more than 100% of the sales growth in the industry. So, hopefully, that provides you a bit of a perspective on how kind of we played through pricing and how generally pricing impacted the volumes in the industry.\n\nJian Li -- Evercore ISI -- Analyst\n\nThank you, guys.\n\nSumit Singh -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from the line of Doug Anmuth with J.P. Morgan. Please proceed.\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nThanks. Thanks for taking the questions. I have two. First, I just wanted to follow up on pricing.\n\nJust trying to understand the drivers here in terms of whether prices went up more on inflation, more opportunistic increases, or better math adherence. And then secondly, just trying to understand your view on the ability to continue to drive NSPAC higher going forward and kind of into '23, particularly if active customer growth remains impacted by inflation and some of the pressure on discretionary products. Thanks.\n\nSumit Singh -- Chief Executive Officer\n\nSure. So, the following happened on pricing. Overall, there's more cost inflation that came through. So, there was more inflation that had to pass through, as we talked about in Q1.\n\nWe were expecting that inflation to come through starting the month of June, entering July, and that is consistent with what we saw. On top of that, we continue to take a portfolio pricing approach where there was a portion of our catalog where we actually took price. There was a portion where we held price-to-price/cost ratios. And there was a portion where we did not pass the entire cost through given the elasticity of demand impact.\n\nWhat we found on a net basis was given the anticipation of cost increases, we pre-emptively -- and industrywide, there was pre-emptive pricing increases, which helped provide some tailwind and price-to-cost delta that has flowed through into the strength of the gross margin. So, the MAP compliance is actually a behavior that the industry demonstrates, which helped keep pricing discipline sharp as the quarter moved through. So, hopefully, the cause and effect is sort of more clear there. In terms of your question on NSPAC growth.\n\nThis is an area we remain excited about. Given the fact that our health businesses are continuing to strengthen. Some of them very -- in very early stages such as compounding, such as insurance, such as Practice Hub that are seeing -- or Connect with a Vet, that telehealth service that are seeing very strong customer response and engagement kind of put behind them. At the same time, existing businesses such as Pharmacy continued to deliver strong double-digit increases on a year-over-year basis where we continue to both kind of acquire and demonstrate strong retention and demonstrate strong growth in spend from an active customer point of view.\n\nSo, the mix of customers buying multiple categories, right, increases as you kind of take a vertical like this into impact. We would expect much more of this to happen as we move through into Q3, our insurance rollouts complete throughout the nationwide, and the economy kind of gets back on track. So, that's kind of how we're seeing '23.\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is from the line of Lauren Schenk with Morgan Stanley. Please proceed.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nThank you. I think I ask a bigger-picture question. I guess, has there been a philosophical change or sort of a change at the management level to prioritize profitability or margins a little bit more over top-line growth? Or is this really just finally seeing to some of these investments made in the past couple of years? And then just a clarifying question. On unit customer growth in the back half, does that imply that it's possible that our growth will be negative in the back half?\n\nSumit Singh -- Chief Executive Officer\n\nLauren, I'll take the first one. Mario will take the second one. No, there is no change in long-term strategy of continuing to gain incremental market share on the back of growth that we believe we can achieve and attain and continue to drive in the industry. What we're seeing right now is an incredible disciplined execution from the team and where we are finding pockets of -- or where we're finding the opportunity to benefit and take in margin, we're absolutely not giving up those opportunities, whether it's in sharper pricing or whether it's executing sharply on to opex control and SG&A-type initiatives as you've heard us articulate.\n\nAlso, super proud of the initiatives that are running through the company that improve experience and lower cost structure which, in our opinion, is structural and can be sustained moving forward. But broadly speaking, we remain steadfast on our mission of being the most trusted convenient destination for pet parents and partners, so not coming off of the growth story there. Mario?\n\nMario Marte -- Chief Financial Officer\n\nLauren, on the active customers, as you know, we don't guide to active customers just as we don't guide to NSPAC. But obviously, that said, based on the current trends and we expect net adds to remain muted for the balance of the year. I think that's the keyword there that we've said several times now. The adjustment to our outlook on the top line is one of the factors that is tied into our expectations in active customer growth through the balance of the year.\n\nSo, think about it that way.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is from the line of Anna Andreeva with Needham. Please proceed.\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nGreat. Thanks so much. Good afternoon, guys, and thanks for taking our questions. We have two quick ones.\n\nJust a follow-up on the guidance. So, is the lower sales expectation entirely on the hardgoods category? And what's being implied for the back half of this category as part of the updated guide? And secondly, just bigger picture. You had mentioned units were down for the industry in the second quarter. Just what are you seeing the pet space growing this year?\n\nSumit Singh -- Chief Executive Officer\n\nAnd on hardgoods – so, yes, so the first part of your question, the short answer is yes. Given the elevated inflation that has passed through Q2 and the ongoing macro trends, including lower interest toward new pet household formation, we believe that we're taking an appropriately more conservative view on consumer spending across discretionary categories such as hardgoods moving forward for the balance of the year. And that is what you see reflected in our guidance. So, that was the first part of your question.\n\nMario Marte -- Chief Financial Officer\n\nCan I add one more thing, Sumit? So, just to kind of expand on that, Anna. So, for the, as you said, primary factor being hardgoods. Do keep in mind, 80% of our sales are in consumables and healthcare. Those two categories continue to grow.\n\nWe're taking market share. For us, they're also more predictable given their recurring nature. So, for us, those are very good indicators of how we think about revenue going forward. The 20% that is hardgoods, that's discretionary in nature, and we're seeing that across the industry.\n\nAnd for that part of the business, we continue to use our best judgment and the best data available to forecast demand. And based on what we saw in the first half of the year and how we expect inflation, we're going to continue biasing customer spending toward food and healthcare where we excel, and away from hardgoods, again, these are data points that we use to think about our second half or just our revenue projections going forward. Sumit made the point earlier, too, that we expect the growth in pet households to remain below pace from the last two years before returning to trend. And that's evident in the data that we have available.\n\nAnd so, we believe that that's borne out by the data that's available out there. Now all that to say, we still expect double-digit growth in the second half of the year. And what we're seeing coming into the third quarter, it's encouraging to the numbers we've seen.\n\nSumit Singh -- Chief Executive Officer\n\nAnna, can you repeat your second question about market and units?\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nThe second question was about just the growth in the pet space, and I think you largely answered that, meaning that Chewy will be taking share. But I guess do you still expect the units to be down in the back half?\n\nSumit Singh -- Chief Executive Officer\n\nWe expect discretionary to continue to remain pressured. If you see unit demand in pet food, pet food unit demand industrywide declined 1% compared to discretionary, which actually declined roughly 8%. So, there's a big delta there. And we expect food and health to continue to recover and strengthen as the back half unfolds and discretionary to likely continue to remain pressured, yes.\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nOK. Understood. Appreciate that. Good luck.\n\nSumit Singh -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. The next question is from the line of Dylan Carden from William Blair. Please proceed.\n\nDylan Carden -- William Blair -- Analyst\n\nThanks a lot. Excuse me. So, I was just hoping to be kind of crystal clear, and sorry if I missed it, as to when you lap in your view, kind of the COVID disruption? Because I know there's some sort of nuance to the -- particularly the net add metric and around kind of the trailing nature of it. And then sort of a related question, the mid-single-digit underlying gross add growth, is that kind of the foreseeable future in this sort of new world where there's maybe been some pull forward in adoptions? Just trying to get a sense as far as expectations when we really clear through some of the noise in your view, at least on that item.\n\nSumit Singh -- Chief Executive Officer\n\nYeah. I'll start with the second one, Dylan, and Mario will likely jump in for the first one. In terms of like gross adds, there's definitely a base hit driven by the current macro because we believe that if -- so Q2 -- first of all, if you recall Q1, we said a couple of things. We said, hey, we expect Q2 to remain pressured on the pretext of, really, two broad things.\n\nOne, consumer budget, it's continuing to get rationed away from discretionary but much more so into travel and so forth and so on. Number two, increasing inflation was a bit of a bogey that we said we need to watch and see how much more inflation gets passed through in Q2 and what is the impact of discretionary on that. Relative to Q1, double-digit inflation in pet got passed through to consumers in Q2, and the impact is very evident in discretionary. So, when you compare that data point you look at categories that are weakening as we've come out of Q2, both interest in new pet and interest in hardgoods continues to trend down.\n\nFor example, searches for hardgoods are down 24%. Searches for pet are also down roughly 20%, 22% levels. Searches for golden retriever puppies are down 45% coming out. So, there's a distinct kind of correlation there and the gross adds in a rate that the industry is right now picking up, given the kind of the causality or the factors that I've actually talked about.\n\nThe encouraging part is that both of these factors are temporary and as the pressures abate or the economy resets or the macros abate, we do expect to -- we do expect that this headwind will actually mitigate. So, hopefully, that provides you a greater color in terms of gross adds. Do you want to talk about --\n\nMario Marte -- Chief Financial Officer\n\nI'll tell you, when we expect to lap the COVID disruption -- so, go back to the way we've explained our customer retention over time. Most of the attrition that happens in our -- for our COVID -- for our cohorts' period, no matter when we acquire them, happened Year 1 into Year 2. And why is that is because, in the first year that they joined the platform, they're counted as active customers the entire time, even if they don't return to make a purchase. So, we see the first effect one year out after their first purchase.\n\nThere's also another step Year 2 to Year 3 because they may have come back throughout the first year and they get counted through the second year or at least one year from their last purchase. Let's call it that way. So, if you think about the 2020 cohort, and by the way, after two years with us, they tend to stay with us for a very long time, and we can go back cohort after cohort year after year and see the same pattern over time. So, if you think about the 2020 cohort, which would have been the first COVID cohort.\n\nThose customers are now -- have lapped two years with us, the first year of 2020, second year 2021. So, now we're trying to see sort of this -- what we're saying they're stabilizing. The retention is stabilizing over time. 2021, they're in the middle of their second year.\n\nThey counted all last year. They're in the middle of second year. So, we're going to see that their stability, and we're starting to see some signals from there as well as we get into -- out of this year and into 2023.\n\nSumit Singh -- Chief Executive Officer\n\nAll that to say -- and I would add that one of the positive developments over the last couple of quarters is that the customers that are joining the platform, their initial purchase order tends to be in categories that have historically been more sticky for us, consumables, healthcare. So, you would -- so I would expect, without giving you sort of a specific guidance that their retention over time would be potentially better than what we've seen in the last couple of years.\n\nDylan Carden -- William Blair -- Analyst\n\nVery good. Thank you, guys.\n\nSumit Singh -- Chief Executive Officer\n\nThank you, Dylan.\n\nOperator\n\nThe next question is from the line of Eric Sheridan, Goldman Sachs. Please proceed.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the questions. Maybe two if I can. Sumit, on the competitive intensity side, are you seeing anything different that you have to respond to from the mix of online or off-line competitors that you have given both pandemic normalization theme, as well as sort of the macro volatility you're calling out on the call? That would be question No. 1.\n\nAnd then Mario, question 2, on the gross margin side, it seems what you're implying is that there are some headwinds to gross margin or some puts and takes to gross margin in the second half of the year that we should keep in mind. Can you just frame up again some of those puts and takes? And how should we be thinking about gross margin against your longer-term goals from the exit velocity you expect to see this fiscal year? Thanks so much.\n\nSumit Singh -- Chief Executive Officer\n\nHey, Eric, this is Sumit. I'll take the first one. Mario will take the second one. The short answer is no.\n\nWe aren't seeing any increased intensity neither come through in terms of short-term transactional promo or demand-driving levers in the marketplace nor are we really seeing the pace of innovation or working backwards from customer innovation actually pick up. So, in the second area, which we continue to actually put a lot of pride in ourselves, we have lots of good initiatives running inside the company that improve experience and strengthen the overall value proposition for Chewy. So, not much to actually share there, but we're not seeing intensity pick up now.\n\nMario Marte -- Chief Financial Officer\n\nAnd, Eric, I would add to that that if you think about our growth versus the industry, we're growing faster than the industry. Our growth versus general e-commerce growth in the U.S. in the second quarter was -- we grew twice as fast as general e-commerce. So, you're seeing us both take share and also outperform overall e-commerce in the quarter.\n\nSo, I think a lot of that way in relation to our -- how we think about competitive actions in the quarter. Now, in terms of the gross margin, so there are a couple of factors there. One is, in Q2, we did see a favorable gap between MAP increases and product cost inflation. And I covered that in my prepared remarks.\n\nAnd that boosted second-quarter gross margins. In the second half, we do expect some of that gap to remain positive but start to narrow as the costs catch up with the price increases. This is more about timing of when the vendors implemented MAP increases and they get implemented ahead of increasing cost in order to have more of a potential of keeping the MAP increase in place. Second, the promotional activity, which normally picks up around the second half of the year, primarily around holidays, and that we do expect margins to be impacted there.\n\nAnd finally, we expect sales mix away from hardgoods in the second half as consumers continue to prioritize food and healthcare purchases, which again is where we -- that's over 80% of our sales. Eric, are you still there? Are we still there? Operator?\n\nOperator\n\nYes. It seems like Eric has gone on mute or disconnected. So, thank you, Eric. The next question is from the line of Deepak Mathivanan with Wolfe Research.\n\nPlease proceed.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGreat. Hi, guys. Thanks for taking the questions. Just a couple of ones.\n\nFirst, are you seeing any capacity of kind of trade downs or some sort of like a – you know, basket adjustments in the consumable category currently, you know, due to the broad inflationary trends? And then the second question, more broadly, can you give us some sense of the magnitude of inflation during 2Q, either as a -- maybe a, you know, percentage of SKUs that have seen price markups? And how should we think about the path for that in the second half? Thank you so much.\n\nMario Marte -- Chief Financial Officer\n\nYes. Hey, Deepak, it's Mario. I'll take the second part of the question, and Sumit will cover the first part. But in terms of the catalog.\n\nIt is not much different from what we saw in the first quarter. When we look at the entirety of the catalog, we've seen about half of the catalog with a price increase year over year, not surprising. And the other half is either flat or lower year over year. So, when we look at pricing, we don't look at just sort of a monolithic approach about price increases.\n\nIt's very surgical. It's very SKU by SKU, brand by brand. But that gives you an idea of how we think -- how the catalog has developed in terms of pricing over the last year. Sumit?\n\nSumit Singh -- Chief Executive Officer\n\nNo, Deepak, we did not see any -- or we're not seeing trade down coming out of Q2. So, it's very similar to what we saw in Q1 which was also we did not see trade down for Q1 as well.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGot it. OK. Thank you so much.\n\nSumit Singh -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from the line of Justin Kleber with Baird. Please proceed.\n\nJustin Kleber -- Baird -- Analyst\n\nYeah. Hey, everyone, thanks for taking the question. Just a couple of follow-ups. First, on the NSPAC.\n\nCan you size the impact of pricing or, I guess, like-for-like SKU inflation on that 14.4% growth? Sumit, I think you mentioned double-digit inflation was passed through across the industry. It doesn't sound like that's a good proxy for the contribution that you're seeing in NSPAC, but just wanted to confirm that.\n\nMario Marte -- Chief Financial Officer\n\nYeah. I'll take -- I'll answer this question, Justin. So, look, we don't break down necessarily how much of it is unit versus ASP or anything like that. But as you can see in our 10-Q, consumables and healthcare were the main drivers of our net sales growth in the second quarter.\n\nA lot of that is going to be MAP priced, and there's MAP compliance in that part -- in the business. If you look at the inputs and I know we don't report this explicitly out. But we had orders -- order volume increase for us year over year. Each quarter was also bigger in terms of both units and dollars.\n\nSo, bigger baskets and more orders. and we continue to gain incremental share of wallet across the customer base. So, it's those -- all those components together that are driving the NSPAC expansion for us.\n\nJustin Kleber -- Baird -- Analyst\n\nOK. Very helpful. Thanks for that. Just one other follow-up, kind of bigger-picture question.\n\nYou mentioned the demand for hardgoods, you think will improve as pet household growth returns to historical levels. Just any thoughts on the timeline of that return? There's this debate across a lot of retail categories around how much demand or consumption was pulled forward during the pandemic. So, just curious if you have a view on that from a pet acquisition perspective. And if this is maybe a multiyear hangover or digestion period just in terms of pet acquisition? Thank you.\n\nSumit Singh -- Chief Executive Officer\n\nI think it depends categorically. If the macro factors abate, you should actually see normal spending resume on categories that are more recurring within hardgoods such as toys, or carriers that actually support travel, etc., come back to normal, in line with the macro recovery. Then there are categories that are impacted by household formation such as new adoptions driving to higher crate purchases, which I would also actually correlate back to the macro improving. And finally, there are refresh -- longer refresh cycle categories such as beds which we believe will actually remain muted for a bit while longer given the refresh cycle that beds went through over the last two years where every household likely bought multiple beds, etc.\n\nI'm obviously speculating a bit, and I don't have a crystal ball here, but that's generally in line with how we forecast and what we would predict trending to work.\n\nJustin Kleber -- Baird -- Analyst\n\nGot it. Makes sense. Thank you both.\n\nSumit Singh -- Chief Executive Officer\n\nSure. Thank you.\n\nOperator\n\nThank you. The next question is from the line of Chris Bottiglieri with BNP. Please proceed.\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nGood enough. I'll take it. Hey, guys. Can you talk about a couple of things? I guess I want to get a sense on private label penetration, both to the consumables and hardgoods as inflation has crept up, have you seen any increased adoption of these private label brands? And could you quantify it if so? And then I read the 10-Q, and it sounds like you quoted mix as a tailwind on gross margin, which, I guess, is surprising given the weakness in discretionary.\n\nCould you just elaborate more on what's driving that favorable mix?\n\nSumit Singh -- Chief Executive Officer\n\nSure. So, in private brands, no, we haven't seen a dramatic uptick in private branded adoption -- our private brands adoption. The reason for that is on a weighted basis, hardgoods formed from a mix contribution point of view, hardgoods forms the majority of our mix. And as you can tell, hardgoods mix is actually down.\n\nAnd within hardgoods, we've seen some trade toward private brands and toys given Frisco is a strong brand. But broadly speaking, the purchase cycle isn't actually favorable now. In terms of your second question, could you repeat that, Chris, please?\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nYeah. I was just looking at the 10-Q and it sites that one of the drivers of COGS was that you're seeing favorable changes in our mix of sales. But given that discretionary sales are down, just trying to understand what drove the favorable mix.\n\nMario Marte -- Chief Financial Officer\n\nFair enough. But if you look at the other category, that's where our healthcare sales are, and that grew the fastest of all three categories. So, the change in mix, yes, some of it went to consumables but a fair amount of that also went to a more profitable category, which is the healthcare.\n\nSumit Singh -- Chief Executive Officer\n\nOur strength in healthcare offset decline in hardgoods.\n\nOperator\n\nThank you. That concludes the question-and-answer session. I will now hand the call over to Sumit Singh for closing remarks.\n\nSumit Singh -- Chief Executive Officer\n\nThank you all. Have a good evening, and we'll see you all soon.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRobert LaFleur -- Vice President, Investor Relations\n\nSumit Singh -- Chief Executive Officer\n\nMario Marte -- Chief Financial Officer\n\nCorey Grady -- Jefferies -- Analyst\n\nBrian Fitzgerald -- Well Fargo Securities -- Analyst\n\nJian Li -- Evercore ISI -- Analyst\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nAnna Andreeva -- Needham and Company -- Analyst\n\nDylan Carden -- William Blair -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nJustin Kleber -- Baird -- Analyst\n\nChris Bottiglieri -- Exane BNP Paribas -- Analyst\n\nMore CHWY analysis\n\nAll earnings call transcripts"
}