{
  "companyName": "ShockWave Medical",
  "companyTicker": "SWAV",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/07/shockwave-medical-swav-q3-2022-earnings-call-trans/",
  "content": "ShockWave Medical (SWAV -0.92%)\nQ3 2022 Earnings Call\nNov 07, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Shockwave's third quarter 2022 earnings conference call. [Operator instructions] As a reminder, this call is being recorded for replay purposes. I would now like to turn the call over to Debbie Kaster, vice president of investor relations at Shockwave, for a few introductory comments. Thank you.\n\nYou may begin.\n\nDebbie Kaster -- Vice President, Investor Relations\n\nThank you, all, for participating in today's call. Joining me today from Shockwave Medical are Doug Godshall, president and chief executive officer; Isaac Zacharias, president and chief commercial officer; and Dan Puckett, chief financial officer. Earlier today, Shockwave released financial results for the quarter ended September 30, 2022. A copy of the press release is available on the Shockwave website.\n\nBefore we begin, I would like to remind you that management will make forward-looking statements during this call within the meaning of federal securities laws, which are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Any statements contained in this call that relate to expectations or predictions of future events, results, or performance are forward-looking statements. All forward-looking statements, including, without limitation, statements related to our sales and operating trends, business and hiring prospects, financial and revenue expectations, and future product development and approvals are based upon our current estimates and various assumptions. These statements involve material risks and uncertainties, including the impact of the COVID-19 pandemic, that could cause actual results or events to materially differ from those anticipated or implied in these forward-looking statements.\n\nAccordingly, you should not place undue reliance on these statements. For a list and description of the risks and uncertainties associated with our business, please refer to the Risk Factors section of our annual report on Form 10-K or filed with the SEC and available on EDGAR and in our other reports filed periodically with the SEC. Shockwave disclaims any intention or obligation, except as required by law, to update or revise any financial projections or forward-looking statements, whether because of new information, future events, or otherwise. This conference call contains time-sensitive information and is accurate only as of the live broadcast today, November 7, 2022.\n\nSo with that, I'll turn the call over to Doug.\n\nDoug Godshall -- President and Chief Executive Officer\n\nThanks, Debbie. Good afternoon, everyone, and thank you for taking the time to join us to review Shockwave's results for the third quarter of 2022. We are pleased to share the results of another strong quarter delivered by our global team. Sales in the third quarter of $131.3 million represented an increase of 102% from the third quarter of 2021.\n\nThe team delivered these results despite some of the macro headwinds that have been described by others in our sector. Fortunately, our team and our customers have become very nimble in their ability to adapt to the changing circumstances around them and to remain focused on optimizing patient care. We continue to witness strength across the entire Shockwave franchise, which reflects the widespread appeal of our technology and bodes well for the long-term health of the business. In the U.S., coronary and peripheral sales both more than doubled from the third quarter of 2021.\n\nInternationally, our progress was also quite impressive with sales up 68% from a year ago. The direct investment we have been making is paying off nicely and our international sales and marketing team now stands at 53. Later in the call, Isaac will provide additional insights from the field, but I would first like to share some commentary around recent progress across the Shockwave organization. I will start with a few updates on some of the new products in our portfolio.\n\n[inaudible] C2+ coronary product in Europe in late August. C2+ adds 50% more pulses going from 80 to 120. Since our initial launch of C2 in Europe, our customers have often wished they had more pulses so they could deliver more energy to a particular lesion or treat additional lesions identified during the procedure. The additional 40 pulses should go a long way toward satisfying our customers and further enhancing outcomes.\n\nWe started a limited market release in Europe and, if all continues to go well, we'll move forward with the U.S. regulatory process. We also received FDA approval of our L6 peripheral catheter a bit ahead of schedule and are about to commence a limited release of that product. L6 offers two new features, larger diameters, and more concentrated power.\n\nOur customers have expressed interest in larger diameters for the larger vessels above the SFA and in response, L6 has eight-, nine-, 10-, and 12-millimeter diameter versions. We positioned these six emitters in L6 closer together than in our other catheters, which concentrates the power, and will enable delivery of the sonic energy over a greater distance. This [inaudible] will enable L6 to maintain the superb efficacy in large vessels that our customers have become accustomed to in small-diameter vessels. Next, M5+ continues to perform extremely well, and we are encouraged to see an increasing use of the 3.5 and four-millimeter sizes, which indicates an increasing use for below-the-knee lesions.\n\nThe longer shaft of M5+ enables it to be used below the knee, whereas the original M5 was generally unable to reach those lesions. M5+ offers a 50% longer treatment zone than S4, which is attractive for longer lesions, and we see the expansion of M5+ into the BTK segment as a first step toward a more sophisticated below-the-knee portfolio. We are also continuing to invest in data generation to both support and expand the use of IVL in different patient populations. At TCT, we announced the initiation of EMPOWER CAD, which will be the first-ever prospective coronary intervention study consisting entirely of female patients.\n\nHistorically, females with coronary artery disease tend to have less favorable outcomes than males, particularly when using atherectomy. Our existing data have consistently shown similar safety outcomes for IVL in both sexes, which caught the attention of our investigators and motivated us to explore a female-only study, which will include a broader set of real-world lesions than were studied in our earlier trials. There were multiple IVL data sets presented at TCT this year. The session that seemed to have the most significant impact was our symposium entitled Controversies in Calcium and open-minded debate on approaches to nodular calcium.\n\nAs we remind the data from our trials, the results across our studies confirm that IVL delivers consistent results in terms of stent expansion, minimum stent area, and procedural safety, regardless of the presence or absence of nodular calcium within these target lesions. These findings have been very well received by our customers at large, and we are anticipating a publication in the not too in the future. Lesions with calcified nodules account for roughly 20% of the problematic calcified lesions, and we see a meaningful opportunity to move these nodular cases into the IVL camp now that we have such compelling data from our trials to help our customers make the right choice for their patients. And the final point on the clinical front, we are fortunate to be accepted for a late-breaker presentation at VIVA for the third year in a row with the results from our PAD observational study presented last week.\n\nThis study included over 1,300 patients, which is the largest number of severely calcified vessels treated in a core lab adjudicated peripheral study. Those present at the meeting were impressed by our commitment to generating robust data in the peripheral space. The key takeaways we heard from the attendees were that our results are remarkably consistent in terms of the efficacy of our therapy, regardless of which vessel is treated and that IVL continues to demonstrate extraordinarily low adverse events in a very complex population. These data capped off an overall strong Shockwave showing at VIVA.\n\nAnd lastly, a quick reimbursement update. We were pleased last month to be branded a category 1 CPT code for coronary IVL, which means that physicians will receive an additional professional fee when they use C2. This process now gets turned over to the RUC Committee to determine payment level, which would be memorialized in the final rule about a year from now and will become effective January 1, 2024. We are also pleased to have recently been granted reimbursement for coronary IVL by the Ministry of Health, Labor and Welfare, or MHLW, in Japan at a level of JPY 4,29,000, which equates to about USD 3,000 given current exchange rates.\n\nOur C2 system will be officially reimbursed in December and our current plan is for our team to launch C2 in January in Japan. We expect that the Japan launch will start slowly but will become a meaningful contributor to our business starting in late 2023 and will be a great complement to our other growth engines. Our global customers continue to adopt IVL across a wide spectrum of their patients, which has enabled us to deliver consistent results despite external speed bumps like staffing challenges and exchange rates. Given the various internal and external considerations, we now anticipate delivering top-line revenue in the range of $483 million to $488 million for the full year of 2022, representing growth of 104% to 106% from 2021.\n\nWith that, I will turn the call over to Isaac, and then Dan will share more detail on the broader business and financial results. Isaac?\n\nIsaac Zacharias -- Chief Commercial Officer\n\nThank you, Doug. As Doug mentioned, we had another strong quarter across U.S. coronary, U.S. peripheral, and international.\n\nThe M5+ launch continues to go very well. Physicians appreciate the enhancements that M5+ brings compared to its predecessor and we are seeing strong volume growth in the U.S. and international markets. Our target is to complete the launch in the U.S.\n\nthis year so that we can enter 2023, focused on driving penetration versus lunching accounts. We are very pleased with the unit growth we are seeing for the M5 product this year. In the U.S., the volume for the M5 product family year to date is nearly 70% higher than the same period last year. The M5+ price uplift further contributes to the revenue growth of M5 product line in the U.S.\n\nThe team has executed very well in this launch, and we have seen year-on-year growth rates of the average daily sales for the M5 products accelerate in 2022 with Q1 up 52%, Q2 up 75%, and Q3 up 124% compared to the respective quarters in 2021. In our international markets, we added marketing resources last year to focus on the peripheral business. With the efforts from the marketing group and the launch of M5+, we are seeing over 100% growth in the unit volume of the M5 products internationally. While still a relatively small component of our revenue, the international peripheral business will be an important long-term contributor.\n\nWe also continue to see solid progress in the S4 business, and we look forward to increasing the growth in our BTK business with improved products and strong clinical data, both of which are currently being developed. Turning to the coronary business. We continue to see strength in all geographies. This is a credit to our sales teams and distribution partners as they have been able to deliver strong growth in the coronary business while executing the launch of M5+.\n\nIn 2023, we expect incrementally more focused on driving coronary adoption. Now I'd like to spend a few minutes providing some detail on how we look at the future potential of the coronary business. We will update the investor deck with specific references from clinical studies that show moderate to severe calcium is present in at least 30% of stable and unstable coronary PCIs [inaudible] reflected in our current TAM. Most of these studies rely on angiographic core lab to identify calcium.\n\nHowever, we know that when intravascular imaging is used, calcium is detected more often than it is by angiography. So the prevalence of moderate to severe calcium is likely higher than 30% of PCI and is growing as the prevalence of significant predictors, such as age and diabetes, are on the rise. The use of intravascular imaging is increasing in the U.S., particularly in complex PCI. And as you know, it is used nearly 100% of PCI cases in Japan.\n\nBottom line, it is increasingly evident that the prevalence of calcified PCI likely exceeds 30% and is growing. Our goal is to maximize the penetration of IVL in calcified PCIs. Relative to the prevalence just mentioned, we are still in the early innings. To realize this potential, we need to have a steady cadence of new products supported by robust clinical data.\n\nThe first of these new products is C2+. We're also well into the development of the next version of our year-ago product that will follow C2+ in the market in the coming years. We have invested in the EMPOWER study and are currently assessing other coronary trial opportunities. We have recently initiated new sales tactics and organizational changes intended to drive continued near-term penetration increases.\n\nIn the U.S., we spent the early part of this year analyzing rep, physician, and account behaviors to determine why we have variable penetration in accounts. For context, we have many accounts that are already using IVL at mid-teen percentages of the PCI. We also have many accounts that are using IVL in the low single-digit percentages of PCIs. Based on this work, we have initiated six work streams that will help our team increase adoption of coronary IVL.\n\nThese include acquiring better procedural and physician-level data to improve our targeting, enhancing our sales trend, and increased peer-to-peer physician education. I'm confident that this work will help us continue to change how and when IVL is used. We are also focusing on optimizing the structure of our territories. We currently have approximately 1.6 clinical specialists in each territory.\n\nThe ratio of clinical specialists to territory managers has increased from 1.2 in Q3 of 2021, as we added approximately 20 territories and 50 clinical specialists over the last year. The territory managers focus primarily on launching accounts and managing the business aspects of the territory, while clinical specialists work to drive penetration within those accounts via training, education, and case support. In Q3, our average territory generated approximately $1.3 million of total revenue. Note that this compares to average territory revenue of approximately $1 million in Q1 of this year.\n\nBy the end of 2023, we expect to have between 110 and 120 territories and will average over two clinical specialists per territory. As we grow next year, we also expect our territory productivity to increase so that our average territory in Q4 of 2023 will have substantially more revenue than our average territory does today. The additional territories and increased ratio of clinical specialists to territories will result in having fewer accounts of service, which enables the team to work closely with all physicians in each account. It will also ensure that we can support the peripheral business while launching new coronary products, and vice versa.\n\nIn addition to evolving sales tactics and organizational structure, we expect to see continued progress on coronary reimbursement. The procedure economics for the hospital and physicians both have an impact on expanding adoption of new technologies. Using the peripheral U.S. business as an analog, I noted previously that we have seen the average daily sales growth of the M5 product family accelerate each quarter this year in the U.S.\n\nThis acceleration was based on the launch of a new product, coupled with improved hospital economics. With the reimbursement change this past January, hospital payments for an outpatient above-the-knee procedure involving IVL increased by $5,000 to $7,000, which is greater than the hospital's cost to purchase an IVL catheter. Currently, coronary IVL catheters are reimbursed under a transitional pass-through payment, which is intended to offset the cost of the device. This clearly has helped facilitate access to the C2 device while [inaudible] gathers data on the cost of coronary IVL procedures.\n\nAs we look beyond the transitional pass-through program to the eventual long-term reimbursement scenario, we are on a path that is similar to peripheral. The incremental payments to hospitals for procedures involving coronary IVL should exceed the cost of the device. We expect that the cost data from the TPT program will support an incremental $7,000 payment to hospitals for coronary IVL procedures compared to the payment for a standard stenting procedure. Similar to our above-the-knee situation, this incremental payment would be greater than the cost to purchase a C2 catheter.\n\nTurning to the physician fee, we are pleased that coronary IVL was graded a level 1 CPT code starting in 2024. This should enable physicians to receive incremental professional fees when using IVL. So looking ahead in the U.S., we will have a new product in C2+ and a larger field footprint with improved hospital and physician economics that will enable a deeper penetration of coronary IVL. Outside of the U.S., we are fortunate to have very strong payments set in Japan at the outset of our launch for both the hospitals and for physician fees.\n\nWe are also working on reimbursement in other countries, although they tend to be less predictable than Japan. While uncertain, if we can prove the reimbursement in any country, it would be an incremental tailwind for future growth. Our highest volume customers already have an IVL-first mentality and have quickly changed their behaviors when it comes to treating calcified PCI. With the efforts discussed above, we hope that every customer will have an IVL-first mentality when it comes to calcified PCIs.\n\nWith that, I will now turn the call to Dan to review the financials.\n\nDan Puckett -- Chief Financial Officer\n\nThank you, Isaac. Good afternoon, everyone. Shockwave Medical's revenue for the third quarter ended September 30, 2022, was $131.3 million, a 102% increase from $65.2 million in the third quarter of 2021. U.S.\n\nrevenue was $110.5 million in the third quarter of 2022, growing 109% from $52.8 million in the third quarter of 2021. Coronary products contributed $77.3 million to U.S. revenue in the third quarter of 2022, 109% increase from $36.9 million in the third quarter of 2021. Peripheral products accounted for $32.9 million in U.S.\n\nrevenue, an increase of 111% from $15.6 million in the third quarter of 2021. Generators accounted for $0.3 million of U.S. revenue in the quarter. The growth in U.S.\n\nrevenue was driven by increased utilization of existing accounts, new account adoption of IVL, and continued sales force expansion. International revenue was $20.8 million in the third quarter of 2022, a 68% increase from $12.4 million in the third quarter of 2021. International revenue from coronary products was $15.7 million in the third quarter of 2022, a 54% increase from $10.2 million in the third quarter of 2021. International revenue from peripheral products was $4.1 million in the third quarter of 2022, a 95% increase from $2.1 million in the year-ago quarter.\n\nGenerators accounted for $0.9 million in international revenue in the third quarter of 2022. The increase in international revenue over the prior-year period reflects continued geographic expansion, including China, growth in customer demand, and the growth of our direct sales force in Europe. The increase in international revenue was partially impacted by unfavorable foreign exchange rates. Looking at total revenue by product line.\n\nOur coronary products accounted for $93 million of total revenue in the third quarter of 2022, compared to $47.2 million in the third quarter of 2021, representing a 97% increase. Our peripheral products accounted for $37 million of total revenue in the third quarter of 2022, compared to $17.7 million in the third quarter of 2021, a 109% increase. In addition, the sales of generators contributed $1.2 million in revenue in the third quarter of 2022, compared to $0.3 million in the third quarter of 2021, a 369% increase. Gross profit for the third quarter of 2022 was $113.5 million, compared to $54.2 million in the third quarter of 2021.\n\nGross margin for the third quarter of 2022 was 86%. That's compared to 83% in the third quarter of 2021. Improvement in gross margin was primarily driven by product mix, as well as continued improvements in productivity and process efficiencies. Total operating expenses for the third quarter of 2022 were $76.7 million, a 49% increase from $51.4 million in the third quarter of 2021.\n\nSales and marketing expenses for the third quarter of 2022 were $42.1 million, compared to $28.4 million in the third quarter of 2021. The increase is primarily driven by sales force expansion. R&D expenses for the third quarter of 2022 were $20.2 million, compared to $13.7 million in the third quarter of 2021. The increase was primarily driven by headcount growth.\n\nGeneral and administrative expenses for the third quarter of 2022 were $14.4 million, compared to $9.3 million in the third quarter of 2021. The increase was primarily driven by higher headcount to support the growth of the business. Net income for the third quarter of 2022 was $35 million, compared to net income of $1.9 million in the third quarter of 2021. Basic net income per share for the third quarter of 2022 was $0.97.\n\nDiluted net income per share for the third quarter of 2022 was $0.92. We ended the third quarter of 2022 with $250.7 million in cash, cash equivalents, and short-term investments. Additionally, in October of 2022, we entered into a $175 million revolving line of credit as a matter of routine corporate governance and to provide further financial flexibility. At this point, I'd like to turn the call back to Doug for closing comments.\n\nDoug Godshall -- President and Chief Executive Officer\n\nThank you, all, for joining us for the call today. I'm encouraged by the results we achieved this quarter despite the continued macroeconomic challenges. Our global team remains focused on execution and operating efficiencies balanced with investment in our pipeline to drive continued growth as we strive to provide the best solutions to improve the lives of patients. With that, we'll open the call for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Adam Maeder with Piper Sandler. Please proceed.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nHi. Good afternoon, guys. Thank you for taking the questions, and congrats on another nice quarter. Maybe you could start just on the new guidance.\n\nI think it implies Q4 revenue of about $140 million at the midpoint, if I'm doing the math right, which is up about 6% quarter over quarter sequentially. And Q4 is typically a seasonally strong quarter for MedTech. You grew close to 9% sequentially Q3 over Q2. Maybe just walk through some of the assumptions and the new guidance range and how you're thinking about Q4.\n\nAny color on kind of how the business has trended in the past weeks? Was there some conservatism baked in? And then I have a follow-up.\n\nDoug Godshall -- President and Chief Executive Officer\n\nYes. Thanks, Adam, I'm going to probably tag the team on this one. Certainly, as reflected in the past quarter, we have great underlying momentum in the business and traction across all of our product lines in all of our geographies. So business is very healthy.\n\nWhat we tried to factor into our sort of the next -- well, this quarter, is the -- that strong momentum overlaid against the fact that there are other things, like we do have more FX headwinds as we get to the back end of this year than we've seen historically. There are a few shorter -- a few fewer days, selling days, than in the third quarter. And while we've -- the team has executed incredibly well in the face of staffing shortages and the like, there are some larger centers at where we see some impact on their volume and we tried to as best we could factor in the fact that they're both in the U.S. and, to some extent, internationally.\n\nThere are some procedure movements that we tried to consider what modest impact they might have in the quarter. So we factored what we considered some impact on the volumes that we might see in the top-line versus the fact that we continue to see tremendous traction with our customers.\n\nIsaac Zacharias -- Chief Commercial Officer\n\nYeah. I think -- Adam, it's Isaac. We don't see anything that gives us pause. The momentum in the business is good.\n\nWe're seeing great momentum internationally and in the U.S., we had, what -- TCT, Scripps, and VIVA recently, and the customer interactions there were great, talking to the team, our team members that were there. I think we like the momentum we see going into the quarter. and think it will be a strong quarter for us in Q4.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nVery helpful color, guys. Thank you. And then for the follow-up, maybe for Dan. It looks like another nice step-up in operating margin, I have Q3 at 28% in my model that's, I think, 350 basis points improvement quarter over quarter.\n\nAnd been making some pretty significant jumps here over the past few quarters on the operating margin line. So how do we think about op margin in Q4 and also for 2023? And just walk us through kind of some of the key puts and takes there. Thank you.\n\nDan Puckett -- Chief Financial Officer\n\nSure. We're not providing guidance for next year just yet. But Q4, I think will be fairly consistent with Q3. We're going to see some fluctuations based on mainly R&D line.\n\nWe've got timing in there between clinical and just straight R&D that could cause some variations, but we've had a very favorable trend. And -- looking forward, we're going to continue to focus on the full P&L of the revenue and in the opex and the gross margin. But we're not tightening the screws to optimize our margin. We're spending what we need to spend to grow the business long term, the main focus on obviously R&D.\n\nOperator\n\nThank you. Our next question is from Bill Plovanic with Canaccord. Please proceed.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nHey, great. Thanks for taking my questions. I'd like to zero in kind of on the guidance and maybe on the U.S. coronary.\n\nIn the past, you've kind of provided us and maybe I missed it on what the reorder rate was on C2 in the U.S. And just as you think about the fourth quarter guidance, it looks like the U.S. coronary sequentially is kind of the slowest quarter we've seen nominally since the launch of C2. And just some of your thoughts is, do you think that may be -- are you just starting to hit kind of more of a penetration rate where it will be a little slower sequentially going forward? Or was that potentially summer slowdown that we saw in the quarter? Thanks.\n\nIsaac Zacharias -- Chief Commercial Officer\n\nYeah. Hi, Bill. I think we chose this quarter to provide a little more color on long-term coronary and how we're going to get it from where we're at today, which we're pleased with, to where we think it can be. And from a kind of launch metric standpoint, we've now -- we're 18 months into that launch.\n\nSo the kind of metrics on centers and who's using both and reorder rates. That's it. Everything is moving in a consistent direction with what we've reported previously, but it's just not very interesting going forward as we've launched most of the accounts at this point. We still got some to go, but we've launched most of them.\n\nI think from a sequential standpoint in the quarter, we expect it to be a strong quarter for Q4. So we're -- again, we're pleased with the momentum. I think as you -- as we get through launching the accounts, now it's going to be more of a focus on driving penetration within the accounts. And I think we got the structure and the tactics going forward to make that happen.\n\nAnd also, we're really focused as I said on the call, to close out our M5 launch in the U.S. this year, so that we turn the corner next year, we've got that conversion of accounts to M5+ behind us, and we're focused on penetrating all the product lines that we have versus flipping accounts from M5 to M5+.\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nOK. And just clarification from Dan. Just when you said for fourth quarter and the operating margin, you think it will be consistent and -- except for maybe the R&D line could move around. I would assume that there might be more R&D spend in the fourth quarter versus last.\n\nAnd then on the P&L, how do we think about taxes? You basically don't pay taxes. Do you think you'll start paying taxes? And if so, what should we plug into our models? Thanks.\n\nDan Puckett -- Chief Financial Officer\n\nSure. And -- yes, we expect more spend in R&D in Q4 than Q3. On taxes, at the end of 12/31/21, we had $351 million in NOLs. So we're burning through those.\n\nAnd once we burn through those, we'll have a nominal rate, about 25%. That's 21%, U.S.; 4%, other.\n\nOperator\n\nThank you. Our next question is from Michael Polark with Wolfe Research. Please proceed.\n\nMichael Polark -- Wolfe Research -- Analyst\n\nGood afternoon. Thank you for taking the questions. Clearly not evident in your performance, but I am curious for anecdotes on what you see in the field. staffing challenges is kind of catch-all description, but what does that really mean for your customers day-to-day? Kind of what limitations are most pronounced and kind of how did -- how did 3Q feel in the cath lab versus the first six months of this year?\n\nDoug Godshall -- President and Chief Executive Officer\n\nYeah. It's an interesting dynamic, very different than, say, COVID, where it would be like a wipe out in some areas. This is more -- and Isaac and I were comparing notes, we were at VIVA last week, and both have spent a bunch of time in the field. In some hospitals, no difference.\n\nThey've ratcheted down on travel nurses gotten things under control in other areas. One big center I was talking to last week like they had a -- they were struggling to even get travel nurses, so they were for a couple of weeks on sort of emergency cases only. So it's pocketed. Certainly, the -- in the past, we've talked about staffing challenges being the new norm, and I'd say they are the new norm, although they're sort of severe centers of pockets and then no change whatsoever with momentum being quite strong in the procedure volume.\n\nSo it's not like a major downdraft, but it does affect volume when hospitals have to restrict cases. And so it's a factor. It's -- I wouldn't say it's -- we're certainly -- obviously, we're not terribly concerned, other than it's frustrating for our customers when they can't get the cases done at the time they want to get them done.\n\nIsaac Zacharias -- Chief Commercial Officer\n\nYeah. And I'd just add to that, it's not worsening. I mean, I'd say, generally across the U.S., the staffing is improving and has been this year. The -- where we see some problems, though, it will limit the ability of a typical Q4 surge of procedures if that center doesn't have the staff to support it.\n\nAnd that's where you'll hear -- that's where we hear pockets of that happening. You're not going to be able to get procedures going from Q3 to Q4, like you typically will because they're just not letting you schedule that many electives.\n\nMichael Polark -- Wolfe Research -- Analyst\n\nAppreciate that color. And maybe for the follow-up on coronary, Isaac, you provided a lot of good detail in your remarks, and you said, hey, you see accounts where penetration of PCI is low singles with IVL and you see accounts where consistently folks are mid-teens. And I guess, as you bridge that divide, kind of what are the one, two, or three things that stand out? What are the kind of -- what's the handholding and support that your team can provide to take that low single-digit account up toward 10 or beyond?\n\nIsaac Zacharias -- Chief Commercial Officer\n\nYeah. I think, I mean, so probably the No. 1 thing still is economics or perceived economics. And I think some centers -- it may be our team with some centers have done a better job of bridging that with the administration, and that's kind of an ongoing effort.\n\nAnd we talked about how we see that improving over the midterm. I think beyond that, our best centers are centers where you have -- there might be five interventional cardiologists doing procedures there. And all five of them have kind of bought in and have adopted coronary IVL. And that -- a physician at that center is as good as a physician as we have anywhere, but you'll have other centers where you have a physician who's doing a lot of complex work, they've bought in IVL, and they're doing it as appropriate and kind of where we see it should be but you have other cardiologists at that center who, for any number of reasons, we haven't been able to spend enough time with or to convert kind of into a higher volume user of IVL.\n\nSo a lot of the work is kind of this territory refinement where we can continue shrinking territories in terms of the number of hospitals that the territory has, add [inaudible] into that territory so that you now have kind of people per hospital that give you more time to focus in the account with each customer in the account. And what that then will enable us is to continue pushing penetration of M5+, for instance, when we launch C2+ or continue like we did this year, pushing the penetration of coronary while we executed a big launch with M5+. So I think as we go forward, it's -- and as our kind of revenue base grows, we'll be able to continue refining our territories so that we got time to really work in the accounts and launch products while continuing to drive penetration. And bottom line for us, we see a lot of upside to the penetration still, we're in the early innings.\n\nThanks for the questions.\n\nOperator\n\n[Operator instructions] Our next question is from Larry Biegelsen with Wells Fargo. Please proceed.\n\nNathan Treybeck -- Wells Fargo Securities -- Analyst\n\nThis is Nathan Treybeck on for Larry. Congrats on a great quarter. I appreciate you're not giving guidance for 2023. In light of the macro factors that you called out impacting Q4, can you just help level set of consensus revenue growth of 30% is directionally an appropriate way to model?\n\nDoug Godshall -- President and Chief Executive Officer\n\nSo yes, you are right. We're not going to guide 2023. Yes, we see strong growth as we head out of this year and into next year and sustaining it for multiple quarters to follow.\n\nNathan Treybeck -- Wells Fargo Securities -- Analyst\n\nOK. And how should we think about the contribution from Japan and China? You previously ranked growth in 2023 as U.S. coronary, U.S. peripheral, and then China and Japan.\n\nIs this still kind of the right framework? Like, those are the top three drivers?\n\nDoug Godshall -- President and Chief Executive Officer\n\nYeah. I think they're still the top three. Japan will come on more slowly, and we think sort of analogous to our U.S. peripheral reimbursement, a very nice, steady, slow -- methodical, not slow, methodical growth engine, and sustainable growth engine.\n\nAnd China, as we've seen, came on quickly second quarter with a stocking order, but third quarter, all on reorders. So -- we don't expect, given the sort of the nature of the market in Japan that will step up that quickly, but will contribute very handsomely. And given all the -- given everything we're putting in place and continue to see in terms of the traction we're getting in the U.S., coronary will continue to drive handsomely next year, and we're really pleased with what we're seeing on the reimbursement and new product combination on the peripheral side. It's doing what we had hoped it was going to do with M5+ combined with a step up in payment level for the hospital.\n\nIsaac Zacharias -- Chief Commercial Officer\n\nYeah. I would just add to that. I think I agree with Doug. We're seeing -- I feel like we've got great momentum across the business, product line, and geography.\n\nThe Japan team is ready to launch. We're pleased with MHLW and how they value the product from a reimbursement standpoint. And I'd say if I go back 12 months, I'm most surprised this year by the strength of our U.S. peripheral business.\n\nI would not have predicted it to be this strong in growth this year even after we knew about the reimbursement uplift. But I think that's a great sign of what we'll continue to see in the U.S. peripheral business and then what we'll see in Japan with the reimbursement and what we'll eventually see as reimbursement improves in the U.S. with coronary.\n\nNathan Treybeck -- Wells Fargo Securities -- Analyst\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDebbie Kaster -- Vice President, Investor Relations\n\nDoug Godshall -- President and Chief Executive Officer\n\nIsaac Zacharias -- Chief Commercial Officer\n\nDan Puckett -- Chief Financial Officer\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nBill Plovanic -- Canaccord Genuity -- Analyst\n\nMichael Polark -- Wolfe Research -- Analyst\n\nNathan Treybeck -- Wells Fargo Securities -- Analyst\n\nMore SWAV analysis\n\nAll earnings call transcripts"
}