{
  "companyName": "Okta",
  "companyTicker": "OKTA",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/okta-okta-q3-2023-earnings-call-transcript/",
  "content": "Okta (OKTA -0.06%)\nQ3 2023 Earnings Call\nNov 30, 2022, 5:00 p.m. ET\n\nDave Gennarelli\n\nHi, everybody. Welcome to Okta's third-quarter fiscal year 2023 earnings webcast. I'm Dave Gennarelli, senior vice president of investor relations at Okta. With me in today's meeting, we have Todd McKinnon, our chief executive officer and co-founder; and Brett Tighe, our chief financial officer.\n\nToday's meeting will include forward-looking statements pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including, but not limited to, statements regarding our financial outlook and market positioning. Forward-looking statements involve known and unknown risks and uncertainties that may cause our actual results, performance, or achievements to be materially different from those expressed or implied by the forward-looking statements. Forward-looking statements represent our management's beliefs and assumptions only as of the date made. Information on factors that could affect the company's financial results is included in our filings with the SEC from time to time, including the section titled Risk Factors in our previously filed Form 10-Q.\n\nIn addition, during today's meeting, we will discuss non-GAAP financial measures. These non-GAAP financial measures are in addition to and not a substitute for or superior to measures of financial performance prepared in accordance with GAAP. A reconciliation between GAAP and non-GAAP financial measures and a discussion of the limitations of using non-GAAP measures versus their closest GAAP equivalents is available in our earnings release. You can also find detailed information in our supplemental financial materials, which include trended financial statements and key metrics posted on our Investor Relations website.\n\nIn today's meeting, we will quote a number of numerical growth changes as we discuss our financial performance. And unless otherwise noted, each such reference represents a year-over-year comparison. And now, I'd like to turn the meeting over to Todd McKinnon. Todd?\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nThanks, Dave, and thank you, everyone, for joining us this afternoon. We're pleased with our Q3 results, but before reviewing them, I thought I'd provide an update on some of the progress with respect to the execution challenges we faced this year. Our confidence in our ability to further advance our leadership position in a very large market opportunity has not wavered. In fact, with all the great new products and functionality we announced at Okta in '22 earlier this month, we are more optimistic about our long-term prospects than ever.\n\nThe action plan we initiated to stem attrition has delivered meaningful improvement over the last quarter. And while we're making progress with the execution challenges we outlined, we recognize that it will take several quarters to regain top-line momentum in the business. Adding to the challenge is a global macro environment that we anticipate becoming worse before it improves. Brett will talk more specifically about what we're seeing in our business in terms of the macro environment and the more cautious approach we're taking to our business outlook.\n\nWe view these issues as short-term in nature. We continue to focus on the long term while making the necessary adjustments to the business in the near term, including our commitment to meaningfully higher profitability and cash flow. One constant is that identity will remain a critically important element to organizations. At Oktane22 earlier this month, we officially unveiled our simplified two-cloud approach to the market: the Workforce Identity Cloud and the Customer Identity Cloud, two clouds, one Okta.\n\nThis alignment has alleviated prior confusion in the field and sets us up to build on these two powerful pillars. More importantly, this strategy has been enthusiastically received by our go-to-market team, customers, and partners. A great proof point is the upward trend line of the number of sales reps that have closed Customer Identity Cloud deals over the past three quarters. The feedback that I personally received in my conversations with dozens of partners and customers at Oktane was overwhelmingly positive, and we firmly believe that it will only get better with time.\n\nIdentity matters to every part of an organization, which is why it's such a strategic decision. CIOs care about high-performing IT. CMOs care about conversion and customer acquisition. CTOs care about innovation.\n\nCFOs care about costs and efficiency. And CEOs and their boards care about all of these things. Identity can help address all of these. And having one account exec to speak to all of these decision-makers will help drive a more cohesive identity strategy across the entire organization.\n\nTurning to our Q3 results. We added 650 new customers in the quarter, bringing our total customer base to over 17,000, representing growth of 22%. We continue to see growth with large customers for both Workforce and Customer Identity. And we are proud to work with some of the most important brands in the world, such as S&P Global, McKesson, and Zoom.\n\nIn Q3, we added 215 customers with $100,000-plus ACV, our total base of $100,000-plus ACV customers now stands at over 3,700 and grew 32%. Here are just notable examples of customer wins in Q3, which come from a wide range of industries. KeyBanc, a Fortune 500 financial services company, was a significant Okta Workforce new business win. They sought a cloud-based identity solution to help modernize their legacy systems, eliminate redundancies across toolsets and support their cloud-first initiatives.\n\nOkta's Workforce Identity Cloud will provide a unified identity system, will also enhance security through adaptive multi-factor authentication for KeyBanc's 25,000 globally distributed employees. A Fortune 100 global entertainment conglomerate was a big upsell this quarter. As a result of many acquisitions, the company has disparate identity providers that resulted in its employees having multiple different log-ins to access corporate apps resulting in friction, unpleasant user experiences, and slowed business outcomes. Having leveraged Okta Workforce for several business units, this customer is now deploying Okta Workforce Identity Cloud to cover its more than 200,000 employees.\n\nToday, they are one of our largest customers and we believe there is significantly more opportunity to unlock as we partner with them going forward. We also closed our biggest Customer Identity Cloud deal ever with a multinational technology company. This company began using Okta back in 2019 to better connect with its business partners. The company then sought to consolidate onto a single identity provider while accelerating revenue, moving to the cloud, and enhancing its security posture.\n\nThe Okta Customer Identity Cloud will help increase security and harden authentication for this customer amid increased security concerns while maintaining the ease of their end-user experience. We also had another strong quarter with our public sector vertical. Year to date, our business with pub sec organizations has increased over 65% with great wins across both Workforce and Customer Identity Clouds. A great workforce upsell in Q3 was with a huge federal agency that will cover tens of thousands of their employees.\n\nThe agency is modernizing its legacy on-prem identity technology. We see significantly more opportunity to expand our relationship with this agency and the even larger agency that it rolls up to. We also continue to have success with state and local agencies, as they replace legacy identity solutions for both their employees and their citizens. In Q3 alone, cities like Birmingham, Charlotte, and Tampa all turned to Okta.\n\nWe got to meet with some of these customers just a couple of weeks ago at Oktane22 in San Francisco. This was our 10th Oktane and we had nearly 10,000 registrants for the in-person and online event, a sold-out partner event, and 9 million views of the live opening keynote stream. During the event, we announced numerous new products, features, and functionality that we believe will elevate Okta's market leadership position. In our strategy to build the primary cloud for identity, we now cover the most use cases of any company and help solve the most challenging identity issues that are being driven by the increasing deployment of cloud technology, the adoption of Zero Trust security, and digital transformation projects.\n\nAs Okta invests in both of our clouds and develops purpose-built functionality for app building, IT, and security teams, we're also investing in connecting our clouds. This interoperability and connection has the ability to create greater value for customers and flexibility and security, and it can also become the catalyst for rapid innovation that drives business outcomes. The foundation of this interoperability is the Okta Identity platform where shared platform services and the Okta Integration Network reside. As the Okta Identity platform evolves, additional services will be available for customers, emphasizing capabilities that unlock even more use cases.\n\nCore to Okta's success is our independence and neutrality. The Okta Integration Network is the foundational technology that supports customer choice. It was innovative when we launched it 13 years ago, and it still offers the broadest selection and deepest integrations available. The success we're having with customers around the world is directly related to the Okta Integration Network.\n\nMonolithic platforms try to imitate the Okta Integration Network, but they can never replicate it. In fact, we're now taking the power of the Okta Integration Network to the next level with the power of our two clouds. By having both clouds together, we further enable this open ecosystem of choice. Workforce customers get the functionality of their craving, like seamless Zero Trust security, continuous authentication, and fine-grained authorization, all working out of the box.\n\nAnd for the SaaS builders, they know what enterprise readiness looks like because we define it in the Customer Identity Cloud and can plug into the Workforce customers around the world. All of this pushes the identity industry forward, resulting in more standardization that benefits everyone. And finally, I want to thank Susan St. Ledger for her dedication to Okta the past two years.\n\nWe wish her well in her retirement at the end of this fiscal year. We're initiating a search, but if a successor isn't in place at that time, I will step in to lead the go-to-market organization in the interim. Susan will stay on as an advisor to provide for a successful transition. We're looking forward to bringing on the next leader who will help Okta further penetrate the massive market opportunity.\n\nTo wrap things up, we're pleased with our Q3 financial results. We've made some early progress to improve our execution challenges, but we recognize we still have a lot more work to do to regain our business momentum. I want to thank the entire Okta team for their tireless work. I also want to thank everyone who came out to support us at Oktane22.\n\nNow, here's Brett to walk you through more of Q3 financial details and our outlook for meaningfully increased profitability in Q4 and next year.\n\nBrett Tighe -- Chief Financial Officer\n\nThanks, Todd, and thank you, everyone, for joining us today. I'll start with some commentary on the macro environment and then get into our third-quarter results, followed by our outlook. With regards to the macro environment, while we didn't experience a meaningful change in sales cycles, we are seeing signs that the environment has further weakened since we spoke last quarter. For example, in Q3, new pipeline is more weighted toward upsells, and we're experiencing some softening demand in the SMB market in North America.\n\nTurning to our Q3 results. Total revenue growth for the third quarter was 37%, driven by a 38% increase in subscription revenue. Subscription revenue represented 97% of our total revenue. International revenue grew 39% and represents 22% of our total revenue.\n\nWe experienced minor FX headwinds, which are incorporated into our reported numbers. RPO or backlog grew 21% to $2.85 billion. Impacting total RPO growth is the general shortening of term lengths of recently signed contracts and an increase in public sector contracts, which generally have a one-year term length. Our average term length is just over two and a half years.\n\nCurrent RPO, which represents subscription revenue we expect to recognize over the next 12 months grew 34% to $1.58 billion. We view current RPO as the better metric to assess our quarterly performance relative to calculated billings, which as we've noted, can be noisy due to fluctuations in invoice timing and contract duration. Calculated billings and current calculated billings grew 37%. Turning to retention.\n\nOur dollar-based net retention rate for the trailing 12-month period remains strong at 122%. This was driven by the strong upsell motion we are seeing with our existing customers as they expand on both products and users. As always, the net retention rate may fluctuate from quarter to quarter as the mix of new business, renewals, and upsells fluctuates. Consistent with prior quarters, gross retention rates remained very healthy in the mid-90% range, despite experiencing some sequential weakness in the SMB market.\n\nBefore turning to expense items and profitability, I'll point out that I will be discussing non-GAAP results going forward. Looking at operating expenses. Total operating expenses for the quarter were lower than expected and allowed us to return to non-GAAP profitability with slightly positive operating income. The better-than-expected profitability is primarily due to the combination -- of the past four quarters.\n\nMoving to cash flow. Free cash flow was $6 million. We ended the third quarter with a strong balance sheet anchored by nearly $2.5 billion in cash, cash equivalents, and short-term investments. Overall, we're pleased with our Q3 results.\n\nNow, let's turn to our business outlook for Q4 and FY '24. This outlook incorporates the execution challenges we experienced this year, which resulted in lower-than-expected capacity build as we move through the year. We're also taking a more cautious stance on the macro environment, which we believe will get worse before getting better. We expect to continue to benefit from the spend reduction measures we started implementing in Q3, including significantly reducing our hiring plans, rationalizing our facilities footprint, and applying greater overall financial discipline.\n\nThe reductions will help us further improve our operating margins and profitability in Q4 and beyond. For the fourth quarter of FY '23, we expect total revenue of $488 million to $490 million, representing growth of 27% to 28%. Current RPO of $1.63 billion to $1.64 billion, representing growth of 21%. Non-GAAP operating income of $15 million to $17 million, and non-GAAP diluted net income per share of $0.09 to $0.10, assuming diluted weighted average shares outstanding of approximately 175 million.\n\nFor FY '23, we are raising our revenue outlook by approximately $18 million at the high end. We now expect revenue of $1.836 billion to $1.838 billion, representing growth of 41%. We are raising our profitability outlook by approximately $66 million at the high end. We now expect non-GAAP operating loss of $41 million to $39 million; and non-GAAP net loss per share of $0.27 to $0.26, assuming weighted average shares outstanding of approximately 158 million.\n\nLastly, I want to provide a few comments to help with modeling Okta. We're providing a non-GAAP fully diluted share count for Q4 because we expect to flip to positive non-GAAP net income for the quarter. We will continue to provide a basic share count for FY '23 because of the net loss position for the full year. We expect Q4 to be our seasonally strongest quarter for free cash flow and expect free cash flow margin to be in the low double digits.\n\nWe also expect free cash flow margin for FY '23 to be in the low single digits. We are increasing our calculated billings outlook for FY '23 by approximately $25 million to $2.065 billion to $2.075 billion, representing growth of 28% to 29% when viewed on a like-for-like basis or 20% to 21% on an as-reported basis. As we've noted throughout this year, this will be the final time we provide a billings outlook. While we are in the early phases of financial planning, we would also like provide a preliminary view of FY '24.\n\nWith our continued focus on expense control, we are focused on achieving non-GAAP profitability for FY '24 and an operating margin in the low single digits. We are also targeting a meaningful increase to free cash flow and free cash flow margin over FY '23 and will provide more specific cash flow comments on our Q4 call. From a revenue perspective, we are factoring in the execution challenges we faced this year, the go-to-market leadership transition, and the growing uncertainties of the macroeconomic environment. We estimate total revenue to be in the range of $2.130 billion to $2.145 billion or growth of 16% to 17%.\n\nWhile we had initially planned on providing an update on our long-term targets, we believe it's prudent to wait and revisit this once we have increased visibility and confidence in the macro environment, new global field operations leadership in place, and have made more progress on the integration. To wrap things up, we're confident we have the right action plan in place to build on our progress and expand on our market leadership position. I'll turn it back to Dave for Q&A. Dave?\n\nDave Gennarelli\n\nThanks, Brett. In the interest of time, please limit yourself to one question so that we can get to everyone. You're welcome to queue back up with additional questions afterward. So, with that, we'll take the first question from Matt Hedberg at RBC.\n\nMatt?\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nAll right. Thanks a lot, guys. Congrats on the bounce-back quarter here. Maybe, Brett, for you, on the revenue guide, thank you for that preliminary look, I think that's super helpful.\n\nCan you provide maybe some of the underlying inputs in that? How you're thinking about like customer adds, NRR, anything to kind of give us a little better sense of sort of how you came up with that? I think it was 16% to 17% growth.\n\nBrett Tighe -- Chief Financial Officer\n\nYeah, absolutely. I mean, first --\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nHey, Matt, I know you asked Brett, but let me jump in real quick and then turn it over to Brett if that's OK. I think that -- first of all, we are very, very bullish and excited on the long-term opportunity. Identity is critical for so many things, whether it's companies transitioning to the cloud, adopting technology, or building customer-facing initiatives, or enhancing their security posture. So, when we talk about the business outlook for the fourth quarter or next year, there are some headwinds, and we can talk about how we've come to this outlook, but the long-term opportunity is super bullish, and we're really excited about the opportunity in front of us.\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I can take it from there. Thanks, Todd. I think before I talk about FY '24, it's kind of all wrapped together with how we talked about things last quarter, right? So, if you think about last quarter, there are a few things that we talked about.\n\nThere was some challenges in terms of -- the integration challenges we talked about, specifically around customer identity. Second one being around attrition. And the third one, which was a distant third was from a macro perspective, right? So, let's fast forward today, 90 days later, how have those things progressed? Because that's influencing us how we're thinking about the macro -- or the overall guidance for next year. So, if you think about attrition, you heard about it earlier in the call, significant improvement, but it's one quarter.\n\nWe're not getting overly excited. So, we're remaining cautiously optimistic. We're not going to say, hey, one quarter is a trend. We got to see a longer trend.\n\nSo, we're going to see that over time and make sure that continues to improve. The second one is around the integration, the Customer Identity Cloud. You heard earlier today, there's some progress there, early progress. Larger number of sales reps and field being involved with customer identity deals.\n\nOnce again, one-quarter trend. We're pleased with where we are. It's -- but once again, cautiously optimistic. And then the third one we talked about last time was around the macro.\n\nAnd last time we talked about, like I just said, it wasn't very apparent to us, right? It was small. You could start to see signs of it. This quarter has gotten significantly -- it's worsened since then. And we're thinking it's going to get worse from here.\n\nNow, when you think about the fourth factor we're thinking about from this guidance perspective, that fourth factor being the transition and go-to-market leadership. And so, when you add that all up today, you get to that 16% to 17% revenue growth. And really thinking about -- you got to remember we're pretty early right now. We're still going through our financial planning process.\n\nWe'll finalize those numbers over the next couple of months. And so, we're being prudent in the approach from a top-line perspective. But one thing I want to be very clear about is, the first time we've ever given you this is around margin expectations at this point of the year for the following fiscal year. So, typically, we just give you a revenue kind of first look, right? Now, we're talking about also pairing that with margin.\n\nAnd so, if you look at what I just talked about in terms of non-GAAP profitability, low positive single digits, that will be a significant improvement over FY '23. And you can even see in FY '23, the improvement we've had as growth has moderated. If you look at our initial guide on non-GAAP operating profit for the full fiscal year '23, and you look at where it is today, it's over $140 million improvement just in span of a few quarters. So, we're expecting to really improve margin, really focus on profitable growth in the years to come, and then also free cash flow margin, obviously improving meaningfully.\n\nAnd we'll give you some more information on that when we talk at the Q4 earnings process.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThanks a lot, guys. Super helpful.\n\nDave Gennarelli\n\nAll right. Let's go to Gray Powell at BTIG.\n\nGray Powell -- BTIG -- Analyst\n\nOK, great. Thanks for taking the question. Yeah. So, I just wanted to follow up on Matt's question and just drill into the revenue guidance more.\n\nSo, I mean, I guess, this 16% to 17% growth seems really conservative. I definitely appreciate there's a lot of uncertainty out there and that you guys are giving us visibility pretty -- a lot earlier than most companies will. So, I mean, can you maybe just talk more about how derisked do you think that number is? And then, within the context of that guidance, how should we think about growth between Workforce and Customer Identity? Thanks.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nHey, Gray. I think this is a good time to be very, very cautious, in my opinion. And you heard Brett's comments about the conservatism and the pragmatic approach we've taken to the forward outlook. There's something else that he didn't mention directly, which I think is important, which is, like every other company in the world, we are looking at our investments, particularly the investments around growth, and really stack ranking them and saying, what are the most likely to have high ROI? And what should we double down on that we think is going to be the most productive? And some of the things that maybe in years past, we would have embarked upon that the likelihood of a higher ROI isn't as high, we're not going to do those things.\n\nSo, you're also seeing a focusing and prioritizing of the initiatives of the company and that means on margins less investment and also less opportunity for growth.\n\nGray Powell -- BTIG -- Analyst\n\nGot it. OK. Thank you very much.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nAnd about Customer Identity and Workforce Identity, I remember that was part of your question, too. When we think about macro and we think about the situation worsening and our outlook of it getting worse before it gets better, it's pretty balanced across both of those business lines, both customer and workforce in terms of the impact. We did see more impact in the SMB segment across both of those business lines. And there's kind of puts and takes we're seeing across both in terms of -- we've seen cases where the economic environment is leading to people really scrutinizing budgets and not moving forward with projects.\n\nBut we've also seen cases where companies really want to consolidate and invest more aggressively because of the more focus on expense control and consolidating on one vendor. So, it's a little bit hard. It's definitely not specific to any particular one of our products. And in terms -- it's a little bit hard to predict because we see conservative economic conditions or recessionary conditions, helping in some cases and hurting in other cases.\n\nSo, it's a little bit hard to predict, which is why we think it's really prudent to be super cautious in the outlook.\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I would add to that. I think from a macro perspective, like you heard me say a couple of minutes ago, I would probably be less focused on Customer Identity versus Workforce Identity. It'd probably be more along the lines of which segments they're in, right? We saw that softening of demand kind of in the small and medium-sized businesses in North America.\n\nOn the flip side, you saw some really large customer wins in the quarter, actually a fair amount of them. We saw the greater than 100,000 number grow at a very healthy clip. So, it's kind of a tale of two worlds right now in terms of segments. That's probably where we're seeing the biggest differentiation rather than by product.\n\nGray Powell -- BTIG -- Analyst\n\nAll right. That's really helpful -- really helpful color. Congrats on the improved execution this quarter. Thanks.\n\nBrett Tighe -- Chief Financial Officer\n\nThank you.\n\nDave Gennarelli\n\nAll right. Next, let's go to Jonathan Ho with William Blair.\n\nJonathan Ho -- William Blair & Company -- Analyst\n\nHey there. Sorry about that. Can you -- sorry, give me a second. Can you maybe give us a little bit more color? As you start to think about this progress that you've made on the go-to-market and sales realignment improvements, maybe what were you most proud of in terms of accomplishments, and maybe what is still a work-in-progress when it comes to that go-to-market side?\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nI think the most impactful has been clarity of the message. At Oktane, we really had a -- we started the process of clarifying the message, as you know, a few months ago, four or five months ago now. But we really had an opportunity to show it off at Oktane. And the clear message of this is Workforce Identity, this is Customer Identity, there are two clouds that are each best-in-class, and they're better together.\n\nThat resonated really well not only with the field organization but also with customers and partners. Everyone gets it. They understand the strategy. They understand that we're -- we are already by far the leading independent neutral identity platform.\n\nAnd this sets us up to really cement that lead and extend that lead over the long term. And it translated into -- it's not just the impression from a conference, it translated into the really quantifiable metrics like the number of sales rapes that have actually done a Customer Identity Cloud deal is increasing the last three quarter sequentially, which is a really good sign. The lower attrition rate is a good sign. So, I think that's the most impactful change.\n\nThe thing that -- when we look about our -- talk about our outlook and being cautious, the big thing there Jonathan is that the more time and see a go-to-market person has, the more familiar they are with the products, the more they understand the customers' problems and the value props, time and different at-bats in this process-built strength and capability. So, I think, what to improve is just give the great folks in go-to-market more time and at-bats. It's an amazing team -- the more -- now that we've given in this clarified positioning, something that was really I think -- we put in the test spot before. We've clarified the positioning.\n\nNow, they're going to get the at-bats and build the muscle and be amazingly productive in the future.\n\nJonathan Ho -- William Blair & Company -- Analyst\n\nThank you.\n\nDave Gennarelli\n\nAll right. Let's go to Hamza Fodderwala at Morgan Stanley.\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nHey, guys. Thanks for taking my question. And way to throw the kitchen sink on the guide. I wanted to talk a little bit about the profitability.\n\nSo, you're going to be growing high teens next year. It sounds like there's still some capacity build that needs to take place because of the attrition this year. And there's probably going to be a little bit of a drag on sales force productivity. So, I'm just curious if you could put a finer point on how you're driving that incremental leverage in FY '24.\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. Actually, I would say the capacity build is not the area I would focus on, Hamza. I would say it's more about the productivity. It's exactly what Todd was just talking about, getting those reps even more tenured and getting more productivity out of them, right? Because as you know, Hamza, you've been following us long enough, know that a year -- a rep that's been here for three years is far more productive than ones been here for nine months, right? Both are -- ramping more in our technical terms, but you're getting -- you're getting a much more productive rep at that point.\n\nSo, that's the one side, just from your pure sales and marketing perspective. And I think other areas that we're focusing, obviously, the classic focus on productivity across the rest of the organization. One of the key things -- we're still -- like I said, we're still early in our planning process, but one of the key goals we're talking about next year is around automation, around improving the productivity of not just the field but like my team, the R&D team, how do we make everyone a little bit more productive, and that's one of the ways we see the margins improving over time.\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nDave Gennarelli\n\nLet's go to Rob Owens of Piper.\n\nRob Owens -- Piper Sandler -- Analyst\n\nThanks, Dave. Thanks for taking my question. Todd, obviously, a lot of management turnover over the last six months. So, at a high level, just address what's transpired.\n\nWhat's first in terms of your agenda as you rebuild this team?\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nWell, I think the team -- speaking broadly, the team is incredibly strong. And I'm very happy with the team, specifically about Susan. I think the world of Susan, and I want to just thank her for her contribution and she's an amazing person and an amazing executive. And after 30 years in operating roles, she's going to retire now and spend time on boards.\n\nAnd by the way, she's going to -- she's already on a board, and she's going to be on many more. I think she's going to be an amazing board member. So, I think the world of her. And also, one of the reasons is the team she's built.\n\nIt's an amazing team that's going to carry on with a deep bench of talent, and they're going to take this strategy and this vision that we're executing on. And that team and the entire team is going to do a great job at it. So, it's always hard to see people retire, especially someone of Susan's ability. But the show must go on, and we're going to do a search for her backfill.\n\nWe're going to look at internal candidates and external candidates. And although it's going to be hard to find someone as good as her, we're going to do a thorough search, and I have no doubt that we will.\n\nRob Owens -- Piper Sandler -- Analyst\n\nThanks for the color.\n\nDave Gennarelli\n\nLet's go to Joe Gallo at Jefferies.\n\nJoe Gallo -- Jefferies -- Analyst\n\nHey, guys. Thanks for the question, and I appreciate the comments on macro and prudence and baking in a worsening environment before it gets better. Maybe based on your conversations with customers, what is their viewpoint on cyber budgets in 2023 and when it can get better? Or is this malaise more of a long-term new normal? Thanks.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nYeah. It's -- we see the -- like I mentioned earlier, just kind of repeating myself here, that it's -- the conversations are a little bit -- there's like a different story for every customer in terms of -- some customers, particularly in the SMB segment are delaying purchases or reevaluating things. Some of our -- this quarter or the past quarter, Q3 was one of our best quarters ever for large deals. So, deals that were in process, mostly on the upsell side, the big entertainment conglomerate I talked about in the prepared remarks.\n\nThis company has bought several companies over the last few years that were Okta customers. And when that happens, at some point, the success is overwhelming. So, they know that to move their whole global organization forward, it needs to standardize. And this process happens over multiple years from the acquisitions to the success to the consensus building inside the company.\n\nAnd then when it happens, it happens regardless of the macro environment that's hitting this company as hard as it's hitting at other companies. So, another example is the story of KeyBanc, which is -- this is a consolidation play. They had several legacy vendors and disparate identity tool. So, they look at the economy and say, we need to consolidate onto one identity platform, and it helps there.\n\nBut there's other customers that are saying, hey, we're going to maybe stick with what we have a little longer. So, it's -- it all adds up to validating the long-term trends we know that have been powering our success for a long time, and we'll continue over the long term as well, but there's just a lot of uncertainty in terms of how it plays out in the details and the timing of the progress over the next several quarters.\n\nJoe Gallo -- Jefferies -- Analyst\n\nMakes sense. Thank you.\n\nDave Gennarelli\n\nNext up, John DiFucci at Guggenheim.\n\nJohn DiFucci -- Guggenheim Securities -- Analyst\n\nThanks. Todd, our fieldwork, we're hearing that customers really want to buy IGA from Okta 2. But they really want to buy the whole suite. And so, they're waiting until PAM is ready.\n\nI guess, first of all, do you agree with that? And secondly, can you give us any update on the PAM product release?\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nSo, I think it's good to hear that because it plays right into our strategy, which is, we want to have the best identity product in many categories and establish this wall-to-wall identity platform. We already are the largest independent, neutral platform, and we have a chance to even extend that lead and build one of the most important companies ever around identity, something by the way that's never been done before. So, we're really excited about that long-term vision. Specifically, about the products, we talked a lot about Customer Identity Cloud and Workforce Identity Cloud, specifically in Workforce, the access management products, single sign-on, advanced multifactor authentication, clearly the leader there, identity governance, a newer product for us.\n\nIt's only been available in North America for a quarter or two quarters coming up on and it's generally available by the end of this year. This product is off to a very, very fast start. It's exceeding all of our expectations. And it's going in terms of the reasons why it's successful.\n\nIt's exactly what we thought. It's much better to be sold and deployed next to the leading access management product. There's a natural synergy in terms of technical integrations there and also buyer integrations. So, the person that buys access management often is the person or the group, or the very close to the group that buys governance.\n\nAnd that's very powerful there. We're also very excited about the progress of our PAM product we announced at Okta, and that's going to be an early access just in a couple quarters, so in Q2 of '24, which is six months from now or so, and then generally available by the end of next year. And this product really -- it really is going to be -- is like the topping on the sundae in terms of this last piece of covering a few more resource types, vaulting credentials, being tightly integrated with the reporting capabilities of access management and IGA, with the resource coverage. So, not just applications but also servers and root accounts on servers and Kubernetes clusters and rounding out that whole -- I can't believe I just made the analogy that my product is like a sundae, but that's the analogy.\n\nAnd we're really excited about the progress. We have to -- PAM is on track. It's been taking longer than we thought, as we've talked about, but we're very confident in the dates we've delivered and also confident -- really optimistic about the early feedback we've had from the customers we have spoken with about it.\n\nJohn DiFucci -- Guggenheim Securities -- Analyst\n\nIs there any way -- I'm sorry, just any way to speed that up, instead of the end of the next year? It just seems like a long time. Sorry, Dave, I won't do that again.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nNo, it's all right. I appreciate the feedback. Yes, it's got a big focus. And I think that like a lot of the forward-looking dates and estimates and modeling we're doing, I think that's a very prudent and achievable date.\n\nJohn DiFucci -- Guggenheim Securities -- Analyst\n\nThank you.\n\nBrett Tighe -- Chief Financial Officer\n\nI think I was just going to add to what Todd said, John, around IGA. If you remember, workflows is one of the components of IGA, right? And we've had that around for a long time. It's been one of our most successful products. And when we look at the stickiness, the win rates, all that sort of stuff alongside in workflows, which is obviously a component of IGA, there's a lot of success there.\n\nSo, we're -- like Todd said, we're off to a really fast start, but we're excited where we're headed.\n\nJohn DiFucci -- Guggenheim Securities -- Analyst\n\nThanks, guys.\n\nDave Gennarelli\n\nAll right. Let's go over to our new customer, Eric Heath at KeyBanc.\n\nEric Heath -- KeyBanc Capital Markets -- Analyst\n\nAppreciate that. Thanks, Dave. Todd, I mean, you previously talked about kind of expanding the sort of channel partners you work with to more of the, call it, the new school channel partners, the GSIs, and marketplace. Just curious if you can give us an update on how that avenue performed, that indirect sales motion performed in the quarter? And maybe if you can just kind of give us an update on how much of that business today is kind of coming from these newer channel partners versus maybe the traditional channel partners?\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nI think the trends in the quarter were consistent with what we've seen. The Amazon Marketplace continues to do very well. I think that's a good model for how customers want to buy in general, looking to marketplaces from big cloud platforms and procuring solutions through there. That's a trend we're investing into.\n\nWe're also working really hard. The customer identity business, the Customer Identity Cloud has a very interesting, big, long-term opportunity for partners, which is as we've talked about over and over, and you all understand that these applications and these sites are built. And so, this is a huge opportunity for large SIs. And frankly, an area where with the workforce business, if you talk to a big global SI, the cloud modern workforce identity business, a lot of times is -- it's kind of too easy.\n\nThey'd rather spend their time with a legacy stack where they have a lot of services dollars to wrap around that. And so, getting the big SIs interest at times has been challenging for Okta. We've had some success, but compared to the businesses, opportunity for helping people deploy workforce technology, it's relatively small. The customer identity side is a huge opportunity with people wanting to build solutions and companies needing help, building transformative customer-facing projects.\n\nAnd getting that motion started is really important on the partner side of the Customer Identity Cloud business.\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I might just add to that in the sense that -- on the indirect side, we do continue to see more and more of the business be part of the indirect channel. Also, like just Todd said, the marketplaces are growing quite rapidly. It's a very interesting way for people to buy from us.\n\nEric Heath -- KeyBanc Capital Markets -- Analyst\n\nThanks.\n\nDave Gennarelli\n\nNext up, Peter Weed at Bernstein.\n\nPeter Weed -- Bernstein -- Analyst\n\nThank you, and congratulations on the continued progress that you're making. One of the things that I was really impressed with is the continued leverage that you're getting in opex. I completely understand the sales and marketing side. But I think we saw it continue to strongly come through in R&D and G&A.\n\nI wanted to kind of hear how you're thinking about that, particularly on the R&D side. Was that coming from freezing of hiring? Was that kind of an increase in churn of people in R&D. And then kind of on the right level going forward, I think my quick penciling out is you're in the high-teens percent subscription revenue on a non-GAAP basis right now. Is that kind of the level that you want to keep it out? Is that too lean and you're thinking about bringing in a bit more next year? Is this something you're trying to get even more? Like, how are you just thinking about that on the R&D side, given the criticality of these people kind of to the future platform?\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I'll let Todd talk about maybe the second part of that question, but I can answer more of the financial side of it, which is -- when we talked to you last, we talked about some cost efficiency measures that we implemented. And those cost efficiency measures, you'll see them coming through not only in Q3 in the results, but also our guidance for Q4 and FY '24, which is -- we slowed down hiring. I mean, you can look at the quarter-over-quarter increase.\n\nIt was about half of what it's been the last four quarters. And that was us slowing down everything as growth moderated, right? This concept of balancing growth and margin over the years is something we've applied in the past, and you can see it happening even in FY '23 and into FY '24. And so, that just didn't affect R&D. It affected some other areas across the P&L.\n\nWe also rationalized real estate footprint, which, although it's not gets allocated across the P&L, so you've seen an effect there. So, you're seeing it across the board of these cost-saving initiatives for us to kind of drive the profitability up so much so that we're slightly positive this quarter and guiding positive in Q4. But I'll let Todd answer the second part of the question. What's the right level?\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nOne thing that is I think when you look at the income statement and expenses on R&D, one part of our strategy is really critical is that Workforce Identity Cloud, Customer Identity Cloud, we strongly believe that these are both important markets that -- to own the -- and provide value across an entire identity platform. We have to be the leader in both. So, we're investing in terms of R&D commensurate with it. We think we could take the two R&D teams and try to get more efficient and try to combine them all, but we don't think that's the right approach.\n\nWe think the right approach is build the best-in-class clouds for both of these use cases. And over time, with our Okta Identity platform, bring together things that are common. We've talked about common platform services that can get shared value across both. So, it's a short -- it's a long way of saying, we think it's worth the increased R&D investment now to lead this market.\n\nAnd over time, you are going to see more shared services and more R&D efficiency over the next several years.\n\nPeter Weed -- Bernstein -- Analyst\n\nI think what I'm hearing you say, though, is that while you've gotten more leverage out of R&D, that is -- it feels appropriate to you that level and you're thinking about kind of holding it there. It's not something where you might increase spend going into next year as you get say more efficiency out of sales and marketing and rotate some of that cost savings into kind of increased R&D spend as a percentage of revenue.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nIt's accurate. Yeah, it feels right to us at this level.\n\nPeter Weed -- Bernstein -- Analyst\n\nThank you.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nYou're welcome.\n\nDave Gennarelli\n\nNext, we'll go to Alex Henderson at Needham.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nGreat. Thanks. Can you hear me?\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nHey, Alex. Nice to see you.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nSo, I wanted to dig into the exact subject that we were just talking about. Your head count was up 32% year over year but only 4.5% quarter to quarter. If you're going to get leverage next year, that would require the head count growth rate quarter to quarter to actually flat, now -- considerably from here. So, when we think about that 16%, 17%, 18% type top-line growth rate, are we now talking about head count growth in 5% to 10% range? And if that's the case, how do you allocate that head count additions? And underneath the surface of that, can you give us a little bit more granularity on the degree of attrition and the wage rates?\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I mean, when we look at the cost structure, Alex, I mean, it's -- really, majority is head count, right? I mean, we're a typical software company. You guys probably know the standard ratios, right, of how much of that is head count. So, yes, obviously, when we look into next year, we're evaluating what the right thing to do is from a head count growth perspective.\n\nWe're still early in the planning process. We still have a few months to go on that. But ultimately, we're evaluating the cost structure, and we'll let you guys know more in next year when we get into, obviously, the Q4 earnings. But ultimately, not just evaluating head count, we're evaluating all the other spend as well to be able to make sure that we can grow these margins in the right direction.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nWell, if we're not going to go in that direction, maybe you could just give us some sense of the differential between domestic and international growth, which is kind of hard to evaluate over the last couple of quarters because of the M&A, so we can get there.\n\nBrett Tighe -- Chief Financial Officer\n\nYou're talking about the difference -- the change in U.S. versus international revenue?\n\nAlex Henderson -- Needham and Company -- Analyst\n\nRight.\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I mean, look, we had actually a strong quarter in EMEA. And I was actually thankful to -- once again, this is -- when you think about the macro, this plays -- ties into what we've been talking about is there's actually a fair amount of large deals in EMEA and that helped us grow in the quarter, and that's where you see international revenue being 22% of total, right? There was an FX headwind that hit there. It wasn't hugely material, but it is starting to hit us a little bit on the revenue side.\n\nBut really, EMEA had a good quarter. And ultimately, when we're looking ahead, international continues to be a focus of ours, right? If you think about the three things that we talked about is our main goals this year, one was customer identity. Second was federal. The third one was global acceleration, right? Those things are still in play.\n\nWe're still actively working that. You heard in Todd's script around federal growing 65% year to date. And then global acceleration, you can see it in the international numbers. And I just told you, like I said, EMEA had a very good quarter, and we had some very large deals there, which we're really pleased with.\n\nBut we're just at the tip of the iceberg with the international side of the house. There's so much opportunity out there. We need to focus and continue to make inroads there because -- there is -- identity is not a U.S. problem, right? It's a worldwide problem.\n\nSo, we got to be able to continue to focus there.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nGreat. Thank you so much.\n\nDave Gennarelli\n\nGreat. We still have a long queue here, so I got to ask again to keep it to one question. Josh, over to you at Wolfe.\n\nJosh Tilton -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for squeezing me in here. I really appreciate the derisked numbers for next year. So, thanks for that.\n\nJust a simple one for me. When we look at this new guidance, how should we think about your ability to outperform these numbers as we head into next year?\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I mean, when we are thinking about the guidance, obviously, you heard me talk about being cautiously optimistic, right? So, being prudent in the guidance that we're giving you today, both on the revenue and the margin side, right? We are still doing our planning process. We are doing the same play we have done for you guys for years. And so, we still got a big quarter ahead of us, right, Q4, biggest quarter of the year, but we are being prudent with everything that's going on, whether it be the macro, whether it be some of the integration challenges that we've had.\n\nWe see early signs of success, but we are not going to bank on them right now. We are going to be prudent and cautious, like you've heard us talk about throughout this call.\n\nDave Gennarelli\n\nNext up, we will go to Adam Tindle at Raymond James. We can't hear you, Adam. Adam, you are on mute.\n\nAdam Tindle -- Raymond James -- Analyst\n\nThere we go. Double mute. I'll try to be quick here. One for Todd.\n\nThe key point to generating leverage here that you are talking about or one of the key points is rep tenure, and attrition did improve during Q3. Susan talked about that at Oktane. And she mentioned adding more commission dollars in the pool, as one of the factors that helped to improve attrition. The message today that we are hearing is, understandably a focus on profitability.\n\nYou've got this attractive profitability swing in fiscal '24. I'm just wondering, how do you achieve that profitability swing while avoiding another attrition surprise that would derail that operating leverage story, especially with the end of the fiscal year coming up? Are there other options beyond the commission pool that would help with that? Thank you.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nYeah. It's a really astute question. And the way I think about it is that there's a lot of different levers to make the whole team successful. We talked a lot about last call and this call about sales attrition, but sales is like the tip of the spear.\n\nA lot has to go well to support them to make them successful. The problem is not sales. The problem is clarity of the message. We've done much better at that, clear, compelling positioning, enablement.\n\nThese are all the things that we're getting better at. So, I think holistically, when you think about next year, it's how much do we invest, where do we invest in terms of people, coverage? And how do we get the balance between prudent financial management on how much resources we deploy into the field versus the expected return and the expected productivity and balancing that. And yes, commission is one important -- one variable, but it's relatively small in terms of the overall investment in go-to-market capacity as it leads to productivity and leverage in the model there.\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I would just add that -- I mean, that's one of those things you've heard me talk about, Adam when we were talking about the guidance of being -- hey, one quarter, we really improved on a variety of things but we're being cautious about the future because one quarter doesn't make a trend. I wish it did, make our life a lot easier.\n\nDave Gennarelli\n\nYeah. Let's go over to Shrenik Kothari at Baird.\n\nShrenik Kothari -- Baird -- Analyst\n\nHey, thanks. Thanks for taking my question. You guys mentioned the 100,000-plus customers grew nicely 32% and the net new customer adds back out. There was also sequentially better quarter on quarter, I think overall 22% year on year.\n\nAnd yes, I mean, that adds up with the number of sales reps that you said closing the customer identity deals, sequentially getting better over three quarters. One comment you made was the pipeline is more weighted toward upsells. And I mean, of course, we're seeing some softening in the SMB market. But are you already starting to see that SMB softening in the customer adds as well on that side of things as well? Yeah.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nI think just the general -- I don't actually know the mix of -- the degree of softening of upsells versus new business. We just -- we know that the SMB segment of our business was less than we would have liked this past quarter and balance with a lot of other things, the whole -- overall mix of the entire book of business being more upsell focused than usual lead us to strongly believe that that's macro related, both just anecdotally in the conversations, but -- plus when we look at it quantitatively in the statistics across the whole business.\n\nShrenik Kothari -- Baird -- Analyst\n\nGot it. Got it. Thanks a lot.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nSure.\n\nDave Gennarelli\n\nNext, we'll go to Fatima Boolani at Citi.\n\nFatima Boolani -- Citi -- Analyst\n\nGood evening, everyone. Thanks for taking my questions. Brett, between you and Todd, you sort of talked a lot about the strength in the renewal side of the business and of course, the performance in the quarter being weighted more toward upsells, presumably coming from the installed base. So, what I wanted to ask you was just around the conversations with respect to renewals.\n\nWhat we've heard from some of your peers is there is increasingly an orientation from customers to manage their cash flow, manage their opex budgets. So, I think we saw a little bit of this in your backlog and RPO because you called it out. But I'm curious, from an invoicing standpoint, what sort of conversations are you having in your renewal dialogue? And then, as a related matter, and I think I've asked you this before, we've been seeing maybe more broad-based sort of employment contraction and layoff activity, and it seems a little bit more concentrated in certain sectors. But I'm curious how that's sort of factoring into some of your renewal conversations as well.\n\nThank you.\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I think there's a couple of things, and Todd, you can follow up because I think you probably have a thought or two here, which is in terms of renewals, we haven't really seen a material change in renewals. I think the good news is that gross retention rate remains in that mid-90% range like we've talked about at Investor Day, we talked about it today. And I think a quick reminder is, we're fortunate enough to have long contract durations, right? It's a little north of two and a half years.\n\nAnd so, we have the opportunity to deliver value in these contracts. We don't have to deliver it in the first 30 days, right? We wake up every morning and say how can we deliver value, customer success? I mean, you heard me at Investor Day talk about loving our customers as a key customer, a key to Okta value. And you see that in these retention rates, right? I mean, you need identity. Every modern tech stack needs it, right? And so, that's why you see the strength in the gross retention.\n\nThat's why you see the upsells and the net retention number of 122%, right? Because if you don't get to deliver on the original promise of the original deal, it's hard to get that upsell, but that's why -- but that's why you see the strong numbers on gross and net. In terms of your question directly around invoicing, we haven't really seen a material change on that either. Really, things have kind of more or less stayed the same here. But I think one of the things we've talked about is upsells continue to be a strength of our business, right? Once we get people in, they get successful.\n\nSo, that's why you see these strong retention numbers.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nYes. The workforce business is per named user seat sold in a contract with average duration of two and a half years across the whole base. Customer identity is a monthly active user. So, one thing I talked to people about when -- if someone has fewer employees, when that contract comes up for renewal, the per seat is going to be less -- or not the per seat, but the number of seats they buy will be less.\n\nBut that doesn't mean there's -- they can still add more products or add more -- get more value by buying IGA or by having a new use case around multifactor authentication or adding customer -- monthly active users for customers. So, it's not -- the workforce business is, to some degree, is tied the seat expansion or contraction, but there's many other levers of expansion there as well.\n\nDave Gennarelli\n\nOK. Next, we're going to go to Rudy Kessinger at D.A. Davidson.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nGreat. Thanks for taking my questions. What percent of your sales reps currently are what you would classify as fully productive? I know with the macro, maybe not anybody is really fully productive right now, but what percent are fully productive today? And when you think you can get that within six months?\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. I mean, I don't have the exact figure in front of me, but we are -- like we talked about last quarter, last quarter was an all-time low in terms of ramped reps as a percentage of the total. Given the attrition numbers we've talked about today, the massive improvement there, we've bounced off the bottom, if you will. And so, we are turning in the right direction.\n\nBut it's not anywhere near where we want to be, and that's why we continue to talk about being cautiously optimistic. We need to get that ramp level as a percentage of total back to more of a historical number, and that will take time, right? And you heard Todd talk about it. It's not just about the definition of being ramped, right? Because we have a definition internally, just like every other company does. It's about getting them to certain thresholds and productivity, which usually comes with tenure that is sometimes after that \"official\" ramp time frame being over with.\n\nSo, we need to continue to enable these folks, show them all these opportunities, show them success. And ultimately, that will result in our success because we'll have a more productive field in the coming quarters and years.\n\nDave Gennarelli\n\nAnd let's go to Keith Bachman at BMO.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nHi. Thank you. Good evening. Brett, I wanted to -- excuse me, Todd, I wanted to direct this to you if I could.\n\nJust a clarification to start with, you indicated that if you didn't find a leader of the go-to-market, you would assume that role. But I would assume that's just a temporary position. In other words, you would keep searching because you're being stretched in a lot of different directions. So, I just want to clarify that.\n\nAnd then the real question is in terms of the guide, I want to try to understand the competitive dynamics. And what I mean by that is, your CRPO guide for Q4 is 21%. And candidly, you've been beating that a little bit, and yet your rev guide for the out year is below that. And so, I'm just trying to understand, as the economy weakens here, is the pipeline remaining robust? And really, are you seeing any changes in the competitive dynamics? Because I think what the investors have some concern about is as the macro weakens, perhaps that causes some users to migrate toward Microsoft if the cost is cheaper.\n\nSo, just wanted to understand a little bit on that. Many thanks.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nYeah. So, specifically on Susan's retirement and timing, what the plan is, is that she is in her job until the end of January. And so, we will be searching for a replacement, considering internal candidates, external candidates, finding the best person in the world. And if we don't find anyone by February 1, we'll keep searching, but I will be the interim until we find someone.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nPerfect.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nAnd then about the competitive environment, the competitive environment, broadly speaking, has been consistent for several years. I talk about this a lot for the folks that have been around the story for a long time. The market is -- it's kind of decided -- the people in the market decided if they want cloud or they want on-prem. And the folks that want on-prem, there's good on-prem solutions like Ping and ForgeRock and that part of the market is -- we think it's smaller right now.\n\nWe think it's trending down over time as more people want a modern solution. And then the other big competitive dynamic is do you want to get it from a monolithic platform? Or do you -- that has other apps and services to sell you as well? Or do you want an independent and neutral -- someone to focus on identity. And that's been the way it's been for a long time. And our strategy is focused on extending that lead over time.\n\nI think the reality is that in a recessionary environment, what you're saying is likely true. Some people are going to choose, hey, the monolithic platform, the Microsofts. And by the way, we assume that every big cloud is going to have their version of Okta eventually. It's a very compelling business obviously, and they're going to want to try to provide some of this value.\n\nAnd that's why we think independent neutrality is the best strategic opportunity. But yes, in a recessionary environment, I'm sure some will choose to go with the monolithic platform. So, that is kind of like negative. But on the positive side, there are -- I gave the example of KeyBanc.\n\nThis past quarter, they're consolidating identity vendors because of the same force. And they're picking the independent neutral leader. And so, that was driving them toward Okta. So, I think in this whole recessionary environment, I don't expect competitive environment.\n\nIn certain cases, it might shift one way or the other. But in aggregate, I think it's going to be as consistent as it's been in the last four, five years.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nAll right. Thank you, Todd.\n\nBrett Tighe -- Chief Financial Officer\n\nBy the way, Keith, you just made my entire day by asking the relationship between current RPO and next year's revenue guide.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nIf I was allowed to ask two questions, I was going to go on that, but I'll cede the floor. Many thanks.\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. No, but I will answer your question. We're being cautious. That's ultimately the answer, delta between the two because pipeline is trending in the right direction, but we're being cautious at this point given everything we know at this point.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nOK. Well, I don't want to get in trouble with Dave.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nOne last thing on competitive is that -- remember that the Customer Identity Cloud business is huge important opportunity for us, both just in terms of market opportunity, but in terms of establishing this broad platform. And the competitive dynamic there is very different. It's build-versus-buy, and we have the best developer-focused platform and that's -- it's a really exciting opportunity.\n\nDave Gennarelli\n\nOK. We can go into some overtime here, but let's keep it as short as possible. We'll go to Adam Borg at Stifel.\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nAwesome. Thanks for fitting me in. Just on the macro, you talked about seeing more pressure at the low end of the market. You talked about workforce and SIEM really being equal in terms of where you're seeing any headwinds.\n\nJust curious, anything by geography more, you talked about North America, you talked EMEA, anything else by geography or vertical to go into, just to flush it? Thanks again.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nYeah. Really, I mean, it's -- like you said, SMBs getting hit first with it. North America obviously is where we saw that the most. But that's also because our -- that's our biggest portion of our business, right? So EMEA did have a strong quarter, especially like I said earlier, with those big deals.\n\nSo, that's really the extent of what we're seeing right now.\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nAwesome. Thanks again, Todd.\n\nDave Gennarelli\n\nOver to Sterling Auty at MoffettNathanson.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nThanks, guys. So, administrative one from my side. At Oktane, you talked about the fiscal '26 long-term targets given the quiet period, you'd kind of address them now. Are you going to just kind of table that discussion until you're a little bit further along some of the changes, or what should be the expectations on that front?\n\nBrett Tighe -- Chief Financial Officer\n\nYeah. We're going to table that for now. Sterling, it's primarily related to three things I talked about earlier is making sure we see through these integration challenges, the macro uncertainty out there, and then the change of go-to-market leadership. We want to make sure that those things stabilize before we come back to you in the future and talk about that.\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nThat makes sense. Thank you.\n\nDave Gennarelli\n\nPeter Levine at Evercore.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nExcuse me. I appreciate it. Maybe I want to touch just the high-level one is when you look across identity, endpoint, or networking, in your opinion, what's more mission-critical? Because I ask, given the macro commentary, obviously, deals are elongating, such as throughput -- it's your competitors as well. So, are these deals just getting pushed out, or are you actually seeing customers mainly focus on other areas of the security stack? Just curious to see if it's across or just particular areas within cyber.\n\nThanks.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nI think -- so I think you picked up three that are all pretty critical. When I work with customers, they're trying to shore up their identity strategy, especially around Zero Trust. If you want to do Zero Trust, you have to know who can go where. And then once you know -- and that's identity, you have to know who can go here and make sure you don't over-provision people and then you want to enforce that from the endpoint, you want to force that from the network.\n\nAnd so, that's the network folks and then the endpoint folks. So, they're all critical. I think I would say my observation is that it's more -- it's not the criticality that gets things delayed. It's like the time to value and how deeply they want to integrate.\n\nIn our case, you can deploy Okta very quickly. But if you want to deploy it deeply and integrate it to every application, these big companies have thousands of applications and business processes across departments and divisions. A deep integration and deployment can take quite a long time. Same is true for some of these other tools and technologies.\n\nSo, how they deploy them and how deep it is, that's more of a driver, I think, in terms of whether they go forward or not in a recessionary environment versus the actual -- just the category.\n\nPeter Levine -- Evercore ISI -- Analyst\n\nThank you.\n\nDave Gennarelli\n\nTrevor Walsh of JMP.\n\nTrevor Walsh -- JMP Securities -- Analyst\n\nGreat. Thanks, Dave. Thanks for taking my question. Todd, maybe best for you.\n\nBrett had mentioned the federal business as kind of one of the three priorities for the year. I noticed that you had announced the Okta for the U.S. Military launch earlier in the month. Just curious if that's -- can you just double-click us around, is that a broad net new opportunity or more just kind of incremental to what you might already be doing?\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nYes. First of all, public sector is doing really well. The three quarters this year, up 65% over the three quarters -- first three quarters last year. So -- which is great to see because it's something we've been focusing on for a while.\n\nI think specifically on the federal opportunity, the .mil instance of Okta, which you can now sell with the certification of IL-4, you can now sell to the DoD for their use cases. It's more than incremental. It's a big new door to be opened for us. We're right on -- we're working for the final paperwork to be returned on FedRAMP High, which is another federal certification that's super important.\n\nSo, yes, I mean, the government needs identity just like every organization, every opportunity -- or every sector needs identity, and that's a big area of focus for us, and we're glad to see some progress. But relatively speaking, we're still early days in that big opportunity.\n\nTrevor Walsh -- JMP Securities -- Analyst\n\nGreat. Thanks.\n\nDave Gennarelli\n\nAnd our final question from Brad Zelnick at Deutsche Bank.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nExcellent. Thanks so much for fitting me in. And I guess most of the questions were asked, but I'll throw a big-picture one at you, Todd. It's great to see you continue executing against your vision of building out a broader platform with SIEM identity governance and PAM in the pipeline.\n\nConsolidation has been the siren song of many security vendors over the course of time, yet security as an industry remains highly fragmented. As we look out in the many years to come, why is consolidation a viable strategy today for you in identity, and why isn't that Okta is positioned to be the winner?\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nI mean, industries naturally fluctuate between consolidation and fragmentation. So, I think the key is not to think about -- like are you -- do you want to be fragmented or consolidating, the key is to think what are the right points of consolidation? And we believe identity is that point. We believe that if a company can consolidate their identity across customers or governance, around employees, then that'll enable integration to a very broad and diverse technology landscape, which all these companies and organizations have, but most importantly, a broad and diverse and integrated security landscape. And it's especially important in security because security is adversarial.\n\nYou don't want to consolidate everything to one security vendor, and you don't want to get one log analysis and endpoint and identity and network all from one company, because the attackers are going after that company. You have no flexibility to swap out pieces and get your defenses more robust. So, we think the right point of consolidation is identity, and of course, that has some security capabilities, lifecycle management, and multifactor, but -- and then that enables a tight integration to the entire security ecosystem, which will keep customers more robust and secure in the long term. That's why we think it's the right balance between the two.\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nAwesome. Thank you.\n\nDave Gennarelli\n\nGreat. Well, that's it for this afternoon. But before you go, we just want to let you know we'll be at a few investor events this quarter. We'll be at the Needham Growth Conference on January 12th.\n\nWe'll also be participating in several in-person and virtual bus tours over the course of December and January. So, we hope to see you at one of those events. And that's it for our time. If you have any follow-up questions, you can reach us at investor@okta.com.\n\nThanks.\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nThanks, everyone.\n\nBrett Tighe -- Chief Financial Officer\n\nThanks, everyone.\n\nDuration: 0 minutes\n\nDave Gennarelli\n\nTodd McKinnon -- Chief Executive Officer and Co-Founder\n\nBrett Tighe -- Chief Financial Officer\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGray Powell -- BTIG -- Analyst\n\nJonathan Ho -- William Blair & Company -- Analyst\n\nHamza Fodderwala -- Morgan Stanley -- Analyst\n\nRob Owens -- Piper Sandler -- Analyst\n\nJoe Gallo -- Jefferies -- Analyst\n\nJohn DiFucci -- Guggenheim Securities -- Analyst\n\nEric Heath -- KeyBanc Capital Markets -- Analyst\n\nPeter Weed -- Bernstein -- Analyst\n\nAlex Henderson -- Needham and Company -- Analyst\n\nJosh Tilton -- Wolfe Research -- Analyst\n\nAdam Tindle -- Raymond James -- Analyst\n\nShrenik Kothari -- Baird -- Analyst\n\nFatima Boolani -- Citi -- Analyst\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nAdam Borg -- Stifel Financial Corp. -- Analyst\n\nSterling Auty -- MoffettNathanson -- Analyst\n\nPeter Levine -- Evercore ISI -- Analyst\n\nTrevor Walsh -- JMP Securities -- Analyst\n\nBrad Zelnick -- Deutsche Bank -- Analyst\n\nMore OKTA analysis\n\nAll earnings call transcripts"
}