{
  "companyName": "Hasbro",
  "companyTicker": "HAS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/18/hasbro-has-q3-2022-earnings-call-transcript/",
  "content": "Hasbro (HAS 0.03%)\nQ3 2022 Earnings Call\nOct 18, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Hasbro third quarter 2022 earnings conference call. [Operator instructions] Today's conference is being recorded. If you have any objections, you may disconnect at this time. At this time, I'd like to turn the call over to Ms.\n\nDebbie Hancock, vice president of investor relations. Please go ahead.\n\nDebbie Hancock -- Vice President, Investor Relations\n\nThank you, and good morning, everyone. Joining me today are Chris Cocks, Hasbro's chief executive officer, and Deb Thomas, Hasbro's chief financial officer. Today, we will begin with Chris and Deb providing commentary on the company's performance. Then we will take your questions.\n\nEric Nyman, Hasbro's president and chief operating officer; Cynthia Williams, president of Wizards of the Coast and Digital Gaming; Darren Throop, president and CEO of eOne; and Steve Bertram, president eOne Film and TV, will join for the Q&A portion of the call. Our earnings release and presentation slides for today's call are posted on our investor website. The press release and presentation include information regarding non-GAAP adjustments and non-GAAP financial measures. Our call today will discuss certain adjusted measures, which exclude these non-GAAP adjustments.\n\nA reconciliation of GAAP to non-GAAP measures is included in the press release and presentation. Please note that whenever we discuss earnings per share or EPS, we are referring to earnings per diluted share. Before we begin, I would like to remind you that during this call and the question-and-answer session that follows, members of Hasbro management may make forward-looking statements concerning management's expectations, goals, objectives and similar matters. There are many factors that could cause actual results or events to differ materially from the anticipated results or other expectations expressed in these forward-looking statements.\n\nThese factors include those set forth in our annual report on Form 10-K, our most recent 10-Q, in today's press release and in our other public disclosures. We undertake no obligation to update any forward-looking statements made today to reflect events or circumstances occurring after the date of this call. I would now like to introduce Chris Cocks. Chris?\n\nChris Cocks -- Chief Executive Officer\n\nThank you, Debbie, and good morning. We expected Q3 to be our most challenging quarter of 2022 based on product release and ship timings in our Consumer Products segment as well as release cadences in our Games and Entertainment businesses. Revenue for the quarter was $1.68 billion, down 12% in constant currency and down 15% at actual rates versus 2021. Adjusted operating profit was $271 million or a 16.1% OP margin, down 31%.\n\nRevenues were impacted due to innovation timing, including later product releases in NERF and games this year versus last, accelerated direct import shipments in our Consumer Products segment, which shifted revenues from Q3 to Q2 and release calendar more heavily Q2 and Q4 weighted for our Wizards and Digital Gaming and Entertainment businesses. We've also seen the average consumer become increasingly price-sensitive as the year has progressed, impacting point-of-sale trends. Promotions and entertainment field demand have become increasingly important and will be key in the quarters ahead. For instance, our most recent Prime Day last week saw Hasbro volume increased mid-double digits year over year, among the top toy and game performances.\n\nThe ongoing growth of key brands like PEPPA PIG and MY LITTLE PONY speak to the power of driving great entertainment to reach audiences and inspire demand. In Q4, we will be kicking off an unprecedented lineup of entertainment, starting with Marvel Studios' Black Panther: Wakanda Forever and extending well into 2023. Operating profit margins were impacted by a combination of more aggressive closeout actions in Consumer Products and the shift in mix of deliveries in our Wizards and Digital Gaming and Entertainment segments. For Q4, we are projecting Hasbro's revenue to be approximately flat on a constant currency basis, buoyed by growth in MY LITTLE PONY, PEPPA PIG, Marvel, starting lineup and key gaming brands, in particular, our Wizards and Digital Gaming segment behind one of our best Q4 MAGIC slates ever, as we kick off the brand's 30th anniversary and celebrate Hasbro's first ever $1 billion brand.\n\nFourth quarter adjusted operating profit for the company is expected to improve by mid-double digits year over year driven by a more favorable product mix, improvements in distribution, disposal of low-profit noncore businesses and the impact of our new operational excellence program we announced at our investor day on October 4. For the year, we are expecting revenues for Hasbro to be flat to slightly down on a constant currency basis. We continue to expect adjusted operating profit margin to increase 50 basis points to 16%. We also expect inventory levels to be up low single digits year over year.\n\nWe have a strong balance sheet and a plan that accelerates cash generation going forward. Deb will speak to this in more detail shortly. At our investor day, we introduced our new strategic approach to our blueprint, Blueprint 2.0, which positions us to accelerate growth with a focus on games, digital and direct and demonstrates our commitment to deliver superior shareholder return with a plan to grow adjusted operating profit by 50% by year-end 2025. This profit improvement will be driven by a focus on fewer, bigger brands with billion-dollar potential, growing our high-profit Games and Licensing businesses and driving significant savings via our operational excellence program.\n\nThis initiative will help us drive $250 million to $300 million of annual run rate savings by year-end 2025, including a $50 million run rate level already achieved in 2022 that is helping to fuel our bottom line growth in Q4. This management team isn't satisfied with our performance in Q3. Our new plan has already begun and will gather momentum over the coming quarters. Our high-margin Games business is on track for growth in Q4, anchored by a must-have MAGIC lineup, including the first time our fans can buy the iconic card, the Black Lotus, in over 25 years.\n\nWe added the viral sensation Wordle: The Party Game for fans of all ages to our industry-leading games portfolio for this holiday. We are innovating in key brands like NERF with our new GelFire blasters for fans 14 and older. We will extend our growing leadership in high-margin, high-potential categories like preschool with leading brands, including PEPPA PIG and our products for Marvel's Spidey and His Amazing Friends as well as creativity with PLAY-DOH, brands where we have revenue and POS momentum like the already hot-selling PLAY-DOH Ice Cream Truck. And we will drive a multi-quarter flywheel of momentum with one of our best entertainment lineup ever starting this November with Marvel Studios' Black Panther: Wakanda Forever and extending into 2023 with six more blockbuster films and 20 scripted and unscripted shows we are merchandising behind, including the upcoming Hasbro event films, Dungeons & Dragons: Honor Among Thieves in March and Transformers Rise of the Beast in June.\n\nThe plan we laid out earlier this month has us on path to drive growth and accelerated profits through focus and scale and enhanced operational excellence. We are concentrating on the brands that give us the biggest growth potential and where we can truly lead and innovate in the category. We will license out brands where we can make a greater return through a partner model, in some cases, extracting value from dormant assets. And we will exit businesses that don't drive branded entertainment through our Blueprint 2.0.\n\nWe will pair this operational discipline and entertainment-fueled innovation with a continued emphasis on returning cash to shareholders and driving superior long-term shareholder returns. Hasbro's commitment to our category-leading dividend is rock solid. And when paired with the potential of our brands, the growing impact of our operational excellence program and an outstanding entertainment lineup, we believe it positions Hasbro as an exceptional value for shareholders with strong near- and long-term potential returns. With that, I will turn it over to our Chief Financial Officer, Deb Thomas.\n\nDeb?\n\nDeb Thomas -- Chief Financial Officer\n\nGood morning, everyone. The third quarter results reflect the timing shifts we forecasted since early in the year. These include release timing for MAGIC: THE GATHERING card sets, entertainment deliveries and several product launches and key brands happening in early fourth quarter as well as a shift in retail promotional period. Foreign exchange has negatively impacted revenue by $104 million year to date, with $54 million of that impact in the third quarter.\n\nAnd as we've projected, the macro environment for the consumer has been challenging, increasingly so as the year has progressed. As we shared earlier this month, we've set an aggressive and achievable plan to drive profitable growth over both the near and long term. We're focusing on fewer brands where we see the biggest potential. Essential in the delivery of this plan is an operational excellence program to deliver $250 million to $300 million in annualized run rate cost savings by year-end 2025.\n\nWe recorded a $55.3 million charge this quarter associated with the implementation of this program primarily from the impairment of assets from noncore businesses we're exiting within the Entertainment segment as well as severance and employee-related costs. We continue to believe we can deliver a 16% adjusted operating profit margin for this year. This reflects the favorable mix of revenue and leaning into above-average margin businesses like Wizards and Digital Gaming, including the continued activation of D&D Beyond, which is expected to be earnings accretive in Q4. We coupled this with a heightened focus on bottom line discipline, including the operational excellence savings we're driving across our business.\n\nOur balance sheet remains strong and is well positioned to meet demand in the fourth quarter. Our early commitment to inventories impacted our cash generation in the near term. The quarter-end cash balance was $551.6 million compared to $1.2 billion in last year's third quarter with operating cash flows year to date of $262.2 million. Cash is at a lower than historical level, and this is typically the low point in our cash balances during the year.\n\nWe expect a lower cash balance this year end in 2021 as we have returned $125 million to shareholders through share repurchase, paid $289 million in dividends thus far, bolstered our digital strategy with $146 million acquisition of D&D Beyond and repaid $73 million of long-term debt. Incremental year-over-year promotional activity is occurring behind our key holiday toy and game items to drive our newest innovation while also reducing inventory on hand at Hasbro and at retail. Overall, our inventory continues to be of high quality, but our goal is to work down the balance by year-end, and you'll see that in our outlook and results. While cash at year-end is projected to be below historical levels, our go-forward plan accelerates our cash generation with a high-end target of $1 billion in operating cash flow next year increasing annually off that level as we move forward toward our 2027 target.\n\nWe remain committed to delevering our balance sheet, maintaining our investment-grade rating and are on track to meet our debt-to-EBITDA target of two to two and a half times next year. We continue to return cash to you, our shareholders, through our dividend program and anticipate increasing share repurchase in future years. Looking more closely at the quarter. Operating profit declined in dollars and as a percentage of revenue from the same period last year.\n\nThis primarily reflects lower gross margin and lower revenue. This is largely in our Consumer Products business, which incurred a greater amount of sales allowances in the third quarter of this year versus last, lowering net revenues and higher product costs. Additionally, we increased provisions on some slower-moving inventory in certain markets. The impact of foreign exchange had a pass-through effect of negative 3% on gross margin due to translation.\n\nThese factors are reflected in a 380 basis point increase in cost of sales to revenue that was partially offset by lower program amortization on lower entertainment deliveries. Lower entertainment deliveries in the quarter also resulted in lower royalties. Product development increases reflect investment in key talent, particularly within Wizards of the Coast and Digital Gaming. Advertising was down versus Q3 of last year, which included spend behind the MY LITTLE PONY movie, and we shifted our consumer product advertising spend closer to the holiday and closer to retailers' planned promotional periods.\n\nAdjusted intangible amortization increased, reflecting the D&D Beyond acquisition. This added $1.7 million in the quarter and is forecasted to be $7.5 million next year. SG&A dollars declined in the quarter on an adjusted basis but increased as a percentage of revenue. Below operating profit, nonoperating income was $13.2 million, up from an expense of $1.2 million last year.\n\nThis was primarily the result of a favorable net gain on foreign exchange, which we do not expect to repeat in Q4. Last year's third quarter, we had a $9.1 million cost from the early repayment of debt. The underlying adjusted tax rate, excluding discrete items, was 19.9% versus 23.4% last year. And we expect the full year underlying rate in a range of 20.5% to 21.5%.\n\nLooking at our segments. Wizards of the Coast and Digital Gaming revenues declined 13% in constant currency. Tabletop revenues declined 9% as a result of release timing but are up 5% through the first nine months of the year. As Cynthia said earlier this month, we're forecasting double-digit growth for MAGIC: THE GATHERING this year led by strong growth in tabletop.\n\nDigital and licensed gaming declined 37% based on release timing and reflecting the difficult comparison with the launch of the premium game Dark Alliance and the tail end of the launch impact from MAGIC: THE GATHERING Arena Mobile last year. We continue to invest in Digital Gaming initiatives and talent to support long-term growth in this segment. Operating profit of $102.2 million was down 36%. This reflects the revenue decline, higher costs in paper and freight and incremental royalty expense with new universes beyond sets like Warhammer 40,000.\n\nWe've also added the amortization of D&D Beyond I spoke to earlier. These costs were partially offset by lower launch-related product development, advertising and depreciation associated with Dark Alliance that released in 2021. For the full year, on a constant currency basis, we expect high single-digit revenue growth with operating profit margin over 40%, down from 42.5% for full year 2021 as we continue investing for long-term growth in these valuable brands. Consumer Products segment revenues decreased 6%, excluding a negative $40 million impact of foreign exchange, $31.1 million of which was in Europe.\n\nLatin America grew 15%, and Asia Pacific was up 10%. But this growth was more than offset by a 14% decline in North America and an 11% decline in the European region, which was flat absent foreign exchange. As a reminder, for the full year 2021, our revenue in Russia was $115 million with approximately 70% earned in the second half of the year. We do not have this revenue and associated operating profit in 2022.\n\nThe segment's 31% decline in adjusted operating profit is the result of the lower revenue, higher allowances, price adjustments related to closeouts and obsolescence expense associated with moving higher inventory levels. For the full year, revenue is expected to decline low single digits from full year 2021 in constant currency, with operating profit margin down slightly from 2021's 10.1%. From a brand perspective, each brand portfolio category in the segment, Franchise Brands, Partner Brands, Hasbro Gaming and Emerging Brands, declined in the quarter. Key growth franchises, PEPPA PIG and PLAY-DOH, were up, growing revenue and point of sale.\n\nMY LITTLE PONY consumer product revenue and POS grew a year after the movie debuted. Hasbro products for Marvel and Star Wars positively contributed to revenue and POS in the quarter. Where we've had our most challenging comps are NERF and Hasbro Gaming, two important areas where we have long-term growth plans. Chris spoke to several important new initiatives in these brands for the holiday, and the team shared longer-term plans earlier this month at our investor day.\n\nEntertainment segment revenues reflected the anticipated timing of deliveries and were down 34% in constant currency. Film and TV revenue declined 26%. Last year, we released films Come From Away and Finch direct to streaming and did not have any comparable films this year. Also, Yellowjackets is later this year versus last.\n\nFamily Brands revenue declined 78% primarily due to the delivery of My Little Pony: A New Generation in the third quarter 2021, which did not have a comparable film release this year. We have significant fourth quarter entertainment revenue for scripted TV, including The Rookie, The Rookie: Feds, Yellowjackets and Cool Summer and the launch of Transformers: EarthSpark on Nickelodeon and Paramount+ as well as continued animation for MY LITTLE PONY, PEPPA PIG and PJ MASKS. Adjusted operating profit decreased 86% on the lower revenues and the mix of content. This was partially offset by reductions in program amortization expense, lower advertising versus the MY LITTLE PONY movie release and lower royalty expense.\n\nFor the full year, on a constant currency basis and excluding music, we expect revenue to decline in the mid-single digits as we divest of certain noncore businesses and certain deliveries of scripted TV and film releases moved to the first quarter of 2023. Adjusted operating profit is expected to be in line with or slightly up from last year's adjusted operating profit margin absent music of 7.8%. In closing, we're focused on driving our business in the fourth quarter to meet consumer demand, end the year with clean inventories and to achieve our run rate cost savings. We expect full year revenue to be flat to down slightly in constant currency and to expand adjusted operating profit margin by 50 basis points to 16%.\n\nThis also sets us up for growth we're planning in 2023 and beyond. We have a plan that builds on our strength in branded entertainment, in gaming and in our direct-to-consumer relationships. We have the brands, the team and the strategy to successfully execute this plan. I'll now turn it back to Chris.\n\nChris Cocks -- Chief Executive Officer\n\nThanks, Deb. Before we turn to Q&A, let me take a minute to recognize Darren Throop. Today is Darren's last earnings call as he is leaving Hasbro at the end of the year. Darren grew eOne into an accomplished studio with strong talent, a rich library of content and production capabilities across mediums.\n\nOver the past few years, he has served an invaluable role in the integration of eOne with Hasbro during an unprecedented environment. The D&D film next year and the robust pipeline in development is the direct result of his hard work. Thank you, Darren, for your leadership, and we wish you tremendous success in the future. Now we will take your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question today comes from the line of Eric Handler with MKM Partners. Please proceed with your questions.\n\nEric Handler -- MKM Partners -- Analyst\n\nGood morning. Thanks for the question. I guess start with Eric. Wonder if you could talk a little bit about the state of retail right now.\n\nLast quarter, we had a bunch of pull forwards with direct shipment. This quarter, we're talking about higher allowances and promotional activity. Are a lot of the issues just isolated with NERF and gaming? Or is there some sort of broader macro situation going on here?\n\nChris Cocks -- Chief Executive Officer\n\nWell, Eric, hey, first off, thanks for the question and good morning. I will turn it over to Eric, as you asked. Generally speaking, we're seeing a great partnership with our retail partners. We have a very high percentage of our promotions and advertising budget focused on Q4 with our new innovation coming out.\n\nAnd so we remain optimistic about what our prospects look like for that new innovation and what it sets us up for 2023 and beyond. Eric, I'll turn it over to you for the balance.\n\nEric Nyman -- President and Chief Operating Officer\n\nSure. Thanks, Eric, for the question. Maybe just to build on what Chris is saying, Eric, as we roll into Q4, we talked about how specifically for Hasbro our big innovations were back half loaded. We feel very positive about the innovations that we've recently launched.\n\nAnd if you look at retail right now, we started off quarter four with the big promotion with Amazon where they did their Prime Day early access sale, and Hasbro performed very strongly. So I think you will see a promotional environment in Q4. We built excellent programs around the world with all of our retail partners. And I expect that we'll continue to see POS momentum as we go forward.\n\nEric Handler -- MKM Partners -- Analyst\n\nGreat. And then just as a follow-up going on a completely different topic. As we look to next year and the opportunities for growth for Dungeons & Dragons, today, D&D, correct me if I'm wrong, it's been mainly a North American-driven product. We'll have a global movie launch for the brand.\n\nWondering if you could talk about some of your international growth strategies and where you think you can attack best and sort of expanding the addressable market for the game.\n\nChris Cocks -- Chief Executive Officer\n\nYes. We're certainly bullish about D&D's prospects. The film has had a fantastic introduction at Comic-Con. I think it's one of the highest viewed trailers that Paramount has ever released.\n\nThere's a nice buzz about it, both at Comic-Con and on the general Internet and among fans. And so we think that's going to be a great launching platform for international expansion and category expansion across licensing, merchandising, digital games as well as driving the core business. I think I'll turn this one over to Eric. And then, Cynthia, if you have anything to add, feel free about the international dimension to Eric's question.\n\nEric Nyman -- President and Chief Operating Officer\n\nSure. Yes, Eric, I think we talked a bit at investor day how we see this event, the scale to be determined, but similar to how we saw Transformers when we launched theatrical behind that brand in 2007. We have a great expansion across new categories of product where Cynthia has done, along with the Wizards team, a terrific job in the publishing genre. But we're really excited about expanding D&D behind the theatrical launch into action figures.\n\nWe have a terrific line that the team has put together. We have a line of NERF products that we're very proud of as well as core games. So you'll see D&D go into more of a board game genre for the first time with Hasbro. So we do feel really positive about the category expansion and with that geographic expansion.\n\nSo as you can imagine, the teams around the globe are very motivated to make sure that we have a positive win on the board with D&D in Q1 of next year. Cynthia, do you want to add anything to that?\n\nCynthia Williams -- President, Wizards of the Coast and Digital Gaming\n\nYes. The one thing I would add is when you think about Dungeons & Dragons Beyond and it being the premier digital tool set, it gives us a great opportunity to expand both internationally, but also the tools and capabilities we give all of our players, it's going to give us a wonderful opportunity to monetize more of our player base than the Dungeon Masters that we are monetizing today.\n\nEric Handler -- MKM Partners -- Analyst\n\nGreat. Thank you very much.\n\nOperator\n\nOur next question comes from the line of Arpine Kocharyan with UBS. Please proceed with your question.\n\nArpine Kocharyan -- UBS -- Analyst\n\nHi. Good morning. Thanks for taking my question. I have a quick clarification maybe.\n\nThe guidance for full year before today implied Q4 could be down 3% to up 6%, which at midpoint would imply some growth in Q4. And today, revenue guidance is flat year over year. Did something actually change in your outlook versus what you said on analyst day or there's actually no change how you were seeing Q4 to play out? How to look at it from where we sit? And I have a quick follow-up.\n\nChris Cocks -- Chief Executive Officer\n\nNo problem. Good morning, Arpine. Thanks for the question. Yes, our outlook has not changed since our Investor Day.\n\nWe continue to feel like there's a lot of green shoots in the portfolio. There's some exciting innovation coming out across NERF, across games, a ton of innovation coming out on MAGIC: THE GATHERING, our first $1 billion brand. Our approximately flat guidance just looks at kind of all factors put together, inclusive of what the macroeconomic environment looks like and what the state of the consumer looks like.\n\nArpine Kocharyan -- UBS -- Analyst\n\nThank you. And then in the slides, you noted expectations of North America POS improvement. Does that mean you've started seeing some improvement outside of those two days of Prime Day overall or expect Q4 to record overall improvement when all said and done versus Q3? Because to finish inventory up low single digits, say, up 2% would mean positive POS in Q4. Am I actually calculating that correctly? Am I thinking about it correctly that you need to see sort of POS come close to positive in Q4?\n\nChris Cocks -- Chief Executive Officer\n\nYes. So there's two components to inventory. There's Wizards of the Coast and Digital, which we have a lot of set releases coming out. So there will be some decline in inventory there that should be fairly significant.\n\nAnd then there's what our Consumer Products team is doing. I'm going to turn it over to Eric to talk about recent POS trends that we're seeing across the G5 markets and North America.\n\nEric Nyman -- President and Chief Operating Officer\n\nYes. Thanks, Chris. Thanks, Arpine. Yes, with regards to POS and market share, we talked quite a bit at investor day about how Q4 was really our focus, and we're back half loaded with regards to innovation.\n\nWe're seeing, as Chris mentioned, good green shoots at this point, in addition to just Amazon and the Prime Day early access sale. So for example, across the EU 5, Australia, our market share and POS trends are improving, flat to slightly up over the last month. And we're also seeing the same level or different levels, but positive improvement in the U.S. over the past several weeks.\n\nAnd that's something that we're obviously motivated to continue to build on.\n\nChris Cocks -- Chief Executive Officer\n\nAnd it should be noted, 67% of our advertising and promotional budget is in the remaining, what, 12 weeks left of the year.\n\nEric Nyman -- President and Chief Operating Officer\n\nQ4.\n\nChris Cocks -- Chief Executive Officer\n\nAnd so we've seen a highly promotional sensitive environment. Actually, the markets where we're seeing the best share trends are where we started a little earlier on that promotion.\n\nArpine Kocharyan -- UBS -- Analyst\n\nThank you very much. This is super helpful. Thanks.\n\nOperator\n\nNext question is from the line of Drew Crum from Stifel. Please proceed with your questions.\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nOK. Thanks. Hey, guys. Good morning.\n\nSo I have two questions on Wizards. Maybe to start, last quarter, you suggested the segment would perform at the upper end of your guidance range, which was low double digits growth. Today, you're suggesting high single digits growth. What has changed versus the previous commentary? Is this a business that's seeing any sensitivity around price that you alluded to earlier? And then I have a follow-up.\n\nChris Cocks -- Chief Executive Officer\n\nYes. So I'll take that. And Cynthia, feel free to fill in anything that I might not cover. We're continuing to see the Wizards of the Coast business performing well, particularly the MAGIC business, which year to date is up 5%, whereas the general games category are down as low as much as negative 8%, depending on which source you look at.\n\nSo MAGIC is a great fan base, very resilient. And we find the fans in the MAGIC segment and in our overall collector segment, they have a great personal balance sheet and a capacity to spend when they're motivated and driving something that they really enjoy. And so that's kind of like underscoring the bullishness on our outlook on MAGIC moving forward. Our digital business has been a little softer year over year, in line with the rest of the Digital Gaming category.\n\nDungeons & Dragons has performed well. But again, we don't have a comp of the premium game that we launched with Dark Alliance next year. And we continue to have a little bit of play in logistics around kind of access of card stock and production because the general trading card market, whether it's sports collectibles or playable trading cards remains a hot and very resilient category. Cynthia, anything to add on the outlook?\n\nCynthia Williams -- President, Wizards of the Coast and Digital Gaming\n\nI think the other thing I'd say is just what a great lineup we have for Q4, kicking off with this, we have Warhammer 40,000 from our universes beyond, Brothers Wars coming up, two strong secret layers, one featuring the platinum selling music artist Post Malone, the other being a 30th anniversary countdown kit. And of course, we've got the high-end collectible MAGIC 30th Anniversary Edition, which was inspired by MAGIC's beta set and includes some of MAGIC's really iconic cards like Black Lotus. And finally, I'd say all five Tentpole releases we've had this year have all done more than $100 million in revenue. And this is the first year that's happened.\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nOK. Thanks. Very helpful. And then my follow-up is more longer-term focused.\n\nMobile as a category has been pretty challenged over the last 18 months. As you think about the next several years, is this going to be a focal point for investment spend across this segment?\n\nChris Cocks -- Chief Executive Officer\n\nWell, as we talked at our investor day, we have a plan to double the size of the Wizards of the Coast and Digital segment over the next five years by 2027. That growth will be powered by continued resilience in our tabletop business and brands like MAGIC and D&D. But we're planning to double the percentage of the segment that's driven digitally. And we have a fairly balanced approach to how we think about where our digital investments are.\n\nWe have a large and growing license business, where the majority of our mobile products are done. We work with some of the best names in the business, Scopely being one very big one. And then we're leaning in a lot into Games as a Service or game platforms as a service like we have with D&D Beyond as well as a bunch of really high-caliber studios that are building some great AAA games that we're looking forward to sharing more about over the coming quarters. So while the digital games market might have its ups or downs in any given quarter or any given year, I think the trend is decisively in the direction that interactive entertainment is the future of entertainment.\n\nAnd I like how we're positioned as a company.\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nGot it. Thanks, Chris.\n\nOperator\n\nThe next question comes from the line of Megan Alexander with J.P. Morgan.\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking our question. I want to spend some time on Consumer Products and maybe how you're thinking about it beyond 4Q. You expect inventory up low single digits.\n\nPreviously, you had expected it flat. You do talk about a lot of entertainment and innovation coming next year. But how do you think about the risk of retailer destocking, especially in the first half, as you're lapping some late-arriving shipments last year? And then how should we think about the phasing of the brands you expect to exit and move to licensing revenue? Should that flow in commensurately?\n\nChris Cocks -- Chief Executive Officer\n\nYes. So a couple of things. I'll start and then turn it over to Eric. And thanks, by the way, for the question, Megan.\n\nFirst off, in the beginning of the year, we and the entire industry were chasing inventory at retail after a difficult holiday season. It's a big reason why we pushed inventory into the Q2 period to make sure that we didn't have that again so that we could promote aggressively in Q4 like our plan is today. I think the other thing to note is we have a lot of new innovation that's very on trend that's coming out in Q4 that we think will comp very favorably in the first half of next year. And then last but not least, I think whatever happens on the macroeconomic front, we have seven blockbuster films and 20 TV shows coming out that are very front half loaded that are giving us a tremendous amount of tailwinds to be able to handle whatever curve balls that the economy might throw our way.\n\nEric?\n\nEric Nyman -- President and Chief Operating Officer\n\nYes. I think excellent points. And I think if you look at the trends that we've seen, Megan, we continue to believe in our lineup for 2023. Retailers, regardless of macro trends, are always very interested in supporting and promoting our great entertainment and our partners' great entertainment.\n\nSo at risk of repeating, when you have a lineup like ours next spring, which starts with The Mandalorian 3 from our partners on Disney+, we then have all those movies that Chris talked about from Ant-Man and the Wasp: Quantumania, D&D, which we talked about already Honor Among Thieves, Guardians of the Galaxy Volume 3, Across the Spiderverse in June, Transformers later in June, Indiana Jones at the end of the month in June, turning into July and then the Marvels, which was recently announced on Disney+ Day by the Disney folks. That's a heck of a lineup, and we have products and great programs supporting all of them. So we do expect that we'll have a really nice start to retail going through Q1 and Q2 in that midterm period that you asked about going into next year.\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nAwesome. So I guess just to tie that all together, is it fair to expect that you believe Consumer Products can be up next year despite exiting some of the brands that you've talked about?\n\nEric Nyman -- President and Chief Operating Officer\n\nYes. I think that's right, Megan. When you look at what we're doing as a business, what we certainly expect is that we're going to see some good growth, particularly across our action brands next year, which is really the predominance of what I just highlighted. And I also want to point out that a big reason for what we're doing from a strategic standpoint is to improve our profit story.\n\nSo certainly, from a Consumer Product standpoint, we not only expect to have that improvement that you asked about with regards to net revenue, but we expect and we'll continue to focus on that operating margin expansion, which you will see from the Consumer Products unit next year as we exit businesses, but also work on our operational excellence program that both Chris and Deb mentioned in their opening remarks.\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nAwesome. And then maybe a quick follow-up for Deb. The guide implies 4Q operating margin above 3, which is usually typical for your business. Is that all mix to Wizards and then the cost savings you've talked about? Or are there some additional drivers of improvement? I guess maybe more specifically, like how should we think about what's built into the guide from a cost of sales perspective in terms of are you confident the inventory actions you've taken in 3Q are sufficient? Or is there further risk in 4Q?\n\nDeb Thomas -- Chief Financial Officer\n\nSo thanks, Megan. No, as we talked about, is we have a very strong mix of revenue. Much of that inventory we have on hand now coming from our different groups. We are actually seeing reduced distribution costs.\n\nSo we're seeing some things come down now on the distribution side. I think all supply chain is easing up a bit. The one exception, I would say, is still paper, which is still a bit of a challenge. And we've stocked up on paper so we can make sure we have supply.\n\nSo you're seeing some of that in our inventory balance as well. So between mix, our cost savings, we'll start to see the benefit of cost savings. In fact, we've said we're going to see about $20 million of that impact predominantly coming in the fourth quarter. And a big piece of that is actually coming in Consumer Products as well.\n\nSo between mix, cost savings actions we've taken to date to make sure we have product on stock, that's how we look at our margin for the fourth quarter and why we remain confident in the fact that we can hit 16% on a full year basis.\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nThank you.                                                                                                                  \n\nOperator\n\nOur next question comes from the line of Mike Ng with Goldman Sachs. Please proceed with your questions.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nHey. Good morning. Thank you for the question. I just have two.\n\nFirst, I want to follow up on Eric's question and just ask about some of the commentary around closeouts and allowances and promotional activity. Was that concentrated in any particular brand or category? Or was this an industrywide toy issue that other players may have seen? And then second, I was just wondering if you could talk a little bit about the Disney Princess impact to revenue and margins within Consumer Products. Is that a product that is effectively winding down and approaching zero? And is that the right way to think about it for the fourth quarter? Thank you.\n\nEric Nyman -- President and Chief Operating Officer\n\nSure. Thanks, Mike. It's Eric. I'll answer in order.\n\nAnd if I forget anything, you can jump in again, Mike. But your first question was about closeouts, allowances, and promotional activity. I'd say we pride ourselves on making sure that we continue to stay ahead of our inventory situation. And as we worked through Q3, as Chris already mentioned, we brought in some inventory in Q2.\n\nAnd we wanted to make sure that we started early activations with our retail partners, which we did. I expect Q4 to be in line with where we've been and we'll work through our inventory again to finish the year in that low to mid-single-digit area that we talked about. And that's what is built into our story that we've already discussed this morning. I think with regards to businesses we're exiting, which is the second part of your question, we do expect that as we exit those businesses, both this year in Q4 as well as throughout next year, that we'll manage that decline through the growth in other brands focused on our Franchise Brands.\n\nWe talked a lot at our investor day on fewer and bigger as our strategy, and that's not going to change. So you're going to see us with that growth in those Franchise Brands and the Partner Brands that we're going to stay behind like Star Wars and Marvel. And we're going to exit some others. And as we exit some of those other brands, as I already mentioned to a prior question, you'll see an increase in operating margin.\n\nSo I think it's an excellent thesis to invest in for Hasbro.\n\nMike Ng -- Goldman Sachs -- Analyst\n\nGreat. Thank you for the thoughts, Eric.\n\nEric Nyman -- President and Chief Operating Officer\n\nSure. Thanks, Mike.\n\nOperator\n\nOur next question is from the line of Fred Wightman with Wolfe Research. Please proceed with your questions.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nHey, guys. Good morning. I just wanted to follow up on sort of Chris and Eric's comments about the price sensitivity and maybe dig into what that means for how you guys are thinking about price in the CPG business. Eric, you sort of gave some color on '23, but then you guys also have this midterm target about 15% within that CPG business.\n\nSo given some of that softer consumer backdrop, is price still a lever you guys feel confident about? Or is it more mix and cost saves that get you there?\n\nChris Cocks -- Chief Executive Officer\n\nYes. Thanks for the question. No, I think it's a couple of things. So as we look at price, we look at a couple of different factors.\n\nFirst, we look at consumer segmentation. And so you have the mass consumer, and then you have the collector and the fan segment. Collector and the fans segment tends to be very price inelastic. It's a very resilient segment that's very passion-driven.\n\nAnd as long as you build a great product and a great play system and continue to invest behind it, we find our fans stick with us. And that's been a major driver of growth for us. Our two fastest-growing businesses this year are our Pulse business and MAGIC: THE GATHERING. And those are very high-margin businesses and very lucrative segments for us that we'll continue to lean in, in the years to come.\n\nOn our mass side of the business, at our investor day, we talked about this concept of play systems and play system-based innovation. And really, that's a high-low strategy of product development, where you have great opening price points. And you pair that with ladder-up opportunities for great giftable items and great kind of stretch items for fans of all ages. And I think what you're going to see is us investing more and more in both sides of those segments.\n\nAnd we think that will be on trend with where we see the market going.\n\nEric Nyman -- President and Chief Operating Officer\n\nYes. I think if I could add to that, Fred, I think the other thing that you're seeing in the industry right now is that brands are a bit more resilient and private label is not. In fact, we've seen a lot of noise in the industry over the last, call it, quarter where retailers are closing out a lot of private label, shifting that private label to closeout shops around the country and around the world. So I think for us, we're clearly a branded house, and we have some very strong brands at Hasbro.\n\nAnd we're seeing pricing sticking and being able to be stronger through this environment. And as Chris mentioned, a lot of that is due to the consumer and the way that we segment our consumers.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nMakes sense. And then just a quick follow-up. The mid-double-digit POS that you guys touched on for Prime Day, is that on a year-over-year basis? Are you comparing that to prior Prime Days? What exactly is the comparison there?\n\nChris Cocks -- Chief Executive Officer\n\nYes. Prior Prime Days.\n\nFred Wightman -- Wolfe Research -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from the line of Linda Bolton-Weiser with D.A. Davidson. Please proceed with your questions.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nYes. Hi. My question is on the Entertainment segment and the projection or outlook for fourth quarter. Sorry if you explained it already, but it looks to me like the Film and TV segment has just as hard, even a harder comparison in the fourth quarter.\n\nSo then can you just reiterate again what are the specific things that are going to happen in the fourth quarter to make the decline smaller against a harder comparison? And then the second thing is the shifting of certain things into the first quarter of 2023. What causes that shifting? Is that just production delays or personnel issues or what is that exactly? And is there anything you can do to rectify that phenomenon in the future? Thanks.\n\nChris Cocks -- Chief Executive Officer\n\nThanks, Linda. Yes, so our Entertainment segment has a very strong lineup in Q4, particularly in TV production. Now the nature of TV productions often have with what's the dating with the network. And so we're seeing a little bit of slippage on when things are being dated inside of the streamers or the various networks that we're working with.\n\nThat affects payment timings and delivery timings of the content. And that's what I think you see going on in Q4 of this year. That said, we see our Entertainment segment ex music being down about mid-single digits, maybe high, maybe low single digits. But a lot of that is just deferred revenue that goes from Q4 into Q1 and points to continued growth and good prospects in 2023.\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nOur next question comes from the line of Gerrick Johnson with BMO Capital Markets. Please proceed with your questions.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nHey. Good morning. I have a couple here. First, I just wanted to clarify what you're saying on inventory because sometimes I'm confused as to whether you're talking about company inventory or channel inventory.\n\nSo what's the channel inventory situation look like right now or at the end of the quarter? And where do you expect that to be at the end of the year? Is that what's supposed to be up low to mid-single digits?\n\nChris Cocks -- Chief Executive Officer\n\nSo Gerrick, when we talk about inventory, we talk about company inventory. And we talk about it across our CP and Wizard segments. So as Eric mentioned, we see the CP inventory up either low single digits or mid-single digits. And we see our Wizards inventory likely down in Q4, which contributes to up low single digits for a company as a whole.\n\nI'll turn it over to Deb to talk about where we see the broader mix of inventory across our channel partners.\n\nDeb Thomas -- Chief Financial Officer\n\nRight. So retail inventory is up, as we said at the end of the quarter, but it's of good quality. And we have a lot of promotional activity planned for the fourth quarter. So our specific guidance was on our inventory is exactly as Chris said.\n\nBut retail inventory, we're working with our retailers on promotional activity, and much of it was setting for a lot of this new innovation that we're having in the fourth quarter.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nOK. Thank you. And I'll add on to what Mike was asking about closeouts and obsolescence. Perhaps you could pinpoint exactly where those issues were and also, Deb, perhaps sales allowances as a percent of Consumer Product sales this year compared to last year.\n\nHow did that look?\n\nDeb Thomas -- Chief Financial Officer\n\nSure. Well, let me take the sales allowance question. And then I can answer some of the closeout question, and then Eric can as well. But we are seeing price allowances a bit higher, all sales allowances period, right, whether price or not a bit higher this year than last year.\n\nAnd the reason for that is if you think about it, we couldn't even get stock last year. So our retailers were selling what they could get for less promotional activity with the consumer, and that was the consumer takeaway last year. So this year, I would say we're returning to a more normal level of sales allowances. Nothing unusually high, but last year was unusually low.\n\nAnd we talked about that and the benefit from that. With respect to just certain territories, we've had some high levels of inventory in pockets that just weren't working that well. So as we look around the globe, we've moved some of that inventory. Some of it's been in the U.S., but some of it's been in various places in Europe and in certain territories, particularly in the Pacific region.\n\nEric Nyman -- President and Chief Operating Officer\n\nYes. I'd also just add, Gerrick, that we have some Q4 elements that we didn't have from a comp last year. So not only are we comping a fairly nontraditional comp, as Deb mentioned, we were in chase mode significantly last year. But we also have a big theatrical movie this fourth quarter with Wakanda Forever from Disney.\n\nAnd that's something that we didn't have in Q4 last year as well as some new brands. Last year, we were really at the very early stages of our eOne integration of PEPPA PIG and PJ MASKS and now we have really good flow for that inventory. So we're feeling good again about where we are. And I think, as Deb mentioned, it will be a traditional sales and allowances cadence as we work through inventory this fourth quarter.\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nOK. Great. Thank you\n\nOperator\n\nThank you. Our final question, this is coming from the line of Jason Haas with Bank of America. Please proceed with your questions.\n\nJason Haas -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning. Thanks for taking my questions. First, I'm curious if you could provide some outlook by segment for next year.\n\nI think at your recent analyst day, you talked about Consumer Products being up low single digits, Wizards high single digits to low double digits, and then I think Entertainment was up low single digits. So is that a good framework to use? I know that was a multiyear target. Is that a good framework to use for next year?\n\nChris Cocks -- Chief Executive Officer\n\nJason, we haven't shared a specific by segment guidance for next year. We only shared kind of longer-term 2025 to 2027 guidance. That said, we feel really good about where we're positioned for Consumer Products, both on the innovation we have coming out this Q4 and how that comps into the first half of next year, a stacked entertainment lineup, which creates a lot of tailwinds for us that I think more than compensates for the business exits that we have. And then we continue to believe in our game segment.\n\nAnd as we just talked, entertainment is going to have some revenue that moved out from Q4 into Q1, which certainly represents at least a modest tailwind helping that business as well.\n\nEric Nyman -- President and Chief Operating Officer\n\nYes. I'd also just add, Jason, as you think about the future, I do want to mention, since we haven't talked much about it, our operational excellence program and just note that we believe we'll be a stronger, more disciplined, more profitable company going forward. And we have the $250 million to $300 million cost savings plan in that mid- to longer-term outlook that we feel very confident in as well.\n\nJason Haas -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you. And then as a follow-up, there's been some investor concern that there's maybe been too many MAGIC releases in a short time frame. There's some talk of wallet fatigue among the players out there.\n\nWe've seen the secondary market prices come down a bit. So I'm curious just what's your response to that concern that there's just a lot of MAGIC product coming all at once?\n\nChris Cocks -- Chief Executive Officer\n\nWell, we've had a great growth for MAGIC: THE GATHERING. Since I started back in 2016, the business has almost tripled. And as I said, we're up through the first nine months of this year by 5%. And the general gaming category is down by most measures close to double digits.\n\nAnd we think that MAGIC will be up double digits by the end of the year. Cynthia, I don't know if you want to talk a little bit more about this, particularly what we have coming in Q4, but we remain bullish on the product.\n\nCynthia Williams -- President, Wizards of the Coast and Digital Gaming\n\nYes. I think a couple of things that I'd say is we did have one of our products sort of slip out a little bit into Q3, which was Infinity. And that was a supply chain issue. But other than that, our releases that are coming up for this year with Brothers War with our secret layer drops, which are direct-to-consumer, our MAGIC 30th addition is also direct-to-consumer.\n\nSo I would say that within the channel, you've got the same number of sets happening in a year in the hobby channel. They've just shifted a little bit in timing due to some supply chain issues.\n\nChris Cocks -- Chief Executive Officer\n\nAnd I'd say just one last thought as you think about Wizards. MAGIC has been incredibly important to the growth of Wizards, but D&D, as much as MAGIC has grown, D&D since the release of fifth edition back in 2014, gosh, it's probably 10 times the size it was back then. And we have an amazing road map ahead for D&D with AAA films, some exciting TV projects that we are going to announce shortly, AAA video games, big partnerships, huge merchandising, and licensing efforts. And so I really think that Wizards of the Coast is positioned to become a two foundation business over the next several months.\n\nThat just will get better and better, driving our blueprint over time.\n\nJason Haas -- Bank of America Merrill Lynch -- Analyst\n\nGood to hear. Thank you.\n\nOperator\n\nThank you. At this time, I will turn the floor back to Debbie Hancock for closing remarks.\n\nDebbie Hancock -- Vice President, Investor Relations\n\nThank you, Rob, and thank you, everyone, for joining the call today. The replay will be available on our website in approximately two hours and management's prepared remarks will be posted following this call. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDebbie Hancock -- Vice President, Investor Relations\n\nChris Cocks -- Chief Executive Officer\n\nDeb Thomas -- Chief Financial Officer\n\nEric Handler -- MKM Partners -- Analyst\n\nEric Nyman -- President and Chief Operating Officer\n\nCynthia Williams -- President, Wizards of the Coast and Digital Gaming\n\nArpine Kocharyan -- UBS -- Analyst\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nMegan Alexander -- JPMorgan Chase and Company -- Analyst\n\nMike Ng -- Goldman Sachs -- Analyst\n\nFred Wightman -- Wolfe Research -- Analyst\n\nLinda Bolton-Weiser -- D.A. Davidson -- Analyst\n\nGerrick Johnson -- BMO Capital Markets -- Analyst\n\nJason Haas -- Bank of America Merrill Lynch -- Analyst\n\nMore HAS analysis\n\nAll earnings call transcripts"
}