{
  "companyName": "Uber Technologies",
  "companyTicker": "UBER",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/uber-technologies-uber-q3-2022-earnings-call-trans/",
  "content": "Uber Technologies (UBER -0.72%)\nQ3 2022 Earnings Call\nNov 01, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. My name is Brent, and I will be your conference operator today. At this time, I would like to welcome everyone to the Uber third quarter 2022 earnings conference call. [Operator instructions] It is now my pleasure to turn today's conference over to Mr.\n\nBalaji Krishnamurty. Sir, please go ahead.\n\nBalaji Krishnamurthy -- Head of Investor Relations\n\nThank you, operator. Thank you for joining us today, and welcome to Uber's third quarter 2022 earnings presentation. On the call today, we have Uber CEO, Dara Khosrowshahi; and CFO Nelson Chai. During today's call, we will present both GAAP and non-GAAP financial measures.\n\nAdditional disclosures regarding these non-GAAP measures, including a reconciliation of GAAP to non-GAAP measures are included in the press release, supplemental slides, and our filings with the SEC, each of which is posted to investor.uber.com. As a reminder, these numbers are unaudited and may be subject to change. Certain statements in this presentation and on this call are forward-looking statements. Such statements can be identified by terms such as believe, expect, intend, and may, and you should not place undue reliance on forward-looking statements.\n\nActual results may differ materially from these forward-looking statements, and we do not undertake any obligation to update any forward-looking statements we make today, except as required by law. For more information about factors that may cause actual results to differ materially from forward-looking statements, please refer to the press release we issued today as well as risks and uncertainties described in our most recent annual report on Form 10-K for the year ended December 31, 2021, and in other filings made with the SEC when available. We published our quarterly earnings press release, prepared remarks and supplemental slides to our Investor Relations website earlier today, and we ask you to review those documents if you haven't already. We will open the call to questions following a brief opening remarks from Dara.\n\nWith that, let me hand it over to Dara.\n\nDara Khosrowshahi -- Chief Executive Officer\n\nThanks, Balaji. We delivered yet another strong quarter with gross bookings up 32% year on year, EBITDA of $516 million, an all-time high and well above our guidance range, and solid free cash flow of $358 million. Despite the uncertain global economic environment and considerable foreign exchange headwinds, we again issued Q4 EBITDA guidance that shows strong incremental progression and remain confident in our ability to deliver healthy top and bottom-line growth with strong free cash flow generation. Underlying this performance are several trends that represent tailwinds for us.\n\nCities are reopening, travel is booming and more broadly, a continued shift of consumer spending from retail back to services. We've seen these trends continue into the fourth quarter, with October tracking to be our best month ever for Mobility and total company gross bookings. With over $1 billion in adjusted EBITDA of $693 million in free cash flow so far this year, we've demonstrated how our global scale and unique advantages of our platform are combining to generate meaningful profits and we're confident in our ability to build on this momentum. With that, let's open the call to questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Brian Nowak with Morgan Stanley.\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nI have two. The first one, Dara, you mentioned the fourth quarter bookings trends. The guidance seems really solid, particularly given the backdrop. Just kind of curious, are you seeing any changes in consumer behavior or trade down or differences in what your income cohorts, how they're acting across Rides, Eats, U.S., Europe? Just any sign at all of weakening within the consumer of your MAPCs.\n\nThat's the first one. And then the second one, maybe a bigger picture one. I think if we break apart the Rides business, a little bit between high-frequency users and the lower-frequency users, there's still a lot of MAPCs who are pretty infrequent users, you know, a few times a month. Can you just talk to us about sort of philosophically over the next few years, the key strategy is to get those lower-frequency users using the platform 3, 4, 5 more times per month?\n\nDara Khosrowshahi -- Chief Executive Officer\n\nAbsolutely. So, Brian, as you can imagine with everything going on, we have been looking very closely for any signs both internally and so that we can communicate to our investors. And right now, frankly, we're not seeing any signs of consumer weakness. And part of it is that the consumer spending is strong and not only is consumer spending strong, but shifting over from retail to services and we are the beneficiary of that.\n\nSo on mobility, we've looked at our mobility consumers from an income basis to see if there's any delta in behavior. We're not seeing any kind of jumps one way or the other. Seasonal trends remain the same. Even lower-income riders continue to have higher trips per rider as things are opening up, showing absolutely no signs of slowing down.\n\nAnd we've also specifically looked at Europe with inflation with the European economies, I think leading in terms of weakness as far as the Western world. Again, we looked to see if there's any weakness and we're not observing any weakness. Really, the biggest factor that's affecting our financials is foreign exchange and the strength of the dollar that makes our stated gross bookings lower and obviously hurts our profit margins, but that's something that we've been able to overcome. When we look at delivery as well, the delivery business, as you saw, accelerated a bit against Q2.\n\nThe frequency of ordering per monthly active platform consumer remains consistent, and it remains consistent not only in the U.S. and abroad as well. So while we have looked for signal, we're not seeing any signal. We're going to be cautious going forward.\n\nWe're going to be cautious on costs. We're going to be cautious on overhead. But as far as the business goes, right now, we are seeing strength across the board. As far as the consumers go high-frequency, low-frequency consumers, it's absolutely true that if we can move our consumer use from lower frequency to higher frequency, we will see very significant growth.\n\nGenerally, if you look at our number of trips per monthly active platform consumer, that has increased to an average of 5.3 from, let's say, 5.0 earlier in the year. So we are seeing higher engagement of consumers on the platform. I'd say there are three factors there. One is our membership program, Uber One, which is now well over 10 million members.\n\nWe are now launched in additional markets. I think we're in eight markets now on a global basis and continue to launch. And Uber One has benefits that are unique in that they have both delivery benefits and mobility benefits as well. So Uber One is definitely a product that is driving frequency.\n\nSecond for us is cross-sell. We are actively cross-selling delivery, consumers, food delivery consumers into grocery, grocery consumers into alcohol and then actually back now to mobility as well. So all of the cross-sell that we have across the platform continues to increase, drive new customers and also drive retention as well. And then for us, also some of the growth initiatives that we have are designed to drive frequency.\n\nThis is hail-ables, taxis, two-wheelers, three-wheelers and lower-cost product as well. When you put it all together, it drives healthy gross bookings growth and generally higher frequency per audience. So we like the tools that we've got, and we think there's a ton of upside for us on the frequency side.\n\nOperator\n\nYour next question comes from the line of Eric Sheridan with Goldman Sachs.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nMaybe two, if I can. First, Dara, we saw a proposal from the labor department in the last couple of weeks and it caused a lot of volatility in the news flow around the sector. Can you give us your latest state views on not only how that proposal might evolve, but your current state of the world in terms of landscape with respect to the gig economy and how that might evolve in terms of a mixture of elements in your business over the next couple of years? That's number one. And then number two, maybe asking Brian's question, but pivoting it toward that delivery side of the house.\n\nI think there continues to be a lot of concern about how delivery will grow with the consumer weekends. Are you seeing anything on the consumer front that you want to flag in terms of the delivery cadence or the delivery frequency? And how should we be thinking about some of the widening out-of-use cases and delivery as maybe muting some of that impact in the next 12 to 18 months?\n\nDara Khosrowshahi -- Chief Executive Officer\n\nYes, absolutely. So as it relates to the Department of Labor rulemaking, first thing I would tell you is it effectively returns us to the framework during Obama's presidency, which was a framework in which we grew significantly. And it doesn't reclassify any workers, doesn't include NAD test. So when we look at the rule-making, we believe that it will provide for stability going forward.\n\nAnd really the focus that we have ourselves is working on a state-by-state level, right? Prop 22 in California passed with 58% of the votes in a very, very liberal state. I think everybody recognizes that the value of the flexibility of independent contractors, earnings levels are very robust. And I think the dialogue that we're having on a state level, really our goal, and we are finding that the dialogue is a robust dialogue on a state level about preserving flexibility, having robust earners, and then also providing some protections appropriate for independent contractors is the right way forward. We continue to have dialogue.\n\nAnd I think the trend is in our favor at this point, but it is -- the road is going to be bumpy. And for us, the nature of work is always going to be a big issue that we have a responsibility to shape going forward in dialogue, obviously, with local governments. When we look at delivery, again, we don't see any signs one way or the other of consumer weakness at this point. It's something that we're watching out for us.\n\nBasket sizes are up, frequency is stable. About 10% of our eaters on a monthly basis now are using our grocery product as well. So we are driving higher engagement there. And Uber One membership continues to penetrate at higher rates within our delivery segment.\n\nSo you see the growth rate of delivery. It continues to be stable, et cetera, a little bit this quarter. And I think for Q4, we expect it to be stable to up a little bit as well. At this point, we're not seeing weakness.\n\nWe're definitely watching out for it.\n\nOperator\n\nYour next question is from the line of Justin Post with Bank of America.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nI guess you've done a good job breaking down the mobility drivers in three categories. Can you help us think about delivery growth from here to get to your plan in'24? That would be the first thing. And then we did see corporate overhead go up a bit quarter over quarter, I think. Could you just go through some of the drivers there? And if you can kind of keep that cost contained over the next couple of years?\n\nDara Khosrowshahi -- Chief Executive Officer\n\nSo I think if you look at delivery growth, our growth accelerated a little bit this last quarter. North America volumes remained very healthy. So North America, gross bookings grew 19%. And then in Europe, actually, we saw a slight acceleration in terms of gross bookings on a constant currency basis as well.\n\nAnd so I think on delivery, it's all steady on the front. The growth rate is driven based on adding in new eaters. And obviously, we have a source, a significant source, of new eaters coming in from the mobility side. Our mobility business provides as many new eaters to our Eats service, Google, Facebook, TikTok combined at about a quarter of cost.\n\nAnd it's also about merchant apps. So we are now at an all-time high in terms of the number of merchants on the platform. And the number of merchants are -- it's about 870,000 merchants on the platform, up about 11% year-on-year. So again, that number of merchants, that growth of merchants mirrors our gross bookings growth as well, gross bookings growth being a little bit higher.\n\nSo with Eats, it's about demand and supply, and we're adding new eaters, and we're adding new merchants which is really driving the growth of the business along with the frequency that we see with Uber One. Nelson, do you want to talk about overhead?\n\nNelson Chai -- Chief Financial Officer\n\nSo on the corporate overhead, yes, it did increase a little bit in the quarter. We obviously continue to monitor quite closely. And so on a year-on-year basis, we actually did deliver about 20 basis points of leverage as a percentage of gross bookings. Internally, what we're doing is we really are trying to focus on managing our costs.\n\nif you will, because we do recognize that the environment is a little bit more uncertain despite the fact that our businesses are operating quite well. So you should expect us to continue to be disciplined and we're going to continue to deliver the operating leverage. As you know, for us, the north star right now is making sure that we deliver the 7% incremental margins that we talked about at a total company level. And as you know, we're ahead of that and expect to be way ahead of that as we think about full year 2022.\n\nOperator\n\nYour next question is from the line of Doug Anmuth with J.P. Morgan.\n\nDoug Anmuth\n\nOn the mobility side. I was hoping you could get just the early read on upfront fares and destination functionality for drivers. And then second, if you could just talk about the higher mobility take rate to 27.9% which was up about 130 bps sequentially, the key drivers there?\n\nDara Khosrowshahi -- Chief Executive Officer\n\nSure, I'll take the first, and Nelson will take the second. Listen, upfront fares are -- upfront fares to destinations are a big positive as it relates to driver satisfaction. Drivers now on a global basis were at 2019 highs. If you look at the U.S., the number of drivers that we have is now about 80% recovered versus 2019, but the number of drivers we have is up 37%.\n\nAnd what we're seeing is that driver churn is down almost 20% versus where it was historically. So drivers are much more engaged on the platform. We talked about driver earnings being $36 an hour on average in the U.S. as well.\n\nAnd the driver engagement, in other words, how many hours are our drivers driving on average is up 16% on a year-on-year basis. So the robust earnings the continued flexibility and additional information that you get in terms of upfront destinations that is combining for very, very healthy supply trends. We can still have more drivers into the marketplace, and we're busy doing so. But the trends that we see are very healthy and the competitive trends that we see in terms of driver engagement on our platform and drive preference for our platform remain very, very high.\n\nSo the product team has really worked to improve the driver experience from onboarding to the upfront destinations to our customer service to a bunch of safety innovations that we're driving as well. So there's a lot of innovation going on, on the driver front, and it's definitely showing in terms of their preference for our platform.\n\nNelson Chai -- Chief Financial Officer\n\nYes. So first of all, regarding the take rate of mobility, as we've talked about in the last quarter, it gets a little bit more challenging because of a business model change in the U.K. that occurred in March. So our reported ability take rate was 27.9%.\n\nIf you adjust ted out the impact of the U.K. merchant model change, the underlying take rate would have been about 20.2%. On an underlying basis, the take rate did increase about 100 basis points quarter on quarter. And again, the underlying take rate would have been closer to 22% because the fuel charge impact was relatively constant quarter over quarter.\n\nAs we've been trying to guide you, we actually view take rate as just one of the levers of the P&L. We really are focused on demonstrating both growth at the top line, but more importantly, continuing improving margins which we're getting. The segment EBITDA margin for mobility in Q3 was 6.6% and continuing to improve. And so we're really focused across a number of different dimensions.\n\nAnd again, we feel like we have a lot of levers to make sure we deliver against our top and bottom-line targets.\n\nOperator\n\nYour next question is from the line of Ross Sandler with Barclays.\n\nRoss Sandler -- Barclays -- Analyst\n\nNelson, I just want to follow up on that last comment about your Rides EBITDA flow-through, so the 6.6%. At Analyst Day, you guys showed that some of the top 20 markets that are performing above the long-term target already back in February, and you've seen this EBITDA margin go up several hundred basis points this year. So could you just talk about like what's pulling up the overall? Is it that those top markets that are in the top 20 are going up even further than 13%, or is it the ones that are kind of below the average closer to breakeven moving toward that long-term goal? Like any color on what's driving the EBITDA margin improvement in rides. And do you guys think it's still 11% in the long term, or could it be potentially higher?\n\nNelson Chai -- Chief Financial Officer\n\nSo we talk about 10%, and that's the number we've kind of talked as a guide. I would say it's across the board. So what we're seeing is we are getting leverage because, a, we're managing our cost base; b, we've talked a lot about some of the investments we made last year in terms of bringing the supply on. So we're able to be more efficient in terms of adding that supply.\n\nAnd so it's really across the board. Those top markets that I kind of highlighted continue to do extremely well. And actually, we have a number of countries that are above that 10% number. And the ones that are below are continuing to improve.\n\nAnd so we've just seen an overall improvement in our marketplace. Our business is actually going quite strongly across all of our key geographies right now. And again, it's a lot of the confidence we have if you think about our ability to put out our quarterly targets and then overachieve against it, particularly on the bottom line, as you've seen this year. And again, if anything, as we think about our 24 targets, we're three quarters in just laying out those numbers in February.\n\nWe've largely hit them on the top line. We've over-exceeded them on the bottom line. The business is operating quite well, and so we probably are more confident in terms of hitting that bottom line number if you think about three years out. But it's not just because it's the folks below the 10% or above the 10%.\n\nIt's actually the overall marketplace and how the business is operating right now.\n\nDara Khosrowshahi -- Chief Executive Officer\n\nAnd, Ross, I'll just add that we're able to drive this kind of incremental margin, the healthy incremental margin while we continue to invest in some of the newer products in the mobility portfolio. As we invest in taxi, as we invest in reserve, as we invest in U4B high-capacity vehicles, shared rides, etc. So we are actively reinvesting in growth levers but the base business is inflecting and is showing very, very strong leverage that allows us to invest in new products while we're delivering higher profitability, as Nelson said.\n\nOperator\n\nYour next question is from the line of Lloyd Walmsley with UBS.\n\nLloyd Walmsley -- UBS -- Analyst\n\nTwo, if I can. First, just given all the questions around macro, are there enough levers in the business on the cost side and kind of rationalizing competition such that you're confident in the 2024 EBITDA targets kind of regardless of macro. And then second one somewhat related, Lyft recently retired their energy surcharge and added a new charge to pass along higher insurance costs. Do you think a similar course of action might make sense for Uber? And what could that mean for the P&L?\n\nNelson Chai -- Chief Financial Officer\n\nSo first of all, in terms of leverage, yes, we've been telling you this. And if you think about the levers that we're able to pull, as Dara said, we're able to continue to improve and deliver or over-deliver against the 7% incremental margins at a company level. While we're investing in some growth sets. And so we are frankly we find more confident in terms of delivering the 24% EBITDA number as we sit here today in November versus even February because again, we have three-quarters of data behind us.\n\nAnd including the part of the macro environment is also the competitive environment. And so we are operating quite well right now. So yes, we think we're going to -- we are very confident in terms of delivering the '24 EBITDA number. In terms of the Lyft surcharge, what I would tell you is we obviously know what they're doing.\n\nWe pay close attention. We are not making any changes at this time. It's not that we wouldn't at some point. That obviously would have a beneficial effect.\n\nBut again, we are trying to balance our marketplace, drive an efficient marketplace. And as you can tell by our results, we are delivering very, very strong bottom line as well as top line. And again, we'll continue to evaluate it. But again, we're not going to make a change based on something that they're doing.\n\nDara Khosrowshahi -- Chief Executive Officer\n\nI'll just add that right now, the focus of the business is really to improve our supply situation. And that's kind of where we're waiting some of our investments. Earnings from our earners on a global basis were $10.8 billion, up 25% all-time high on a global basis. And our job is to run a lean operation where we can deliver as much earnings as possible to our drivers and couriers on a global basis and also obviously be responsible to our investors.\n\nSo right now, exactly as Nelson said, we like where we are, and we're going to focus on our own strategy versus some of our competitors' strategy.\n\nOperator\n\nYour next question is from Deepak Masan with Wolfe Research.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nSo a couple of ones, first, can you unpack the incremental margins in 3Q? It's continuing to be very strong, even as you kind of come through the investment period last year. Can you elaborate the factors driving cost per trip down? Is it more sort of like a batching and changing with scale that's happening on the platform, or are there any other earning factors? And then second question, Dara, maybe can you talk about some of the kind of countercyclical elements potentially helping driver supply with macro becoming weaker across the world in certain countries? Are you starting to see sort of like the driver supply and hours being helped by a weakening macro in certain regions?\n\nDara Khosrowshahi -- Chief Executive Officer\n\nSo first, Deepak, I'll take the first part. So as you know, we made a very conscious pivot toward expanding delivery profitability faster than we previously planned. And if you look about what we've delivered this year, as well as what the guidance is in the Q4, that will play true. We benefited both from the work that our tech team has done in terms of improving our currency, our courier efficiency.\n\nAnd so that is probably the single biggest driver in terms of operating, in terms of driving incremental delivery margins. And then secondarily, there's -- we still have a fair amount on the incentive line. The competitive environment has gotten more constructive, if you will, as a lot of our competitors are also trying to follow our lead in trying to drive profitability. And then the ones that are not public, as you know, the funding markets have changed.\n\nSo we really are competing much more on platform. And so you're seeing the benefits of that as you think about both our growth, but importantly, our EBITDA margin progression. And so you should expect us to continue to drive that because as Dara said, internally, we are committed to managing our cost base and really making sure we get leverage off of our scale platform. And then Deepak, in terms of driver supply, that is getting healthier across the board on a global basis.\n\nI think there are a couple of factors. One is we lean into driver supply. So driver incentives, while they are easing continue to be at high levels, we are investing billions of dollars in driver incentives, to bring drivers on board. Second is we have invested significantly in our onboarding flows, auto fetching documents as opposed to you're having to take pictures of your documents, improving the conversion of driver sign-ups to actually drivers getting onboarded and making that first trip as well.\n\nThere is a ton of tech work that has gone into those onboarding flows. And then I do think the macro environment does seem to be helping combined with the solid earnings that we're seeing, right? Average driver in the U.S. making $36 per engaged hour. Those are very, very healthy earnings levels.\n\nAnd in the U.S., at least over 70% of our drivers who are coming on board now said that inflation did play a role in their decision to sign up, right? It helps them afford their groceries, be more comfortable in an environment where real wages are fairly weak as it relates to the inflationary environment. So we do think the macro environment is helping although I do think that the investments that we made both in technology and behind driver incentives are also a pretty important factor as well.\n\nOperator\n\nYour next question is from the line of Mark Mahaney with Evercore ISI.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nI wanted to ask two productivity questions. The Uber One, what do you -- what else can you do to make the Uber One value proposition more compelling such that you go from 10 million customers, members to 20 million or 30 million? Like what are the big unlock ahead on Uber One? And then secondly, you talked about driver supply is now back on par with mobile -- the active drivers is back on par with September '19 levels, and that you've seen improvement in things like surge and ETAs. Are surge and ETAs, are those metrics back to where they were back then? And if not, what still needs to be done to kind of continue to improve the performance, the productivity of mobility to get it back to where it was and to get it improved from today?\n\nDara Khosrowshahi -- Chief Executive Officer\n\nSure, Absolutely. So, Mark, the one thing that I would stress is we think Uber One is already there. Like we're always trying to improve the product as well. But remember, this is a very young product.\n\nWe're still launching markets. So we're now in 8 markets, and it is the only product out there. We price competitively with other players who are offering delivery-only benefits. And we are offering delivery benefits that are just as strong as their competition and discounts ranging from 5% to 10% on the mobility side, which is a far superior proposition, especially as markets are opening up as well.\n\nSo we're confident with the product as we have it to be able to go from 10 million to 20 million to the 30 million that you put out there. The product is already there. Now we are going to invest in experiential benefits. Do you get priority pick-up in airports? Do you get priority matching, for example, during an event? Those are definitely benefits that we are going to experiment with.\n\nBut Uber One as is, is the best membership product out there on a global basis. And obviously, with the audience that we have, we have a mobility audience and a delivery audience, and a grocery audience that we can put -- that we can push Uber One in terms of a marketing audience. We think that 20 million, 30 million are a matter of time. In terms of surge and ETAs, they are coming down.\n\nGenerally, I would say surge levels now are running at a high 20% to 30% range. We're more comfortable with range, call it, in the teens. ETAs on average, are running, call it, six minutes. And we are more comfortable in the five-minute range.\n\nWhat it takes to get to those levels is simply continued investment in supply], and we are seeing our supply improve, and generally supply hours are growing at very healthy rates which is a function of new drivers onboarding, but then the average driver who's onboarded being engaged at a higher level than they were last year. So as we improve the supply demand balance of the marketplaces and we're well on our way, we think we'll get surge levels below 20% and ETA is closer to five minutes. Directionally, we're confident where we're going.\n\nOperator\n\nYour next question is from the line of Ron Josey with Citi.\n\nRonald Josey -- Citi -- Analyst\n\nWanted to follow up on a question really on upfront fares and destinations. And I think in the past or recently, you talked about just variables that go into pricing more so than just time and distance. So can you talk to us a little more about just the variables on the algorithm besides time and distance on up from fares? And then we haven't talked much about advertising here, but 350 million run rate, targeted billing by '24, a bunch of launch in this quarter. Talk to us about what's needed from the tools to maybe verticals or a sales force perspective to get to that $1 billion?\n\nDara Khosrowshahi -- Chief Executive Officer\n\nYes, sure, Ron. So time and distance, there were definitely variables. One variable is the supply of drivers in that location, right? If there are a lot of drivers in that location, you can price the trip a little lower, or if the supply drivers is low in that location, then you're going to have to price up as well. We will also predict the chances of there being another ride at the destination as well.\n\nSo is the driver going to have a large amount of deadhead miles, call it, in which case we would price up? It's highly likely that the driver will have another ride so that utilization is high, then we will price that ride lower. And then also some of the basics, right? How far does a driver need to drive for the pickup? If it's half a mile, then price might be lower. If it's, call it, five or six miles, then the price will be higher as well. And then also, our ability to show the upfront fare and our looking at what the excess rate is for those upfront fares, give a signal into a pricing algorithm that wasn't possible with time and distance previously.\n\nWhen we are talking distance, it is what it is. Drivers will accept or they won't actually in that case, they would cancel if they didn't like the destination. Now we see live signal as is our pricing working or not based on driver acceptance rates and that goes into the algorithms that determine pricing as well. All of this is combining to a higher throughput marketplace with higher satisfaction on the driver side as well.\n\nSo we're pretty happy about the signal. And it's clearly something that drivers love. In terms of advertising, we're very confident the targets that we put in terms of getting to $1 billion were based on what we think are conservative assumptions. We see competitors out in the marketplace with advertising dollars as a percentage of gross bookings of 2%.\n\n$1 billion by 2024, it implies numbers that are short of that 2% number. So we think even if we get to $1 billion, we think we will have growth in advertising. Beyond that, we are now excited to open up new services, new surfaces on the advertising front. Our journey ads that we have launched that opens up the mobility surface.\n\nWe are getting very, very excellent engagement as far as mobility consumers with those ads, and we're attracting some pretty premium advertisers onto that surface as well because of the unique surface that attracted very high demo as well. So we are well on our way to that $1 billion, and I think, again, the $1 billion is not the high point of that business. The billion is just one step along the way to building a multibillion-dollar business for us.\n\nOperator\n\nYour next question is from the line of John Blackledge with Cowen.\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nTwo questions. First, could you discuss Uber's market share positioning in both mobility and delivery? And then on mobility, could you talk about the volumes compared to the highs of pandemic?\n\nDara Khosrowshahi -- Chief Executive Officer\n\nSure, in terms of our category position in mobility and delivery, we operate all around the world. But if I were to generalize on mobility, our category position is very strong. We are at close to, if not at, all-time highs. In U.S., Australia, the U.K., particularly, is very, very strong with us -- strong for us as far as category position goes.\n\nAnd then on the delivery side, we have improved our category position quarter on quarter and either we've been stable or improving our category position across 75-plus percent of our gross bookings base. And in the last month, we believe that's only improved. So we are in a position now because of the scale of the business, because of the global nature of the business and the part of the platform where mobility is pushing is sending consumers to delivery and vice versa. We're able to gain category position and improve margins pretty significantly, which is great.\n\nNelson Chai -- Chief Financial Officer\n\nSo in terms of recovery, so we're more than 100% recovered versus pre-pandemic levels globally in mobility, and we're about 94% recovered on a trip base globally. So again, the business has come back nicely. And again, we see a pretty good runway ahead of us.\n\nBalaji Krishnamurthy -- Head of Investor Relations\n\nWe'll take one last question, please.\n\nOperator\n\nYour final question comes from the line of Jason Helfstein with Oppenheimer.\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nSo our work suggests that delivery-only users in Europe, and we use U.K. as a proxy, are multiples higher than mobility-only users. I guess, can you elaborate what do you think you need to do to convert these delivery-only users to mobility users, or do you think there are structural differences in transportation in Europe versus the U.S.?\n\nDara Khosrowshahi -- Chief Executive Officer\n\nYes, so I think in terms of those users, it's really the platform. So we are now offering mobility promos, for example, to deliver users who either have churn or mobility users who've never used mobility before. And we're seeing really great promise in terms of delivery actually being able to cross-promote and drive mobility use cases as well. And then Uber One is the other product that we have.\n\nObviously, the lead benefit for Uber One is free delivery, discounts on your delivery as well. But the mobility benefits are benefits that we can promote in Europe and other markets. And when you look at the U.K., for example, a much higher percentage of our mobility business is less in London, while the delivery business is not just in London but is in a number of other cities, the Manchesters, Liverpools, Newcastles, et cetera, of the world as well. So we see the power of cross-promotion.\n\nWe started with mobility really promoting delivery. So we think delivery promoting mobility back is absolutely a potential that we have, but we're very early in terms of developing. Well, thank you, everyone, for joining. We are very, very happy to deliver another healthy quarter of strong top-line growth and strong bottom-line growth as well.\n\nNelson did not get to talk about it, but there are thousands of Uber employees who are doing the hard work on the ground, so a special thank you to them. And then, of course, our earners with whom we want to be here talking to you. We look forward to talking to you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBalaji Krishnamurthy -- Head of Investor Relations\n\nDara Khosrowshahi -- Chief Executive Officer\n\nBrian Nowak -- Morgan Stanley -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nNelson Chai -- Chief Financial Officer\n\nDoug Anmuth\n\nRoss Sandler -- Barclays -- Analyst\n\nLloyd Walmsley -- UBS -- Analyst\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nRonald Josey -- Citi -- Analyst\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nJason Helfstein -- Oppenheimer and Company -- Analyst\n\nMore UBER analysis\n\nAll earnings call transcripts"
}