{
  "companyName": "NetEase",
  "companyTicker": "NTES",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/18/netease-ntes-q2-2022-earnings-call-transcript/",
  "content": "NetEase (NTES -0.71%)\nQ2 2022 Earnings Call\nAug 18, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the NetEase 2022 second quarter earnings conference call. Today's conference is being recorded. At this time, I would like to turn the conference over to Margaret Shi, IR director of NetEase. Please go ahead, ma'am.\n\nMargaret Shi -- Director, Investor Relations\n\nThank you, operator. Please note the discussion today will contain forward-looking statements relating to future performance of the company and are intended to qualify for safe harbor from liability as established by U.S. Private Securities Litigation Reform Act. Such statements are not guarantees of future performance and are subject to certain risks and uncertainties, assumptions and other factors.\n\nSome of these risks are beyond the company's control, and could cause actual results to differ materially from those mentioned in today's press release and in this discussion. A general discussion of the risk factors that could affect NetEase's business and financial results is included in certain filings of the company with the Securities and Exchange Commission, including its annual report on Form 20-F and in announcements and filings on the website of Hong Kong Stock Exchange. The company does not undertake any obligation to update this forward-looking information except as required by law. During today's call, management will also discuss certain non-GAAP financial measures for comparison purposes only for definition of non-GAAP financial measures and a reconciliation of GAAP to non-GAAP financial results, please see the 2022 second quarter earnings news release issued earlier today.\n\nAs a reminder, this conference is being recorded. In addition, the investor presentation and a webcast replay of this conference call will be available on NetEase corporate website at ir.netease.com. Joining us today on the call from NetEase senior management is Mr. William Ding, chief executive officer; and Mr.\n\nCharles Yang, chief financial officer. I will now turn the call over to Charles, who will read the prepared remarks on behalf of William.\n\nCharles Yang -- Chief Financial Officer\n\nThank you, Margaret, and thank you, everyone, for participating in today's call. Before we begin, I would like to remind everyone that all percentages are based on RMB. We are very pleased to report another solid quarter with net revenues growing to RMB 23.2 billion, up 13% versus the same period last year. Our online games continues to be our primary growth driver with net revenues from our games and related value-added services coming in at RMB 18.1 billion for the second quarter, up 15% year over year.\n\nPlease note, we changed our segment categorization this quarter. The expanded games and related VAS segment now includes game-related value-added services such as CC livestreaming, game-related accessories and merchandises, etc. We believe this revised segment categorization better reflects the performance of our well-rounded capabilities around the broadly defined game ecosystem and value chain. Players continue to gravitate to our long-lasting franchises.\n\nIn the second quarter, revenue from our Fantasy Westwood Journey Saga kept on growing, further impressing the industry with their strength and longevity. Through the solid foundations we've built and continuous iterations we release every few months, these flagship saga are still among the most well-crafted games in today's market, remaining highly attractive to users even after nearly two decades of operation. Over the years, we have built complex and intricate ecosystems within the games, constituting well-balanced, comprehensive economic systems and intimate user networks. We see these games as a work of art and science and this is ever evolving as we dynamically adjust the finest details.\n\nIn terms of newly launched titles, we were extremely excited to see Diablo Immortal in tens of millions of players dominating the iOS top download chart in multiple regions. Diablo Immortal both fantastic gameplay that relishes the authentic Diablo experience, which also featuring an MMORPG social experience, where players can share a massive world with others as they explore. We are working hard to keep it fresh and plan to continuously introduce exciting new content for Diablo Immortal in a fast-paced manner to keep players engaged. Diablo Immortal's debut was also a huge opportunity for us to showcase our world-class development capabilities, leverage a Messiah, our robust self-developed game engine, Diablo Immortal underscores our proficiency in producing top-quality games on mobile devices.\n\nOver the years, our team has worked hard to recreate the Diablo sensation on mobile, putting great effort into every detail of the game and overcoming countless barriers along the way. In the second quarter, NARAKA: BLADEPOINT maintained strong engagement levels as we introduced a series of content update. By the end of May, the game has sold 10 million copies worldwide since its release about a year ago, turning it into one of the best-selling PC games in the world. Along with its one-year anniversary, we recently announced an array of exciting updates for NARAKA: BLADEPOINT, including a brand new map for the game called Holoroth.\n\nHoloroth brings fresh combat experiences to players and a wealth of new features such as weather systems, interactive objects and new areas to explore, winning wide praise from players. On June 23, we debuted NARAKA: BLADEPOINT on Xbox Series X's and joined Xbox Game Pass. In its first two weeks on the market, an impressive one million new players jumped into the game, enjoying the exciting game play, which had been optimized for the council. The game will next be available on Xbox One.\n\nSimultaneously, we are working to bring NARAKA: BLADEPOINT authentic melee combat to mobile platforms. Development is progressing smoothly and preregistration has been very encouraging with more than three million users already registered without much marketing. Another exciting title that tops the chart in the second quarter was Infinite Lagrange. With new creative social media marketing initiatives, we greatly expanded the games user base, which triggered wide player interest in our Sci-Fi SLG title.\n\nWe are also seeing strong retention of new players, further boosting our confidence in this promising category. We continue to introduce new game play and all rounded graphic updates on ships, staff and space stations to further strengthen our leadership in the SLG category. Moving on to our pipeline, in addition to the aforementioned NARAKA: BLADEPOINT mobile version, our strong pipeline is bursting with other exciting titles in making. Harry Potter: Magic Awakened, is under preparation for global launch following its debut in China last September.\n\nWith our latest round of beta testing in July, we received very positive feedback from the player community. Together with Warner Brother Games, we look forward to co-publishing this amazing title for global audience soon. Domestically, our development of Justice mobile game is well on track, building on the success that our PC phenomenal justice created back in 2018, Justice mobile game will recreate a vivid world of the song dynasty on mobile devices with our cutting-edge game technologies, such as motion capture and global elimination. As a leader in the MMO category, we will keep pushing boundaries and continue to raise the bars for the industry.\n\nJustice mobile game will no doubt introduce a brand-new game experience to the MMO universe and offer players a world of greater freedom and more imagination. We are determined to become a well-respected premium global game content provider on the international stage. Our globalization strategy will be an essential part of the next chapter of our growth story. Our world-class R&D infrastructure, coupled with our top talent from all over the world, will serve as a strong foundation to build the next sensation of blockbusters for players worldwide.\n\nWe always follow an innovative first approach and look for creative mind with the same passion for games. Through strategic investment and partnership as well as setting up first-party overseas studios, we've successfully built a strong connection with top talent across the global stage. In the second quarter, we made further progress in our globalization efforts, successfully bringing internationally renowned game veterans to NetEase. During the quarter, we are pleased to have announced that renowned industry veteran, Jerry Hook, a founding member of Xbox Live and one of the key masterminds behind the Halo and Destiny franchises.\n\nJerry will be heading our newest first-party studio Jar of Sparks based in Seattle. We also announced the onboarding of Emile Liang, who had previously spent over 23 years with Ubisoft and was a producer of the Far Cry and Assassins Creed franchises. We are excited for him to join as a lead producer in our Montreal studio, bringing us more expertise in AAA game production. In Japan, we are also excited to welcome another master producer, Hiroyuki Kobayashi, who was a 27-year Capcom veteran and the producer of Resident Evil, Devil May Cry, Sengoku, Asara and many other well-known game series.\n\nSame as our previously announced overseas studios, our new studios and producers have great autonomy over the games they want to build, allowing these top-notch talent to rise organically and maximize the creative genius in each of them. Now, turning to our education business. Total net revenues for Youdao were RMB 956 million in the second quarter, and we achieved positive operating cash flow of RMB 104 million in this quarter despite the challenges faced during the COVID resurgence and business transition. For the second quarter, net revenues from smart learning devices were RMB 240 million, up 16% year over year, demonstrating our resilience despite the pandemic's impact on the supply chain and logistics.\n\nOur flagship products maintained their remarkable popularity while we released a variety of diversified new products to cover a broader range of learning scenarios. Youdao Dictionary Pen series and Youdao listening pod, both led their respective categories, during JD.com's June 18 Shopping Festival. In July, we introduced a new product called Youdao Smart Learning path. Our very first learning path equipped with AI diagnosis and adaptive learning functions.\n\nThe product satisfies users' needs for reading, listening, writing and practicing, all on one consolidated device. We continue to diversify our product offering in the stream education sector in which we achieved sustainable growth with gross billings expanding by more than ninefold in the second quarter year over year and over 180% quarter over quarter. For example, in the second quarter, gross billings from Youdao International Chess increased by over 60% quarter over quarter with an aim to create a comprehensive and user-friendly online learning community. We also launched Youdao board game Academy application at the end of last year to better serve our students of goal, chess and Chinese chess courses.\n\nAs a result, the monthly average DAUs on this platform has increased over seven times compared with that of the first quarter. Looking ahead, Youdao will continue to upgrade its diversified products and services to empower more efficient learning experiences for Chinese students. Driven by our proprietary technologies, we remain confident in Youdao's development trajectory in the second half of this year. On cloud music, again, a more challenging industry environment and macro headwinds.\n\nWe maintained strong growth in the second quarter and total revenues improved by 29% year over year to RMB 2.2 billion. Our membership paying ratio also reached 21%, demonstrating the resilience of our business and high demand for the cloud music, immersive music experience along with users increasing willingness to pay for premium content. Our online music services MAU stood at RMB 182 million with our DAU over MAU ratio staying well above 30% during the period. Gross margins have continued to improve and reached 13% in the second quarter compared with just 4% in the same period last year.\n\nBy enhancing our product and community features and through technological innovation, we are bringing music lovers and artists alike the premium experience they crave. During the period, we launched our new high-resolution audio feature offering users higher audio quality for an immersive audio experience, coupled with our seamless listening function. We are committed to bringing users superior sound quality through the latest technology. Using interaction is also a key component to the music experience we aim to provide with our new music-inspired social networking app MUS, we are utilizing music content to connect users.\n\nWithin this app, users can connect with users who share similar music taste, based on their listen preferences and personality insights. On the content side, to satisfy the music needs of our younger users, we continue to build our content and give users increasing choices to express themselves. As of June 30, 2022, Cloud Music was also home to over 500,000 registered independent artists with 2.3 million music tracks created by this group of talented musicians. In addition, we are also working in collaboration with top labels to secure more top talent content and simultaneously achieving better commercial terms.\n\nAs for our recently licensed content, we've added multiple licensing agreements with major overseas and domestic music labels such as SM Entertainment, PF entertainment, YG Entertainment, all of which provide our users with access to more hit and improved ROI. This will continue to be our goal as we negotiate with multiple copyright holders to bring in music content that resonates with our community and complement our offering. Looking ahead, we plan to keep growing in the scope, content coverage and community size. Moving on to Yanxuan.\n\nOur private label brand continues to launch popular products that consumers love across diversified channels in the second quarter with the goal of bringing consumers products that facilitate a more leisurely and modern lifestyle, Yanxuan focuses on its development of high-quality original product design. During the second quarter, we launched a number of popular products such as hand-made vinegar, ergonomic chair, skin-friendly built and Chinese-style fragrances, covering food, home furnishing, bedding as well as personal hygiene and maternity products. Lastly, in June, we published our ESG report for 2021, highlighting that we have officially established a dedicated sustainable development department and formed an ESG Committee at our board level consisting of three independent directors. In addition, we remain committed to continuing developing our carbon strategy and enhancing more transparent disclosure.\n\nIn 2021, as part of our environmental and social endeavors, we successfully reduced over 3,800 metric tons of carbon emissions in warehouses, logistics and packaging sites, and donated over RMB 80 million for flood relief and efforts toward pandemic control. In addition to our ongoing work to help students in remote mountainous areas, we also provided a great number of smart hardware, high-quality courses and online learning platforms to rural schools. We were pleased to learn that with our help, many students achieved positive results in this year's college entrance exam and were successfully admitted to top universities, including Peking University. Across our business, we strive to serve the greater good of society as a whole and use our technology and other resources to support a better future.\n\nSo far, we are making steady progress in growing our core game businesses and international presence with the global launch of thrilling new games across different platforms and establishment of our overseas studios, which affords us access to the best creative minds anywhere in the world, we are getting ready for the next phase of our global ambition. This concludes William's comments. I will now provide a brief review of our 2022 second quarter financial results. Given the limited time on today's call, I will be presenting some abbreviated financial highlights.\n\nWe encourage you to read through our press release issued earlier today for further details. Total net revenues for the second quarter were RMB 23.2 billion or USD 3.5 billion, representing a 13% increase year over year. As we disclosed in our earnings release issued earlier today, beginning in the quarter, we've consolidated revenues from certain value-added game services with our online games operations and rename the category games and related value-added services. We think this is a better depiction of our game businesses ecosystem.\n\nIn addition to online games, we provide a range of tools and services to our users to enhance their overall gaming experience when they play our games such as the CC live streaming service a platform offering various live streaming content with a primary focus on gaming broadcasting and certain game-related merchandise sales. These revenues were previously included under our innovative businesses and others line item. And historical periods have also been adjusted accordingly. Online game operations are still the primary component of this segment accounting for nearly 93% of our total games and related value-added services revenue.\n\nThe ratio is steady with the prior period and same period a year ago. Total net revenues from our games and related VAS were RMB 18.1 billion, up 15% year over year. The growth was primarily due to increased revenue contribution from the launch of new games such as NARAKA: BLADEPOINT and Harry Potter: Magic Awakened and other exciting games such as Fantasy Westward Journey Online. Net revenues from our mobile games accounted for approximately 66% of net revenue from the operation of online games.\n\nYoudao's net revenues were RMB 956 million compared with RMB 1.3 billion from the same quarter last year. The decline was mainly due to the conclusion of Youdao's after-school tutoring services for academic subjects on the China's compulsory K-9 education system, which were previously included in its learning services back in 2021. Net revenues from Cloud Music were RMB 2.2 billion, up nearly 30% year over year. The increase was mainly due to the increased revenues from membership subscription as well as social entertainment services.\n\nNet revenues for innovative businesses and others were nearly RMB 2 billion up 14% quarter over quarter, mainly due to increased contribution from Yanxuan in the second quarter. Our total gross profit margin rose to 55.9% in the second quarter up slightly compared with 54.5% in the second quarter of last year. GP margin for the games and related value-added services was 64.9% The majority of our gross profit in this segment is contributed by online games revenue. The contribution from related VAS is relatively much smaller which carries a lower margin than online games.\n\nTherefore, even with adjustments to our line items, our games and related VAS margin is generally stable with some narrow fluctuations based on the revenue mix of mobile and PC titles, self-developed, codeveloped as well as licensed games. GP margin for Youdao was 42.8%, compared with 52.3% in the same period of last year. The decline was mainly due to the lower revenue proportion from Youdao's learning services, resulting from the conclusion of the after-school tutoring businesses for K-9 academic subjects. Gross profit margin for Cloud Music continues to improve in the second quarter, climbing to a 13% versus 4.1% a year ago.\n\nThe significant margin improvement primarily resulted from strong top-line growth as well as the improved efficiency of our content investment. GP margin for innovative businesses and others was 25.8% compared with 27.3% last year. The decline was mainly due to the result of decreased revenue from higher-margin advertising services. Total operating expense for the second quarter were RMB 8 billion or 35% of our total net revenues.\n\nIf we look at our cost composition in more details, our selling and marketing expenses, as a percentage of total net revenue, compared with 17% for the same period last year. We remain committed to investing in content creation and product development. We are also seeing leverage in our R&D investment. Our other income was RMB 785 million for the second quarter compared with RMB 28 million last quarter.\n\nThe quarter-over-quarter increase was mainly due to the exchange rate of the U.S. dollar against RMB fluctuating over the last couple of periods. Our effective tax rate for this quarter was 22%. As a general reminder, the effective tax rate is presented on an accrual basis and the tax credit deferred from each of our legal entities at different time periods depending on applicable policies and our operations.\n\nOur non-GAAP net income from continuing operations attributable to shareholders for the second quarter totaled RMB 5.4 billion or USD 808 million. Non-GAAP basic earnings per ADS from continuing operations for the quarter was USD 1.23 or USD 0.25 per share. This quarter, we also had RMB 625 million of net income from discontinued operations, which was related to the disposal of the Kaola business. Additionally, our cash position remains strong.\n\nAs of the quarter end, our net cash position was about RMB 88 billion, compared with RMB 86 billion as of the year-end last year. In accordance with our dividend policy, we are pleased to report that our board of directors has approved a dividend of USD 0.072 per share or USD 0.36 per ADS. Lastly, we continued to buy back shares during the period. Under our share repurchase program for up to USD 3 billion, approximately 24 million ADS has been repurchased as of June 30 year for a total cost of approximately USD 3 billion.\n\nMeanwhile, under NetEase Youdao's purchase program for up to USD 50 million, approximately 1.7 million ADS has been purchased for a total cost of about RMB 18 million as of June 30. In addition, NetEase purchased about million ordinary shares of cloud music for a total cost of USD 8 million during the second quarter. Thank you for your attention. We would like now to open the call to your questions.\n\nOperator, let's go to Q&A.\n\nOperator\n\nThank you. [Operator instructions] We will take our first question from the line of Yang Bai from CICC. Please go ahead.\n\nYang Bai -- CICC -- Analyst\n\n[Foreign language] OK. Thank you, management. NetEase has continuously made efforts in the overseas market in recent years and has established several game developers overseas. What is our take on the pace of overseas investments in the future? Also, could you perhaps share some colors on the products in development? Thank you.\n\nWilliam Ding -- Chief Executive Officer\n\n[Foreign language]\n\nMargaret Shi -- Director, Investor Relations\n\nOverseas market is of great importance for NetEase. And as everybody knows that in the past year, we've not received any license approval overall in China. So we have to make the strategic choice to shift some of our R&D resources to the global market, the European markets to the Japanese or the Asian markets. So everybody knows that we have a very strong track record in game production.\n\nWe have very high R&D efficiencies, and we are now working very closely with many overseas developers to find a product that will be welcomed by the global game players. We actually do have a lot of products under development. And hopefully, you will see some of them being introduced to the market very soon. On June 2, everybody saw the success of Diablo that we have listed and I think it's been a very positive, very, very strong release of that game.\n\nThank you.\n\nOperator\n\nLet's take our next questions from the line of Thomas Chong from Jefferies.\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language] Thanks management for taking my questions. We have seen Internet companies highlighting about cost efficiencies, such as staff costs and marketing spending on the back of a global macro headwind these days. Can management share the thought about the outlook, about the operating expenses in sales and marketing, R&D and G&A? Thanks.\n\nWilliam Ding -- Chief Executive Officer\n\n[Foreign language]\n\nMargaret Shi -- Director, Investor Relations\n\nSo it's not -- the question about cutting costs, the question is about optimization of cost. Sometimes, throughout of development operation of our business, sometimes we do have -- we do cut costs in certain areas, but will also increase our investment spend in other areas. So NetEase will continue to optimize the way we spend the cost structure of the company. Only just because the weakness in the macro, it doesn't necessarily mean that we have to take certain actions to address that.\n\nNetEase, we think very long term, and we care about the sustainable long-term growth of the company.\n\nCharles Yang -- Chief Financial Officer\n\nAnd Thomas, it's Charles. Just to add a bit more. As you can see, we've always been very committed in R&D spending over the past couple of years, our head strong -- head count, total head count also remained relatively stable because for us, we think investing into talent, investing into technology is the key competence in us creating the world-class content.\n\nMargaret Shi -- Director, Investor Relations\n\nThank you, Thomas. Next question, please.\n\nOperator\n\nOK, thank you. We will take our next question from the line of Kenneth Fong from Credit Suisse.\n\nKenneth Fong -- Credit Suisse -- Analyst\n\n[Foreign language] Thank you, management for taking my question. What's management view on the domestic regulatory landscape and expectation on the Banhao approval? With a likely lower number of Banhao approved in the future, how will this change our game strategy, including genre IP investment, etc.?\n\nWilliam Ding -- Chief Executive Officer\n\n[Foreign language]\n\nMargaret Shi -- Director, Investor Relations\n\nSo I kind of mentioned that in the earlier question, one of the reasons we have to look abroad and be more active in expanding our user base overseas because of like Banhao in China. And secondly, it kind of tells you -- tells us that we have to value or cherish the domestic market even more because Banhao is a very precious resources now. So every Banhao we get, we have to work putting more effort to make sure every game we develop is launched to the market will be popular, will be welcomed by the game players in China. Thank you.\n\nKenneth Fong -- Credit Suisse -- Analyst\n\n[Foreign language]\n\nOperator\n\nOK, thank you. We will take our next question from the line of Lincoln Kong from Goldman Sachs. Your line is open. Please go ahead.\n\nLincoln Kong -- Goldman Sachs -- Analyst\n\n[Foreign language] So my question is about two game titles. First is on the Infinite Lagrange. So what's the reason behind this title is a popular trend in the recent months? And why we're seeing such a strong expanding MAU growth? And second is on the NARAKA: BLADEPOINT mobile. So from a longer-term perspective, how do we see the potential for the mobile game version? What's our differentiated strategy to penetrate those large DAU based for battle royale game type and especially acquiring the market share from those competitors?\n\nWilliam Ding -- Chief Executive Officer\n\n[Foreign language]\n\nMargaret Shi -- Director, Investor Relations\n\nThe first question is on Infinite Lagrange. So our team actually has strong expertise in violent game for a very long period of time. So Infinite Lagrange has actually in operation for quite a while, we introduced a new version this year and the game player seems to have loved this new version, which means that the content was strong enough to attract a whole new -- whole brand-new set of game players and that gives us confidence that we will be able to continue to expand this category.\n\nWilliam Ding -- Chief Executive Officer\n\n[Foreign language]\n\nMargaret Shi -- Director, Investor Relations\n\nSo yeah, sure. There are a number of large DAU product in the market similar to NARAKA. The reason why we think NARAKA: BLADEPOINT has been so successful is because the user experience it creates is very unique. Experience such as combat experience, free movement in the game.\n\nAnd the reason why in the past that in our competitors or other developers have not been able to create a game like NARAKA is because this game requires very hardcore and cutting-edge technology to deliver that type of user experience. So again, we are -- so we will continue to do various ways to give our users a continued good user experience. Thank you.\n\nLincoln Kong -- Goldman Sachs -- Analyst\n\n[Foreign language]\n\nOperator\n\nOK, thank you. We will take our next question from the line of Alicia Yap from Citigroup. Your line is open. Please go ahead.\n\nAlicia Yap -- Citi -- Analyst\n\nHi. Good morning. Good evening. [Foreign language] Good evening, management.\n\nThanks for taking my question. My question is related to the U.S. ADR delisting risk. So whether management has any comments on your plans for the primary Hong Kong leasing? And if so, what is the rough time frame that we should expect that to happen? And then if management have any latest update that you could share with us regarding discussion status between China and U.S.\n\nand whether the ADR will indeed be delisted from the U.S. exchange? Thank you.\n\nCharles Yang -- Chief Financial Officer\n\nThank you, Alicia, it's Charles. Let me answer your question directly in English. So firstly, we are very closely monitoring the situation. As everyone knows, this is a topic or rather this is a question that's beyond the control of an individual company.\n\nIt is more of a job political issue, but we remain cautiously optimistic that U.S. and China, the two largest countries in the world and the senior leadership, will find the common ground of interest. So we think a kind of a hard landing or decoupling between entirely the Chinese companies. There are over 200 Chinese companies listed in the U.S.\n\nmarket. We really don't think a hard landing or decoupling would take place or rather be accelerated. What we could control, though, is that we are making very proactive preparation in the event or in a hypothetical scenario if that extreme situation happened, then NetEase will be prepared to continue being a listed a liquid asset. As many of you know, we are, in fact, the second Chinese ADR that is being dual listed in Hong Kong back in 2020, although we were -- we are currently a secondarily listed status on the Hong Kong Stock Exchange.\n\nThe conversion between secondary listing to primary listing is more of a technical paperwork or in a joking way, it's more of a lawyer's work there's no barrier or there's no roadblocks per se and the preparation work, some of them has been undergoing for a while by us. We think if the situation requires the conversion will be a very swift and smooth process.\n\nAlicia Yap -- Citi -- Analyst\n\nThank you, Charles.\n\nOperator\n\nOK, thank you. We will take our next question from the line of Natalie Wu from Haitong International.\n\nNatalie Wu -- Haitong International Securities -- Analyst\n\n[Foreign language] Let me translate myself quickly. So good evening. Thanks, management for taking my question. Congratulations on a very strong quarter.\n\nMy question is related with the recent World of Warcraft mobile game rumor. Just heard that collaboration has been halted. So I just wanted to make sure if this is an independent effect or should we be concerned regarding company's future relationship with Blizzard, especially after the Microsoft deal next year? And secondly, very quickly follow up with the Infinite Lagrange mobile game. I was just wondering if the majority of the recent incremental user of booking is generated through the back desk game publisher player initiatives? And if yes, how should we think of the related margin profile? Thank you.\n\nWilliam Ding -- Chief Executive Officer\n\n[Foreign language]\n\nMargaret Shi -- Director, Investor Relations\n\nLet me translate the answer to the first question. So Natalie, like you said, the case on World of Warcraft is the independent one. So our relationship with Blizzard has been very good. And I keep seeing recently, we codeveloped and co-published Diablo on world stage and achieved very positive results.\n\nCharles Yang -- Chief Financial Officer\n\nYeah, Natalie, for your second question on Infinite Lagrange, the answer is -- the short answer is that we -- from time to time, we continuously monitor and explore what we think are effective ways of user acquisition and marketing doing among many others is a conducive marketing channel for certain type of games, maybe not all. For Infinite Lagrange, it works for certain types of marketing spending. But all in all, when we look at overall margin profile of a game, obviously, we factor in a lot of considerations, marketing channels, marketing expense being one. But the success or rather the increasing popularity and success of Infinite Lagrange, I don't think it's only dependent on one single source of marketing channel.\n\nIt played a role, but I think more importantly, the success is underscored by the continuous expansion packs, in particular, the expansion packs that we released in the second quarter was particularly effective.\n\nNatalie Wu -- Haitong International Securities -- Analyst\n\nGot it. Very clear. Thank you.\n\nOperator\n\nOK, thank you. We will take our next question from the line of Charlene Liu from HSBC.\n\nCharlene Liu -- HSBC -- Analyst\n\nThank you. [Foreign language] Thank you, management for giving me the opportunity to ask a question. We understand that the app is off to an excellent start, recording amazing download and gross billing figures. How would the management evaluate the app performance so far? And what are your expectations on the longevity of the game? Also what are the key KPIs would you be tracking mainly? Thank you very much.\n\nWilliam Ding -- Chief Executive Officer\n\n[Foreign language]\n\nMargaret Shi -- Director, Investor Relations\n\nDiablo has achieved very prominent results on a worldwide stage. And it's a very strong MMO game, and like we've done with our -- many of our legacy games. We will continue to issue strong content, good expansion packs to serve our global game players as well. Thank you.\n\nNext question, please.\n\nOperator\n\nWe will take our next question from the line of Alex Poon from Morgan Stanley.\n\nAlex Poon -- Morgan Stanley -- Analyst\n\n[Foreign language] My question -- I have two questions. My first question is related to the monetization design between overseas titles and domestic titles. When Diablo was initially released, we saw some comments from U.S. gamers saying the game design is a bit over monetization.\n\nSo in future, when we design mobile games, are gamers going to get used to this kind of monetization? Or we need to adjust our monetization system to be a little bit lighter? My second question is related to the performance of NARAKA: BLADEPOINT on Xbox after its release in June and the time line for PS5 and other platforms in the future? Thank you.\n\nWilliam Ding -- Chief Executive Officer\n\n[Foreign language]\n\nMargaret Shi -- Director, Investor Relations\n\nSo our product is designed to provide strong user experience for all players. We are not targeting only those who pay a lot of money in the game, we want to serve all of our players at all levels equally well. So there are many of my friends globally who have hosted -- they've had a great time playing Diablo without having to spend much money. And it is true, there are many cultural differences, player differences in different regions around the globe, and we will endeavor to provide great experience to players in every country, every region of the world.\n\nWilliam Ding -- Chief Executive Officer\n\n[Foreign language]\n\nMargaret Shi -- Director, Investor Relations\n\nOK. Like we mentioned in our prepared remarks, we -- NARAKA: BLADEPOINT was launched on Xbox and we joined Xbox Live, which brought us a lot of incremental users, particularly console game players. And in terms of PlayStation 5, we're looking at a launch around end of this year or early next year. Thank you.\n\nThank you very much. I think that ends our call. Operator?\n\nOperator\n\nOK. Due to time constraint that concludes today's question and answer session. I will turn the conference back to Margaret Shi for any additional or closing remarks.\n\nMargaret Shi -- Director, Investor Relations\n\nThank you once again for joining us today. If you have any further questions, please feel free to contact us directly or TPG investor relations. Have a great day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMargaret Shi -- Director, Investor Relations\n\nCharles Yang -- Chief Financial Officer\n\nYang Bai -- CICC -- Analyst\n\nWilliam Ding -- Chief Executive Officer\n\nThomas Chong -- Jefferies -- Analyst\n\nKenneth Fong -- Credit Suisse -- Analyst\n\nLincoln Kong -- Goldman Sachs -- Analyst\n\nAlicia Yap -- Citi -- Analyst\n\nNatalie Wu -- Haitong International Securities -- Analyst\n\nCharlene Liu -- HSBC -- Analyst\n\nAlex Poon -- Morgan Stanley -- Analyst\n\nMore NTES analysis\n\nAll earnings call transcripts"
}