{
  "companyName": "Shoals Technologies Group, Inc.",
  "companyTicker": "SHLS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/shoals-technologies-group-inc-shls-q2-2022-earning/",
  "content": "Shoals Technologies Group, Inc. (SHLS 0.86%)\nQ2 2022 Earnings Call\nAug 15, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the Shoals Technology Group Inc. second quarter 2022 earnings conference call.\n\n[Operator instructions] And the conference is being recorded. [Operator instructions] I would now like to turn the conference over to Mehgan Peetz, general counsel. Please go ahead.\n\nMehgan Peetz -- General Counsel\n\nThank you, operator, and thank you, everyone, for joining us today. Hosting the call with me are CEO Jason Whitaker; and interim CFO Kevin Hubbard. On this call, management will be making projections or other forward-looking statements based on current expectations and assumptions, which are subject to risks and uncertainties. As you listen and consider these comments, you should understand that these statements including the guidance regarding full year 2022 are not guarantees of performance or results.\n\nActual results could differ materially from our forward-looking statements if any of our assumptions are incorrect or because of other factors. These factors include, among other things, the risk factors described in our filings with the Securities and Exchange Commission, as well as economic and market circumstances, industry conditions, company performance and financial results, the COVID-19 pandemic, supply chain disruptions, availability and price of our components and materials, project calculation, decreased demand for our products and policy and regulatory changes. Although we may indicate and believe that the assumptions underlying the forward-looking statements are reasonable, any of the assumptions could prove inaccurate or incorrect and therefore, there can be no assurance that the results contemplated in the forward-looking statements will be realized. We caution that any forward-looking statement included in this discussion is made as of the date of this discussion and do not undertake any duty to update any forward-looking statements.\n\nToday's presentation also includes references to non-GAAP financial measures. You should refer to the information contained in the company's second quarter press release for definitional information and reconciliations of historical non-GAAP measures to comparable financial measures. With that, let me turn the call over to Jason.\n\nJason Whitaker -- Chief Executive Officer\n\nThank you very much, Mehgan, and good afternoon, everyone. I'll start off by providing a snapshot of our second quarter performance, followed by an update on our growth initiatives and then wrap up with our take on recent developments in the U.S. solar market. I'll then turn it over to Kevin, who will provide an overview of our financial results.\n\nWe delivered record revenue and gross profit in the second quarter, which grew 23% and 9% year over year, respectively, despite the significant challenges and uncertainties facing the industry. To put some perspective on that statement, this quarter represents the sixth consecutive quarter where Shoals has delivered record year-over-year quarterly revenue and gross profit. Gross margin in the quarter was 38.9%. Gross margin was lower this quarter than last year because the second quarter of 2021 benefited from an exceptionally high mix of BLA sales relative components whereas this quarter was more in line with our historical mix.\n\nWe also had higher raw material and logistics costs as a percentage of sales this quarter than the prior year. Adjusted EBITDA increased sequentially but declined slightly year over year, reflecting our continued investment in SG&A to support our growth initiatives. We're beginning to see a return on these investments and expect the year-over-year rate of growth in our SG&A to slow in Q4 of this year. Demand for our products remains very strong, and we ended the second quarter with record backlog and awarded orders of $327.2 million an increase of 63% year over year and 8% sequentially.\n\nBacklog and awarded orders have grown even further in Q3 and are expected to continue expanding through the remainder of the year. Components revenue increased 97% year over year, driven by increases in shipments of battery storage products, as well as shipments of solar products to a significant number of new customers. New customers projects are typically designed to timeline systems and they generally start the relationship with Shoals by buying components that will work with these types of systems. Re-fixing the performance, quality, reliability, installation savings and customer service that Shoals offers, they become open to trying our combine-as-you-go architecture and buy the BLA.\n\nOnce customers make the transition, this usually marks the start of a long-term relationship. System Solutions revenue grew 11% year over year as a result of continued strong demand for BLA and market share gains. During the quarter, we converted four additional EPCs and developers to our System Solutions and had 29 adds in Q2, representing a greater than sevenfold increase in the number of BLA customers since the time of our IPO last year. Customer interest in our recently introduced products continues to grow with our management battery storage and EV charging products experiencing the greatest demand.\n\nWe continue to ramp our production with our new wire management products to meet customer demand. To provide more context, backlog and award orders for wire management products increased more than three folds since the beginning of the year. While these products are relatively small contributors to revenue, they carry high gross margins and add to our profitability. Sales of our energy storage products also contributed to revenue growth in the quarter, and backlog in that part of our business continues to grow.\n\nWe are on track to complete the certification process for our BLA 2.0 and high-capacity plug-and-play harnesses in the second half of the year. We expect these products to further accelerate our growth as BLA 2.0 will have a higher average selling price per megawatt than our current products and the high-capacity plug-and-play owners will allow us to serve a new and fast-growing application. We also continue to make strides in our international expansion. More recently, subsequent to quarter end, we announced that we have successfully transitioned the customer to BLA in Honduras.\n\nThis is an excellent proof point given Honduras is a low-cost labor market and provides a powerful endorsement of the benefits of our existing brands, even in areas where skilled labor is less expensive than in the U.S. and Europe. BLA can reduce labor costs, improve safety, increase reliability and reduce maintenance expenses. In Europe, our products are fully qualified, and our sales team remains focused on building pipeline and converting that pipeline into backlog.\n\nWe're also beginning to see further traction in the international markets resulting from the bad administration support of export, import bank financing. Now turning to our EV business. Customer demand is exceeding our expectations, and we're seeing rapid order growth largely due to the team's progress with commercial fleets and Scopus operators. We've recently completed UL certification for many of our products and expect the balance to be certified by the end of the year.\n\nDuring the quarter, we received orders for complete charging systems for commercial fleets that are transitioning to electric vehicles. Those orders represent our first sales of charging system solutions and a key milestone in the commercialization of our EV product line. Prior to this quarter, we had only sold components. We also received our first orders from school bus electrification customers who are attracted to reportability and ease of installation of our AV charging products.\n\nDemand from this segment is accelerating following the EPA's $5 billion clean school bus program announced in May. Now I'll take a moment to talk about the recent positive developments in the solar market. The beginning of the quarter was marked by delays and uncertainty caused by the U.S. Department of Commerce's investigation of an AD/CVD claim on solar cells and panels supplied from certain Southeast Asian countries.\n\nA significant portion of the uncertainty was alleviated when the White House announced a two-year tariff exemption for solar panels. Our conversations with customers indicate that the tariff safe harbor created by President Biden's executive action was an important turning point in customer sentiment. And we've seen projects that have been delayed or placed on hold stood back up. While we cannot quantify the full impact of the recently passed inflation reduction as yet, we see it as a tremendous positive for the market.\n\nThe increase and extension of the [Inaudible] coupled with new incentives for storage NAVs should accelerate demand for our products. Although how much and how fast is something we don't know yet. We have done a lot of work since the beginning of 2021 to position Shoals to succeed in the challenging and uncertain landscape faced by the solar industry in the first half of this year, and we think the strong performance of the company reflects that. Now that many of those headwinds are abating, we see the potential for upside to our market expectations.\n\nThe low capital intensity and flexibility of our manufacturing process allows us to adjust rapidly to changes in demand. We are well-prepared to meet increases in demand as the production ramp at our new facility is ahead of schedule. And despite the tight labor market, we expanded our manufacturing headcount, adding more than 100 hourly teammates in the second quarter. It will be essential as we continue to scale our production.\n\nFinally, I'm excited to welcome Dominic Bardos as our new chief financial officer. Dominic brings over 30 years of global finance and accounting experience across multiple industries, including automotive, retail and industrial services. Dominic is currently the CFO of Holley, a publicly traded designer, marketer and manufacturer of out performance products for car enthusiasts. Dominic will start at the beginning of the fourth quarter, and we're excited to have him on board.\n\nKevin has done a tremendous job leading the finance team. Prior to stepping in as our interim CFO, Kevin was a longtime consultant to our company, and he will continue to support us in that capacity as Dominic transitions into our organization. I'm also pleased to announce the addition of Jeannette Mills and Robert Julian to our board of directors. Jeannette and Robert are both seasoned executives with a proven track record of successful corporate governance and leadership across a range of functions and industries.\n\nJeannette will be replacing Peter Jonna, who resigned from our board concurrently with Jeannette joining. I want to thank Peter for his service and valuable contributions to Shoals as a director, and welcome Jeannette and Robert on board. We are excited about the benefits that Jeannette and Robert's significant experience can bring to our company. Now I'll turn it over to Kevin, who will discuss our second quarter 2022 financial results.\n\nKevin?\n\nKevin Hubbard -- Interim Chief Financial Officer\n\nThank you, Jason. For the second quarter, revenue grew 23% versus the prior year period to $73.5 million, driven by increases of 11% in System Solutions and 97% in Components. Similar to the last quarter, the strength in Components' revenue was driven by the combination of battery storage shipments, as well as the on boarding of a significant number of new customers, which can initially lead to more of a component level opportunity as we work toward converting them over to our System Solutions. Growth in System Solutions reflects strong demand for Shoal's combine-as-you-go system.\n\nSystem Solutions represented 77% of revenue in the quarter versus 86% in the prior year period and 69% in the prior quarter. Gross profit increased 9% to $28.6 million, compared to $26.2 million in the prior year period. Gross profit as a percentage of revenue was 38.9% compared to 43.8% in the prior year period. As Jason mentioned, the decrease in gross margin year over year was partially a function of Q2 2021, having a particularly high proportion of BLA sales relative to components, while Q2 2022 was more in line with our historical mix.\n\nWe also had higher raw material and logistic costs as a percentage of sales this quarter than in the prior year. Second quarter general and administrative expenses were $13.3 million, compared to $10 million during the same period in the prior year. This change was primarily a result of higher stock-based compensation, planned increased payroll due to higher headcount to support our growth and product initiatives and new public company costs. Adjusted EBITDA for the second quarter was $19.8 million, compared to $20.6 million for the prior year period.\n\nAs we have discussed previously, we expect adjusted EBITDA to grow at a slower rate this year, reflecting the pull-forward of several investments to support our multiyear growth outlook and growth initiatives over the next several years. We remain confident that the substantial growth we are experiencing will support expansion in our adjusted EBITDA margin, as we get leverage on SG&A exiting this year. Adjusted net income was $11.8 million in the second quarter, compared to $14.7 million in the prior year period. Please see the adjusted EBITDA and adjusted net income reconciliation tables in our second quarter press release for a bridge to our GAAP results.\n\nAs of June 30, 2022, backlog and awarded orders were $327.2 million, representing a new record for the company and an increase of 63% and 8% versus the same time last year to March 31, 2022, respectively. The increase in backlog and awarded orders reflects continued robust customer demand for Shoal's products. Turning to our full year outlook. Based on the current market conditions and input from our customers and team, we are reaffirming our previous guidance and expect 2022 revenue to be in the range of $300 million to $325 million, up 41% to 52% year over year.\n\nWe expect adjusted EBITDA to be in the range of $77 million to $86 million and adjusted net income to be in the range of $45 million to $53 million. Further, we expect 2022 capital expenditures to be in the range of $7 million to $8 million. In addition, at the midpoint of our outlook, we currently expect to generate 45% to 50% of our second half revenue, adjusted EBITDA and adjusted net income in the third quarter. Now back to you, Jason, for closing remarks.\n\nJason Whitaker -- Chief Executive Officer\n\nThanks, Kevin. I'd like to close by thanking all of our customers for their commitment to Shoals, our employees for their contributions to our company's success and our shareholders for their continued support. The first half of 2022 is off to a strong start, and we'll not be facing many of the headwinds we confronted in the first and second quarters in the second half of this year. That, together with strong demand for solar and EVs, the success of our new products and sales initiatives and the tremendous strength of our core BLA products gives us optimism for what we can achieve for shareholders in the coming quarters.\n\nAnd with that, thank you, everyone, and I appreciate your time today. We will now open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Brian Lee of Goldman Sachs. Please go ahead.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nHey, guys. Good afternoon. Thanks for taking my questions. I guess the first one was just -- you talked about the backlog and awarded orders growing here into 3Q and then expecting it to expand through the rest of the year.\n\nMaybe, Jason, can you give us a sense of what type of growth you're speaking to, if there's any way to quantify that? And then how you typically think about backlog coverage at this point in the year? We're sitting in mid-August as you sort of start to think ahead to the growth for 2023, like where is the typical level you'd hope to be at in terms of coverage levels as you think about the potential for revenue growth in the out year? Then I have a follow-up. Thank you.\n\nJason Whitaker -- Chief Executive Officer\n\nYeah. No problem, Brian. Good to speak with you today. So when you look at backlog and the world orders as we've talked about in the past, right, our goal is for that always to continue to increase quarter over quarter.\n\nAs we've also discussed, if there can be some seasonality there, we've not experienced that in the not-so-distant past. But very excited about what we're able to accomplish in Q2, especially considering the headwinds that we had in front of us prior to the announcement of the -- or the two-year tariff exemption on solar panels. And what I can tell you is that since that point, our customers have indicated that was definitely a turning point when you look at customer sentiment and the fact that we have started to see our order patterns normalize as a result of that. Not to mention the recent announcement of the IRA is definitely accelerating that as well.\n\nBut as of exact specifics right now, Brian, we've got nothing to share today on that.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nOK. Fair enough. And then I guess, on the margin targets here. I appreciate the additional color.\n\nIt seems like the full year guidance implies that you're going to be at like 26% or so adjusted EBITDA margin level for the second half of the year. I think in the past, you've talked about sort of 30% plus as being the right sort of target range for the company. So as you think about the pull forward in these investments, how quickly should we see those translate into returns? Is this something where you get back to that 30% level in the first half of '23? Or is this going to take longer than that maybe even into the middle part or second half of next year? Thanks, guys.\n\nJason Whitaker -- Chief Executive Officer\n\nYeah. Brian, when you take a look at the margin profile, as we talked about, the growth that we saw in the backlog and awarded orders throughout the first part of this year, that's also continued this trend is very much pointed toward our full System Solutions, specifically BLA. And as we talked about, our BLA did carry a higher-margin profile, as a matter of fact. As we mentioned in our prepared remarks, if you look at 2Q a year ago, where we generated north of 80% of our revenue from System Solutions that resulted in gross margins of almost 44%.\n\nSo as we continue converting customers over to our full system BLA solution, we expect our mix to continue and ultimately to improve and drive gross margins north, which is a flow through all the way to the bottom. And as we look at the SG&A investments, as we also mentioned, we do expect to start gaining leverage on that as we move throughout the latter part of this year moving into the beginning of May. So very excited about what we've been able to accomplish specifically on the core system BLA solution side of things.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nOK. Thanks a lot. I'll pass it on.\n\nOperator\n\nOur next question comes from Philip Shen of ROTH Capital. Please go ahead.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nGuys, thanks for taking my questions. First one is on the Inflation Reduction Act. I know you just talked about how things are accelerating. If there's any way you can quantify how the IRA is impacting business to the upside, that would be interesting, especially on the quoting front.\n\nAnd then also, can you talk to what the IRA benefits might be for you guys? Unlike some other manufacturers, it seems like you don't have necessarily a manufacturing production tax credits and maybe the key benefit is the 30% ITC benefiting your customers along with the bonus ITC adders. But I was wondering perhaps if we missed something and if there's something else that you see that maybe in the EV business or elsewhere that ultimately benefits you guys? And if you can quantify that, it would be great. Thanks.\n\nJason Whitaker -- Chief Executive Officer\n\nYeah. No problem at all, Phil. So as you can imagine, I think a lot of people would share the sentiment. We're very excited about the prospects that Inflation Reduction act creates for the industry as a whole.\n\nAnd I would say it's actually arguably probably one of the most impactful pieces of legislation that the solar industry has ever received thus far. And we've already started having customers reach out to us talking about domestic manufacturing and the like. I think a couple of things I want to point out, Phil, is when you look at the impact from prevailing wage, that will essentially continue to increase the value of our manufacturing process and the savings that we're able to provide versus labor in the field. Not to mention stand-alone IP food for storage is definitely a tailwind when you look at our storage offering.\n\nAnd on the EV side, the tax credit was reinstated. I think they actually removed the 200,000-unit cap coupled with about $3 billion being provisioned toward electrifying the USPS fleet. And obviously, that's going to require a lot of infrastructure. When you look at -- as you mentioned, right, when you look at some of the provisions that are out there, I mean, there's a lot of provisions for pound manufacturers, steel components, inverters and the like.\n\nBut what I do want to point out is the detailed appropriations are really yet to be defined. And I think there still is an opportunity for us here. But regardless, as I said before, it is a huge positive for the industry as a whole, especially with us being a domestic manufacturer.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nThanks. Thanks, Jason. My second question is on the U.S. LPA detention situation.\n\nThe detentions have been going on since the end of June for some companies, some key companies. If that situation sustains, do you see any downside risk for your back half revenue? Or do you think you're fully insulated from that situation? And if anything, if that U.S. LPA situation resolves earlier than expected, there could actually be some upside to your back half numbers? Thanks.\n\nJason Whitaker -- Chief Executive Officer\n\nYeah. I think, Phil, as we've talked about before, our bottoms-up analysis gives us comfort in being able to reiterate guidance today. Look, I don't want to discount U.S. LPA at all, but the effect of it, we're not really seeing directly.\n\nAnd what I mean by that, Phil, is we still continue to support what I would call multiple EBOS designs throughout the optimization projects. And that's something that has been increasing, but it hasn't really come into effect as a result of U.S. LPA. It was really driven more, I think, based upon what it transpired in the past with WRO and some of the AD/CVD things.\n\nAnd I think the work that the industry as a whole has done has so far allowed most of the projects to move ahead without any particular delay. So not seeing any direct changes in the industry as a direct result of U.S. LPA at the moment.\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nGreat. Thanks. I'll pass it on.\n\nOperator\n\nOur next question comes from Maheep Mandloi of Credit Suisse. Please go ahead.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nHey, good afternoon. Maheep Mandloi here from Credit Suisse. One question just on the mix of where we saw strong growth in the components in Q2. Could you talk about what drove that? And should we expect a similar mix for the second half in '22 for you guys?\n\nJason Whitaker -- Chief Executive Officer\n\nYeah, Maheep, Jason here. So as we've talked about in the past, over time, our expectation is that components will stabilize and it is to be relatively flat from an absolute dollar perspective. A couple of things to consider as we bring in new projects, they're typically designed as homework systems. And so our relationships with new customers start off with them buying components that will increase their ability to work in that type of infrastructure.\n\nAnd as I pointed out before, throughout the first part of the year, as it has continued, we've seen very strong growth in our backlog and awarded orders that's really driven by the BLA side of things, it does create a higher-margin profile. So that in combination with the fact that in Q2 of '21, we had an outsized quarter for full System Solutions compared to components this year, we do expect that with the backlog and awarded orders containing a meaningful amount of BLA itself, that will ultimately continue to grow as components start to remain relatively flat.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nAnd just on the cash position here. You said a little big quarter with $10 million here. Can you talk about the cash -- you said the growth in the second half, how should we think about it? And new working capital issues you foresee in case the U.S. LPA issued a contract down the line?\n\nKevin Hubbard -- Interim Chief Financial Officer\n\nYeah. Yeah, this is Kevin. Working capital, I mean, certainly, we built some cash during the quarter, and we used it to pay down debt. As we really start to look at third quarter and fourth quarter, we see our inventory starting to flatten out a little bit as we come out of Q3 and into Q4.\n\nAnd then working capital needs should stabilize a little bit. But keep in mind, as we continue to accelerate growth, we're going to be a user and use cash during some quarters and borrow cash some quarters. So we're going to see some variability in that.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nAnd then just a follow-up, can you remind us of the liquidity you have on hand right now?\n\nKevin Hubbard -- Interim Chief Financial Officer\n\nWell, as of June 30, we had $10 million in cash. And we had, I think, about $75 million on the revolver available.\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nGreat. Well, I'll take the rest off-line. Thank you.\n\nOperator\n\nOur next question comes from Colin Rusch of Oppenheimer. Please go ahead.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThanks so much, guys. Can you talk a little bit about the competitive environment and any sort of new entrants or evolution of that backdrop that you're seeing here just in the last few weeks?\n\nJason Whitaker -- Chief Executive Officer\n\nYeah. So when you look at the competitive landscape in general, right, it really remains very similar to what we've talked about in the past. Still not seeing any meaningful competition coming in the form of our EV System Solutions. And the competitive landscape still really remains the same on the solar side.\n\nSo I've not seen any changes in that in the past or even as the most recent since the announcement of the IRA.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nExcellent. And then when you look at your backlog, are you able to break out how much of it is coming from the EV side? Or is that 100% solar?\n\nJason Whitaker -- Chief Executive Officer\n\nSo it's definitely not 100% solar. At this point, we're not breaking out backlog specifics, whether it be new products or new segments like EV or even international. But what I can say is we're very, very excited about what we've been able to accomplish on the e-mobility side of things. And when you consider we just literally released out that product offering, definitely ahead of plan based upon the sales team going after the electrification of fleets, as well as the school bus incentives that are out there.\n\nSo again, e-mobility continues to increase, as well as we talked about not only new products in the form of wire management that's already been released out, as well as the storage side of things.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nOK. Thanks so much, guys.\n\nJason Whitaker -- Chief Executive Officer\n\nThanks, Colin.\n\nOperator\n\nOur next question comes from Joseph Osha of Guggenheim Partners. Please go ahead. \n\nHilary Cauley -- Guggenheim Partners -- Analyst\n\nHello. So this is actually Hilary on for Joe. And most of my questions have been answered. So just one thing I kind of wanted to touch on, and that was the international markets, particularly as you continue to gain traction.\n\nYou had the Honduras project announced this quarter, but I was just hoping you could give us some color on when we might start to see the international markets start to account for a larger share of the business? And any color you could share there would be great. Thank you.\n\nJason Whitaker -- Chief Executive Officer\n\nAbsolutely. So as you mentioned, right, and we touched back on our prepared remarks, just recently awarded a BLA opportunity in Honduras, which just further solidifies the value that our product brings when you look at not only the labor side of things, but also quality, reliability, O&M over the life of the asset. From your perspective, our products, as we've talked about in the past, are fully qualified, and our sales team's focus today is really continuing to build up that pipeline and we focus on converting that pipeline over to backlog, which the group is doing as well. And we're also seeing, I want to mention further traction in the international markets as a direct result of the Biden administration support of export import bank financing.\n\nAnd as you do, look, although we're not working out exact specifics right now but as we continue to gain further traction on expanding our international side of things and other growth initiatives, we do expect our business to become more diversified geographically speaking over time.\n\nHilary Cauley -- Guggenheim Partners -- Analyst\n\nGreat. Thank you. That's all I had.\n\nOperator\n\nOur next question comes from Kasope Harrison of Piper Sandler. Please go ahead.\n\nKasope Harrison -- Piper Sandler -- Analyst\n\nGood afternoon, everyone. Thanks for taking the questions. Maybe just a follow-up on Maheep's question. As you move beyond 2022 and you think about just this business structurally '23 and beyond, how do you think about just the cash? What's like a good cash conversion cycle for Shoals on a consolidated basis?\n\nKevin Hubbard -- Interim Chief Financial Officer\n\nYeah. When we think about -- just looking forward and where we're at on our free cash flow, right, certainly, we consider a couple of things. We look at our -- PP&E purchase is really the other thing that we're obligated to is our distribution for the noncontrolling interest. So from that perspective, the cash cycle really moves forward, and we expect to gain leverage on that and we really see a debt paydown from it as we go through the third quarter and the fourth quarter.\n\nKasope Harrison -- Piper Sandler -- Analyst\n\nOK. And just maybe not necessarily just with the second half of the year, but as you move beyond the second half, what do you think that number looks like? Is it 100, 70? Just any ballpark would be helpful.\n\nKevin Hubbard -- Interim Chief Financial Officer\n\nYeah. I think when we think about that, just moving forward in 2023, I don't think we've looked that far, but we'd have to get back to you on that question.\n\nKasope Harrison -- Piper Sandler -- Analyst\n\nFair enough. And then just a follow-up on the EV product. Congrats on the launch. Just wondering when you expect to see a meaningful pickup in orders to the point that maybe you might consider disclosing the proportion of your backlog that's associated with that new business? Just when do you expect to gain significant momentum in the EV business.\n\nJason Whitaker -- Chief Executive Officer\n\nYeah. I mean, again, very happy and excited about what we've been able to accomplish in the short term. Again, we're well ahead of plan based on our product offering. And I think it just solidifies the opportunity ahead when you look at the amount of infrastructure has to be put in place.\n\nAnd you look at the significant amount of savings that we're able to offer while increasing reliability at the time of install. As with anything else, when you look into the benchmark, once we gain additional traction and a little more stability, it's something that we're definitely considering breaking out. But as of right now, we're not doing that today.\n\nKasope Harrison -- Piper Sandler -- Analyst\n\nFair enough. And just a quick housekeeping question. How should we think about the mix of systems to components for the second half of the year?\n\nJason Whitaker -- Chief Executive Officer\n\nWe've not released out a number. But again, what I can say is that a meaningful portion of the backlog and awarded orders that were booked at the beginning of this year comes in the form of our full System Solutions, specifically BLA. And that trend literally continues to grow as we speak. So we would expect the BLA side of things to become a more outsized contributor as we move throughout Q3 and Q4 and even in the start of beginning of next year.\n\nKasope Harrison -- Piper Sandler -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nOur next question comes from Jeff Osborne of Cowen and Co. Please go ahead.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nHey, Jason, I had two quick questions following up on Phil's question on the U.S. LPA. I was just curious with any of the new orders that you've received in recent weeks since the June 6 announcement from President Biden? Are anyone delaying orders or dictating that the orders are contingent upon clearing customs. So I'm just trying to understand sort of the mechanics with the potential uncertainty there? Is that leading to a little bit of a role or no?\n\nJason Whitaker -- Chief Executive Officer\n\nYeah. No. Great question, Jeff. Good to speak with you again.\n\nFrom a U.S. LPA perspective or just in general, we're not seeing any orders that are delayed as a result of that, not standing solar orders that cancel as a result of that. So as I kind of mentioned before, we're not really seeing any, what I would call, direct impacts that you can attribute specifically to U.S. LPA today.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nGot it. And then what are lead times? You mentioned 100 additional staff with the expansion that's running out of time. Can you remind us like what lead times were when you were constrained in the past and what those are now or what you anticipate they'll be for BLA and --\n\nJason Whitaker -- Chief Executive Officer\n\nI mean, lead times do vary depending upon exactly where that project is at. I mean we've not released out any exact lead-time value because it does vary so much project to project. I mean, for example, Jeff, I mean you look at things as simple as one of the subcomponents as an entry to BLA side of things, maybe a connector, right, which is a meaningless portion from a COGS perspective. But when you have a panel manufacturer itself that has mated itself to a specific connector, we have to consume that mating portion of that connector, which can drive lead time.\n\nSo it really does vary quite a bit. But again, you are pointing back to the additional team members that we're able to add. Very, very, very happy to have them on board, and that continues to grow as we continue on throughout the year, I'm very excited about the plan that the company as a whole set forth to be able to accomplish bringing those team members on and look forward to what we're able to accomplish in subsequent quarters.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nGood to hear. And just very quickly, is there any transition from your customers with the 2.0 version coming out? Like any trainings or getting up to speed with that that might be something to watch in the coming months?\n\nJason Whitaker -- Chief Executive Officer\n\nYeah. So we are having some initial conversations, but we haven't released yet a full product launch. But yeah, I definitely would stay tuned as to how that progresses in the coming month, yeah.\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Brett Castelli of Morningstar. Please go ahead.\n\nBrett Castelli -- Morningstar -- Analyst\n\nYeah. Hi. Maybe just staying on the BLA 2.0. Just I think you mentioned in the prepared remarks that that would maybe have a higher average selling price on a $1 per megawatt.\n\nWas wondering if you could maybe quantify that any more?\n\nJason Whitaker -- Chief Executive Officer\n\nYeah. We haven't given any exact figures out as of yet regarding BLA 2.0. But again, when you stand back and you see that the product that we're bringing to market is -- it does incorporate additional features into the product itself. So with those features itself are going to come additional increase and ultimately allow us to have a higher potential revenue per instance, which ultimately equates $2 per megawatt.\n\nSo in doing that that also provides additional value that we're going to be able to treat back to our customer in the form of effect when they deploy our product itself, coming with that feature self -- coming with the features that we're building into the BLA 2.0 will also allow them to catch an additional savings of labor in the field simultaneously.\n\nBrett Castelli -- Morningstar -- Analyst\n\nOK. And then on the EV charging side, can you remind me, is your product there focused more on the Level 2 or AC market or on more the fast-charge DC market?\n\nJason Whitaker -- Chief Executive Officer\n\nMuch like all of our different product lines that are out there, whether you're talking about solar, storage or EV, we're really agnostic technology. When you look at the sites that we continue to work on and we serve and are in production on, they're really a combination of both Level 2 and Level 3 or DC fast chargers. So it really depends on the site specifics and we can work with all the configurations.\n\nBrett Castelli -- Morningstar -- Analyst\n\nThanks, Jason. That's all I had.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMehgan Peetz -- General Counsel\n\nJason Whitaker -- Chief Executive Officer\n\nKevin Hubbard -- Interim Chief Financial Officer\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nPhilip Shen -- ROTH Capital Partners -- Analyst\n\nMaheep Mandloi -- Credit Suisse -- Analyst\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nHilary Cauley -- Guggenheim Partners -- Analyst\n\nKasope Harrison -- Piper Sandler -- Analyst\n\nJeff Osborne -- Cowen and Company -- Analyst\n\nBrett Castelli -- Morningstar -- Analyst\n\nMore SHLS analysis\n\nAll earnings call transcripts"
}