{
  "companyName": "Salesforce, Inc.",
  "companyTicker": "CRM",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/salesforce-inc-crm-q2-2023-earnings-call-transcrip/",
  "content": "Salesforce, Inc. (CRM 0.04%)\nQ2 2023 Earnings Call\nAug 24, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the Salesforce Fiscal 2023 second quarter results conference call. [Operator instructions]. I would like to hand over the conference to your speaker, Mike Spencer, executive vice president of investor relations. Sir, you may begin.\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nThank you, Emma, and good afternoon, everyone. Thanks for joining us today for our fiscal 2023 second quarter results conference call. Our press release, SEC filings and a replay of today's call can be found on our IR website at www.salesforce.com/investor. With me on the call today is Marc Benioff, chair and co-CEO, Bret Taylor, vice chair and co-CEO, and Amy Weaver, chief financial officer.\n\nWe'll also be joined by Brian Millham, president and chief operating officer, who will be available for the Q&A portion of the call. As a reminder, our commentary today will include non-GAAP measures. Reconciliations between our GAAP and non-GAAP results and guidance can be found in our earnings and press release. Some of our comments today may contain forward-looking statements that are subject to risks and uncertainties and assumptions, which could change.\n\nShould any of these risks materialize or should assumptions prove to be incorrect, actual company results could differ materially from these forward-looking statements. A description of these risks and uncertainties and assumptions and other factors that could affect our financial results is included in our SEC filings, including our most recent report on Forms 10-K, 10-Q and other SEC filings. And with that, let me hand the call to Marc.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nWell, hey, thanks, Mike. And thank you, everyone, for being on the call today. As you saw in the results for the quarter, we've delivered really strong revenue growth, profitability and cash flow, showing yet again the resilience and durability of our business model in this economic environment. Revenue in the quarter was $7.7 billion, up 22% year over year or 26% growth in constant currency.\n\nWe had a great quarter, but yet again, the dollar had an even stronger quarter, and we continue to see the impact on foreign exchange and currency fluctuation on our financials. For Q2, we saw approximately $250 million of headwind to revenue, which is roughly $50 million more than we assumed in our guide last quarter, and we now expect a total of $800 million foreign exchange headwind year over year for the full fiscal year. Operating margin in the quarter was 19.9%, and we delivered $334 million in operating cash flow. Our remaining performance obligation or the total undelivered contract value that we have with our customers is really an incredible $41.6 billion, and this is revenue signed.\n\nIt's not yet recognized. Now, turning to guidance. Over the last few months, I've met with hundreds of CEOs, with economists, business leaders, political leaders and other experts about their business and where they see this global economy heading. And I don't think it's going to surprise anyone; everyone has got a slightly different answer.\n\nAnd it doesn't matter who you speak to, could be a different geography, a different position, everybody sees things at a slightly different way right now. But what we do know and what I think everyone will agree on is that digital transformation remains the No. 1 priority for CEOs and that every digital transformation begins and ends with the customer. That's what continues to drive our business forward, and it's why Salesforce is the No.\n\n1 CRM by market share globally, according to the IDC Software Tracker. Now, for those of you who have been on these calls with us, we've all been through a number of these economic cycles. And we've especially seen that over our last 23 years. And once like this come around, we see customers becoming more measured in the way they buy.\n\nSales cycles can get stretched. Deals are inspected by higher levels of management, and all of this, we began to start to see in July. Nearly everyone I've talked to is taking a more measured approach to their business. We expect these trends to continue in the near term, and we reflected this in our guidance.\n\nGiven the significant impact of foreign exchange and buyers being more measured, we're revising our fiscal '23 revenue guidance to $30.9 billion to $31 billion or about 17% growth year over year or 20% in constant currency. At the same time, we're maintaining our fiscal year '23 operating margin guide of 20.4%, an expansion of 170 basis points year over year. This is further evidence that we remain deeply committed to consistent, disciplined margin, cash flow and revenue growth as part of our long-term plan to drive both top and bottom line performance. We have the right team, the right products, the right playbook for getting to $50 billion in revenue in fiscal year '26.\n\nWe always get questions about our M&A strategy and what company we're going to acquire next and what we're going to do next from an acquisition cycle. I think we get this question every single earnings call that we do like this. And it's always one of my favorite parts of the call. And I'm excited to tell you we have found a great cloud company, growing revenue for 73 consecutive quarters through every economic cycle.\n\nIt's got great cash flow, No. 1 market share, an incredible brand, one of the most admired companies in the world, great values, fantastic community of 17 million Trailblazers, fantastic commitment to its community, runs across 90 countries. And that company is Salesforce. We're thrilled that our Board of Directors has authorized up to $10 billion in our first-ever share repurchase.\n\nThis reflects the confidence we have in our business and in our approach to generating shareholder value. Brian Millham is going to expand in more detail about the broader capital allocation strategy in a moment. And you'll also hear about some amazing customer wins in the quarter. I'm especially proud of a major deal we closed in the quarter with the U.S.\n\nDepartment of Veterans Affairs, and it's one of our most meaningful partnerships. The VA is a relationship that we've been building for over 6 years, and now Salesforce is becoming the digital front door for our veterans and their families. We can't be more proud to do our part in helping those who have made sacrifices in serving the nation. It's been an incredible year so far being able to connect with our customers in person again, has been just amazing.\n\nWe've done 63 marketing events so far this year, hosting over 250,000 Trailblazers and counting. But none is more exciting on every level than Dreamforce. And we're hoping to see all of you as we celebrate our 20th Dreamforce, September 20th through the 22nd right here in San Francisco. It's a celebration of our Trailblazers, and we're going to expect 150,000 people to be here and registered to attend.\n\nAnd we'll also be streaming the entire 3 days on Salesforce+ and expect millions more to tune in. We have an amazing line of product announcements and innovations and speakers and giving back. It's going to be a big Dreamforce. It's going to be really the biggest Dreamforce ever, our 20th ever Dreamforce.\n\nAnd we're also going to be celebrating the impact Salesforce has had through our one-one-one philanthropic model as we've now surpassed over $0.5 billion in grants, 7 million hours of volunteerism, and more than 50,000 nonprofits using Salesforce for free. At Dreamforce, the amazing Red Hot Chili Peppers, that's Anthony and his entire band, playing to everyone. They're going to be performing at our annual benefit concert with 100% of the proceeds going to our children's hospitals right here in San Francisco and in Oakland. So please tell your friends, tell your firms, tell your vendors, tell everybody to get sponsorships to Dreamfest because it's going to be incredible.\n\nAnd of course, you're all invited to our investor day during Dreamforce on September 21. Amy, are they invested even if they don't do the Dreamfest sponsorship?\n\nAmy Weaver -- Chief Financial Officer\n\nYeah, Marc, they are invited.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nAll right. Look, you're not going to want to miss it. Look, before handing off to Bret, I'd like to congratulate Brian Millham, our new Chief Operating Officer. Brian is employee No.\n\n13 and has been helping us to build this company from its earlier days. As chief operating officer, Brian is going to continue to lead our customer success organization and now adds global sales to his responsibilities. Bringing our incredible customer success ecosystem, Sales Cloud sales even closer under Brian will help us to deliver the full power of Salesforce to every one of our customers in the new economy. And we're so fortunate that Gavin Patterson has taken on this important new role as Chief Strategy Officer, helping us to guide our strategic direction.\n\nAnd thank you and congratulations to Gavin. I'm so grateful to Gavin who for the last two years during the pandemic has overseen one of Salesforce's most rapid growth periods in Salesforce's history. When I look back at the last three years, I saw it was really only two years ago, in fiscal year '21, when we did, proud, I think it was about $5.1 million -- is that -- $5.1 billion. Is that right, Mike, something like that? And then last year, I think for Q2, we did something like $6.3 billion, and now we're doing $7.7 billion, if I get the numbers right.\n\nI mean, it's an incredible trajectory of growth from over the last 24 months. And I couldn't be more proud of Gavin to help us during that period and now, Brian, in your COO role. Congratulations to Brian and Gavin. And with that, I'm going to turn it over to Bret.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nThanks, Marc. And congratulations, Brian and Gavin. As Marc said, we had another strong quarter delivering strong top and bottom line performance. Our results demonstrate the durability of our business model and the strength of our strategy.\n\nOur Customer 360 product portfolio is the industry standard and the market leader, a leader in 12 current Gartner Magic Quadrant reports. And the platform is helping hundreds of thousands of companies in every industry digitally transform. Our technology is also deeply differentiated. Einstein Artificial Intelligence platform is now doing over 175 billion predictions every day.\n\nJust incredible. Our go-to-market capability is also unmatched in the industry. The diversity of the industries, regions and lines of business we serve has driven the durability and resilience Marc talked about and you've seen in our business over the past 23 years. And finally, our ecosystem is unparalleled in enterprise software.\n\nAs 150,000 Trailblazers joined us for Dreamforce next month, they represent a global community of developers, administrators and ISVs, 17 million strong that are driving what IDC estimates to be $1.6 trillion in new business revenues by 2026. As you heard from Marc, we're in a more measured buying environment. Executive teams are scrutinizing all purchasing decisions, and we are seeing some deals take longer to close. I personally met with over 100 CEOs this quarter in my travels across Latin America, Europe and North America, and digital transformation remains their top priority.\n\nBut the focus of the conversation has shifted meaningfully toward productivity, efficiency and time to value. In this environment, our Customer 360 portfolio is uniquely positioned to enable our customers to deliver both growth and cost savings. And you can see it in this quarter's results. Sales Cloud revenue grew 15% year over year, a healthy 19% in constant currency, including customer wins at CDW, Zscaler, and Schneider Electric.\n\nUsing our Sales Cloud and CRM analytics, Schneider reduced their close time by 30%. And with MuleSoft, they saved 40,000 hours of employees' time and saved $2.7 million in IT costs. Service Cloud grew 14% year over year or 18% in constant currency, including customer wins at the U.S. Department of Veterans Affairs, Workday and Uber.\n\nOur digital service product line, in particular, accelerated as customers pivoted their spend to digital technologies that reduce customer service costs. Uber Eats is a great example. Uber Eats saw a 20% improvement in productivity across email, chat and phone support channels with our service cloud, and more importantly, with their investment in our Einstein AI chat bots, they improved their call deflection by 30%. Our marketing and commerce cloud grew together 17% year over year or 22% in constant currency, including significant expansion of our relationships with Live Nation, L'Oreal and Tapestry.\n\nIn our commerce cloud, we are seeing GMV growth decelerate in line with the rest of the e-commerce industry as consumers settle back down to pre-pandemic norms. Platform, including Slack, grew 53% or 56% in constant currency, including great Slack expansions at organizations like the National Weather Service, Coursera, and Mercado Libre. The National Weather Service selected Slack as its platform to connect over 4,300 employees with emergency managers, public safety decision-makers and local media partners nationwide. I'm also excited to say that we will have over 12 Slack product integrations with our Customer 360 platform live and generally available by Dreamforce, where we have an incredible opportunity to help every one of our customers build their digital HQ and Slack in this new era of flexible work.\n\nData, which includes MuleSoft and Tableau, grew 12% year over year or 13% in constant currency with wins at brands like Atlassian, Siemens Energy, CBRE Group, and King Power, which is Thailand's leading travel retailer. I'm heartened by the progress we're seeing in our go-to-market transformation of MuleSoft. We are on track to have MuleSoft return to be in a tailwind for revenue growth in the back half of the year. And finally, our 12 industry clouds were another bright spot in the quarter, growing faster than our line of business cloud as our customers are increasingly focused on time to value and reducing their implementation costs.\n\nThe out-of-the-box industry processes we've built into our industry clouds are a compelling value proposition in this more measured buying environment, and I'm excited about the new processes we brought to market in the first half of the year, including trade promotion management for consumer goods and our virtual assistant for our Financial Services Cloud. As we head toward Dreamforce, our pace of organic innovation has never been stronger. In our summer release alone, we delivered key innovation like revenue intelligence for predictive forecasting, the ability to talk to your data through Tableau, MuleSoft Robotic Process Automation and a new lakehouse architecture for our customer data platform. And just this week, we launched Salesforce Easy, a new all-in-one self-service suite for sales, marketing, service and commerce that is going to transform how small businesses engage with Salesforce.\n\nAs you'll hear more from Amy, we're committed to durable growth at scale. We're committed to our 20.4% operating margin this year, and I'm excited that we're announcing our first-ever $10 billion share repurchase program today. Our capital allocation strategy is simple. We will continue to expand our free cash flow margin as we scale.\n\nWe will invest in our organic innovation. We will reduce the impact of dilution, both by offsetting stock-based compensation and by maintaining a healthy balance sheet to fund any future M&A. I'm so grateful to our 17 million Trailblazers, all of our partners and most importantly, our employees for helping provide our customers with the innovation, agility and resilience they need to navigate these uncertain times. Now, over to Amy to discuss the financial details of the quarter.\n\nAmy Weaver -- Chief Financial Officer\n\nGreat. Thank you, Bret, and congratulations, Brian. I'm pleased to report strong top and bottom line financial results for Q2. That is pleased to report strong top and bottom line financial results in Q2.\n\nAs you've heard from Marc and Bret, our diversified portfolio remains well positioned to help our customers both grow and drive efficiencies in their business. Our customers are relying on us more than ever to be their trusted advisor, partnering with them on their digital road map. Now, let me walk through our results for Q2 of fiscal '23, beginning with top line commentary. Total revenue for the second quarter was $7.72 billion, up 22% year over year or 26% in constant currency.\n\nFX continued to represent a headwind as the dollar continued to strengthen throughout the quarter. In Q2, the headwind from FX was about $50 million more than we had guided. A few highlights from the quarter. Sales Cloud continues to be a critical piece of our customers' success, helping companies drive more productive growth.\n\nIn Q2, sales cloud grew 15% year over year and 19% in constant currency. Service cloud grew 14% year over year, and 18% in constant currency as we help our customers realize efficiencies and cost savings. As customers focus on their digital strategy and transformation, we continue to see growing multi-cloud adoption due to the number of customers who have purchased 5 or more clouds, again grew in double digits. And Slack continued to outperform our revenue expectations with revenue of $381 million.\n\nSlack continues to gain traction with customers. And in Q2, seven of our top 10 deals included Slack. And for the fifth consecutive quarter, the number of customers spending greater than $100,000 with Slack, grew by more than 40% year over year. Now, for a quick update on data.\n\nI'm pleased to say that data passed $1 billion of revenue this quarter. And with that, all of our 5 clouds are now generating more than $1 billion in revenue a quarter. Data growth of 12% or 13% in constant currency was driven by MuleSoft total revenue growth of 15% and Tableau growth of 9%. As a reminder, approximately half of MuleSoft and Tableau's total contract value is recognized in period, resulting in more quarterly volatility than our other core products.\n\nTurning to revenue attrition. Rates remain at record lows, ending Q2 at approximately 7.5%. Q2 non-GAAP operating margin was 19.9%, driven by our continued focus on disciplined decision-making and prioritization. Q2 GAAP EPS was $0.07 and non-GAAP EPS was $1.19.\n\nMark-to-market accounting of the company's strategic investments benefited GAAP EPS by $0.03 and non-GAAP EPS by $0.04. Operating cash flow was $334 million in Q2, down 13% year over year. Capex was $203 million, resulting in free cash flow of $131 million, down 24% year over year. Now, before getting to our RPO performance and guidance, I'd like to address the current economic environment.\n\nAs both Marc and Bret mentioned, we started to see more measured buying behavior from our customers, which began in the last month of the quarter. This resulted in stretched sales cycles, additional deal approval layers and deal compression. In addition, we saw slowing in our create and close, Slack self-serve and SMB businesses, which tend to be leading macro indicators. Geographically, this behavior was most pronounced in North America and major European markets, while Japan was relatively more resilient.\n\nFrom an industry perspective, retail, consumer goods and communications and media were the most impacted, while high tech, energy and financial services stayed more consistent during the quarter. And from a product perspective, commerce and marketing saw more pronounced decelerations, while sales and service remains strong. Turning to remaining performance obligation, or RPO, which represents all future revenue under contract. It ended Q2 at approximately $41.6 billion, up 15% year over year.\n\nCurrent remaining performance obligation, or CRPO, was approximately $21.5 billion, up 15% year over year and 19% in constant currency. This includes 1 point of incremental FX headwind beyond our Q2 guidance. Moving to Q3 guidance. We expect revenue of $7.82 billion to $7.83 billion, or approximately 14% growth year over year and 18% in constant currency.\n\nThis reflects a $250 million FX headwind. We also expect the $380 million contribution from Slack. As a reminder, Q3 represents the fifth quarter of Slack contributions to revenue. Therefore, the year-over-year growth rates will be normalized.\n\nCRPO growth is expected to be approximately 12% year over year or 15% in constant currency. And we expect GAAP EPS of $0.09 to $0.10 and non-GAAP EPS of $1.20 to $1.21. Now, turning to our full year fiscal '23 guidance. We are now guiding to fiscal '23 revenue of $30.9 billion to $31.0 billion or approximately 17% growth year over year, 20% in constant currency.\n\nThis incorporates the trends in customer behavior that we saw beginning in July. The total year-over-year FX headwind is now $800 million, an incremental $200 million year over year since our previous guidance. As a reminder, the currencies most impacting our revenue are the euro, the British pound, the Japanese yen and, to a lesser extent, the Australian dollar. Our guidance continues to assume a $1.5 billion contribution from Slack.\n\nAs a company, we remain committed to profitability over the long term. And while we see a more deliberate customer buying behavior, I am pleased to hold our fiscal '23 non-GAAP operating margin guidance at 20.4%, an increase of 170 basis points year over year. This margin guidance includes roughly 100 basis points of headwind from Slack. As a reminder, because our regional revenue and expenses are generally in the same currencies, there tends to be a natural FX hedge in our operating margin.\n\nFor the full year, we expect GAAP EPS of $0.38 to $0.40 and non-GAAP EPS of $4.71 to $4.73. And please recall that our OIE and EPS guidance assumes no further mark-to-market adjustments of our strategic investment portfolio. We are updating our fiscal '23 operating cash flow guidance to approximately 16% to 17% growth year over year. Our guidance continues to assume a three-point headwind from cash taxes associated with tax law changes requiring the capitalization of certain R&D costs.\n\nWe expect capex to be slightly above 2% of revenue in fiscal '23, a nominal increase over last quarter's guide, reflecting the revised full year revenue guidance. This results in free cash flow growth of approximately 18% to 19% for the fiscal year. So to close, as our customers and their executive teams, including the CEO, CIO and CFO, focus on their digital investment strategy, we are well positioned with our diversified product portfolio to help drive efficiencies and growth. And we are laser-focused on disciplined decision-making with a commitment to achieving our operating margin guidance.\n\nLastly, let me echo Bret and Marc. We are very, very pleased to be announcing our new share repurchase program today. This step is a reflection of the confidence that we have in the future of Salesforce. And I look forward to seeing everyone at investor day on September 21, where we will go into even more detail on our capital allocation strategy.\n\nNow, Emma, let's open up the call for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Keith Weiss with Morgan Stanley. Your line is open.\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nExcellent. Thank you guys for taking the question. I think what's really on top of everybody's mind right now is the takedown in the full year revenue guide and what's causing that. You talked a lot about the macro side of the equation, and we definitely see that all around us.\n\nWe definitely see that in our checks as well. But I think what people want to understand, is there anything more to this? Is there anything more execution-related, perhaps the go-to-market? And is the change in sales leadership from Gavin to Brian, is this in any way meant to address any shortcoming on the distribution strategy? So that's part one. Part two, on the expense side equation. Very impressive to be able to sustain 20.4% operating margin target even with the revenues coming down.\n\nI guess, for Amy, is there another level of what kind of expense reductions or sort of another gear that you had to sort of go in to be able to sustain that operating margin expansion? And does that impact your ability to sort of invest in the business to sustain those operating margins?\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nYeah. I'm so happy to talk to you, Keith, and I'll tell you that you're right. We took the guide down really around two points. One is the foreign exchange environment is obviously just unprecedented.\n\nAnd we talked about that last quarter as well. I think maybe we were one of the first to really see what was going on. Somehow just being on the ground in some of these countries that have been so dramatically hit. But to look at where we are right now with the yen, to look where we are right now with the euro, I think the euro maybe just broke parity yesterday.\n\nI mean, we're really in an unprecedented moment in foreign exchange. And on the other side, as I said and I think as the team has really emphasized, really starting in July, we started to see some metrics where we're like, where do we exactly want to be for the year? And what is appropriate for us? And how do we correctly characterize where the business is? And that is really how we kind of put together this guide, which we think is the appropriate way to communicate the status of the business because we want to be in a place where we're communicating exactly where we are. So I'm sure Amy is going to amplify that as well.\n\nAmy Weaver -- Chief Financial Officer\n\nSure, Marc. I think you nailed it on that. When we look at the guide, I believe the guide is appropriate under the circumstances we're seeing right now. And as you know that there's two key drivers.\n\nThe first part is FX, the key currencies, the euro, the pound, the yen, they've all weakened to near historic levels, and we're seeing that impact on our top line as we look forward to the rest of the year. For the remaining part, as we called out, there was a distinct shift in customer buying behavior that we saw near the end of the quarter. And for purposes of the guide, we're assuming that those conditions endured through about the half of the year. Now, turning to your second part of your question, which I think was on op margin.\n\nAs you know, I was very happy that we are committed to 20.4% and holding that despite bringing down the top line. This is largely coming from a more disciplined approach. It is not a result of one single change. We are continuing to unlock incremental efficiencies across the business.\n\nWe're asking each leader to step up and look at their businesses and prioritize. I do believe that we are continuing to invest into growth, which still remains our No. 1 priority. In terms of the specific drivers, definitely continuing to take a measured approach and a very deliberate approach on hiring.\n\nT&E, we are prioritizing for customer-facing travel. And again, we are continuing to benefit from some of the decisions we've made over the last few years on real estate.\n\nOperator\n\nYour next question comes from the line of Brent Thill with Jefferies. Your line is open.\n\nBrent Thill -- Jefferies -- Analyst\n\nGood afternoon. Marc, I'm curious if you could talk about Brian's new role. And I think there's a lot of concern, as new head of the sales comes in, that there's some transition period. And can you just address this transition period? And I know he's been with the company for over 20 years and highly regarded, but there's a lot of investors that would love to hear your perspective on this.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nWell, that would be my pleasure. I mean, I think a lot of you know Brian, he's been a trusted part of our management team for over 20 years. And look, the last time he was the head of sales was only two years ago when we went into the pandemic and went through the transition with Keith. You may remember, I put Brian in for, I think, one or two quarters to run global sales, did a fantastic job.\n\nHe didn't want to continue with it. So we asked Gavin to step up from his role of -- I think it was International Chairman or European Chairman, I can't remember, honestly. And really proud of Gavin for the last now two years. And then, Brian is right here.\n\nAnd I asked Brian if he would come in and take this forward and he agreed. And I couldn't be more grateful to that. I know we have just a trusted hand. In terms of the transition period, I couldn't imagine anybody who will operate the organization so seamlessly and transparently and with ease.\n\nAnd everybody has such a good relationship already with Brian. And he already runs our forecast calls. He's already been a key part of our sales program. I don't expect any transition period at all, and I'm holding him to that actually.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nThe other thing I just want to add is Brian has been running our customer success, professional services and partnership organization for a long time. And I think the story to the pandemic has been our historically low attrition rates and our focus on customer outcomes. And I'm really excited about the opportunity of bringing our global sales organization together with our customer success organization. And it's a really important part of our philosophy.\n\nAnd I think this move --\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nWell, we definitely surprised both of us, right, how low attrition Brian has been able to get. And how great a job he's done.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nAnd deeply connecting that success motion to our sales motion, I think, reflects a philosophical view from Marc and me about really our philosophy.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nBrian, can you just step out of the room while we finish answering this? Do you want to just comment on this?\n\nBrian Millham -- President and Chief Operating Officer\n\nYeah. First of all, I'm humbled by the opportunity and, Marc, to your comments. I've been very close to this business for the past two and a half years, working side-by-side with Gavin. I actually was operating in a COO role for him running this business.\n\nAnd I think it's critical as we look at sort of the second half of this year and beyond, this motion of customer success and sales together will drive the outcomes that we're looking for and our customers are looking for. And so, I'm thrilled with the results we've seen on the attrition side, thrilled with the results that the customers are getting from the investment they're making in our technology and just so excited to lead the sales.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nCan you just address Brent's direct question on transition time, how hard of a transition is this going to be for --\n\nBrian Millham -- President and Chief Operating Officer\n\nI think it was measured in hours, actually, Marc. I've been running forecast calls already. I'm in the business travel industry customers. I met with four customers yesterday, there will be no transition time.\n\nThere are no big changes that we're going to be making in our go-to-market other than getting closer to our customers and ensuring that we're delivering value to them in every single transaction that we're working on with them. So very excited to take this on with zero transition time.\n\nOperator\n\nYour next question comes from the line of Raimo Lenschow with Barclays. Your line is open.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. Obviously, the slowdown that we're seeing or the lengthening of sales cycles, there's nothing that is kind of unique to you guys. We heard from other vendors as well. Can you talk a little bit about what you see in terms of client prioritization, in terms of certain projects? Because I do remember from the old times that the front offers always had higher priority because it's revenue generating, etc.\n\nAre you seeing that now happening as well? And can you speak to that?\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nYeah. Thanks for the question. First, I'll tell you, I think that trend continues. Digital transformation remains our customers' top priority, and digital transformation starts and ends with the customer.\n\nAnd fundamentally, all of our customers are really investing into the secular trend of the digitization of their customer experience, their employee experience and with our portfolio, we're at the top of that list. I think what you're seeing is an increased focus on, I say, three things. One is time to value. The other is ensuring that these projects drive cost savings in addition to customer satisfaction and top line growth.\n\nAnd then, the third is reducing complexity and vendor consolidation. Some of the stories I mentioned like Uber Eats, I think, are great examples because it's really about how do you put up things like digital service technology, whether it's chatbots or self-service, to really take out cost and make these projects pay for themselves as opposed to having protracted multiyear implementations. I think vendor consolidation is also a trend that we're seeing. And if you look at some of the innovation we're bringing out like our Sales Cloud Unlimited edition, or Salesforce Easy, which I mentioned earlier in my script, they are really efforts to enable our customers to do more with less, to enable them to use Salesforce as their sole vendor, take out some point solutions that perhaps aren't getting the return on investments our customers are looking for, and sort of taking advantage of this opportunity to be the most strategic vendor for our customers right now as they look to really hold their technology to high standards, which is to drive top line and bottom line performance.\n\nBrian, is there anything you want to add?\n\nBrian Millham -- President and Chief Operating Officer\n\nGreat question, Raimo. And I agree with you that front office is the priority you heard both Marc and Bret, and I'm feeling to when we're out talking to CEOs, digital transformation remains our No. 1 priority, and we need to make sure that we're delivering for them. We're also seeing it in the demand environment.\n\nWe are still seeing very good generation of pipeline in our business right now. And while we are facing some longer sales cycles and additional layers of deal approvals and potentially some deal compression, the demand environment is solid. And so, you're spot on that we are seeing the front office as a priority for every CEO out there.\n\nOperator\n\nYour next question comes from the line of Brad Sills with Bank of America. Your line is open.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks for taking my question. Thanks for all the color on where you saw the macro impact. It sounds like SMB marketing commerce, but the core sales and service looks to have held in nicely you didn't call out enterprise.\n\nSo any specific color on how the core business and the large enterprise, those bigger expansion deals in the core track this quarter?\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nI'll start and then Brian, I'd love your commentary as well. As you said, I think the story, actually, the past number of quarters have been the strength of our core CRM business. Sales Cloud growing at 19% in constant currency is remarkable. This is the product that Marc and Parker built 23 years ago doing -- so much revenue growing at 19% is incredible.\n\nAnd you're seeing it just in, I think, the continued strength in our core business. And the other thing I want to call out is our attrition rate being at historical lows as well. And I think it really reflects the strength of our business. And so, as Amy articulated, as it relates to SMB, GMV deceleration, we're seeing things settle down to pre-pandemic norms.\n\nBut I still see incredible strength in our core CRM business, in the enterprise. And as I said, I think the durability of our business really rests on the durability and diversity of our portfolio, the diversity of the industries that we serve and the diversity of the segments that we serve. Brian, is there any color you want to add?\n\nBrian Millham -- President and Chief Operating Officer\n\nYeah. Well said. On the sales and service cloud are sort of the centerpiece of our digital transformation for our customers. And you saw the growth in the quarter, and we expect that to continue.\n\nWe are seeing some compression in some of the larger transactions in our enterprise business, and it's not a surprise. I've lived through three of these cycles before, and you can see that maybe people take a more measured approach to their digital transformation, maybe starting with a smaller piece, but a land-and-expand strategy is something we've used for many, many years, we can grow as the strategy we've used. And so, despite the fact that maybe some of these engagements are a bit smaller, we do see acceleration in these customers in quarters to come. So yes, there was compression out there in some of the business, but we are very confident that we can go execute against the opportunity in front of us in these large enterprise accounts going forward with digital transformation being a top priority.\n\nOperator\n\nYour next question comes from the line of Kash Rangan with Goldman Sachs. Your line is open.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you very much. Lots of exciting news for Salesforce. Congrats on all the changes. My question maybe, Brian, congrats to you as well in your new position.\n\nWhat would you do to turn around the data cloud? I know, clearly, it has had some very significant momentum. But I can, in some sense, look at the new guidance versus the old and say a lot of that delta is basically the slowdown on the growth rate in the data cloud that is the Tableau and MuleSoft business. Brian, want to get your opinion on that. And just the management team, as you talk to customers, Marc, you've been through these cycles before, what are customers saying as to when they might reengage at the same level of enthusiasm at Salesforce, be deal size or close rate.\n\nWhat are the things that they're looking for from a macro perspective or leading indicators in their business so it could be back to reengaging the way they used to reengage with Salesforce.\n\nBrian Millham -- President and Chief Operating Officer\n\nFirst of all, Kash, thanks for the question and I appreciate the kind comments. On the data business, it's a unique business for us because some of it is license based. And you can tend to see some of the headwinds we saw in July show up more immediately there. We feel very good about where both those businesses are right now, particularly in MuleSoft that as you heard Bret say is on a great trajectory and will be a tailwind to our revenue growth in the second half of this year.\n\nWe feel great about that. Tab is a critical component of our digital transformation with every customer wanting to leverage data to have better insights to the way they operate their business. So clearly, a lot of focus on these businesses because it is such a critical component of every digital transformation. We feel great about that, both those integration and analytics as a category for accelerated growth in the second half.\n\nSo no big concerns there at all. I would say on your second question, we are not economists, and so we're not going to guide on where -- when people are going to feel like they're coming out of this. We think we're being appropriate with our guide for the second half of the year based on what we saw transpire in July. Marc and Bret?\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nWell, I think the main piece that I would really focus on is really going to be spending as much time as I can with customers at Dreamforce. This is our opportunity to really understand deeply across a wide spectrum of our customers, geographies, verticals, what it is that they are seeing in their own businesses. But I think when you look at these customers, we mentioned one is L'Oreal, this has just been an incredible success story for us. We see the B2C story.\n\nThey're using Marketing Cloud and Commerce Cloud and Service Cloud. The Commerce Cloud story is incredible where they have almost 200 sites globally now for all of their brands. They've got highly customized experiences on the web and mobile and in-store for -- I'm sure a lot of you use the Kiehl's brand. It's a great product.\n\nThey have a whole new skin hub. They've been with us. They've really reimagine their business using Customer 360. It's a company that we're going to feature and focus and talk about and inspire others at Dreamforce.\n\nI think when you see stories like that, when you look at all the stories that we've seen, especially during this pandemic surge over the last 2 years, it's incredible what folks have done with their businesses. When we get to this moment, I don't think it's a huge surprise that customers are more measured. Everybody is like wondering exactly where the economy is going and how things are moving forward. So this is a point where people are taking a little bit of a breath and then they will reassess.\n\nAnd then, when they get their confidence and kind of a full vision for the next stage of their company, they come in. And until then, it's a lot of the transactional business that we would normally see and move forward with.\n\nOperator\n\nYour next question comes from the line of Karl Keirstead with UBS. Your line is now open.\n\nKarl Keirstead -- UBS -- Analyst\n\nThank you. Maybe I'll direct this to Marc and Amy and it's about the $10 billion share repurchase. So maybe a two-parter. Marc, maybe for you, why do you think this is the right time in the company's development to move forward with your first large repurchase? And then secondly, should everybody on the line interpret this as a signal that perhaps large M&A may be off the table for now?\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nWell, it's a great question. And I'll tell you this was kind of, I looked at this quarter very much as kind of a milestone. I'm a big fan of SAP and I have a lot of respect for their business and what they've done in the market over the last 40 -- almost 50 years. And to see our business in July do more than they reported in June in terms of revenue, that was very meaningful to me and I'm very grateful and proud of our team for kind of hitting this tremendous level of scale.\n\nBut at that same moment, I kind of also can say, OK, what are some changes that we can make. And one of the things, we have such massive cash flow that I think it's completely appropriate for us to look at how we're handling our dilution, for example. I think that's been on the table for a while, and a lot of my conversations with investors they bring it up. We've waited for that moment.\n\nI think now is the right moment where we can say we're going to directly address this with our kind of first-ever share repurchase, $10 billion. I'm very excited about it. At the same time, I don't think that that takes M&A off the table. I think that we continue to look for opportunities.\n\nWe want to be able to use our cash constructively. This is important for us. It doesn't mean that we're not going to have different kind of guardrails for M&A. And Bret, do you want to just address that point?\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nYeah. I think, Marc, you articulated it well. I mean, when I mentioned this before, but the pillars of our capital allocation strategy are, No. 1, that we're going to continue to become more profitable to generate expanded free cash flow over time.\n\nThat's what Marc was saying.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nYeah. Thank you for saying that.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nYou created a great business model in Software-as-a-Service, Marc, and I think --\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nNo. I think that committing to this -- committing to the margin for the year is so critical as well for investors.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nIt is. And No. 2, we're going to invest in organic innovation. And we talked a bit on -- there's a question Amy earlier on investment.\n\nI'm so proud of our investment in organic innovation. You'll see a lot more of it at Dreamforce, but I think we have a better pace of organic innovation that we've had in our history. But -- and then finally, we want to reduce the impact of dilution, which is feedback I've gotten from all of you. And we're focused on offsetting our stock-based compensation.\n\nAnd we're also focused on maintaining a healthy balance sheet because we understand that's an incredible piece of leverage we have for future M&A. So I think this is a way to -- that we can continue to acquire in the future. It's been a big part of our company's history. It will be a big part of our future, but do so in a way that minimizes the impact of dilution and does it in a more shareholder-friendly way.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nAnd you can see like we've picked up some great companies, whether it was ExactTarget, which was kind of the beginning of really augmenting Customer 360 with our Marketing Cloud and then moving on to MuleSoft was amazing. It's really provided all the integration and the connectivity, and then on to Tableau and giving this extension of analytics. So important to so many of our largest customers. And then, Slack, I just mentioned L'Oreal, it's an incredible Slack story.\n\nThey've streamlined their communication. They've got -- they have that awesome Brandstorm event. Have you seen that, Bret? It's that worldwide innovation competition that they do. They've got more than 83,000 student participants, 65 countries.\n\nThey use Slack to drive that thing forward. You look at that, we're a different company because we had an acquisition strategy over the last decade. I don't think we necessarily need to break that. But at the same time, we need to be paying attention to dilution and the overall, making sure we have the correct capital allocation strategy as well.\n\nAmy Weaver -- Chief Financial Officer\n\nYeah, Marc, I think that's really it. When we look at this, I think this is very much a natural evolution of our capital allocation strategy. And what it really comes down to is that we believe Salesforce is positioned for success over the long term. And this announcement reflects the confidence that we have in our business that as we look forward and our approach to generating shareholder value.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nYeah. And I really think that when we get to Dreamforce and you see how we brought all of these platforms together, integrated them, you're going to see some really powerful integration capabilities. You already saw some of it at the World Tour in New York with kind of the first level of the customer data platform. You're going to see a whole another extension of that kind of capability when we get to Dreamforce.\n\nAnd it's -- I think, as Bret said, it's in a very exciting moment in time when it comes to innovation with the company.\n\nOperator\n\nYour next question comes from the line of Kirk Materne with Evercore. Your line is open.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nYeah. Thanks very much. I think this one is sort of for Bret. Bret, I was just wondering if you could go into the industry cloud strategy a little bit and what you're seeing going on there.\n\nAnd can you just talk a little bit about how important that strategy is as budgets come under more stress and the ability for you all to go deeper with your customers on an industry basis? I was just kind of curious if you can give us an update on that and then how that strategy maybe plays out in a more choppy macro backdrop.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nYeah. Thanks, Kirk. We have 12 industry clouds spanning a wide range of industries where I think CRM is particularly strategic from financial services to healthcare, to consumer goods and manufacturing. And you can think of our industry cloud is essentially taking the Customer 360: sales, service, marketing, e-commerce, Tableau, MuleSoft, Slack, and building industry-specific processes and workflows that work out of the box.\n\nAnd as you're sort of alluding to, there's a lot of value for our customers. No. 1 is they don't need to pay us or a professional services firm to implement the table stakes for their digital transformation. It works out of the box.\n\nThat means they can focus their investment resources in the areas of their business that are differentiated. It means they get faster time to value. And it means that these processes are stickier, which is why our industry clouds have lower attrition rates than our line of business clouds. It's been a huge area of growth for us and actually a lot of credit to our chief product officer, David Schmaier, who actually -- his company, which we acquired a couple of years ago.\n\nVelocity was actually independent software vendor that built industry solutions on top of our platform and has been a strong advocate for this strategy internally. It's a huge part of our go-forward strategy. If you have an option to buy one of our industry clouds, why wouldn't you? More works out of the box, you'll get faster time to value. So it's a huge area of investment for us.\n\nI think the thing that we do really uniquely though, Marc alluded to it, is it's really all-in-one integrated platform. If you buy our Financial Services Cloud, you get all the capabilities of our Salesforce Cloud, of our service cloud or our customer data platform, all in one integrated technology platform. It's very unique in the industry. And I think in this more measured buying environment, it will become even more important, though, actually, it was important prior to this as well.\n\nAnd I think it reflects our alignment with our industry's go-to-market motion and vertical go-to-market motion and really focus on delivering faster time to value to our customers.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nYou last question today comes from the line of Phil Winslow with Credit Suisse. Your line is now open.\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nHey. Thanks for taking my question. I wanted to focus in on Slack. Slack again outperformed revenue expectations.\n\nObviously, the large deal metrics are impressive, too. What's driving the continued advance for Slack, let's say, relative to some of those other vendors that are heavier in the telephony or the video segments of UCaaS that have frankly have been delivering weaker results? And are you seeing strong, call it, stand-alone demand for Slack as a horizontal messaging platform or the Salesforce integrations that you highlighted driving more attach as a collaboration hub of Slack in the context of multi-cloud deployments?\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nYeah, I'll take that one. This is Bret. We are really happy with the performance of Slack. I think it's interesting, we acquired Slack in the midst of this pandemic.\n\nAnd now we're coming out of the pandemic into this new era of flexible work. Office occupancy rates are at historic lows. If you look at the lines of business that we serve like customer service, I've met tens or maybe even hundreds of executive teams whose contact centers are no longer buildings. They're literally just in the cloud now and people are wearing headsets in their kitchens and basements to answer your phone calls.\n\nAnd if you think about what it means to build an employee experience, to build a customer experience in this new area of flexible work, Slack is really at the center of those conversations. And that's why it was such a strategic acquisition for us because one plus one is truly equal to much more than two. When I talked about the innovation we're to deliver at Dreamforce, it's across every single one of our cloud. We've been saying, how do we help our customers whose headquarters is now digital transition their CRM, transition their employee experience to this new era of flexible work? So we've seen great wall-to-wall engagements like Mercado Libre, one of the customers I mentioned in my script.\n\nBut it's also really important that we've invested in integrating Slack with Customer 360 so that when we have a conversation, say, with a retailer preparing for Cyber Week, we're coming not just with our Marketing Cloud or in our Commerce Cloud and our Service Cloud but with a Slack Connect channel that they can use as a command center for Cyber Week. That's key to our go-to-market motion. And I don't think it's at the expense of what you called stand-alone. When we land a deal, say, for a department -- marketing department, Slack has such wonderful organic viral adoption that a year or two later, we're selling to the whole company.\n\nAnd I really think that's key to our go-to-market motion. And Slack is a relevant driver for every single one of the cloud and our Customer 360.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nAnd I think a lot of the reasons that we bought the company that they really could benefit from our credibility with customers and our distribution capacity have really paid out. It's such a great product. And in June, you probably know that Bret and I did the World Tour in New York. Many of you were there, but the day before was the Frontiers Conference for Slack.\n\nAnd if you haven't looked at the demo, you really should because the product has come a long way since we bought the company. It's an incredible piece of technology --\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nVoice, video. I mean, it's incredible, yes.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nYou have to see it to believe it. I mean, don't you agree like it's something that's like really -- and for a lot of you are coming to Dreamforce, I think you're going to see how a lot of our products have become Slack first. And also, the number of integrations that we're going to be able to kind of bring forth, how many integrations now do you have with these core clouds that you've been able to put together?\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nWe have 12 integrations with -- and the reason there's so many is because it includes our industry clouds, not just sales, service, marketing and commerce. But Marc, you're going into something remarkable huddles, which is the name of the new audio and video introduced, now accounts for 34% of all communication inside of Salesforce. It's completely transformed the way we work, and I'm pretty confident we'll transform all of our customers --\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nWe've integrated Slack with Tableau, which is really cool, right? Because you can do collaborative analytics.\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nAnd with the capabilities we launched to allow you to talk to your data, this is happening inside of Slack. It's just an incredible capability and, as I said, a relevant driver for all of our customer engagements and a wonderful way to, I think, drive and accelerate flag adoption that they would have had independently.\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nBut a lot of our customers still haven't seen this. And I think that's why I'm so excited about Dreamforce because when you come to Dreamforce, and you see the keynote, obviously, this will be highlighted. And I think customers will see in real time. What we saw, for example, in Frontiers, even we didn't really have the opportunity because COVID was so freshly integrated into our World tour Keynote, which Bret and I have lamented many times.\n\nBut I think that when you start to see the incredible innovation that have happened in the Salesforce core clouds like sales, like service, marketing, commerce, even Tableau, you combine that with Slack. You bring that into the Customer 360 with MuleSoft, the single source of truth. The way it's all being integrated with this customer data platform, I don't think anyone else has this vision or is trying to even to execute it. And I've made this kind of L'Oreal -- I told you the L'Oreal story, I said quite a few times, you're going to see that in Dreamforce in real time.\n\nYou can see many other stories, because I think for us, just trying to communicate our vision, this is like probably the most exciting thing going on here. We just brought 500 of our top executives together for kind of second half kickoff and showed them what we're so excited about, and I don't think anybody walked away not thinking that we've not only got a world-class product that's highly differentiated, but we're really where a lot of our customers are trying to get to in the next level of their customer experience. And Bret's made the point, Amy's made the point, Brian's made the point that digital transformation is underway, but we all know that every digital transformation is beginning and ending with the customer. And you've got to have this beginning.\n\nYou have to kind of begin with the end of mine when that's all about building this Customer 360, and you're going to see this at scale when we all get to Dreamforce, and I'll look forward to your feedback then.\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nThanks, Phil, and we want to thank everyone for joining us today, and we look forward to seeing everyone over the next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike Spencer -- Executive Vice President, Investor Relations\n\nMarc Benioff -- Chairman and Co-Chief Executive Officer\n\nAmy Weaver -- Chief Financial Officer\n\nBret Taylor -- Vice Chairman and Co-Chief Executive Officer\n\nKeith Weiss -- Morgan Stanley -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nBrian Millham -- President and Chief Operating Officer\n\nRaimo Lenschow -- Barclays -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nKarl Keirstead -- UBS -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nPhil Winslow -- Credit Suisse -- Analyst\n\nMore CRM analysis\n\nAll earnings call transcripts"
}