{
  "companyName": "Advanced Micro Devices",
  "companyTicker": "AMD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/advanced-micro-devices-amd-q3-2022-earnings-call-t/",
  "content": "Advanced Micro Devices (AMD -0.08%)\nQ3 2022 Earnings Call\nNov 01, 2022, 5:00 p.m. ET\n\nOperator\n\nHello, and welcome to the AMD third quarter 2022 earnings call. At this time, all participants are in a listen-only mode. [Operator instructions] A question-and-answer session will follow the formal presentation. As a reminder, this conference is being recorded.\n\nIt's now my pleasure to turn the call over to Ruth Cotter. Please go ahead, Ruth.\n\nRuth Cotter -- Senior Vice President, Worldwide Marketing, Human Resources, and Investor Relations\n\nThank you, and welcome to AMD's third quarter 2022 financial results conference call. By now, you should have had the opportunity to review a copy of our earnings press release and accompanying slideware. If you do not receive these documents, they can be found on the Investor Relations page of amd.com. We will refer primarily to non-GAAP financial measures during this call.\n\nThe full non-GAAP to GAAP reconciliations are available in today's press release and slides, which are posted on amd.com as mentioned. Participants on today's conference call are Dr. Lisa Su, our chair and chief executive officer; and Devinder Kumar, our executive vice president and chief financial officer and treasurer. This is a live call and will be replayed via webcast on our website.\n\nBefore we begin today, I would like to note that Mark Papermaster, chief technology officer and executive vice president, technology and engineering, will attend the Wells Fargo Technology, Media, and Telecommunications Summit on Wednesday, November 30. And our fourth-quarter quiet time is expected to begin at the close of business on Friday, December 16. Today's discussion contains forward-looking statements based on current beliefs, assumptions, and expectations, speak only as of today, and as such, involve risks and uncertainties that could cause actual results to differ materially from our current expectations. Please refer to the cautionary statement in our press release for more information on the factors that could cause actual results to differ materially.\n\nNow with that, I'd like to hand the call over to Lisa. Lisa?\n\nLisa Su -- President and Chief Executive Officer\n\nThank you, Ruth, and good afternoon to all those listening in today. Our third-quarter revenue and gross margin came in below our expectations due to softening PC demand and substantial inventory reduction actions across the PC supply chain. Despite the macro backdrop, overall revenue grew 29% year over year to $5.6 billion as our Data Center, Gaming and Embedded segments each delivered significant year-over-year growth and performed in line with our expectations. We also expanded gross margin and grew net income year over year, highlighting the strength of our business.\n\nTurning to the business results. Starting with our Data Center segment. Revenue increased 45% year over year and 8% sequentially to $1.6 billion. We delivered our 10th straight quarter of record server processor sales, driven by strong demand for third-gen EPYC processors and initial shipments of our next-generation Genoa CPU to select customers.\n\nCloud revenue more than doubled year over year and increased sequentially as multiple hyperscalers expanded deployments of EPYC processors to power their internal properties and more than 70 new AMD instances were launched by Microsoft Azure and Amazon, Tencent, Baidu, and others in the quarter. In enterprise, OEM revenue was down sequentially as server OEMs continued working through match set issues, and some business load the pace or scale of their purchases based on the macro uncertainties. Looking at the broader competitive landscape, our third-gen EPYC CPUs in market today are the highest performance and most energy-efficient x86 server CPUs available. And we expect to further extend that lead with our next-generation five-nanometer Genoa processors, which deliver significant performance, energy efficiency, and TCO advantages for both hyperscale and enterprise workloads.\n\nWe will publicly launch Genoa next week and are ramping production to support initial cloud deployments and the introduction of fourth-gen EPYC processor platforms by HP Enterprise, Dell, Lenovo, Super Micro, and others. Looking at our broader data center portfolio. As expected, Data Center GPU sales were down significantly from a year ago when we had substantial shipments supporting the build-out of the Frontier exascale supercomputer. We made good progress with our Data Center GPU software enablement work in the quarter, including announcing our role as a founding member of the PyTorch Foundation.\n\nWe look forward to working closely with the largest cloud providers as we drive a standards-based approach to the development of popular PyTorch deep learning software framework. Demand from data center customers for our adaptive SmartNIC and DPU products was strong during the quarter. We had record sales of our Xilinx FPGA and networking data center products led by demand from cloud and financial customers. Sales of our Pensando DPUs also ramped significantly from the prior quarter driven by cloud adoption.\n\nThe addition of Pensando DPUs to our product portfolio has been very well received by customers, highlighted by our enterprise customer pipeline doubling in the few months since the acquisition closed. We were excited to support VMware's launch of its next-generation cloud virtualization platform in the quarter. Our Pensando DPUs will be included in the first validated server and HCI solutions, supporting the new VMware virtualization offerings from Dell, HPE, and others that will make it much easier for enterprise customers to build more performance and secure data centers powered by our industry-leading DPUs. Taking a step back, we have built significant momentum in our Data Center business as we have consistently executed our server CPU road map and expanded our solutions capabilities with the addition of the Xilinx and Pensando products to our portfolio.\n\nWe remain on track to further expand our product portfolio in 2023 with the launches of our edge and telco-optimized Siena and cloud-optimized Bergamo processors. With 128 cores and 256 threads per socket, we expect Bergamo will first end our performance and energy efficiency leadership in cloud workloads. Customer response has been very strong based on the performance, features, and software compatibility Bergamo delivers. We believe our broad family of leadership CPUs, GPUs, FPGAs, adaptive SoCs, and DPUs position us well for long-term growth and share gains in the Data Center.\n\nNow, into our Client segment. Revenue declined 40% year over year to $1 billion. Our Client processor shipments were below PC consumption in the third quarter as we worked closely with our customers to reduce downstream inventory. Desktop channel sell-through increased from the prior quarter, driven by increased demand for our Ryzen 5000 Series CPUs and the launch of our Ryzen 7000 Series processors and AM5 platform in September.\n\nWe launched our five-nanometer Ryzen 7000 Series processors with strong reviews based on delivering leadership performance in gaming, productivity, and content creation applications. We expect Ryzen 7000 CPU sales to ramp this quarter aligned with the launches of a broader range of mainstream and enthusiast AM5 motherboards. Now, turning to our Gaming segment. Revenue increased 14% year over year to $1.6 billion as strong semi-custom sales offset a decline in gaming graphics.\n\nWe delivered our sixth straight quarter of record semi-custom SoC sales as demand for the latest game consoles remained strong and Sony and Microsoft prepare for the holiday season. Gaming graphics revenue declined in the quarter based on soft consumer demand and our focus on reducing downstream GPU inventory. We will launch our next-generation RDNA 3 GPUs later this week that combine our most advanced gaming graphics architecture with five-nanometer chiplet designs. Our high-end RDNA 3 GPUs will deliver strong increases in performance and performance per watt compared to our current products and include new features supporting high resolution, high frame rate gaming.\n\nWe look forward to sharing more details later this week. Looking at our Embedded segment. Revenue increased significantly year over year to a record $1.3 billion, driven by growth from aerospace and defense, industrial, and communications customers. Demand across our core markets remain very strong.\n\nWe had record sales to aerospace and defense and automotive customers who are increasingly using our FPGA and adaptive SoC products to enable differentiated capabilities and features in their products. Record communications market revenue was driven by growth from both wired and wireless customers. We saw a particular strength in North America led by new 5G wireless installations and expanded wired infrastructure deployments. Overall demand for our Xilinx products remains strong as we continue to leverage AMD's scale to secure additional supply to address this demand.\n\nLonger term, we're very excited about the growth opportunities in our Embedded business. We closed multiple high-revenue design wins in the quarter with automotive, networking, emulation and prototyping, communications, and aerospace and defense customers. We're also seeing new design win opportunities and deeper engagements with many of our Embedded customers based on the expanded breadth of our adaptive SoC, FPGA, CPU, GPU, and DPU product portfolio. In summary, we are well-positioned to navigate the current market dynamics based on our leadership product portfolio, strong balance sheet, and growth in our Data Center and Embedded segments.\n\nWe have three clear priorities guiding us. First and foremost, we're focused on executing our road maps and delivering our next generation of leadership products. Second, we're building even deeper relationships with our customers as we make AMD a fundamental enabler of their success. And lastly, we remain very disciplined in how we manage the business.\n\nWe will continue to invest in our strategic priorities around the data center, embedded, and commercial markets while tightening expenses across the rest of the business and aligning our supply chain with the current demand outlook. The secular trends driving increased demand for high-performance and adaptive computing in the cloud, at the edge, and across intelligent end devices remain unchanged and provide a strong backdrop for long-term growth. Now, I'd like to turn the call over to Devinder to provide some additional color on our third-quarter financial performance. Devinder?\n\nDevinder Kumar -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nThank you, Lisa, and good afternoon, everyone. AMD reported third-quarter results in line with the preliminary results we announced last month. While we are pleased with the performance of our Data Center, Gaming, and Embedded segments, each of which grew significantly year over year, our third-quarter results also reflect lower-than-expected Client segment revenue. Third-quarter revenue was $5.6 billion, up 29% from a year ago.\n\nGross margin was 50%, up 150 basis points from a year ago, primarily driven by higher revenue in the Embedded and Data Center segments, partially offset by lower Client revenue and $160 million of inventory, pricing, and related charges in the graphics and client businesses. Operating expenses were $1.5 billion, compared to $1 billion a year ago as we continue to scale the company. Operating income was up 20% from a year ago to $1.3 billion, driven by revenue growth and higher gross margin. Operating margin was 23%, compared to 24% a year ago due to higher operating expenses.\n\nNet income was $1.1 billion, up $202 million from a year ago. Earnings per share was $0.67 per share, compared to $0.73 per share a year ago, primarily due to lower Client segment revenue. Now, turning to our reportable segments. Starting with the Data Center segment.\n\nRevenue was $1.6 billion, up 45% year over year, driven by strong growth in third-generation EPYC server processor revenue. Data Center operating income was $505 million or 31% of revenue, compared to $308 million or 28% a year ago. Higher operating income was driven primarily by stronger revenue, partially offset by higher operating expenses. Client segment revenue was $1 billion, down 40% year over year due to reduced process shipments resulting from a weak PC market and a significant inventory correction across the PC supply chain.\n\nClient operating loss was $26 million, compared to operating income of $490 million or 29% of revenue a year ago, primarily due to lower revenue. Gaming segment revenue was $1.6 billion, up 14% year over year, driven by higher semi-custom product sales, partially offset by lower gaming graphics revenue. Gaming operating income was $142 million or 9% of revenue, compared to $231 million or 16% a year ago. The decrease was primarily due to lower graphics revenue and inventory pricing and related charges.\n\nEmbedded segment revenue was $1.3 billion, up $1.2 billion from a year ago, primarily due to the inclusion of Xilinx's embedded product revenue. Embedded operating income was $635 million or 49% of revenue, compared to $23 million or 30% a year ago, driven primarily by higher revenue. Turning to the balance sheet. Cash, cash equivalents, and short-term investments were $5.6 billion at the end of the third quarter.\n\nDuring the quarter, we repaid the 7.5% senior notes totaling $312 million that matured in August and deployed $617 million to repurchase common stock. We have $6.8 billion in remaining authorization for stock repurchases. Cash from operations was $965 million, and free cash flow was $842 million, compared to $764 million in the same quarter last year. Inventory was $3.4 billion, up approximately $721 million from the prior quarter, driven primarily by client products and new products ramping in the second half of the year.\n\nNow, turning to our financial outlook. Today's outlook is based on current expectations and contemplates the near-term macroeconomic environment. For the fourth quarter of 2022, we expect revenue to be approximately $5.5 billion, plus or minus $300 million, an increase of approximately 14% year over year and flat sequentially. The year-over-year growth is driven by Embedded and Data Center segments, partially offset by a decline in the Client and Gaming segments.\n\nOn a sequential basis, Embedded and Data Center segments are expected to grow, offset by declines in the Client and Gaming segments. In addition, for Q4 2022, we expect non-GAAP gross margin to be approximately 51%; non-GAAP operating expenses to be approximately $1.55 billion or 28% of revenue; non-GAAP interest expense, taxes and other to be approximately $175 million based on a 13% effective tax rate; and diluted share count to be approximately 1.62 billion shares. For the full year, we expect revenue to be approximately $23.5 billion, plus or minus $300 million, an increase of approximately 43%, led by growth in the Embedded and Data Center segments. We expect non-GAAP gross margin to be approximately 52%.\n\nIn closing, we continue to focus on executing our long-term strategy while navigating current market conditions. We will prioritize the key investments for our product road maps and long-term growth while taking several near-term cost management actions, including prudently controlling operating expenses and headcount growth while actively managing inventory in line with our revenue expectations. With that, let me turn the call over to Ruth for our Q&A session. Ruth?\n\nRuth Cotter -- Senior Vice President, Worldwide Marketing, Human Resources, and Investor Relations\n\nThank you, Devinder. Kevin, if you could please poll the audience for questions.\n\nOperator\n\nCertainly. We will now be conducting a question-and-answer session. [Operator instructions] One moment, please, while we poll for questions. Our first question today is coming from Aaron Rakers from Wells Fargo.\n\nYour line is now live.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYeah, thanks for taking the question. I have one question and one quick follow-up. I guess as we look at your Client piece of the business being down sequentially in the current quarter, as we work through inventory digestion at your customers, I'm curious just how you're thinking about kind of the clearing out of that inventory. Do you think we find a bottom coming out of the December quarter? Or any kind of thoughts of just that kind of full expectation of reflection of inventory in the PC market for you guys?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Sure, Aaron. Thanks for the question. So, clearly, the PC business has been very volatile and underperformed for us in the third quarter.\n\nI think as we go into the fourth quarter, we are guiding that -- embedded in our guidance is that PCs will be down again in the fourth quarter. We believe that that will be a significant step in clearing inventory between the third quarter and the fourth quarter. And of course, we'll monitor the macro conditions, but we'll certainly exit the year in a better place.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYeah. And then as a quick follow-up on the service side of the business, I think in the past, you've talked about your ability to shift being somewhat supply constrained. I'm just curious if you have an update on the supply situation in the server CPU, especially as we look toward the general processor ramp in the next quarter or two.\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Sure. So, you know, on the server side, we certainly have been ramping up our overall supply. I think we've made good progress on that throughout the year.\n\nWe have more supply in Q4 than we had earlier in the year. And some of those investments are coming online here in the fourth quarter. So, we expect as we go into 2023 with the Genoa launch not to be supply constrained based on what we currently see.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYep. Thank you.\n\nLisa Su -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. Next question is coming from Toshiya Hari from Goldman Sachs. Your line is now live.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nThanks so much for taking the question. Lisa, I wanted to ask a question on the outlook for 2023, specifically in the server CPU business. I know it's early and difficult to predict. But given the supply comment that you just made, given what you're hearing from customers, both on the cloud side, as well as the enterprise side, and the ramp of your new products, how are you thinking about the positives there versus the macro, which continues to be a headwind? I think many of us have your business growing in Data Center kind of in the 20% to 30% range.\n\nIs that a fair place to be? Or is that a little too optimistic given what you know today?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. So, it is a little bit early to talk about 2023 precisely, but maybe let me give you a backdrop of where we see the data center market today. As you said, in the near term, there are some overall macro headwinds that are affecting all markets, including the data center market. Now it varies by segment.\n\nAnd so, if I go through each of the segments, what we're seeing is I think North America cloud is probably the most resilient out of the segments within the data center market, and this is where AMD is the strongest. We've had very good progress at the North America cloud vendors. And we continue to believe that although there may be some near-term, let's call it, optimization of, let's call it, individual footprints, and efficiencies at individual cloud vendors over the medium term, as we go into 2023, we expect growth in that market, particularly customers moving more workloads to AMD, just given the strength of our product portfolio and overall -- Genoa coming forward. As we look through the other segments, I think China is -- has been very weak in 2022, and we're not forecasting a significant recovery in 2023.\n\nSo, we'll see how that goes. And then on the enterprise side, I would say enterprise is probably most impacted by the macro. So, we have seen customers taking longer to make decisions and perhaps being a little bit more conservative on capex. That being said, though, we feel very good about our value proposition.\n\nWe feel very good about our product portfolio. And we believe, even in a little bit of a choppy market that we can gain share across that business. So, overall, I think our Data Center trends are good, and we need to work through the macro, as everyone does.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nThat's helpful. And then as my follow-up, a question on gross margins, maybe for Devinder. So, you're guiding Q4 gross margins up about 100 basis points, which is good to see, but you're still 300 basis points below where you were in Q2. And since then, obviously, Client is down significantly.\n\nYour Data Center business is very resilient and so is the classic Xilinx business. So, from a mix perspective, you should be in a better place. What's driving down gross margins in Q4, I guess, versus Q2? Are you recognizing another inventory hit? Or is it something else? Thank you.\n\nDevinder Kumar -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nNo inventory hit, first of all, Toshi. On the gross margin, as you said, Q2, 54%. If you go all the way to Q4, 51% primarily is the weak PC market and Client margins coming down. For example, if you look at Q3, all other businesses were in line with expectations, and Client margins came in lower.\n\nWe also have in the Data Center, a place cloud-weighted, which has lower ASPs. So, that also has an impact on margins. And then as Lisa mentioned earlier, some of the new capacity that we have from a supply standpoint, there are some additional costs from the supply capacity agreements. And those are all baked in into the Q4 51% margin guidance.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is coming from Stacy Rasgon from Bernstein Research. Your line is now live.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nHi, guys. Thanks for taking my questions. For the first one, I wanted to ask about the extra week in Q4. How much revenue was that driving on an overall basis, as well as in Data Center specifically? Is there -- I don't know how linear those -- particularly that business is.\n\nIs there any sort of -- is there any material impact from that extra week?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Stacy, we're not really counting on a material impact from the extra week. I think if you look at the pluses and minuses in the quarter, the guidance for Q4 really is around sort of PCs and, let's call it, Gaming being lower. And again, those are -- with all the holidays in place, we're not counting on too much there.\n\nAnd then Data Center is -- Data Center, Embedded are higher, but we're not expecting that the extra week has a material impact.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nGot it. Thank you. For my follow-up, I wanted to ask about units versus pricing in Q3 and Q4. I know in Q3, you specifically mentioned pricing has an impact.\n\nAnd it sounds like you're suggesting Client margins are coming down. I don't know if that's just a cost or if there's a pricing impact as well. But like what did units and pricing do in Client in Q3? And what are you expecting in Q4?\n\nLisa Su -- President and Chief Executive Officer\n\nSure, Stacy. So, I think if you look at the third quarter, it was -- there are a lot of dynamics in the Client business. So, market was weak. In particular, consumer was weak.\n\nAnd we have more of a footprint in consumer. So, in that framework, we saw units come down. But we also saw ASPs come down on a sequential basis. Now, I will say that ASPs were still up on a year-over-year basis.\n\nSo, we've been, let's call it, disciplined in this pricing environment. We did see some pricing dynamics in the quarter, and we couldn't face unprofitable business. And we'll continue to be sort of watching that space. So, that was the pluses or minuses as it relates to Client ASPs.\n\nAnd as we go into the fourth quarter, again, I think we're forecasting for a competitive environment given the market weakness, and that's embedded in the guide.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nGot it. That's helpful. Thank you, guys.\n\nOperator\n\nThank you. Next question is coming from Vivek Arya from Bank of America. Your line is now live.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my question. For the first one, I just wanted to clarify what is the client revenue we should be thinking about for Q4? Is it $800 million, $900 million? Any help there? And then, I guess, Lisa, the bigger question there is, what does client recovery look like? Do you get back to the $2 billion quarterly rate? Do you get to $1.5 billion? And I asked that because your competitor was suggesting that next year, the PC TAM would only be down 4% or 5%, which seems a little bit optimistic. What do you think AMD is kind of -- what kind of PC TAM does AMD have in mind for next year so that we get a sense for how this derisk the model is from a PC perspective?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. So, a couple of different points, Vivek. Let me just answer the sort of the expectations around Q4. I would say we're guiding, let's call it, modestly down for Client and Gaming.\n\nAnd obviously, we're coming off of what is already a low base in Q3. We want to do that to correct the sort of the inventory situation as quickly as possible. And as a result, we're going to under-ship consumption again in the fourth quarter to do that. As it relates to next year, I think there are a lot of factors.\n\nI mean, this year, PCs will be down quite a bit, let's call it, high teens, close to 20%. As we go into next year, I think the industry is calling mid-single digits. I think that would be a good case. I think we should model down to minus 10%.\n\nAnd again, within our PC business, we expect as we get through this inventory correction -- I mean, we have very good products, and I feel very good about our product portfolio and very good about our platforms overall. So, I do think the PC business will recover as we go into 2023, but we'll have to work through these dynamics over the next quarter or so.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. And for my follow-up, Devinder, maybe one for you on gross margins. How much of the write-offs and pricing actions that you're taking in -- that you took in Q3 and are taking in Q4? How much are they recoverable in Q1? So, let's say, hypothetically, Q1 revenue is the same as Q4 revenue. What can gross margins be? How much of the actions are recoverable? And basically, how do you start getting back to the prior trend of 54% gross margin because the longer-term target is over 57%? So, if Client revenues don't really grow that much, are there actions that can help you get back to your prior gross margin trajectory? Thank you.\n\nDevinder Kumar -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nLet me try to answer it this way. If you look at Q3 in and of itself, we came in with about 50% gross margin. We had $160 million of charges, which are inventory pricing and related charges. If you adjust for those, the margin for -- in Q3 is about 52%.\n\nAnd we had guided to 54%. We came in at 52%. And primarily, that's due to two reasons, right? You have the Client weak PC market. And obviously, the Client margins are down.\n\nAs I said earlier, the rest of the business will perform for the expectations. We have to work through what's going on with the PC market over this quarter, next quarter, and maybe early '23, and then we come back and talk about the margins. I do feel good about the products we're introducing, especially the new products and perhaps the ability to increase margins from where we are right now, guiding 51% and then taking it up from there.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nBut is the $160 million recoverable? I guess that's really my question.\n\nDevinder Kumar -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nThose were mostly inventory rights or pricing actions we'd take. Largely, I would say, not recoverable, if that's what you're asking.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nI mean, can you get back to the 52% that you would have been normalized? Like I expect if you don't take these actions in Q1, then should you be at a higher gross margin in Q1 versus Q4?\n\nDevinder Kumar -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nI won't guide Q1, but what I'll say is from the 51% that we have in Q4, we can improve from there.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Next question is coming from Matt Ramsay from Cowen. Your line is now live.\n\nMatthew Ramsay -- Cowen and Company -- Analyst\n\nThank you very much. Good afternoon, Lisa. At least I have one question on the Data Center segment and then a follow-up on Client. On the Data Center business, if you look back to the pre-announcement a month ago, I think there was a little bit of maybe -- you came in a little bit under where we were modeling, I'll just say that way.\n\nAnd so, I got a ton of questions on that, and I was really interested in some of the comments that you made in your script about how cloud revenue still more than doubled year over year. And anyway, just confirming that I got that right. And maybe if you could help us break down your Data Center business a little bit between the strength in cloud that I would expect to continue given the capex commentary we've heard, but there were obviously some headwinds from enterprise that you called out and clearly from HPC, both on CPU and GPU. So, I think that would be helpful to just break it down because I was surprised that that cloud revenue was as strong as it was given where the numbers came in in the quarter.\n\nThank you.\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Sure, Matt. So, for focus on the third quarter, what I would say is cloud revenue did more than double. Enterprise revenue was down.\n\nAnd then on the GPU side, because we had a strong quarter in the third quarter of 2021, that was down, too. And perhaps that wasn't quite in your modeling. But the larger dynamics are, as I said earlier, the North America cloud is probably the best out of all the Data Center segments. There is some impact on macro, though.\n\nI mean, I think everyone is aware of that, that there is a little bit of pullback in capex spending. That being the case, I think our market share is very good there, and we'll -- we expect it to continue to grow. And as the business becomes more cloud weighted -- there have been a few margin questions, so I'll just mention, as the business becomes more cloud weighted, that tends to have a little bit of downward pressure on the margin. But our goal right now is footprint and expanding our footprint across cloud and enterprise.\n\nI will say even in a weak enterprise market as we go forward over the next few quarters, we feel really good about how we're positioned and the platform solutions that are coming out with all of our OEM partners. So, I think on a quarter-by-quarter basis, you may not get the model exactly right. But I think on a longer-term basis, I think the product portfolio and the product capabilities should help us continue to gain share.\n\nMatthew Ramsay -- Cowen and Company -- Analyst\n\nThank you, Lisa. That's helpful, I think, to highlight the cloud momentum continuing. I guess as my follow-up, I wanted to kind of revisit what we've learned over the last three or four months in the PC market. It's super dynamic times out there.\n\nAnd obviously, things have changed in demand really, really quickly from when you guys guided back at the beginning of August until the pre-announcement. And I just kind of wanted to walk back through sort of the dynamics of how the quarter progressed from when you guys gave the original guidance. I guess, obviously, the market went down. There was inventory corrections and whatnot.\n\nBut just how quickly did you guys see that? And I guess the real question coming out of this is, how are you thinking about changes you might make in monitoring inventory levels or working with your channel partners? Just any changes you're thinking about making operationally to the business to sort of protect from this kind of thing coming and, I guess, going forward? Any color there would be really helpful.\n\nLisa Su -- President and Chief Executive Officer\n\nSure, Matt. So, yes, the third quarter, the PC market was very volatile. Going into it, we expected the market would be weak. It was weaker than we expected.\n\nAnd the weakest portion of the market is a consumer market where we tend to be more heavily weighted. I think the thing that perhaps we saw in the market is we -- as the overall macro economy has also weakened, customers, in general, across the board, have just become more cautious. So, even as they were selling through their inventory, they were not replenishing stock to the same levels. And frankly, we were coming off of a supply demand imbalance where in the first half of the year, people were actually trying to gather inventory, and we had been in a supply constrained situation.\n\nSo, it is a very dynamic situation, I would say. I think that we have great partnerships across the supply chain. I feel good about the visibility that we have. I think the market will continue to be volatile, but we will -- we're all sort of biased toward reducing inventory levels so that we can better react to the market factors and the market situation.\n\nSo, hopefully, that helps a little bit.\n\nMatthew Ramsay -- Cowen and Company -- Analyst\n\nI definitely appreciate that, Lisa. Thank you.\n\nOperator\n\nNext question today is coming from Joe Moore from Morgan Stanley. Your line is now open.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. I wonder if you could talk a little bit about your visibility in the Xilinx part of the business to the extent that we've seen some weakening in kind of broader markets here and there. But generally, it's OK.\n\nLike can you just talk about how long your visibility extends there, how you feel about growth into next year?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Absolutely, Joe. So, the Xilinx business, our Embedded business has been performing just extremely well. Another very strong quarter in Q3, and we have -- we see growth into the fourth quarter.\n\nWe have been very focused on what's happening within the various subsegments. I think the nice part of the business, as you know, is that it has -- it's very broad-based. So, we have seen communications was up for us. Aerospace and defense, very strong.\n\nAutomotive was also up for us here in the third quarter. We did see some weaknesses. Consumer was weak. There was some subsegments of industrial.\n\nSo, test and measurement was weaker in the third quarter. So, we do see the puts and takes there. But overall, I would say the business has strong visibility. We are still supply constrained in certain nodes and some of the legacy nodes.\n\nWe've made a lot of progress on supply. So, we're seeing additional supply come in, in Q4, and that leads us to good confidence in Q4. We expect the first half -- again, we have multiple quarters of visibility just given the lead times in that business, and we'll be watching it very carefully. But I would say overall, the products portfolio is strong, and we've also gained some share in that business as well.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nThanks very much.\n\nLisa Su -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nThank you. The next question today is coming from Ross Seymore from Deutsche Bank. Your line is now live.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nHi, everybody. Thanks for letting me ask a couple questions quickly here. Let me ask a couple of questions quickly here. Lisa, if you could give us a little color.\n\nYou talked about the fourth quarter being, I guess, down modestly in Client and Gaming. Can you give relatively similar color for Data Center and Embedded just because the volatility between segments, obviously, has been huge over the last couple of quarters?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Sure, Ross. Well, since -- on an absolute level, we're talking about flattish from Q4 to Q3, 5.5 versus 5.6. So, modest decline in Client and Gaming.\n\nWithin Gaming, we would expect consoles to be down in the fourth quarter given they're coming off of Q3, which is their peak. That's offset a bit by our new graphics launch that is occurring in the next few weeks. And then as it relates to Data Center and Embedded, it's about the same, let's call it, modest plus as we go forward. We expect, again, cloud to be stronger than enterprise.\n\nThat's some of the margin dynamics that we were asking earlier. And Embedded, as we get more supply, you know, modestly up as well.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nGreat. That's perfect. And then as my follow-up, one for either you or Devinder. As we think about opex for next year, how do you guys philosophically balance the desire to stick to your business model that you laid out at your most recent Analyst Day versus the desire to continue to spend, continue to gain market share, put out the great new products and execute that you've done so well? Are those kind of buffers conflicting against each other? And how, if so, do you reconcile that confliction?\n\nDevinder Kumar -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nYeah. I think the key thing is we continue to invest in the strategic areas, in Data Center and Embedded, and the product road maps. The macro environment has weakened, soft PCs. And we are taking actions to reduce expenses, especially in the rest of the business besides what I talked about earlier in terms of the areas of focus, and we have slowed down hiring.\n\nSo, you're right, Q4, if you look at E2R business is high, but we are very disciplined in terms of what we're going to do. Expense actions do take time to kick in. And we expect that as we go out into 2023, the E2R comes more in balance with the revenue, and we manage it in line with the revenue out in time.\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. And maybe, Ross, if I'd just add on top of that. I think we have the opportunity -- we have multiple levers in opex. So, we are going to be very disciplined, as Devinder said.\n\nThat being the case, I mean, we feel very good about our strategic direction around Data Center, Embedded, and the commercial markets. So, we want to continue to invest there where we will be more conservative on the consumer-facing portions of our business, and that's how we'll manage through 2023.\n\nOperator\n\nThank you. Next question is coming from Ambrish Srivastava from BMO. Your line is now live.\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nThank you very much. Lisa, I wanted to come back to the PC business. There's such a big disparity between your 3Q guide and what Intel guided to or reported versus what they're guiding to in 4Q. And usually, things normalize over a longer period of time.\n\nBut I just wanted to understand, is it a case of they took their medicine earlier and AMD continued to over-ship versus demand? Just kind of help us understand. And there seems to be also a dynamic that Intel is raising pricing in 4Q. So, there was some pull-in ahead of that. And I have -- I've been getting a lot of questions myself.\n\nI don't understand specific disparity. So, any help would be very helpful.\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Sure, Ambrish. Look, I think -- again, let me comment on our business, right? So, for our business, as we exited the first half of the year, I think we were planning for a sort of a reasonable PC market in the second half. Usually, the third quarter is higher than the first half.\n\nAnd the third and the fourth quarter are seasonally higher. And so, that's what we were building to, together with our customers, by the way, with that expectation. I think the market weakness, as well as just the overall caution in the environment just caused people to behave a bit differently, and that really required us to work together with our customers on the inventory corrections. And as you said, there were some temporal sort of dynamics.\n\nAnd we're aware of those temporal dynamics. Some of it is very -- sort of very aggressive pricing that we chose not to follow. And again, that's a decision that we made. And others are, as you might expect, there might be some temporal optimization that people are doing.\n\nI don't think there's anything fundamental. I think fundamentally, our product portfolio is strong. I think we have very good platforms in place, and we'll work through this. I fully agree that it's kind of a messy market environment that we have to work through, but we will work through it.\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nGot it. Good. Thank you. And I had a follow-up for you, Devinder.\n\nJust talk about capacity opening up at the foundries. And we had this conversation at the Analyst Day about the headwind to free cash flow given your need or desire to secure capacity. Is that going to temper off now -- taper off as we go through the remainder of the next few quarters as there should be more capacity that's available, plus on the PC side, you should need much less than what you needed a couple of quarters ago? Thank you.\n\nDevinder Kumar -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nYeah. I mean, the capacity agreement that we were working on, which have some benefit, especially as Lisa talked about earlier in the service space, these are long-term agreements we put in place to support the growth of the business. Given the market backdrop, we work actively with our suppliers in aligning supply with timing of revenue and ramp up products. And that's something that we are able to do with our suppliers given what's happened to the market.\n\nSo, there is, from that standpoint, some flexibility overall. And that's something we'll work through over the next two to three quarters.\n\nOperator\n\nThank you. Your next question is coming from Harlan Sur from JPMorgan. Your line is now live.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nGood afternoon. Thanks for taking my question. In Data Center, the team continues to expand the number of compute instances with your cloud customers on Milan. It seems like the momentum is carrying up through the ramp of your fourth-generation Genoa platforms.\n\nI think this is a very good dynamic. I assume you guys have good visibility here. So, how long does the Milan momentum continue into next year? And are your cloud customers already qualifying Genoa? And when do you expect Genoa to start to kick into high-volume ramp?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Thanks for the question, Harlan. So, yes, look, we're very happy with our Milan sort of workload ramp. We are continuing to ramp Milan here this year and then into next year as well.\n\nAs it relates to Genoa, we did start initial shipments of Genoa to our strategic customers in the third quarter. That is continuing in the fourth quarter. So, we're ramping production in the fourth quarter. A lot of the, let's call it, the qualifications or the first instances are being qualified here in the fourth quarter into the first quarter.\n\nAnd what we've said before is that Milan and Genoa are going to actually coexist for quite some time just given how competitive both are. Genoa is a new platform. It is new DDR5 and PCIe 5.0, and that takes a bit longer for people to qualify. And so, we would expect both to continue to ramp in 2023, and that's how we're planning the business.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you. And, you know, despite the macro concerns and, as you mentioned, some near-term workload optimization, your North American cloud customers, I mean, they're still growing their cloud services business at a strong 30%, 40% year-over-year growth rate. And I assume that these types of growth rates like the consumption of compute networking, storage workloads, and therefore, installed utilization, like this is all quite strong in driving the need to build out more compute capacity.\n\nIs this what's driving the team's sort of strong midterm outlook for this segment? Or is it more a function of your strong product lineup with Genoa and continuing to capture greater compute share or both?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Right, Harlan. I would say it's a little bit of both. And I think you said it well.\n\nIn the very near term, there is a little bit of optimization that each cloud vendor is doing. But in the medium term, what our customers are telling us is they need more compute. And the more compute is for additional workloads, you know, building out. It's also for upgrade of, let's call it, older compute given our new products have very strong TCO, power efficiency, given the cost of power and energy around the world.\n\nWe're actually seeing that also be a driver for some of the conversion to AMD in the cloud as we go into 2023.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nThank you, Lisa.\n\nLisa Su -- President and Chief Executive Officer\n\nThanks, Harlan.\n\nOperator\n\nThank you. Next question is coming from Chris Danely from Citi. Your line is now live.\n\nChris Danely -- Citi -- Analyst\n\nThanks, guys. So, if we take the macro out of it, can you just go through your share expectations in desktop, notebook, and server, let's just say, for the next 12 months or so?\n\nLisa Su -- President and Chief Executive Officer\n\nLet's see. I'm trying to think how do I take the macro out of it. So, your question is -- put the actual TAM aside and just talk about where we're going from a share standpoint? Is that your question?\n\nChris Danely -- Citi -- Analyst\n\nYeah. You can say relatively where you expect to gain more or less.\n\nLisa Su -- President and Chief Executive Officer\n\nI got it. I got it. OK. Yeah.\n\nI want to be responsive to the question. Well, let's start with the Data Center. I think in the Data Center, we believe that we will continue to gain share. We expect to continue to gain share in both cloud and enterprise.\n\nWe are more underrepresented in enterprise. And so, again, that's a key focus for us. But as we just stated in the last few questions, I think North America cloud, in particular, I think we see line of sight to significant new deployments based on our current road map. In the desktop and notebook business, our focus is on certain segments.\n\nSo, we're very focused on premium. We're very focused on gaming. And we're focused on commercial. I think in those areas, there are, again, opportunities for us to continue to gain share.\n\nI think in desktop DIY business or sort of the desktop channel business, we have a strong lineup. We just launched the new Ryzen 7000 Series. We have additional products that we'll launch next year as well. And that's sort of the puts and takes in the various businesses.\n\nChris Danely -- Citi -- Analyst\n\nSure. And then as my follow-up, I guess, just getting back into the macros that you mentioned that ASPs are getting a little -- or at least pricing is getting a little tough on CPUs. If this downturn in PCs continues into next year and if it spreads into the data center market, how do you think of pricing going forward? And would you choose to maybe give up some share if your competitor remains aggressive on price and the environment stays difficult?\n\nLisa Su -- President and Chief Executive Officer\n\nChris, I think we're -- we have a very strong value proposition. Our strategy is not to lead on price. So, if you look at -- look in the Data Center, although price is one factor, we find price is not the leading factor in the majority of the selections. There is work for us to do in terms of workload optimization, and that's where a lot of our focus has been in the Data Center.\n\nSo, hopefully, that answers that piece. As it relates to the PC business, it is more price-sensitive. We have seen it become more price-sensitive. I think, again, where we have a strong value proposition, we will continue to be very competitive.\n\nBut even back a year ago, we didn't choose to compete in the Chrome market because, again, that was just not a profitable business for us. And so, we're going to be disciplined in ensuring that what we're taking is profitable business.\n\nChris Danely -- Citi -- Analyst\n\nGot it. Thanks, Lisa.\n\nLisa Su -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Next question is coming from Timothy Arcuri from UBS. Your line is now live.\n\nTimothy Arcuri -- UBS -- Analyst\n\nHi. Thanks a lot. I had two. Lisa, first, I wanted to ask about U.S.-China trade.\n\nAnd I guess the recent restrictions, they didn't seem to have too much direct impact on you, but the direction of travel seems pretty clear. And you report China as 25% of revenue, but that's sell-in. So, I'm wondering if maybe you can help us with what China is on a consumption basis and kind of how you handicap where your China TAM is going. When you're making these investment decisions, how do you think about the U.S.-China trade and the direction of travel? And I had a follow-up, too.\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. Sure, Tim. So, we are certainly watching the situation very closely. Upon reviewing all of the new regulations as they have gone into effect, it is minimal impact on our revenue in the near term.\n\nWe're certainly working very closely with commerce and the rest of the U.S. government on how those are rolling out. And then I think on a medium-term basis, again, my view on these things is we will always follow the U.S. regulations and understand the need for national security.\n\nThe majority of our China business is, let's call it, non-data center. So, it's more in the PC business, as well as in some of the consumer-facing businesses. So, we are paying attention to that as we go forward in the business. But for the near term, we have not seen any significant impacts, and we'll continue to follow it very closely.\n\nTimothy Arcuri -- UBS -- Analyst\n\nThanks, as always. And then I guess I wanted to ask a question about PCs. So, you guided in late July, and it seemed like things were fine. And then we lost basically $1 billion basically in two months.\n\nIt would seem like those were massively weak months, and I would think that maybe there's been some improvement in the run rate when you kind of head into Q4. Does that mean inventory has sort of leaned out a little bit? I mean, the market probably only absorbed, I don't know, 58 million units in Q3. And if you annualize that, you're at 200 million units a year. It's like hard to get PCs that bad next year.\n\nSo, I'm just kind of wondering if you can comment on sort of the run rate because August and September must have been terrible months. Thanks.\n\nLisa Su -- President and Chief Executive Officer\n\nThe PC market certainly was volatile in the third quarter. I would say that we did drain a good amount of inventory in the third quarter. I think we are -- our guide indicates a desire to drain more in the fourth quarter, and I think we will make progress in that. And of course, it all depends on how the macro behaves over the next couple of months.\n\nBut like I said, I think we are -- we have good visibility into the various market factors, and we're planning for a weaker PC environment in the fourth quarter.\n\nTimothy Arcuri -- UBS -- Analyst\n\nThanks.\n\nRuth Cotter -- Senior Vice President, Worldwide Marketing, Human Resources, and Investor Relations\n\nOperator, we'll take two more questions, please.\n\nOperator\n\nCertainly. Our next question is coming from Blayne Curtis from Barclays. Your line is now live.\n\nBlayne Curtis -- Barclays -- Analyst\n\nHey, thanks for taking my question. I want to go back to just the pricing question prior. If you look at the decline in your Client business, a little over 50%, is there a way to think about units versus pricing there? And I think there's a couple of factors. I'd be curious your thoughts mix away from the high end, but then you mentioned competition, just kind of your thoughts as to that impact to pricing as well.\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. So, Blayne, it was certainly more units. I think Stacy asked the question earlier. ASPs were down sequentially, but they were up year over year.\n\nSo, the decline was more driven by units, but there was an ASP factor on a sequential basis. And then in terms of what we see in the market, I would say that as the market weakened, there was sort of more pressure at the high end in terms of just velocity and desire to clear inventory. And so, the mix did mix toward lower ASPs and toward more incentives to clear that inventory. As it relates to longer term, though, I don't feel like there's a longer-term significant mix change, if that's what you were asking.\n\nBlayne Curtis -- Barclays -- Analyst\n\nI guess the second part -- maybe I'll ask the second part is – you know, gross margins are down 100 basis points from Q3 to Q4. Mix is kind of going in your favor with Data Center and Embedded. But then I guess you're saying PCs are not down that much, so I can't -- I guess I was figuring maybe pricing is not that bad either. So, I guess that's a long way of asking, again, what's the reason for the core margins to be down 100 basis points from Q3 to Q4?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. OK. So, let me try that. So, if you think about what we see in the business, there's a couple of factors.\n\nSo, if you say, excluding the charges that we described, the $160 million in Q3, we were about 52%. We're guiding to 51%. We do see the client market continuing to be weak. We want to make sure that we have -- we do clear additional inventories.\n\nWe do see in Data Center a mix to -- when the mix is higher for North America cloud, that tends to be lower ASPs just given the environment in that business. And then Devinder mentioned that as we increase capacity, particularly in the server market, there were some -- we have some additional capacity coming online, and that has a bit of cost impact. So, those are the couple of factors that get you to the 51%.\n\nBlayne Curtis -- Barclays -- Analyst\n\nThanks.\n\nLisa Su -- President and Chief Executive Officer\n\nSure.\n\nOperator\n\nThank you. Our final question today is coming from Harsh Kumar from Piper Sandler. Your line is now live.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nYeah. Hey, guys. First of all, thanks for squeezing me in. Lisa, I had a question of the near-term to, call it, midterm view of the data center market.\n\nDo you think that the data center market is inherently growing in the December quarter, the market, not AMD? And do you think -- and/or do you think you're growing because you're launching Genoa? And to that point, you talked about dislocations and sort of the cloud and the data center market. I was curious what specifically are you seeing? And if you could differentiate between -- are you seeing just slower growth, or is there inventory that's built up? And then I've got a follow-up.\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. So, look, what I would say is, again, on a very discrete basis, I wouldn't say the overall data center market is necessarily up. Just given the macro impact, there is some impact on overall spending. In terms of our business, we do have a weighting toward North America cloud that tends to be sort of the most resilient part of the market.\n\nAnd then as it relates to what's happening in the market, like I said, I think what's happening is -- enterprise is weak. I think that is overall people -- businesses are just being more cautious. China is weak and has been weak all year. And then in cloud, in general, there's not in general.\n\nEvery customer is a bit different in what they're trying to do. Some are just optimizing inventory, some are optimizing footprint, and then some are continuing to build. And so, I wouldn't call it a market per se. I would call it their individual instances for each customer.\n\nWhat's helpful for us is -- what we're talking about is not just Q4 with our customers. We're really talking about what do they need for all of 2023. I mean, we are coming from a place where we were supply constrained. And so, we're planning for the capacity that's necessary.\n\nAnd there, we see which workloads are moving and when are they moving each of the workloads. And so, that gives us some visibility into what their spending plans are for 2023.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nVery helpful, Lisa. And then for my last follow-up, can you talk about the gaming market in general? Of course, September, you mentioned was the peak quarter. So, December will be off some. But is this also the peak Gaming year in 2022? And should we be thinking that Gaming will be down? Or just because these things are still so hard to get, to try to go buy PS5, you still can't get your hands on it easily.\n\nSo, do you think there's more legs left to the growth next year?\n\nLisa Su -- President and Chief Executive Officer\n\nYeah. So, Harsh, we do believe that there is still some pent-up demand, especially coming into this holiday season. So, Q3 was the peak for us this year. Q4 is down seasonally, as you might expect.\n\nGoing into next year, I think there are puts and takes. I would say the best way to model at this point is to model Gaming segment flattish. And let's see how the holiday season goes, but that would be the way we would call it at this point.\n\nOperator\n\nThank you. We've reached end of our question-and-answer session. I would like to turn the floor back over for any further or closing comments.\n\nRuth Cotter -- Senior Vice President, Worldwide Marketing, Human Resources, and Investor Relations\n\nThanks, Kevin. Thank you, everybody, for tuning in today, and we look forward to connecting with you all throughout the quarter. And we have two important product launches coming up here in the next 10 days, so we'll look forward to that engagement. Thanks, everyone.\n\nThis concludes the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRuth Cotter -- Senior Vice President, Worldwide Marketing, Human Resources, and Investor Relations\n\nLisa Su -- President and Chief Executive Officer\n\nDevinder Kumar -- Executive Vice President, Chief Financial Officer, and Treasurer\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nMatthew Ramsay -- Cowen and Company -- Analyst\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nAmbrish Srivastava -- BMO Capital Markets -- Analyst\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nChris Danely -- Citi -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nBlayne Curtis -- Barclays -- Analyst\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nMore AMD analysis\n\nAll earnings call transcripts"
}