{
  "companyName": "Hostess Brands, Inc.",
  "companyTicker": "TWNK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/hostess-brands-inc-twnk-q3-2022-earnings-call-tran/",
  "content": "Hostess Brands, Inc. (TWNK -0.49%)\nQ3 2022 Earnings Call\nNov 02, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to Hostess Brands Inc. third quarter 2022 earnings conference call. [Operator instructions] As a reminder, this conference is being recorded. I would now like to turn the conference over to your host, Amit Sharma, vice president, investor relations.\n\nThank you. You may begin.\n\nAmit Sharma -- Vice President, Investor Relations\n\nGood afternoon, and welcome to Hostess Brands third quarter 2022 earnings conference call. Joining me on today's call is Andy Callahan, Hostess Brand's president and CEO; and Travis Leonard, chief financial officer. By now, everyone should have access to the earnings release for the period ended September 30, 2022. That was published at approximately 4 p.m.\n\nEastern Time. The press release and investor presentation are available on Hostess website at hostessbrands.com. This call is being webcast, and a replay will be available on our website. During the course of this call, management will make a number of forward-looking statements, including expectations and assumptions regarding the company's future performance.\n\nActual results may differ materially from these forward-looking statements and we undertake no obligations to update or revise these forward-looking statements. A detailed list of these risks and uncertainties can be found in today's earnings release and in our SEC filings. Management will make a number of references to non-GAAP financial measures that we believe will provide useful information to the investors. A full reconciliation of these non-GAAP measures to the most comparable GAAP measures is included in the earnings release.\n\nWith that, I'll turn the call over to Andy Callahan, our President and CEO.\n\nAndy Callahan -- President and Chief Executive Officer\n\nThank you, Amit. I would like to begin with a few highlights from another quarter of strong top and bottom-line results. I will then offer a few comments on our long-term growth outlook before handing it over to Travis for a detailed review of our quarterly financial results. We will close with a discussion of our higher guidance for the full year before opening up to you for questions.\n\nLet me start with the third quarter, which delivered strong growth across all three key elements of our financial performance: Net revenue, adjusted EBITDA and adjusted EPS. The growth was driven by successful pricing and revenue growth management initiatives as well as improving supply chain execution and productivity savings, which helped to mitigate inflation. Given our strong year-to-date results and continued momentum, we are raising our full year top and bottom-line outlook. We now expect our 2022 net sales to increase by 17% to 19%, while raising our full year EBITDA and EPS growth guidance to $290 million to $293 million and $0.96 to $0.98, respectively.\n\nNow a few highlights for the quarter. We delivered 20% organic net revenue growth with a stronger contribution from price mix as we executed our most recent pricing actions. Our strong top line led to solid bottom-line growth with our adjusted EBITDA and adjusted EPS increasing by 12.2% and 9.5%, respectively, even as we continue to encounter pockets of supply chain fragility and elevated cost inflation. The third quarter was our 11th consecutive quarter of at least 9% revenue growth and the sixth consecutive quarter of double-digit growth.\n\nIt was also notable that we were able to keep our volume essentially flat in the quarter, demonstrating the strength of our portfolio supported by our innovation and marketing investments and focus, which helped to offset elasticities from recent pricing actions. We are well positioned to continue to drive growth during the challenging economic times due to the resiliency of our categories, our pure-play snacking portfolio and our accessible price points. At the retail sales level, sweet baked goods and cookies both posted strong broad-based growth in the quarter. Our sweet baked goods point of sale led by the Hostess brand grew by 17% in the quarter.\n\nAs expected, pricing was a bigger driver of Hostess growth during the quarter as retail prices increased by double digits, reflecting our recent pricing actions and our continued focus on revenue growth management. Underlying consumption trends remain solid as snacking frequencies, including for sweet indulgent snacks remain elevated even in the post-pandemic environment. Our access to all retail channels and our affordable price points are particularly attractive in the current environment as consumers seek better value to fit with their lifestyle and consumption occasions, which is reflected in another quarter of double-digit growth for Hostess Brands single-serve and multipack offerings. Point of sale for each increased by more than 15% during the quarter, with two-year stack growth of approximately 33% and 29%, respectively, both well ahead of underlying category trends.\n\nTurning to the Voortman brand. Voortman point of sale increased by 28.8% in the quarter including 28.1% growth in the sugar-free segment where it gained 500 basis points of share during the quarter. Voortman's strong ongoing growth momentum continues to be driven by expanding distribution and our investments in advertising to increase brand awareness and impactful innovation. We continue to be very pleased with the performance of Voortman business, which is margin accretive to our portfolio and is continuing to deliver against our initial expectations.\n\nWith strong double-digit top and bottom-line growth over the last three years, we have built an impressive track record of strong performance during a period of unprecedented volatility and challenges. More importantly, as I said at our March investor day, despite an increasingly complex consumer and macroeconomic environment, I continue to believe the foundation of Hostess brands has never been stronger, and I've never been more confident of our team's capabilities and drive to deliver our long-term growth algorithm. Let me offer a few highlights. First, we have unique access to broad, fast-growing snacking occasions and a best-in-class business model that fits perfectly with our impulse-driven categories.\n\nThe indulgent sweet snacking segment is one of the largest and fastest-growing segments within macro snacking, which itself continues to grow faster than overall food and has also shown to be consistently more resilient in prior economic downturns. In fact, a recent survey to better understand the impact of the current environment on our consumers and core categories signal the majority of the consumer surveyed are indeed worried about the economy and plan to cut back spending. However, a vast majority of the same consumers indicated they will continue to look for new snacking options and 82% say that sweet snacks brings them joy, especially during times of uncertainty. This is consistent with other data and research and reinforces our belief that the Hostess Brands portfolio is well positioned as consumers look for value in the current environment.\n\nWithin the overall macro snacking universe in which we compete, we are attractively priced relative to other snack offerings, providing consumers an accessible option as they look to stretch their shopping dollars. In addition to our presence in growing categories, we are targeting the most attractive snacking occasions where Hostess and Voortman are uniquely positioned to win. We are prioritizing five fast-growing occasions, which are more than $50 billion in retail sales and provides us a large and sustainable platform for our future growth. Now second, we're accelerating innovation, marketing and consumer-facing capabilities to fully unlock the potential of our iconic brands and access to these attractive snacking occasions.\n\nOur impactful innovation is a key driver of our growth strategy. We have not slowed our investments in innovation even during times of resource constraints and supply chain challenges. Our retail partners have certainly noticed that, and they are equally enthusiastic about our innovation. And it's really about how we are leveraging our occasion-based framework, our consumer and shopper insights to innovate and generate profitable and sustainable growth.\n\nFrom last year's standout Baby Bundts to this year's highly anticipated Hostess Bouncers, we are building and executing a multiyear pipeline of new products to continue our innovation momentum and drive category growth. Bouncers, which reimagines our iconic Twinkie, Ding Dong and Donette offerings in a poppable version ideal for the lunchbox occasion is off to a strong start. While it is early, we've had strong display support for the key back-to-school period with good sell-through, driving trial and expanding placement in the traditional channels before its introduction into convenience store channel this month. As we are committed to increasing our advertising and marketing support for both our innovation and core products, as we mentioned at our investor day earlier this year, our A&M spending will likely grow ahead of our expected revenue growth over the next several years as we establish a new base level of spend to support long-term mid-single-digit top-line growth.\n\nThat said, we continue to be highly disciplined with our A&M spend to ensure we achieve a high ROI. Our test and learn process is proving to be successful, and provides us the confidence that our future investments will drive continued profitable growth. We also continue to invest in talent throughout the organization, including our bakeries, warehouse and importantly, in our R&D and product quality teams. Last month, we announced the addition of Adrian Poretti as our chief supply chain officer.\n\nAdrian joins us with nearly 30 years of diverse supply chain experience with Kimberly Clark, which began in his native Argentina and culminated as head of global capabilities. His appointment continues our track record of attracting industry-leading talent to build upon our strong execution history and capability development. Additionally, our innovation and marketing investments are attracting new households to our brands. And our investment in product quality are driving an increase in our two time buyer at more than twice the rate of the category.\n\nThese two consumer fundamental metrics together reinforces my confidence that our model is working and are good indicators of the sustainability of our top-line growth. Third, in addition to pricing actions, we continue to pull on multiple levers to manage the current inflationary environment as well as protect and modestly expand margins over the long term. As expected, higher prices to offset elevated inflation were the main driver of both our top and bottom line during the quarter. Revenue growth management is a key component of our growth flywheel, and we continue to step up efforts to accelerate our productivity agenda.\n\nOur productivity initiatives which span procurement, our bakeries, transportation and distribution are also gaining traction and are beginning to deliver results. Overall, I'm proud of our dedicated and talented workforce for continuing to execute at high levels through these challenging periods. While we successfully navigate the current environment, we remain focused on growing the white way over the long term. We are making great progress in corporate responsibility initiatives as outlined in our second corporate responsibility report, attaining our key CSR goals as part of strategic objectives of our executive team with direct oversight from our board as we continue to build a strong, sustainable corporate culture that values nimbleness, integrity, tenacity, inclusivity and a commitment to quality.\n\nIn summary, I am pleased with our strong quarterly and year-to-date results, which are enabling us to raise our full year sales, EBITDA and EPS guidance and build on our track record of delivering excellent results through a challenging operating environment. We are executing on our strategic priorities and remain confident in our ability to deliver our attractive long-term growth algorithm. With that, let me turn it over to Travis to go through the quarterly financial results and our revised outlook in greater detail.\n\nTravis Leonard -- Chief Financial Officer\n\nThanks, Andy. I'm proud to speak to another quarter of outstanding performance at Hostess. I will start with a review of our top-line results. Organic net revenue for the third quarter increased 20.2% to $346.2 million, another record sales quarter for Hostess Brands.\n\nOur top line was driven primarily by price mix, as we benefited from planned pricing actions and successful execution of our revenue growth management initiatives. Volume was essentially flat even with additional pricing flowing into the market. Our sweet baked goods portfolio, nearly 90% of total sales grew 18.7% during the quarter, while our cookie portfolio grew 33.2%, demonstrating growth across our entire portfolio. Switching to retail sales trends.\n\nOur Nielsen measured sweet baked goods point of sale increased by 17% for the 13-week period ending October 1, with broad-based growth across all key channels. Voortman POS increased by 28.8% in the period, nearly double the 13.4% growth for the overall cookie category, driven by pricing, innovation, and distribution gains with strong growth in the sugar-free subsegment. Voortman share of the cookie category increased by nearly 30 basis points in the quarter. As Andy mentioned, both our single-serve and multipack offerings grew by double digits during the quarter.\n\nOur breakfast portfolio also continued to outperform the subsegment with 20.6% growth in the quarter compared to 18.3% for the total breakfast subsegment, driven in part by our impactful innovation. Moving to the rest of the P&L. Adjusted gross profit of $116.1 million increased by 16.9% in the quarter, driven by pricing actions, revenue growth management initiatives and productivity savings, partially offset by inflation. Adjusted gross margin of 33.5% for the quarter declined 93 basis points from the year ago period as 18 and a half percent inflation and inefficiencies caused by continued supply chain fragility, were partially offset by favorable price mix and benefits from productivity initiatives in the quarter.\n\nMore specifically, our continued focus on development of our revenue growth management capabilities led to higher net price realization during the third quarter, which is historically our largest promotional quarter. Adjusted EBITDA increased by 12.2% to $72.7 million in the quarter as higher gross profit was partially offset by higher operating expenses. Our adjusted operating expenses, including SG&A increased by 23.9% to $61.9 million, driven primarily by planned investments in our people and capabilities as well as higher depreciation and advertising spend. Adjusted EBITDA margins declined by 150 basis points to 21%, primarily due to lower gross margin, as previously discussed.\n\nOur effective tax rate, excluding discrete items, was 26.7%, consistent with the prior year quarter and largely in line with our 27% outlook for the full year. Adjusted net income of $32.2 million for the quarter increased 11.4% from the prior year period. Adjusted earnings per share of $0.23 increased 9.5% as the contribution from higher EBITDA was partially offset by higher depreciation and amortization. At the end of the quarter, we had cash and cash equivalents of $190.8 million, short-term investments of $41.9 million and net debt of $850.5 million, with a net debt leverage ratio of 2.9 times, which is at the bottom of our targeted three to four times range.\n\nIn the quarter, we received insurance proceeds of $33 million under the representation and warranties insurance policy we purchased in connection with our 2020 acquisition of Voortman. During the quarter, we repurchased $45.5 million worth of shares under our previously announced $150 million repurchase program. Turning to our outlook for the year. Given our strong quarter and year-to-date results, we are raising both our top and bottom-line guidance for 2022.\n\nWe now expect full year net revenue growth of 17% to 19%, up from our previous guidance of at least 15% growth. We continue to expect full year volume to increase by low to mid-single digits. Our strong year-to-date execution is enabling us to increase our full year EBITDA guidance range. We now expect adjusted EBITDA of $290 million to $293 million, up from toward the high end of the $280 million to $290 million range.\n\nWe are also increasing our EPS guidance to a range of $0.96 to $0.98 per share, up from the previous $0.93 to $0.98 per share range. We now expect our full year capex to be within the range of $125 million to $135 million versus the previous $120 million to $140 million range. Our expected tax rate of 27% remains unchanged from our original guidance. We now expect average shares outstanding of approximately $138 million, down modestly from the previous range of $138.5 million to $139.5 million.\n\nConsistent with our last call, we continue to expect high teens inflation for the full year. However, given the timing of certain costs, our Q4 inflation rate is expected to be higher than Q3, and we are covered for our market-traded commodities for the remainder of the year. We now expect full year gross margins to come in slightly better than our previous outlook of down 200 basis points versus prior year, driven by better-than-expected contribution from revenue growth management and productivity initiatives in the second half of the year. As previously communicated, we will continue to make targeted investments across the organization, including investments in our people, capabilities, products and brands.\n\nOur most recent innovation, Bouncers is off to a good start, and we will meaningfully step up advertising and marketing support in the fourth quarter to drive awareness and trial. I am proud of our team's ability to deliver another quarter of strong top and bottom-line performance in a dynamic operating environment, and I'm excited to continue our journey of driving sustained profitable growth. With that, I will turn it back to Andy for closing comments. \n\nAndy Callahan -- President and Chief Executive Officer\n\nThanks, Travis. We are grateful for the confidence that you have placed in our ability to successfully navigate the challenging environment. And once again, I would like to close by thanking and congratulating the talented Hostess team who put their hearts into everything they do. We are well positioned to deliver our raised outlook for 2022 and remain focused on delivering our attractive long-term growth and leading shareholder return over time.\n\nWith that, we are ready for your questions. \n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Pamela Kaufman with Morgan Stanley. Please proceed with your question.\n\nPam Kaufman -- Morgan Stanley -- Analyst\n\nHi. Good evening.\n\nAndy Callahan -- President and Chief Executive Officer\n\nHi, Pam.\n\nPam Kaufman -- Morgan Stanley -- Analyst\n\nHi. I have a question about your outlook for pricing. So several companies, particularly in the snacking space are implementing additional rounds of pricing given continued input cost inflation. What is your preliminary sense for next year's inflation outlook? And based on your forecast, do you anticipate needing to take additional pricing?\n\nAndy Callahan -- President and Chief Executive Officer\n\nHey, Pam. Thanks for the question. Good to hear from you. It's too early to talk about '23.\n\nSo we're not really going to speculate on '23. We'll do that next quarter. What I will say, however, pricing for us is the last resort. We continue to evaluate future pricing actions really in the broad context of the consumer, but also our ability to continue to drive efficiencies, revenue growth management, which Travis talked about today, our productivity initiatives.\n\nSo it's all the balance of making sure we're delivering the right consumer value in a responsible way and also managing our revenue growth management in all of our efficiency. With all that being said, we feel we're really well placed both in our snacking categories, the resiliency of our categories, our underlying trends, our innovation and our marketing initiatives. So we take all of those into consideration as we look for more long-term sustained value creation. So too early to talk about '23.\n\nWe look at it all the time. We look at it within a balanced lens. And right now, as we end '22, all the pricing we need to deliver on our commitments for '22 are in the market as we talked about last time it flowed through in July. Anything to add to that, Travis?\n\nTravis Leonard -- Chief Financial Officer\n\nI think you got it, Andy.\n\nPam Kaufman -- Morgan Stanley -- Analyst\n\nThanks. And then my second question is just on your guidance, which has moved up for top line and but you've narrowed your EPS range despite projecting a lower share count. So can you just talk to what's kind of limiting the flow-through to EPS from higher EBITDA? And how should we think about your interest rate exposure in the current rising rate environment?\n\nTravis Leonard -- Chief Financial Officer\n\nYes. So thank you, Pam. This is Travis. Thanks for the question.\n\nI'll handle this, and I'll separate them between your EPS question and then interest rates. So first, I'll talk about EPS. So we did raise the bottom end of the range. As you've talked about, we have bought back shares, and you see that in our prepared comments.\n\nWhen we think about our EPS, there's a lot of activity going on in our business and many of which we've alluded to. We've talked about the amount of innovation that we've done. We've talked about our investment and innovation. We've talked about our capital allocation against our core business, which includes Arkadelphia and a meaningful spend we have there.\n\nSo those are a lot of dynamics going on in the business. And the reason why I set that up is that as we look at our assets, we are continually focused on our network optimization, delivering our long-term innovation pipeline and driving productivity and efficiency initiatives. And in doing so, we regularly evaluate the underlying assets across our manufacturing base to ensure that we are advancing those capabilities in the most efficient and productive way. So from time to time, this requires us a way to shift from certain assets that are not advantageous to everything that I talked about to supporting our growth.\n\nAnd that's what's playing out in the EPS line, and you see that in the depreciation and amortization, is our conscious decisions about ensuring that we have the right assets that are going to drive the growth in those areas that I talked about. So now, I'm going to pivot to your interest. So I'm really excited about our interest expense. We've done a really good job managing our interest expense.\n\nJust to give you a little bit of context, 65% of our debt is essentially fixed at approximately 4% interest rate. Our effective interest rate for Q3 was about 3.8%. So we're really proud about that given the current interest rate environment that we are in. So obviously, we will have interest expense rise as we continue to operate in this environment.\n\nBut obviously, the fixed debt at 65% does give us a bit of a help there. So I would anticipate interest expense to go up in Q4. And as long as the interest rate environment remains as is, we will continue to experience higher interest expense on that variable portion of our debt.\n\nPam Kaufman -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question is from David Palmer with Evercore ISI. Please proceed with your question.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThanks. A question I wanted to ask you on gross margin. A year ago, it was roughly 36% or in the low 36s. And I'm just wondering how you're thinking about that as a target over time.\n\nAnd if we were to break down the roughly 200 basis points of decline, how much would you say is supply chain friction versus pricing behind commodity inflation?\n\nTravis Leonard -- Chief Financial Officer\n\nYes. So thanks for the question. As you can imagine, given what we've shared year-to-date, inflation is in the high teens. Q3 was 18 and a half percent and Q2 was 20%.\n\nSo our largest headwind, and if you think about year-over-year margin decline is obviously in inflation given the magnitude. Now how we think about inflation and Andy alluded to this a little bit earlier, we think about a toolkit to manage costs and to manage -- to manage costs. And to drive our ability to continue to invest back in our business. So there's multiple tools in this toolkit.\n\nPricing is one of them. We will use them when we need to, and we will use it when we're dealing with 18 and a half percent inflation. But we also have revenue growth management and we've invested in those capabilities, and you've seen that play out in Q3, and we alluded to that in our prepared remarks. We've also invested in our ability to drive repeatable and scalable processes across our entire business system, across our bakery, across our warehouses, in procurement, in transportation to continually fill a pipeline of productivity initiatives.\n\nSo as we think about our margins over time, as we think about recouping our margins over time and slightly expanding them, we will leverage our RGM capabilities and our productivity capabilities to really drive and continue that investment into innovation, into our product quality and into our marketing as well.\n\nAndy Callahan -- President and Chief Executive Officer\n\nYes. So David, it's too soon to talk about timing. But as Travis said, I think the most important way you're looking for, we're committed to recovering gross margin and expanding it modestly over time, including the anchor, the starting point you talked about.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nRight. OK. And just looking at your slides, your multipack sales growth was still strong, although it's not as strong as your single serve. I've heard recently that that the breakfast traffic in convenience stores has been remarkably strong lately.\n\nI'm just wondering if you have any observations kind of coming out of COVID as -- are you seeing some slowing in some at-home snacking behaviors and pack types and products and seeing the inverse, perhaps some mobility-related stuff that's beginning to get more uptake? Any comments would be helpful.\n\nAndy Callahan -- President and Chief Executive Officer\n\nYeah. Thanks, David. So let's keep things in context. So you talked about slowing.\n\nSo we're -- I think we're one of the top growers if you look over the past several years, both in units and in dollar sales. For the quarter, just so everybody's grounded. Our -- let me make sure I think for the quarter, our single-serve was up 17 and a half percent in dollars. Our multipack was up 16 and a half.\n\nOur 2-year stack on single service is 33% and multipack was 28.9%. So we feel good, specifically within the convenience channel. Our POS was up 17%. So just as the context of driving growth.\n\nWe did expect unit sales. We guided for the full year, kept that the same on our unit sales of the high side two and a half percent for the full year to zero. So we do expect unit sales to slow. It's consistent with our model.\n\nAs far as traffic in the convenience channel, the latest data and we get external data. I don't have any internally proprietary data on that. But what we see and what we also see in our orders is the traffic continues to be relatively consistent and inside sales continue to be relatively robust and resilient. I think what's important for us is we have opportunities on both multipack and single-serve given the nature of -- the impulse nature of our category and our growth model to access this $50 billion of occasions that we talk about a lot, and that's proven to be true.\n\nIn our model, we see the impact of our pricing on the elasticity and that impacting our units on the downside. That's being offset by some of the macro trends. But more importantly, some of the largest drivers in our model are innovation, our investment in marketing and our ability to execute. And those things will continue over time throughout our algorithm even as the impacts of short-term pricing kind of go back.\n\nSo yeah, we can talk about a lot of things in the short term. They're all good questions. But over the long term, what our model sets is the activities that we're doing access at $50 billion, which are broader than our category alone continue to work. And I just want to leave everybody with that message.\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nThank you.\n\nAndy Callahan -- President and Chief Executive Officer\n\nThank you, Dave.\n\nOperator\n\nOur next question comes from Ken Goldman with J.P. Morgan. Please proceed with your question.\n\nKen Goldman -- J.P. Morgan -- Analyst\n\nHi. Thank you so much.\n\nAndy Callahan -- President and Chief Executive Officer\n\nHey, Ken.\n\nKen Goldman -- J.P. Morgan -- Analyst\n\nHi. Good afternoon. I wanted to ask about Bouncers. Clearly, it's doing well.\n\nI wanted to ask, does -- you've obviously been innovating well for a long time, but I feel like this is sort of a step up in maybe a little bit of a bigger direction, correct me if that's wrong. I'm just wondering how does that sort of benefit you in terms of future innovations, right? Do you have a little bit more street credit, so to speak, with some of your customers in terms of the next innovation? And does this sort of help you introduce more products a little bit easier going forward? Just wanted to kind of see if there's any kind of incremental flow-through to the rest of your new product pipeline from the success of this.\n\nAndy Callahan -- President and Chief Executive Officer\n\nYes. I appreciate the question, and I appreciate the spirit of the question. The -- let me step back with our customers. Our relationships with our customers.\n\nWe value them. We want them to be sustainable, just like all of our relationships across our across our network. And the strategies that we've been implementing are building the sustainability of that because we're -- our strategies -- our category growing strategies, that is a starting point. And what we're doing is we're accessing consumers and attracting them to sweet baked goods as a viable stack, which is what I just talked about in the previous message.\n\nWe do have a good track with that. We never left innovation during COA. We continue to invest there wasn't as much out there, we were able to launch Baby Bundts and other things that were highly successful of high repeat rates. The enthusiasm between -- from our customers, it's too early to tell consumers ultimately determine has been highly enthusiastic.\n\nOur distribution has been very strong. We're just turning on our advertising here in October. That's a testament of our enthusiasm behind it because we need to drive awareness. So what will be a step up.\n\nWe'll see that in Q4 and Travis talked about that. And Bouncers is a -- we believe, is platformable as well. So in other words, we have an initial launch. It's a reimagination of our some of our icons.\n\nBut Tina Lambert, Dan O'Leary, who you heard from an investor day do a terrific job of starting with the consumer insights. Looking at our occasion-based segmentation model, this target is lunchbox and has a broader appeal out there. It does really well. So we're enthusiastic about it.\n\nOur initial customer response has been very good. Too early to tell it to consumers, but we do believe that it's scalable and platformable and we're excited about the pipeline as well. We talk to our customers about pipelines. So it's not a one and done.\n\nAnd that as much as just one individual item that gets gets them excited that we're focused on category growth. We're focused on pipelines, and we're focused on the sustainability of them.\n\nKen Goldman -- J.P. Morgan -- Analyst\n\nMake sense. I'll pass it on. Thank you.\n\nAndy Callahan -- President and Chief Executive Officer\n\nThanks, Ken.\n\nOperator\n\nOur next question comes from Ben Bienvenu with Stephens. Please proceed with your question.\n\nAndy Callahan -- President and Chief Executive Officer\n\nHi, Ben.\n\nTravis Leonard -- Chief Financial Officer\n\nHi, Ben.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nHey, guys. You got Jim Salera on for Ben. Congrats on the strong quarter.\n\nAndy Callahan -- President and Chief Executive Officer\n\nThanks.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nI wanted to ask -- Voortman continues to perform really exceedingly well. Can you just talk about what's driving that? Is it -- you guys are investing in the category more than peers? Is it just -- it's a fresh brand? I mean what's driving kind of that consistent outperformance to date?\n\nAndy Callahan -- President and Chief Executive Officer\n\nYes. There's a lot of things. We integrated Voortmans. We reimagined it and brought it into our operating model.\n\nAnd we -- when we originally integrated it in, we got efficient on the SKUs. We reformulated where we needed to do. We imagine the packaging so it fits within our logistics. And then the teams got busy really understanding the insights from the consumer back like we do everything.\n\nSo what I'd say at the fundamental piece of it is we got a portfolio that we thought was a sustainable growth of what we call a scalable niche, and that's our model. And it starts with the consumer, and then it starts with inactivating our playbook to be about access as consumers within there. And Voortman, we did that. So we have tailwinds from the occasions in which we compete.\n\nOur sugar free is really doing well, but the broad portfolio is also doing well, too. The team continues to refine it. Our customer teams are executing extremely well. Our distribution continues to move up and the quality of the distribution is really good.\n\nWe have expanded into the convenience channel. And both importantly, as you saw, the sales dollars were up, but also the unit consumption in this environment continues to be up. So we now have two really meaningful branded businesses, one in cookies, which is $8 billion in retail sales. And sweet baked goods, which is quickly approaching the size above $7 billion, approaching the size of cookies, where we obviously have a more meaningful position with tailwinds to be able to grow.\n\nRemember, 100%, nearly 100% of our portfolio is snacking. So we have macro tailwinds, two really branded positions with tailwinds in the category that we're executing. I would put them up against as good or as better than anybody else. So we're running our playbook.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nGreat. And maybe I could circle back on the Bouncers launching the C stores. When you push them into C stores, are they going to be in kind of prebuilt displays where they're separate? Or are they just going to be on the shelf with kind of the broadly speaking, sweet baked category?\n\nAndy Callahan -- President and Chief Executive Officer\n\nYeah. Scott and his team do a great job in convenience channel. I'll put them up against anybody who does it. And so the comp -- it will be of both.\n\nSo one of the beauties efficiencies of our business model is the nature -- we're one of the highest impulse categories there is, which, by the way, is really testament to the expandability of our category. So we're -- when we can activate our plan and we can do it the way we want, we talk about accessibility to $50 billion of occasions, where we can really access those consumers given the impulse nature of our category. So when we go in to C-stores, our logistics model allows us to do that really efficiently and get really display ready, things right out the convenience channel as well as getting it on the shelf. So the fast answer is both.\n\nJim Salera -- Stephens Inc. -- Analyst\n\nOK. Great. I'll pass it on. Thanks for the questions, guys.\n\nAndy Callahan -- President and Chief Executive Officer\n\nYeah. Thanks, Ben. \n\nOperator\n\nOur next question comes from Robert Moskow with Credit Suisse. Please proceed with your question.\n\nAndy Callahan -- President and Chief Executive Officer\n\nHi, Rob.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nHi. Just trying to drill down a little more into the fourth quarter guidance. It implies a deceleration in sales growth that's pretty significant. And so I wanted to know why that would be.\n\nAnd also, your comment that your inflation will be higher in fourth. Why is that? Is it from hedges rolling over? Or is it something else?\n\nAndy Callahan -- President and Chief Executive Officer\n\nWhy don't we take the costs first. I'll do that real quick. As Travis mentioned in the prepared remarks, it's just the timing of some of the cogs coming through our our P&L in Q3 versus Q4, which is kind of related to some of the contracts and relationships we have. It's not a long-term indication that things -- we'll talk about that at the due time, but that's the way it's flowing through this year.\n\nTravis Leonard -- Chief Financial Officer\n\nCorrect. We're still holding to the 19% inflation. This is simply switch Q3 to Q4 of certain costs and no indication of concern.\n\nAndy Callahan -- President and Chief Executive Officer\n\nYeah. And then related to sales growth, we feel terrific about the sustainability of our model. I think it's difficult to look at quarter to quarter in today's environment. I mentioned some incredible numbers.\n\nWe're coming up on almost three years of 9% or more growth. We're looking at a quarter of 80% of our POS was 13% or better. So we'll continue to activate our playbook. One thing that didn't come up, Rob, that I know you're always interested and it's not just the point of sale.\n\nBut if you look at the consumer fundamentals of our business, if you step back, we continue to access households. Our household penetration has continued to be up. If you look at over the last 52 weeks, we're adding two times buyer to our category at more than twice the rate of the rest of the category. Those things -- and so therefore, when they come back to us our investment in quality, our investment in the execution of the retail given the impulse nature of our business, of our investment in innovation and our investment in the consumer advertising to take our unaided awareness and then close that gap so that we're more top of mind.\n\nWe see them all working and those base fundamentals will drive over time. So although Q4, we're expecting to end the year in a very strong. We raised guidance across the board. We -- that's our current forecast.\n\nSo I think the long term is more important than any other short term. Anything to build on that?\n\nTravis Leonard -- Chief Financial Officer\n\nYeah. I would just add, again, as we said in the prepared remarks, our volume, low to mid-single digits. That's what we've said in the past. That is still consistent on a full year basis, low to mid-single digits versus prior year.\n\nSo that is exactly what we're expecting and it's exactly what we're modeling. \n\nAndy Callahan -- President and Chief Executive Officer\n\nAnd exactly what we model. So it's pretty good. Our model has actually been pretty good.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. Looks pretty conservative to me. My follow-up, though, in the Nielsen data anyway, your biggest competitor seems to have recovered a lot of the market share at loss last year. I recall you talking about it and talking about supply chain issues being kind of the reason for that.\n\nYou didn't mention what your market share was in this quarter. Where was it compared to last year? And it may not look good optically, but is it where you would hope it would be based on that anomaly?\n\nAndy Callahan -- President and Chief Executive Officer\n\nYes. There's a couple of ways to comment this. I have a lot of respect for all of our competition. I take them serious, and they're out there doing a nice job, and that mentality, I think, keeps us high on our game.\n\nThe flat answer is our market share was flat. It's essentially flat for the quarter on a market share basis. what's really -- if you -- share is one metric, and that will go quarter to quarter. Some of the things I talk about long term are important, but also the expandability of our category is really important because we can grow even with a flat market share, as I mentioned, our top three channels were up at least 13%.\n\nSo that's the way I look at it. Certainly, we did mention we benefited in the short term from competition just distribution, some things. but what's going to last over time with a lot of these strategies that we talked about over time.\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is from Steve Powers with Deutsche Bank. Please proceed with your question.\n\nAndy Callahan -- President and Chief Executive Officer\n\nHey, Steve.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nHey, thanks. Hey, good evening. I want to pull together a couple of different things you've been talking about throughout the call. It sounds like you're successfully reaching new consumers, new households, new occasions with incremental products and incremental initiatives, which is great.\n\nAnd yet volume is flat for the quarter. Now I get it flat volume given the pricing you're taking is impressive in its own right. But I'm just -- I guess, maybe I just wanted to maybe build on some of what you've been talking about earlier. Just how you think about the incremental reach you seem to be attaining relative to what would intuitively appear to be a decline in what you might consider base occasions, especially as those declines seem to be accelerating volumetrically based on recent consumption data.\n\nJust how you think about that and what that might mean for the medium term?\n\nAndy Callahan -- President and Chief Executive Officer\n\nYeah. What I think in the -- the way I think about that is, obviously, we're putting a lot of pricing into the marketplace. And there's some matter of elasticity impacts us. The strategies that we're implementing will last well beyond this period of inflation and the impact that the pricing in the short term has to consumers relative to elasticity.\n\nSo that's why I did bring that up about our ability to be able to access new households, our ability when they try us, that they repeat with us and that's why our innovation, our marketing efforts are important. We expect it as was communicated, and it sounds like we're getting -- I don't know whether it's just our side, but I apologize if there's interference on our line. What we continue to do is activate our playbook over the long term as we fight through some of the pricing. And as I mentioned, as Travis mentioned, we take pricing extremely seriously.\n\nWe think we have a good value equation to the consumer. We do what's needed. We expect to recover margins over time, and we expect to then not just pull the pricing lever. That's why we're very balanced about that and continue pull our productivity, as we talked about.\n\nSo that's why those metrics are important. Can you access new households? And can you have them repeat? And all of our investments are proven that that's the case. So that will start showing after we get through some of the short-term impacts of price elasticity.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nOK. Understood. That's helpful. Thank you.\n\nTravis Leonard -- Chief Financial Officer\n\nThanks, Steve.\n\nOperator\n\n[Operator instructions] Our next question is from Rob Dickerson with Jefferies. Please proceed with your question.\n\nRob Dickerson -- Jefferies -- Analyst\n\nGreat. Thanks a lot. Andy, I just wanted to kind of talk about or let's say circle back to kind of the longer-term opportunity given the playbook but also given pricing but from kind of a different angle. I kind of assume the category and your products overall still kind of sell at somewhat of a lower absolute price point per ounce versus the total store.\n\nVolume is flat with high pricing lease in Q3 obviously is impressive, as Steve has said. We're not seeing everybody put up the same numbers, and everyone has been impressive. The story has been impressive. Consumer seems resilient.\n\nBut would you kind of step back and say, look, in the near term or even the medium term, maybe the volumes wouldn't grow as much. Just kind of given that upfront kind of shocked by the consumer, but could it also be an opportunity, especially as you continue to speak with the retailers, that if you are kind of performing year over year on a volume basis a little bit better than some other categories, maybe you can get a little bit more pricing than some other categories that this could be actually an ideal an opportune time to kind of lean in, right, and try to attract new consumers as you get into next year because your absolute price point is not very expensive. That's it. Thanks.\n\nAndy Callahan -- President and Chief Executive Officer\n\nYeah. So that is -- Hey, Rob, I appreciate the question. I think I understand the spirit of it is. OK.\n\nSo with your investments in value and innovation, are you truly priced to the value. And we think about that all the time, pricing the value while we look at our algorithm and make sure we have the sustainability of it. So we want to deliver to consumers the best value for the dollars that they can have at the same time that we're delivering industry-leading growth at industry-leading margins and therefore, industry-leading total shareholder return. We calculate all of those.\n\nBased on that equation, based on what we know about our consumers and based about what we know about our P&L, we think we have, as we stand here today to at least close out two we think we have that balance of sustainability, sustainable profitable growth. correct, while the consumer is absorbing a lot. So we don't think about it as opportunistically. We think about the right price value to the consumer that will drive to sustainable profitable growth.\n\nAnd that's the way we look at it. We think we have it right. With that being said, too early to look at '23, we reevaluate that all the time. And we're in a position, maybe the other end of that, given what you said, that if needed, we'll be in a position to activate the correct levers to continue to keep that track record of successful results.\n\nRob Dickerson -- Jefferies -- Analyst\n\nFair enough. Thank you.\n\nAndy Callahan -- President and Chief Executive Officer\n\nThank you, Rob.\n\nOperator\n\nWe have reached the end of the question-and-answer session. I'd like to turn the call back over to Andy Callahan for closing comments.\n\nAndy Callahan -- President and Chief Executive Officer\n\nI appreciate your interest, and thanks for the confidence you place in our team as we continue to execute our plan to inspire moments enjoy. Rob, this one's for you for all stakeholders, consumers, our investors, our suppliers and certainly our team. So thanks for everybody for your interest. Have a great, I guess, holiday season because we'll be back and talking to some of you in the interim, but not on the quarterly call until after the holidays.\n\nSo have a great close to 2022, and we'll see many of you next year. Thanks, again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAmit Sharma -- Vice President, Investor Relations\n\nAndy Callahan -- President and Chief Executive Officer\n\nTravis Leonard -- Chief Financial Officer\n\nPam Kaufman -- Morgan Stanley -- Analyst\n\nDavid Palmer -- Evercore ISI -- Analyst\n\nKen Goldman -- J.P. Morgan -- Analyst\n\nJim Salera -- Stephens Inc. -- Analyst\n\nRobert Moskow -- Credit Suisse -- Analyst\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nRob Dickerson -- Jefferies -- Analyst\n\nMore TWNK analysis\n\nAll earnings call transcripts"
}