{
  "companyName": "Arcimoto, Inc.",
  "companyTicker": "FUV",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/arcimoto-inc-fuv-q2-2022-earnings-call-transcript/",
  "content": "Arcimoto, Inc. (FUV 20.88%)\nQ2 2022 Earnings Call\nAug 15, 2022, 5:00 p.m. ET\n\nJesse Fittipaldi\n\nGood afternoon, everyone, and welcome to Arcimoto's Q2 2022 stakeholder update webinar. I'm Jesse Fittipaldi, interim chief executive officer. To start out, I want to call your attention to our safe harbor disclaimer regarding forward-looking statements. This note identifies risk factors that may cause our actual results to differ materially from the content of forward-looking statements for the reason we cite in our SEC filings.\n\nToday, we will hear from the executive team who will give a snapshot of the business, our challenges, and rapid growth in key areas. For those of you that I haven't met yet, I look forward to meeting you soon. I've been with Arcimoto since 2015, and until my new role as interim CEO, I was the chief strategy officer. I'm delighted to be in this new role, and I'm thankful for the company employees, executives, and our board for believing in me to carry out the Arcimoto vision and mission.\n\nOur mission is to catalyze the shift to a sustainable transportation system. We've invented ultra-efficient electric vehicles on a platform capable of providing sustainable solutions to a wide range of modern transportation challenges. Since 2019, we have produced and delivered these vehicles to consumers. Our vehicles share the same key technology across all our platforms, and the variation of each of these products is a different tool used to solve a specific logistics problem.\n\nThey are designed to move the people, food, parcels, and equipment that in today's transportation ecosystem are moving with oversized, costly vehicles that cause significant environmental impact. Our next step is to scale our production volume, reduce the cost of our products, improve out our factory design and automation strategy to accelerate sales and growth and achieve profitability. In the long term, we intend to leverage our replicable production model to expand manufacturing capabilities and other communities across the world. This is how we make a difference.\n\nToday, we will discuss financials, production, marketing, customer experience, and commercial sales. Our team recently achieved a production rate of six vehicles per day, which represents an annual run rate of 1,200 vehicles per year. While we have just achieved our highest production quarter to date, we continue to generate negative gross profit as we remain in the early phases of our production curve. We expect gross profit to improve as we continue to scale our production volume and implement key cost-down initiatives.\n\nAs we ramp up production, we've deployed a comprehensive marketing sales strategy to meet our production cadence. These initiatives are laying the groundwork for future sales. This quarter, we're also announcing a revision to our full year production target. As with many of our peers in the vehicle manufacturing space, we have faced various supply chain headwinds in 2022 that have created bottlenecks in the production, including inverter chip shortages.\n\nTo be clear, more important than the aggregate number of vehicles produced while we remain at a gross margin deficit is that we plan to reach the production rate of 12 vehicles a day by the end of the year, representing an annual run rate of 2,400 vehicles per year. Focusing on making and selling more product to achieve profitability is how we plan to become a great company. We face the same challenges as most American manufacturers, but we have firm grasp around the key issues, and our team has a clear plan to address these challenges. Doug Campoli, will kick us off with the financials.\n\nDoug Campoli -- Chief Financial Officer and Treasurer\n\nHi. My name is Doug Campoli. I'm Arcimoto's chief financial officer and treasurer. 102 FUVs were produced in the second quarter of 2022, an almost 16% increase over our previous quarterly record.\n\n41 were sold at an average sales price of $21,658, four were deployed in the marketing or other company use, and 20 were deployed into rental operations. And the balance will be moved into rental or fixed assets. Tilting Motor Works sold a quarterly record of 35 units with an average sales price of $12,296. As of June 30, 2022, there are 400 happy customers on the road as brand ambassadors.\n\nWe now have 98 FUVs in our growing rental fleet available for revenue generation, along with a total of 79 FUVs allocated to marketing, R&D and internal fleet use. Second quarter revenue increased 109% year over year. Even with production shutdown for most of the first quarter during the move to the ramp, year-to-date revenue increased by 2% compared to the same period in 2021. Tilting Motor Works' second quarter revenue grew over 10 times compared to the same period in 2021 and accounts for almost 26% of total year-to-date revenue.\n\nRental started gaining revenue traction in tourist locations, and we expect continued quarterly revenue growth across all reporting segments. We generated negative gross profit of $4.6 million in the quarter. However, cost of goods sold as a percentage of revenue has decreased sequentially in each of the last two quarters. The main driver behind the year-over-year increase in COGS is increased production volume and increased overhead as we build the infrastructure to ramp production.\n\nYear to date, the FUV average sales price was $23,544. As we ramp production and continue to increase efficiencies in our manufacturing processes, we anticipate leveraging our fixed cost structure to drive improved gross profit per vehicle. Year to date, Tilting Motor Works has had an average sales price of $12,296 and an average COGS of $8,847, which is a 36% margin. Operating expense also increased as we build out the infrastructure for higher production volume.\n\nThe three main drivers of this increase were: one, increased headcount; two, increased sales and marketing efforts; and three, increased research and development spend to reduce the per-vehicle cost of the FUV, develop new products, and scale production. We ended the quarter with approximately $5 million cash and cash equivalents. Year to date June 30, 2022, net cash received from the sale of equity was approximately $16.4 million, cash from the issuance of debt consisted of approximately $4.5 million from a long-term convertible note, and approximately 65,000 from equipment finance. Approximately $103,000 cash was received from the exercise of employee options and warrants.\n\nWe have successfully utilized the at-the-market offering with minimal impact on the stock price.\n\nTerry Becker -- Chief Operating Officer\n\nHi. I'm Terry Becker, chief operating officer at Arcimoto. As anticipated, Q2 showed a significant increase in production over Q1. Q1 was intentionally slated to move the production assembly line from the AMP to the larger AMP facility.\n\nAlso, the first four months of 2022 were dedicated to designing an upgraded battery configuration, along with the required validation testing. While production of vehicles in Q1 was minimal, these efforts resulted in a record quarter of production in Q2. Supply chain issues have certainly made the continuous flow of production difficult in the past two years. The supply chain in Q2 through the present continues to challenge us with the uncertain availability of some critical parts.\n\nAs a result, we are revising the anticipated production schedule for the remainder of 2022. Automation is key to Arcimoto's ability to scale. The machines and fabrication equipment that have been put into service since the company went public have been with the intent to minimize labor and maximize efficiency and quality. Fabrication of metal parts and machining have been in place since building the AMP facility in 2017, and those solutions continue to scale as we grow.\n\nComing online presently is our own state-of-the-art automated vacuum forming plant for body panels, which should eliminate the struggles of scaling production with an outside source. As well, the coating processes that are needed for paint and powder coat application are being brought in-house over the next three quarters to overcome the challenges and logistics of outside suppliers. Battery assembly automation is another vertical integration decision that, when complete, will enable high-volume production with minimal labor requirements. Going forward, the planned scale-up for production capability supports the company forecast.\n\nWith the addition of fabrication equipment, vertical integration and added labor to the final assembly line, we are focused on intentional phases that increase production capacity as we grow.\n\nEric Fritz -- Chief Marketing Officer\n\nHi, I'm Eric Fritz, chief marketing officer. Similar to other areas of the organization, marketing has been focused in 2022 on building out the team, focusing our efforts on lead generation and assisting the customer experience and sales teams in warming up those leads for conversion. To that end, we made several key hires on our events team to further increase attendance, participation and sponsorship of meaningful events that feature demo drive opportunities, which include tent-pole events such as Electrify Expo and Fully Charged Live, as well as our own Ride of the Arconauts tour. In Q2, we set a record for most customer rides, what we call around here butts in seats, and we expect this number to keep climbing as we close out the summer months in Q3.\n\nAdditionally, and I don't want to steal Lynn's thunder here, but we're starting to see those leads convert as the customer experience teams work those leads through the sales funnel. Similarly, the digital marketing team has taken what we have learned from years of experimenting with minimal online ad spend and limited ad content and started to focus its efforts and increased spend in Q2, resulting in a dramatic increase in traffic and ad response. We saw checkouts initiated nearly double from Q1 to Q2; and again, we expect continued growth in Q3. Lynn will talk about lead conversion and our efforts there.\n\nBut as we streamline the order and delivery process through web optimization and additional financing options such as FreedomRoad, which came online in Q2, we expect those leads to convert at an even higher rate or to convert directly off of our marketing efforts more consistently. Finally, Q2 saw some big wins on the lobbying front. We helped pass legislation in Alabama and Maryland, which modified their auto cycle definitions, so that drivers will no longer need a motorcycle endorsement or a helmet to operate the FUV. This is just one step in the process of opening a state for vehicle sales, which can include acquiring manufacturer and dealer licenses, establishing service partners, and determining delivery capability and options.\n\nWe most recently went through this process for Hawaii, and we are proving the pace of jumping through these hoops with each new state and are moving through them as fast as we can.\n\nLynn Yeager -- Chief Experience Officer\n\nHi. I'm Lynn Yeager, chief experience officer. As Eric mentioned, our focus has been on expanding our lead base and drive engagement. In Q2, we added additional rental partners, including Susie's Mopeds in San Juan Island and Temecula Wine Tours in California.\n\nAnd the feedback, thus far, has been awesome. The more that we can support and understand their value within each unique market, we can help optimize each business. As we look at KPIs for both channels of our butts in seats, we are seeing great results in volume and in conversion. We are building our funnel for future sustained business and growth over time, so we have the demand to take us into future quarters.\n\nI'd like to review some of those KPIs. Customer drive funnel primary KPI is demo drive to order and preorder conversion, driven by rentals, events, and appointment demo drives. Average time to order post drive is four to five months. Q2 versus Q2 last year, we had a 931% increase in butts in seats.\n\nQ2 versus Q1, we had a 416% increase in butts in seats. Conversion average is 8% through Q1 with recent drives at 4% currently. We aim to increase conversion through higher drive volume paired with thoughtful and increased frequency of engagement throughout the customer journey. Our customer rental funnel.\n\nCustomer rental experience conversion primary KPI is rental to order and preorder conversion and direct rental revenue. This is driven by owned and partner-operated business. Average time to order post drive is two to three months. Q2 versus Q2 last year was a 209% increase in rental volume.\n\nQ2 versus Q1 was a 94% increase in rental volume. Q2 sales was 53,818 versus Q2 last year at 16,618, a 224% increase year over year. Our conversion average is 12% through Q1 with recent rentals at 7%. We are targeting to increase volume and expand in the new key markets.\n\nWe recently added Temecula Wine Tours, GoCar San Diego After Dark, Susie's Mopeds, Sarasota and press released the Hawaii rental opening for August 20th. We are also planning to balance seasonality on our engagement by expanding in a market viable for each season, such as key locations for spring and summer and opposite markets for fall and winter: for example, Friday Harbor in the summer and Palm Springs in the winter. We are already seeing strong results in Q3 and pacing to exceed Q2 driving rental volume. We continue to focus on our lead and drive engagement with plans to expand into new markets.\n\nKevin O'Rourke -- Chief Commercial Officer\n\nHi, everybody. Kevin O'Rourke here, chief commercial officer with Arcimoto. In Quarter 2, we initiated our first New York City pilot program with JOCO, focusing on local delivery using the Deliverator. JOCO is the world's first light electric vehicle sharing platform for delivery drivers, renting their vehicles to keep drivers across the city to provide rightsized and sustainable forms of delivery.\n\nWhile JOCO traditionally has focused on local delivery using e-bikes, adding the Deliverator to their fleet is a way for them to provide their clients with a larger capacity vehicle designed to operate efficiently within the city. Pilot programs with key clients like JOCO provide us with the information that we need to bring the Deliverator into the commercial market. And thus far, JOCO's feedback has been extremely helpful in that regard. [Presentation]\n\nJesse Fittipaldi\n\nYes, hello, everybody. That video makes me very happy to hear all that stuff. I hope people heard some good stuff in there. Dwayne Lum also joined us.\n\nHe wasn't in the video of this time. He's our chief product officer. I wanted to recognize him here on this team, key player and just incredible add to the team. Welcome, Dwayne.\n\nFritz, you want to take us away?\n\nEric Fritz -- Chief Marketing Officer\n\nSure. So Q&A section, we, once again, pulled some of the top questions from the Say platform. And if you guys want to get questions in on these earnings calls, then that's the way to do it. So register on Say and get a question in there.\n\nWe'll kick it off. Will the current EV bill help Arcimoto? And if so, what are your plans to utilize this opportunity?\n\nJesse Fittipaldi\n\nFritz, do you want to answer that one?\n\nEric Fritz -- Chief Marketing Officer\n\nSure. Sure. So first of all, obviously, we're encouraged that we're able to see some movement on EV tax credits as a whole. And the passing of this bill is a solid step forward of the industry, shows that there is interest in addressing adoption of EVs at the federal level.\n\nUnfortunately, EV tax credit for two- or three-wheel vehicles were not included in the Inflation Reduction Act. They had originally been included in the Build Back Better bill, which was the kind of precursor to the IRA, but they were later scratched in the final IRA bill, which is just one of the many compromises that had to be made in order to pass the bill. So that said, we continue to work with our state and federal lobbying and advocacy groups to help educate legislators on the advantage of vehicles like ours, lighter weight, ultra-efficient, right-sized vehicles regardless of the number of wheels on them.\n\nJesse Fittipaldi\n\nAwesome. Thanks, Fritz. Great answer.\n\nEric Fritz -- Chief Marketing Officer\n\nWhat is the current order backlog for all FUVs and MLMs?\n\nJesse Fittipaldi\n\nLynn, you got that one? You're muted.\n\nEric Fritz -- Chief Marketing Officer\n\nLynn, you're muted.\n\nLynn Yeager -- Chief Experience Officer\n\nThank you. I'll take this one. I do think it's a good opportunity to clarify the order of funnel definition. So orders are defined as someone places a non-refundable order that starts the production process.\n\nThere are five steps in our production process that will happen over a few months until delivery. So customers in some form of order stage currently have a 95% conversion to delivery. We did end Q2 with 41 customers in order backlog, and we're encouraged by our order pacing, thus far, in Q3. As far as preorders are defined, we define them as strong leads to place a refundable deposit.\n\nThese customers have priority for ordering when ordering is available to them, depending on the state or when a product is available. Our open states are listed on our website, and we update those as we announce new states. We had a total of 1,000 preorders of MLM at the end of Q2, and we are highly encouraged by our positive response from our product announcements recently.\n\nJesse Fittipaldi\n\nThank you, Lynn.\n\nEric Fritz -- Chief Marketing Officer\n\nDoes the company have an update on potential fleet sales? Are there any large contracts to expect since [Inaudible] government agencies can be a massive driver of revenue? Have any governments reached out to Arcimoto or vice versa?\n\nJesse Fittipaldi\n\nKevin, It sounds like that's in your wheelhouse.\n\nKevin O'Rourke -- Chief Commercial Officer\n\nYeah, I think you're right. I'll definitely take this one. So you all know that I can't necessarily talk about any future sales or contracts that are in the works today. However, I can say that the team is engaged in many positive conversations, and we continue to build this said team to increase the frequency and the quality of those deals that we're currently working on.\n\nFor example, the most recent addition to our commercial sales team is Dorothy Mashensky, who brings more than 25 years of experience in the restaurant industry to Arcimoto. This type of experience within a specific market positions Arcimoto as an expert business partner within that arena. And speaking of specific vertical markets, we and most of our investors we speak with believe that the Deliverator is going to be a disruptive solution within the final mile delivery space, and that is why that we're working so diligently to build the strongest commercial partnerships in the industry today.\n\nJesse Fittipaldi\n\nThank you, Kevin.\n\nEric Fritz -- Chief Marketing Officer\n\nWhat are the remaining supply chain bottlenecks preventing production scaling? And when do you think they will be resolved?\n\nJesse Fittipaldi\n\nTerry's muted, but you've got a Terry question.\n\nTerry Becker -- Chief Operating Officer\n\nYeah, definitely. Thanks. I'll go ahead and take that one. Yeah, the supply chain issues definitely have been a problem for us here in the last couple of years, and the bottlenecks currently being dealt with include things like the intermittent delivery of certain key parts, motors, their related inverters.\n\nThey've been susceptible to chip shortages. The displays have also been susceptible. Also, the quantities shipped to us have been dependent on the suppliers being able to scale with us. So our chief materials officer, Chad Boardrow, is engaged daily, along with his team, with the supply chain partners and focuses on solutions, many different solutions required to keep the parts flowing.\n\nTwo other areas of supply chain services have been the coating of material parts and the production of thermoform plastic body panels. These are two areas that Tim Heinen, the director of automation solutions has either already implemented or he's in the process of bringing them in-house. Vertical integration of manufacturing processes that can be automated beyond the capability of the local suppliers makes sense for us, especially when we fully utilize the capacity that we've put in place. We keep an eye on the efficiency of capital expenditure this way.\n\nAnd it really is working out for us. And Tim is doing a great job there. So thanks, Tim.\n\nEric Fritz -- Chief Marketing Officer\n\nThank you, Terry.\n\nJesse Fittipaldi\n\nThanks, Terry.\n\nEric Fritz -- Chief Marketing Officer\n\nAre rental centers performing as expected? And are they profitable?\n\nJesse Fittipaldi\n\nLynn, rental expert.\n\nLynn Yeager -- Chief Experience Officer\n\nI will take this one. So the rental revenue is growing and pacing to our expectations that we've set around utilization and sales. We've also restructured our customer experience centers to optimize both the rental side and the sales functions within. We have a few different rental models currently between owned and revenue share structures.\n\nOur own rentals offset the opex needed for sales and delivery operations within those centers. And our shared models are lighter in opex and have higher profitability potential. So we will continue to expand on all types of experience centers to support both our rental revenue growth and our consumer sales and delivery needs.\n\nEric Fritz -- Chief Marketing Officer\n\nAnd then, there was some product development questions that I kind of aggregated. What can we expect on the product development front, specifically around DC fast-charging and/or full enclosure?\n\nJesse Fittipaldi\n\nDwayne?\n\nDwayne Lum -- Chief Product Officer\n\nSure, I'll handle that one. So we're constantly engaged with the market and looking at customers' needs and wants and desires. And so our product development is really driven by those customer requirements. To that end, we've heard repetitively and recognize the need for climate control in both extreme heat and cool environments.\n\nSo we're prioritizing full enclosure as a key priority that we're working on. Additionally, we look at things like body systems, variations in body types, so that we can address new performance requirements and/or market opportunities. In addition to that, we've heard directly from fleet customers and others the DC fast charging as a key feature for them. As such, we're working with open and universal standards for electric vehicles that combine single-phase AC, three-phase AC and DC high-speed charging for both Europe and the U.S.\n\nJesse Fittipaldi\n\nAwesome. Thanks, Dwayne.\n\nEric Fritz -- Chief Marketing Officer\n\nAnd what exact way will the company get more funding?\n\nJesse Fittipaldi\n\nDoug?\n\nDoug Campoli -- Chief Financial Officer and Treasurer\n\nYeah, thank you. So project expense, which we've talked about in the past, is ongoing. We can't talk about specific opportunities until the funding has been closed. We will continue using the ATM to fill any gaps in funding in the meantime.\n\nI would like to give a big shout out to Arcimoto's finance and legal teams, both internally and externally, for the tremendous work they've been doing on these fronts.\n\nJesse Fittipaldi\n\nMe, too. It's good. Great team. I'd like to take a moment to talk about all of this stuff that's relevant, all the things that we're talking about, finance and capital efficiency.\n\nWe say those words a lot, but I think it's important for folks to understand Arcimoto's perspective and that sets up what is a healthy company in regards to that. And sometimes, it's difficult to understand that because we aren't -- we're not -- we're in a different position than most companies like Ford or Tesla or companies that have been doing things for a long time. We're in this growth phase. So according to a very smart acquaintance, OK, the traditional, most frequent killer of start-up, large manufacturing companies is four conditions: too much inventory deployed without enough customers, not enough inventory deployed with too many customers, too much capex deployed without enough customers, not enough capex deployed with too many customers.\n\nSo many times, you will see companies build a $2 billion factory, thinking they're going to have a bunch of sales come in their way when they should have made payroll, OK? So Arcimoto isn't looking at some number that is dictated by what we think the market can do. We created a cadence of production that gets us to profitability with a reasonable expenditure of capital. So at any moment, when we take a step to the next level, are we talking about financing that is reasonable or a deployment of capital that is reasonable and available in the marketplace? Or have we positioned ourselves, built out the company too strong, put that capital in a place where we can't use it, making it much harder to get funding, OK? So mission here is what is the best path to profitability and are we doing that at the right pace where the market is. And I truly believe this team has worked really hard together, both on the sales side and the production side, to make agreements to what that cadence is.\n\nOK. I want to talk about our friend and the change recently. Mark Frohnmayer. I want to say I love Mark Frohnmayer.\n\nI love what he has -- what the opportunity is that he has given all of us here at Arcimoto to work at a truly amazing company, culturally, awesome product, going after something that really matters. I think it gets all of us up every day with a smile on our faces. Thank you, Mark, for that. He's a true inspiration to work with.\n\nHe's a great friend and a shining light. I can't wait to see the great things you will create as our chief vision officer, doing the things you love. We're looking forward to your return after a much needed break for the center he's been driving for 15 years. Thank you, Mark.\n\nTo all, I hope -- I see you on the team. I hope you saw today on this call, an amazing team, great mission, steadily improving in the right direction. Do we have a fun sign-off today? Did we figure one out, Fritz? Are we doing our best impression of Blue Steel?\n\nEric Fritz -- Chief Marketing Officer\n\nWell, we had a great carry outtake, but I don't think we had it prepped well enough for the sign-off. So yeah, just yeah, your best Blue Steel will work just fine.\n\nJesse Fittipaldi\n\nEverybody -- I'm not doing it by myself. Everybody's best impression of Blue Steel. Here we go. OK.\n\nAll right. Have a great week.\n\nEric Fritz -- Chief Marketing Officer\n\nSee you, everyone.\n\nLynn Yeager -- Chief Experience Officer\n\nThanks, everyone.\n\nDuration: 0 minutes\n\nJesse Fittipaldi\n\nDoug Campoli -- Chief Financial Officer and Treasurer\n\nTerry Becker -- Chief Operating Officer\n\nEric Fritz -- Chief Marketing Officer\n\nLynn Yeager -- Chief Experience Officer\n\nKevin O'Rourke -- Chief Commercial Officer\n\nDwayne Lum -- Chief Product Officer\n\nMore FUV analysis\n\nAll earnings call transcripts"
}