{
  "companyName": "fuboTV, Inc.",
  "companyTicker": "FUBO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/04/fubotv-inc-fubo-q3-2022-earnings-call-transcript/",
  "content": "fuboTV, Inc. (FUBO 2.35%)\nQ3 2022 Earnings Call\nNov 04, 2022, 8:30 a.m. ET\n\nOperator\n\nHello. My name is Lisa, and I will be your conference operator today. At this time, I would like to welcome everyone to the FuboTV Q3 2022 earnings call. [Operator instructions] I would now like to turn the call over to Ms.\n\nAlison Sternberg, SVP, investor relations. \n\nAlison Sternberg -- Senior Vice President, Investor Relations\n\nThank you for joining us to discuss FuboTV's third quarter 2022. With me today is David Gandler, co-founder and CEO of Fubo; and John Janedis, CFO of Fubo. Full details of our results and additional management commentary are available in our earnings release and letter to shareholders, which can be found on the investor relations section of our website at ir.fubo.tv. Before we begin, let me quickly review the format of today's presentation.\n\nDavid is going to start with some brief remarks on the quarter and Fubo's strategy, and John will cover the financials and guidance. Then I'm going to turn the call over to the analysts for Q&A. Before we begin, I would like to remind everyone that the following discussion may contain forward-looking statements within the meaning of the federal securities laws, including, but not limited to, statements regarding our financial condition, anticipated financial performance including quarterly and annual guidance and long-term targets, market opportunity, acquisition strategy and ability to integrate those acquisitions, expected synergies of the technology platforms and our business strategy and plans. These forward-looking statements are subject to certain risks, uncertainties and assumptions.\n\nImportant factors that could cause actual results to differ materially from forward-looking statements can be found in the Risk Factors section of our quarterly report on Form 10-Q for the quarterly period ended September 30, 2022, to be filed with the Securities and Exchange Commission and other periodic filings with the SEC. These statements reflect our current expectations based on our beliefs, assumptions and information currently available to us. Although we believe these expectations are reasonable, we undertake no obligation to revise any statements to reflect changes that occur after this call. During the call, we also refer to non-GAAP financial measures.\n\nThese non-GAAP measures should be considered in addition to and not as a substitute for or in isolation from our GAAP results. Reconciliations of these non-GAAP measures to the most directly comparable GAAP measures are also available in our Q3 2022 earnings shareholder letter, which is available on our website at ir.fubo.tv. With that, I will turn the call over to David.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nThank you, Allison, and good morning, everyone. We appreciate you joining us today. I'm very pleased with the results for the third quarter. We delivered North American revenue of $219 million, up 40% year over year; and revenue in North America, up $22.5 million, up 21% year over year.\n\n1,231,000 paid subscribers in North America and 358,000 in rest of world. And we closed the quarter with $307 million of cash and cash equivalents, restricted cash and short-term investments. More importantly, I am pleased with the direction we are headed in and the overall trends of our business as we make tough, yet necessary strategic decisions to improve the overall business. We are confident the actions we are taking and the path we are on will yield value for our customers, our shareholders and our employees.\n\nBefore moving on, I wanted to discuss our recent decision to close our Fubo gaming business and ceased operations of our owned and operated Fubo sportsbook. This was not an easy decision, and it was made after much careful deliberation. Ultimately, we felt the decision was prudent in support of our profitability goals, allowing us to focus all of our resources on our core streaming business. But as we continue to focus on data and interactivity to differentiate our virtual MVPD, we still believe the integration of gaming and live sports streaming is powerful.\n\nWe remain open to the possibility of exploring ways to optimize our assets in the gaming space without investing our own capital. The closure of our Fubo sportsbook, along with our sharp focus on the judicious deployment of capital and cash preservation provides us with added confidence in our current liquidity position. We were pleased to see improvements in our adjusted EBITDA margin in the third quarter, which we expect will continue throughout the balance of the year. Our initiatives drove outperformance in the quarter and position us well to achieve our goal of generating positive free cash flow in 2025 via sustained and profitable growth.\n\nOur third quarter results provide us with added confidence in our ability to build a leading global live TV streaming platform differentiated by the greatest breadth of premium content and interactivity. Our ad business delivered solid growth in Q3. As we announced at the beginning of the year, our focus has been on investing in our advertising team, our technology and our infrastructure. To that end, we have made improvements to drive higher CPMs and fill rate, both important components in our strategy to drive ad revenue growth.\n\nAs we have stated in prior quarters, media consumption trends continue to move in our favor with the acceleration of cord cutting. At this point, it has been well reported that consumers are growing frustrated with the ongoing friction and fragmentation of streaming services and content. With the average U.S. households now subscribing to almost five streaming services, it is clear, consumers are having to stack streaming services in order to gain access to the content they want.\n\nAnd with streamers increasing their investment in original programming and passing those costs to consumers, the monthly subscription fees of all of these stack services in the aggregate are now approaching the cost of cable. The ratings tell the same story. Consumers who watch sports are not turning to plus and direct-to-consumer streaming services. According to Nielsen, viewership for Thursday Night Football has been trending downward week by week in 2022 and has deteriorated year over year compared to when those same games were available on linear TV.\n\nThese are key dynamics that inform why we are more bullish than ever on our aggregation model, a model that offers consumers a streaming platform with unique content both live and on-demand and that is presented to them through a personalized experience. Technology is about effectiveness, efficiency and experience. And that's why we believe virtual MVPDs are best suited to deliver consumer value and drive profitability for content owners. Our winning value proposition to consumers was recently underscored by our No.\n\n1 ranking in customer satisfaction among live TV streaming providers by J.D. Power for 2022. Fubo scored No. 1 by consumers and satisfaction for programming, features and functionality, customer care and billing and payment, and did so against much larger and more established competitors.\n\nThis reinforces our belief in Fubo's competitive advantage. We offer a high-quality product with innovative technology. In effect, we are a premium platform. Moreover, not only does our premium offering continue to drive an increasing number of consumers to our platform, but we are keeping them engaged with this quarter representing an all-time low for subscriber churn.\n\nIt is important to note that Fubo collects over two billion data points across our subscriber base each month, affording us the opportunity to continue to build impactful features, develop algorithms and make informed content and packaging decisions. Our strategy is to expand unit economics by aggregating the best sports and entertainment content, keeping customers engaged to drive advertising sales and upselling subscribers on additional content and features, all with the vigilance around content costs. I also wanted to take this opportunity to express how extremely proud and excited we are to partner with actor and serial entrepreneur, Ryan Reynolds and his Maximum Effort Productions. We will be working with Ryan and his team to create original content for the Maximum Effort channel and plan to partner with brands to minimize the incremental cost to Fubo.\n\nFubo will manage all advertising sales for the channel, which we expect to launch in mid-2023. As we shared previously, we believe our internally built technology stack and forthcoming next-gen global unified platform will position us to build on our No. 1 customer satisfaction ranking and continue to innovate faster and more effectively than our competitors. Our goal is to offer consumers a choice on how they want to engage with live TV, whether that be leaning back or leaning forward.\n\nFor consumers who wish to lean forward, we offer multiple interactive products that have led to higher engagement. Over time, we believe interactivity will expand ARPU and drive engagement and retention. Looking ahead, as John will detail, we are revising upward our North American guidance to include total full year 2022 revenue in the range of $949 million to $954 million. In summary, our North American streaming business achieved double-digit year-over-year growth across subscribers, total revenue and ad revenue, while our rest of world streaming business performed well against revenue and subscriber expectations.\n\nAlongside this top-line growth, we are making marked progress toward our profitability targets. I will now turn the call over to John Janedis, CFO, to discuss our financial results in greater detail. John?\n\nJohn Janedis -- Chief Financial Officer\n\nThank you, David, and good morning, everyone. We had a strong quarter across several of our key KPIs, subscribers, total revenue and ad revenue, delivering against our third quarter forecast. Global revenue for the third quarter was $224.8 million, a 43% increase versus $156.7 million in Q3 of 2021. Total revenue included $201.9 million in subscription revenue, a 46% increase versus $138.1 million in Q3 2021 and $22.7 million in advertising revenue or a 22% increase year over year.\n\nNorth American subscription revenue grew to $196.3 million, an increase of over 42% year over year despite a highly competitive and challenging operating environment. While rest of world subscription revenue grew to $5.6 million. We also achieved a sequential improvement in operating cash flow and year-over-year improvement in adjusted EBITDA margin, and expect these trends to continue throughout the balance of the year. In rest of world streaming, which includes Molotov, we ended the quarter with nearly 360,000 total paid subscribers.\n\nOur focus is primarily on integration and realization of the approximately $75 million of cost synergies expected between 2022 and 2025. We are also pleased that rest of world subscriber growth, revenue growth and cash flow has performed well against expectations. Total operating expenses as a percentage of revenue increased by 97 basis points versus the prior-year period primarily due to a $35.5 million non-cash impairment charge associated with our gaming segment. Our third quarter adjusted EBITDA loss came in at $92.7 million compared to a loss of $81.3 million in the third quarter of 2021 and adjusted EBITDA margin came in at minus 41%, an improvement of 1,062 basis points year over year.\n\nMoving down the income statement. Net loss in the third quarter was $152.7 million, including the aforementioned non-cash impairment charge of $35.5 million. This led to a third quarter 2022 earnings per share loss of $0.82. Adjusted EPS in the third quarter of 2022 was a loss of $0.52.\n\nNote that adjusted EPS excludes the impact of the non-cash impairment charge, stock-based compensation and the amortization of intangibles, amortization of debt discount and other non-cash items. We remain highly disciplined in the management of our capital structure to afford Pluto TV, the financial flexibility to fund measured and disciplined growth initiatives. Operating cash flow in the quarter was negative $76.4 million, including $8.6 million operating cash outflow associated with the wagering business. This represented a $14.5 million sequential reduction in operating cash flow.\n\nOur expectation continues to be that operating cash flow losses will moderate further over the rest of the year. Now turning to our balance sheet. We ended the quarter with $307.4 million of cash and cash equivalents, restricted cash and short-term investments. We are confident in our current liquidity position in support of our global streaming business and growth initiatives.\n\nRegarding our ad business, our focus has been on investing in our advertising team, technology and infrastructure. These investments are beginning to pay off as third quarter ad revenue reached $22.5 million, an increase of 21% versus Q3 2021, and represented approximately 10% of total revenue. North America ad ARPU decreased approximately 12% year over year to $7.37 for the quarter. On a sequential basis, ad ARPU increased 2% over the second quarter 2022 levels.\n\nAnd September was Fubo's strongest ad revenue month in our history with momentum building throughout the quarter. We expect to see this continued strength in the fourth quarter with increased demand heading into the seasonally strong holiday period augmented by a competitive midterm election cycle. Now moving on to our guidance. First, we will discuss North America streaming, and we are revising our guidance upwards to total Q4 subscribers of 1,355,000 to $1,375,000, representing 22% year-over-year growth at the midpoint.\n\nTotal Q4 revenue of $277.5 million to $282.5 million, also representing 22% year-over-year growth at the midpoint. And total full year 2022 revenue of $949.7 million to $954.7 million, representing 50% year-over-year growth at the midpoint. For rest of world, our guidance is for Q4 subscribers of 355,000 to 365,000, Q4 2022 revenue of $5 million to $6 million and full year 2022 revenue of $22.2 million to $23.2 million. In closing, given where we are as a business, progress will not always be linear, but we are very pleased with our current momentum.\n\nWe believe we are at an inflection point and are excited about our path forward, allowing our customers while also executing against our profitability goals. \n\nOperator\n\n[Operator instructions] Your first question comes from the line of Laura Martin with Needham.\n\nLaura Martin -- Needham and Company -- Analyst\n\nHi, there. Good morning, guys. Let me start with advertising. I just saw some granularity because I have -- ARPU was down 12%, but we have this direct sales force, David, and remember, we're going to add a direct sales force because we're going to help our ARPU.\n\nAnd I would have guessed that September being our strongest month was because of content and you got the NFL back in September. So I would have thought that would have aided ARPU not driven to debt. So I guess the question is, could you just give us some more granularity on what's driving the lovely advertising growth, David. \n\nDavid Gandler -- Founder and Chief Executive Officer\n\nSure. Why don't I kick it off, and John can chime in. First of all, good morning. Yes, so you have to remember we have -- ARPU is not just for U.S.\n\nEnglish packaging. So we have a different mix that comes in. So the ad ARPU is probably not the best way to look at it. When we isolate the English packaging from the rest of the packages that are available in North America, we see a pretty strong increase year over year.\n\nOn a CPM basis, we're up about 6%. And again, we're looking at revenue right now, which was up 21%. And just terms of fill rate, in terms of CPM and overall direct business, we've seen a significant uptick, and we're very confident in the continued growth of the ad business. But again, on the ad ARPU side, you're going to see fluctuations in ad ARPU just really related to the mix. \n\nJohn Janedis -- Chief Financial Officer\n\nAnd Laura, let me add a couple of things to your question as well and to augment what David has said. And so if you look at just say, ad ARPU in a vacuum in the U.S. only, sequentially, it was up in the high single digits. When we get to the fourth quarter on a U.S.-only basis, that should be solidly in the positive year over year.\n\nAnd not the U.S. as directly, but I would just add in terms of our ad growth, if you look at us, I think, versus some of the others that have already reported, I think we've put up some pretty good numbers. And I think our outlook is probably a bit better. And I think part of that is an outcome of your point around direct sales.\n\nI think the sales team additions that we made earlier in the year started to hit their stride later in the third quarter, call it three to six months after they joined the firm. And so that is also one of the benefits that we started to see coming out of the third quarter into the fourth quarter. \n\nLaura Martin -- Needham and Company -- Analyst\n\nFantastic. Thanks for that granularity. My follow-up would be on gaming. David, when we came into the IPO, you had a deal with FanDuel, you walked away.\n\nWe did the sportsbook. We've now closed that down. Could you talk about your negotiating position when you're going back to like the DraftKings and FanDuel, how that's changed since you walked away from the FanDuel arrangement originally, which it sounds like sort of what we're going back to now.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nYes. So just to be clear, I'm extremely bullish on the integration of gaming and video. Obviously, given the macro environment, we have a responsibility to shareholders to make the right short and mid-term decisions. And so we are in discussions with, I would say, numerous books beyond the ones that you probably mentioned.\n\nAnd these discussions, I would say, are pretty healthy. It's a very competitive landscape on the gaming side. And if you think about it, 98% of our audience watches sports. I was just looking at the numbers last night.\n\nThat's pretty amazing. Especially relative to an Amazon, where if you think about 150 million prime customers and the latest ratings, whether you take Nielsen or whether you take their own numbers, it's still about 7% to 8% of audience. So we feel that we'll have some really solid discussions over the next few months. And we'll look for a way to maximize the value of our assets, both on the gaming side as well as on our audience.\n\nBut I think those conversations will continue. And again, I think we're in pretty good position given the fact that it's a very unique asset. Fubo being the unique asset. And before we move on  -- one last thing if you'll report move on, back to the ad ARPU because I also wanted to bring it into the North America broadly as opposed to U.S.\n\nonly because I think it's important to note that in the fourth quarter, we would expect the ad ARPU to grow on both a U.S. and Canada basis year over year. And so that should grow nicely.\n\nLaura Martin -- Needham and Company -- Analyst\n\nThank you very much.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nYou're welcome.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nThank you very much for taking my question. I guess my first one is on, David, your comment on CPMs on fill rates. So how should we think about that just on a go-forward basis, not only in the fourth quarter but add more content from Disney and Netflix comes on streaming, how does that impact Fubo's platform? And then I have a follow-up, please.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nSorry, Shweta, was your question related to those companies launching ad-supported? Sorry, I wasn't sure exactly what's wrong with the question.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nYeah, that's right. So with CPM, how do you expect CPMs on Fubo's platform to trend in the near to midterm as more supply comes on?\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nYeah, so I'm actually extremely excited about the ad side of our business. We spent the first six months of the year really developing the platform, focusing on header bidding solutions and other optimizations, leveraging some addressable deals for more sort of data integrations. And we feel really good. We have -- I would say, CPM growth is still low 20s, if you will, up about 6% from last year.\n\nSo that's a good sign. We also differentiate from Netflix, in particular, just because we're heavily sports and news oriented. So I feel like we're still in very much the premium space. You could see that, as John said a few moments ago, that our numbers relative to everybody else has come out seem to be relatively strong.\n\nAnd in particular, our guidance, I think, is also strong. We feel very good. We're continuing to see strong momentum throughout October, but there's significant room to go. As I said, we're in the low 20s.\n\nI anticipate when we hit our stride, we should be somewhere in the mid-30s and then layering on top of that some addressability. We've also started to develop some new ad inventory, which is already sold out for the fourth quarter. We launched something that I've been tracking on Roku, which is their banner ads, and they use their battens to drive sales for different video services. So again, we're in the same space.\n\nWe have a customer that spends over $70 a month. We have a customer demographically, who is male skewing 18 to 49 and very hard to reach on traditional television. So I think the positive side of Netflix and Disney is that they're actually going to take our message to market. And so we think that buyers will probably be more active in the connected TV space, which, again, roughly 95% of our inventory is connected TV inventory.\n\nSo with premium content at a premium demographic, I feel very good about our ability to differentiate from some of the other offerings out there and to continue to drive sales.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nThanks, David. Just a follow up to that, how big is political as a percentage of the overall business? And my other question was on gaming. Any additional color on how you're thinking about it in terms of cost savings? Thanks a lot.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nSo why don't I start on the political side, and then I'll let John go from there. So just on the political side, we have seen an influx of orders, I would say, about -- started about six weeks ago, eight weeks ago, which I would say the cadence of those orders has increased to almost daily. So it's -- with CPMs that are well above what you typically would see in the third quarter. So I don't know if we can give a percentage, but I would say it's -- you can? Go ahead.\n\nJohn Janedis -- Chief Financial Officer\n\nYes. Let me add a little bit to that. I'd say it's mid-single-digit range, I'll call it, of our annual revenue, so not quite like a local broadcaster, of course. And I would also tell you, relative to plan, if you will, we had a range of outcomes.\n\nAnd I'd say ultimately, it came in about 10% or so above our -- the top end of the range of outcomes that we expected. And then would you just mind repeating the second question?\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nHow should we think about cost savings from seeing your sportsbook and just the change in gaming business?\n\nJohn Janedis -- Chief Financial Officer\n\nYes. So we haven't given a sort of a range, if you will, in terms of the investment in the sportsbook. What I would tell you, though, as you would suspect that it certainly extends our runway. And so I think what we've said historically is that we have cash through 2023, and then our cash needs in '24 are relatively modest.\n\nI would say in broad strokes that ending or exiting gaming would modestly extend that. And then I would also -- don't forget that Q1 tends to be our highest cash use quarter from a seasonal perspective.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thank you, John. Thank you, David.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Darren Aftahi with ROTH.\n\nDarren Aftahi -- ROTH Capital Partners -- Analyst\n\nHey, guys. Good morning. Two, if I may. Just on the churn, I suppose an all-time low.\n\nCould you just speak to kind of what's driving that? And kind of if you see any further downside? And as a follow-up, just any commentary around the FAST channel. I know you said you had 60 and I think the goal is 100 at the analyst day by the end of the year and just the benefit that's adding to the ad business. Thanks.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nSure. What was the first question? Sorry. Sorry, Darren, can you repeat the first question?\n\nDarren Aftahi -- ROTH Capital Partners -- Analyst\n\nThe first question was just around churn, David, and just where you see that going heading into that trial.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nYes. So during the road show in 2020, we said our long-term goal was to hit sort of mid-single digits. I would say that we were pleasantly surprised to see that we actually hit that in the third quarter. And that make sense because, as you know, we're a seasonal business.\n\nSeptember being the start of the sports calendar and so you have a return of customers that either pause their service or just return. And so that feeds back into our net adds. And so I would say the brand is starting to drive a lot of value. People come to Fubo for the sports.\n\nAnd that's obviously supported by the No. 1 ranking in customer satisfaction across all of these other services, which I thought was another big win. But people like the service. They like the product and we're starting to see that follow through not only from a net adds perspective on the growth side, but also from the churn perspective.\n\nSo we anticipate continued year-over-year blended churn to continue to decrease going forward.\n\nJohn Janedis -- Chief Financial Officer\n\nDo you want to take the FAST?\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nYeah, and then on the FAST channel -- do you want to?\n\nJohn Janedis -- Chief Financial Officer\n\nSo I'll give you a little more color on FAST, Darren. So for context, I think in the third quarter, our FAST as a percentage of ad revenue nearly doubled sequentially. Not that it's a huge number, but it certainly is trajectory-wise, looking good. From the perspective of the FAST channels, you are correct.\n\nWe ended the third quarter at 60. As you saw in the release, we have added to that in October. And we'll see where we end the year. It will be plus or minus 100.\n\nBut if we don't get there by the end of the year, which I think we have decent chance to do will be there in early in '24 -- '23. And the runway there remains, I'd say, pretty large.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nYeah. And Darren, just to add strategically why this is important, I'll give you some more color around that. You have all of these plus services continue to try and migrate customers from bundles into their own services. And so what we decided was continuing to add FAST channels allows us to also push consumers to channels where we actually have more inventory.\n\nSo just to give you a sense. For the third quarter, about 3% of our viewership was on FAST channels. So what this also allows us to do is create better leverage for ourselves when we start to negotiate deals. And over time, we obviously have more inventory in the FAST channel.\n\nSo this is something that we're going to continue to do. And so to create two things: one, more leverage when we renew some of our entertainment deals; and then on the opposite side, it should also be able to help us drive more ad revenue, albeit at lower CPMs, but still really allows us to sort of leverage all of the data capabilities and addressability that we're developing now. So we're very bullish, one, on the ads business in general. Number two, on our ability to keep people engaged on the platform.\n\nDarren Aftahi -- ROTH Capital Partners -- Analyst\n\nHelpful. Thank you.\n\nOperator\n\nYour next question comes from the line of Clark Lampen with BTIG.\n\nClark Lampen -- BTIG -- Analyst\n\nHey. Good morning. I've got two, please. John, I'm sorry if I'm prompting you to rehash right now.\n\nBut for the fourth quarter guidance, is there anything baked in for World Cup? And if there is, could you compare that to maybe what you saw with the euro tournament. And I guess I'm curious, since there's less of a gap now between domestic league and sort of champions league content post tournament, do you expect maybe higher retention of any subs that you could be adding? And then, David, just on the Fubo gaming transition, you talked about sort of the calculus around why you guys are moving away before and some components of that decision. But was there anything that you saw with sort of this idea of marrying live sports and betting options that ended up being either less compelling or maybe with the engagement, not up to the level that you're initially expecting. I'm just curious if sort of from like a base product and sort of user engagement perspective, there was anything that turned out to be a little bit different than maybe you were anticipating.\n\nThanks a lot.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nYou want to start with the World Cup?\n\nJohn Janedis -- Chief Financial Officer\n\nYeah, sure. Clark, thanks for the question. Yeah, so taking a step back, at the midpoint, our guidance assumes about 130,000 net adds for the quarter. That does take into account, to some extent, the impact World Cup on both acquisitions and on reactivation.\n\nAnd for context, the Euro tournament, which was the summer of last year, that was a key driver for that quarter. And we anticipate a higher number of trials owing to higher interest for the World Cup. And I'd say given that the Euros was broadcast in the summer versus the World Cup being broadcast during NFL, College Football and the holidays, we anticipate higher engagement due to cross viewership of non-World Cup content yielding better 4Q retention on World Cup sales relative to Euro. So maybe I'll leave it at there. \n\nDavid Gandler -- Founder and Chief Executive Officer\n\nI'll just add to that. I mean, there's some noise around the World Cup this year, which we've never experienced in the past. As you know, it's now coming into the fourth quarter and that also has to compete with NFL and College Football. Moreover, if you think about just time zone wise, these games are not in prime time.\n\nSo they'll probably be, I would assume somewhere around 10 a.m. So that may also have some impact. But we do anticipate that consumers will choose Fubo over competitors during the World Cup. And so we're certainly excited about that and we'll follow that very closely, and the teams are prepared to take advantage of any organic traffic that comes in.\n\nAs it relates to gaming, look, I'm very upset about gaming in general because I do believe in the thesis. More importantly, we had about seven to 10 days of work in New Jersey, where without any marketing or really any activity, we saw daily and weekly upticks in new accounts related to watching Fubo channels on the platform. So I think that our goal was to launch and start to tweak as we do improve the funnel. And so the good news is that the technology is available.\n\nAnd when we decide who that partner will be and obviously, we want to make sure that the economics make a lot of sense for us, we'll continue to develop that product for third parties. It might initially start with one and maybe down the line years from now, two years from now, we might decide that it might be best to just create more of a market auction-type environment for gaming. So we'll have to see, but it's touch and go at the moment. But again, I still believe that this is probably the best thing.\n\nAnd you should also think about -- and maybe this is probably a good segue into why we thought about this initially. If you think about subscription businesses, we're not just a streaming platform. We acquire subscribers with a SAC that we like to say is between 1 and 1.5 times. And so the whole point of acquiring customers is to be able to sell them more and more products and really sort of drive that relationship, which is where the gaming piece came in.\n\nObviously, there are other things that we're also thinking about in those terms. Relative to a streaming platform, which really doesn't have a business model long term because you really -- you can't spread the acquisition costs over just one single product. So I think that we probably changed our mindset a little bit and we'll be thinking more about how to leverage our base and drive incremental revenue, ARPU and margin by way of working with third parties. But in terms of the thesis, I actually think more so now that this was actually a very good idea.\n\nAnd just to remind everyone, I know there's going to be some negative feedback on shutting this down. But the reality is when we announced that we wanted to do this, the 30-year fixed rate was somewhere around two and three-quarters, right? And today, I think as of yesterday, the 30 year was 7.2% or something like that. So the market has completely changed and the calculus that came into that decision-making process back then and the cost of capital, obviously, has changed drastically in a very short period of time. But again, I think we'll be able to take advantage of, one, the data that we already have and also some of the technology that we've developed.\n\nAnd also, we're going to continue down the path of interactivity. We've said all along that we want to differentiate our product and make it more for -- whether customers are interested in the lean back experience or a lean forward experience. So we're very focused on that. We're leveraging our data.\n\nAnd again, just the fact that we received the great distinction of -- from J.D. Power really highlights the fact that we're onto something big. Last thing I'll mention is that I do think that we're getting close to an inflection point similar to Spotify and music, where there is no path forward for most companies in the streaming space. You cannot make money over the long term only because, again, our business is about spreading subscriber acquisition costs and selling more products, whereas media is really about lifetime value.\n\nAnd I think the NFL has really proven when you have a very small TAM relative to the global TAM, how you slice and dice and cohort customers and create products for consumers up and down the demand curve, whether it's a Sunday night broadcast or Thursday night football, an NFL red zone, NFL plus products. So I really think that as companies start to change the way they think about profits and as the market changes, I think we're going to be in a really solid position to drive significant customer value. And equally noteworthy at this point, I would say, probably strong opportunities for media companies to monetize their content. So again, we're very bullish in general.\n\nClark Lampen -- BTIG -- Analyst\n\nThank you, both.\n\nNick Zangler -- Stephens, Inc. -- Analyst\n\nHey, guys. I wanted to ask about FAST channels because this is -- honestly, it's a conundrum for me. If Fubo users spends too much time on FAST channels, on that offering, I would think they might wonder why they're paying a monthly fee to Fubo when these FAST channels are available for free on the CTV operating systems like a Roku, a Vizio through which users obviously accessing the Fubo app. Obviously, I think that could then lead to a user dropping the service.\n\nBut at the same time, this changes, I guess, if the FAST channels are exclusive. And so my question is, like how often is that the case for you guys, where you have exclusive FAST channels? And are you trying to push into these exclusive arrangements so that the FAST channels you offer are only available on the Fubo app.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nYes. Very good question, and I would like to answer it with another question. And my question to you is with broadcast television that's effectively free with an antenna, why do people pay for broadcast television on cable? That is the conundrum. What I would say is Fubo is pretty much a gateway to television and entertainment.\n\nIt's the way we look at it. And so you're actually paying for the premium product, the ability to watch NFL and World Cup and all these great sporting events, all of your news programming, and at the same time, we leverage our AI and discovery engine to surface content that we think is going to be relevant for you. And so I'll give you an example. So for instance, if you're watching a design show on Bravo or on HGTV.\n\nIf we surface a design show from a FAST channel, I don't think a customer will care where that particular piece of programming comes from. I think what's important in this case is that the customer understands that we're actually providing an amazing service. The ability to give people all of the content in one place effectively, efficiently with a solid user experience. So I think from my perspective, again, I use the NFL example, they've done a great job cohorting users and slicing and dicing their content to maximize the value.\n\nI think there's a play for us to be able to look for content that is very similar in nature, high production quality and surface that content to users. Obviously, that would help us drive engagement and help drive revenues. As it relates to exclusivity, I think Fubo has proven that it can compete head-to-head on a nonexclusive basis. According to Moffet Nathanson, the market is growing at roughly around 13%.\n\nWe're still continuing to grow well ahead of that number, I think somewhere between, call it, 25% and 30%. And so our goal is to ensure that we have as much content as possible that's relevant to our user base. We do have some content we've been developing. As you know, we have the Fubo sports network that continues to grow very quickly, and that's being distributed across the web.\n\nAnd we've started on our relationship with Ryan Reynolds. And so we'll look to produce some of that, obviously, supported by brands underwriting the content. But overall, I look at Fubo as an entry point for TV. And over time, I suspect what you'll see is we'll be able to buy pay-per-view, EST, watch free television and then have access to premium cable networks and plus services over time.\n\nNick Zangler -- Stephens, Inc. -- Analyst\n\nNo, that's fair. OK. So basically -- that's a good answer, which is provide the consumer with as much content as possible. And then part of the value prop is sourcing, surfacing and providing it to the consumer, whether or not effectively, if the consumer had to pay for that viewership or not via your existing arrangements.\n\nOK, that's fair. That's good. I did also want to ask just because it's been choppy out there. We've heard some pessimistic views for ad spend in the fourth quarter of some major CTV players.\n\nYou guys stated September was the best month of the quarter. You seem very optimistic for the 4Q, if I'm reading you right. Maybe just a little bit more detail here why specifically you're optimistic for 4Q. I'm assuming you guys are continuing to win new advertiser relationships, especially as the direct sales force goes to work.\n\nBut curious maybe like on existing accounts. Are you seeing a pullback on an organic basis? Or just knowing that there have been some players that have provided a very pessimistic outlook for 4Q. Can you talk about why you're so optimistic?\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nSure. Why don't I start, and John, you can chime in. So look, I would say that there are categories that are outperforming. There are advertisers within non-performing categories that are outperforming.\n\nAnd so it really comes down to a few things for us specifically. Number one is you're now entering political season, which has -- puts pressure on the inventory. That's number one. Number two, you're at the height of the sports calendar going into what looks to be a pretty cold winter.\n\nAnd so people typically spend a lot of time at home. We see hours viewed increase in the fourth quarter and into the first quarter. So I would say the pressure on the inventory from political. The addition of the World Cup will also create a lot of interest in November and December.\n\nAnd there are categories like retail to some degree that are coming back. And I think the advertisers are very interested in addressable inventory. And I will -- I don't know if you know this already or this is something that I'll be highlighting for the first time. But if you think about where we sit on the spectrum between a television set, a dumb television set and the consumer, I would say that the Vizio or the Samsungs or the Rokus, they are sitting at the opposite side of the spectrum, right in front of the TV, right? And so because we're sitting right in front of the customer, we're able to collect an exorbitant amount of data, on those users, number one.\n\nNumber two, because we've developed our own ad proxy capabilities, we actually can decide which of our partners see which data points. And so I think that creates a lot more value for us. And we obviously know our users better than a TV platform would. It was just selling on a blind basis, I would assume.\n\nSo from that perspective, I think we're pretty much in a strong spot where sports CPMs are going to be very strong. You have new CPMs that are also on the rise, just due to political. And we've just launched our new banner ads on the home page that from my understanding on one platform are already sold out. So that gives us some comfort into our numbers, and we expect strong returns on the advertising side throughout October and December.\n\nJohn Janedis -- Chief Financial Officer\n\nYeah, I'd add maybe one or two things to that as well, Nick. I caught up with our sales team earlier in the week, and I'd add maybe a couple of data points. One is that -- and I know that others have talked about cancellations and other things in terms of a scatter market. We have not seen cancellations.\n\nI think also in terms of our exposure, I think some of the weaker categories like crypto and others, we don't really have exposure to. We don't really choose to take gaming money, but we didn't really have a crypto money and those two are the weaker categories. So -- and then on top of that, I think that, again, our advertisers, again, they like our audience, they like our programming and they like it live.\n\nNick Zangler -- Stephens, Inc. -- Analyst\n\nAwesome. Thanks so much guys. Congrats on the solid quarter and good outlook here. Thanks.\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nThank you.\n\nJohn Janedis -- Chief Financial Officer\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlison Sternberg -- Senior Vice President, Investor Relations\n\nDavid Gandler -- Founder and Chief Executive Officer\n\nJohn Janedis -- Chief Financial Officer\n\nLaura Martin -- Needham and Company -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nDarren Aftahi -- ROTH Capital Partners -- Analyst\n\nClark Lampen -- BTIG -- Analyst\n\nNick Zangler -- Stephens, Inc. -- Analyst\n\nMore FUBO analysis\n\nAll earnings call transcripts"
}