{
  "companyName": "Akamai Technologies",
  "companyTicker": "AKAM",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/akamai-technologies-akam-q2-2022-earnings-call-tra/",
  "content": "Akamai Technologies (AKAM -0.47%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, and welcome to the Akamai Technologies second quarter 2022 conference call. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Tom Barth, head of investor relations. Please go ahead.\n\nTom Barth -- Head, Investor Relations\n\nThank you, operator. Good afternoon, everyone, and thank you for joining Akamai's second quarter 2022 earnings call. Speaking today will be Tom Leighton, Akamai's chief executive officer; and Ed McGowan, Akamai's chief financial officer. Please note that today's comments include forward-looking statements, including statements regarding revenue and earnings guidance.\n\nThese forward-looking statements are subject to risks and uncertainties and involve a number of factors that could cause actual results to differ materially from those expressed or implied by such statements. The factors include any impact from macroeconomic trends, the integration of any acquisitions and any impact from geopolitical developments. Additional information concerning these factors is contained in Akamai's filings with the SEC, including our annual report on Form 10-K and quarterly reports on Form 10-Q. The forward-looking statements included in this call represent Akamai's view on August 9, 2022.\n\nAkamai disclaims any obligation to update these statements to reflect new information, future events, or circumstances, except as required by law. As a reminder, we will be referring to some non-GAAP financial metrics during today's call. A detailed reconciliation of GAAP and non-GAAP metrics can be found under the financial portion of the Investor Relations section of akamai.com. And with that, let me turn the call over to Tom.\n\nTom Leighton -- Chief Executive Officer\n\nThanks, Tom, and thank you, all, for joining us today. I'm pleased to report that Akamai delivered strong results in the second quarter despite the ongoing challenges with the global economic environment and slower Internet traffic growth. Q2 revenue was $903 million, up 6% year over year and up 9% in constant currency. This result was driven by the continued rapid growth of our security and compute businesses, which when taken together, were up 30% in constant currency.\n\nThese two business lines now account for 54% of our overall revenue. Q2 non-GAAP operating margin was 29%. Q2 non-GAAP EPS was $1.35 per diluted share, down 5% year over year, but up 0.5% in constant currency. As Ed will discuss later, EPS was negatively impacted by foreign exchange rates and a higher effective tax rate compared to last year.\n\nFree cash flow was very strong at $223 million in Q2, and it accounted for 25% of revenue. We've been leveraging our financial strength to make substantial investments in enterprise security and cloud computing. We've also used some of this cash to buy back additional stock. In the first half of the year, we spent $268 million to repurchase 2.6 million shares.\n\nThis puts us on track to go beyond what's needed to offset dilution from employee equity programs this year. I'll now say a few words about each of our three main lines of business: security, compute, and delivery. Starting with security. Our security solutions generated revenue of $381 million in Q2, up 17% year over year and up 21% in constant currency.\n\nGrowth in security was driven primarily by our app and API security portfolio, which includes our market-leading web app firewall, Bot Manager, Account Protector, and Page Integrity Manager solutions. Our Zero Trust enterprise security portfolio, led by Guardicore, also performed well in Q2 with numerous significant customer wins. A leading global provider of financial data concerned about ransomware added Guardicore segmentation solution to the seven security products they already buy from Akamai. A major insurance company in France became a new customer for Akamai when they adopted our Guardicore solution to help meet European financial regulations.\n\nThe sale, led by one of our carrier partners, is indicative of the excitement we're seeing for our Zero Trust solutions among our partners. In Australia's largest telecom provider, Telstra, expanded their business with us by adding our Secure Web Gateway solution to their portfolio of Akamai products. They told us, \"As part of Telstra's journey in delivering fit-for-purpose solutions, Akamai has been a key industry partner with network-based anti-phishing malware protection and content filtering. Telstra blocks millions of threats every single day, and Akamai is a key partner in that protection.\" Overall, our Zero Trust solutions delivered $43 million of revenue in Q2, up 59% year over year in constant currency.\n\nThis is an area where we're making -- continuing to make major investments and where we anticipate significant future growth. Turning now to compute. I'm very pleased to report that the revenue for our compute product group was $106 million in Q2, up 74% year over year and up 78% in constant currency. As a reminder, the compute product group includes Linode and Akamai solutions for Edge computing, storage cloud optimization and Edge applications.\n\nA common theme that I heard when I met with executives from around the world in Q2 was their growing concern about being locked into contracts with cloud giants that are consuming large and rapidly increasing shares of their IT budgets. They want more choice in compute and are open to alternative clouds like Linode as a more efficient way to build, run and secure their applications. As a result, many large enterprises have begun testing the Linode platform, including a major U.S. airline, one of the world's top gaming companies and a global provider of weather data.\n\nMajor media companies, in particular, expressed significant concerns with their growing use of the giant clouds. Not only are the cost high, in part because of the fees from moving data from cloud storage to a CDN for delivery, but they're also concerned about their increasing reliance on a direct competitor. As an example, I'm very pleased to announce that we recently signed a contract with one of the world's largest media companies to run a critical new workload on Linode. The service is live today, and we anticipate that it will generate millions of dollars of annual revenue as their usage grows over time.\n\nThis is just the tip of the iceberg when it comes to our potential for future revenue growth in compute. Cloud computing is a fast-growing, multi-hundred-billion-dollar market. And as we scale Linode to be enterprise grade with pops and hundreds of locations around the world, we should be in an excellent position to capture a share of this market, particularly from companies that value our industry-leading security and delivery solutions and that don't want to be locked in to more expensive options with a cloud giant that competes against them. Our delivery products generated revenue of $417 million in Q2, down 11% year over year and down 8% in constant currency.\n\nThese results were clearly impacted by a continued deceleration in traffic growth among our largest media customers and by the lower unit pricing we provided as part of their recent contract renewals. It's important to note that Akamai remains the market leader in delivery by far. Moreover, customer churn in the first half of this year remained at record lows, and lost annual revenue from churned accounts in Q2 was even less than in Q1. We also saw some notable delivery customers move business to our platform in Q2 after trying out competing solutions.\n\nNo matter which competitor they've been working with, they chose Akamai because of our superior performance and reliability. Like many companies, we're managing through a time of substantial economic headwinds and uncertainty with escalating inflation, the strengthening U.S. dollar, growing concerns about a global recession, escalating geopolitical tensions and conflicts, and a slowing of Internet traffic growth as the world tries to return to normal in the midst of a pandemic. As Ed will talk about shortly, I think it's prudent to assume that these headwinds will dampen our growth rates and profitability over the next several quarters, particularly in our delivery business, which is being impacted by the challenges that many major media companies have recently reported.\n\nGiven the enormous market opportunity in front of us, we will continue to focus our investment on Zero Trust enterprise security led by Guardicore, and cloud computing, led by Linode. These investments, combined with the economic headwinds I just mentioned, will likely result in our operating margin remaining below 30% in the near term. We expect our margins to improve over time as our security and compute businesses continue to grow and account for a larger share of total revenue. In addition, we're embarking on several major initiatives to reduce cost and improve operational efficiency that should help return our margins to 30% or better in the medium to longer term.\n\nAs Ed will discuss further, these initiatives include leveraging Linode to significantly reduce our cloud spend with hyperscalers, slowing the capital expenditures for our delivery platform and optimizing our real estate footprint. While these are challenging times to be sure, I believe that Akamai is on the right track for long-term growth and success and that we're well-positioned because of our unique global-edge platform, our market-leading security and delivery solutions, our new compute capabilities which provide great performance at an affordable cost, our premier enterprise customer base and our strong financial position and profitable business model. Now I'll turn the call over to Ed for more on Q2 and our outlook going forward. Ed?\n\nEd McGowan -- Chief Financial Officer\n\nThank you, Tom. As Tom mentioned, Akamai delivered another solid quarter in Q2. Q2 revenue was $903 million, up 6% year over year or 9% in constant currency. Revenue was in line with our guidance and was led by our security and compute businesses.\n\nAs we mentioned on our last call, we expected significant foreign exchange headwinds to impact our revenue in Q2. The much stronger U.S. dollar negatively impacted our year-over-year growth rate by 3 points or approximately $29 million of revenue year over year and $14 million on a sequential basis. On a combined basis, our security and compute businesses represented 54% of total revenue, growing 26% year over year and 30% in constant currency.\n\nSecurity revenue was $381 million and grew 17% year over year and 21% in constant currency, with continued strength from our Zero Trust business led by Guardicore. Guardicore delivered approximately $14 million of revenue in Q2. Security represented 42% of total revenue in Q2, which is up 4 points from Q2 a year ago. Compute revenue was $106 million in Q2, growing 74% year over year and 78% in constant currency.\n\nLinode contributed revenue of approximately $32 million in the second quarter. Delivery revenue was $417 million, down 11% year over year and 8% in constant currency. It's worth noting that while traffic on our network continued to grow, the rate of that traffic growth declined sequentially in Q2. As Tom mentioned, we believe that the current macroeconomic environment has had the greatest impact on customers in our media vertical, most notably in advertising and gaming.\n\nThese challenges are most apparent in our delivery results. Also, as we talked about at our Analyst Day in May, we started to align our pricing strategy with the new traffic growth rates we have seen on our network over the last two quarters. In addition to scaling back discounts provided upon renewal, we decided to turn away some business from a very small number of customers who have extreme traffic peaks compared to their daily usage patterns. While this will result in slightly less revenue, it will enable us to significantly lower our network capex as we focus on cash flow from our delivery business to help accelerate our investments in faster-growing areas like compute and security.\n\nSales in our international markets represented 47% of total revenue in Q2, unchanged from Q1. International revenue grew 6% year over year or 13% in constant currency. Finally, revenue from our U.S. market was $477 million and grew 6% year over year.\n\nGoing now to costs and profitability. Cash gross margin was 75%. GAAP gross margin, which includes both depreciation and stock-based compensation, was 62%. Non-GAAP cash operating expenses were $292 million.\n\nAdjusted EBITDA was $388 million, and our adjusted EBITDA margin was 43%. Non-GAAP operating income was $262 million, and non-GAAP operating margin was 29%. It is worth noting that our non-GAAP operating margin was negatively impacted by approximately 1 point due to unfavorable foreign exchange. Capital expenditures in Q2, excluding equity compensation and capitalized interest expense, were $104 million.\n\nThis was much better than we expected, partly due to some Linode-specific capex that pushed from Q2 into Q3, as well as some savings from our strategy of being more selective on certain types of customer traffic. These savings were most apparent in our network capex, excluding Linode, which was only about 3% of revenue. GAAP net income for the second quarter was $120 million or $0.74 of earnings per diluted share. Non-GAAP net income was $216 million or $1.35 of earnings per diluted share, down 5% year over year and up one-half of 1% in constant currency.\n\nIt's worth noting that foreign exchange negatively impacted our non-GAAP EPS by approximately $0.07. Taxes included in our non-GAAP earnings were $42 million based on a Q2 effective tax rate of approximately 16%. This was about 1.5 points higher than last year. Moving now to cash and our use of capital.\n\nAs of June 30, our cash, cash equivalents and marketable securities totaled approximately $1.3 billion. During the second quarter, we spent approximately $165 million to repurchase shares, buying back approximately 1.6 million shares. Our ongoing share repurchase activity has resulted in a net reduction in our non-GAAP fully diluted shares outstanding of approximately 4 million shares or roughly 2% on a year-over-year basis. We ended Q2 with approximately $1.5 billion remaining on our current repurchase authorization.\n\nOur intention is to continue to buy back shares to offset dilution from employee equity programs over time and to be opportunistic in both M&A and share repurchases. Before I provide our Q3 outlook and an update to our 2022 guidance, I want to highlight several factors. First, with nearly 50% of our revenue coming from outside the U.S., foreign exchange continues to be a significant headwind to our reported results. At current spot rates, our guidance now assumes foreign exchange will have a negative $114 million impact to revenue in 2022 on a year-over-year basis.\n\nAs I mentioned previously, foreign exchange also impacts our margins and earnings. We estimate FX will negatively impact non-GAAP operating margin by approximately 1 point year over year and non-GAAP earnings by approximately $0.31 for the full year 2022. Second, we are incrementally more cautious on the outlook for traffic growth in Q3 and Q4. Based on our year-to-date trend, plus what we are hearing from other large Internet companies, we are anticipating a slower than usual traffic growth rate for the remainder of 2022.\n\nThird, as a result of the expected slower traffic growth rate and our updating pricing strategy that we noted earlier, we anticipate capex to be significantly below our previous outlook. Finally, as Tom mentioned, we expect the more challenging macroeconomic environment to dampen our revenue growth and margins in the near term. When combined with the impact of renewing eight of our top 10 customers in the first half of the year, we expect delivery revenue to decline at a slightly higher rate on a year-over-year basis for the next two quarters. As a result of these factors, we also expect margins to decline over the near term as well.\n\nWe believe strongly in the long-term opportunities in front of us, especially in security and compute, and therefore, planned to continue to invest to exploit the market opportunity in these areas. That said, as Tom highlighted, we are embarking on several major initiatives to reduce costs and improve operational efficiency. Potential savings for each of these areas is in the tens of millions of dollars. Specifically, we are planning to do the following three things.\n\nFirst, significantly reduce our cloud spend with hyperscalers as we migrate internal Akamai workloads to Linode. Second, realized savings from our strategy of being more selective on certain types of customer traffic, which we expect will result in both lower capital expenditures and depreciation expense. And third, optimize our real estate footprint as the hybrid work experience becomes more permanent. Now turning to our Q3 guidance.\n\nWe are projecting revenue in the range of $868 million to $883 million or up 1% to 3% as reported or 5% to 7% in constant currency over Q3 2021. Foreign exchange fluctuations are expected to have a negative $11 million impact on Q3 revenue compared to Q2 levels and a negative $36 million impact year over year. At these revenue levels, we expect cash gross margins of approximately 74%. In the short term, our gross margin is negatively impacted by our continued investment in Guardicore and the Linode-related headcount, as well as higher third-party cloud costs.\n\nHowever, we are confident that this is a short-term impact only. We expect our gross margin to expand to the high 70% long-term target model as we see continued strong growth from both Guardicore and Linode as we reduce our third-party cloud costs over time. Q3 non-GAAP operating expenses are projected to be $283 million to $291 million. We anticipate Q3 EBITDA margins of approximately 41%.\n\nWe expect non-GAAP depreciation expense to be between $125 million to $128 million, and we expect non-GAAP operating margin to be approximately 27% for Q3. As mentioned previously, the near-term decline in operating margin is due to slower traffic and revenue growth, our annual merit-based wage increase, which become effective July 1, the negative impact from foreign exchange, investments associated with Guardicore and Linode and increased third-party cloud costs. As our security and compute business continue to grow and we reap the benefits of the cost savings actions I described earlier, we are confident that our operating margins will return to 30% and then grow from there. Moving on to capex.\n\nWe expect to spend approximately $109 million to $119 million, excluding equity compensation and capitalized interest in the third quarter. This represents approximately 13% of projected total revenue. And with the overall revenue and spend configuration I just outlined, we expect Q3 non-GAAP EPS in the range of $1.21 to $1.26. This EPS guidance assumes taxes of $37 million to $38 million based on an estimated quarterly non-GAAP effective tax rate of approximately 16%.\n\nIt also reflects a fully diluted share count of approximately 160 million shares. Looking ahead to the full year, we now expect revenue of $3.57 billion to $3.61 billion, which is up 3% to 4% year over year as reported or up 6% to 8% in constant currency. We continue to expect security growth of approximately 20% in constant currency for the full year 2022. We now estimate non-GAAP operating margins to be approximately 28% to 29% and non-GAAP earnings per diluted share of $5.19 to $5.37.\n\nAnd this non-GAAP earnings guidance is based on a non-GAAP effective tax rate of approximately 16% and a fully diluted share count of approximately 160 million shares. Finally, full year capex is anticipated to be approximately 12% to 13% of revenue. In closing, while the macroeconomic backdrop has become more uncertain, we believe that we are in the right markets with differentiated products that remain highly valued by our customers. Thank you.\n\nTom and I would be happy to take your questions. Operator?\n\nOperator\n\n[Operator instructions] The first question is from James Breen of William Blair. Please go ahead.\n\nJames Breen -- William Blair -- Analyst\n\nThanks. Can you just talk about, obviously, the revenue guidance for the third quarter is lower than where consensus by about $10 million? Can you talk about the trade-off between margins and going after some of this delivery traffic in general because it's -- the EBITDA margins are about the same, but obviously, the growth is slowing at the top line.\n\nEd McGowan -- Chief Financial Officer\n\nYeah. Hey, Jim. This is Ed. So in terms of the guide, there's really two pieces to it.\n\nThe first one is obviously FX has gotten incrementally worse. That's probably about half of the delta. The rest of it is the slower traffic that we talked about. I think your question was specific to the trade-off that we're making.\n\nThe first immediate impact that you get on that trade-off from taking less of that peak traffic as you save on capex. So that will make its way through the P&L through lower depreciation and obviously immediately through cash flow. And so the decision that we've made is obviously, as we talked about in May, as traffic levels have come down, the discounts that we offer upon renewal are lower. And in some cases, we've seen a small handful of customers that have the traffic.\n\nTheir peaks are still growing at pretty significant rates, but their day-to-day traffic is not. So there's a formula that we go through in a trade-off that we made that I think makes a lot of sense for us, especially as I look at the types of returns we can get from the faster-growing areas like security and compute.\n\nJames Breen -- William Blair -- Analyst\n\nSo the shift, in general, just to a more -- a little bit more of an asset-light business and focusing on some of these other areas?\n\nEd McGowan -- Chief Financial Officer\n\nYeah. I mean, I would say, obviously, compute can be, I wouldn't call it an asset-heavy business, but it does have a fair bit of capex. We talked about our capex for Linode being about 2% of revenue in total. And obviously, it's going to be a little bit front-end loaded.\n\nWe actually took the advantage to try to spend a little bit more for Linode. Based on some of the conversations we're having, we're starting to see some good demand. And obviously, Tom talked about signing a pretty significant customer in the quarter. So what we're doing though, on the Akamai, of course, I call it the legacy Akamai delivery business is we are being a bit more selective in reducing capex.\n\nI made a comment that our network capex excluding Linode was 3%. That's typically around, call it, 8% to 10%, at least where it's been running over the last couple of years. So I think it's just a question of being more selective with certain types of traffic. It's really a handful of customers that have that type of traffic pattern.\n\nIt's generally event driven. And what we're seeing is it's just a better return to shift some of that investment in other places.\n\nJames Breen -- William Blair -- Analyst\n\nGreat. And then just maybe just one for Tom. On Linode, can you just talk about some of the success you're having sort of selling that product into your existing customer base?\n\nTom Leighton -- Chief Executive Officer\n\nYeah. Obviously, very early days. We've got a lot of work ahead of us with Linode, as we've talked about. But it's great to land our first very large customer, putting a critical app.\n\nActually, it's for transcoding, user content onto the Linode platform. As I mentioned, that's just that app alone as it scales is worth several million dollars a year of revenue for us. And tip of the iceberg, this is a customer that spends many hundreds of millions of dollars a year on cloud computing. And that's just one customer.\n\nSo a lot of good opportunity ahead, and we're making good progress on our road map for Linode.\n\nJames Breen -- William Blair -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThe next question is from James Fish of Piper Sandler. Please go ahead.\n\nJames Fish -- Piper Sandler -- Analyst\n\nHey, guys. Thanks for the questions. We've seen some security vendors report here and security is going through kind of actually still a strong environment despite the macro. And when I look at your normalized rate of about 17%, it's a bit lighter than what we saw in Q1 in the last couple of years really.\n\nWhat's going on, especially on the core WAF and DDoS and in Bot management in terms of the sizing and growth against some of the newer solutions like EAA and PIM here? And is there a way to think about if you guys are seeing any higher net churn overall or how to balance net new business versus the expansion that you're seeing with your existing customers and security?\n\nTom Leighton -- Chief Executive Officer\n\nI'll start with that, and then maybe Ed will add some comments. Security is very strong. We have the market-leading WAF by far. In fact, you look at their most recent Magic Quadrants and analyst ratings, and we've widened the gap with competition.\n\nBot Manager also the market leader by far. Now we have Account Protector built on top, growing very well. EAA is small today, good opportunity for growth, particularly coming on the following Guardicore. Guardicore, very exciting.\n\nYou think about the enterprise security landscape, and our segmentation, I think, has been something that historically was overlooked mainly because it wasn't done very well. But I think as you look to the future, it's probably the most important thing an enterprise can do. You could buy everybody's security products today, a company could buy everything. And now we're still going to find a way in somewhere.\n\nAnd the real key is to identify when the malware has gotten inside, where it is and block it from spreading. And that's why Guardicore is the best defense against malware and ransomware, and they have the best solution as rated by analysts, and we see really good traction there, but still on relatively small numbers. Page Integrity Manager, a relatively new product but a very bright future. Again, it's new, so it's still small today, but that's going to allow companies to satisfy the new PCI requirement, something that's hard for a company to do on their own.\n\nThe new requirements say that a company has to have safeguards against malware that gets into the digital supply chain and winds up on their users' browser. And that's just very hard for any enterprise to do. But when Akamai is delivering that content, we can place our scripts on the page to make sure that the user experience is safe and to make sure that if the user has ingested malware somewhere in the supply chain that we can identify and block it so the user is not compromised. So I think when you look at our security product portfolio really doing very well, and we're in early days with some of the most exciting products that have a lot of future runway.\n\nJames Fish -- Piper Sandler -- Analyst\n\nGot it. And maybe for Ed, on the delivery side, Ed, you alluded to a handful of customers that you guys essentially don't really want to deal with going forward just in terms of the type of traffic that you're delivering for them versus obviously the peaks versus the average. Taking a step back, what are you seeing in terms of this new pricing strategy versus kind of the churn, as well as how to think about this removal of customers on the second-half guide, and if it really impacts the security business going forward?\n\nEd McGowan -- Chief Financial Officer\n\nYeah. Great question, Jim. So let me just clarify that we're not doing business with these customers, just kind of taking a step back, like I say, it's a handful of customers. And typically, what you look at is these are multi-CDN customers that use many different vendors and tend to have big peaks for events.\n\nAnd the way you look at those customers is, there's a certain amount of day-to-day traffic you get, a certain price point that you're willing to sell at and there's a certain peak to average ratio that you're looking at. So as we go and renew some of these customers, we're being a lot more disciplined in terms of the -- taking a different approach as far as the level of discount that we're willing to provide. So therefore, the customer has to make a decision about still using us, but how are they going to handle those peaks? then going to straighten them out over a longer period of time, try to find additional peak in the market, etc. So they're still very big customers of ours, but we are pushing back a bit in terms of how much peak we're willing to take on the network.\n\nAnd as a result, we may lose a little bit of that day-to-day traffic, but we're still a significant vendor. As far as the impact on security and other products, we have not seen any impact on that. We're not losing these customers. They're not leaving the platform.\n\nIt's just -- we are holding the line a bit more on price, and we may lose a little bit of the delivery as a result. But we're also losing a lot of that big peak and that ratio is getting more in line with what makes more economic sense.\n\nJames Fish -- Piper Sandler -- Analyst\n\nThat's very helpful, guys. Thanks.\n\nOperator\n\nThe next question is from Rishi Jaluria of RBC. Please go ahead.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nOh, wonderful. Thanks so much for taking my questions. Maybe first, I want to touch on security. So you've obviously been talking a lot about the delivery business.\n\nBut we've seen a pretty decent decel in security this quarter relative to last quarter, even looking on a constant currency basis. And look, on a constant currency basis, you saw only less than $6 million added sequentially from Q1 to Q2. And what should be a pretty strong security spending environment, at least based on what others in the space are saying. Can you maybe just help us understand what's going on in the security business and just how we should be thinking about that going forward? And then I have a follow-up.\n\nEd McGowan -- Chief Financial Officer\n\nYeah, Rishi, sure. So I'll take that. Keep in mind, if you remember last quarter, we talked about Guardicore revenue having about $7 million of one-time license revenue, which was a pull forward of about 1% or so of growth into that quarter. So that impacted it as well.\n\nWe are -- one other thing to keep in mind, too, if you recall, with our [inaudible] business during 2020 and 2021, we had a pretty strong uptick from the educational vertical. And there, that was when kids were working from -- sorry, working from home, doing school from home. And there was some government funding that was enabling folks to be able to work or go to school remotely and that funding has gone away. So we've seen a little bit of a decline there.\n\nI think it's a combination of those two factors that led to a little bit lighter of a sort of a sequential growth quarter over quarter. But some of the other things that we're seeing underlying our business, we're seeing very strong demand in Bot Manager. Account Protector is a newer version of that product or an add-on. That's going pretty well, but it's still pretty early days.\n\nIt takes a while for that to -- good to add to growth. But those are some factors that you need to consider as you think about the slowdown in the growth there.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nGot it. That's really helpful. And then just maybe I want to be explicit about macro in the guidance. When we think about your guidance, you talked about all the moving pieces between customers and turning [inaudible] piece of the business and all that kind of stuff.\n\nBut I want to be explicit, what are you assuming in terms of the macro environment? Are you assuming it kind of stays as it is today? Or are you seeing some sort of macro degradation? And maybe to really round that out, right? If I think about your last true recession that you are around for, right, '08,'09, even though traffic continued to grow at a nice rate during those years. Pricing compression led to a pretty big decel, I know this is obviously a very different business than it was 15 years ago. But maybe I just want to understand your macro assumptions and maybe tied into the macro assumptions, what you're assuming for the pricing environment. Again, consistent with what you're seeing, worse, better? Any color there would be helpful.\n\nEd McGowan -- Chief Financial Officer\n\nSure. Yeah. So let's see, I'll start with pricing. So one of the things -- the biggest area where you see pricing impact the business is on delivery.\n\nWe don't see the typical price declines that you would expect to see in the security business. The business just doesn't work that way. And I don't anticipate that being a significant problem for us. Obviously, we're anticipating that traffic is not going to recover to growth rates like we've seen in the past.\n\nWe said that in our prepared remarks. So kind of a muted -- more muted Q4 than we typically see. Q4 tends to be a strong quarter for us. We anticipate that the macroeconomic environment is not going to get any better.\n\nOne of the areas that I'm keeping a close eye on is Europe. We're seeing a lot of challenges in Europe, seeing energy prices, for example, are really, really high over in Europe. We're coming into the winter session. So you could see potentially less graphic related to people cutting subscriptions or doing things like that, less shopping online.\n\nSo that's one of the things that I'm concerned about. And then also the recession and the impact that it could have on our customers potentially delaying buying decisions and things like that. But obviously, we're producing a tremendous amount of cash. The business is in great shape.\n\nIt's much more well diversified than in the past. So I think we'll weather the storm pretty well. But I do think, as Tom and I both mentioned in our prepared remarks that it is going to dampen our revenue growth a bit here and also our margins for a short period of time.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAll right. Got it. Thank you so much. Appreciate it.\n\nOperator\n\nThe next question is from Keith Weiss of Morgan Stanley. Please go ahead.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nThanks. This is Josh Baer on for Keith. Appreciate the question. I wanted to ask about Linode.\n\nAre these enterprises that are testing out the platform? Are they considering Linode as primary cloud vendor? And I guess assuming it's a multi-cloud strategy approach, what are some use cases that enterprises are testing with Linode? What types of workloads or products do you expect to be popular with enterprises?\n\nTom Leighton -- Chief Executive Officer\n\nWell, really, any kind of cloud compute application is suitable for Linode. Obviously, we support containers as a service, VM as a service. So anything you do in the cloud you could do on the Linode. I think the use cases initially and how the customers are viewing it as trying it out with some new applications, and in the one case of the media company we talked about, it's a critical application.\n\nThey're running their new transcoding app for user-generated content on us. It's about as critical as it gets. And as I mentioned, that may become worth millions of dollars as it scales up, but this is a company that's spending many hundreds of millions of dollars in the cloud. So it's not a situation where we think you're just going to switch all that on to Akamai right away.\n\nBut it is a business that I think we can really grow and that we're in an excellent position to tap into a very large cloud computing market. That market is a couple of hundred billion dollars growing at a very rapid clip. And Akamai is a trusted partner for many major enterprises that are looking for some diversification, that want a reliable partner, has great performance which we do with our distributor platform, knows how to handle scale and at an affordable price point, which we're in an excellent position to provide. So I'm really optimistic about the future of our compute business.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. And it sounds like a lot of the focus is on the hyperscalers and the enterprise opportunity. Just also wanted to ask if you're seeing any changes in the competitive landscape around some of the other alternative cloud providers serving SMB just in regard to any pricing changes or any other moving pieces in the market.\n\nTom Leighton -- Chief Executive Officer\n\nWell, as you know, one of our competitors there raised pricing. And I would say, so far, there's not a big change in the competitive landscape in the SMB market. We do intend to offer other services, such as security to that customer base. But I think the real focus for us is bringing -- upscaling Linode to make it really enterprise -- major enterprise grade and scaling it out and making it be much more distributed, which will obviously improve performance.\n\nAnd going after the large enterprises, many of our customers spend 10 or more times as much with the major clouds than they do with us for delivery and security. And so that's a great opportunity for Akamai to be able to now provide them with compute as well, so that they can build their apps on Akamai, run them obviously deliver and secure them on Akamai. Really an incredible opportunity.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe next question is from Frank Louthan of Raymond James. Please go ahead.\n\nFrank Louthan -- Raymond James -- Analyst\n\nGreat. Thank you. Can you just be a little bit more clear? Some of the -- you mentioned the media companies and the issues with some of the traffic slowing down. Do you think this is more of a near-term issue or seasonal? And then how long do you think before some of that traffic begins to come back a bit?\n\nTom Leighton -- Chief Executive Officer\n\nYeah. As we mentioned, there's a variety of factors that are impacting the media companies and hence traffic. You've sort of got a year -- I mean, we still got COVID, but this is more like a non-COVID year lapping a COVID year. And so people are out and about more, and so there's less traffic growth due to that.\n\nYou've got impacts of what, in some places is a recession. And you've seen some of the media companies report that they've got their own challenges with usage. And so that tends to reduce traffic. Obviously, we've got foreign exchange headwinds, which impacts the revenue we get from media companies overseas.\n\nAnd so all of that is impacting traffic in the media business for Akamai. I don't see those as being permanent. And we do expect over the long term that the traffic returns to more normal growth rates and that the revenue for the delivery business stabilizes. May take a little while, several quarters at this point, but I don't think it's a long-term phenomenon.\n\nFrank Louthan -- Raymond James -- Analyst\n\nOK, great. And can you quantify how much capex you might be saving annually from sort of the pushing out some of the higher volume folks?\n\nEd McGowan -- Chief Financial Officer\n\nYeah. So probably the best way to think about that, if you remember, coming into the year, we were sort of guiding that 15% to 16% range. We said, Linode will be a couple of points. We're now down to 12% to 13%.\n\nSo that's somewhere in the 3% to 4% range is probably a good number to be working with. I also gave the data point out that our network-only sort of legacy Akamai delivery business or Akamai network capex is around 3% where typically it had run around 8%. Now we'll, obviously, you still have to invest in the network, and we expect traffic to grow, etc. But I think we can remain in a lower than sort of long-term trend model here for a while.\n\nObviously, if we see significant increase in traffic, we'll obviously have better delivery results and deal with it at the time. But kind of looking out over the next several quarters and into next year, I'd expect to see the capex levels at sort of levels you're seeing here.\n\nFrank Louthan -- Raymond James -- Analyst\n\nAll right. Great. Thank you very much.\n\nOperator\n\nThe next question is from Fatima Boolani of Citi. Please go ahead.\n\nFatima Boolani -- Citi -- Analyst\n\nThank you for taking my question. Ed, this was for you, just with respect to a lot of the detailed commentary on your expectation of the delivery franchise for the second half. So a number of moving pieces here. But what I want to focus on is maybe doubling back to some of your comments from the last earnings call with respect to the observations around gaming, traffic slowing down.\n\nSo I am inferring up the bulk of the pain that you're talking about from a delivery standpoint is purely coming from the OTT side, but I'd love to kind of get a confirmation and maybe get more of an in-depth under the hooded view of where you're seeing the most, I guess, elasticity or volatility from a traffic type standpoint? And how you're thinking about those trends in maybe a more granular fashion in the back half, especially on the back of the renewals that are now behind you?\n\nEd McGowan -- Chief Financial Officer\n\nYeah, good question. So let me just try to answer it this way. Obviously, our largest source of traffic is video traffic. And we are seeing video traffic, the growth rate of that is slower than we had expected.\n\nStill growing but slower than we expected. Probably the more noticeable areas would be gaming, software and then advertising-related, so some of the portal, news portals, etc., that sort of stuff that are impacted by advertising that's the area. But if you have a slowdown in video, it's such a significant portion of traffic that can tend to be the biggest driver. Now will that recover? What we typically see in Q4 is we do see somewhat of a device cycle where you see new devices coming online, oftentimes you see new content that comes on in Q4.\n\nThere's back-to-school. There is the start of the fall sports season that we typically see a big increase in traffic. What we're looking at this year is we're being more cautious. We're still expecting it to increase like we see in Q4, but just not at the levels that we've seen in the past just based on the trends that we're seeing in the market today, what we're hearing from other companies, what we're getting from our customers.\n\nBut that's probably the best way to think about it.\n\nFatima Boolani -- Citi -- Analyst\n\nI appreciate that. And just really quickly, on the macro commentary that you shared especially with some of the key observations in Europe. I'm curious about any concerns or observations with respect to sales cycle elongation, deal decision -- delays in deal decision and deal making from a procurement standpoint, anything tangible that you can share with us just with respect to those dynamics, just as the broader economy sort of softened.\n\nEd McGowan -- Chief Financial Officer\n\nIt's a good question. I'd say it's still kind of early days, but that's certainly something that we're looking at. Security tends to be one of the places that you wouldn't delay a purchase, especially if you're under an attack. If you're not under attack, sometimes you might elongate that a little bit.\n\nBut we haven't seen anything yet that's worth calling out in terms of elongating the sales cycles. I think I'm more concerned with what happens going into the winter, and there's talk of cutting back use of natural gas and the impact on GDP, that obviously would have an impact on not just Akamai, but on many, many companies. So that's something you look out for. And then also just as you get into a situation like that, keeping a close eye on receivables and making sure that you not -- your customers are in good financial health.\n\nSo far, no issues there, but that's again something that we'd be looking out for.\n\nFatima Boolani -- Citi -- Analyst\n\nThank you so much.\n\nOperator\n\nThe next question is from Tim Horan of Oppenheimer. Please go ahead.\n\nTim Horan -- Oppenheimer and Company -- Analyst\n\nThanks, guys. Questions on Linode. How much can you save enterprises do you think on their compute bill with Linode? Secondly, is this a good run rate for the compute segment or maybe any color on what the growth rates you're kind of looking for there?\n\nTom Leighton -- Chief Executive Officer\n\nYeah. The savings can be substantial. The list pricing that we offer for Linode is substantially less than when you see the hyperscalers offering, that's public information. And for major enterprises, obviously, you can have some discount to that.\n\nAnd the really good news is that we believe we can do this at substantial margins. So as we grow the business, actually, they'll improve our margins overall. And Ed, do you want to take the second part of that?\n\nEd McGowan -- Chief Financial Officer\n\nYes. So in terms of the run rate and the growth expectations, yes, I mean, I think in terms of the near-term run rate, that's probably a reasonable place to peg it. What Tom and Adam talked about in May at our Analyst Day is we're making some substantial upgrades to the capabilities that Linode has, that doesn't happen overnight. So really, we will start to see -- the big enterprise growth will be into '23 and the back half of '23 '24, etc.\n\nBut we do expect pretty substantial growth here, obviously, grew 74-plus percent in compute, but a good place to put it for now, but it will take some time to build out the capacity, as well as the added features. We're going, as Tom said, at a pretty good pace here, but that's when you really start to see the exciting growth is once all that capability is up and available.\n\nTim Horan -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Rudy Kessinger of D.A. Davidson. Please go ahead.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nGreat. Thanks for taking my questions, guys. So for the balance of the year, you're taking the revenue guide down by $55 million. You said FX headwinds for the year now at $114 million versus $100 million previously.\n\nSo ex that FX headwind, you're taking it down by $41 million. I'm curious if you could kind of bucket it out that $41 million reduction between lower traffic growth outlook or macro challenges versus maybe some of the revenue you're losing from potentially taking less traffic from some of those customers with high peaks or other areas where you're reducing the guide.\n\nEd McGowan -- Chief Financial Officer\n\nYeah. I'd say the majority of it comes from the slower traffic. That's going to be the biggest component of it. The impact for some of the traffic we're turning away isn't all that significant, but does contribute to it.\n\nI don't have an exact percentage for you, but that's not a significant part of it. And then the macroeconomic would be the remainder. So if you were to stack rank it would be slower traffic macroeconomic and then the impact from turning away some of the traffic that we talked about in terms of the peaky traffic.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nOK. And then on Linode, I guess I'm curious, like what is your total internal spend with the hyperscales currently? What percent do you think you could move to Linode over time? And what's the kind of expected cost savings you think you can get from that?\n\nTom Leighton -- Chief Executive Officer\n\nYeah. We're spending about $100 million a year annually now with the cloud companies. And over the next year or two, ultimately, we would migrate pretty much -- most all of that on to Linode. And substantial savings.\n\nSo that's why it's one of our several initiatives we're taking to improve margins. Also, it's great to be using our own services, and it will help us as we do the work with Linode to make it enterprise-ready, to be using it across the spectrum of applications at Akamai. We're very much like our customers and looking for ways to save on cost and get great performance out of our cloud compute platform.\n\nOperator\n\nThe next question is from Jeff Van Rhee of Craig-Hallum. Please go ahead.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Just a couple for me. I think on the security side, I just want to clarify, I know you said you're comfortable at 24% revenue growth. To be clear, as reported or constant currency and then just kind of the puts and takes of being able to sustain that 20% in the outyear, given kind of the deceleration we're seeing right now?\n\nEd McGowan -- Chief Financial Officer\n\nSure. I'll take the first part, Tom, you can take the second part in terms of the future. That's in constant currency. And just remember, Jeff, that the Guardicore acquisition anniversary is in the fourth quarter.\n\nTom Leighton -- Chief Executive Officer\n\nYes. And in terms of the longer range, obviously, we're seeing very good growth in our flagship products, Web App Firewall and Bot Manager. They're the largest contribution of revenue. Really good growth, but on smaller numbers, obviously, for Zero Trust enterprise computing.\n\nIn the longer time frame, I think that's what drives a lot of the growth in security. The infrastructure category growing more slowly today, also on a moderate size number. But I think in the long term, you see the enterprise Zero Trust security group grow, led by Guardicore as the market leader in stopping ransomware.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nSo I guess as a bucket, no clear sort of things you would call out that should drive acceleration or deceleration, maybe a different way to look at it.\n\nTom Leighton -- Chief Executive Officer\n\nWell, there's the three categories we have today. The biggest is app in API security, very strong growth. I think we get continued strong growth there. A lot of innovation going on with Account Protector, Page Integrity Manager we talked about being really important for PCI compliance.\n\nWe have a new audience hijacking prevention capability that looks really cool. Infrastructure is moderate size today, and that's not growing as fast. That's your DDoS protection and your D&S defenses. And then the really high-growth area, Zero Trust enterprise security led by Guardicore, but it's the smallest of the 3.\n\nAnd so you sort of have three different comps with a little bit different dynamic in each.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nOK. And one last, if I could, on delivery. Obviously, you're making some changes around the peaking traffic. What about pricing disciplines just in traffic in general? I think you had commented last quarter you were taking a much more sort of across-the-board conservative approach to pricing.\n\nJust pricing outside that peaking, how has your approach changed this quarter and likely to change the rest of year?\n\nEd McGowan -- Chief Financial Officer\n\nYeah. So we've been instituting that now for the last several months. And as Tom talked about, we have not seen a lot of churn. We've been fairly successful in the renewals that we've had.\n\nWe are still offering discounts to customers who have traffic growth. It's just not at the same levels that we've done historically.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nYeah. OK. Fair enough. Thank you.\n\nOperator\n\nThe next question is from Will Power of Baird. Please go ahead.\n\nCharles Erlikh -- Baird -- Analyst\n\nHey, guys. Thanks for taking the question. It's Charlie Erlikh on for Will. Just one question for me on the pricing and contract renegotiations kind of building on your response.\n\nAny big contracts coming up for renewal that we should be aware of in the second half? And then for the 8 that you mentioned you had in the first half, any more color on just the tone and the overall discussions like pricing compression, you mentioned a little bit, but just the health of the customers you're talking to and just any more color on that would be great.\n\nEd McGowan -- Chief Financial Officer\n\nYeah, sure. So there's no big ones coming up in the second half. Like I said, if we ever have a big clump in the -- we'll call it out for it. I think it's just helpful to provide commentary and get you guys aware of what's happening.\n\nIn terms of the dynamics outside of pushing back a little bit on sort of the peak to average, which is part of the normal discussion that we have, I would say we're kind of came in line with what we had expected. We did try to apply our strategy of being a bit more disciplined. I don't know if that's the right word, but more attuned to what's going on with volumes and having conversations with customers about expected volume growth, etc. So pleased with where we landed.\n\nAnd obviously, renewing large customers and this -- and the delivery segment is never a fun thing. But kind of came out as expected. And then your other question was on -- just remind me again?\n\nCharles Erlikh -- Baird -- Analyst\n\nI think you actually hit all the questions, yes, just the overall tone of the conversations. But yes, I think you answered it pretty well.\n\nEd McGowan -- Chief Financial Officer\n\nYeah. So overall, I mean, the customers are still in great shape. There are some very large brands and still very healthy. We added services to most of them.\n\nSo not only are we just dealing with delivery, but we're also adding on additional capabilities as well.\n\nCharles Erlikh -- Baird -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThe next question is from Alex Henderson of Needham. Please go ahead.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nThanks. So given both Guardicore and Linode have not been in the full for over a year, I was wondering if you could look at them from the perspective of apples-to-apples, if they had been in the fold for the entire year, what their internal growth rates look like so that we have some gauge of the rate of growth at those two acquisitions.\n\nEd McGowan -- Chief Financial Officer\n\nYeah. It's a good question, Alex. I'll take this one, Tom. So Linode, so Linode will end up being in for most of the year.\n\nBut just prior to acquisition, we had said in our commentary, they're growing around 15%. Obviously, we'll accelerate that as we start to add enterprise customers. So I'd expect that to increase. With Guardicore, if you remember our first call, we're taking our guidance up quite a bit, but if you look at where our kind of internal -- where our run rate is now, we're looking at over $60 million.\n\nThat would be almost a doubling of where they were when we acquired them even slightly higher than that. So Guardicore growing extremely fast, I would say, sort of if it was a stand-alone on its own would be more than a double. And Linode, we just picked it up and its starting to add that functionality and expect to accelerate that growth rate, but they were about 15% prior to acquisition.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nThere was a comment earlier in the call that adjusting for acquisitions, the underlying growth rate was 17%. Would you confirm that that's an accurate calculus?\n\nEd McGowan -- Chief Financial Officer\n\nYeah. That's about the right math. 21% constant currency. Guardicore was about $14 million.\n\nSo that's roughly 4%. So that's about right.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nPerfect. And then just looking at the international markets, how are you handling the FX swings that are going on? In terms of pricing, are you offsetting and look the effective price reduction that implies in dollars, if you're in local currency and where you're not in local currency, are you pricing down to lower the burden? How are you handling the customer pressures around that?\n\nEd McGowan -- Chief Financial Officer\n\nYeah. So most of the customers outside the U.S. are paying us in local currency. So they're billed in local currency.\n\nThere are several that are not certain countries, for example, will be in U.S. dollar. So far, it has not been a big issue with our customers pushing back. We do some hedging on balance sheet, but not from an operational perspective, not cash flow hedging.\n\nAnd then in terms of pricing, we do take that into consideration as we're going through with customers that are outside the U.S. And also just in general, depending on where their traffic is, that also comes into effect. If we're delivering in countries that are more expensive, we take that into effect as well.\n\nAlex Henderson -- Needham and Company -- Analyst\n\nOK. Thanks.\n\nTom Barth -- Head, Investor Relations\n\nOK. Thank you, Alex, and thank you, everyone. So in closing, we will be presenting at a number of investor conferences and events throughout the rest of the third quarter. Details of these can be found in the Investor Relations section of akamai.com.\n\nThank you for joining us, and all of us here at Akamai wish continued good health to you and yours. Have a nice evening.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTom Barth -- Head, Investor Relations\n\nTom Leighton -- Chief Executive Officer\n\nEd McGowan -- Chief Financial Officer\n\nJames Breen -- William Blair -- Analyst\n\nJames Fish -- Piper Sandler -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nFrank Louthan -- Raymond James -- Analyst\n\nFatima Boolani -- Citi -- Analyst\n\nTim Horan -- Oppenheimer and Company -- Analyst\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nCharles Erlikh -- Baird -- Analyst\n\nAlex Henderson -- Needham and Company -- Analyst\n\nMore AKAM analysis\n\nAll earnings call transcripts"
}