{
  "companyName": "Calavo Growers",
  "companyTicker": "CVGW",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/20/calavo-growers-cvgw-q4-2022-earnings-call-transcri/",
  "content": "Calavo Growers (CVGW -0.10%)\nQ4 2022 Earnings Call\nDec 20, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon and welcome to the fourth quarter and fiscal year 2022 Calavo Growers earnings conference call and webcast. [Operator instructions] I will now turn the conference over to your host, Julie Kegley, investor relations for Calavo. You may begin.\n\nJulie Kegley -- Investor Relations\n\nGood afternoon and thank you for joining us today to discuss Calavo Growers' financial results for the fourth quarter and fiscal year 2022. This afternoon, we issued our earnings release, and it is available in the investor relations section of our website at ir.calavo.com. With me on today's call are Brian Kocher, president and chief executive officer; and Shawn Munsell, chief financial officer. We will begin with prepared remarks and then open up the call for your questions.\n\nBefore we begin, I would like to remind you that today's comments will include forward-looking statements under federal securities laws. Forward-looking statements are identified by words such as will, be, intends, believe, expect, anticipate, or other comparable words and phrases. Statements that are not historical facts such as statements about expected improvement in revenue and operating profit are also forward-looking statements. Our actual results may vary materially from those contemplated by such forward-looking statements.\n\nA discussion of the factors that could cause a material difference in our results compared to these forward-looking statements is contained in our SEC filings, including our reports on Form 10-K and 10-Q. With that, I will now turn the call over to Brian Kocher.\n\nBrian Kocher -- President and Chief Executive Officer\n\nThank you, Julie, and good afternoon, everyone. We appreciate you joining us for the call. Today, we reported fourth quarter earnings that demonstrated continued momentum as gross profit and EBITDA both improved sequentially and versus the fourth quarter of last year. Continued recovery in the prepared segment, with better performance in both the fresh cut and guacamole divisions, led our improvement by generating a segment margin of over 9%.\n\nEarnings were moderated by a slower-than-expected recovery in the grown segment as the excess Peruvian fruit that pressured market pricing at the end of Q3 remained in the market well into October. Gross profit was down sequentially for grown but higher than the prior-year quarter. Just as a reminder, grown is the new name of the segment formerly known as fresh, and prepared is the new segment which represents the combination of the old RFG and foods segments. When providing a little more detail on the prepared segment, you may also hear us refer to fresh cut as the former RFG and guacamole as the former foods segment.\n\nLooking at the full year, almost every relevant financial metric improved versus fiscal '21. Shawn will discuss in more detail, but as some highlights, earnings improved compared to '21 with gross profit up 16 million to $74 million, adjusted EBITDA up 8 million to $35 million, and adjusted EPS up $0.15 to $0.50 a share. Gross profit increased in both segments but particularly in prepared, where most of the Project Uno benefits have been concentrated. Prepared gross profit more than doubled to 23.7 million for the year as significant turnaround progress in the fresh cut division overcame lower profit from the guacamole division caused by input cost pressure.\n\nGrown gross profit increased by 2.4 million to about 50 million for the year as higher gross profit per carton resulting from our margin management efforts more than offset volume declines caused by lower supply from Mexico. In addition to the financial improvements that we achieved in fiscal '22, it was also an important foundation-setting year where we had some notable accomplishments. Among those, we reduced the size of our board of directors while increasing its diversity and independence. The board also imposed minimum stockholding requirements for directors and officers that significantly increased our key leaders' personal financial commitment to Calavo.\n\nWe completed our executive leadership team and have aligned our compensation programs to company performance so that at least 50% of our named executive officers' total compensation is performance and/or stock-based. We implemented controls, processes, and procedures to run the company more efficiently and effectively. We also refreshed the Calavo brand logo and website to support our One Calavo vision and future growth plans. In Mexico, our Jalisco avocado packing facility was officially certified for exportation to the U.S.\n\nand immediately began providing us with more optionality when buying fruit from Mexico. And most importantly, we are building a culture and a team that prioritizes continuous improvement. Although announced after the fiscal year-end, I'd also like to take a moment to talk about the long-term ESG goals we published last week. The goals are focused on four pillars: climate action, social responsibility, sustainable agriculture, and sound governance.\n\nThe overall ESG efforts embedded in these four pillars cover more than half of the United Nations' Global Goals for Sustainable Development. Some of the key highlights include reducing our carbon footprint, reducing food waste, investing in our communities, supporting sustainable agricultural practices, and transitioning to sustainable packaging. To embed these practices into our business, our governance structure, and our enterprise risk management systems, we are committed to transparent ESG reporting, and we have committed to future independent third-party audits or verifications of our ESG disclosures. We're fortunate that we operate in the industry and service product lines that are inherently sustainable and responsible, so it is very easy for me to emphasize that our commitments to ESG are identical to and will complement our commitment to shareholder return and capital allocations discipline.\n\nCalavo can and should play a role in transforming the sustainability of the food industry, and we believe these ESG goals will help us do more than our fair share. In other exciting news, I'd like to share that Calavo has entered a licensing partnership with General Mills as the exclusive U.S. manufacturer of Old El Paso brand fresh guacamole and salsas. The products launch this fall, and we're proud to be involved with the iconic No.\n\n1 Mexican brand in the U.S. About a third of all U.S. households purchase Old El Paso products on a regular basis. And these new fresh products are a great brand extension for Old El Paso, as well as a consumer differentiator that Calavo can leverage for growth.\n\nWhile 2022 had its share of challenges, I'm proud of all the work from the entire Calavo team that enabled us to deliver meaningful, improved financial results and set a solid foundation for growth in '23. We are committed to achieve our strategic and financial goals, and we're excited about the future and about expanding our leadership position in both prepared foods and avocados. And now, I'll turn the call over to Shawn Munsell to report on the financials. Shawn.\n\nShawn Munsell -- Chief Financial Officer\n\nThank you, Brian. Consistent with prior quarters, we provided year-over-year comparisons in our press release, so I will focus my discussion on a sequential basis from the third quarter. On a consolidated basis, fourth quarter revenue was 244 million, a decrease of 98 million from the third quarter of 2022. Grown segment revenue was 119 million, down 88 million from the third quarter as the average selling price of avocados decreased by 45% from historically high summer prices, while avocado volumes were about 2% lower as a result of our margin management efforts.\n\nPrepared segment revenue was 125 million, down 10 million from the third quarter, primarily due to seasonally weaker volume in the fresh cut division. Consolidated gross profit was 20.4 million, up 1.8 million from the third quarter, primarily driven by a $5 million increase in gross profits in the prepared segment, partially offset by a $3 million sequential decrease in grown. The prepared segment benefited from significantly improved results in the guacamole division, where margins rebounded from Q3 levels as fruit cost declined and we started to see the impact of yield improvements from operational changes. Although we achieved an average gross margin in the mid-teens for guacamole for the quarter, by October, margins had reached the mid-20% range.\n\nOur fresh cut division posted an average gross margin of over 8% in the fourth quarter. Grown gross profit fell sequentially as avocado volume declined about 2% and we manage the business for margin during the quarter amid still challenging supply demand conditions for most of the quarter. With the Peruvian season in full swing and new crop Mexican harvest hitting the market, avocado prices fell sharply from Q3 levels, down about 45% for the quarter. Profit per carton declined from Q3 and averaged below our targeted range for the quarter, but began to recover in October as the Peruvian supply tapered off.\n\nFor the fiscal year, gross profit totaled 73.8 million, up about 29% from 57.4 million in the prior year. The $16.4 million increase is attributed to a $14 million increase in the prepared segment and a $2.4 million increase in the grown segment. The $14 million gross profit increase in prepared for the year consisted of an increase of over 23 million in the fresh cut division, offset by a decline in gross profit in the guacamole division. The rebound in the fresh cut division reflects the benefits of the various initiatives executed through Project Uno, which total approximately 46 million for the year.\n\nThe decline in earnings in the guacamole division for the full year was largely a function of higher fruit input cost, which averaged more than 40% higher than the prior year. The $2.4 million gross profit increase in grown for the year primarily was driven by an increase in per-carton profitability for avocados that more than offset a 12% avocado volume decline and unfavorable foreign exchange impacts. For the full year, avocado volume was down about 12% as we source more volume from California, Peru, and other origins to compensate for a decline in Mexico's supply. For the year, total supply from Mexico was down an estimated 15%, while our Mexico volume was down about 17%.\n\nSG&A was 17.1 million for the quarter, up from 16.7 million in the third quarter of 2022. Higher SG&A included the impact of short-term incentive expense that was disproportionately higher in Q4 2022. Adjusted EBITDA was 9.6 million for the quarter, up from 8.1 million in the third quarter of 2022, mainly driven by the gross profit increase in prepared. Relative to prior year, fourth quarter adjusted EBITDA was up 8.2 million, primarily driven by a $10.1 million gross profit increase in prepared.\n\nFor the year, adjusted EBITDA totaled 35.1 million, up from 26.8 million in the prior year as higher gross profit in both prepared and grown was partly offset by higher SG&A costs. Now, turning to our financial position. During the quarter, we sold our Limoneira shares for gross proceeds of approximately 18.5 million. We used the proceeds to pay down debt and ended the quarter with about 7 million of total debt, which included about 1 million of borrowings under our line of credit, plus other long-term obligations and finance leases.\n\nUnrestricted cash and equivalents totaled about 2 million as of year-end, which left us with a negligible net debt level at year-end. In total, we reduced our net debt position by about 38 million for the full year. Available liquidity was approximately $30 million at year-end. We invested $2 million in capex in the fourth quarter, which brought our full year capex investment to approximately 10 million.\n\nNow, we'll briefly share some thoughts on fiscal 2023. We expect grown volume to rebound in 2023 as various industry sources estimate the Mexican avocado crop to be 10% to 20% larger in '23. Additionally, Jalisco fruit will be available for export to the United States for the entire season. With the current supply estimate, we also expect pricing on a per-unit basis to be less than 2023 than in '22.\n\nDespite expectations for increased avocado supply and lower prices, with our model as a marketer of fruit, expect daily buying of fruit and daily pricing of fruit and inventory management that will allow us to again achieve avocado gross profit within our targeted range for the year as we did in 2022. Lower avocado prices will also reduce input costs for the guacamole division in fiscal 2023, which, when combined with production efficiencies already in place and from some capital projects underway, we expect to generate guacamole division gross margins at approximately 25%. We will work to continue improving our fresh cut operations and expect to exit 2023 delivering a gross margin run rate of 10% to 12%. But keep in mind that the first quarter will be seasonally weaker.\n\nWe also plan to increase the proportion of deli business in our fresh cut division starting in mid-2023, which will support earnings and help to dampen seasonality. There may be some transitional impacts as we onboard the new business. Seasonality plays a significant role in the cadence of our earnings. Although we expect to continue improving the business in 2023, Q1 is seasonally our weakest, and we expect around 15% to 20% of our full year earnings to be generated in Q1.\n\nWe expect our Q1 prepared earnings to decline by about a third from the Q4 level. We also expect to invest approximately 18 million in capex in '23 as we pursue more profit improvement and growth projects, primarily in our prepared business. That concludes my prepared remarks, and I will turn it back over to Brian.\n\nBrian Kocher -- President and Chief Executive Officer\n\nThanks, Shawn. To build on Shawn's comments regarding the outlook for fiscal '23, in addition to increased avocado volume coming from Mexico, we expect our prepared segment volume to benefit from our growth initiatives as we onboard new products and new customers, some of whom we have already successfully closed the sales process. We expect continued improvement in our fresh cut business as we work to further refine processes and gain efficiencies through Project Uno. Please keep in mind, we do experience seasonality, as Shawn mentioned, that will soften earnings in Q1.\n\nTo date, we've achieved 46 million in annualized savings of the 70 million we set out to generate when Project Uno was announced last year, and we are on track to deliver the balance of the savings by the time we close the books on fiscal '23. Even before then, I suspect the title, Project Uno, won't be needed because it is simply our way of operating. It's not a project with an expiration date. It's a systematic, ongoing process to manage our business for success.\n\nPricing optimization will always be our focus. Labor efficiencies will always be our focus. Controlling input costs will always be our focus. Those things are not going away when we reach the $70 million mark.\n\nThey aren't ever going away. I'm really proud of our team for how they've embraced change to achieve the best results for the company. In fact, I'm counting on our organization's agility to further accelerate change. We currently are in the process of developing our long-term strategic plan that will take Calavo into the future.\n\nUp to this point, I've kept things very simple by focusing on being better today than we were yesterday and by being better tomorrow than we were today. Continuous improvement will always be an expectation at Calavo. But we need to have a fixed point on the horizon to guide us. And we will have that with a good strategic plan.\n\nI'll present the plan in more detail in the coming months. But after stabilizing operations and creating a structure that's now scalable, we are planning to shift Calavo from a company that's improving to a company that's growing. That concludes our prepared remarks. I'll now turn the call over to the operator to begin the Q&A.\n\nOperator.\n\nOperator\n\nThank you. Ladies and gentlemen, at this time, we'll be conducting a question-and-answer session. [Operator instructions] Our first question comes from the line of Ben Bienvenu with Stephens. Please proceed with your question.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nHey, good evening. Thanks for taking my questions.\n\nBrian Kocher -- President and Chief Executive Officer\n\nHey, Ben. How are you?\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nSo, I want to ask, with respect to your 2023 outlook, the cadence commentary is helpful when thinking about the prepared business in 1Q versus 4Q. I'm intrigued by your commentary, which you've provided before, but I wanted to dig into a little bit, about a run rate margin in the fresh cut fruit business of 10% to 12% exiting 2023. And I want to ask, is that an annual run rate you expect, or should we interpret that as that is what you'll -- your margin will be in the fourth quarter as you exit '23? And I ask because, you know, as you highlighted in your comments, 1Q and 4Q are generally seasonally lower margins. So, what should we be thinking about like a 2024 margin that's between 10% and 12% or is actually potentially higher than that?\n\nBrian Kocher -- President and Chief Executive Officer\n\nHey, Ben. Thanks. It's a great question. And, you know, I'd like to, if you don't mind, we'll answer that question.\n\nBut one of the things that I want to try to do is put all of this in perspective, and we'll put some perspective of '23 as well. I've been here almost a year now. And in fact, since I was announced as CEO, it has been a year. And if I think about the change that's happened over the course of the last year, there's been a lot of things that this business has been able to manage and go through and still drive improvement.\n\nI mean, think about the grown segment. We had an avocado business that saw 15% less Mexican volume in the market. Market prices that went from $35 a case to $70 a case back to $30 a case. So, extreme volatility.\n\nAnd somehow, in all of that, in that grown business, we managed to deliver gross profit per case that was, for the year anyway, over a course of time, right in the middle of our guidance of $3 to $4 a case. We managed to increase the gross profit dollars, and we managed to do that when volume was down almost 12% for the year. So, I mean, a lot of good resiliency there. I think, most importantly, and this gets to some of your question regarding '23 and the run rate, the prepared fresh cut business really has been a bright spot for us.\n\nIf you think about it, when I took this seat, I think there was a large part of our investment community that didn't even know if this was a legitimate business. Could we even make money at that? And we've gone from zero gross profit to a business, at least for the last half of this year, average right around 8% gross margin percent for the last half of the year. So, as we think about heading into 2023 and then exiting '23, think about that number of 10% to 12% as an annualized number. There'll still be a little bit of seasonality and employ less than that.\n\nAnd I'm sure in the first quarter, probably less than that in the fourth quarter. But annually -- very similar to how we guide annually to the gross margin per case in the avocado business. Annually, we ought to think about that fresh cut business as 10% to 12% exit rate headed into 2024.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. Very helpful. Yeah. The 9.4% margin in the fourth quarter, I mean, that's the highest prepared.\n\nYou know, if you look back historically, one of the highest margins you guys have had in the combined businesses in a long time. It looks to me like since 2018 and what I would imagine a seasonally lower-margin quarter. And then you mentioned the high avocado costs, which have come down, but the exit rate is stronger out of 4Q. So, definitely see the progress occurring.\n\nBrian Kocher -- President and Chief Executive Officer\n\nYeah, Ben, think about that when we talk about inflation that we probably haven't seen in 30 years. I don't know. Think about it as we've swapped out an entire management team, changed compensation plans to incentive performance-based compensation plans, restructured our balance sheet, and really reduced net debt to almost zero. I mean, there's a lot of good things that happened this year, and certainly, that run rate and the results so far in our prepared segment have been -- the prepared fresh cut division has been really good.\n\nWe still have a ways to go, and we're not happy. And that last bit will be harder than the first chunk of margin enhancement. But we're proud of what we've done in fresh cut.\n\nShawn Munsell -- Chief Financial Officer\n\nYeah. And, Ben, this is Shawn. Just to add on, you know, if you look at the performance for prepared in the quarter, I mean, it wasn't just the fresh cut business, it was also the guacamole business. But it wasn't just the price relief in the guacamole business from the input cost.\n\nYou know, we saw a meaningful improvement in our operations from some of the operational initiatives that were undertaken in the summer. We saw that really start to take hold, you know, call it, in September and October. So, you know, we should see the full benefit of that in, you know, in the current quarter and beyond. But it wasn't just fresh cut.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. OK, great. Yeah, it definitely stands out as a positive in the quarter and for the year. I want to shift gears a little bit.\n\nIn the quarter, what stands out as a little bit of a negative, the volume on the grown side, which is a little bit on the side of, call it, kind of what we saw in the industry where volumes grew substantially. So, could you talk about nuance that might be involved in your volume declines in the quarter versus the market that looked like it grew and help us understand what happens there because next year, you're highlighting that business growing in line with the market?\n\nBrian Kocher -- President and Chief Executive Officer\n\nYeah, Ben, I think the one little wrinkle that I would say that we really tried to manage in the fourth quarter was, if you remember, at the end of the third quarter, we mentioned that there was quite a bit of fruit in the market, that prices had decreased dramatically. In fact, I think, in July, we even said prices decreased $20 a case in four weeks. We saw some of that still lingering probably longer than we expected in our fourth quarter. There was Peruvian fruit that was available in the marketplace well until October.\n\nSome of the Mexican fruit started arriving. So, at least, short term, we really switched to a philosophy of margin management as opposed to necessarily volume management. You know, every -- in a commodity trading environment, there are some volume that I would call transitory. You can give up, and when you want, you can get it back with the right pricing methodologies.\n\nAnd so, there's a little bit of our volume decrease that went down in the quarter when the industry went up because we wanted it to. We were managing for a better gross profit per case as opposed to just pushing volume through. And, you know, again, through the course of a year, that will adjust and that will change. There'll be times when the dynamics are right on the supply side and the pricing side that will push as much volume as we can.\n\nThis one was a quarter that it just made more financial sense for us to be disciplined in managing margin versus market share.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nYup. OK. Makes sense and totally get it. If I could ask, well, I know you're going to provide us the detail in a few months, could you talk a little bit about kind of what you think is in the architecture of your long-term plan that serves as kind of guide rails for you guys as you think about the long-term goals of the business, even if you can't give us the, you know, the components of it today?\n\nBrian Kocher -- President and Chief Executive Officer\n\nYeah, I -- you're right. We won't give you the guts today. But if you think of this business, think of the foundation -- foundational change we did in Calavo. We now have a prepared segment that is delivering best-in-class customer service and fill rate numbers.\n\nWe have an infrastructure in our grown business that is running effectively, efficiently, and servicing the customers well. And both of which have capacity. We operate in categories that are growing on a unit volume and a consumption basis. May not be as growing as fast as it was 10 years ago but growing, both avocado, as well as the convenient ready-to-eat fresh cut and guacamole segment.\n\nSo, growing. So, in general, I think you're going to see a strategy that comes out that's based on growth across all of our segments: grown, prepared. And then even in prepared, in both fresh cut, as well as guacamole. And then you will see a segment that's -- or at least a guardrail based upon return on invested capital because we think there's really smart investments that we can make.\n\nAnd then there are some investments that might get us growth but none of us would be happy about. And I'm not interested in those. We're -- you know, Shawn and I are really disciplined. We want to make sure that when we make an investment, it's got a really good chance to be accretive to our overall return on invested capital.\n\nBut think of Calavo as switching from stabilization and level setting to growth now and growth across all segments. And I will tell you a couple of areas. We've already made investments in international sales group. We are under-indexed in international sales.\n\nAnd I think that's an opportunity that we probably haven't devoted much time and attention to at Calavo over the last three or four years. But the market is right. The supply environment is right. Our operational structure is now right.\n\nAnd so, you're going to see a lot of emphasis on international growth. And then you're going to see a lot of emphasis on growth within our existing categories, too, and capturing more than our fair share of the category growth. So, hopefully, that helps a little bit.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nI look forward to learning more. Thanks and best of luck.\n\nBrian Kocher -- President and Chief Executive Officer\n\nThank you, Ben.\n\nOperator\n\nOur next question comes from the line of Eric Larson with Seaport Research Partners. Please proceed with your question.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nYeah. Thanks, guys. So, just a quick follow-up on one of Ben's questions. So, we had a pretty sticky, you know, excess Peruvian supply coming in.\n\nAnd I also know that that's typically lower-quality fruit. But obviously, it'll affect the pricing in the market. Is this something that -- is this now going to be an annual issue, something we'll have to deal with? Are they adding capacity in Peru? And, you know, how is -- you know, is this going to be somewhat of a structural change in the market?\n\nBrian Kocher -- President and Chief Executive Officer\n\nEric, that is -- first of all, thanks for calling in, and good to hear from you. It is a great question, and it's one that we started preparing for six months ago. And the reason I say that is we've been expanding our sourcing regions for the last several months. I think we've had a little bit of Peruvian volume, but I wouldn't say we -- we're as efficient or as in-depth in Peru as maybe some of the other marketers.\n\nSo, we've grown our Peruvian volume this year. We'll grow our Peruvian volume next year, not only -- increase. When I say grow, I mean increase. Not only will we have our current supplier, but we've got three others that are lined up for Peru.\n\nWe -- in fact, we were 33% higher out of Peru this year than we were the year before. And I suspect that'll at least be half as high again next year. Colombia, we went from a couple of test loads last year to a significant volume, and we want to expand Colombia again as well. Jalisco opening up gives us at least another option in Mexico and a chance to take optionality in our favor when the conditions are right.\n\nSo, Eric, I think there -- yes, Peruvian overall volume is growing. Remember, it's about the size or now a little bigger than California. So, we are preparing as if that's a regular part of our business and our market. We're preparing our supply chain to address and adapt to that.\n\nI will tell you one thing that's interesting, though, when you think about growing supply. We believe the Mexican crop will be higher. When you're growing in supply, I really like the model of buying and selling every day. I really like the fact that we can control our inventory every day.\n\nIf we don't like the price, if we believe we're good on inventory, if we're a little long, we don't have to buy. We don't have to keep bringing fruit to the -- to what could be a rough market. And that's why we continue to believe that we can deliver $3 to $4 a case in gross profit, is that we've got this model as a marketer and it allows us to bob and weave and ebb and flow like a commodity trader should. And diversifying our supply is just one more path to allow us to do that.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nOK. Thanks for that. So, I have just two more questions. The second one here is -- and we haven't heard any discussion on this in some time, but I would think that if you're pulling -- putting together some longer-term plans, your previous management for a whole number of years, they basically looked at the -- you know, at the U.S.\n\nmarket as being a 4 billion -- they said the U.S. market could absorb and eat all of a -- bought a 4 billion pound avocado market. I think, right now, I don't know, with this year ended, you know, help me with this number, it might be in that 2.3 billion to 2.4 billion pound range, but maybe it's a little higher., maybe it's a little lower. If you've got an answer, that would be helpful.\n\nBut do you still believe this market has the potential of growing to let's say that, you know, in the proximity of 4 billion pounds?\n\nBrian Kocher -- President and Chief Executive Officer\n\nHold on, Eric. We're doing some quick math. But here's what I'll tell you about overall growth. I think that the U.S.\n\nmarket has the opportunity for continued growth, both in terms of consumption but also in terms of consumption per capita in geographic regions. If you think about it, consumption per capita on the East Coast is about one-third of what it is on the West Coast. And so, there are consumption opportunities. There are overall growth opportunities.\n\nWe see growth in food service with either avocado or avocado-comprised products. So, I do think that the market can grow. If I -- you know, when we do our quick math, we see that -- we say the market is somewhere around 3 billion in pounds. You know, can it grow more from there? Absolutely, it can grow.\n\nThat being said, the world is a big place. And there are pockets and places in the world that are growing faster than the U.S. market, both in terms of penetration, as well as consumption per capita. And we're investing in infrastructure both on the supply side and the sales side to take advantage of some of those opportunities for growth.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nOK. You know, fantastic. So, the other question that I have and, you know, I've been kind of asking for quite a few years why you folks haven't tried to get a better presence in guacamole. And now, with your announcement with General Mills, that sounds like you're on a path to maybe, you know, being a better -- a bigger competitor in that prepared market at retail.\n\nSo, what is the -- does -- is General Mills going to be doing the marketing? What are some of the things you can share with us regarding how you approach the business with General Mills?\n\nBrian Kocher -- President and Chief Executive Officer\n\nWell, great -- another good question. Thanks, Eric. One, we probably have been under-indexed as Calavo and retail and guacamole and missed a lot of growth the last several years. There's no use trying to sugarcoat that.\n\nA couple of things. We recognize that there's an opportunity still, that guac is a growing business, and that we recognize the value of our guacamole business. It is not just a byproduct of the avocados that we buy and sell on the bulk market. So, that's, I think, one thing.\n\nThis relationship with General Mills is new. We just started marketing the product. But I love the fact that this is a brand that's already frequent in a third of the U.S. households and is synonymous with Mexican or Latin food.\n\nAnd so, here, we get to take advantage on the guacamole and salsa side of a trusted Latino brand in the U.S. and where someone else has done the investment dollars to create that brand recognition. It's a great line extension for General Mills. It's a great consumer differentiator for us, and we're excited to keep it going.\n\nIt's early. It's early, Eric. I don't want to sound too bullish here. It's early.\n\nWe're in the sales process. We've launched a few products already, and we'll continue driving that process forward.\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nOur next question comes from the line of Ben Klieve with Lake Street Capital Markets. Please proceed with your question.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nAll right. Thanks for taking my questions. Got a couple here. First, piggybacking off of Eric, who piggybacked off of Ben initially on the kind of volume side, the intentional volume that was off on the table here kind of throughout the year, not necessarily just in Q4, but really throughout the year, can you kind of characterize the degree to which that volume is perpetually off the table or you think of pricing dynamics, you know, change, that volume will come back into play in '23 and beyond?\n\nBrian Kocher -- President and Chief Executive Officer\n\nWell, let's -- let me break this down for you, Ben, to make sure that we answer it fulsomely. Through the first nine months of the year, our sales volume was down about the amount that overall imports were down for the year. So, in general, that first nine months, I would say our market share stayed relatively flat to what it's been historically. Unfortunately, it's been relatively flat for the last three years.\n\nIt was really this last period. And we're -- look, we try to be smart about this, and we try to be strategic about this. We're not going to lose and not going to manage the margins so tightly that we lose one of our core customers or lose one of the opportunities with our core customers. But I think if you look at our portfolio, we have a range of customers that buy in all sizes and all quality levels.\n\nThere are some of those that are more transactional than strategic. And the ones that are transactional, they'll be there again because they're transactional. And so, our -- I think, this quarter, we did the right thing to maximize the margin and forgo some volume. We're also confident that if the conditions are different and we have an opportunity to go get that margin or get that volume at a reasonable investment, that it's there for the getting again because it's transactional in nature.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nGot it. OK. Very good. Thank you.\n\nNext question, you talked about the capex expectations next year. Can you characterize the intention there by, you know, growth versus maintenance and maybe high-level initiatives you can talk about at this point?\n\nShawn Munsell -- Chief Financial Officer\n\nYeah. So, yeah. Capex expectations next year, about 18 million, you know, versus about 10 million this year. And so, you know, think of that and probably, you know, call it, $1 million to $2 million that is just, you know, a matter of timing.\n\nSo, spend that we expected to make in 2022 that slipped into 2023. But the remaining increment, you know, call it, between 12 million and 18 million, you know, that represent incremental profit improvement projects in '23 versus '22. Most of that is going to be concentrated in the prepared business. On an ongoing basis, you can think of our, you know, sustaining and maintenance investment in the neighborhood of $5 million.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nOK. Very good. Thank you. And the last question I had for you, the Old El Paso relationship, I just want to -- I want to make sure I got this right.\n\nSo, the non -- the exclusive relationship that was just announced, Brian, I believe you said that is an entirely new relationship, correct? So, this is not something that was nonexclusive historically that is now exclusive. Is that correct?\n\nBrian Kocher -- President and Chief Executive Officer\n\nHey, Ben, I'm sorry. You cut up a little bit at the first part of that question. Could you repeat that?\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nYeah, the Old El Paso relations.\n\nBrian Kocher -- President and Chief Executive Officer\n\nOK.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nI just want to make sure, would that -- you said this is an entirely new relationship as of this announcement. Is that correct, or was this nonexclusive before and now is exclusive?\n\nBrian Kocher -- President and Chief Executive Officer\n\nNo, new relationship that we basically started marketing during the quarter.\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nOK, very good. I thought I heard that right but just wanted to make sure. OK, Very good. That does it for me.\n\nThanks for taking my questions. I will get back in line.\n\nBrian Kocher -- President and Chief Executive Officer\n\nThanks, Ben.\n\nOperator\n\nThere are no further questions in the queue. I'd like to hand the call back to management for closing remarks.\n\nBrian Kocher -- President and Chief Executive Officer\n\nHey, Doug, thank you very much. Again, thanks for all of the support and the time that you spent listening today. We really appreciate that. We gave you some guidance and thoughts on 2023.\n\nAnd we tried to do that to help you shape your understanding of our EBITDA profile, as well as some of the things that we'll be focused on over the course of the year. If we're having this call a year from now, I would like to think we will have accomplished a couple of things. We will have formally communicated a strategic plan that provides our organization, our customers, and our investors a North Star, so to speak, for this company and where we're headed. We will have managed our avocado business and avocado business that we believe will grow commensurate with and maybe more than the market itself and manage that business in a way that we believe we can deliver gross margin per carton in the $3 to $4 a case range.\n\nWe will have a prepared fresh cut business that grows distribution with its existing customers and new customers and exits the year on a 10% to 12% gross profit margin run rate. And remember, we said earlier in the call, think of that 10% to 12% as an annualized gross profit run rate. It might be a little lower, a little higher in certain quarters, but annualized in there. And we'll have a prepared guacamole business that's growing market share both in the U.S.\n\nand internationally and delivers gross profit margins approximately 25% or so in that range. And we'll do all of that while having a return on invested capital that's appropriate for our business and appropriate for our customers and based on very disciplined capital allocation and capital management processes. If we can discuss all of that on next year's call, I think all of us will be really pleased. I am happy with the amount of change we've been able to drive, the foundation we've been able to build in '22, and still drive meaningful improvement in our profit metrics.\n\nBut I'm not satisfied in '22. If we can do what I just outlined for '23, I think we're going to be really happy at the end of '23. And I can guarantee you one thing, I still will not be satisfied with where we're headed. Thank you for listening.\n\nThanks for your time. We wish all of you a happy holiday, a healthy holiday season, and look forward to speaking you at the next opportunity. Thanks all.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJulie Kegley -- Investor Relations\n\nBrian Kocher -- President and Chief Executive Officer\n\nShawn Munsell -- Chief Financial Officer\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nEric Larson -- Seaport Research Partners -- Analyst\n\nBen Klieve -- Lake Street Capital Markets -- Analyst\n\nMore CVGW analysis\n\nAll earnings call transcripts"
}