{
  "companyName": "Coty (Class A)",
  "companyTicker": "COTY",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/coty-class-a-coty-q4-2022-earnings-call-transcript/",
  "content": "Coty (Class A) (COTY -0.93%)\nQ4 2022 Earnings Call\nAug 25, 2022, 8:15 a.m. ET\n\nOperator\n\nGood day. My name is Chelsea, and I'll be your conference operator. At this time, I would like to welcome everyone to Coty's fourth quarter and fiscal 2022 question-and-answer conference call. As a reminder, this conference call is being recorded today, August 25th, 2022.\n\nPlease note that earlier this morning, Coty issued a press release and prepared remarks webcast, which can be found on its Investor Relations website. On today's call are Sue Nabi, chief executive officer; and Laurent Mercier, chief financial officer. I would like to remind you that many of the comments today may contain forward-looking statements. Please refer to Coty's earnings release and the reports filed with the SEC where the company lists factors that could cause actual results to differ materially from those forward-looking statements.\n\nIn addition, except where noted, the discussion of Coty's financial results and Coty's expectations reflect certain adjustments as specified in the Non-GAAP Financial Measures section of the company's release. With that, we will now open the lines for questions. [Operator instructions] And our first question will come from Stephanie Wissink with Jefferies. Please go ahead.\n\nSteph Wissink\n\nThank you. Good day, everyone. We have two questions. The first is just on travel retail, China, and e-commerce.\n\nThose really stood out to us in the quarter and the year as big drivers of growth. So can you talk about your expectations for those drivers in your fiscal '23 guidance, specifically China, if you can give us some sense of what you're assuming? And then Sue, I'm going to ask you a tough question. I'm hoping you're willing to answer, but there's been a lot made about the carrying relationship in that portfolio of brands. And I'm hoping you can share a little bit about since you've arrived at Coty, how that relationship has changed, the commitment you have to those brands, and maybe some of the performance indicators that you're looking at to reinforce that relationship? Thank you.\n\nSue Nabi -- Chief Executive Officer\n\nYes. Thank you so much for your questions. So first, let me start with the first part, which is around the strength of the business. Indeed, the travel retail, e-commerce, and China, I will say a few words about China later, are clearly our travel retail and e-commerce, key contributors to this I would say, best-in-class performance that we had in Q4 and in fiscal '22.\n\nI really hope that everyone will recognize today and now that these 8 quarters of results on par or ahead of expectations of our guidance and of course, most of our peers, it's clearly hopefully going to be recognized as a great achievement. That's a very important point. When it comes to travel retail and the fact that travel retail has been a key contributor, it's true that for all of us, specifically those who've been traveling, we've seen now there is a huge surge in terms of travel worldwide. And this surge of travel, of course, translates into beauty figures, if I may say, specifically at Coty.\n\nOur travel retail channel has been doing fantastically well during the quarter. Year on year, to take one example, it's three times -- triple-digit growth, sorry, in terms of what we are seeing there. This is across the full board of categories, our fragrances and specifically our highest-end fragrances and more artisanal or niche fragrances are doing fantastically well, gaining market share, thanks to travel retail exclusives, but also thanks to the level of innovations. Our new category, because we entered the -- before the pandemic travel retail was one category channel, it was mainly fragrances.\n\nNow travel retail is fragrances, Prestige makeup, and of course, skincare. And on Prestige makeup there, we've been doing also fantastic figures, thanks to the different brands, the Burberry Makeup, Gucci Makeup, or more recently, Kylie Cosmetics, which had fantastic results in the top airports around the world. And last but not least, this channel is now fully benefiting from the repositioning of Lancaster from a sun care to a skincare brand, that started first in Hainan, but that's currently spread into Mainland China at Sephora as an exclusive partnership. And we've seen that this brand has been posting a double-digit growth in fiscal '22, which overall also had to do a lot with travel retail performance.\n\nE-commerce is clearly doing very, very well. This is clearly, I would say, the case in the Prestige division. It's, even more, the case on the consumer beauty division. And this honestly, I have to say, it's a big satisfaction for us because our brands are becoming dominant brands on social media, specifically CoverGirl, of course, but also Rimmel.\n\nWe've done a recent launch called Thrill that happened at the end of the quarter and beginning of Q1, that's doing fantastically well, 100% co-created with TikTok-ers. So clearly, this part of the business is a key contributor. And you can imagine that in the coming quarter, it is going to continue to be a key contributor. When it comes to the China topic.\n\nOn China, of course, like everyone, we've been impacted by the lockdowns at the end of Q3 and during Q4. That's what we have seen in Q1, now two months into Q1, is that China has fortunately strongly rebounded. We are seeing double-digit growth, not at the level of what we had inside prior to the first, I would say, slow down because of the restrictions, but very, very strong performance. And overall, Coty China had a plus 11% performance in fiscal '22 to be compared to a market that was minus 1%.\n\nSo that's what I can tell you on the business side. Now concerning the second part of your question, first of all, I'm not giving, as you can imagine, to do a lot of comments on speculations. But what I can tell you is that our long-term partnerships with our top fashion houses are continuing to be of a great quality and the other thing that I would like also to stress now that you're asking me the question is that I'm taking again this opportunity to repeat, that no key license is up to renewal before five years So everything else is speculation. But these are the two key elements I need to share with you today.\n\nI hope this answers your two questions, Stephanie.\n\nSteph Wissink\n\nIt does. Thank you very much.\n\nSue Nabi -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question will come from Nik Modi with RBC. Please go ahead.\n\nNik Modi -- RBC Capital Markets -- Analyst\n\nThank you. Good morning, everyone. Sue, I was hoping you could just provide some context. Of course, I think the resiliency of beauty is pretty clear during downturns.\n\nBut I wanted to understand, within your guidance, how you're thinking about the macroeconomic backdrop -- do you think this is going to be some kind of gradual, very shallow situation? Or are you expecting things to deteriorate further from here? So that's the first question. And then the second question is just maybe an update on what's going on with inventories at retail, given that they're managing their inventories very tightly right now. So I just wanted to get some perspective on what's going on with inventory. Thank you.\n\nSue Nabi -- Chief Executive Officer\n\nYep. Thank you for the question. So again, what I can tell you when it comes to the macro and what we are seeing currently, which is the best indicator of what we will hopefully oversee is that the beauty category is not showing any sign of slowdown, specifically when it comes to Prestige, but also the premiumized part of consumer beauty. Clearly, consumers are more than ever have to say, premiumizing, which is again, I guess, for all of us is a kind of surprise in the middle of this inflationary pressure, that they are premiumizing more and more.\n\nAnd during Q4, what we have seen is the movement, if I take the fragrance category, moving from Eau de Toilette to Eau de Parfum which are more expensive because more concentrated versions of scenting. This movement is confirmed and it's only accelerating, I have to say. So we don't see consumers trading down. We see them trading up in Prestige behind categories such as fragrances, but also behind categories such as Prestige makeup.\n\nAnd on the consumer beauty side, the part that's the best preserved. And if you listen to what some of our partner retailers have been sharing recently during their earnings, it's clearly the premiumized part of the consumer beauty that's doing fantastically well. Probably, I would say that in the past, we were putting on one side the things that are priced and then things that are very, very affordable. I do believe that in beauty today, the market will be all about cool or desirable brands, be it from Max or Prestige and not cool and not desirable brands be it from Max and Prestige.\n\nAnd those that are cool and desirable are by defination going to be protected. Overprotected probably because this has become, I would say, we call it the fragrance index or the fragrance effect. It's clearly these products that are not only female but also male, fragrances are really consumed today by men, women, Gen Zs, Latins, etc., in the years to take this example. And these are categories that I do believe because they are making you look or feel better, are becoming more and more essential categories rather than what we could consider as categories that you would shop only when you're OK.\n\nSo I think it's really this that I see in terms of macro trends. In terms of inventory, to answer the second part the retailers have indeed excess inventories in some other categories, but not in beauty. In fact, if you listen again to the earnings from the different retailers, if there is one preserved category, it's in the beauty.\n\nNik Modi -- RBC Capital Markets -- Analyst\n\nExcellent. Thank you very much.\n\nSue Nabi -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThank you. Our next question will come from Javier Escalante with Evercore. Please go ahead.\n\nJavier Escalante -- Evercore ISI -- Analyst\n\nGood morning, everyone. My question has to do with the consumer division. If you can give us an update with regards to the supply chain challenges that CoverGirl had or were in the quarter? And also, how you see the profitability of the business going forward? It improved at least more than I thought in Q4. So if you can expand that, that would be great.\n\nThank you.\n\nLaurent Mercier -- Chief Financial Officer\n\nYep. So, Javier, I would take the question. So consumer beauty, on the first question on supply chain. And I would say, it's not specific to consumer beauty.\n\nI will make a comment on global supply chain. So number one, indeed, I mean, the issue we raised last time in our last webcast this is the result, I remember when we had the call, we were telling you that this was really in good progress. So now this is resolved. However, from a global standpoint, Obviously, as our peers, we are not immune from current supply issues.\n\nBut definitely, we are well protected, and we know we have a service level which is in the low 90s, which is a good performance. So why we are protecting this is definitely because we worked now for several quarters on dual sourcing, on local sourcing and also, we had also some contracts on freight, which could protect us. So this is really the combination of all these levers. And as you can imagine and as you know, this is a daily focus from all the teams, we need to keep a strong improvement and control on supply chain.\n\nThere is another angle on supply chain and service level is also that the demand in fact is higher. So also you have both elements, and this is indeed what we have to manage. But we are winning control and managing nicely the current constraints. Second, -- you are absolutely right, consumer beauty profitability moving better than expected.\n\nI mean the reason is very simple. When I talk every time about the virtuous cycle we apply this approach from both segments. This is the case for Prestige. So this is also the case for consumer beauty.\n\nSo the recipe which has really improved the gross margin, this is something which is really absolutely in the DNA of consumer beauty teams, thanks to all the levers mix. Sue rightly just mentioned that we are premiumizing all the new innovations tangent free. So this is really a key element, the new innovation we are launching are really premiumized and really helping definitely the mix on the gross margin. We are doing pricing in the current context.\n\nBut I mean assisting every time in a very granular manner, in a very detailed manner, so it's very, very precise and also optimizing cost of goods because rationalization of the portfolio is platforming, which is really a key element. We raised a few times that when we are doing astute innovation, for example, CoverGirl we can use the same platform going to replicate a Max Factor on Rimmel by doing this. So that's really the virtuous cycle. And then, of course, we are using this money to inject the media in the new city.\n\nAnd you remember, this is what we did in Q3. Since we had the question that indeed in Q3, the level of A&CP was rather high in consumer beauty this was a conscious decision to support all those initiatives and then indeed now delivering sustainable profitability in consumer beauty and obviously, we continue in fiscal '22 and beyond.\n\nOperator\n\nThank you. Our next question will come from Olivia Tong with Raymond James. Please go ahead.\n\nOlivia Tong -- Raymond James -- Analyst\n\nThanks. Good morning. My first question is on fiscal '23 EBITDA expectations. I see continued strong margin expansion plan.\n\nIt looks like you're expecting about 200 basis points of margin improvement in the first half, but -- prior to the second half. So I was just wondering if you could expand on that and what's driving the first half versus second half expectations? And then my follow-up question is around your view on celebrity influencer-led brands. It's obviously a space that you have great color into, but it is becoming more and more crowded. So I'd love to hear your views in terms of relative success of your brands versus others? And how these brands differ in terms of growth expectations and support levels relative to the rest of your portfolio? Thank you so much.\n\nLaurent Mercier -- Chief Financial Officer\n\nThank you. So I will take indeed the first part on EBITDA expectation. And first of all, I really want to remind that on some of the metrics on top line and EBITDA, indeed, I mean, our fiscal year '23 guidance is completely in line with the midterm guidance that we gave you, remember in November. So this is really confirming the robustness of the model and really the strong achievement of fiscal '22 we continue in fiscal '23 in a very consistent manner.\n\nSo definitely, the marginal guide implies this, but I would say it's still a little too early to go more in that between H1 and H2. So it is really definitely we continue the gross margin expansion, disciplining fixed costs, investing, and delivering this full year guidance. Now navigating H1 and H2, it may be something that we adapt during the year depending on the evolution of all the metrics. So still too early to debate on this.\n\nSue Nabi -- Chief Executive Officer\n\nYes. And then secondly -- this is Sue, I'm going to take the second part of the question, which is around celebrity and influencer-led brands. So if I remember well, the question was around, is it more competitive? The answer is clearly yes. This is a very, very competitive part of the business.\n\nI think all of us, we see a lot of brands launched on a daily basis, almost daily, so it's very, very competitive. I do believe that there is a place where there is a kind of moment of truth, which is brick-and-mortar. There is a selection that's happening because the ability to have a go-to-market that's strong as a Coty go-to-market, to be present in hundreds if not thousands of stores globally, this is clearly an element that selects a lot of DTC brands as potentially becoming bigger brands. And by the commission makes the competition less important.\n\nIn terms of right level of investment, as you can imagine, these brands are born on social media. They have natural A&CP, if I may call it like this because of the reach of the different people who are reaching to the communities on a daily basis. And therefore, there is less need to overinvest in media, like we do it on classical brands. So it's really this kind of, I would say, compromise that we need to find depending on the brand and depending on the kind of innovation.\n\nOperator\n\nThank you. Our next question will come from Chris Carey with Wells Fargo Securities. Please go ahead.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nHi. Good morning.\n\nSue Nabi -- Chief Executive Officer\n\nGood morning, Chris.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nSo your new launch activity was a theme that came up through our prepared remarks and a little bit in the Q&A session here. And a lot of focus was on the Kim launch in the front half. You noted that you're at 20% of your full year sales expectations already. Is there any way you can frame what the contribution from the Kim launch will be to the outlook this year? And in general, what the contribution from new launches will be to your fiscal '23 overall on sales and potentially on profits, then I have a quick follow-up.\n\nSue Nabi -- Chief Executive Officer\n\nYes. Thank you, Chris, for the question. So again, when it comes to the first part, which is the contribution, as you can imagine, we do not share figures of how much this brand is going to contribute to the growth of the company. But clearly, the start of this new line is very good.\n\nWe are above our expectations. And something that's for me and for all of us is a very, very strong sign is that the best-selling item is not a single product, the best-selling item is the full line of nine SKUs, which is priced at $575. So for us, if consumers are ready to spend $575 on a set of 9 products, it means a lot in terms of how they trust the brand, how they trust what we are doing together on this brand. So this is clearly something that we wanted to share with you.\n\nWhat I can tell you about the fiscal '23 guide, it's not dependent on this launch. It's clearly a very broad base. And this is another item I would like to insist on a lot. It's really that my job and Laurent's job and the job of all the people at Coty, is to build a growth that's as balanced as possible in terms of geographies.\n\nYou've seen that, in fact, not being overexposed to China protected us recently. In terms of categories, we are working hard to make sure we have all categories in hand so that whatever happening in one category or the other, we can accelerate in one category versus another in terms of brands, not being dependent from any brand. And clearly, this is something that's a key element that is part of the way we are building the net revenues not only for fiscal '23, but also into our algorithm that we presented to you a few months ago. Well, in terms of what are the key building blocks for our fiscal '23.\n\nFragrance launches and category growth are clearly the biggest building blocks that we have embedded into this guidance.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nThank you, Sue. The quick follow-up would just be, Laurent, you did note some buckets of gross margin in the prepared remarks. It was also noted that Coty is expecting modest gross margin expansion for the year. I wonder if you could maybe just frame the cadence of gross margin expansion over the course of the year.\n\nAnd then perhaps any of the key buckets the puts and takes as you see that? Thank you so much.\n\nLaurent Mercier -- Chief Financial Officer\n\nYes. So I mean, first of all, let me remind, as you noted, I mean, gross margin expansion in fiscal '22 close to 400 basis points. So you can really see that all the actions, all the initiatives that we put in place delivered strong results. Now definitely, we continue the journey.\n\nWe still have some initiatives that we are implementing to continue gross margin expansion, definitely not at the same reason as we had this year, and it confirms really, as I just shared, that we are very confident in moving to the mid-60s gross margin by '25. What are the ingredients? What are the buckets? So let me take the key elements. Number one is mix. Mix is a key driver of the gross margin.\n\nAnd again, we see concrete results of what we have achieved in fiscal '22, which is really the premiumization of fragrance either in segments and also makeup and the next phase indeed in the skincare, but also in consumer beauty. We, obviously all the new innovations that we are launching, are margin accretive. And sometimes we don't have the same level of proceeds. So we see that driver and we continue in fiscal '23, and it's part of the strategy and all the initiatives that we'll be having.\n\nNumber two is definitely pricing, and I can elaborate a little on this because this is a key element. We implemented a low single-digit price increase at the beginning of calendar '22. We are currently, as we speak, implementing mid-single-digit price increase, and this implementation is going very smoothly. So there is no impact on volume.\n\nAnd again, it's really quality of execution. And we are also working on preparing a new round of price increase low single digit in the beginning of calendar '23. So we are definitely, from a top-line standpoint, we're doing very well. Then on cost of goods, definitely, there is a strong headwind due to inflation.\n\nIt's about roughly slightly above 2% of net revenue. This is what we had in Q4, and we have the same assumption for fiscal '23, OK? So it's 2% and also cost of goods, we have strong intangible actions which will help the gross margin. Number one is we get the effect of the closure of the factory -- fragrance factory in Germany. As you know, we announced 18 months ago this decision.\n\nWe executed, I mean the team, during the 12 months, and this was perfectly executed without any disruption. And we are now getting the savings starting now. We are also working as of now on platforming of the value analysis reviewing all the formulas, either consumer beauty or Prestige, and really with the objective to simply find the formula to standardize and also to have late differentiation. And by doing this, we are making savings in procurement, but also in manufacturing.\n\nSo these are really the elements of all the gross margin expansion. This is uncaptured in the all including umbrella, and this will keep supporting gross margin expansion in '23. And again, same flywheel to keep fueling all the key initiatives that we have in the growth agenda.\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nOK. Great. Thank you both.\n\nSue Nabi -- Chief Executive Officer\n\nThank you.\n\nLaurent Mercier -- Chief Financial Officer\n\nThank you.\n\nOperator\n\n[Operator instructions] Our next question will come from Steve Powers with Deutsche Bank. Please go ahead.\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nYeah. Hey. Thanks and good morning. Sue, maybe building on your comments earlier around balance across the portfolio.\n\nI guess I was hoping you could frame for us in a bit more detail, just base case expectations in terms of the contributions from Prestige versus consumer beauty within the '23 outlook? And given the macro comments you made earlier and current momentum, I'm guessing Prestige is to, again, be an amplified driver of growth, but perhaps you could just talk through the magnitude and sensitivities there, number one. And then separately on China, I guess just a little bit more specificity around your perspective on how that market is expected to grow in the year ahead? And just how dependent your own business is on resumed market growth in China at this point in its evolution in China? Thank you.\n\nSue Nabi -- Chief Executive Officer\n\nYeah. Good morning, Steve. Thank you for your questions. So let's start with the first part, which is around how we are building in such fiscal '23 growth.\n\nAnd I think part of the answer was in your question. As you can imagine, there is what we call at Coty's fragrance index that's helping us a lot. This is clearly about this category clearly supporting the growth of the beauty category not only in the U.S. but globally.\n\nThis category is 20% above the levels of 2019 globally here again. And we see it continuing to premiumize to commend higher pricing with a lot of innovations, either from our artisanal brands or more mainstream brands. So clearly, this is going to hold us clearly during fiscal 2023. Clearly, we will continue to execute on our makeup strategy, Prestige makeup strategy.\n\nThere, again, the brands that we are having in this area are growing superfast and therefore, there are going to be key contributors even if the base is smaller. So by definition, in absolute value, it's just a contributor, but still it's a key one. And last but not least, we are, for the first time, starting to operate a full skin care line in China. I'm thinking about Lancaster, but hopefully going to slowly but surely become a key contributor in our growth agenda.\n\nSo to see by nature because of the markets and because of the fact that we are adding categories is going to be in a way, a key contributor to fiscal '23. I remind you that the Prestige business is 60% of our net revenues, while consumer beauty is more or less 40%. But we are also quite bullish on consumer beauty because we have incredible launches. Some of them started at the end of the quarter, beginning of Q1.\n\nI'm thinking about Thrill Seeker that started in U.K. behind the Rimmel brand, but having fantastic start. It's the first product that has been co-created 100% with TikTok in mind with TikTokers as not only creating the products but also part of the campaigns, holding and facing the campaign in front of consumers. But also in the U.S., CoverGirl, we are activating one of the most powerful franchise behind CoverGirl, which is Simply Ageless.\n\nSimply Ageless is one of a kind line in the U.S. It's really the only line that's so modern in terms of approach of the question around age. It's all about mixing beautiful skincare ingredients together with performing makeup ingredients. And this line, every time we put money and investment behind, we see it growing super, super fast, and we are also still including recently in the most recent launches.\n\nSo clearly, this is, I would say, the way we described how we have built fiscal '22. Now when it comes to China, what we are seeing is that -- of course, they have been lockdowns, there have the pressure on consumption, including e-commerce. But what we are seeing now two months into the first quarter of fiscal '23, at least for Coty is that the spike in our sales is back to, I would say, levels that are not the same as the ones we had beginning of calendar '22, but very, very strong double-digit level. So this is clearly something that we will count on.\n\nAnd again, for us, think about something quite simple. China is so small for Coty that anything we do, just doing the right things is a potential upside for the whole business there and therefore for the company.\n\nOperator\n\nThank you. Our next question will come from Korinne Wolfmeyer with Piper Sandler. Please go ahead.\n\nKorinne Wolfmeyer -- Piper Sandler -- Analyst\n\nHey. Good morning and thanks for taking the questions and congrats on the quarter. So I'd like to first kind of push you a little bit more on what you're seeing in color cosmetics. Now could some of the recent strength be coming from reopening and the summer season, having lots of weddings and events.\n\nSo -- is there any way to kind of parse out how much could be coming from the reopening and how much is more sustained strength going forward? And then just touching on the recent Ant partnership that was announced, we're excited to hear that. But can you just expand a bit on what this partnership means for Coty? How can we help expect this to kind of help the China in travel retail parts of the business ramp faster? And then any financial implications here that you can share with us would be great. Thank you.\n\nSue Nabi -- Chief Executive Officer\n\nYeah. Good morning, Korinne. Thank you for your questions. So let me start with the first part, which is around what we are seeing in product Cosmetics and how much of this is driven by reopening versus something that's more sustainable, if I understood quite right, the question.\n\nSo what I can tell you is that what we are seeing is on top of the strong categories that were booming during the lockdowns and post-pandemic, I think of anything that has to do with eye products, be it mascaras, growth products, lash growth serum, eyeshadows, etc., we are seeing the rest of the categories back to growth, including lip color But not any kind of lip color interestingly, the launches that are doing the best at Coty and specifically, I think about CoverGirl in the U.S., it's seeing rebounds. Rebounds that probably are mixing the right things that people are looking for, which is on one side a hint of color and on the other side, a lot of care. And this is for me a sustainable trend, if I may say. And this is clearly going to be here to spend the test of time.\n\nThere will be more and so people are going to look for more pigmented makeup, moments where they will look for less pigmented maker. But whatever will happen, what I call skin side makeup or healthy makeup whatever you like name, this is the key trend behind the consumption of this category in the U.S., that we also see the same things more or less around the world in other regions. Now when it comes to the partnerships that you are referring to between Ant and Alibaba, what does it mean for Coty and for the traveling momentum? We are, of course, studying the consequences of this partnership. The only thing I can tell you is that there is something very strong is that we are all waiting for the Chinese consumers to be back to travel.\n\nAnd therefore, to add on to the travel retail huge figures, remember, I shared with you that travel retail is back to the levels pre-pandemic. But this is still with a minus 20%, minus 30% less passengers, so having all these consumers back to this channel can only confirm the importance of travel retail. And I can tell you that this partnership also means that travel retail and China are more or less telling us the same story and are extremely linked to each other.\n\nOperator\n\nThank you. Our next question will come from Mark Astrachan with Stifel. Please go ahead.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nYeah. Thanks and hello, everyone. I guess first, just on marketing spend, ad marketing spend. 20% of sales in fiscal '22, how do you think about where that goes in '23 and beyond? Is there any particular benchmark you're using and then sort of more specifically, it was up 600 basis points as a percentage of sales year on year, obviously contributed to strong growth.\n\nBut how do you think about the need to continue to increase that and the correlation to sales growth going forward? Thank you.\n\nLaurent Mercier -- Chief Financial Officer\n\nYep. So Mark, so indeed, as you saw in '22, I mean, we were able to step up significantly our level A&CP, and now to be in the range of a high 20%. We are making very clear that high 20s is really for us, -- is a accurate level and definitely within our flywheel. This is something that we are thinking also for fiscal '23.\n\nNow definitely, within high 20s is really the way. And again, the granularity is really how we spend the money. So definitely, its really the quality of execution. So we are more than able focused on ROI.\n\nSo definitely, the allocation of this money, everything is defined through ROI KPI, both in Prestige and in consumer beauty. And definitely capturing the trend that Sue have just explained, and I want to dig also on the well-balanced good points, because then we can allocate per geography in a balanced manner, per category and also per brand. So this is definitely what we are doing, is allocating the initiatives really per ROI. Another element also because, of course, we are talking about percentage, per dollar, that is also within A&CP, we have also some productivity and optimization initiatives.\n\nDefinitely, if I take an element that we are calling other A&CP, which maybe is less visible, of course, media is very visible. But there are also some other areas which, I would say, are nonworking where we have also really improving umbrella, some strong productivity initiatives. I can just give you some examples about samples, textures, marketing materials, which are basically area where we have some optimization. But always with the same mindset that optimization productivity we are doing on this line, we can reallocate in the working media and push definitely the business agenda.\n\nOperator\n\nThank you.\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nGreat. And then -- just thought I got cut off there. I wanted to ask about just how to think about margin profiles across the Prestige businesses. Any material differences in thinking about the license versus wholly owned brands and by category, makeup skincare versus fragrance? Thank you.\n\nLaurent Mercier -- Chief Financial Officer\n\nNo. I mean there is -- I mean -- and we don't answer this level of detail, but what I can tell you again is that, of course, Prestige gross margin, as you know, I mean, is higher than consumer beauty. So this is a fact. But again, as I shared several times and the gross margin agenda is valid for both segments.\n\nTo elaborate a little more within -- consumer beauty, definitely that all the initiatives that we are making, so Prestige makeup, e-commerce, but also geography, we mentioned about China, all these initiatives are really driving gross margin accretion. So this is really the way we are taking the gross margin agenda.\n\nSue Nabi -- Chief Executive Officer\n\nThank you, Laurent. Thank you, everyone. So again -- thank you, Mark. So again, we are ending the call right now.\n\nSuper happy again to report these results, again, best-in-class results, and we hope to talk to you soon about what's happening in Q1. Thank you so much.\n\nLaurent Mercier -- Chief Financial Officer\n\nThank you. Bye-bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteph Wissink\n\nSue Nabi -- Chief Executive Officer\n\nNik Modi -- RBC Capital Markets -- Analyst\n\nJavier Escalante -- Evercore ISI -- Analyst\n\nLaurent Mercier -- Chief Financial Officer\n\nOlivia Tong -- Raymond James -- Analyst\n\nChris Carey -- Wells Fargo Securities -- Analyst\n\nSteve Powers -- Deutsche Bank -- Analyst\n\nKorinne Wolfmeyer -- Piper Sandler -- Analyst\n\nMark Astrachan -- Stifel Financial Corp. -- Analyst\n\nMore COTY analysis\n\nAll earnings call transcripts"
}