{
  "companyName": "Agenus",
  "companyTicker": "AGEN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/agenus-agen-q3-2022-earnings-call-transcript/",
  "content": "Agenus (AGEN 3.90%)\nQ3 2022 Earnings Call\nNov 08, 2022, 8:30 a.m. ET\n\nOperator\n\nThank you for holding, and welcome, everyone, to the Agenus third quarter 2022 financial results call. All lines have been placed on mute to prevent any background noise. After the speakers' remarks, there will be a question-and-answer session. [Operator instructions] Thank you.\n\nI'll now turn the call over to Nico Frelick from investor relations. Mr. Frelick, please go ahead.\n\nNico Frelick -- Investor Relations\n\nThank you, John, and thank you, all, for joining us today. Today's call is being webcast and will be available on our website for replay. I'd like to remind you that this call will include forward-looking statements, including statements regarding our clinical development, regulatory and commercial plans and timelines, as well as timelines for data release and partnership opportunities. These statements are subject to risks and uncertainties, and we refer you to our SEC filings for more details on these risks.\n\nJoining me today are Dr. Garo Armen, chairman and chief executive officer; and Christine Klaskin, vice president of finance. Our chief medical officer, Dr. Steven O'Day, will be joining us for Q&A.\n\nNow, I'd like to turn the call over to Garo to highlight our progress and speak to our outlook for the remainder of the year. Garo?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nThank you, Nico. Once again, good morning and thank you for joining us today for our third quarter update and numbers discussion. It is an exciting time for Agenus, and we believe also for the field of Immuno-oncology. The Society for Immunotherapy of Cancer, otherwise known as SITC Conference, starts today in Boston, our home turf.\n\nDuring which we expect to highlight the significant unrealized potential for a new generation of I-O regimens, -IO, being Immuno-oncology, that potentially would transform the way we treat cancer. We anticipate that one of our most promising clinical assets, botensilimab, a novel adaptive, innate immune activator, in addition, to being a CTLA-4 binder, can provide important future therapeutic options for patients with tumors that are particularly resistant to current therapies including, very importantly, immunotherapies. On today's call, we will provide an update on botensilimab development programs, including our participation at SITC, as well as recent initiation of two phase 2 ACTIVATE trials in advanced colorectal cancer program and in melanoma [Inaudible] to be followed by trial in pancreatic cancer before the end of the year. It's important to point out that all of these trials are randomized trials.\n\nWe will also highlight progress on several of our earlier stage clinical programs, including our ILT2 antagonist, AGEN1571; and our CD137 agonist, AGEN2373, and provide also a financial update. Let me start with SITC. We will be sharing expanded clinical data from our phase 1 study of botensilimab across multiple tumor specific expansion cohorts of heavily, and this is very important, heavily pretreated tumors. When we presented the data in colorectal cancer several months ago at ESMO-GI in Barcelona, the experts at that time scrutinized the heavily pretreated nature of these patients.\n\nAnd it was the consensus that the data presented was unique in that it was both in heavily pretreated patients, as well as in cold colorectal tumors. Both of them, by the way, increased the odds of nonresponsiveness. And the fact that we've seen responses in that population is the impetus for enthusiasm by experts on botensilimab. So, now these data will be presented at an oral plenary session on an expanded patient population, whereas we presented the data in colorectal at ESMO-GI, SITC presentation will encompass expanded cancers.\n\nAnd it will be on November 12 at 10:50 a.m. The presentation is by Dr. Breelyn Wilky the director of Sarcoma Medical Oncology and deputy associate director of Clinical Research at the University of Colorado. And it is in plenary session.\n\nAgenus will also present translational data from the phase 1 study. And by the way, again, this is a very large phase 1 study, not a common phase 1 study, having already enrolled 250-plus patients. Although the data presented will be about half of that number given the fact that we're presenting data on patients that have had at least one scan to collect data from. And so, Agenus will present translational data from the phase 1 study and preclinical studies highlighting the mechanisms of underpinning botensilimab's differentiated enhanced anti-tumor immunity, as well as new preclinical data, demonstrating superior activity than first generation [Inaudible] for agents across multiple cold and totally immunogenic tumor models.\n\nAnd as we have communicated, later on November 12, Agenus will host the Road Taken conference, that's Agenus-sponsored conference. This R&D event features presentations from key opinion leaders at the forefront of immunotherapy development, including Dr. Michael Atkins; Dr. Alexander Eggermont; Dr.\n\nBree Wilky, the presenter of the plenary session that morning; and Dr. Larry Norton, as well as multiple presentations from our own leadership team. The agenda will center on the current and future state of I-O treatments, as well as the unprecedented data generated to date in the botensilimab program. The event will take place from 2:00 p.m.\n\nto 5:00 p.m. Eastern Standard on November 12 at the offices of [Inaudible] Gray in Boston. While in-person attendance is now closed due to space restrictions, institutional investors, analysts, and members of the medical community are invited to attend the live webcast of the event that can be accessed on the investors section of our Agenus website. Although I might indicate that there's a limit in the participation of that as well.\n\nAgenus made several important clinical advancements to our botensilimab program in the third quarter. Building upon the robust responses [Inaudible] phase 1 trial, we have already initiated to randomize worldwide phase 2 ACTIVATE trials in advanced MSS, that is microsatellite stable, or it can be also described as non- MSI-HIGH CRC patients, as well as melanoma. ACTIVATE-Colorectal trial will evaluate botensilimab monotherapy, and in combination with balstilimab, our PD-1 antibody. It is randomized to current standard of care in patients that have received at least one prior chemotherapy regimen.\n\nSo, again, these are the pretreated patients that have failed the standard of care in the prior study. ACTIVATE-Melanoma will evaluate botensilimab monotherapy in patient's refractory to either PD-1 or combined CTLA-4, PD-1 therapy. And this is also a very important trial design because it may achieve the approval of botensilimab as monotherapy in a continuing approvable trial. OK.\n\nAnd of course, there are benefits to going after botensilimab monotherapy indication. The primary endpoint of both studies will be overall response rates with duration of response, progression, free survival, and overall survival as primary and secondary endpoints. It is also important because all of these endpoints are considered the gold standard in clinical trial conduct. Agenus is expected to launch, as I said earlier, its third phase of the trial in advanced pancreatic cancer by year-end.\n\nThis, too, will be a randomized trial. And it will look at botensilimab in combination with chemo versus chemo alone. Beyond these trials, Agenus continues to enroll patients in its phase 1 botensilimab study to evaluate expansion cohorts in additional indications. These expansion cohorts will evaluate efficacy signals, as well as support dose optimization, and contribution of conformance for the PD-1 combinations.\n\nThese larger and richer data sets that will be obtained from the expansion of our phase 1 trials can be used to accelerate our phase 2 programs, as well as support additional indications for development. And while we have not made disclosures on what additional indications we will be going after, we have a clear vision of what they are. And they include some very difficult cancers, as well as some very large cancer opportunities beyond the three indications that we've mentioned for the subject of clinical trials this year. Complementing the progress we've made on botensilimab this quarter, we're advancing additional clinical programs developed from our antibody engineering innovation platform.\n\nIt's very important also to mention that every product, other than our first generation CTLA-4 and our PD-1, has been specifically engineered with attributes in mind. And, of course, botensilimab is a clear example of that attribute, which has been designed into the molecule, which has been proven to be validated in preclinical models, and now we're seeing that to be validated in clinical trials. So, getting back to our other agents, we launched our very first patient in our phase 1 study, evaluating. AGEN1571.\n\nThis is ILT2 antagonist antibody. And we're doing the phase 1 trial first as monotherapy and then it will be in combination with the botensilimab and balstilimab in patients with advanced solid tumors. We continued enrollment of our combination study evaluating AGEN2373, which is our CD137 agonist. This is with botensilimab in melanoma patients, who are relapsed or refractory to a PD-1 therapy.\n\nWe anticipate enrollment to be completed in the first half of 2023 or sooner. Agenus has a robust track record of value creation through strategic partnerships. And this quarter, multiple partnered assets advanced into new phase 2 studies. So, they're advancing very nicely.\n\nFor example, BMS launched their phase 1/2 study of BMS-986442, which is our old TIGIT bispecific, licensed to them, which was discovered by us, also known as AGEN1777. BMS-986442 is being evaluated in combination with nivolumab, their own PD-1, and chemotherapy in patients with advanced solid tumors, and nonsmall cell lung cancer. Second, Merck initiated a randomized phase 2 study evaluating MK-4830. A candidate ILT4 antagonist, also discovered by Agenus.\n\nAnd this is in combination with pembrolizumab, Merck's own PD-1, and chemotherapy in ovarian cancer. Additional phase 2 studies of MK-4830 are also ongoing in nonsmall cell lung cancer, small cell lung cancer in addition, esophageal, MS-HIGH colorectal cancer, renal cell carcinoma, and melanoma. We're very heartened by the fact that our ILT4 antagonist antibody has indications of activity in all of these tumors. And lastly, Incyte initiated a randomized phase 2 study evaluating LAG-3 and TIM-3 antibodies, discovered by Agenus in combination with PD-1 in first-line squamous cell carcinoma of the head and neck.\n\nAdditional phase 2 studies of these programs are ongoing in melanoma, endometrial cancer, and urothelial carcinoma. Finally, our ability to recruit top talent is critical to the development of our pipeline near term, more specifically, bortezomib into a transformative treatment for patients in need. To this end, we made some important recent additions to further bolster our clinical and regulatory leadership team. They include Dr.\n\nTodd Yancey was named senior global clinical development, medical affairs, and commercial advisor. He comes to us with over 40 years of combined clinical and industry experience, most recently from Beijing. We also hired Patricia Carlos as our chief regulatory quality and safety officer. Patty has over 20 years of regulatory affairs experience, leading programs from investigational NDA to commercialization, as she was most recently at Arcus.\n\nWith that, I will now turn the call over to Christine to cover our financial reporting. Christine?\n\nChristine Klaskin -- Vice President, Finance, and Chief Accounting Officer\n\nThank you, Garo. We ended our third quarter 2022 with a cash, cash equivalent, and short-term investment balance of $218.2 million as compared to $238.3 million and $306.9 million on June 30th, 2022, and December 31, 2021, respectively. Cash used in operations was $32.2 million for the quarter ended September 30, 2022 and $128 million for the nine months ended. We recognized revenue of $22.8 million and incurred a net loss of $56.7 million or $0.19 per share for the third quarter ended September 30, 2022.\n\nFor the nine months ended September 30, 2022, we recognized revenue of $69.6 million and incurred a net loss of $156.6 million or $0.54 per share. Noncash operating expenses for the third quarter and nine months ended September 30, 2022 were $22.2 million and $62.8 million, respectively. I'll now turn the call back to Garo. Thank you very much, Christine.\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nIn closing, I just want to reiterate three things. One is the fact that we have an important pipeline of agents. A very important pipeline of agents that allows us to be able to assemble the right combinations at our own terms. And this is very important now because only the fact that this pipeline of agents have very unique attributes that allow us to expand our horizons beyond just, let's say a segment of cultures by potentially to earlier-stage disease, as well as how to hard tumors.\n\nSo, it's a very exciting pipeline, and we're very, very heartened by some of the data that we will be disclosing in the first half of next year that highlights the important attributes of our pipeline. Now, secondly, I should also say that there are questions, for example, about our ability and our efforts to finance our pipeline. Because, as you know, we have a robust pipeline. And it takes resources to advance this pipeline.\n\nAnd let me make a couple comments and some historical reflections on how we have done this in the past and how we will continue to do it. For example, if you look at the past 10 years, we have funded our operations largely from two sources. One, the largest source, cash received from partners and royalty financing transactions. In combination, partnership and royalty financing transactions have netted us over $900 million over these last 10 years.\n\nIn addition to that, they have also done equity offerings, primarily through our ATMs. And ATMs are important instrument for us because they allow us to manage our cash balances quarter to quarter, year to year, to make sure that cash balances do not drop below a certain level based on our anticipated uses of cash. It's very important. And this flexibility has allowed us to be able to finance our needs until the next large infusion of cash, which typically is through anticipated partnerships.\n\nSo, with that, I think I will conclude my remarks. And we will, of course, disclose much more data as that hopefully will shed light into our excitement during our weekend activities both at the SITC plenary session, SITC posture sessions, as well as at Road Taken event on Saturday from 2 to 5. Thank you very much for your time. And I will be open to questions from the audience.\n\nOperator\n\n[Operator instructions] We'll pause for a moment to compile the Q&A roster. David Dai with SMBC. Your line is open.\n\nDavid Dai -- SMBC Nikko Securities -- Analyst\n\nGreat. Thanks for taking my questions and congrats onto your progress, especially on botensilimab data in SITC. So, first question, just around the SITC update for botensilimab. Then we saw at the SITC abstract earlier this morning that the cutoff is in April.\n\nSo, I'm wondering if you can share any kind of color on the increment updates we'll be expecting from the update at SITC.\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSo, a couple of comments on this, and I will turn it over to Dr. O'Day to answer the rest of it. But as you know, we provided results from our colon cancer trial with botensilimab plus balstilimab at ESMO-GI at the end of June. Now, since then, we have additional patients from CRC that will be presented also at SITC.\n\nI cannot disclose exactly how many patients. But they'll be a meaningful addition to the denominator that was disclosed at ESMO-GI at the end of June. In addition to that, we will be presenting several other indications with data that is mature and data that has been cleaned up. Both are very important requirements.\n\nOr it has to be mature and cleaned up. And we are reserving, of course, additional patient data to be presented at major conferences in the very early part of next year as well. So, Steven, would you like to add to that?\n\nSteven O'Day -- Chief Medical Officer\n\nYeah. Good morning. Dr. Steven O'Day, the chief medical officer of Agenus.\n\nYeah. I mean, Garo summarized it well. Obviously, these – the SITC abstract went in months ago with a cutoff of April. As you can imagine, this is a large phase 1 trial that's rapidly accruing expansion cohorts.\n\nAnd we look forward to updating the data with the oral plenary session on Saturday, which will be a more mature update of data cut and expansion of these cohorts. So, looking forward to sharing that this week.\n\nDavid Dai -- SMBC Nikko Securities -- Analyst\n\nThat's really helpful. And then just want to follow up on the SITC abstract we saw in some data from the ovarian cancer, especially from the platinum-resistant ovarian cancer where it saw 28% OR. This to me, it seems to be quite impressive because the historical response for PD-1 in platinum-resistant ovarian cancer is around 10%. And so, I'm just wondering, can you share with us your thoughts around potentially moving into the platinum-resistant ovarian cancer as another indication? Any thoughts on that would be helpful.\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSure. Other than the fact that we have to be careful about disclosing specifics before the actual plenary session. Steven, can you provide additional color on specifically ovarian cancer and then the comment about 10% being the typical response rates for PD-1s?\n\nSteven O'Day -- Chief Medical Officer\n\nYeah. I think all of the subgroups of patients that we're expanding and getting, you know, data on are in very difficult-to-treat settings in which they are what we call cold tumors or already exposed to PD-1-based therapies and refractory. So, certainly, refractory platinum-resistant exposed ovarian population has been a weak sort of immune opportunity in terms of PD-1 monotherapy, as you've indicated. So, we're obviously excited about this, as well as other diseases that are showing this kind of promise with response rates that appear higher than -- substantially higher than what you would expect with PD-1 monotherapy.\n\nWe look forward again to updating this cohort and others on the plenary session on Saturday.\n\nDavid Dai -- SMBC Nikko Securities -- Analyst\n\nAll right. That's really helpful. And then just one last question on the 1571, the ILT2 antagonist program. Maybe I missed it earlier, Garo, where you mentioned the kind of incremental updates from that program.\n\nCan you share with us when should we be expecting to hear from you on the data front from that program?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSo let me ask Dhan Chand, who is also here, to give you a very brief rationale based on extensive preclinical data, as well as the data from a similar family of compounds that we discovered and licensed to Merck. And that clinical data – and perhaps, you can draw some inferences then, and then if Steven has anything else to add.\n\nDhan Chand -- Scientific Director and Head of Drug Discovery\n\nYeah, Thank you, Garo. So AGEN1571, which is our ILT2 antagonist antibody, is designed to alleviate the suppressive – the myeloid suppressive function tumor microenvironment, in addition to enhancing the lymphoid activity as well. We discovered that patients that do not respond to PD-1 or CTLA-4 not only have enrichment of myeloid cells but also these myeloid cells express high levels of ILT2. And as such, we developed an antibody to block ILT2 inhibitory function in the tumor microenvironment.\n\nYou would have seen from our disclosures earlier this year that AGEN 1571 demonstrates not only monotherapy potential but also best-in-class activity compared to competing ILT2 antibodies. More importantly, we showed synergy with botensilimab in preclinical models, highlighting the importance of combining AGEN 1571 with other agents in our portfolio. With respect to other family members, you would have seen data from Merck on our ILT4 antagonists that we licensed to them, demonstrating compelling activity in patients that did not respond or progressed on pembro. Again, consistent with the discoveries that we've made that this family is important in extending therapy to patients that don't respond to conventional checkpoint therapy.\n\nThis molecule is progressing. 1571 is progressing in the clinic quite rapidly. I'll let Steven provide you some updates on when you can expect these readouts.\n\nSteven O'Day -- Chief Medical Officer\n\nYes. And as Garo said and as Dhan said, you know, the myeloid compartment is becoming more and more important from an immunobiology point of view. And our ILT4 that Merck has is obviously moving forward successfully in a phase 2 program. We're particularly excited about ILT2 for the reasons Dhan described.\n\nIt's in first in human studies which are going well. Obviously, we can't predict when data might be available, but certainly, the studies are accruing and moving forward. And we could have as early as the end of next year, you know, data to share with the world. But certainly, we'll have to just monitor the data and continue to progress these trials.\n\nDavid Dai -- SMBC Nikko Securities -- Analyst\n\nAll right. Thank you so much.\n\nOperator\n\nChi Wen with Jefferies. Your line is open.\n\nUnknown speaker\n\nHi. This is Chi Wen with Jeffries for Kelly Shi. Congrats on the botensilimab data. I just have two quick questions.\n\nSo, number one, for the response rates disclosed in the SITC abstract. So, may I ask how many are confirmed and unconfirmed the responses for each tumor type? And also, there are different doses botensilimab used in this phase 1 trial. So, did you notice any of those and then the response from the phase 1 data? Thank you.\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSo, the first question is about confirmed versus unconfirmed. We only present confirmed responses at conferences. We do not -- we have additional unconfirmed data that is suggestive of, for example, very strong disease control rates over a long period of time. But we don't register those as responses.\n\nThey may, in fact, in a number of situations, these trending responses have translated to actual responses upon further scans. But in terms of the dose variances, Steven, would you like to address the fact that in the trial early on, we had used lower doses? And in fact, at lower doses, we have seen some responses as well. But most of the data that you will be seeing at SITC is the equivalent of one mg and two mg per kg.\n\nUnknown speaker\n\nAll right. Thank you.\n\nSteven O'Day -- Chief Medical Officer\n\nYeah. I mean, as Garo said, you know, the data is rapidly evolving. In terms of confirmed and unconfirmed responses, unconfirmed responses have in a rapidly evolving trial. They may just mean that they haven't had their subsequent follow-up scans.\n\nSo, I would be mindful of that. And we will obviously update data on Saturday with our responses in terms of confirmed responses. In terms of doses, obviously, this trial is looking at a large number of doses initially, both monotherapy and combination. We are certainly concentrating in the combination expanded cohorts and with one and two milligrams every six weeks in combination with [Inaudible] And we've certainly, also centered on a dose range for botensilimab also, as monotherapy.\n\nSo, we're rapidly building databases with what we think are effective and safe doses, both for monotherapy and combinations. And I think the data speaks for itself in terms of the remarkable clinical activity in these very hard-to-treat cold or I-O-resistant solid tumors.\n\nUnknown speaker\n\nAll right. Thank you. Very helpful.\n\nOperator\n\nMatt Phipps with William Blair. Your line is open.\n\nMatt Phipps -- William Blair and Company -- Analyst\n\nHey, everybody. Thanks for taking my questions and look forward to the event this weekend. In the CRC trial, I noticed the posting on [Inaudible] came up. And maybe, you can just remind us what percentage of patients you expect to be free of liver mets, post chemo.\n\nAnd then, you know, I know liver mets are historically more difficult to treat with immunotherapies broadly. Anything in your pipeline that you guys think could target this population?\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nDr. O'Day, other than the fact that I just want to highlight, we are seeing responses in both liver mets and nonliver mets, although the frequency of responses in the nonliver mets is higher. But further, also, I'd like to draw your attention that treated liver mets , in other words, there are tumors that were in the liver and ablated either with chemotherapy or other surgical means also respond rather well in our trial. Steven, please.\n\nSteven O'Day -- Chief Medical Officer\n\nYeah. Matt, it's a great question. Obviously, liver mets are a dominant feature of colorectal cancer, but there's a significant number of patients that have either never had liver mets because of the patterns of metastasis or have limited disease that is treated. And certainly, we've shown clinical benefit across all comers, including tumor reductions in active liver mets, marked reductions in tumor markers like CEA, and prolonged stable disease.\n\nSo, we think we have clinical benefit across metastatic colorectal cancer. Certainly, the active -- the nonactive liver mets, meaning never had liver mets or had limited treated liver mets are enriched population. That's going to be the focus of our phase 2 trial as we further look at dose and contribution. But we have every intention of looking at all comers.\n\nIn terms of, you know, our pipeline, you know, how do we address. Well, number one, clinicians, both surgeons, radiation therapists, and medical oncologists are -- can be much more active at treating the liver mets in conjunction with systemic therapies that are very active outside the liver. And this has been a limitation of the field. So, that opens up considerably.\n\nAnd in terms of our pipeline, you know, the myeloid compartment is a particular challenge to liver metastases. And in fact, myeloids defend the tumors very well. So, our ILT2 program, as Dhan just said, that's both a myeloid and a lymphoid checkpoint. We're particularly interested in combining that with our portfolio.\n\nAnd we do have plans in our phase 1 ILT2 to add both balstilimab and botensilimabs to our ILT2. So, more to come. But we have every intention of going after difficult-to-treat cancers in both liver and nonactor liver mets with our portfolio.\n\nMatt Phipps -- William Blair and Company -- Analyst\n\nThanks, Dr. O'Day. One other question. On that melanoma trial, can you give us any sense of kind of what it's designed to show? Any thresholds and bars especially between the dosage arms? And I mean, we've seen some data for, you know, Yervoy in a post-PD-1 plus CTLA-4 setting.\n\nJust, I don't know, if you can provide there, O'Day.\n\nSteven O'Day -- Chief Medical Officer\n\nMatt, what disease are we talking about?\n\nMatt Phipps -- William Blair and Company -- Analyst\n\nIn the melanoma trial that you guys open the ACTIVATE?\n\nSteven O'Day -- Chief Medical Officer\n\nYeah, so that's a great question. So, we're obviously -- we've talked a lot about, you know, cold tumors or PD-1 resistant tumors. Melanoma is a good example of a hot tumor where we're going to be exploring a PD-1 resistance setting second line, both in PD-1 resistance, but CTLA-4 naive, obviously, and then PD-1 and CTLA-4 resistance setting. And we have reported responses in our monotherapy to both cohorts of patients previously.\n\nSo, we're looking forward to that. In terms of what we'd expect, well, the nice thing about a second-line melanoma trial with monotherapy of botensilimab is we have clear large data bases of historic response rates. And ipilimumab is essentially a 10% to 15% response rate drug in the second line of PD-1 resistance, but for CTLA-4 naive. So, we have a very clear metric of showing differentiates botensilimab in that setting.\n\nAnd in ipi nivo failure second line, obviously, you'd expect a 0% response rate for a CTLA-4 agent. And obviously -- so we the bar is very low there to show differentiation. But as Garo said early on, we think of this as a CTLA-4 blocker, but as a really a novel innate adaptive activator on the back end through efficacy enhancement. What we're really doing is bringing these APCs to the T cell to develop a more forceful, potent priming and memory response.\n\nAnd so, we think this will be very active both in melanoma hot-like tumors, but also obviously in weak neoantigens, where a more potent priming response is essential.\n\nMatt Phipps -- William Blair and Company -- Analyst\n\nGreat. Thanks, Dr. O'Day.\n\nOperator\n\nMayank Mamtani with B. Riley Securities. Your line is open.\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nGood morning. Thanks for taking our questions and congrats on the progress. So, Dr. O'Day, I'm digging into the SITC abstract here, and also fortunate to compare it against the next generation, CTLA-4 from one of your peers.\n\nIf you can just elaborate on that? Can you talk to the importance of duration of response that you're seeing in your overall cohort and the fact that you're seeing complete responses, including with monotherapy? Could you just touch on why that's important? And then, I have a couple of follow-ups.\n\nSteven O'Day -- Chief Medical Officer\n\nThank you, Mayank. You know, it's a critical question. We're in the business of trying to cure patients with cancer. And CTLA-4, obviously, I was, you know, part of the -- really the revolution with CTLA-4.\n\nIt's primary sort of contribution in my mind were deep responses, particularly evidence of CRs that are durable, that lead to curative therapy. And so, we're, you know -- we're very excited that our molecule, both single agent and in combination, is demonstrating single-agent activity. I think the field is suffering tremendously from the lack of single-agent activity as we look at other targets like three TIGIT and others. And so, you know, I think [Inaudible] of course, were another example of that in melanoma that fell.\n\nSo, we are excited to see single-agent activity, but not just activity, but deep responses that are durable. They really do drive overall survival curves and most importantly for patients, meaningful clinical responses. Obviously, when we combine an active novel, CTLA-4 with PD-1, not only are you driving priming and memory, but you're preventing exhaustion, and our combination studies in cold tumors are particularly reassuring in that regard that we're continuing to see evolving, deepening responses. So, it's critical to the field to demonstrate single-agent activity that's meaningful and then use it as a combinational foundation.\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nGreat. Thank you. And also, I would love to hear how you might be making the decision to pursue pancreatic cancer, but maybe not yet, you know, refactory lung cancer and [Inaudible] You know, you do have these two responses. And I'm just curious what the profile of these patients were.\n\nThe two out of three response rate that we have -- you know, that they have [Inaudible] exposure and -- you know, if it was on CTLA-4 and on PD-1. And then I have one last question.\n\nSteven O'Day -- Chief Medical Officer\n\nYeah. Mayank, what diseases are you speaking of?\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nI mean, you did say that you are moving forward in pancreatic. But, you know, we don't see that data in this abstract. But what we do see is the lung cancer, the refractory lung cancer.\n\nSteven O'Day -- Chief Medical Officer\n\nYeah. So, I think to Garo's earlier points, we are framing and very focused on three very important foundational experiments with our phase 2 programs. One is obviously single-agent activity in melanoma with a reference second line that will be differentiated and powerful. We are seeing obviously this tremendous response and durability in micro stable colorectal, and we have a phase 2 program.\n\nPancreas, we haven't shared all of our data yet in the expanded phase 1, but we have preclinical models showing really a very powerful chemo-botensilimab data. And we have preliminary data in the clinic that's also supportive. So that phase 2 trial will be looking at botensilimab in a randomized phase 2 trial with chemotherapy. So, three separate experiments.\n\nBut having said that, our development program is very thoughtful, is going much deeper than those three programs. And so, you will see more data as we go forward in the next year and develop these plans, and we will certainly reveal those. But we clearly have a lot of opportunity in big markets as the data is showing us. So, more to come on further development plans.\n\nBut we do anticipate starting these trials this year and being very focused.\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nGreat. And my final question was, just remind us what the competitor arm is in the ACTIVATE colorectal phase 2 study. Any thoughts on how that may compare against, you know, the phase 3 LAG-3 PD-1 combination study also running in MSS colorectal So, I'm just curious if there are any design differences to be aware of.\n\nSteven O'Day -- Chief Medical Officer\n\nSo, I'm not going to comment on differences between trials. Our trial is in the second, third-line setting, obviously, in patients who have failed chemotherapy and antibodies, and it will be compared -- there will be a standard of care arm, which in this case is long served for regorafenib of options as a standard of second, third-line therapy.\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nOK. Thanks for taking my question.\n\nOperator\n\n[Operator instructions] There are no further questions at this time. We do have a follow-up question from Chi Wen with Jefferies. Your line is open.\n\nUnknown speaker\n\nYeah, sorry. Just one additional question. Since you are seeing strong response in the ILT2 patients, could you comment on how many lung cancer patients have enrolled so far besides the three that you have disclosed? Thank you.\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nSo, we're not commenting on any specific numbers of patients until the actual presentation.\n\nUnknown speaker\n\nUnderstand that. Thank you.\n\nOperator\n\nI would now like to turn the call back over to our presenters for closing comments.\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nThank you very much, everybody. Thanks again for joining us. We look forward to providing you with some more information in a few days. And please feel free to participate through our webcast, as I said earlier.\n\nOur in-person attendance is closed at this time because of space constraints and the number of inquiries we've had. But we look forward to our future interactions. Thanks again.\n\nOperator\n\n[Operator instructions]\n\nDuration: 0 minutes\n\nNico Frelick -- Investor Relations\n\nGaro Armen -- Chairman and Chief Executive Officer\n\nChristine Klaskin -- Vice President, Finance, and Chief Accounting Officer\n\nDavid Dai -- SMBC Nikko Securities -- Analyst\n\nSteven O'Day -- Chief Medical Officer\n\nDhan Chand -- Scientific Director and Head of Drug Discovery\n\nUnknown speaker\n\nMatt Phipps -- William Blair and Company -- Analyst\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nMore AGEN analysis\n\nAll earnings call transcripts"
}