{
  "companyName": "Altria Group",
  "companyTicker": "MO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/altria-group-mo-q3-2022-earnings-call-transcript/",
  "content": "Altria Group (MO -0.35%)\nQ3 2022 Earnings Call\nOct 27, 2022, 9:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the Altria Group 2022 third quarter and nine months earnings conference call. Today's call is scheduled to last about one hour, including remarks by Altria's management and a Q&A session. [Operator instructions] I would now like to turn the conference over to Mac Livingston, vice president of investor relations for Altria client services. Please, go ahead, sir.\n\nMac Livingston -- Vice President of Investor Relations\n\nThanks, Katie. Good morning, and thank you for joining us. This morning Billy Gifford Altria's CEO; and Sal Mancuso our CFO will discuss Altria's third quarter and first nine months' business results. Earlier today, we issued a press release providing our results.\n\nThe release, presentation, quarterly metrics, and our latest corporate responsibility reports are all available at altria.com. During our call today unless otherwise stated, we're comparing results to the same period in 2021. Our remarks contain forward-looking, and cautionary statements, and projections of future results. Please review the forward-looking and cautionary statements section at the end of today's earnings release for various factors that could cause actual results to differ materially from projections.\n\nFuture dividend payments and share repurchases remain subject to the discretion of Altria's Board. Altria reports its financial results in accordance with US generally accepted accounting principles. Today's call will contain various operating results on both a reported and adjusted basis. Adjusted results exclude special items that affect comparisons with reported results.\n\nDescriptions of these non-GAAP financial measures and reconciliations are included in today's earnings release and on our website at altria.com. Finally, all references in today's remarks to tobacco consumers, or consumers within its specific tobacco category, or segment refer to existing adult tobacco consumers 21 years of age or older. With that, I'll turn the call over to Billy.\n\nBilly Gifford -- Chief Executive Officer\n\nThanks, Matt. Good morning and thank you for joining us. This is an exciting moment on our journey toward moving beyond smoking. Tobacco businesses remained resilient during the first nine months of the year, and we continue to reward shareholders while making investments in pursuit of our vision.\n\nWe have deepened our consumer understanding, enhanced our capabilities, and built a science to support smokers' transition away from cigarettes. The tobacco harm reduction opportunity remains in front of us, and we continue to believe Altria is uniquely positioned to responsibly lead adult smokers to a smoke-free future. Our remarks this morning will focus on our progress today and some exciting steps we have recently taken, that we believe will accelerate our progress toward harm reduction. I will then turn it over to Sal, who will provide further details on our business and financial results.\n\nLet's begin with the heated tobacco category. Last week, we entered into an agreement with Philip Morris International, under which we will receive $2.7 billion in cash in exchange for assigning our exclusive US commercialization rights to the IQOS System at the end of April 2024. We believe this agreement provides us with fair compensation and greater flexibility to allocate resources toward moving beyond smoking. The heated tobacco category is still undeveloped in the US and we believe we can lead in this space supported by our robust infrastructure and deep understanding of the US tobacco consumers.\n\nThis morning, we announced the pursuit of a Global Smoke-free Partnership with JT Group. We signed a non-binding memorandum of understanding with JT, signifying the commitment of both parties toward further smoke-free collaboration. JT is a leading international tobacco company committed to investing, growing, and reducing risk products. We believe that together, Altria and JT can accelerate global harm production by collaborating on all the product development, and global commercialization of smoke-free products.\n\nWe believe this potential collaboration can leverage the strengths and resources of both companies to transition more smokers away from cigarettes. As the first step in this partnership, we announce the formation of Horizon Innovations, a joint venture between Altria and JT for the US commercialization of heated tobacco sticks or HTS products. We believe that HTS products can appeal to certain smokers as they provide a more familiar, tactile, and sensorial experience to cigarettes. Under the terms of the JV, both parties will combine their scientific and regulatory expertise to jointly prepare PMTA filings for the latest version of the Ploom HTS products, which are not yet commercially available.\n\nThe parties expect to file a PMTA in the first half of 2025. Upon authorization, Horizon will become the exclusive entity through which the parties market and commercialize stick products in the US. JTI will supply Ploom Heated Tobacco Stick devices and PM USA will manufacture Marlboro HTS consumables for US commercialization. The parties have agreed to commercialization milestones for Horizon which include distribution requirements and minimal levels of cumulative marketing investment.\n\nUnder the financial terms of the JV, PM USA has a 75% economic interest in Horizon, with JTI having 25%. We're excited about the prospect of introducing the latest version of Ploom HTS products to US smokers. JT has demonstrated success innovating in the heated tobacco space. For example, JT launched Ploom X last year in Japan, and since its introduction.\n\nJT doubled its share of the Japanese HTS segment. JT estimates that there are more than 1 million Ploom X consumers, and according to their research, these consumers perceive Ploom X as a stylish, credible, and unique brand. Consumers also describe the product as easy to use. We look forward to playing the newest version of this exciting product to US smokers.\n\nWe have discussed our increased focus and investment in an internal wholly owned heated tobacco product development. Our approach puts the consumer at the center of everything that we do. We receive more data on their preferences, purchasing patterns, and friction points than we ever have. Additionally, we embedded a rigorous regulatory scientist team early in the process to align our product development efforts with FDA expectations.\n\nWe believe these efforts are building a promising pipeline of wholly owned heated tobacco products and intellectual property consisting of heated tobacco capsules for HTC formats, and new-to-market technologies. We believe capsule products can appeal to smokers who are open to novel smoke-free products but have not yet found a satisfying alternative to cigarettes. This audience includes the millions of US smokers who tried but ultimately rejected e-vapor products. We expect to finalize the design of our first capsule product by the end of this year, and we expect to follow PMTA by the end of 2024.\n\nWe also expect to partner with JT to launch this product in an international test market using JT's sales and distribution network. We plan to share more on this product platform once the design is finalized. We believe moving beyond smoking in the US requires multiple FDA-authorized products within each smoke-free category to appeal to a diverse range of smokers and help them transition away from cigarettes. We believe that our pipeline of heated tobacco products and partnership with JT combined with these internal capabilities I described earlier positions us well to increase the adoption of smoke-free products for the millions of smokers interested in these products.\n\nLet's now move to the e-vapor category. In the third quarter, the total estimated e-vapor volumes declined by 4% versus a year ago and were flat sequentially. We believe the regulatory uncertainty related to JUUL caused market disruptions in the quarter, and we observed a reduction in JUUL purchases throughout the supply chain. We previously disclosed that we have exercised our option to be released from our non-compete obligations related to our JUUL investment.\n\nWhile we retain our 35% economic stake in JUUL, we're exploring all options to build an FDA-authorized portfolio of e-vapor products that will help smokers transition away from cigarettes. For example, our teams are conducting consumer research, performing external scans, and evaluating internal product development options. We're excited about the opportunity to increase our participation in the largest smoke-free category in the US. Turning to oral tobacco, we remain encouraged by the growth of novel oral tobacco products, which grew a share of the total oral tobacco category for the 18th consecutive quarter.\n\nThe category grew 6.5 share points year over year and now represents approximately 23% of the overall oral tobacco category. In the third quarter, on! reported shipment volume increased by nearly 70% to 21 million cans. And on! retail share increased 3/10 sequentially, reaching 5.2 share points of the oral tobacco category in the third quarter. We believe these strong results were driven by increased brand awareness and adoption of on! supported by continued equity and promotional investments.\n\nBuilding on the second quarter launch of the Carry on Brand Equity campaign, Helix recently introduced on! Rewards, a digital program that enables on! consumers to track the rewards balance online, and redeem their points for coupons for other items. We're excited about on!'s continued momentum, increasing brand loyalty, and the opportunity for future growth. Let's now turn to our view of the regulatory environment. We continue to believe that more should be done to advance harm reduction in the US and that the FDA should move more deliberately toward creating a market of authorized smoke-free products to help accelerate smoker transition away from cigarettes.\n\nThe fact remains that today only a small percentage of e-vapor volume has been authorized and no oral nicotine health products have received market authorization. We believe collaboration and accountability from all stakeholders are required for this market transition to take place. We also believe that smoke-free products should serve as an offering for smokers, not an on-ramp for new users. We remain encouraged that youth smoking rates in the US are at the lowest levels ever recorded.\n\nIn fact, the latest monitoring of the future study estimated that in 2021, the combined past 30-day smoking rates among 8th, 10th, and 12th graders was 2.3%, a nearly 92% reduction from its 1997 peak. Additionally, data from the 2022 National Youth Tobacco Survey indicate that while e-vapor usage remains high among middle and high schoolers, the levels were significantly lower than the peak observed in 2019. For the 2022 NYTS survey, 50% of the middle and high school current e-vapor users indicated that they most often use disposable e-cigarettes, such as Puff Bar. Moving forward, we hope to see timely, scientific, and evidence-based determinations on pending PMTA applications across all smoke-free categories and further enforcement on non-compliant manufacturers.\n\nA journey toward responsibly moving beyond smoking continues, and we're optimistic that the actions we have taken to date have strengthened our portfolio in the three major smoke-free categories. We have built a compelling portfolio and the heated tobacco enhanced our ability to compete in e-vapor and continue to strengthen on!'s position and the oral tobacco category. And we believe that we're able to maximize the value of these actions by leveraging our existing scale and infrastructure, such as our manufacturing centers and sales force. For example, our flagship Richmond Manufacturing Center began production of oral nicotine pouches in 2020.\n\nWe now expect to add the production of heated tobacco sticks for our new JV. Our sales and distribution system, driven by a world-class sales force, gives us the ability to responsibly market products in over 200,000 stores. And we have decades of experience navigating a dynamic US regulatory and political environment through the strength of our regulatory and government affairs organizations. These functions together with our many other talented employees give me confidence that we can achieve our vision.\n\nBefore I conclude, I'd like to thank Leo Kiely for his distinguished service to Altria's Board. Leo has served on the board since 2011 and will retire at the completion of his term early next year. I'd also like to welcome Jase Hernandez to our board of directors effective November 1st. Jase brings a significant and deep understanding of the tobacco landscape following his years as an investment analyst covering the tobacco industry.\n\nJase will serve on the finance and innovation committees. I'll now turn it over to Sal to provide more detail on the business environment and our results.\n\nSal Mancuso -- Chief Financial Officer\n\nThanks, Billy. I'd like to begin with a review of the macroeconomic backdrop and its impact on US tobacco consumers. In the third quarter, consumer discretionary income levels remained under pressure as higher gas prices and inflation persisted. However, we saw signs of continued brand loyalty in the tobacco space.\n\nIn September, we conducted research to understand how tobacco consumers were managing their spending in several categories, including tobacco, alcohol, groceries, and household items. Our research indicates that tobacco consumers continue to stick with their preferred tobacco brands at a higher rate compared to other categories when experiencing higher prices. These results were consistent with the results from our previous surveys. We believe, inflation and the rise in gas prices were partially offset for some consumers by a strong job market and wage growth.\n\nOverall, average wages increased 6.9% in the third quarter, compared to an average 8.3% increase in CPI. And for some occupations, including the service industry, wage growth outpaced inflation. We continue to monitor tobacco consumer behaviors and change the marketplace conditions. Despite these macroeconomic challenges, our core business has performed extremely well in the third quarter, underpinned by the strength of our premium brands Marlboro, Copenhagen, and Black & Mild continue to grow profitably, and on!'s momentum and growth reflect its strong positioning in the marketplace.\n\nThis strong business performance combined with fewer shares outstanding drove Altria's adjusted diluted earnings per share results. Altria grew adjusted diluted EPS by 4.9% in the third quarter and by 4% in the first nine months. Turning to our business results, the Smokeable Products segment continued to deliver on its strategy of maximizing profitability in combustibles while appropriately balancing investments in Marlboro with funding the growth of smoke-free products. The segment grew its adjusted operating company's income at 1.8% in the third quarter and by 2.6% in the first nine months.\n\nThe Smokeable Products segment expanded its adjusted OCI margins to 58.9%, an increase of 0.9 percentage points for the third quarter and 1.2 percentage points for the first nine months. This performance was supported by a strong net price realization of 10.2% in the third quarter and 10.3% for the first nine months. I'll remind you that manufacturer price realization does not reflect retail price changes for smokers. For example, Marlboro's price per packet retail increased 6% in the third quarter compared to last year, which was below overall inflation for the quarter.\n\nThe Smokeable segment reported domestic cigarette volumes declined 9.2% in the third quarter and 9% for the first nine months, driven in part by the continued macroeconomic pressures I described. When adjusted for trade, inventory movements, and other factors. Domestic cigarette volumes for the third quarter and first nine months declined by an estimated 10% and 9.5% respectively. At the industry level, we estimate that the adjusted domestic cigarette volumes declined by 8.8% in the third quarter and by 7.5% in the first nine months.\n\nWe believe it's important to analyze cigarette volume trends over the longer term as decline rates in any one period can be influenced by various factors. In fact, Q3, year-to-date adjusted industry cigarette volumes have declined by an average of 4.5% over the past five years. In the third quarter, the total discount segment retail share of the cigarette category increased by 1.6 percentage points versus the year-ago period and 7/10 sequentially reflecting increased competitive activity and the challenging macroeconomic environment. We are encouraged that the discount segment was largely sourced from -- with just 1/10 sequentially and 4/10 versus the year-ago period.\n\nWe are pleased with Marlboro's performance and stability over the long term. In the first quarter of 2020, Marlboro's retail share was 42.5 percentage points. We believe that increased discretionary income, driven in part by government stimulus checks and lower consumer mobility, led to an increase in Marlboro's retail share throughout the pandemic. As consumer mobility returned to pre-pandemic levels and federal stimulus checks ended, Marlboro's share returned to its pre-pandemic levels and has remained stable through the subsequent quarters.\n\nIn fact, since the first quarter of 2020, Marlboro has performed better than many of the other premium brands in the category. As a result, Marlboro continued to grow its share of the premium segment to 58.4%, an increase of 4/10 sequentially and 7/10 versus a year ago. We believe its performance over the long term is a testament to its positioning within the premium segment as an aspirational brand with strong consumer loyalty. In cigars, recorded cigar shipment volume increased by 3.3% in the third quarter.\n\nBlack & Mild, continues its long-standing leadership in the profitable tipped cigar segment, and Middleton continues to provide a strong contribution to the Smokeable segment's financial results. Turning to the oral tobacco products segment, adjusted OCI grew 4.9% in the third quarter, but declined 3.4% for the first nine months, primarily due to higher investments behind on!. We're pleased with the strong overall margins for the segment and excited about on!'s performance in the marketplace. Total reported oral tobacco product segment volume increased by 1.3% for the third quarter and decreased by 1.8% for the first nine months.\n\nWhen adjusted for trade inventory movements in calendar differences, segment volume decreased by an estimated 2% for the third quarter and 1.5% for the first nine months. The oral tobacco product segment retail share declined 1.5 percentage points as declines in MSP were partially offset by the continued growth of on!. Turning to our investment in ABI, we recorded a non-cash pre-tax impairment charge of approximately $2.5 billion for the third quarter in the first nine months of 2022. This impairment reflects the difference between the fair value and carrying value of our investment in ABI as of September 30th.\n\nWe continue to believe that ABI's share price performance is not reflective of its underlying long-term equity value and that ABI's share price will recover. However, we believe that it will take longer than previously expected, as macroeconomic and geopolitical factors may continue to impact foreign exchange rates and ABI's financial results and share price performance in the near term. As we have previously shared, we view our ABI stake as a financial investment in our goals to maximize the long-term value of the investment for our shareholders. We remain committed to creating long-term shareholder value in the pursuit of our vision and our significant capital returns, which we demonstrated in the third quarter by paying approximately $1.6 billion in dividends and raising the dividend 57 times in 53 years, and repurchasing 8.5 million shares totaling $368 million.\n\nWe have approximately $375 million remaining under the currently authorized $3.5 billion share repurchase program, which we expect to complete by the end of this year. Our balance sheet remains strong and as of the end of the third quarter, our debt to EBITDA ratio was 2.1 times. In August, we retired $1.1 billion of notes that came due with available cash. As Billy stated we will receive $2.7 billion as a part of the IQOS agreement.\n\nWe receive $1 billion upon entry into the agreement and will receive the remaining $1.7 billion plus interest by July 2023. Our expected use of the cash proceeds may include investments in pursuit of our vision, debt repayment, share repurchases, or general corporate purposes. Share repurchases depend on marketplace conditions and other factors and remain subject to the discretion of our board of directors. Turning to our financial outlook, we are narrowing our full year 2022 guidance and now expect to deliver adjusted diluted EPS in the range of $4.81 to $4.89.\n\nThis range represents a growth of 4.5% to 6% from a base of $4.61 in 2021. We believe this range allows us the flexibility to react to marketplace conditions. With that, we'll wrap up and Billy and I will be happy to take your questions. While the calls are being compiled, I'll remind you that today's earnings release and our non-GAAP reconciliations are available on altria.com.\n\nWe've also posted our usual quarterly metrics, which include pricing, inventory, and other items. Let's open the question and answer period. Operator, do we have any questions?\n\nOperator\n\nThank you once again. [Operator instructions] We will take questions from the investment community first. Our first question will come from Bonnie Herzog with Goldman Sachs. Your line is now open.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nThank you. Good morning, everyone.\n\nBilly Gifford -- Chief Executive Officer\n\nGood morning, Bonnie.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nA lot going on with a lot of announcements that I wanted to maybe touch on. What you announced this morning related to your JV with JT. I just was hoping, Billy, maybe you can help us better understand the opportunity potential for HTC versus HTS formats and then the target consumers for each. And also I just wanted to verify something.\n\nThe timeline with I think HTC is earlier and it's 100% owned and controlled by you, is that correct?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah. So there's a lot in there, Bonnie. So I'll take them in a reversal of the HTC is 100% owned by us. It is not part of the JV.\n\nI think when you think about HTS and HTC, you've got this huge group of adult smokers looking for products that satisfy their desires and needs. And so you have some that one unfamiliar experience as closest they can get to cigarettes and that's what we believe the HTS product fulfills for them. There are other consumers and a lot of -- as we've pointed out before, a lot of consumers would never try to e-vapor. So they were willing to go with the new novel type of product.\n\nAnd we believe HTC fulfills those desires and needs and we actually see ways for both to be successful. And actually allows us to reach a larger group of consumers that are looking to switch.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nOK. And then just a follow-up on that. How do we think about this potentially changing either your near or long-term growth algorithm? And then, I'm just thinking through it in terms of future investments required, I assume there will be some other than the initial 250 million to develop and ultimately commercialize these products. Could you touch on that?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, I think, look, we're certainly are going to -- as we've said previously, but remember, our overall strategy, even in the Smokeable products categories to maximize our income through time. But to make appropriate investments both in Marlboro and balancing that with investments in the growth areas. So there are always puts and takes. I don't want you to take that all of the investments that we make are completely incremental from the P&L.\n\nWe try to leverage and we try to point out some of that in our remarks this morning. So, for instance, in the manufacturing center where we expanded our production for on! in that facility, the heat sticks for the JV will be produced by the manufacturing center. So there you have the infrastructure in place. You have a strong, talented group of employees that are familiar with one of those machines and you leverage from their investments and you have reallocation across the P&L, but it's not all incremental investment.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nOK. And then just maybe my final question is related to your guidance, which you narrowed down this morning. You narrowed it slightly, I guess, 20 bps at the midpoint. You stated that just to give you more flexibility to react to marketplace conditions.\n\nSo I just wanted to maybe hear from you about what got a little bit worse, or uncertain. Is it the pressures on the consumer or is there something else that we should be mindful of? Thank you.\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, I appreciate the question, Bonnie. I think you could think of most of that narrowing as the passage of time, right? We have more certainty because remember, we're on the line with API and you saw them release results this morning. But certainly, it's no surprise that our consumers are under pressure and we want to maintain that flexibility. But nothing out of the ordinary that I would point out.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nAll right, thanks. I'll pass it on.\n\nOperator\n\nThank you. Our next question will come from Pamela Kaufman with Morgan Stanley. Your line is now open.\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nHi. Good morning.\n\nBilly Gifford -- Chief Executive Officer\n\nGood morning, Pamela.\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nI wanted to follow up on Bonnie's question and ask about how you were thinking about the evolution of the US tobacco market over the next 5 to 10 years. How do you think about the relative size of the e-vapor versus heat-not-burn categories over time? And now that you have greater flexibility to invest in e-vapor, given the non-compete termination with JUUL, and the partnership with JT? How are you going to prioritize your investment between heat-not-burn, and e-vapor?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, it's a great question, Pamela, and I think it's important to remember as you step back, and that's what we tried to highlight in the remarks, that the reduced harm in the US is really undeveloped. And the reason I say that is from an authorization standpoint, taking the two that exist today, e-vapor and novel oral. A very low percentage has been authorized by the FDA in e-vapor, and we believe that's going to go through a period of transition as those authorizations come out and some make it and some get denied. When you move to the novel oral, really no authorizations have been received in that space.\n\nAnd so that, again, depending on how the regulatory body goes about assessing and authorizing those takes, that could be a bit of a transition there. And then in the heated tobacco space, it's really nonexistent. I think when you think about those three categories, we believe the extent of those three categories will really be shaped by three factors. So one I mentioned is the regulatory decisions that are taken in each of the individual categories.\n\nBetween the legislative and tax policy, how does that develop through time related to the individual categories? And then, really through time is the innovation in the spaces that best address the consumer preferences based on what they desire. So that's really what's going to shape the size of the three individual categories. We believe those are the three categories that will grow through time as consumers continue to move away from cigarettes to smoke-free products. As far as prioritizing, we're going to prioritize based on where we see the consumer moving and how we see the consumer moving.\n\nIt's going to be completely consumer-driven and that's why we're excited to be able to leverage the sales force to get the products in the right stores, as well as the amount of data we receive and the insights that we can garner from those.\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nGreat. Thank you. And my second question is on ABI. Do you previously expect the shares to recover and decided to hold onto your investment when your lockup expired? It seems that now you expect this recovery to take longer than expected.\n\nSo how does this impact your thinking around the investment? And does this further extend your plans to hold on to the stake, or increase your willingness to sell it at a lower price?\n\nSal Mancuso -- Chief Financial Officer\n\nGood morning, Pamela. The impairment of the ABI asset and the reduction in our carrying value is really accounting-driven. When you think about whether an impairment is temporary or not, you have to look at the timing of your expected recovery. As far as the ABI asset, as we stated, we view it as a financial investment.\n\nOur focus is to maximize the value for our shareholders. But the share price value is one of many variables that go into that analysis. It's an analysis that we do on an ongoing basis, and we'll continue to focus on what's best for our stakeholders over the long term.\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nAnd maybe I could squeeze one more in. Can you just talk about what you plan to do with the proceeds from the IQOS termination agreement and if there are any e-vapor assets that would be attractive to you to help accelerate your entry into the category? Thanks.\n\nSal Mancuso -- Chief Financial Officer\n\nThanks, Pamela. We mentioned them in our opening remarks, so I don't have a lot to add to that. I mean, obviously, the proceeds provide us with increased flexibility, which is always a good thing. So there's really nothing more to add.\n\nAnd we're going to continue to look at all capital allocation through the lens of what's best for our shareholders, be it investments in our long-term vision, continuing to manage a strong balance sheet, or providing further returns to our shareholders. But again, that's part of our broader capital allocation strategies.\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nThank you.\n\nSal Mancuso -- Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nThank you. Our next question will come from Chris Growe with Stifel. Your line is now open.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nHi. Good morning.\n\nBilly Gifford -- Chief Executive Officer\n\nGood morning, Chris.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nGood morning. I had a question for you. A bit of a follow on to the agreement with JT. Obviously, very encouraging to get you back into that category.\n\nGiven the timeline for the development of your products and obviously the FDA review. Do you have a reasonable timeframe for launching a product in the US? And if I could ask related to that, you have this international capability in terms of launching a product. So should we expect that you are able to develop products to kind of test and learn internationally to refine those for an ultimate PMTA application in the US?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, Chris, thanks for the question. And you're right, we are excited about the opportunities we have in front of us. I think when you think about the timeline for launch, so what we try to provide is when we would anticipate being enabled to file PMTA then it will be dependent on how long it takes the FDA to authorize those products. I believe through time, those authorizations will become more predictable and quicker whether that's the next product that they authorize or it takes a couple of for them to get used to the new categories remains to be seen.\n\nI think when you think about the launch internationally, yeah, we're excited about the potential there for being able to test products in the market in the international realm. We're excited about the ability to act, whether it's in any of the new categories to be able to leverage that. But I don't want to get ahead of myself, we mentioned the memorandum of understanding about future collaboration, and we'll share more when it's appropriate to share.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nAnd just to be clear on that, Billy, would it be -- given your timeline for when you expect the PMTA and for the product you're developing, would it be reasonable to assume we'd see that like next year in the international market being tested at least and then moving to an application in 2024 or I'm getting too far ahead of myself here?\n\nBilly Gifford -- Chief Executive Officer\n\nI'd say you get a little bit ahead of yourself, I think, from an international launch. We tried to say, look when we would anticipate beginning our launch into international markets, maybe your question underlying that is why are you taking so long? And I think it really goes back to what we want to be this disciplined. We want to conduct preliminary studies to certify that we can consistently meet the high standards for product quality that we hold ourselves to, as well as the constituent reductions. And so we're going to go about it in a thoughtful manner.\n\nBut yes, we are excited to get it into an international market and look forward to it.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nOK. And I had a question just in relation to your just part of your guidance, this flexibility to react to current marketplace conditions. And as I look at your business today on the Smokeable side, particularly, you're gaining share in the premium segment. Obviously, premiums losing share though, overall.\n\nSo I guess, I think about where you need to invest, I would be curious, is it in the premium brands inventory category to take back share from the discount? Or is it more on the discount side where you're losing shares, do you want to invest going forward?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, I understand your question, Chris. I really wouldn't look at the narrow guidance as the passage of time. Look, we wanted to make everybody aware that our consumers are under pressure, just like consumers across all industries. And we like the flexibility that's more the range we had maintained for the establishment of the guidance.\n\nI wouldn't point out anything specific, we're very excited about the price realization we've been able to realize being on track for our guidance for the total year and the stability that Marlboro's experienced in the marketplace. I mean, when you look at pre-pandemic to post-pandemic, and Sal mention this in his comments when you saw government stimulus and less mobility in the marketplace, we actually saw it as encouraging. We weren't attempting to gain a share. We were performing the business like we normally do.\n\nIt shows that Marlboro is still the aspirational brand in the cigarette space, and that's what we saw take place during the pandemic. As disposable incomes got a little bit tighter and mobility is up affecting that as well, we see that. We see that some of that share back, but pre-pandemic post-pandemic call it roughly flat, maybe up a 10th, and we're extremely pleased with where we're at.\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nOK. Thank you for your time today.\n\nBilly Gifford -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question will come from Gaurav Jain with Barclays. Your line is now open.\n\nGaurav Jain -- Barclays -- Analyst\n\nHi. Good morning.\n\nBilly Gifford -- Chief Executive Officer\n\nGood morning, Gaurav.\n\nGaurav Jain -- Barclays -- Analyst\n\nHi. So few questions for me. So first is on the oral tobacco pricing this quarter, which was, I think, up 5.5%, and it was flat and managed just 3% last year. And if I look at Copenhagen's pricing, it is still running at the same level of plus 7%.\n\nSo does it mean that you are pulling back on promotions, or are you leaving actually on!'s pricing now that coming up as a part of the portfolio and it has hit maybe some critical market share?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah. Look, we're excited about what on!'s been able to perform, and how it's going to perform in growing the marketplace. Certainly, with the learnings we've had in the other two categories where we have the analytics and the RGM tools that we have in place, we certainly see the opportunity to be able to find that in the new spaces as we gain volume and market share. And so overall, I think from a standpoint of the strategy and the whole space is really to maximize profitability through the long term with the strength of Copenhagen while balancing investments with on!.\n\nAnd I think that's exactly what you see taking place in that space.\n\nGaurav Jain -- Barclays -- Analyst\n\nSure. My second question is on the Logic MDO on menthol e-cigarettes focused and I appreciate it's not your product. But just broadly, like if FDA now goes ahead and starts denying menthol e-cigarettes. Would it make any sense to invest in US e-cigarettes right now because maybe all the menthol e-cigarettes get denied?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, I think it remains to be seen, and that's what we try to highlight for the size of each category. And you highlighted an important one that's in front of the entire industry in all of these faces regulatory decisions that will decide how large the individual categories can be. I would also highlight the other two. It's really legislative and tax policy and how does that mature through time? And then the last would be innovation.\n\nBut I hear you. And that's why we try to highlight those three factors that could ultimately decide the size of each of those categories relative to each other.\n\nGaurav Jain -- Barclays -- Analyst\n\nSure. On the California flavor ban that could happen next quarter. How are you planning to approach that?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah. So we've engaged with our government affairs team. We don't believe the science supports it from a standpoint and we've highlighted that and we've been pretty vocal with that, even with the FDA as they've looked at some of these things. We think those decisions are better based on the FDA where it's science and evidence-based.\n\nBut when you think about the overall category in California, certainly you can have an industry impact, but we, as a reminder SKU non-menthol cigarettes and we SKU non-flavored products and more smokeless space. So again, I think it could have an impact on the industry. The science doesn't support it, but I just wanted to remind you of our positions from an SKU standpoint.\n\nGaurav Jain -- Barclays -- Analyst\n\nSure. And if I could just squeeze the last one on capex, like you reduced the capex guidance slightly. Would you be able to help us understand why that happened?\n\nSal Mancuso -- Chief Financial Officer\n\nCan you repeat that Gaurav?\n\nGaurav Jain -- Barclays -- Analyst\n\nThe capex number, the capex guidance was reduced. So what are the factors driving that?\n\nSal Mancuso -- Chief Financial Officer\n\nYeah, if you think about capital projects core the spending is not necessarily linear, right? The projects are moving along quite well. The year time has passed throughout the year or three quarters through the year. So we just lowered our forecast for spending. So that's more timing.\n\nThe projects remain on track. Of course, there are some delays in the supply chain when you're ordering equipment, but nothing material. We've been able to manage that quite well. So it's not uncommon for fluctuations in the capital forecast as the year progresses.\n\nGaurav Jain -- Barclays -- Analyst\n\nSure. Thank you.\n\nSal Mancuso -- Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nThank you. Our next question will come from Vivien Azer with Cowen. Your line is now open.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nHi. Good morning.\n\nBilly Gifford -- Chief Executive Officer\n\nGood morning, Vivien.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nSo I also wanted to touch on the heat-not-burn, please. I apologize for the lack of imagination on my part, Billy, but when you describe the HTC capsules, it reminds me of the original Ploom innovation that JT launched in 2016 and 2017. Can you expand on how that's different if at all because that didn't really resonate with consumers in Japan? Thanks.\n\nBilly Gifford -- Chief Executive Officer\n\nSure. And I don't want to get too far ahead of myself. We'll come forward with the actual product and I know you'll be excited about it when we're able to bring it forward once we complete the design. If you think about the stick, that's pretty evident because everybody's seen that in the marketplace.\n\nIf you think about the capsule, the tobacco contained within the capsule is different than the technology. You're familiar with the Ploom, but again, I don't want to get too far ahead of myself from a standpoint of describing the device before we're ready.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nOkay, fair enough. But it is different in terms of nicotine flavoring.\n\nBilly Gifford -- Chief Executive Officer\n\nThat is correct.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nOK. Perfect. Thank you. I do look forward to seeing that for sure.\n\nmaybe just pivoting to the Smokeable segment, please. Understanding perfectly well that your objectives are really focused on profit growth. It's hard to ignore the fact that your price gap is now the highest it's been since 2009. And so I'm just curious how you think about operating leverage for that segment.\n\nIf modest market share declines are fine. You're right. Obviously, on a three-year basis, declines haven't gotten that much worse. But, you're two years back and deteriorating on an industry-adjusted basis.\n\nAnd so how do you think about operating leverage in that segment from a volume perspective? Thanks.\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, sure. I think when you look at the price gap, I just want to remind you, Vivien, and I know this, but that the 40% price gap that we disclosed is really a barometer for the national level. We put that out because it allows you all to have a barometer of what we manage at much lower than that, I think you see as the introduction and execution against that analytics and the revenue growth management, most people refer to it as those tools that we have available, allows us to manage the price gap at a much lower level. And so that is, I think, what you're seeing in the success of the model market share through time.\n\nAnd so we're extremely pleased with where we're at. We feel good about the performance of Marlboro and being able to expand the price gap and increase the profitability through time, the way they're done.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nAbsolutely. And that segues though, explains my last question, which is on! the performance of the discount category, it's obvious that deep discount share gains are now reaccelerating. You've articulated, I think, very helpful, the puts and takes in terms of the backdrop of the consumer. But just any updates on how you're thinking about kind of strategically positioning your discount brands against that backdrop? Thanks.\n\nBilly Gifford -- Chief Executive Officer\n\nYeah. And you'll recall Vivien, and we're more premium focused. We participate in a discount because it's important for our retailers to have a portfolio that services all of their customers that visit their stores. But we're premium focused.\n\nWe ship, that we see the channel, and then we felt like we would see sharing and selling them as we increase profitability. But we're pleased with the increased profitability we've experienced on all of them and with the willingness to see some of that sure to deep discounts. You remember our consumers at the lower end of that socioeconomic status. Loyalty is extremely high, over 90% for premium brands.\n\nAnd so you always have that group of consumers when they get under pressure, we're going to shop around and move around depending on what their individual situations are.\n\nVivien Azer -- Cowen and Company -- Analyst\n\nAbsolutely. Thank you so much.\n\nBilly Gifford -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Our next question will come from Carla Cassius with JPMorgan. Your line is now open.\n\nOliver Brotman -- JPMorgan Chase and Company -- Analyst\n\nHi. This is Oliver Brotman on for Carla. Thanks for the question. Just a couple for myself.\n\nWith regards to the announcement made last week on the agreement reached with Philip Morris. Is there any risk to the remaining $1.7 billion that Philip Morris owed, could that value change between now and then?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, with that value, it was an exchange of $2.7 billion. The only thing that would change the $1.7 billion is the interest that would accumulate through time depending on when they made that payment. Exclusivity remains with us until the final payments are made.\n\nOliver Brotman -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you. And then just secondly on JUUL. While the non-compete is no longer in place and you're turning your focus to bearing options to build out the portfolio, you still retain that 35% stake.\n\nIs there a plan longer term that you would maybe do at that stake?\n\nBilly Gifford -- Chief Executive Officer\n\nIdeally no plan at this point, we hold the economic stake. We'll see what their performance is in the marketplace. But we thought it was important at that point in time to get out of the non-compete to open up our flexibility in the e-vapor category.\n\nOliver Brotman -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you so much.\n\nOperator\n\nThank you. Our next question will come from Priya Gupta with Barclays. Your line is now open.\n\nUnknown speaker -- Barclays -- Analyst\n\nHi. Thank you for taking my question. This is Auguste in for Priya. One quick question.\n\nYou have a euro debt maturity early next year. Do you need to have that euro exposure or could you be flexible in refinancing that in US dollars?\n\nSal Mancuso -- Chief Financial Officer\n\nYeah. I don't want to get ahead of ourselves on that maturing debt. So how do we retire that debt and in the process we go through? We'll wait and see. Obviously, we'll do the necessary analytics from a market perspective, and from a capital allocation perspective.\n\nTo your question, though, while we have flexibility on where we could issue debt, we do not necessarily need to have the euro exposure now.\n\nUnknown speaker -- Barclays -- Analyst\n\nThank you. And one last one. What are your thoughts on the relative attractiveness of the US dollar market versus the European market in terms of swap rate?\n\nSal Mancuso -- Chief Financial Officer\n\nWell, obviously FX exchange rates are a factor that goes into that allocation. I don't want to necessarily predetermine which is more attractive, but for us, what's important is to have flexibility in the marketplace. We are fortunate in that we have a strong balance sheet. We've got operating companies that do a tremendous job of converting income to cash.\n\nSo as that comes due, we can refinance or we can think about other methods of retiring the debt. So for us, it is really the flexibility to determine how we want to handle that debt coming due. But also with markets we may or may not want to enter. FX exchange is definitely part of that process, though.\n\nUnknown speaker -- Barclays -- Analyst\n\nThank you.\n\nSal Mancuso -- Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nThank you. Our next question will come from Callum Elliott with Bernstein. Your line is now open.\n\nCallum Elliott -- Bernstein Research -- Analyst\n\nHi. Thank you for the question. I'd like to ask you guys a little bit more about Horizon if that's OK. I guess our sense is it feels like giving away a 25% economic share is a huge amount, given that candidly this is a poorly performing product, a weak number for the brand globally without regulatory approval in the US.\n\nAnd so hoping you can just talk about the drivers behind why you entered this JV, and how you arrived at a 75-25 economic split. It feels just to us and then based on the conversations we've had this morning with investors as well that this is going to be very difficult for this to be economically viable for you.\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, we think about it a bit differently. I mean let me describe. You'll recall when we accrue large volumes across the nicotine space in the US It greatly reduces the decline rate. So if you look over the past five years, declined by about 1%.\n\nWe think it's important to have a portfolio of products in each of these categories and across the categories that attract consumers to them. From a standpoint of being able to participate in those categories and have strong products and brands across those categories, which will be a benefit to volume and attract a larger group of consumers to transition from cigarettes over to the smoke-free space. I think it's important to remember that the JV that's in place is for a product that hasn't even been commercialized yet as they continue to garner learnings and consumer insights and feedback. And so we're extremely excited and we think this is a foundation for future collaboration and potential exposure to international revenue as well.\n\nCallum Elliott -- Bernstein Research -- Analyst\n\nOK. Thanks for that. And I guess it's just one follow-up. Unrelated one, if I get you to talk a little bit about cannabis as well, I think you obviously still have your stake in Cronos, a 1% to expire in a few months because you really are not likely to exercise and given a way out of the money that.\n\nBut more broadly, my question is how you're thinking about the cannabis category has changed over the past three and a half years since you made that investment. And what is on the list of capital allocation priorities today?\n\nBilly Gifford -- Chief Executive Officer\n\nYeah, I think when you think back, we highlighted when we made that investment of cannabis that it was going to be a long-term investment. We still believe it has long-term potential in the US. Certainly with the current political environment doesn't feel imminent that anything will switch in the US. I think the President made an important first step in some departments, but it's the first step and it's a lot more to take place before the industry dynamics change in the US to be able to capitalize on that.\n\nSo we still believe it has long-term potential in the US, but certainly, in the political environment, nothing is imminent.\n\nCallum Elliott -- Bernstein Research -- Analyst\n\nOK. Thank you.\n\nBilly Gifford -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. [Operator instructions] Thank you. At this time, I would now turn the call back over to Billy Gifford for closing remarks.\n\nBilly Gifford -- Chief Executive Officer\n\nYeah. Thank you, Katie. I'd like to conclude our remarks by going back to where I started. We're in an exciting period of Altria's history and have an unprecedented opportunity in moving beyond smoking.\n\nWe expected our actions to lead to a strengthened portfolio across the three major smoke-free categories that will help smokers transition away from cigarettes. In heated tobacco, we believe we have taken a huge step forward with our new joint venture with JT and our internal product development efforts. We now have the ability to compete in the e-vapor category and are already assessing our options in this space. And we have demonstrated progress in the growing novel oral category with on!'s continued growth.\n\nI continue to be confident in my belief that we can achieve our vision and create long-term value for our shareholders. Thank you for joining us and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMac Livingston -- Vice President of Investor Relations\n\nBilly Gifford -- Chief Executive Officer\n\nSal Mancuso -- Chief Financial Officer\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nPamela Kaufman -- Morgan Stanley -- Analyst\n\nChris Growe -- Stifel Financial Corp. -- Analyst\n\nGaurav Jain -- Barclays -- Analyst\n\nVivien Azer -- Cowen and Company -- Analyst\n\nOliver Brotman -- JPMorgan Chase and Company -- Analyst\n\nUnknown speaker -- Barclays -- Analyst\n\nCallum Elliott -- Bernstein Research -- Analyst\n\nMore MO analysis\n\nAll earnings call transcripts"
}