{
  "companyName": "Progressive",
  "companyTicker": "PGR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/progressive-pgr-q3-2022-earnings-call-transcript/",
  "content": "Progressive (PGR -0.65%)\nQ3 2022 Earnings Call\nNov 02, 2022, 9:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to the Progressive Corporation's third quarter investor event. The company will not make detailed comments related to quarterly results in addition to those provided in its quarterly report on Form 10-Q and the letter to shareholders, which have been posted to the company's website. Acting as moderator for the event will be Progressive director of investor relations, Doug Constantine. At this time, I will turn the event over to Mr.\n\nConstantine.\n\nDoug Constantine -- Director, Investor Relations\n\nThank you, Austin, and good morning. Although our quarterly investor relations events often include the presentation on a specific portion of our business, we will instead use the 60 minutes scheduled for today's event for introductory comments by our CEO and a question-and-answer session with members of our leadership team. Questions can only be asked by telephone dial-in participants. The dial-in instructions may be found at investors.progressive.com/events.\n\nAs always, discussions in this event may include forward-looking statements. These statements are based on management's current expectations and are subject to many risks and uncertainties that could cause actual events and results to differ materially from those discussed during today's event. Additional information concerning those risks and uncertainties is available on our annual report on Form 10-K for the year ended December 31, 2021, as supplemented by our 10-Q reports for the first, second and third quarter of 2022, where you will find discussions of the risk factors affecting our businesses, safe harbor statements related to forward-looking statements and other discussions of the challenges we face. Before going to our first question from the conference call line, our CEO, Tricia Griffith will make some introductory comments.\n\nTricia?\n\nTricia Griffith -- Chief Executive Officer\n\nThanks, Doug. Good morning and thank you for joining us today. When our customers interact with us, they're often doing so on their worst day, maybe their vehicles just stall in, maybe they were injured in a car accident or their property damage was analyzed. This fact comes into even sharper focus during major catastrophes such as Hurricane Ian.\n\nWhile watching the footage of devastation, my heart went out to all those who were affected by the storm. For millions, it was truly their worst day. And I'm proud of the part Progressive plays to help people recover from such a calamitous event. Within hours after the storm, Progressive had over 1,500 people ready to help our customers start to rebuild their lives.\n\nAnd while we cannot always replace what was lost, our people are in place to make it as easy as possible for our customers to return to normalcy. Thank you to all the progressive customers who trust us to make their worst day more manageable. In my letter, I shared some of the Herculean efforts that our employees were making on behalf of our customers, and there are many more where that came from. Needless to say, I'm very proud of so many.\n\nWell, Hurricane Ian was the largest single event in the third quarter, it was not the whole story. Excluding catastrophe losses, our third quarter companywide combined ratio improved 1.9 points year-over-year and illustrates the significant work we've done to combat the effects of inflation and working toward achieving our goal of an underwriting margin of at least 4%, specifically in personal auto. As we stated after the first quarter, with the exception of a few markets, our major personal auto rate revisions are behind us, so we continue to be vigilant and adjust rates as our loss experience develops. In the third quarter, we increased personal auto rates in 20 states at an average of about 5% per day for a total countrywide premium impact of plus 2%.\n\nThe third quarter rate action brings our countrywide year-to-date rate increases to nearly 12%. We continue to closely monitor frequency and severity trends to ensure we stay true to our stated goal of profit before growth. So we have continued to take rate. We believe we took rate earlier than the industry, which initially negatively impacted volume, but more recently has created opportunities for growth.\n\nConsumer shopping and quoting has increased more than 20% in both the agency and direct channels. In fact, in both channels, we had the best July, August and September in our company's history for quote volume. This prospect growth is despite a lower acquisition expense ratio as compared to 2021, allowing us to be a beneficiary as competitors have pulled back on marketing spend. This combination of lower competitor spend and our continued advancement of the science of media planning and buying led to an incredible increase in efficiency in our media spend and has helped propel this quarter's growth.\n\nAuto quote growth, coupled with continued improvement in conversion as our competitors raised rates led to auto new application growth of 20% in the quarter including the highest August and highest September combined to channel new application volume that we've seen in the company's history. Total personal auto year-over-year PIF growth is still negative, but we've now seen several months of sequential monthly PIF growth led by the growth in the direct channel and flattening in the agency channel. The sequential growth has been bolstered not only by new application growth, but signs of improving retention. In last quarter's call, we spent considerable time talking about our property business and efforts we are taking to return to profitable growth.\n\nThe losses incurred from Hurricane Ian further highlight the need to shift our mix to less volatile state. As expected, PIF growth in properties slowed in the quarter as we make progress in this multiyear goal. Our assets continue unabated with rate and non-rate actions as we work toward a mix that is more reflective of the market. Given this volatile backdrop, it's only natural that the insurance industry would be facing questions regarding capital.\n\nSo we thought it would be useful to quickly summarize our strong capital position. As discussed in our annual report, we view our capital position as consisting of multiple layers. First, our insurance operating subsidiaries, we maintain adequate surplus to support growing as fast as we can at or below a 96 combined ratio. Our extreme contingency layer includes capital in excess of regulatory capital that ensures on a model basis, a less than 100 and 200 probability that we will need to raise additional capital.\n\nWe have $4.2 billion that we held at quarter and in a noninsurance subsidiary of the holding company level, which is well access of that contingency layer and is highly liquid due to mostly being comprised of short-term securities and treasuries. While we have incurred temporary losses in our investment portfolio due to the significant move in interest rates, our fixed portfolio is extremely conservative with over half of the portfolio in cash or treasuries and a portfolio duration at the end of the quarter at 2.7 years. Throughout the year, we have taken proactive measures to prepare the portfolio for various scenarios by reducing interest rate, credit, and equity risk. Another proactive measure we took was to raise $1.5 billion of 5, 10- and 30-year debt in March at an average 3% interest rate.\n\nDue to the highly uncertain outlook, we felt it was prudent to have extra capital at what we viewed as very attractive borrowing rates. As we sit, we have no near-term bond maturities that we have to address in this higher interest rate environment, the combination of the borrowing, along with significant increase in interest rates have been the primary drivers in moving our debt to total capital ratio over 30% at September month end to 30.2%. We expect underwriting gains, changes in the value of our bond portfolio as bonds approach maturity and investment income to bring us back below 30% in time. We are currently taking no additional actions to bring the ratio below 30% and have no near-term plan or need for raising further capital.\n\nAgain, thank you for joining us, and now we'll take your questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Elyse Greenspan from Wells Fargo. Elyse, please proceed.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nHi. Thanks. Good morning. My first question is on loss adjustment expenses.\n\nI know you guys had called them out in reference to your property book in September and not in reference to the auto book. I'm just trying to get a sense and there were some comments in the queue. It doesn't seem like LAE is a high component of auto losses. And the reason I ask is it does look like the underlying loss ratio did trend higher in September, and that does run a little counter to some of your comments, right, that it seems like you're at where you need from a rating perspective in the majority of states.\n\nSo I'm hoping you can just help me kind of tie that together.\n\nTricia Griffith -- Chief Executive Officer\n\nYes, absolutely. Let me start, Elyse, with the LAE. So when you think about vehicles, which I would include auto and special lines, there's not much incremental LAE when a catastrophe happens. So for years and years, we built up a CAT team and it's now commensurate to the size that we are.\n\nSo when a CAT happens, really, the incremental LAE on that part is travel costs, hotel costs, etc. And then during the year, those people are able to do other things. So as an example, in Ian, right now, they're in Florida, working those files. But then as that slows down, if there aren't other weather-related events or catastrophes, they might go work in the salvage department to work through that salvage.\n\nSo it's not hugely incremental. We called it out on the property side because that is a little bit more incremental on that $25 million million of the $200 million of the reinsurance. And that was because we do use some independent appraisers adjusters to help with the property claim. So that's the reason why we called it out.\n\nAnd that will evolve. We wanted to assess a certain point for Al, at a certain point for loss and that it will evolve as the storm developed. In terms of where we're at, I do feel very comfortable. Like I said, in most markets, there are a few that we don't have the rate we need.\n\nAnd we're going to continue to take smaller bites of the apple, which is what we prefer to do, and that's why I wanted to outline that in my letter and opening comments. But here's how I would think about where we're at the perspective of adequate rates. And this is a very high level. So you would have to think about this in terms of new versus renewal, channel, etc.\n\nSo our frequency is down 9%, our severity is up 13% in aggregate. So think about a 4% net loss ratio. Our average written premium is up 8%. So you want to think of that, we have about 6.5 points to earn in.\n\nSo when I think about that, I feel good about where we're at again. We're watching inflation very closely. But we do feel I'm confident that in most venues, we have the rate we need to grow, and we'll try to propel that growth where we can and slow where we don't believe our rates are adequate. Does that help?\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nYes. But as a follow-up to that, was there something in September just because the underlying loss ratio did look like not that it only trended up from August, but it trended up from last September. So was there something just related to losses running hot in September relative to last year?\n\nTricia Griffith -- Chief Executive Officer\n\nNothing in particular, and this is the curse of releasing monthly earnings. I wouldn't look into one month and put much into that. So now.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nOK. And then my second question, as we think about getting to the end of the year, and I know you guys mentioned this in your Q as well, we hear about used car prices coming down, and I know that was what started to lead to the elevated severity last year. Have you guys ever broken out what component of your loss costs are driven off of used car prices? Or can you just help us think through that? And the benefit that you guys could see as those values come down?\n\nTricia Griffith -- Chief Executive Officer\n\nWell, we look at the components. But what I would say is, although the wholesale prices are trending down, they're still at all-time high. So we will continue to watch that. And I think especially, we will watch it based on the fact that there are a lot of total losses that have happened in Florida with Hurricane Ian so that could even increase demand.\n\nSo we try to break out as much as we can. When we look at severity we look more at overall loss cost in terms of values of vehicles, labor rates, parts, prices, rental products, etc. So there's a lot of components that go into that. But we're going to wait and see and continue to watch the Manheim Index and watch what happens after Ian, and we'll see that in our severity trends.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nOK. Thank you for the color.\n\nOperator\n\nOur next question is with Michael Phillips from Morgan Stanley. Michael, your line is open.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nThanks. Morning. Trisha, I wonder if you could peel back some of the layers on the frequency, still favorable in fact, looks against even more so than prior quarters. I guess can you talk about what you're seeing in your book for maybe work from home trends and sustainability of that? And kind of what you're baking into current pricing for how much you're baking on that to continue in your current price levels? Thanks.\n\nTricia Griffith -- Chief Executive Officer\n\nSure, Michael. So in quarter 3 with our snapshot data, we saw vehicle miles traveled down about 11%. Previously, it was down about 14%. What we're seeing is commute miles have stayed flat.\n\nAnd during the quarter, we saw that Travel miles. So think of those defined as can from your home, 100 miles to or from your home. So we think that might have been based on some lower gas prices, people were doing some last-minute travel because of those prices in their cars during before Labor Day, visiting grandma or whatever. And that usually involves less losses.\n\nSo come it's more congestion, you're going to have more losses. So we think about it that way. I don't think we'll know where frequency sort of trend long term. until probably a quarter or two because I know a lot of companies said they were returning to work after Labor Day.\n\nSo you're thinking in September. So what we'd like to do is wait at least a couple of quarters to see if that sort of bottomed out and look at that pre-pandemic to 2019. And then we'll feel, I think, a little bit more confident because I know a lot of companies have gone back and forth on how often their employees need to work. And I think a lot of it will depend too on COVID and flu, etc.\n\nSo we're going to wait a few quarters, but that's what we're seeing right now in our UBI data.\n\nJohn Sauerland -- Chief Financial Officer\n\nOK. And one clarification to that. So Tricia mentioned frequency or vehicle miles traveled was down 11% that was referencing the pre-pandemic period. So when we think about vehicle mile travel, we continue to measure it relative to pre-COVID interestingly, frequency is down a bit more than vehicle miles traveled, and that's continued for quite some time, has not yet come back.\n\nAnd we believe to Tricia's comments that, that is due to some degree, to the mix of miles for travel.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nYes. Perfect. OK. I guess can you talk about used car prices coming down and how that impacts, I guess, the mix of your strategy of kind of either fixing cars versus salvaging cars and how that -- I don't know if you talked about the impact of that last year when there was just a reverse of that when our prices were so high.\n\nSo any impact of -- what's the impact of that on the loss ratio last year of changing the strategy because of how high prices were and how that might change as we go forward from here?\n\nTricia Griffith -- Chief Executive Officer\n\nWell, I don't know that we changed the strategy. It just happened to be that cars were more expensive, so it took more to total them. And then we did total them, part -- components were more expenses. So we'll always look at the actual cash value of the vehicle and then the cost repair, which could take into account rental, etc.\n\nSo that's how we always look at it. And then you overlay the actual cost of the cars, whether new or used when you make those assessments.\n\nJohn Sauerland -- Chief Financial Officer\n\nJust a little more clarification on that sense since Lisa had a similar question. When we think about the increase in severity for physical damage coverages, so property damage, collision, etc., walking around numbers, about half of that increase is from the increase in used car values. That is both when we total a car, but as Tricia was mentioning, you total fewer cars because the car is worth more. So your estimates on repairs are going to go up as a result of used car prices as well.\n\nSo it's a little tough to tease out, but sort of walking around is probably half of the severity increases we've seen, physical damage coverages are due to the increase in values.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nGreat point. All right. Thank you.\n\nJohn Sauerland -- Chief Financial Officer\n\nThanks, Michael.\n\nOperator\n\nOur next question is with Mike Zaremski from BMO. Mike, your line is open.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nHey. Great. Good morning. Sticking to the auto severity side of the equation, lots of good color so far, maybe curious if you could offer any color and whether there's any trends you're seeing on the bodily and reside or maybe just severity ex kind of used car prices more broadly?\n\nTricia Griffith -- Chief Executive Officer\n\nSo on the bodily injury side, Mike?\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nCorrect.\n\nTricia Griffith -- Chief Executive Officer\n\nYes. We've actually seen the bodily injury has been fairly stable in the kind of 6% to 8% range. And of course, it went up after the pandemic, that was based on more attorney representation, more soft tissue attorney representation, not necessarily litigation and then just the overall social inflation. But we're seeing that level out in the 6% to 8% range.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nAnd that's kind of considered kind of a more normal range when you think about versus pre-pandemic levels, there's kind of no secular trend or something that we should be thinking about moving around there materially?\n\nTricia Griffith -- Chief Executive Officer\n\nYes. I mean it's hard to say because during the pandemic, there was little or none, and then I think it went up pretty significantly. So yes, I think that would be accurate to say in that range of pre-pandemic.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nOK. I guess just going back to frequency again, just curious, you guys are now able to give us some great stats on vehicle miles traveled and what you're seeing commuter versus maybe non-commuter trips? And kind of just curious, does the data you have today, does it allow Progressive to be any more agile? Or do you guys do things definitely when setting rates today versus maybe when you think back to the 2016, '17 frequency spike cycle that you feel you can take advantage or be more opportunistic? Or is it still kind of nothing has changed much? It's very tough to figure out frequency and I'm thinking too much about this?\n\nTricia Griffith -- Chief Executive Officer\n\nNo, I think you're thinking -- well, we're thinking about it all the time. The hard part is there's so many macroeconomic trends that affects frequency. You saw that with gas prices. And so I think there's a lot of things that we constantly look at in our models.\n\nI think the best thing when we think of pricing for our customers is to encourage them to use snapshot. And that's us a big approach for people who want to be able to save money, especially if they are not driving. So we've seen an uptick in the take rate and our mix of business, new business in UBI. And we think that's great because if consumers cars are sitting in their garages more often than not, they should get a discount as long as when they're driving that they're driving safely.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nAnd are those Snapshot customers, just as my final follow-up, slightly more profitable over time than the non-Snapshot customers? Thanks.\n\nTricia Griffith -- Chief Executive Officer\n\nYes. No, not necessarily.\n\nJohn Sauerland -- Chief Financial Officer\n\nWe continue to price as accurately as we can with the data we have. So as our snapshot database continues to grow and we move to a continuous monitoring model, we have an increasing data set to work with and an ongoing data set to work with because we have continuous monitoring. And I think in eight states now and are continuing to roll that across the country. Early on with Snapshot, we weren't pricing completely to the curve, if you will.\n\nAnd as consumer adoption, as Tricia noted, has gotten to be really good and growing. We've been more and more comfortable with pricing to the full curve, which is the best accurate segmentation we can get.\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is with Alex Scott from Goldman Sachs. Alex, your line is open.\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nHi. Question I had was just on the strategy of pivot into growth and pricing. When I think about the timing of when you all sort of looked at it and decided that you could take maybe the foot off the accelerator on price a little bit feeling better about your adequacy. Since that time, there's been some benefit from gas prices and frequency that may go away.\n\nAnd there's also I think, been increases to sort of the non-used car pieces of severity and medical costs and wage inflation sort of impacting things is being able to stick to that and try to drive growth here. I mean is there a risk that those things force you to change course? I mean, how should I think about that risk of sort of different severity items and getting a little worse since you started down that road on the strategy?\n\nTricia Griffith -- Chief Executive Officer\n\nYes. We have had a long-term strategy to grow as fast as we can at/or below a 96 combined ratio. That will continue. That's something that's worked for us 85 years or at least since we went public in 1971, we first started talking about the 96.\n\nSo we will do that. watch trends very, very diligently and take actions quickly when -- and decisively when we need to. Unfortunately, in this last year we've had to take rate increases that we normally do to take. We don't like to take huge rate increases unlike we have.\n\nLike we talk about smaller bites of the apple, which we believe we're now in a position to take as things change in each venue. So our strategy hasn't changed. We're going to try to grow as fast as we can. Obviously, with the hurricane, we have a few months to go, and we're going to continue to try to leverage this really unique opportunity to get growth while still maintaining our 96 combined ratio.\n\nIn fact, in September, we had our lowest cost per sale since 2017. So we're seeing really the advantage of the -- because our competitors aren't advertising as much and are taking rate we're seeing some really great ambient growth. So we're going to try to pull all the levers to do that to grow as fast as we can, but we do have the 96 that we believe we always talk about profit over growth.\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nGot it. That's helpful. And could you help us frame the potential impact from higher reinsurance costs as we think through a hard market in reinsurance? And I guess, probably impacts you more on the property side. And just looking through some of the commentary on your, how quickly you can nonrenew and sort of do some of the pivoting that you wanted to do.\n\nIt sounds like some of that's had to slow down for regulatory reasons. What does that all mean when we think through reinsurance cost potentially going up?\n\nTricia Griffith -- Chief Executive Officer\n\nI'll have Dave talk about reinsurance, but I'll hit on the sort of de-risking the book. I will say that reinsurance costs, we are able to pass on, so that is one benefit. But clearly, that market is hardening. So we talked about our goal of derisking the portfolio, specifically moving 60,000 policies out of Florida, homes out of Florida sort of mitigate that risk.\n\nIt takes a while. So we talked about that last year. We had a 90-day notification period to our customers. So in earnest, we started non-renewing those 60,000 in May of 2022.\n\nAnd then there was a special legislative session, and there was a Senate bill that allows homeowners to renew their policy as long as they could prove through inspection that they had at least five years of useful life left on their roof, which is great because that's OK with us, and at least we know the rate to risk when we know how old the roof is. So we knew that there would be less than 60,000 policies and it would take a little bit longer. And then, of course, enter Hurricane Ian, and there's been a moratorium on non rennews and cancellations from September 28 to November 28 so we won't be able to not renew any. Until after that is lifted, those executive orders are lifted.\n\nSo suffice it to say that it's going to take us a little bit longer to derisk and we get that, and we'll continue to update everyone as that happens. I will say that we are not open for new business in A3, DPI or 06, so home, dwelling fire and condo, and we will not be open for new business until the executive order is lifted. The only caveat is we have some new homes with a select group of builders, brand-new homes that we will be working with them so they can close and have insurance on their home. So I think the punchline is it's a volatile environment but we remain focused on achieving our goal and having our portfolio of homes across the country and not based on all the risky areas.\n\nSo Dave, do you want to add anything on the reinsurance.\n\nDave Pratt -- General Manager, Property Insurance\n\nSure, Tricia. Thank you. Good morning, everyone. I would just note that we have a long, continuous stable trading relationships with lots of big reinsurance providers.\n\nAnd we try to be very transparent with them about our results and our business plans. And so we feel confident that we'll continue to have access to the reinsurance that we need. And we believe that we get favorable pricing based on that transparency. It does seem likely that costs will go up next year, and we will pass those through in our rate filings as quickly as we can to make sure they're accurately reflected in our prices.\n\nJohn Sauerland -- Chief Financial Officer\n\nI'd also add add that if you have some multiyear agreements. So our entire program is normally not up for renewal in any given year, which helps us mitigate the impact of increases and allows us to better put those increases into our primary prices. We do also use some insurance-linked securities, if you will, so cap bonds. So we're trying to diversify our reinsurance and catastrophe coverage program both for time and for the instruments we use to ensure that we are stable as possible.\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nOK. Got it. Thank you.\n\nJohn Sauerland -- Chief Financial Officer\n\nThanks, Alex.\n\nOperator\n\nOur next question is from Greg Peters from Raymond James. Greg, your line is open.\n\nGreg Peters -- Raymond James -- Analyst\n\nGood morning. I guess I'd like to pivot for the first question on the Commercial Lines results. And I know in your letter, you called out the unusual items with the TNC policies that affected the third quarter results. And then you said the net would have been up around 2%, excluding all the noise.\n\nAnd that certainly doesn't seem to be growing as fast as you can, considering your combined ratio is below 96. So in the letter, you mentioned the bot policies, some of the other initiatives. Can you sort of map out how you think growth is going to emerge in that business? Because it seems like it's slowing down, not speeding up.\n\nTricia Griffith -- Chief Executive Officer\n\nYes. I can map out sort of what's happened and how we're positioned for the future. So we had such an opportunity in our four higher trucking business markets here when the pandemic happened. So many people, as I'm sure you did, you're having lots of good ships.\n\nSo obviously, you had the trucking industry grew, and it grew in different ways. So we had spot rates are up. So a lot of owner-operators would leave from a carrier and go on their own to be able to make it on their own. We were there for them.\n\nWe were there at the right rate, and we had a history of this customer. So it's a really beautiful growth. So even when you look at that 2%, you've got to look at the denominator because the last couple of years have been unbelievably successful in commercial lines. So now that spot rates have gone down a little bit and softened, some of those carriers are going -- some of those owner operators are going back to carriers, we do have a couple coverages, non-trucker liability and GL where we can keep those pits when they're away from doing business with the carrier that they're part of.\n\nSo we think we'll continue to grow. So that's more of a retention piece. What I would say is the opportunity that we have is because we're so diversified in commercial. So think of -- a few years ago, we only wrote or fewer power units.\n\nNow we went to 40 and then of course, we purchased Protective, which could give us an opportunity to be able to ensure some of those medium to large fleets. So we feel really good about our position there. And of course, Smart we have in nearly 40 states, I think, 37, and that will continue to grow. Those are things we invested in three-plus years ago because we know that this the commercial lines is very cyclical and very linked to macroeconomic trends.\n\nSo although the growth is smaller on a percentage basis, we've grown tremendously in commercial lines. We have a tremendous plan laid out a 10-year plan Karen herd your team have laid out to continue to grow and continue to diversify to make sure that we're able to be there when a different economic shift happens.\n\nGreg Peters -- Raymond James -- Analyst\n\nOK. I appreciate the detail there. I guess I'm going to pivot for my second question. in your letter, you talked about evaluating underwriting restriction bill plans, media spend, and this is going to be focused on the expense ratio and the personal lines business.\n\nYou said in your comments that you're looking at frequency and those type of trends pre-pandemic. So if I look at your expense ratio, pre-pandemic, like the 2019-point in time, and compared to where it is today. Today, it's a lot lower. I guess as you consider ramping up your growth plans in auto, is it conceivable that the expense ratio will start trending back up as you spend more on advertising, etc.? And should we look at the 2019 sort of the base here for where the expense ratio might go to?\n\nTricia Griffith -- Chief Executive Officer\n\nYes, it's very conceivable. So we look at expense ratio with the regular expenses and non-acquisition expense ratios. We will spend -- given the takeaway for a moment, we will spend as much as we can as long as we believe it's efficient. So while our expense ratio is lower now, like I said, we're really bullish on growth for this quarter because of what we being in the ambient shopping and just the environment based on our competitors' spending and our competitors' rates.\n\nSo yes, you could see it go up if we continue to spend in advertising. I will say that we're any looking at our plan on both loss or expense ratio and LAE to make sure we can continue to be efficient because we do want to spend more in the acquisition funnel. So yes, you could see it go up a little bit as we determine what the right spend is. And of course, we have the 96 governor, so that is going into play a little bit right now.\n\nGreg Peters -- Raymond James -- Analyst\n\nGot it. Thanks for the color.\n\nOperator\n\nOur next question is with David Motemaden from Evercore ISI. David? David, your line is open.\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nThanks. Good morning, Tricia. Last quarter, you said that you don't have local media ad spend on in 19 states. And I think that compared to 26 states as of the end of April.\n\nI was wondering if you could share where that stands today? How many states do not have local media on at this point in time? And maybe some color around how much in premium those states represent?\n\nTricia Griffith -- Chief Executive Officer\n\nI'll let Pat take that. I'm not sure of the exact number. I believe it's less than 17 though, but I'm not sure exactly. Again, we look at that just based on our ability to grow and our ability to get the right rate.\n\nSo in the states where we can't get rate, obviously, we'll continue to make sure that we do everything we can not to grow. Some we're just waiting for the rates to earn in, and we'll start to loosen up those underwriting guidelines and the local media spend. Pat, do you want to add anything?\n\nPat Callahan -- President, Personal Lines\n\nYes, without sharing kind of number of states because your question about percent of premium is kind of the most relevant piece. The other piece that's complex is we say local media, but there's seven different elements of local media, whether it's digital, paid social, direct mail, lots of things going on in that space. I think what's important is to get back to Tricia's comment about we will spend when we can afford to spend based on the calendar year targets when the spend is efficient relative to lifetime performance on the media and frankly, when we need to spend to drive growth. And that's where it's pretty dynamic at the channel level and ultimately the split within local media where we decide to spend versus not spend.\n\nSo right now, we have some states a couple of big ones on the coast where we don't yet have adequate rates on the street, and we're optimizing, obviously, the efficiency of our expenses there given our loss ratios are high because we can't get the rate that we need under the expected losses. So what I would say is it's dynamic, and we make adjustments all the time. And as soon as we get adequate rate, we are open for business. And increasingly, we are getting adequate rates in some additional states.\n\nIt's just taking longer than we had expected to previously.\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nGot it. That's helpful. And also, Tricia, it was great to get the color just on the capital position and the debt to capital. I guess I'm wondering if you could help us think about how we should think about the variable dividend level this year? And just sort of as you guys think about the growth opportunity that's in front of you, how you're sort of thinking about that?\n\nTricia Griffith -- Chief Executive Officer\n\nYes, absolutely. So the primary -- the best use, I should say, of our capital is to grow the firm. And that's what we're going to try to do, especially like we said in this unique environment. So we have this conversation every time we meet with the Board, we'll be with them again in December.\n\nAnd if we don't believe we can grow, of course, we give it back in either dividends or stock buybacks, we -- at this juncture, I can't say whether or not we'll have a variable dividend that will ultimately be the board's decision. I will tell you that I want to take advantage and leverage this opportunity to grow the firm.\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nRight. Thank you.\n\nTricia Griffith -- Chief Executive Officer\n\nGreat. Thank you. Good morning.\n\nOperator\n\nOur next question is with Gary Ransom from Dowling Partners. Gary, your line is open.\n\nGary Ransom -- Dowling and Partners -- Analyst\n\nGood morning. I wanted to go revisit the frequency question. Just looking at the actual disclosures in the Q where we have frequency down broadly 9%. That's year-over-year, not pre-pandemic.\n\nAnd when I think about the broader environment, that's actually counterintuitive to me because I'm thinking about the economy still being a little bit closed down a year ago. And frequency, probably I would expect it to be increasing. And in fact, when I look at available industry data, it is increasing at least through six months. And so you seem to be moving in a different direction than I might have expected.\n\nAnd I wondered if you can add some color or possible reasons for why that might be happening?\n\nTricia Griffith -- Chief Executive Officer\n\nYes. And the nine was for the quarter. We're down much more in frequency, if you look at the trailing 12 versus the trailing 13 to 24, down more like in the 2% range. So I can't comment on how other people look at frequency, but we are down lower if you look at the time frame I just outlined.\n\nDo you want to have anything, John?\n\nJohn Sauerland -- Chief Financial Officer\n\nSure. Yes. We have done a lot to move to ensure we have profitable business coming in the door. So when you do that, you're going to first seek to apply underwriting efforts against the highest frequency business likely that is producing the highest loss ratios.\n\nAs Pat Calian mentioned, we've also had some challenges getting price in some very large markets that have fairly high frequency as states. So in aggregate, I get your perspective, and we've noted the same but recognize that there's a lot going on with the mix of our business due to where we've been growing or shrinking, both geographically and at the segment level that is going to drive that number as well.\n\nGary Ransom -- Dowling and Partners -- Analyst\n\nAll right. That's helpful. Actually, that's a fairly positive statement on what you've been able to do versus what the rest of the industry is doing. But anyway, I had another question on Snapshot, too.\n\nI noticed in the Q. It looked like there was an uptick in the attach rate for Snapshot, particularly in Direct. And I wondered whether there was something you were doing. Is that part of the advertising? And maybe you just have some general comments about the acceptance of that product in the market.\n\nTricia Griffith -- Chief Executive Officer\n\nYes. I'll add some general comments and then Pat, if you want to add anything. We have seen an uptick in new business for Snapshot is now in the low 30% range. The biggest of tickets in direct, we have about 45% of our new business using Snapshot.\n\nAnd of course, John talked about our continuous model, which we have. I think you said, hey, I'm not sure if which is about 11% earned premium. So we're excited about that to continue to gather data. In the continuous model, we have a deeper flat discount for participation and then steeper either factors from maximum discount and surcharge.\n\nSo I don't know if that's a big factor, but we do believe people see this as something where they can control part of their insurance cost, and we're pretty excited about it. Pat, do you want to add anything?\n\nPat Callahan -- President, Personal Lines\n\nYes. I would just echo the continuous evolution of the experience that we build around Snapshot to make it easier for consumers to find understand their savings and then enroll in the program, both in the direct channel -- in the two-stage distribution through agents because obviously getting agents on board that this is a good thing for their clients is important. We think part of it is process. So on the direct side, we've been continuing to improve the experience and invest there and have seen some recent wins in how we present the offer that's been helping.\n\nBut we also think there's some macroeconomic things going on, right? When there's an inflationary environment, consumers are squeezed and they get a rate increase from their current carrier when shopping they want to save money, and we believe Snapshot is not only a personalized way to save money but to get rewarded for safe driving behavior. And we think that's resonating with a greater number of consumers and the agents who sell our products over time.\n\nGary Ransom -- Dowling and Partners -- Analyst\n\nIs the attach rate or you said 45% for direct? Is there a similar number that you're willing to give on the agent at this point?\n\nTricia Griffith -- Chief Executive Officer\n\nNo, it's increasing somewhat, especially from pre-pandemic. Like Pat said, it's a little bit more difficult to -- we're really encouraging agents to use this as one of the many variables to make sure we give our combined customers the best rates if their driving behavior warrants the same.\n\nGary Ransom -- Dowling and Partners -- Analyst\n\nAll right. Thank you very much.\n\nTricia Griffith -- Chief Executive Officer\n\nThanks, Gary.\n\nOperator\n\nOur next question is with Josh Shanker from Bank of America. Josh, your line is open.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Thank you. Yes. As we head into 2023, I'm no health insurance expert, but it seems to me that Medicare and a lot of the health insurers, they set their rates earlier in the year.\n\nAnd while inflationary costs are built in right now, it may not be in the health insurance costs, which could mean we could see some severity increase on the bodily injury side next year. One, I want to know if there's any truth in how I'm thinking about this. And two, given the duration of liabilities in your portfolio, what is the impact that might have on next year's results?\n\nTricia Griffith -- Chief Executive Officer\n\nWhat I would say from that perspective, obviously, we watch the cost that we incur for ours bodily injury, but we also have inflation built into our reserving. So we build that in based on a lot of data and including what's happening in the healthcare. So those So we build that in based on a lot of data and including what's happening in healthcare. So those inflationary percentages are built in based on what's going on in the overall healthcare industry.\n\nJohn Sauerland -- Chief Financial Officer\n\nYes, the set those inflation factors in our reserves, the product managers who are pricing at the state level will be reflecting those in their prices as well. And I think it's a valid concern. It's something we are watching. And certainly, to the extent we see medical inflation rate picking up, we will be dialing that into our prices as soon as we can.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nAnd in terms of your experience with distracted driving knowledge, where are we at the sort of trends we saw got emerging from the pandemic, is the extent which people are looking at their phones when they're driving or hard braking, do we see changes in that from where we've been over the last 12 or 18 months?\n\nTricia Griffith -- Chief Executive Officer\n\nI can't speak specifically to distracted driving. I think we've reached those sort of levels of ties have leveled off. They had an increase, I think right win. There was less driving people.\n\nspeeds were higher fatality. I think that's starting to level off. That might be the fact that there's more congestion because there are more people going back to work, but I couldn't adequately give you specific number on that.\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nOK. I appreciate the answers. Thank you.\n\nTricia Griffith -- Chief Executive Officer\n\nThanks, Josh.\n\nOperator\n\nOur next question is from Andrew Kligerman from Credit Suisse. Andrew, your line is open.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nHey. Good morning. Question around policy in force growth. I think in the quarter, it was up about 0.5%.\n\nCould you give a little color on that August and September have count that you said was at record levels? Could you put some numbers behind that and the potential for policy in-force growth in the fourth quarter?\n\nTricia Griffith -- Chief Executive Officer\n\nI don't know how much numbers I can put into it. I mean, obviously, PIF growth goes into both new business and renewal business. A lot of it has to do with obviously our APRs, which we think is positive. It takes a little bit of tender in.\n\nAnd what I will say is our renewal growth looks very positive, and we think a lot of that has to do with -- even if our insurers get an increase if they're shopping, the likelihood of the leaving is lower. So we're seeing that renewal business increase as well. So we feel like we respond from a retention perspective and that PIF growth should start to continue to improve.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nSo maybe at least mid-single-digit approach?\n\nTricia Griffith -- Chief Executive Officer\n\nI never like to guess. But you know what, two weeks from today, you'll have October results and then 30 days after that, November results.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nAll right. I won't push anymore. And then one question. Apologies for another frequency question, but as I look at the 10-Qs and tell me if my math is right, if I look at today's frequency against pre-pandemic, it's nearly up nearly down 20%.\n\nIs that math? And if so, is there a reason -- and it was a great answer to the question before I get the business mix has changed a lot. But is there a reason to believe that maybe frequency could spike up very sharply and very quickly? I know Tricia, you were saying that you're going to look at it over the next two quarters. So one, is my math right? And two, is there any reason to be concerned it could just sharply jump up at some point in the near term?\n\nTricia Griffith -- Chief Executive Officer\n\nYour math is accurate. It's so hard to say because it can change with so many variables. I do feel like it's become a little bit more stable in the last couple of quarters, but you can see with what happens really around the globe thing happens with back and fuel prices things change dramatically. If work from home happens, if something happens where we're hearing about flu season or the next variance, those things can happen.\n\nWe really can't predict those. We do watch those literally on a daily basis. And then we can react to those once we have them, so we do see, we believe a little bit more stability, but I'd like to see several more quarters of that, at least a few.\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nThanks very much.\n\nTricia Griffith -- Chief Executive Officer\n\nThank you, Andrew.\n\nOperator\n\nOur next question is from Yaron Kinar from Jefferies. Yaron, your line is open.\n\nYaron Kinar -- Jefferies -- Analyst\n\nThank you and good morning. My first question is on used car prices coming down a bit and at the same time, we've seen by shop labor already going up. So maybe it's a two-part question here. One, are you seeing the percentage of total vehicles drop? And two, be honest with the math of severity of used cars and severity of Bishop labor.\n\nAre there other elements that we should be thinking about any like would LAE be different when you handle a total claim versus a body shop repair claim?\n\nTricia Griffith -- Chief Executive Officer\n\nWell, each loss is dependent on the severity of what's happening in the car. So again, that dynamic as employees are there, so they're going to handle kind of a mix of harder total losses and some easier hit. So that sort of washes out in the denominator. What I would say is we have seen used car prices go down the mailing index.\n\nWe're going to continue to watch that. And again, it takes some time because there's still a supply demand issue. We're going to wait to see what happens with hurricane Ian. And we are seeing labor up about 3%, parts are up about 4% to 5%.\n\nThe only other thing that we looked at that have been up it is pretty flat right now are rental severity.\n\nYaron Kinar -- Jefferies -- Analyst\n\nOK. And then maybe one follow-up on the related to LAE. So I understand that it is incremental, and I don't know if you can give any additional quantification beyond incremental. But maybe another part of this would be in the LAE that you have for Ian in September, did you already try and capture potentially additional LAE that you still expect to emerge kind of an got in IBNR, if you will? Or is that just for the month of September?\n\nTricia Griffith -- Chief Executive Officer\n\nWell, for the month of September because we wanted to take the $200 million retention and assess the part for indemnity the part for LAE. So 25% is sort of our first assessment, and that number will likely evolve over time.\n\nYaron Kinar -- Jefferies -- Analyst\n\nSorry. I meant for it for the auto lease not property.\n\nTricia Griffith -- Chief Executive Officer\n\nFor the property piece, in terms of LAE.\n\nYaron Kinar -- Jefferies -- Analyst\n\nFor the auto piece of LAE.\n\nTricia Griffith -- Chief Executive Officer\n\nAgain, so the auto piece for LEE that we don't actually separate that out. When we report, we report lots plus LAE. But that again, with the exception of opsin Travel and some hotels and stuff, we already have that baked in because we already have a certain number of plans people on our books and a certain number of claims will happen. And when a hurricane happens, that doesn't necessarily flex up because of that.\n\nWe already have a CAT team. But if they're not handling weather-related events, they're doing other things within the claims organization.\n\nYaron Kinar -- Jefferies -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question is from Tracy Benguigui from Barclays. Tracy, your line is open.\n\nTracy Benguigui -- Barclays -- Analyst\n\nThank you. Your auto new application growth is up 20%, mostly on the direct side. Can you touch on the quality of the new business you were seeing? I'm wondering if your close on ratio changed has just been more submission.\n\nTricia Griffith -- Chief Executive Officer\n\nI didn't hear the last part of your question, but the first part of the question is, we always believe that we put good business on the books because we have so many variables that as long as we can make our target profit margin, of course, that's different in new renewal agency direct in each day, we always believe that the business we put on the books should be able to our target profit goals. And so I wouldn't want to fit in the books we have restrictions and other things. So that, we believe, is a good business. And of course, that evolve and we'll be able to tell you how that underlying is in the next coming months.\n\nI didn't hear the second part of your question.\n\nTracy Benguigui -- Barclays -- Analyst\n\nI was just referring to -- go ahead.\n\nJohn Sauerland -- Chief Financial Officer\n\nI've got your question on Coding Tracey. Let me just comment on the quality, just to build on Church's comments. So obviously, we monitor the quality the incoming business regularly, and we have seen a significant spike in business coming from competitors, which is great, right? If competitors are raising rates, base rates and pushing customers to shop, we believe the power of our segmentation helps us select the right risks at the right rate for lifetime profitability. So we look very closely at that quality of the business.\n\nWe're always paranoid that we're getting business to someone else is shedding, but we're very comfortable with what we're writing. And as Tricia mentioned, we want to grow with the right business, and we feel like we have that in place right now. As far as your quote-to-bind ratio question, there's a lot of moving parts in there because when you have massive increases in shopping, you have different motivation levels of customers and conversion rate is obviously dependent on the mix of business that's shopping, how competitive our pricing is relative to where they're shopping from because they're always comparing for a prior insurance customer what they're paying today versus what they could pay tomorrow. And that's where we think the power of segmentation, particularly in the agency channel, where comparative raters create effectively a transparency of rates across different carriers and segmentation and pricing accuracy enables us to grow in the right places while avoiding adverse selection that potentially goes to our competitors.\n\nTracy Benguigui -- Barclays -- Analyst\n\nOK. But directionally, has it changed for you?\n\nJohn Sauerland -- Chief Financial Officer\n\nDirectionally conversion more recently is slightly down as we see prospect -- record prospect growth, which is a normal dynamic I see more shoppers, some are less motivated, aggregate conversion does slide a little.\n\nTracy Benguigui -- Barclays -- Analyst\n\nOK. And then on a cohort basis, how many policy terms do you think it'll take for that new business to meet your combined ratio target?\n\nJohn Sauerland -- Chief Financial Officer\n\nSo on a cohort basis, obviously, we look at a lifetime basis, and it all depends on how quickly we grow, right? We've gotten the question for, I think, decades, about the growth tax and how we think about new versus renewal. And I think as Tricia mentioned, we will spend where we can be efficient in acquiring customers and acquire them at what we believe a new business combined ratio is that we'll produce our lifetime profit targets. So with that construct as we think about it, if we grow quickly, there will be potentially pressure on our calendar year combined ratio, and we manage our expenses in order to ensure that we deliver on your expectations.\n\nTracy Benguigui -- Barclays -- Analyst\n\nOK. And can you comment how many policy terms did you take for that new bit of tax to not be, please?\n\nJohn Sauerland -- Chief Financial Officer\n\nMaybe I can help out. We have different policy life expectancy by different segment of business. So what we call a SAM and inconsistently insured customers, they're not going to stick around long. So we need to make our 96 in a very short period of time.\n\nRobinsons going stick a lot longer. So we have a lot more time to make up the combined ratio over 100 perhaps on new business for a Robinson. So it depends upon the segment of business that we're talking about lately, we've been growing less on the same side, more on the Robinson side. So if you think about that dynamic, hopefully, that's helpful to your question.\n\nTracy Benguigui -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nNext question shall be from Meyer Fields from KBW. Meyer, your line is open.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. Thank you. Good morning. John mentioned that planned to price mostly to the snapshot curve.\n\nAnd you see what that means maybe slightly excess profits and faster growth compared to what we saw maybe heading into. And I think about that directionally correctly?\n\nJohn Sauerland -- Chief Financial Officer\n\nI would say no. So when we say not specifically to the curve, we would balance that on the end of the curve, if you will. So early on with Snapshot when it was new for consumers, we weren't pricing to the maximum surcharge. We went pricing to the maximum discount.\n\nIn fact, we didn't surcharge off when we first brought out the model. Now that consumers understand it are accepting of it, we can price to both ends of those spectrum. So this doesn't change at all the aggregate 96 target we have for all segments of our business, inclusive of Snapshot.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nOK. And I guess the second issue, you mentioned early in the call, not the first time that resis generally reverse to taking significant rate increases. Can you talk to the opportunity to sort of embed inflationary sensitive components into the exposure base that you don't have the same problem if something else pricing?\n\nTricia Griffith -- Chief Executive Officer\n\nYes. I mean, we tried to do that definitely in our reserving, but in our pricing, we look at that and prospectively put that into our pricing model. But this has been sort of an extraordinary few years with the inflationary, especially in our industry with us in new car prices and social inflation. So we do believe those big increases are past us.\n\nAnd of course, that could be a well we have to have a bigger increase based on something else other than that, but we feel good about that. Do you want to add anything?\n\nJohn Sauerland -- Chief Financial Officer\n\nSure. We do have what we call monthly rating factors. So we have some escalators in our auto pricing. They are not reflective of an inflationary environment in which we have seen recently.\n\nSo you're doing this prospectively and it requires regulatory approval. So we have call modest factors that inflate prices in many states, not all on a monthly basis. On the property side, we also have the value of the home that we are reflecting that renewal, which lately for sure, has led to higher renewal prices outside of any increases we've taken. Does that helpful with your question?\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nI guess I would ask it more intelligently, would that be about the potential for embedding the same sort of things that provide more premium net profit getting those out?\n\nTricia Griffith -- Chief Executive Officer\n\nI think we are with the monthly rating factors as well as the incremental increases and then the dwelling increases that John talked about on the property side.\n\nJohn Sauerland -- Chief Financial Officer\n\nYes, the piece we're going to ensure we're more responsive on the auto frequency side is that continuous monitoring. So the more we drive people to adopt snapshot or UBI rating and a continuous rating model, we can adapt more quickly to things that change in how they drive or how much they drive over time. So that provides a little more responsive than we have in today's model.\n\nDoug Constantine -- Director, Investor Relations\n\nWe let our scheduled time. So that concludes our then I will hand the call back over to you for the closing sections.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDoug Constantine -- Director, Investor Relations\n\nTricia Griffith -- Chief Executive Officer\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nJohn Sauerland -- Chief Financial Officer\n\nMike Zaremski -- BMO Capital Markets -- Analyst\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nDave Pratt -- General Manager, Property Insurance\n\nGreg Peters -- Raymond James -- Analyst\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nPat Callahan -- President, Personal Lines\n\nGary Ransom -- Dowling and Partners -- Analyst\n\nJosh Shanker -- Bank of America Merrill Lynch -- Analyst\n\nAndrew Kligerman -- Credit Suisse -- Analyst\n\nYaron Kinar -- Jefferies -- Analyst\n\nTracy Benguigui -- Barclays -- Analyst\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nMore PGR analysis\n\nAll earnings call transcripts"
}