{
  "companyName": "Applied Materials",
  "companyTicker": "AMAT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/18/applied-materials-amat-q3-2022-earnings-call-trans/",
  "content": "Applied Materials (AMAT 0.25%)\nQ3 2022 Earnings Call\nAug 18, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the Applied Materials earnings conference call. [Operator instructions] I will now turn the conference over to Michael Sullivan, corporate vice president. Please go ahead, sir.\n\nMichael Sullivan -- Corporate Vice President\n\nGood afternoon, everyone, and thank you for joining Applied's third quarter of fiscal 2022 earnings call. Joining me are Gary Dickerson, our president and CEO, and Brice Hill, our chief financial officer. Before we begin, I'd like to remind you that today's call contains forward-looking statements, which are subject to risks and uncertainties that could cause our actual results to differ. Information concerning the risks and uncertainties is contained in Applied's most recent Form 10-Q and 8-K filings with the SEC.\n\nToday's call also includes non-GAAP financial measures. Reconciliations to GAAP measures are found in today's earnings press release and in our quarterly earnings materials, which are available on the IR page of our website at appliedmaterials.com. Before we begin, I have a calendar announcement. Applied plans to host our services master class five weeks from today on Thursday, May 26, at 9:00 Pacific Time.\n\nWe'll describe the market opportunity for our services business, explain why 87% of AGS revenue is truly recurring, and give you the growth formula for the business through our 2024 financial model horizon and beyond. We hope you'll join team members of our global services team for presentations and Q&A. And now I'd like to turn the call over to Gary Dickerson.\n\nGary Dickerson -- President and Chief Executive Officer\n\nThank you, Mike. In our third fiscal quarter, Applied Materials delivered results at the high end of our guidance range and record quarterly revenues. The actions we've been taking to mitigate supply chain challenges are beginning to have an impact, and we expect steady incremental improvements from here. Resolving supply issues has required new levels of collaboration between our global teams, suppliers and customers.\n\nWhile all of this hard work is yielding results, global supply chains remain stretched. Demand for Applied's products is still higher than our ability to fulfill it, and our backlog continues to grow. In addition, our relentless focus on meeting customers' needs in this very difficult environment has created margin headwinds that we're working hard to overcome. We're driving actions to reduce costs and improve value capture, including price adjustments.\n\nIn my prepared remarks today, I'll cover three key topics. First, our near-term outlook on supply and demand dynamics. Second, our longer-term view of the markets and the industry's road map. And third, Applied Materials strategy, priorities and progress.\n\nAfter that, Brice will provide more color on our financial performance in key areas of operational focus. Let me begin with our near-term perspective on the market. Due to large gaps between demand and supply as well as equipment companies shipping partially finished systems and emerging components in the field, overall 2022 wafer fab equipment spending is difficult to quantify with precision. Our best estimate is that it will land somewhere in the mid-$90 billion range.\n\nFor Applied, the picture is clearer. If we use the midpoint of our fourth quarter guidance, we expect our wafer fab equipment revenues to be up approximately 15% for our fiscal year. As we look ahead to 2023, there are three major factors shaping our view of the market. First, memory spending is expected to be lower than in 2022 as macro uncertainty and weakness in consumer electronics and PCs causes these customers to defer some capacity additions.\n\nSecond, leading-edge foundry-logic looks strong with customers battling for leadership and racing to be first to implement major technology inflections. Third, ICAPS customers who serve IoT, communications, auto, power and sensor markets, are reporting areas of strength and weakness. These customers serve broad and diverse applications. They're seeing softness in consumer-centric markets, which are being impacted by macroeconomic factors.\n\nAuto and industrial demand continues to be solid because those investments are driven by large inflections, such as electric vehicles and industrial automation. In these areas, chip makers are securing long-term capacity agreements that underpin their capital spending plans. While it's too early to provide a forecast for 2023, we believe our business will be more resilient than in the past if there is a demand pullback in certain areas of the market. We expect Applied to remain supply constrained for the next several quarters.\n\nWe're working through our very substantial backlog of orders, which provides a buffer to in-year demand fluctuations. And in addition, customers are providing us with longer-term visibility and commitments in response to their own customers' actions to lock in the strategic capacity they need. Although we're confident in our ability to perform well in a range of market scenarios, we're mindful of the current macroeconomic trends. As a result, we are slowing down hiring while ensuring we fully fund the R&D programs and strategic operational capabilities that support our long-term growth.\n\nRegionalization of supply chains is also something new for the industry. We expect this will provide a small positive tailwind for overall wafer fab equipment spending starting in late 2023. Also, because of the time-bound nature of government incentives in the US, Europe and Asia, we see a higher degree of certainty for these investments. Last week, I was in Washington, D.C.\n\nfor the signing of the CHIPS Act and met with government officials and leaders from across the semiconductor and automotive ecosystems. I'm happy to see the critical role that semiconductors play in the economy being recognized and acted upon. The need to build more resilient and flexible supply chains remains a key theme for these leaders, and the CHIPS Act will enable many companies to accelerate their investments in strategic capacity. I'm also excited about the potential to create a new high-velocity innovation platform in the United States to accelerate the development and commercialization of next-generation technologies.\n\nAs I look further to the future, I feel very positive about the direction of the industry and our long-term opportunities at Applied. Consensus within the industry is that semiconductor revenues can reach $1 trillion before the end of the decade. That translates to a high single-digit compound annual growth rate from today. In parallel, the technology road map is becoming increasingly complex.\n\nAs a result, we expect equipment intensity, the ratio of wafer fab equipment investment to semi revenues to remain at today's level or increase over this period. Then the major technology road map inflections, including Gate-All-Around transistors, backside power distribution networks, new materials for interconnect and contact, and heterogeneous integration of chips and chiplets, are enabled by materials engineering where Applied Materials is the leader, and this shifts more dollars to our available market over time. We've invested ahead of these inflections to create a portfolio of differentiated solutions that positions us to outperform as these new technologies transition to volume manufacturing. Applied Materials strategy is built upon the breadth and strength of our technology and capabilities.\n\nThis provides us with a unique ability to engineer, co-optimize and integrate solutions that address our customers' highest-value technology challenges. Co-optimized solutions, where we optimize adjacent process steps, and integrated material solutions, or IMS, where we optimize a combination of process steps in a single system under vacuum are becoming an increasingly important part of our product portfolio. In our recent master class, we talked about a breakthrough IMS approach for tungsten-only contacts that are free of conventional barrier materials. This provides significant improvements in contact resistance and is critically enabling for smaller foundry-logic nodes.\n\nThe number of process steps are growing as these customers migrate to this pure metal technology, and these low-resistance integrated solutions for contact and wiring represent new multibillion-dollar revenue opportunities. Over the past two quarters, we have secured multiple tool of record positions at all leading customers. Our ability to co-optimize materials engineering solutions with novel inspection and metrology is also driving record performance in our process diagnostics and control business. We expect PDC revenues to be up almost 40% in fiscal 2022 with broad-based customer adoption of our eBeam metrology and new optical wafer inspection platforms.\n\nIn the quarter, we also strengthened our ICAPS portfolio with a tuck-in acquisition. Picosun is a leader in batch ALD technology, and we're delighted to welcome their talented team to the Applied Materials family. Turning to service. AGS delivered record quarterly revenues despite headwinds for our transactional spares and 200-millimeter equipment businesses due to supply chain constraints.\n\nThe subscription portion of AGS continues to demonstrate strength. Installed base tools under long-term service agreements grew 9% over the past 12 months. Our renewal rate for these agreements continues to be strong and is currently running at 93%. Before I hand the call over to Brice, I'll quickly summarize.\n\nWe're beginning to see gradual improvements in our supply chain, which enabled us to deliver record revenue for the quarter. We expect demand to remain higher than supply for the next several quarters, and we're continuing to drive actions to close the gap. The changing macroeconomic environment is causing some customers to adjust the timing of their investments. However, we're confident that our business will be more resilient, thanks to strong pull for a uniquely enabling technology, our large backlog, longer-term visibility from our customers and industrywide investment in strategic regional capacity.\n\nOur long-term view of the market remains unchanged as multiple parallel secular trends drive the semiconductor and wafer fab equipment markets structurally higher. At the same time, large technology inflections that are enabled by our core capabilities in materials engineering create outsized growth opportunities for Applied Materials. Now, I'll hand the call over to Brice.\n\nBrice Hill -- Chief Financial Officer\n\nThank you, Gary. I'd like to begin by saying thank you to our teams and our supply chain partners for helping to increase our output despite ongoing constraints and unexpected shortages. Our factory and logistics teams operated with agility, adjusting to almost daily changes in supply schedules. We are still not meeting all of our customers' demand and solving the supply chain shortages to increase our manufacturing output remains our top priority.\n\nBefore I summarize our Q3 results, I'd like to emphasize four points. First, our overall demand remains healthy. Specifically, our orders remained strong in Q3, our backlog increased, overall factory utilization remains high, and customers have added four new factory projects to the long-term road map. There are pockets of weakness in the semiconductor market, and a number of affected customers have asked us to reschedule their capacity additions.\n\nAt the same time, there are areas of strength, and we have broad market exposure and strong customer pull for technology investments. Second, our supply chain improved incrementally in the quarter, as Gary mentioned. We have added significant investments in talent to our supply chain teams to resolve bottlenecks and to improve our inventory and overall output. Third, we remain committed to our long-term gross margin targets.\n\nToday, we are still experiencing the effects of higher costs and unfavorable mix, which are being partially offset by pricing adjustments. We expect to incrementally improve gross margins over the coming quarters driven by forecasted improvements in manufacturing volumes, product mix, pricing and logistics costs. And fourth, we are confident in the industry's underlying growth trajectory and our unique materials engineering capabilities for process innovation. While we are slowing our headcount growth, we have increased our R&D spending by around 10% year-to-date and remain fully invested in enabling our customers' road maps.\n\nTurning to our Q3 results. We delivered record revenue of $6.52 billion, which is in the high end of our guidance range. Non-GAAP gross margin of 46.2% declined 80 basis points quarter on quarter. Non-GAAP operating spending was $1.06 billion, which is right on target and up $39 million quarter-on-quarter as we increased R&D and added supply chain resources.\n\nNon-GAAP operating margin declined 60 basis points to 30% driven by the lower gross margin and headcount additions primarily in engineering. Non-GAAP earnings of $1.94 grew $0.09 quarter on quarter and matched our previous record. Turning to the segments. The semi systems team did a great job maximizing shipments, growing revenue by $276 million, up 6% quarter-on-quarter.\n\nSegment non-GAAP operating margin declined 100 basis points sequentially to 36.1% due to higher materials, freight, expedite and labor costs, partially offset by price adjustments. The AGS team delivered record quarterly revenue, growing $37 million or 3% quarter on quarter. We continued to deliver healthy year-over-year growth in subscription revenue, while the supply chain shortages constrained our growth in transactional parts and 200-millimeter systems. AGS non-GAAP operating margin was 30.6% and slightly up quarter over quarter.\n\nI'll take a minute to share a few observations about AGS. Next month, we'll host a services master class where you'll have an opportunity to learn more about our strategy to increase our recurring revenue. The three key drivers are the growth of our installed base, equipment service intensity and long-term service agreements. AGS is making excellent progress toward our 2024 financial model.\n\nWe exited Q3 tracking around $500 million ahead of the base case of our AGS revenue plan and around $250 million ahead of our high case. In addition, the services business is capital-light and produces excellent cash flow. Moving on to display now. The market is weaker due to its high exposure to consumer portion of the economy.\n\nDuring the quarter, we lowered spending in line with the current market environment. Our display revenue declined by $48 million or 13% to $333 million. The business contributed $70 million of non-GAAP operating profit, which is down sequentially by $12 million or 15%. Turning to our cash flows.\n\nWe generated $1.47 billion of operating cash flow during the quarter, which was 23% of revenue. We returned $1.23 billion or 97% of free cash flow to our shareholders, deploying $1 billion to repurchase 9.8 million shares of company stock and paying $225 million in dividends. We also deployed around $440 million for two strategic acquisitions. We expanded our ALD portfolio with the addition of Picosun, and we acquired a talented simulation software team.\n\nYear-to-date, we have produced over $4.5 billion in operating cash flow and nearly $4 billion in free cash flow and returned $5.25 billion to our shareholders. Now, I'll share our guidance for Q4. We expect revenue to increase to $6.65 billion plus or minus $400 million. We expect non-GAAP EPS to be $2 plus or minus $0.18.\n\nWithin this outlook, we expect semi systems revenue to increase to $4.93 billion or up 14% year over year. We expect AGS revenue to increase to $1.43 billion or up 4% year over year with continued healthy growth in services and ongoing supply chain limitations in 200-millimeter systems and transactional parts. Display revenue should decline to around $250 million. We expect to incrementally increase our non-GAAP gross margin to 46.4%.\n\nAnd we expect non-GAAP operating expenses to increase slightly to $1.08 billion. We are modeling a tax rate of 11.8%. Before we begin the Q&A, I'd like to summarize our company's position in the current environment. We continue to see very strong customer pull for advanced technology in all of our markets, and our backlog continues to grow.\n\nWe believe some of our customers will moderate their capacity additions in areas that have been impacted by weak consumer spending. However, I expect Applied's business to be more resilient than in past periods for three reasons. One is that we have strong exposure to technology investments, particularly in the foundry-logic market, which has grown to become approximately two thirds of wafer fab equipment spending. Second is that we have multiple quarters of backlog for products that are essential to our customers' technology road maps, and we expect to continue to increase supply over the next several quarters.\n\nThird, that our services business has grown to over $5.5 billion in size and generates 87% of revenue from recurring demand for parts, services and software. And now, Mike, please begin the Q&A.\n\nMichael Sullivan -- Corporate Vice President\n\nThanks, Brice. [Operator instructions] Operator, let's please begin.\n\nOperator\n\n[Operator instructions] Our first question comes from C.J. Muse of Evercore ISI. Your line is open.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYeah. Hi. Thanks. Thanks for taking the question.\n\nI guess, a question for me would be in light of record backlog and extended lead times, and then some of the puts and takes around customers moving out production plans, how are you thinking about the timing of easing of supply constraints? How are you thinking about kind of internal tool production into 2023, and as part of that driving, I assume, gross margins higher throughout that time? Would love to hear your thoughts around that.\n\nBrice Hill -- Chief Financial Officer\n\nC.J., it's Brice. Yeah, good question on supply constraints and timing versus the demand environment, etc. So let me explain what we've done the last couple of weeks. We just went through a cycle where we reconfirmed all of our 2023 demand with our customers, something we do once or twice per quarter on a regular basis.\n\nAnd it gives the customer base a chance to signal if they want to make changes, they want to make adds, they want to make drops. And in a constrained environment, that lets us balance our supply across the customer base in the best way. So we've just completed that. And there are a number of changes, but what we see for 2023 and the next three-plus quarters, as we said in our initial comments, is that demand is still significantly above our ability to supply, but we've got the confidence that we just reconfirmed all of that.\n\nAnd then, when we think about supply, our comments -- we've invested significantly in the supply chain. So we're working to identify issues and loosen the supply chain and solve problems in the supply chain both at our direct suppliers and our secondary suppliers. So our expectation is that we'll increase output for the next several quarters and continue to work on that backlog, which, as you highlighted, has continued to grow.\n\nGary Dickerson -- President and Chief Executive Officer\n\nC.J., this is Gary. I guess, also relative to supply chain, what we've been -- certainly the zero COVID lockdown in Shanghai, March 28, that set us back relative to overall supply chain. We're continuing to make incremental progress. And I just -- right now, we see it still being incremental going forward.\n\nWe're doing everything we can, making investments, adding manpower, but it's more incremental. And I think the same thing is true on margins. I think last quarter, we said that we would see incremental progress from where we were. And I think that's really the direction both for supply chain and for margins is more incremental improvement throughout '22 and going into '23.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Mark Lipacis of Jefferies. Your line is open.\n\nMark Lipacis -- Jefferies -- Analyst\n\nI guess, the question I have is, Gary, maybe if you could help us understand the mechanics around what you guys do when your customers come in and say, oh, we're adjusting the -- I think you used the expression adjusting the timing of the orders. So do you push there? Are you able to like take the slot that you have allocated for them and push them back a quarter or two? Or do you -- at some point, do you just say, \"Listen, we can't push this back anymore. You either got to take it or go to the end of the line.\" If you could just provide some color about what you're seeing real time on the ground. Like, how many people are pushing back? Is it a quarter? Is it two quarters? And the mechanics operationally about how you guys manage that process.\n\nBrice Hill -- Chief Financial Officer\n\nYeah. I know Gary's going to comment. I'll just make a quick comment, Mark. When we go out and test the backlog with the customers, if they want to make changes, a lot of times, that's a mutually beneficial change.\n\nWe have another customer that's interested in taking the tool because the demand is exceeding supply at this point. So the first thing we do is try to accommodate those changes. We're not trying to demand the customers stay on the schedule that they have, etc. So we try to be flexible.\n\nAnd that was really the point of going out and retesting and reverifying all of the demand that we have across the customer base. So Gary, you may want to add to that.\n\nGary Dickerson -- President and Chief Executive Officer\n\nNo. I think that's exactly right. Again, the challenge we face right now -- again, many of our customers are really driving major technology inflections. And Mark, I think you see also, especially in high-performance logic, everyone is racing to these new inflections.\n\nSo we just have tremendous demand from those customers in ICAPS, automotive, industrial automation. So unfortunately, we're not able to supply to that demand. And as Brice said, memory is weaker. And we try to manage and work with the customers to come up with the right outcome for them and for us.\n\nMark Lipacis -- Jefferies -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nOur next question comes from Vivek Arya of Bank of America. Your line is open.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nI'm trying to reconcile the two things, right? One, I think, Brice, you mentioned you're going to be increasing capacity over the next several quarters. But then from a demand perspective, I believe, Gary, you said that memory could be down. I think you've said kind of mixed views on ICAPS, but then leading-edge should be up. So my specific question is based on -- I know you're not giving next year's guidance per se.\n\nBut based on what you see, are we looking at kind of a garden variety, flat to down 5%, 10% in terms of the spending environment? Or is it very different than that view? Just so that we have some baseline view of how you're thinking about the industry going into the next year given you do plan to increase supply.\n\nBrice Hill -- Chief Financial Officer\n\nVivek, it's Brice. So to reconcile those two, I think the first thing to be clear on from our side is that demand for the next several quarters, three-plus, is far higher than supply. So we are going to concentrate, like we say, on increasing our supply and we'll do our best to do that over the next several quarters. And that's our expectation, is demand will stay above where we can supply across that time period.\n\nSo I think someone said it before that we're underserving the market so far that -- such that if there's a change in demand, it's still above where our supply line is. That's the perspective we have. And if you think about -- or if you're asking about '23, like we said, it's too early to make a call on '23, but what we would point out is different areas of the market, sure, are having some weakness, some inventory issues, other areas are very strong and are on schedule to build the processes that they need for customer products that are also on schedule. So we think those puts and takes more or less will continue the demand signal for us into next year.\n\nOperator\n\nOur next question comes from Stacy Rasgon of Bernstein. Your line is open.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nQuestion. I was wondering if you could comment separately on your memory and your foundry-logic backlog. So I assume the memory backlog is coming down given it's weaker, but it sounds like your overall backlog is still increasing if your demand is still well exceeding supply. So is it a case of like your foundry backlog is increasing more than your memory backlog is shrinking? Or like how do I think about the different pieces of that?\n\nBrice Hill -- Chief Financial Officer\n\nYeah. Exactly right, Stacy. This is Brice. Definitely, the backlog is increasing.\n\nAnd definitely, the foundry-logic backlog is the strongest or -- yes, strongest component of that in terms of orders and adds to our order book. I'd say that's good. We know there has been reductions on the memory side. I don't actually know if the memory side is down in total overall, but I think that's a fair way to look at it.\n\nSome customers have reduced backlog on memory, but overall foundry-logic and some of the ICAPS customers are driving an outweighing increase on the positive side.\n\nGary Dickerson -- President and Chief Executive Officer\n\nStacy, this is Gary. So also the foundry-logic is an increasing percentage of overall wafer fab equipment. So if you look at the percentages, foundry-logic is really around two thirds of total wafer fab equipment. And so, certainly, the rates for competitiveness in high performance, you see that with companies making significant investments.\n\nICAPS, you've seen a lot of announcements with companies making long-term investments in the ICAPS capacity. So certainly, you see that in the increasing percentage of foundry-logic in the overall market. So yes, I think that what Brice said and what you had also asked in your question, certainly, foundry-logic is strong. And that backlog still, unfortunately, we're not able to meet demand.\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nGot it. That's helpful, guys. Thank you.\n\nOperator\n\nOur next question comes from Atif Malik of Citi. Your line is open.\n\nAtif Malik -- Citi -- Analyst\n\nQuick question for Brice. Brice, some of your US peers had talked about expanding China restrictions to sub-14 nanometer. Did that impact your July or October quarter outlook? And if you can remind us of your total China sales, what is display systems versus silicon?\n\nBrice Hill -- Chief Financial Officer\n\nThanks, Atif. Yeah, first of all, we did get the same notice as our peers did on that. So that is sub-14 nanometer shipments to China customers. And it did not impact our July quarter and very small for October quarter, and that's included in our guidance.\n\nSo that part's clear. And we will work to make sure that we're in full compliance with all the changes on trade rules as we always have. But nothing significant in July or October periods. And then, could you repeat the display question?\n\nGary Dickerson -- President and Chief Executive Officer\n\nI'll take it. Atif, thanks for the question. So we're not going to break out the exact amount of our business in China, but display, most of our display revenue does come from China. And then, you have the global customers and the domestic customers, so that's the -- and you have systems and service for all of those different businesses.\n\nSo not going to break out all of those different percentages. But what I would say is that -- and I think we've talked about this before, that by far, the majority of our semi foundry-logic business in China is ICAPS, which is on the trailing nodes.\n\nAtif Malik -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Krish Sankar of Cowen. Your line is open.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nBrice, if overall WFE is down, say, 10% next year, how should we think about AMAT's total revenues, including semi and services, given the strong backlog? And more importantly, how to think about the EPS, if say WFE is down 10%? Brice, any color you could give there and how to think about revenue and operating leverage in that environment would be very helpful.\n\nBrice Hill -- Chief Financial Officer\n\nSure. Thanks, Krish. So the first thing, just to remind investors, you kind of made the point in the question about our backlog. We do have, as you said, a large backlog, and we expect for the next three-plus quarters, we'll just be working on raising our output and serving that backlog.\n\nBut if you want to do a what if, if revenue goes down or if WFE goes down, the first thing I would remind investors also is that our services business doesn't fluctuate or correlate 100% with WFE. It's driven off our installed base, which grows every time we ship a tool. And the utilization across the entire factory network that we're serving, transactional spares and subscription service agreements across that. So that portion of our revenue tends to dampen any weakness that we would have from a lower WFE.\n\nI would just highlight that for people that are thinking model. So whatever would change on WFE and change on the equipment side, it would be a dampened signal on the services piece of the business. And then, for overall modeling purposes, I would look at probably as a proxy year 2019 to see how the business reacted to a lower revenue environment, where you can look at the margin performance in 2019, which was down one or two points. And you can look at spending where it was controlled, relatively flat.\n\nI think those would be the same sort of reaction the company would be able to implement in that sort of environment if you were doing a what if, which again is in our forecast.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nThanks a lot. Really appreciate it. Thank you.\n\nOperator\n\nOur next question comes from Toshiya Hari, Goldman Sachs. Your line is open.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nHi. Good afternoon. Thanks so much. Gary, I was hoping you could expand on some of the comments you made regarding the CHIPS Act and the implications for the broader industry, but more importantly, your business.\n\nI think you stated in your prepared remarks that you expect it to be a small tailwind or a minor tailwind starting in late 2023. First of all, if you could sort of quantify that for us for '23 and '24, that would be super helpful. And then, more importantly, how has the conversations you're having with your customers changed since the CHIPS Act has gone through? I guess the main question that I get from investors is if a big foundry in Taiwan decides to build capacity in the US, isn't it sort of a zero-sum game where you sort of subtract from what could have happened in Taiwan and you just kind of take that over to the US? So net-net, isn't it sort of a zero sum? But how would you kind of respond to that?\n\nGary Dickerson -- President and Chief Executive Officer\n\nYeah. Thank you, Toshiya. So on the CHIPS Act, first, I'd say just I am very happy to see the CHIPS and Science Act pass and become law. That's really positive to the United States and the overall industry.\n\nAnd then, relative to the investment question that you asked, I would look at it as a small positive tailwind for overall wafer fab equipment spending and really timing-wise, starting in late 2023. If you look at the investments, at least the ones that have been announced so far, it's really in high-performance logic, some ICAPS investments, those kinds of things. So as I mentioned earlier, again, two-thirds of wafer fab equipment is in that foundry-logic space today. And so, that's going to be incrementally positive going into late '23 and beyond.\n\nThose investments also are time-bound. If you look at the incentives, there are certain time frames where the funding is available and investments have to be made. So that creates a higher degree of certainty. I would say, as those companies -- I've talked to many of them.\n\nAnd as they move to new locations, there is start-up costs and some incremental less efficiency, as they start those fabs and especially for our service business, that's an incremental positive. So I think you'd see small incremental spending late '23 and beyond as all of those investments and those factories are starting up. Over time, Toshiya, I think really as they -- it really depends on the scale of those factories. A bigger factory is more efficient than a smaller factory.\n\nAnd so, until they build them out, which will take many, many years, there will be a degree of less efficiency for some period of time. But again, if you look at it in the grand scale of overall WFE, it's not a huge tailwind, but it's definitely a tailwind.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nGot it. Thanks so much.\n\nOperator\n\nOur next question comes from Harlan Sur of J.P. Morgan. Your line is open.\n\nHarlan Sur -- J.P. Morgan -- Analyst\n\nGood afternoon. Thanks for taking my question. I wanted to expand on some comments that Brice had on services. Maybe this is a plug for your upcoming master class.\n\nBut I mean in the event of a weaker WFE environment next year, you have several positive buffers. I think the biggest one is that your services business historically does not decline during downturns. In fact, over the past 11 years, and I think that's four WFE down cycles, I believe that there's only been one year that AGS was down. And it's driven a pretty stable like 8% to 10% sort of revenue CAGR over that period of time.\n\nSo outside of the annuity-like subscription contracts that I assume will be partially offset by, let's say, 200-millimeter equipment sales, which may fall off in a weak WFE environment, what is the team doing to ensure continued outperformance of services doing WFE weakness and your confidence on driving growth in services if WFE is down next year?\n\nBrice Hill -- Chief Financial Officer\n\nYeah. Thanks for the question, Harlan. If I got it there, what we're focused on, the two drivers for that business, as you kind of hinted to, are really the installed base that grows every time we ship a tool, and then as you highlighted, our ability to serve that installed base both through transactional support spares and services, and then the subscription agreements that we have with customers that offer spares, plus insights that we have across the network on how to optimize for yield and how to optimize for capabilities. So I think what we're doing is increasing our portfolio of service offerings that make it more valuable to the customer.\n\nIt allows them to ramp more quickly, reach higher yields and really benefit from the intelligence that Applied has across the whole ecosystem of tools that they don't have potentially on their own. I think that's the focus area for the company, and that's what gives us confidence that as that installed base grows, we'll be able to continue to grow our subscription agreements. And just the last piece is, you're right, we have the same analysis on not being 100% correlated with WFE. And even as -- if there's changes in WFE or weakness in the revenue and the rest of the business, it's really about the underlying utilization in the factories that exist and the need for services and intelligence in those factories.\n\nSo I think those are the key drivers.\n\nGary Dickerson -- President and Chief Executive Officer\n\nHarlan, thanks for reminding people about the master class coming up here next month. The one thing that I think has helped us also -- so if you -- you talked about 10, 11 years. If you go back over that time period, we, I think, close to double our percentage of subscription agreements versus transactional. So certainly -- and we've increased the length of those agreements to two and a half years.\n\nSo that percentage of agreements being so much higher, and it's still growing, that makes that business more resilient. And I think that also relative to the environment we've been in, where everybody is focused with chip shortages, producing good chips out, it really has also highlighted more value in our services. Things like managed part services, where people have the parts available versus competing for what's available from a transactional perspective, along with all the things that Brice talked about, I think that's really helped highlight the value of these longer-term subscription agreements for our customers.\n\nMichael Sullivan -- Corporate Vice President\n\nHarlan, it's Mike. I think that earlier I gave the right timing for the next master class. It's in five weeks from today, but I think I heard myself say May 26, which is the last date. It's September 22, of course.\n\nSo thank you.\n\nOperator\n\nOur next question comes from Joe Quatrochi of Wells Fargo. Your line is open.\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nYou talked about still seeing strength in -- especially in leading-edge, foundry-logic investments, but there's also some consumer-driven demand there as well. So I guess, have you maybe seen a change in terms of like the capacity that your customers are looking to put in place there, but still not change their technology road maps?\n\nBrice Hill -- Chief Financial Officer\n\nYeah. Thanks for the question, Joe. Yes, the way I would think about it -- first of all, I think, yes, we've highlighted that demand is higher than our supply level. There's been changes.\n\nI think in total, that demand came down a little bit, but it's still above what we're able to supply for the out-quarters. But I think the way we think about it for a leading-edge foundry is they're building processes that their customers are building products on, and they need to be able to hit those schedules for the customer products. So they're fairly committed to getting that technology in place. And then, you're right, the volumes will fluctuate depending on what the market is for those products.\n\nBut if you're building a logic node for a product two years from now, you're really thinking about what the market is two years from now when you're putting that equipment in place. So it's not as simple as just looking at the current quarter's macroeconomic environment, GDP and lowering your demand. You really have to think about that forward-looking function. But the dynamics -- you have the dynamics, right? We just retested all of the demand for next year, and that's what all the customers are thinking about.\n\nOperator\n\nOur next question comes from Timothy Arcuri of UBS. Your line is open.\n\nTimothy Arcuri -- UBS -- Analyst\n\nAround some of the mixed signals around what's happening this time around. And on one hand, customers are pushing out, but you also mentioned that you're getting long-term commitments from some other customers. I was wondering what that means because it kind of sounds like you're confident that foundry-logic is going to hold up at this time even as memory pushes out. And that's not usually how it works.\n\nIs it something that there's such a concentration of leading-edge foundry capacity and there's going to be others such as your neighbor that are trying to compete to get back in the foundry business? Is that what's different this time? Because I'm hearing these mixed signals, and there's something obviously different. So I'm just wondering if you can call on your past knowledge to help on that.\n\nBrice Hill -- Chief Financial Officer\n\nSure, Tim. Just two comments. The first is we've definitely expanded the horizon with all of our customers from a planning perspective. They're giving us longer signals than before and giving us the opportunity to engage in the discussion on capacity planning with them.\n\nAnd second, some customers are also giving us a sense that -- or a promise basically that they'll operate within a certain band of capacity. So they're giving us additional confidence to what we should plan for from a high-confidence perspective, and that's a little bit different than what we've done before.\n\nGary Dickerson -- President and Chief Executive Officer\n\nTim, this is Gary. I would say one other thing that is helping us in this time frame. If you look at the relative investment for the upcoming inflections, more of the dollars are going to new materials and new structures. Gate-All-Around, we talked about that in the master class.\n\nWiring for interconnect from seven to three goes up, I think, three x dollars per wafer as you go because you have -- go to the three-nanometer node, there's more steps. We have these Integrated Material Solutions that combine seven technologies on one integrated platform to lower the wiring resistance by 50%. Backside power distribution, if you look at what one of our customers said recently, they talked about significant increase in materials and structures relative to power performance for them going to their future technology nodes. Backside power distribution is another one that's a significant inflection.\n\nYou can reduce the area up to 30% without shrinking the features by placing some of the structures on the backside of the wafer. So again, for us, that relative contribution and the relative investment in our types of technologies is going up, and that's another thing that's helping us.\n\nTimothy Arcuri -- UBS -- Analyst\n\nThanks, both.\n\nOperator\n\nOur next question comes from Joseph Moore of Morgan Stanley. Your line is open.\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nThank you. In terms of the view that you've been more resilient going forward than you've been in the past, would you say that's true for memory in isolation? And I guess if we sort of -- if we think this is a memory downturn that looks similar to 2019, should we think about WFE being down similarly to 2019? Or do you think that would be too pessimistic? And why is that?\n\nBrice Hill -- Chief Financial Officer\n\nThanks, Joe. The first part, I guess I haven't thought of it like that, but I would say that we are resilient -- a more resilient philosophy or position would play to memory only. And the reasons that I would point to are, first, the backlog that we've talked about. Even though memory may be weaker than it was last quarter, we still have significant quarters of backlog for memory customers.\n\nSo that dynamic is the same. And the overall backlog strength is one of the reasons we're saying we're more resilient than in other periods. And the second is the services business is one of the reasons that we're thinking that we're more resilient, and that also applies to memory customers and customers that we service from a spares perspective, etc. So I think that also is larger than it has been in the past and is more resilient relative to changes in WFE.\n\nAnd then, the last piece, just to make sure for everybody else, I wasn't implying that 2019 would be the P&L for the company. We won't go back to 2019, but that it was a good proxy for how gross margin and spending would behave if we were in a weaker environment. So just to clarify that.\n\nGary Dickerson -- President and Chief Executive Officer\n\nYeah. Joe, this is Gary. I think if you say what's changed -- or what's the same and what's changed, certainly, the percentage of foundry-logic is significantly higher than it was back in that time frame. Again, it's tracking around two-thirds.\n\nThere's this race for leadership in high-performance logic and significant investments that are happening in that part of the market. And we see customers -- our customers announcing longer term agreements with their customers, and that's something that we didn't see back in that time frame. So I think the foundry-logic percentage and the relative strength there is definitely different than -- certainly than it was in the 2019 time frame relative to the overall wafer fab equipment market.\n\nOperator\n\nOur next question comes from Sidney Ho of Deutsche Bank. Your line is open.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nMy question is on -- another question is on China. When I look at the revenue from China, it came down to about seven percentage points quarter over quarter. I think that's more than some of your peers. Can you walk us through the dynamics there? I know in answering a previous question, you talked about the new export restriction have no impact in the July quarter.\n\nMaybe you can talk about the demand strength from domestic Chinese customers versus multinationals and the foundry versus memory. That will be great.\n\nBrice Hill -- Chief Financial Officer\n\nThanks, Sidney. This is Brice. Yes, I think one specific driver and one just general observation. The specific driver is most of the downside on our display business relates to customers in China.\n\nSo that's the -- probably the primary change element. The rest is just the ins and outs normal quarter activity. We don't think the China market, as we look forward, is any weaker. We think the ICAPS investments that are being made there are largely on schedule.\n\nNo real change in signal there. So it's just the ins and outs of having different-sized deliveries in the quarter. It happened to be a quarter overall that was a little smaller than the prior quarter. So we would point to display and then just general ups and downs for the rest of the change.\n\nAnd just to reiterate, no change on the -- no change because of the trade rules like we said before.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from Quinn Bolton of Needham & Company. Your line is open.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nReally ask a clarification and then a quick question. The clarification is, when you talk about memory reschedules, are these memory customers just pushing out delivery dates by some number of quarters? Or are they canceling the tool entirely and you're just taking that slot and reallocating it out to one of the foundry-logic customers? The question is just on the memory rescheduling. Is that equally happening across DRAM and NAND? Or is it predominantly on the DRAM side?\n\nBrice Hill -- Chief Financial Officer\n\nOK. Quinn, thanks. On the clarification, there are both -- there are all three events happening with basically all customers. So there's adds, there's drops, and there's schedule changes.\n\nI think on the memory, there's more drops than there are adds in the short-term window. So those are cancels. And there are plenty of reschedules and there are even some adds for memory. So I hope that clarifies.\n\nIt's a mix. But overall, we would say memory -- cycle over cycle, memory is lower than what it was in the last cycle.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nAnd it's equally across DRAM and NAND?\n\nBrice Hill -- Chief Financial Officer\n\nThat part, I don't have off the top. I don't think we would specify that. So I can't answer that one.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nOur next question comes from Patrick Ho of Stifel. Your line is open.\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nFor you, Gary, since a lot of the industry questions have been answered. You talked about the above-average growth in your process control business. Obviously, foundry-logic is a big driver of it, particularly on the advanced node side. Are you seeing any penetration in terms of your ICAPS business in process control? Or is it entirely within the advanced nodes?\n\nGary Dickerson -- President and Chief Executive Officer\n\nPatrick, thanks for the question. No, ICAPS is very strong for our -- ICAPS is very strong overall for the company. PDC is up 67% in 2021, and we're up almost 40% in fiscal 2022. What I would say relative to the breakdown of the different markets, certainly, it's stronger in high-performance logic than in any other part of the market, although we are seeing growth in memory, and we are definitely also seeing growth in ICAPS.\n\nThe biggest thing for us, if you look at our PDC business last year, eBeam pretty much doubled. So we have vertical integration with our electron optics, leadership in resolution and imaging technologies. And that business is also very, very strong into '22 and then also going forward. We are seeing incremental strength also in optical inspection, and we believe we'll outperform the overall market in optical inspection.\n\nAnd overall PDC has a really strong tie to PPACt inflections. So when you look at Gate-All-Around or some of these other big inflections, our unique imaging capability enables us to map out those processes in fingerprints faster and better than anyone else. So that synergy, not only do we see really strong growth in PDC, but real strong synergy with the rest of our semi portfolio.\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nThank you.\n\nMichael Sullivan -- Corporate Vice President\n\nGreat. Thanks. And operator, we have time for one more question, please.\n\nOperator\n\nOur next question comes from Mehdi Hosseini. Your line is open.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nAsking a WFE question. Two follow-ups. What would be your revenue guide if you had all the components that you needed to shift to demand?\n\nBrice Hill -- Chief Financial Officer\n\nThat's a good question, Mehdi. Since it's been several quarters since we've been at that level, it's difficult to predict. But we did say, I think, two quarters ago that the supply constraints probably impacted us by $300 million. So I would say that and more if we had zero supply constraints, and we would be on a higher curve going forward.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nAnd of your inventory, how should I think about the mix of WIP and finished system -- or finished goods?\n\nBrice Hill -- Chief Financial Officer\n\nWell, the changes for inventory, it's relatively balanced across the both -- across the entire inventory ecosystem. But the increase -- I'm looking at the number, sorry, right now -- relatively balanced. I mean, here's what's happening on -- here's what's happening dynamically. We have a much more raw inventory coming in as we're trying to solve the supply chain issues, and 95% or more of our parts are available and we're able to build inventory.\n\nAnd that shows up in our WIP in raw material. And on finished goods, what's happening is we do have material -- or tools that are complete or nearly complete that are awaiting one part or close to being shipped to customers, and that inventory is also growing. So I think it's relatively balanced across all those components.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nSo the pushout by memory customers is not a factor in driving your -- the increase in days of inventory?\n\nBrice Hill -- Chief Financial Officer\n\nYeah. Absolutely not. We're still underserved in total relative to the market. So when any customer delays a tool or cancels a tool at this point, we'll be moving that inventory and those parts to another customer.\n\nAnd we expect that to be the dynamic for the next several quarters plus. Yes. And just to emphasize for everybody, yes, we -- that's what our perspective is on output. We'll be raising our output for the next several quarters, and we expect to be able to ship that based on demand being higher than the current supply.\n\nMichael Sullivan -- Corporate Vice President\n\nOK. Thanks, Mehdi, for your question. And Brice, would you like to give us a summary?\n\nBrice Hill -- Chief Financial Officer\n\nAbsolutely. So we've talked about puts and takes, weakness and areas of strength in the market. The overall story is we have multiple quarters of backlog. Job one for us is to increase our output and meet our customer demand as quickly as possible.\n\nAnd as we do this, we'll incrementally increase both our revenue and gross margin in coming quarters. We're confident in the long-term growth of the semi market, and we're working to increase our investments in supply chain and especially to continue to focus on the R&D to drive the power, performance, and area cost road maps of our customers. I look forward to seeing many of you at the upcoming conferences. Gary and I will be at the Goldman Sachs conference in San Francisco.\n\nAnd just before that, I'll be in New York for the Citi and Evercore events. OK, Mike, please close.\n\nMichael Sullivan -- Corporate Vice President\n\nI'd like to thank everybody for joining us today. A replay of the call is going to be available on our website by 5:00 Pacific Time today, and we would like to thank you for your continued interest in Applied Materials.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Sullivan -- Corporate Vice President\n\nGary Dickerson -- President and Chief Executive Officer\n\nBrice Hill -- Chief Financial Officer\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nMark Lipacis -- Jefferies -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nStacy Rasgon -- Bernstein Research -- Analyst\n\nAtif Malik -- Citi -- Analyst\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nHarlan Sur -- J.P. Morgan -- Analyst\n\nJoe Quatrochi -- Wells Fargo Securities -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nJoseph Moore -- Morgan Stanley -- Analyst\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nPatrick Ho -- Stifel Financial Corp. -- Analyst\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nMore AMAT analysis\n\nAll earnings call transcripts"
}