{
  "companyName": "DXC Technology Company",
  "companyTicker": "DXC",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/dxc-technology-company-dxc-q2-2023-earnings-call-t/",
  "content": "DXC Technology Company (DXC -0.90%)\nQ2 2023 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day. My name is Savannah, and I will be your conference operator for today. At this time, I would like to welcome everyone to the DXC Technology second quarter fiscal year 2023 earnings call. Today's call is being recorded.\n\n[Operator instructions] Thank you. And I would now like to turn the conference over to John Sweeney. Please go ahead.\n\nJohn Sweeney -- Vice President, Investor Relations\n\nThank you, and good afternoon, everybody. I'm pleased that you're joining us for DXC Technology's second quarter fiscal year 2023 earnings call. Our speakers on the call today will be Mike Salvino, our chairman, president and CEO; and Ken Sharp, our EVP and CFO. The call is being webcast at dxc.com/investorrelations, and the webcast includes slides that will accompany the discussion today.\n\nToday's presentation includes certain non-GAAP financial measures which we believe provide useful information to investors. In accordance with the SEC rules, we provide a reconciliation of these measures to their respective and most directly comparable GAAP measures. These reconciliations can be found in the tables included in today's earnings release and in the webcast slides. Certain comments we make on the call will be forward-looking.\n\nThese statements are subject to known risks and uncertainties which could cause actual results to differ materially from those expressed on the call. A discussion of these risks and uncertainties is included in the annual report on our Form 10-K and other SEC filings. I'd now like to remind our listeners that DXC Technology assumes no obligation to update the information presented on the call except as required by law. And with that, I'd like to introduce DXC Technology's chairman, president and CEO, Mike Salvino.\n\nMike?\n\nMike Salvino -- President and Chief Executive Officer\n\nThanks, John, and I appreciate everyone joining the call today, and I hope you and your families are doing well. Today's agenda will begin with an overview of our Q2 results. Next, I will update you on the progress we are making on our transformation journey. Our Q2 results show that our transformation journey is back, producing the kind of results that we've grown accustomed to.\n\nKen will then discuss our financial results in more detail and provide our guidance. And finally, I will make some closing remarks before opening the call up for questions. Our Q2 results for organic revenue, adjusted EBIT margin and non-GAAP EPS were all at the top end of our guidance. In Q2, revenue was $3.57 billion, and organic revenue was negative 1.5%.\n\nOur organic revenue is one of the best results that we've produced for a quarter since I've been at DXC. Our adjusted EBIT margin was 7.5%, a 50 basis point improvement compared to Q1, driven by our execution of our cost optimization efforts. Our non-GAAP EPS was $0.75. Our trailing 12-month book-to-bill was 1.04, and our Q2 book-to-bill was 0.83.\n\nI look at both of these numbers to see if we are driving the kind of new work to grow GBS and continue to shrink the negative revenue declines in GIS. The trailing 12-month book-to-bill of over one means that we are still on track with our plans. And the Q2 book-to-bill reflects us breaking in a new sales model for GBS and GIS that I will comment on shortly. Overall, I'm pleased with how we have delivered in Q2.\n\nAnd more importantly, we have our execution momentum back. So let me give you some additional color around our transformation journey. The first step is to inspire and take care of our colleagues. The good news is that our attrition remains well under control.\n\nOur growth in GBS demonstrates that we can recruit and retain top talent like engineers and software developers who create innovative solutions for our customers. These engineers and software developers are highly sought after in the market, and we're doing a great job of recruiting and retaining them. The reason for all this is my leadership team is focused on changing the culture of DXC. We are making sure we're taking care of our people, we're working together, and we know how to make positive business impact for our customers.\n\nThe next step is to focus on our customers. The key metric here is our Net Promoter Score. And our most recent NPS score was 33, above the top end of the industry benchmark. It's clear that our customers value our services.\n\nThe value that customers place on delivery has helped us stabilize our revenue. In Q2, we achieved sequential organic revenue growth as well as driving our yearly organic revenue to minus 1.5%. Our focus on delivering for our customers has enabled us to grow GBS for six consecutive quarters and shrink the negative organic revenue growth of GIS to minus 5.8% in Q2. This was 140 basis point improvement over Q1 and the best organic revenue result for GIS since I've been at DXC.\n\nOn our last earnings call, we committed to $500 million of cost takeout in FY '23, and I'm pleased to report that we're delivering. We've made progress on all five levers while taking care of our customers and colleagues. As a reminder, the five levers are: staff optimization, contractor conversions, office and data centers, network and telecommunications, and third-party spend. Our progress so far has allowed us to expand our margin from 7% in Q1 to 7.5% in Q2, and we are on track to hit our FY '23 margin goals.\n\nThis is a testament to our leadership team. I mentioned on the last earnings call that my leadership team had delivered a similar cost takeout plan in FY '21, and the team is delivering again as I expected. In the area of seize the market, we are implementing a new sales model. This model distinguishes between our two businesses of GBS and GIS as we believe they require two different sales organizations.\n\nThe GBS sales organization is focused on relationship selling. This means selling to our executives based on value, which we define as helping them increase revenue and decrease costs. In the automotive industry, our engineering team works with over 90% of all automotive manufacturers. Software development is increasingly important with the change to software-defined vehicles as it improves the in-car experience and connects the driver to the automotive manufacturer.\n\nAn example of one of our relationships in this space is with Cariad, the Volkswagen Group's in-house automotive software company. We have worked with them to develop a uniform, scalable software platform that will be adopted across vehicles for most of the Volkswagen Group's brands. Drivers will experience 24/7 connectivity, lower maintenance downtimes and higher residual values for their cars. As you can see, our distinct engineering work drives value for our customers.\n\nI firmly believe that our engineering and software development capability is one of the best-kept secrets, but we are gaining momentum changing this perception. In GIS, our sales organization is oriented toward RFP-focused selling, which is highly price competitive. We continue to implement a disciplined sales approach with the deals we are bringing into GIS. Our belief is we can be disciplined as customers are seeking us out against our competition because of our strong delivery reputation.\n\nWe are beginning to see this disciplined sales approach pay off internally, which gives us confidence that we're on the right path with GIS. Overall, we continue to see demand in the market. And with the new sales model for GBS and GIS, you will see us accelerating new work versus renewals. In this quarter, our new work was 63% of our total sales, one of the best new results yet.\n\nAnd finally, I'm pleased with our financial foundation and the steps we have taken to make DXC a quality company. Our debt and our capital allocation are two steps that I would like to highlight. We have effectively managed our debt below our target level of $5 billion. Our debt in Q2 was $4.5 billion, down from $4.8 billion in Q1.\n\nConcerning capital allocation, we have delivered $500 million of cash back to shareholders since we announced our buyback program in February. Now before I turn the call over to Ken, I want to comment on our press release we issued on October 4. We have been approached by a financial sponsor regarding a potential acquisition of DXC. Consistent with our fiduciary responsibility to maximize shareholder value, we have engaged in preliminary discussions and are sharing information.\n\nHowever, to date, no formal proposal has been received. Also, there are no assurances that any proposal will be received or determined as adequate by our board of directors. We do not intend to comment further on this matter. As you can see by our Q2 results, our leadership team remains focused on our transformation journey and delivering for our customers and colleagues.\n\nNow let me turn the call over to Ken.\n\nKen Sharp -- Executive Vice President and Chief Financial Officer\n\nThank you, Mike. Turning to our progress. We continue to move forward on our key initiatives. Q2 organic revenue declined 1.5%, a 110 basis point improvement from the first quarter.\n\nAdjusted EBIT margin and non-GAAP diluted earnings per share were at the top end of our guidance range at 7.5% and $0.75, respectively. Free cash flow of $17 million, leaving us a little better than breakeven free cash flow for the first 6 months of the year. We expect our FY '23 free cash flow will be back-end loaded, similar to last year. As you recall, we delivered over $700 million of free cash flow last year.\n\nMoving to Slide 12. On a year-over-year basis, we have margin headwinds of about 130 basis points; from lower pension income, 70 basis points; exiting Russia, 30 basis points; and FX, 30 basis points. Second quarter gross margin declined 110 basis points compared to prior year and is up 120 basis points sequentially. We anticipate our gross margin will improve in the third quarter as our cost optimization efforts gain traction.\n\nSG&A as a percent of sales decreased by 10 basis points driven by our cost optimization efforts. Depreciation was lower by 60 basis points. Other income decreased primarily due to lower noncash pension income of about $30 million per quarter. As a result, adjusted EBIT margin declined 110 basis points, compared to prior year and is up 50 basis points sequentially.\n\nEPS was down $0.15 compared to prior year and was impacted by $0.10 from FX headwinds, $0.09 from lower pension income, $0.08 due to higher tax rate, $0.04 from lower margins. These impacts were partially offset by $0.16 due to lower interest expense and a lower share count. The U.S. dollar has strengthened at an unprecedented level.\n\nGiven the global nature of our business, let's put the FX headwinds for the full year in context compared to prior year. Revenue is expected to be negatively impacted by $1.2 billion, a $200 million increase from our prior guidance. Adjusted EBIT is expected to be negatively impacted by $130 million and 25 basis points of margin. EPS is expected to be negatively impacted by $0.40.\n\nThe FX impact to profit impacts cash flow by $100 million. About 60% of our debt is denominated in currencies other than U.S. dollar. FX reduced our debt by approximately $400 million since our refinancing.\n\nSpecific to Q2, compared to the prior year quarter, FX impacted revenue $300 million, adjusted EBIT margin by almost 30 basis points, EPS by $0.10, free cash flow by approximately $30 million. Let's turn to our segment results. We continue to see improvement in the business mix as GBS becomes a larger portion of the business, which is our focus. Year-over-year, our GBS revenue mix increased 150 basis points to 48% of DXC's total revenue.\n\nGBS has consecutively grown for six quarters and is our higher value business with higher margins and lower capital intensity. GBS grew organically 3.4%, driven by strong analytics and engineering growth. The GBS profit margin declined 320 basis points year over year and was up 80 basis points sequentially. GIS organic revenue improved to a decline of 5.8%.\n\nGIS profit margin increased 70 basis points year over year, though down 30 basis points sequentially. Turning to our six offerings, starting with GBS. Analytics & Engineering continued its strong organic growth, up 14%. A&E is seeing notable strength with automotive, banking and capital markets customers.\n\nApplications declined 1.1% on lower project revenue. Insurance software & BPS is up 1.1%. Moving to our GIS offerings. Security was down 10.8% as the prior year period had a higher volume of resale revenue impacting the compare.\n\nCloud infrastructure and IT outsourcing had a strong quarter with a decline of 0.9%, that was better than our expectation. This is good performance as we saw almost 20% declines just two years ago. Modern Workplace was down 16.9% and continues to underperform our expectations. We believe we've made the right investments in Modern Workplace and expect to see the revenue declines moderate.\n\nTurning to our financial foundation on Slide 16. Debt is down to $4.5 billion and below our target debt level of $5 billion. We recently entered into a $500 million term loan that is undrawn to provide us additional financial flexibility. We continue to tightly manage our restructuring and TSI expenses.\n\nThese expenses totaled $57 million in the quarter or $92 million for the first half of the year. We expect to see an uptick in restructuring expense in the second half of the year as we execute on our cost optimization efforts. You will note in our 10-Q, we disclosed an $8 million reserve associated with a long-standing historical matter with the Securities and Exchange Commission. This matter relates primarily to disclosure associated with the company's transaction, separation and integration costs included in its non-GAAP measures from the time of the merger.\n\nThe reserve represents our best estimate of the potential settlement based on ongoing discussions with the SEC. I should note that, under our leadership, we have substantially driven down the TSI expense while increasing the related disclosures of these expenses. Capital expenditures and capital lease originations as a percent of revenue were 6.2% in the quarter, up 100 basis points as compared to prior year. We continue to examine our capital expenditures and capital leasing as our capital intensity presents a significant long-term opportunity to improve cash flow.\n\nOur $500 million portfolio-shaping proceed goal is on track. As we previously disclosed, we have one regulatory approval remaining to divest our German banks for EUR 300 million. As we continue to review our facility portfolio, we've identified additional underutilized offices and data centers that we expect to sell that will generate $250 million of incremental cash proceeds. These facility sales have been gaining traction as we execute on our virtual model and make thoughtful decisions on asset returns.\n\nThe facility sales may create losses on disposal that would impact our non-GAAP results. As our guidance does not include any estimate for these losses, we will be sure to break these out separately in the future to the extent they occur. Related to our $1 billion share repurchase, we did not repurchase any shares in the quarter due to interest received from a financial sponsor. As you know, we are halfway through the $1 billion share repurchase.\n\nTurning to our guidance for the third quarter. Revenue of $3.55 billion to $3.58 billion; organic revenue growth at minus 1.5% to minus 2.5%; adjusted EBIT margin 8% to 8.5%; non-GAAP diluted earnings per share of $0.80 to $0.85. Our FY '23 guidance, revenue of $14.4 billion to $14.54 billion reflects a $200 million reduction due to FX. Organic revenue, a decline of minus 1% to minus 2%.\n\nAdjusted EBIT margin in the range of 8% to 8.5%. We expect margins to improve through the second half of the year based on accelerating our cost optimization efforts. Non-GAAP diluted earnings per share of $3.45 to $3.75; free cash flow of $700 million. Year-to-date, our free cash flow has been negatively impacted by lower customer bank deposits of about $100 million held in our German banks.\n\nOur guidance assumes customer bank deposits increased $100 million back to about $600 million. Services companies don't traditionally own banks and it can create an unusual free cash flow movement as customer bank deposits change. We are reaffirming our FY '24 guidance. With that, let me turn the call back to Mike for his final thoughts.\n\nMike Salvino -- President and Chief Executive Officer\n\nThanks, Ken, and let me leave you with a few key points. As our Q2 results demonstrate, we are delivering and expect to achieve our FY '23 goals. Also, I expect our execution momentum to continue because by focusing on our transformation journey, we have created the following repeatable drivers of our business. Due to our culture, we have the ability to recruit and retain top talent like the example of engineers and software developers that I mentioned.\n\nDue to our ability to deliver for our customers, we have stabilized our revenue. Due to our experienced leadership team, we are executing on our cost optimization efforts and expanding margin. Our new sales model distinguishes between GBS and GIS and will help us accelerate new work versus renewals. And due to our financial foundation, we have created a quality company that is driving shareholder value.\n\nThese repeatable drivers of our business allow my leadership team to now focus on the future versus the past and gives us the confidence in achieving our FY '24 goals.With that, operator, please open the call up for questions.\n\nOperator\n\n[Operator instructions] Our first question will come from Bryan Bergin with Cowen. Please go ahead.\n\nZach Ajzenman -- Cowen and Company -- Analyst\n\nThanks. This is Zach Ajzenman on for Bryan. Good progress on the overall organic revenue front. Our first question was on the bookings number.\n\nEnd quarter below one on the book-to-bill. I think last quarter, the sub-one result was explained by three to four conscious deal pushouts. So first off, did these deals end up closing during 2Q? And then the expectation was above one this quarter? So just trying to better understand if the latter result was all due to the new sales model. Or was there something else here?\n\nMike Salvino -- President and Chief Executive Officer\n\nWell, look, here's where I'm at. I really like what we're doing with the new sales model. Like I said on the call, it totally enables us to accelerate the new work in GBS and be very disciplined with what we're doing in GIS. So when I think about the book-to-bill, this is what I've been starting to say now for probably two or three quarters, I'm looking at both the 12-month trailing along with the end quarter.\n\nSo let's just take it up as you went from one quarter to the next. If you look at what we did last quarter, our trailing 12-month was well over one, and we delivered a 0.87. And we drove revenue growth from minus 2.6 to minus 1.5. And this quarter, we're in the exact same spot, all right? So we're at 0.83.\n\nAnd again, the trailing 12 month is definitely over one, and we expect to continue to drive revenue growth. So then when I look at the new sales model, in GBS, we definitely want to keep the book-to-bill over one. And right now, the trailing 12 month is 1.18. In GIS, all right, we've got roughly a $9 billion backlog.\n\nAnd my point is, I think I can afford and we can afford to be patient. I'm definitely comfortable because we're very focused on the disciplined deals that are coming in that we're putting on top of that business. Now in terms of your question about the three or four, did they close? We definitely closed one. And I will tell you that we've been working on a $600 million deal over the last six months that we expect to close tomorrow.\n\nAnd what I can tell you about that deal is that the economics are definitely better than the deal I've got today. So that's what I've talked to you about in terms of book-to-bill, still feel very comfortable. Hence, the reason that we guided the way we did for Q3.\n\nZach Ajzenman -- Cowen and Company -- Analyst\n\nGot it. That's helpful. And then switching gears over to the macro. Didn't really hear anything in the way of macro incrementally weighing on performance.\n\nSo perhaps, can you just comment on the nature of services that clients are leaning into or deemphasizing here and how that could potentially impact segment performance? Just high-level thoughts on what you're hearing from clients amid the macro and digging a little deeper into potential segment implications, please.\n\nMike Salvino -- President and Chief Executive Officer\n\nOK. Well, thanks for that question. The color I would give you is this. We definitely continue to see the demand.\n\nAnd when you look at GBS, which is the business that we're focused on for growth, I would have thought if the macroeconomic environment was going to hit us, it was going to hit us in analytics and engineering. And what you see with that is we've got a trailing 12-month book-to-bill of over one. You also see growth of 14%. So I think that speaks to not only the quality of the people and what we -- the value we can deliver, like the Cariad example, but we're not seeing that back up.\n\nIn the GIS business, we have definitely seen a situation where the deals have gotten bigger. When you're talking about infrastructure, modern workplace, people want more cost savings. So that's making the deals bigger, like the deal I referenced. And yes, they are taking a little bit longer, but I don't think it's because of the macroeconomic conditions.\n\nI think it's more based on our disciplined approach to say we are going to do deals that are better than the deals we have today. So thanks for those two questions.\n\nSavannah, next question.\n\nOperator\n\nAnd our next question will come from Ashwin Shirvaikar with Citi. Please go ahead.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you, guys. I appreciate all the good commentary there. Just going back to the sales commentary with your new sales force. Could you provide more granular detail with regards to, are you adding to the overall sales force? Are you swapping out certain parts of it? Clearly, I understand the relationship selling piece in GBS because that's where all your cross-sell is going to come.\n\nCan you kind of talk sales force numbers, sales force targets, things like that? Anything, any granular detail would help.\n\nMike Salvino -- President and Chief Executive Officer\n\nOK, Ashwin. Thanks for that. Let's talk GBS first. So GBS, what we're doing there when I say relationship sellers, these are folks that I'm used to in my past.\n\nThese are folks that are going to be out there. They're going to know, let's take my example that I gave, the automotive industry incredibly well. Or you can take Ray, for instance, Ray August, who leads our insurance business. These folks know senior people all across the industry.\n\nAnd what they're doing is they're talking about what's going on in the industry, how can you provide value and then what we can do. And what you have in that sales force, Ashwin, is you've got projects that we have piloted that then will grow over time, which you see in the A&E space. And then you've got other pieces where we're sitting with a client, and we're literally sketching out together what that project should look like that we want to pilot. That's what I call relationship sales.\n\nWe are literally in there almost as a strategic advisor talking to the client about how they can drive more revenue or decrease more cost. Now, that workforce is something that Michael Corcoran and Ray have been adding to for probably now the last three to four months that I expect to continue to add to it. But as you know, Ashwin, those folks, it takes a long time to find the exact folks you want. So again, I think we can afford to be patient because we have a decent workforce, but we're going to continue to add to it.\n\nOK, the reverse is in terms of GIS. GIS, we've been very focused. It is a quota-carrying workforce that focuses on our fees. So here, I'm being very focused around, are you hitting your quota and are you doing the kind of disciplined deals we want? And that's why you guys see the numbers, for instance, an ITO being at negative 0.9% now.\n\nThat would have been unheard of two or three years ago. So we're being very disciplined about the work that we're putting on top. And that's why I gave you the example. Typically, I don't get on an earnings call and talk about a deal I'm going to close tomorrow.\n\nBut it's a significant deal, and I can tell you that it's better economics than I have today. So hopefully, that gives you a little bit more color, Ashwin.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nYes. No, that's quite helpful.\n\nMike Salvino -- President and Chief Executive Officer\n\nAshwin, can I say one more thing?\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nSure.\n\nMike Salvino -- President and Chief Executive Officer\n\nOK. The other color I would give you is, when I came here three years ago, you all remember all the revenue runoff. So that sales force originally was focused on making sure that the revenue didn't run off. So what does that mean? Most of that sales force was focused on renewals.\n\nIt wasn't focused on new work, and that's why I called out the 63%. That's why I called out the shift between the two businesses because we're not running some generic sales force anymore that is just trying to do renewals. We're being very targeted in terms of GBS versus GIS. So Ashwin, sorry about that.\n\nSorry to interrupt you, but I thought that was key, too.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nNo, no. That's all good. Just in terms of the -- just the -- back to the book-to-bill. As we think of sort of the pipeline, right, what's going to fill that book-to-bill coming -- in the coming quarters.\n\nCould you talk about the health of that pipeline, any decision-making that's being pushed out? Not because you're being disciplined but because clients are being careful with what they want to do, don't want to do. If you could talk about that.\n\nMike Salvino -- President and Chief Executive Officer\n\nOK. So I would tell you that both GBS pipeline and the GIS pipeline are very healthy, OK? The GBS pipeline is filled up with work we're piloting that we're now scaling. The GIS pipeline is reversed, OK? We're seeing that pipeline grow based on the performance of our competition. And that's why I harp so much on you have to deliver for your customers.\n\nIf you're not delivering for your customers, you're never going to get new work. And what we've seen in the industry in the GIS space is deals are coming to the market before their contract has expired, and they want to talk to us, which affords us, Ashwin, to be disciplined. So I'm not worried about the pipeline. And again, I'm not really worried about the book-to-bill either, and that's the proof point is this quarter.\n\nMeaning we're -- we probably -- we printed what our second best total at minus 1.5% for the total company. We definitely grew GBS again, and then we printed our best total for growth in GIS at minus 5.8%. So our focus is now that new work because I think the renewals are well in hand. I think the revenue is well in hand.\n\nNow it's time to focus on the new work and growth. That's our attitude.\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nThank you.\n\nMike Salvino -- President and Chief Executive Officer\n\nSavannah, next caller.\n\nOperator\n\nOur next question will come from Lisa Ellis with MoffettNathanson. Please go ahead.\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nHi, Good afternoon, guys, and thanks for taking my question. I wanted to dig in on the free cash flow bridge. Ken, I know you kept the outlook intact at $700 million for this year or $1.5 billion again for next year. I know there's a lot of moving pieces going on in there.\n\nCan you just help us again bridge that outlook that you see, not only the back-end loaded aspect of this fiscal year, but also looking out into fiscal '24, how you get from that $700 million to $1.5 billion? Thank you.\n\nKen Sharp -- Executive Vice President and Chief Financial Officer\n\nYes. No, that's great, Lisa. Just maybe a couple of things, right? We talked about this current year being back-end loaded, very consistent with last year. We generated $650 million of free cash flow in the back half of last year.\n\nSo I think we feel pretty comfortable with that. We had a number of discrete cash outflows that happened in the first half of this year, about $500 million. So I think when you look first half, second half, I mean, certainly, I would prefer not to have the seasonality of cash but have it be more linear, but we're comfortable with the $700 million guide. And then looking to FY '24, certainly, the improved margins are a big piece of the cash uplift, the reduction of restructuring in TSI.\n\nAnd then we continue to work through our capex and just understand how we're signing new deals and making capex commitments. And on our GIS side, it's running far higher than our peers. It's, call it, 10%, 11%, 12% when you look at any given period. And that minimum come down to the peers, which are sitting closer to 6%.\n\nThe GBS side of the business is, of course, at 1% to 2%. So I think we've got enough levers as we look at it, plus working capital, of course, that we have bridges back to the $1.5 billion. We're going to keep executing to get there. It's as simple as that.\n\nMike Salvino -- President and Chief Executive Officer\n\nSo let me add to that because the focus right now is FY '23. And if you look at what we did last year and the back-end loaded nature of that, we've got a team now that is a year smarter, is a year more focused on us making sure we have the collections and so forth. You had those two numbers up, that's $643 million plus what we've already done, and you're roughly around $650 million. So look, that gives us a lot of comfort in terms of what we're going to do.\n\nAnd I think Ken has done a great job with the finance team making sure that we've gotten a lot of the expenditures out of the way in the first half. So Lisa, that would be our answer to your first question. Do you have a second question?\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nI do. I just had a question also on the revenue outlook. I mean you came in at the upper end of your range in 2Q and down 1.5% on an organic basis, as you highlighted, one of the best results you've had over the last few years but left you that revenue outlook impact for 3Q. So just wondering, do you see upside to that outlook for 3Q or -- just given the positive trajectory you saw this quarter? Thank you.\n\nMike Salvino -- President and Chief Executive Officer\n\nLook, like I said, I think we've got a management team now that knows the business a lot better than it ever has. So what -- we feel very comfortable about the guide, not only for Q3, but also for the entire FY '23. And like I said, I like our momentum because I think everybody is seeing with what we just printed that our execution momentum is back, and I expect that to continue. Savannah, next question.\n\nThanks, Lisa.\n\nOperator\n\nYes, our next question will come from Rob Bourgeois with DeepDive. Please go ahead.\n\nRod Bourgeois -- DeepDive Equity Research -- Analyst\n\nHey guys. So I wanted to ask about the ITO business and specifically, would love to hear your comments on the underlying enablers of the lessened decline that you're seeing in that legacy ITO business. Any color on pricing, new logos, add-on work that might be contributing to that stabilization in ITO and also whether those enablers for ITO can be applied in the near future in the workplace business.\n\nMike Salvino -- President and Chief Executive Officer\n\nOK. Thanks, Rod. Appreciate the question. I'll be honest with you.\n\nIt's kind of nice staring at that 0.9% isn't it from almost, what, 20%, two or three years ago? And what I would tell you is, look, we ran the playbook on that business. We scaled our global delivery network. So we're literally putting the right people in the right locations to make sure that work is done in the appropriate manner. Ken talked about the data centers, right? We're really starting to get after the data centers and the consolidation and so forth.\n\nAnd then the last piece is the disciplined sales approach. Meaning, look, we're just not going to take a deal that if it can't get better than what we're sitting on right now or what I think is the appropriate deal economics in the market, we're not going to take it. So that's the playbook. And I think we've had a very patient approach with it.\n\nAnd we'll continue, might be a little bit lumpy, but I think that is well at hand. Now turning to your second part of your question on modern workplace. Look, that business is testing our patience -- testing my patience because it doesn't go unnoticed that, without modern workplace, we would have grown 1% in organic revenue this quarter, which a lot of people want to know how we're going to get to our FY '24 target, that's right at the low end of our FY '24 targets. So we're staying with the playbook.\n\nWe think it works. We think that we can get significant increases in that business, and that's where we're going. Rod, do you have a second question?\n\nRod Bourgeois -- DeepDive Equity Research -- Analyst\n\nYes. The follow-up, I mean, you're getting a lot of questions about the -- you've had the last couple of quarters of book-to-bill has been on the soft side, plus you've got some macro uncertainty out there now. So you're getting a lot of questions on that front. So I guess my question is, you mentioned in your commentary with your new sales model that you're now seeing that new sales model work pay off internally.\n\nCan you just elaborate on what you're specifically seeing that's giving you encouragement internally with the revenue trajectory based on the new sales model?\n\nMike Salvino -- President and Chief Executive Officer\n\nOK. So what we're seeing internally is better deal economics, full stop. That means better terms. That means making sure we get COLA.\n\nThat means better margin. That means better long-term outlook in terms of our delivery. So it is definitely a healthier deal model. And you know if you don't get these large deals right, they can impact you for several years to come.\n\nThat's what's happening in the market right now. And look, we've been at it for three years. And I think we're in a very, very good spot with definitely ITO and we're heading in the right direction with modern workplace. Look, to switch gears, GBS is totally different.\n\nAll right, GBS, we don't respond to just wrote RFPs from procurement. We're literally dealing with the senior executives at these clients, talking about what needs to happen next. That's why that automotive example, Rod, was so good. And my comment hopefully wasn't lost on the people on the call.\n\nThat has always been one of our best-kept secrets, that we are changing that perception in the market. We're competing against different competition now, and we're winning because we're providing that value. I mean when you're right in the middle of dealing with the software that goes into the cockpit of the car, you're right at the heart of what these automotive manufacturers are doing. So again, I like where we're at.\n\nAnd the reason I say that is not just because of the existing, call it, numbers or position we're in, I want to come back to what I call repeatable drivers because you can't get to where we're trying to get to, which is to ultimately be very competitive in the IT industry, if you don't have these repeatable drivers, aka the culture, delivering for our customers, a team that can take cost out, all while our customer NPS stays high. The sales model was sort of that last piece that we were doing. And then you have seen what we've done with our financial foundation, meaning the debt to capital allocation, the material weakness in the governance.\n\nSo look, I like it. We've got a good quality company, and I hope also my comments weren't lost that my team now is more focused on the future than dealing with the past. So hopefully, that gives you a little color, Rod, and I appreciate the question.\n\nRod Bourgeois -- DeepDive Equity Research -- Analyst\n\nOK. Cool.\n\nOperator\n\nOur next question will come from Jason Kupferberg with Bank of America. Please go ahead.\n\nMike Salvino -- President and Chief Executive Officer\n\nHi, Jason.\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good evening. This is Tyler DuPont on for Jason. Thank you for taking the question.\n\nJust relating to margins, particularly, I was wondering if you could talk a little bit more about the conversations you're having with clients around pricing. You've mentioned in previous quarters, you made conscious decisions to kind of push out projects that didn't have the right pricing you were looking for. And it looks like the 3Q guide is around 75 bps above 2Q at the midpoint. So how quickly or to what extent do you think you can continue to pass on price increases, if at all, or if there's any additional leverage you have available to use?\n\nMike Salvino -- President and Chief Executive Officer\n\nOK. So we -- let's talk GBS and then GIS. So GBS, we've seen price increases, and that's just the market. We talked about how scarce those engineers and software developers are.\n\nSo our clients are willing to talk to us about price increases because of the value we're delivering for them in the market. On GIS, I keep saying it over and over again. Meaning the exercise that we have to go through with a client is to show them how the deal they're sitting on right now is not priced appropriately, that it was done years ago and it literally doesn't make any sense in today's day and age. And that takes time, all right? Because a lot of deals were done.\n\nWhen you look at the ITO space, it was basically a very price-competitive environment. And what we're doing is literally stacking what we can do, our qualities, our capabilities and then our references up against who's in the market, and we're doing incredibly well. So -- and we're going to continue to play that game because I believe it's working. Not only people may want to point at the quarterly book-to-bill.\n\nBut again, I look at that 12-month trailing and we're fine, and if that's going to help us fuel the growth that we need to hit our both short-term and long-term targets.\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nOK. Great. I appreciate that. And just one quick follow-on.\n\nI know you've mentioned macro, and you briefly mentioned the progress you've had in your segments. But from trying to think of macro from more of a geographic standpoint, is there anything specific to call out there? I know you know that with the Luxoft acquisition a while ago that, that may have had some negative impact given what's happening in Eastern Europe. So just any thoughts there?\n\nMike Salvino -- President and Chief Executive Officer\n\nI mean, look, we stay very close to that situation. I think that we've done a fantastic job taking care of our people. It is a very unfortunate situation with Ukraine, but we haven't seen increased cost or what have you in that region. So -- and again, Luxoft is a major piece of that A&E team.\n\nAnd you can see that business continue to grow along with the book-to-bill is very healthy.\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nOK, great. Well, I appreciate that. Thank you very much.\n\nMike Salvino -- President and Chief Executive Officer\n\nNo problem. Savannah, one final question.\n\nOperator\n\nAnd our final question will come from James Faucette with Morgan Stanley. Please go ahead.\n\nUnknown speaker\n\nHey, guys. You've got Jonathan on for James. First one will be on sort of the lengthening decision cycles that you talked about. Can you talk through which specific areas you may be seeing that in and how you're contemplating that in your outlook for the year?\n\nMike Salvino -- President and Chief Executive Officer\n\nGive me that question again?\n\nUnknown speaker\n\nSo you had mentioned some lengthening decision cycles earlier in the discussion. Can you talk about which specific areas you're seeing that in? And how you're taking account for that -- or rather how you're accounting for that in your current outlook?\n\nMike Salvino -- President and Chief Executive Officer\n\nOK. You're talking about lengthening decisions on deals?\n\nUnknown speaker\n\nCorrect.\n\nMike Salvino -- President and Chief Executive Officer\n\nIs that what you're saying? OK. So look, I mean, that's baked into the outlook. I mean it's as simple as that. And what we've done is we've looked at and specifically, that's the GIS business.\n\nAnd that is literally what I'm messaging to you all that we're going to continue to take a disciplined approach. That's going to continue to help us drive our margins. It's going to help us continue to consolidate our data center. It's going to continue to help us scale our GDN so that we can get that business to a spot where we feel really good about it.\n\nSo yes, that's definitely baked into what our guidance is. And if you go back and look at what I've been saying since the beginning of the year, it's been baked into the yearly guidance the whole year, all right? I've been talking about this disciplined approach.\n\nUnknown speaker\n\nGot it. Thanks, Mike. And on that point around scaling global delivery, and I want to talk through hiring. So can you dig into potential competition for talent and then how you're thinking about wage inflation in the current environment?\n\nMike Salvino -- President and Chief Executive Officer\n\nOK. So the competition for talent, usually, we focus on -- it's across the board, but literally the high-scale piece is that we have a lot of competition around is what I highlighted in my prepared remarks. It's usually in GBS. And look, you can pay people whatever you want.\n\nIf you don't have the right culture, those folks will not stay around. And that's what my team has been focused on. It's been focused on since we put in the transformation journey. I'm very proud of the culture that we put together, especially how we've cared for people during the COVID also the Russia or Ukraine situation.\n\nThat culture keeps people around. It's not just the wages. And that's the way we think about it. Fair enough?\n\nUnknown speaker\n\nLoud and clear.\n\nMike Salvino -- President and Chief Executive Officer\n\nAll right. Well, look, I appreciate everybody joining the call today. And what I would finish with before I close the call is you can see that our Q2 results, we've got our execution momentum back. We're very focused on our transformation journey because we think it's delivering for our customers and colleagues.\n\nAlong with that, it is building what I call these repeatable drivers of the business that allows my leadership team to now focus on the future versus the past and gives us the confidence that we can hit both our short-term and long-term goals. And with that, Savannah, please close the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Sweeney -- Vice President, Investor Relations\n\nMike Salvino -- President and Chief Executive Officer\n\nKen Sharp -- Executive Vice President and Chief Financial Officer\n\nZach Ajzenman -- Cowen and Company -- Analyst\n\nAshwin Shirvaikar -- Citi -- Analyst\n\nLisa Ellis -- MoffettNathanson -- Analyst\n\nRod Bourgeois -- DeepDive Equity Research -- Analyst\n\nTyler DuPont -- Bank of America Merrill Lynch -- Analyst\n\nUnknown speaker\n\nMore DXC analysis\n\nAll earnings call transcripts"
}