{
  "companyName": "SelectQuote, Inc.",
  "companyTicker": "SLQT",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/29/selectquote-inc-slqt-q4-2022-earnings-call-transcr/",
  "content": "SelectQuote, Inc. (SLQT 1.45%)\nQ4 2022 Earnings Call\nAug 29, 2022, 8:30 a.m. ET\n\nOperator\n\nWelcome to SelectQuote fourth quarter conference call. [Operator instructions] It is now my pleasure to introduce Matt Gunter, SelectQuote investor relations. Mr. Gunter, you may begin the conference.\n\nMatt Gunter -- Investor Relations\n\nThank you, and good morning, everyone. Welcome to SelectQuote's fiscal fourth quarter earnings call. Before we begin our call, I would like to mention that on our website, we have provided a slide presentation to help guide our discussion. After today's call, a replay will also be available on our website.\n\nJoining me from the company, I have our chief executive officer, Tim Danker; and interim chief financial officer, Ryan Clement. Following Tim and Ryan's comments today, we will have a question-and-answer session. In order to allow everyone the opportunity to participate, we do ask that you limit yourself to one question and one follow-up at a time and then fall back into the queue for any additional questions. As referenced on Slide 2, during this call, we will be discussing some non-GAAP financial measures.\n\nThe most directly comparable GAAP financial measures and a reconciliation of the differences between the GAAP and non-GAAP financial measures are available in our earnings release and investor presentation on our website. And finally, a reminder that certain statements made today may be forward-looking statements. These statements are made based upon management's current expectations and beliefs concerning future events impacting the company and therefore, involve a number of uncertainties and risks, including, but not limited to, those described in our earnings release, annual report on 10-K and other filings with the SEC. Therefore, the actual results of operations or financial condition of the company could differ materially from those expressed or implied in our forward-looking statements.\n\nAnd with that, I'd like to turn the call over to our chief executive officer, Tim Danker. Tim?\n\nTim Danker -- Chief Executive Officer\n\nGood morning, and thank you all for joining us. We're pleased to report a strong fourth quarter relative to our initial expectations, and we are encouraged by the early achievements SelectQuote has made since we outlined our strategic redesign back in fiscal second quarter. Between the operational improvements we are seeing in our core senior business and continued success of SelectRx, there is a lot to be optimistic about for SelectQuote. I'll provide color on each of these strategic initiatives in a minute.\n\nBut first, let's turn to Slide 3 to review the highlights from our fourth quarter and full year 2022. SelectQuote drove strong operating results relative to our internal forecast in both our core senior business and on a consolidated basis in the fourth quarter. Senior revenue was $98 million, and consolidated revenue totaled $139 million for the quarter. Our net loss for the quarter totaled $105 million or negative $0.64 per share.\n\nOperationally, this was the second consecutive quarter of improving trends in our senior business, trends that we believe are tied to our initiatives to optimize SelectQuote and drive better returns and more predictable cash flows. For instance, our agent close rates increased 31% compared to a year ago, and our marketing cost per approved policy decreased 35%. Lastly, our SelectRx business finished the quarter above our original expectation of 25,000 members. We feel these results validate the service we provide to consumers and speak to how well SelectRx fits with SelectQuote and the healthcare services continuum.\n\nWe're pleased with the better close rates, which aided revenue growth. And more importantly, we are seeing green shoots that our customer retention trends are stabilizing and improving. And as mentioned, our results were also driven by continued success in our SelectRx business. Overall, this was the second consecutive quarter of good momentum as we look ahead to 2023.\n\nWe believe SelectQuote is transforming in a more predictable and efficient company, focused on consistent returns instead of pure growth. To that point, as part of our 2023 forecast review, in the fourth quarter, we elected to recognize an additional $48.3 million adjustment for certain cohorts to address potential renewal pressure that could have triggered adjustments in 2023 or 2024. To be clear, the adjustment is not a reflection of recent persistency in trends, which we believe have stabilized. And while we're not pleased with another downward revision, we have a high degree of confidence this action has significantly derisked the potential for further adjustments in the future.\n\nRyan will provide additional color on that point later in our remarks. In summary, we believe SelectQuote has established a foundation to drive better returns and cash flow with less volatility in our forward financials. With these actions, we have positioned the company and our investors for improving returns in the future. With that, let's turn to Slide 4 and review the pillars of our new strategy and detail the foundation SelectQuote has built for the upcoming year.\n\nFirst, as noted, our philosophy on growth has changed significantly. Our forecast for 2023 implies a 35% to 45% pullback in our Medicare Advantage policy production. The market opportunity for a very large and growing population of American seniors would clearly support continued growth. But as we've said, we're committed to policy sales that generate consistent unit economics and cash flow.\n\nWith our increased emphasis on cash flow, we anticipate our cash EBITDA will be significantly improved and approaching breakeven for fiscal '23. Let's summarize a few of the initiatives in place to drive that goal. First, we've identified a number of opportunities and are targeting and marketing to drive better sales efficiency and policy performance. Similarly, we're confident that our refined approach to our agent population will also improve productivity and customer retention.\n\nSpecifically, this season, our agents will skew more heavily to core tenured staff over flex agents in order to achieve our goal to generate improved returns and cash flow through better agent productivity and marketing efficiency. Second, we have made strides to reduce our operating leverage, which we expect will reduce volatility in our results as well as improved returns. To date, we have identified over $250 million in year-over-year cost reductions, including around $40 million in fixed expenses. In addition, we believe earlier hiring and training of our agents ahead of next AEP will aim productivity, which in turn would reduce the marketing and operating cost per policy.\n\nWe're pleased to announce that we've completed hiring our sales agents force for AEP in July and are already several weeks into training and onboarding this new class. Similarly, we believe more targeted marketing will also provide cost benefits during the upcoming season. Turning now to LTV. As we've noted repeatedly over the past few quarters, we believe we've taken significant action to reflect the current reality of policyholder persistency in both our legacy cohorts as well as our newly written business.\n\nTo summarize, modeled LTVs are now down about 30% from the peak. And we've nearly tripled our constraint to 15% over that same period. Additionally, as noted, the tail adjustment we made in the fourth quarter further derisks future results. Although early, we're quite pleased with how the 2022 cohort is performing relative to LTV expectations.\n\nMore importantly, we believe the risk of additional cohort tail adjustments has been significantly reduced, moving forward. This is important as we build our profitability and candidly reestablish credibility with investors in the coming years. Finally, we continue to be very encouraged by our continued success in healthcare services, highlighted by SelectRx. We ended fiscal 2022 with over 25,000 members and are now forecasting the business with revenues exceeding $275 million for fiscal year 2023.\n\nThis is an impressive ramp for a business acquired with just over $25 million of revenue, a little more than a year ago. There'll be more to share about healthcare services in the quarters and years ahead, but we're very pleased with the validation of our strategy to leverage SelectQuote's unique position in the healthcare ecosystem. And as a reminder, our leverage here stems from the synergy of existing customer acquisition spend and our senior distribution business. We'll share more here over time that, that unique competitive advantage has the potential to yield significant returns for SelectQuote.\n\nFirst of all, we believe our healthcare services offering seamlessly align with our long-term trusted, two-way relationships with patients, health plans, providers and most importantly, our shareholders. As we move to Slide 5, let me highlight three key operating trends in our recent results. First, we've seen encouraging early data from our efforts to improve policyholder persistency. As summarized in the pillars of our strategy, we've made early strides beginning in OEP to refine our marketing but focused targeting in channel optimization.\n\nThe primary goals here are better persistency trends as well as improved sales and cost efficiency. For instance, as I mentioned, our customer acquisition cost declined 35% year over year, and our sales conversion improved 31% year over year in 4Q, marking the second consecutive quarter of improvement for both metrics. And most importantly, while still early days, the year-over-year comparison of our approved policy persistency bottomed in the third quarter and have since shown consistent improvement. To be clear, we are not declaring victory and continue to closely monitor these trends to discern the impact of our initiatives.\n\nThat said, we're encouraged by the retention trends and will pursue incremental improvements as we move into the upcoming AEP season. We've also prepared our agent population much earlier for AEP. As I noted, our AEP recruiting class is now fully hired and in the midst of training and onboarding. We're also doing a good job retaining our highly productive tenured agents, evidenced by an improved year-over-year retention rate.\n\nAs you recall from our comments in previous quarters, we've historically seen higher levels of productivity and policy retention for tenured core agents compared to newly hired or flex agents. We have conservative expectations, but we believe the combination of a more tenured agent salesforce and more targeted market on smaller cohort of policies positions us well to demonstrate better policyholder retention and overall returns. Lastly, as we've noted, a lower cost base and continued work to optimize profitability and cash flow should benefit 2023 and the years ahead, while simultaneously reducing volatility in our operating results. I also want to highlight the significant ramp we've seen in our SelectRx membership, as you can see here on Slide 6.\n\nSelectRx offers specialized in-home services to medically complex patients managing multiple chronic conditions. This convenient and coordinated prescription drug delivery has been more than well received. As we exit fiscal 2022 with over 25,000 members, we're highly encouraged about the potential of this business. For context, over 70% of our 25,000-plus SelectRx members were introduced to the business through an MA policy acquired through SelectQuote.\n\nAdditionally, about 15% of those members originated from another business line's lead generation and referral activity. The bulk of the remaining new SelectRx members came largely from prospects who originally responded to our Medicare plan marketing but did not ultimately buy a Medicare policy from us. In summary, the vast majority of our new SelectRx members came to us without incurring incremental marketing expense directly associated with the promotion of SelectRx. This underscores the power of SelectQuote's ecosystem and why we are uniquely positioned to significantly grow this business with relatively low incremental marketing expense.\n\nIn future quarters, we plan to share additional detail and disclosure on SelectRx and our Healthcare Services business. For now, we're excited about both the stand-alone opportunities and even more excited about the synergy and advantages we see in healthcare services fits with SelectQuote's positioning as a connector within healthcare more broadly. Lastly, before Ryan speaks to our results, I'd like to reiterate our goals and strategy for fiscal 2023 on Slide 7. First is a baseline.\n\nOur business model was originally conceived to be an aggregator of significant market share in what remains a substantial and growing market of American seniors. We attack this market with a scaling population of agents to consume a rising breadth of sales leads. This concept was strategically sound and a stable competitive environment but eroded as competition increased rapidly from other distribution platforms. Fast forward to today, SelectQuote has worked incredibly hard over the past six to nine months to pivot our model to ensure attractive policy level returns and disability in those returns.\n\nWe're also focused on cash flow and lowering volatility in our financials. In parallel, we've continued to advance the success of SelectRx and believe there is significant potential for our competitive positioning as a combined distribution and healthcare services platform to drive profitable growth and cash flow for shareholders in the years ahead. Again, it is our responsibility to earn that credibility with you all through execution and results, but standing where we are today, we feel confident in our foundation and strategy to achieve that goal. With that, let me turn the call to Ryan.\n\nRyan?\n\nRyan Clement -- Interim Chief Financial Officer\n\nThanks, Tim. Let me begin with a quick review of our results, and then I can give some context on our senior KPIs as well as the cohort tail adjustment we recognized this quarter. I'll then follow up with a review of the key assumptions in our consolidated guide for fiscal 2023. First, for the fourth quarter, as Tim noted, consolidated revenue for 4Q of '22 was $139 million and consolidated adjusted EBITDA was negative $61 million or negative $13 million when excluding the $48 million cohort tail adjustment recognized in the quarter.\n\nRevenue was primarily driven by growth in our senior business, and somewhat offset by a reduction in our Life business, driven by lower term life premium, which was the result of fewer agents and continued COVID pressure on conversion of sold policies to in-force policies. Our auto and home revenue was flat year over year. Overall, we are pleased with the operating results and believe they are in line with our transition and showed good progress in our strategic goals to drive better returns and cash flow. If we turn to Slide 8, I'll give some context on the key KPIs in our senior distribution business.\n\nTotal approved policies from the senior division increased to 144,000, up 23% over the same period last year. As we noted last quarter, we saw ramping productivity from new and flex agents as the season progressed. As a result, comparable close rates increased 31% and marketing cost per approved policy declined 35% year over year. We would largely attribute these improvements to higher average agent tenure as well as the initial impact of our strategic redesign initiatives and the special election period.\n\nOn the middle chart, you can see the 22% year-over-year decline in our Medicare Advantage LTV, which, as we've noted, has been driven by lower policyholder persistency. As Tim detailed, we have seen good initial trends and persistency year over year, while encouraging our base operating assumption, both for our strategic redesign as well as our 2023 guide that this level of lower LTV will be the new reality of the industry. In an effort to reduce potential future volatility, we'll maintain our 15% constraint in fiscal year '23, even as we make lower go-forward persistency assumptions into our LTV calculations. Overall, we believe our strategy is very well positioned to drive improving unit economics in our senior business, even with lower LTVs.\n\nTo that point, we would note that our cost per policy in the quarter declined by 24% year over year, which we believe is a direct result of the strategic cost initiatives we continue to pursue. Again, to emphasize Tim's point, we're having success driving positive operating leverage in our core senior business, even as we transition our strategy. Now if we flip to Slide 9, let us provide some additional context on the $48.3 million cohort tail adjustment we recognized this past quarter and the impact we have seen in our receivables to date. Naturally, the key question we have received is about how much risk remains within our cohorts from lower persistency.\n\nFollowing this quarter's cohort tail adjustment, we feel that the vast majority of the exposure has now run through our income statement. We developed this page to provide detail to help you all see why we are confident that we have significantly derisked the portfolio from additional adjustments in future periods. First, as you know, we have already recognized significant adjustments to our assumed LTV for those cohorts, which you can see in the chart. As persistency rates have declined over time with increased competition in the market, LTVs have trended below our initial models.\n\nAs you can see here, with our adjustments to date, we have now lowered effective LTVs by about 20% in the cohorts written from 2018 through 2021. While we cannot ensure that LTVs will stay here, we have good visibility into the seasoning of our back book and believe risk of future adjustments from those cohorts is low. Specifically, we have now collected around 70% of the cash flows for these policies compared to the adjusted LTVs, which we highlight here to emphasize how little tail risk we believe exists in our legacy book. And as a reminder, for seasoning, beyond the first year, the variability on persistency dropped significantly compared to switching that occurs in the first year.\n\nNow, if we consider the 2022 cohort as well as our plans for 2023 and beyond, it's important for our investors and analysts to recognize that our assumed LTVs for these policies is about 30% lower than what we modeled for the cohorts of the past few years. The $875 assumed LTV for 2023 is a function of our three-year look back, baking in lower recent persistency plus the continued utilization of the 15% constraint, which we first applied in 2Q of fiscal year 2022. While it is important for context that LTV has come down in our assumptions by a wide margin and our accounting assumptions are significantly more conservative, the most powerful impact, in our view, will be our focus on writing policies with the best return dynamics and cash flow instead of solely focusing on volume. Now if we turn to Slide 10, let me outline our key assumptions and outlook for fiscal year 2023.\n\nFirst, we expect consolidated revenue in a range of $850 million to $950 million for the year based on the following assumptions. For senior policy volumes, we expect a 35% to 45% year-over-year decline which is in line with our strategy to prioritize policy level returns and cash flow over growth. As indicated, we are focusing more attention on cash flow, going forward. And with this pullback, we anticipate that we will actually generate more cash flow from policy commissions and incentives than we will spend to sell new policies this year.\n\nIn short, we believe the cash flow profile of our business will dramatically improve in 2023. Next, as I touched on in the previous slide, our 2023 revenue guide assumes lifetime values of $875, which we believe reflect the current competitive state of the industry and also incorporates a more conservative 15% constraint. Lastly, we forecast over $275 million revenue from our rapidly growing Healthcare Services business, which is predominantly SelectRx. As we've noted, we plan to provide additional disclosure on this division in future as the business continues to scale.\n\nIn regards to profitability, as we have noted, we expect 2023 to be a year of transition as we continue to implement our strategic changes. We are projecting a fiscal 2023 net loss in a range of $113 million to $89 million and expect adjusted EBITDA to be in a range of negative $20 million to positive $10 million. For our core senior business, we believe we are well positioned to drive improving policy level economics beyond 2023. It is important to remember that ties to this strategy is our ongoing effort to optimize cost.\n\nLast quarter, we said we'd identified around $200 million of run rate cost savings. Today, that number exceeds $250 million. On the flip side, our Healthcare Services business continues to be a compelling growth avenue for SelectQuote. And as a result, we continue to invest in that growth, given the attractive cash flows and returns we see in the business.\n\nAs I mentioned, we will provide additional disclosure on the business in the future, but for your modeling, we expect EBITDA will break even in the second quarter of the year. Finally, I'm pleased to announce that we have reached an agreement on an amendment to our current credit covenants with our lenders that we believe will provide adequate liquidity to operate the business in the coming quarters. With that, let's get to your questions. Operator?\n\nOperator\n\nAbsolutely. [Operator instructions] The first question comes from the line of Elizabeth Anderson with Evercore. Elizabeth, you may proceed.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nHi, guys. Good morning. Thanks for the question. My question was just regarding -- you talked about the fact that you have all the agents hired for the 2023 AEP season.\n\nCan you talk about sort of what you're doing differently this year with that? I think you mentioned that obviously, it's a more tenured group. But with some of the changes that we've had about some of the requirements of what they have to do, etc. I just want to understand how you guys see that playing out at this point.\n\nTim Danker -- Chief Executive Officer\n\nYeah, Elizabeth. Good morning. This is Tim. Thanks for joining, and thanks for the question.\n\nI'll make a few opening comments and then maybe turn it over to Bill. I think just more broadly with respect to AEP readiness, we feel very well positioned this year from an agent perspective, and Bill can speak to this. We've secured our flex agents very early this year, and we're pleased with their progress in training. From a core agent perspective, we look to the past two quarters, the improvements in close rates.\n\nOur attrition levels for our core agents are actually better year over year, and Bill can maybe touch on other things regarding marketing. Certainly, we'd note the improvements in cost of acquisition, not only in fourth quarter, but in third quarter. So we feel, overall, very well positioned. Bill?\n\nBill Grant -- Chief Operating Officer\n\nYeah. So specifically around the class, what we did to address or prevent the problems from what occurred last year, I guess. We learned a lot from certainly what happened last year and how the market, I would say, post COVID and how they reacted with kind of the hiring environment, so to speak. I think if you remember last year, we had a lot of folks that would say yes and then wouldn't go through the licensing process.\n\nSo we had to move a lot of our ratios around. We started significantly earlier and then we were recruiting less spokes. So all of those things combined, I think, led to a much earlier class being hired as well as we think and believe higher quality and all of our kind of leading indicators would suggest that thus far.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. And then as a follow-up, what gives you comfort? I know that you talked about some of the cohort analysis on Slide 9. What gives you comfort that $875 really is the right number for fiscal '23 in terms of only LTV?\n\nBill Grant -- Chief Operating Officer\n\nYes. Thanks, Elizabeth. I think, on that slide, as you move from left to right, we had $875 in 2023. And to the right, you saw that in prior periods, it was -- LTVs were much higher.\n\nWe've obviously brought those down significantly. I think it's important to note that the vast majority of the switching and the highest persistency pressures does occur in the first year to second year. And so when we look at those older cohorts, we are beyond that point. So we have better visibility into the cash stream that we would expect to generate from those policies, going forward.\n\nAs we move, I guess one other point there is, we have collected 70% of the lifetime value that we'd expect to calculate or to generate from those policies. As we move into more recent cohorts, in 2022, obviously, it does incorporate lower persistency as a result of the past couple of years and the pressures we've experienced. But we've also layered in that incremental constraint of 15%, which is nearly triple what we had in prior periods and worked out to about $100 per policy. That cohort, the fiscal year 2022 cohort is just performing very well.\n\nWhen we look to 2023, obviously, another year of higher persistency falls off. And so the calculation is a little bit lower. We have decided to maintain that 15% constraint, just to keep it conservative. And so overall, we do believe that the vast majority of the back books is secure and that there's -- the risk is largely behind, and we feel good about the economics that we're writing in the new policy there.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nThank you. The next question comes from the line of Jonathan Yong with Credit Suisse. You may proceed, Jonathan.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nHey. Thanks for taking the question. I know we're not in AEP yet, but within the context of your guidance, can you give us color on how you're thinking about MA enrollment and the number of policies or direction in growth rates? I know it will be down year over year, but if you could give us any color there.\n\nBill Grant -- Chief Operating Officer\n\nYeah, so we are assuming in the AEP period a pullback in overall policy production, that is part of our strategic redesign. We do have all the agents hired. And we feel good as we're entering in the AEP season, but there is a pullback.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nOK. Any color on the...\n\nTim Danker -- Chief Executive Officer\n\nJonathan, I might -- yeah, I might add to that, Jonathan. I guess we looked at '23, and we've highlighted this in the prepared remarks. Certainly, a year of transition of fiscal '22 was a very difficult year for the company yet. We certainly see greener pastures ahead.\n\nAs we looked at it, I mean, the market opportunity is certainly large enough to bear more production, but we wanted to base the pullback on growth, where we thought we could drive the best returns on invested capital. As we've committed to, we needed to reduce operating leverage and some of the operational risk factors that were problematic last year and ultimately put a stronger focus on cash flow. And so we were very deliberate with the plan this year, how could we drive our best marketing sources with our best, most productive agents. And that's really what we've outlined in this 30% to 45% policy pullback year over year.\n\nAnd we think that, that certainly will dramatically improve the cash flow profile of our business. And again, we're marching toward cash EBITDA breakeven this year.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nOK. Great. And then on the -- you increased the cost savings from $200 million to $250 million now, fixed components staying the same. But I guess relative to our models and consensus, I guess, your EBITDA guidance is actually slightly worse than consensus about in-line with ours.\n\nMaybe it was a little bit mismodeling, but I guess with that increased $50 million, I thought there would have been a little bit more pull-through in the EBITDA line. So can you give us any color there on what may have changed, maybe it's timing or anything of that nature? Thanks.\n\nRyan Clement -- Interim Chief Financial Officer\n\nYeah. So with respect to...\n\nTim Danker -- Chief Executive Officer\n\nGo ahead, Ryan.\n\nRyan Clement -- Interim Chief Financial Officer\n\nYes. I think there's two pieces in place. So one, when we calculated and shared $200 million, we're actually slightly above that in total. But secondarily, there is some timing.\n\nWhen we look at the AEP and kind of what we're hearing early reads as well as recent business performance from a cost per client acquisition, we do believe that the overall cost is going to come in favorable. So that's really what's driving the total average savings of $250 million. We are still expecting the fixed cost savings of $40 million, at that $40 million range.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nOK, thanks.\n\nOperator\n\nThank you. [Operator instructions] The next question comes from the line of Meyer Shields from Keefe, Bruyette & Woods. You may proceed.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. Thanks. Good morning. Thanks for taking my question.\n\nCan we get a little more detail on the credit covenants? Is there a change in the interest rate or the dollars that you expect to spend on interest in fiscal year '23?\n\nRyan Clement -- Interim Chief Financial Officer\n\nYeah, so we're obviously very pleased to have the amendment in hand and to have had -- our lenders are willing to work with us. As customary with amendments, there is obviously an economic component to that. And with that, in the coming year, there is a step increase in the overall interest rate. A portion of that is payment in kind and roughly one-third of it is actual cash interest.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nOK. With regard to the tenured agents, is there -- in other words, looking at the same cohort -- that's wrong, I'm sorry, the same group of tenured agents relative to last year or the year before. Is there any change to their compensation?\n\nRyan Clement -- Interim Chief Financial Officer\n\nNo, Meyer, good question. There is not any change to their compensation per policy basis. We do expect with a more tenured force and just kind of are planning for AEP that their overall compensation will be a bit higher because the productivity will be a bit better. We didn't necessarily model that way, but we are confident we can drive good results there, but no overall change.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nOK, perfect. Thanks so much.\n\nOperator\n\nThank you. The next question comes from the line of Daniel Grosslight with Citi. Daniel, your line is now open.\n\nDaniel Grosslight -- Citi -- Analyst\n\nHi. Thanks for taking the question. I'd like to focus a little bit on the synergies that you mentioned between your, let's call it, the core Medicare Advantage comparison solution and SelectRx. I think you said around 70% of SelectRx members are actually introduced through Select Rx through that core MA solution.\n\nAnd then there's some more on top of that, that didn't actually select the MA policy through you guys, but ended up on SelectRx anyways. I'm curious, how the slowdown in MA membership acquisition is going to impact the growth of SelectRx, given a bulk of those SelectRx members are acquired through your core MA comparison solution?\n\nTim Danker -- Chief Executive Officer\n\nYeah, Daniel, good morning, and thanks for the high-quality question. We're very pleased with the synergistic relationship we're seeing here, extremely strong consumer demand. We eclipsed the goal that we set out for the year of 25,000 members. And I think we're seeing, as we highlighted on our prepared remarks, this is a business that we're generating for Rx that's fantastic for the consumer and is absolutely leveraging the existing MA spend.\n\nWe're seeing that across both customers that purchased MA policy with us as well as those that ultimately don't purchase a policy. But I might ask that Bob speak more to that and how we're looking at that, going into '23.\n\nBob Grant -- President, Senior Segment\n\nYes. Thank you for the question. Just as a reminder, we did not start really growing that business until late in the year. So we don't think that, that will come with any really pull-down or anything like that.\n\nThe 70% that we referenced is 70% of the members in SelectRx are ones from our core business, not necessarily 70% total attachment rate, if you look at the two numbers. Therefore, we still have a lot of room for upside with that. So very, very excited about the progress there. And what it does for a customer really helps their overall medication experience.\n\nWe see really, really strong adherence rates within that. And then also, when eligible, we see really strong MTM rates as well. So we are very excited about our progress there and the revenue and value that's driving.\n\nDaniel Grosslight -- Citi -- Analyst\n\nGot it. OK. So we'll have room to grow SelectRx in that kind of existing MA membership base. And then I guess a big-picture question for you guys.\n\nIf you listen to the earnings report of all your public competitors and even talked to some of your private competitors too, everyone on the e-broker side is cutting marketing and agent hiring costs pretty dramatically. And then if you look at what the carriers are saying and what CMS is projecting for MA overall, it continues to grow rapidly. So obviously, a shift in where members are going to be getting their policies from. So two questions there.\n\nAre you assuming more beneficiaries, going forward, are just going to go direct to the carriers or access through traditional agents? And secondly, how do you think the slowdown broadly in marketing and agent hiring for the sector is going to impact persistency, LTVs and tax going forward?\n\nTim Danker -- Chief Executive Officer\n\nGreat question, Daniel. I'll maybe address your second question first, and then I have Bill and Bob comment on the first one. I mean, I would say, with respect to the competitive environment, I mean, we are seeing a pullback in spend and competition. And we do think that, that is -- could -- we could certainly benefit from that.\n\nIt could lead to more rational behavior, long term. But with that said, I mean, we're not -- this isn't a strategy based upon hope. We are controlling the controllables. And we certainly think that we can drive better returns in the business.\n\nAnd we haven't talked a lot about it on the Q&A here. But the persistency results that we're seeing from a series of actions that we've taken really starting late in the third quarter across marketing segmentation to agent retraining to modifications to sales comp to changes in our tech stack, we're starting to see those persistency pressure stabilize and actually are witnessing a little bit of year-over-year improvement. So we think that, that's all encouraging early signs, and maybe turn it over to Bill or Bob on your first question.\n\nBill Grant -- Chief Operating Officer\n\nYes. I mean I can certainly comment from the marketing side. We certainly see it kind of right now with a tailwind all the way around, both from just the volume that is available as well as the quality. We've been able to do two things.\n\nOne, we've been able to decrease cost fairly significant while getting a better-quality customer. As it relates to where the business will go, I think that you don't kind of see how that plays out. And certainly, the combination of carriers, obviously, with COVID kind of winding down some of the FMO channels in terms of the face-to-face agents, it's coming back a bit and then certainly the e-channels. I also think that there will be a bit of just less marketing that's driving those calls sometimes.\n\nSo last year, if you look at it, you have the airways were kind of being really jammed over and over and over again with ads, more and more ads. I think you'll see less of that this year. So hopefully, you'll see with that, as Tim mentioned, maybe better persistency or folks jumping plan into plan, thinking that there's something better out there for them.\n\nBob Grant -- President, Senior Segment\n\nAs far as the carriers go -- I was going to say, I think Bill spoke to it well that they're well diversified, can't necessarily speak to their overall growth strategy. But FMO channel has definitely come back a bit, and they're diversified within our channel. So yes, you've seen the public companies pull back, really focused on growth and those things, but I don't really want to speak to exactly how they're planning their growth.\n\nDaniel Grosslight -- Citi -- Analyst\n\nYeah, yeah. Thank you.\n\nOperator\n\nThank you. The final question from the line of Ben Hendrix with RBC Capital Markets. Ben, your line is now open.\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nThank you very much. I just wanted a quick follow-up on credit agreement covenants. Having elected to recognize that additional $48 million of tail adjustment here in the quarter. Can you talk about the cushion that you have under the new minimum asset coverage ratio? And kind of give us an idea of your tolerance for additional potential tail adjustments, should persistency decline further.\n\nThanks.\n\nBob Grant -- President, Senior Segment\n\nYeah, so I think there's a couple of parts in there. One, with respect to persistency in the $48.3 million, I think it's worth pointing out that this is not as a result of new persistency pressures. And in fact, we're actually feeling good about some of the positive trends that we're seeing from a persistency perspective. That said, as we are preparing to guide for fiscal year 2023 and doing the quarterly analysis that we do each quarter, it did become clear that some cohorts that had not fully exhausted their constraint would be doing so in the coming quarters ahead.\n\nAnd so it made sense to go ahead and take that at this time. That has been all factored into the covenants and the compliance ratio on a go-forward basis. We've spent a lot of time with the lenders, walking them through our plan for fiscal year 2023. And our covenants are set in line with those -- the compliance calcs that are embedded within our guide.\n\nWe do have some buffer. And we've been intentional on making sure that we have a plan that we can execute against.\n\nTim Danker -- Chief Executive Officer\n\nYeah, I would just emphasize the last point, Ben. I mean we -- this amendment provides the covenant adjustments and the liquidity we need to operate the business for fiscal '23, and we feel good about that position and preparation going into AP.\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nThanks, guys.\n\nOperator\n\nThank you. There are no questions waiting at this time. So I would now like to pass the conference over to Tim Danker for closing remarks.\n\nTim Danker -- Chief Executive Officer\n\nYes. Thanks again for joining us this morning. As we've noted before, we take our responsibility to produce improved and more stable financial results very seriously. We're committed to earning that credibility with investors to our results.\n\nAs we stand here today, we're clearly shifting our strategy for fiscal '23, but we're increasingly confident of the success in that strategy, based upon the early results that we have seen from our initiatives. So we look forward to sharing more with our -- about our progress on that end. We look forward to talking with you soon. Thanks, again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Gunter -- Investor Relations\n\nTim Danker -- Chief Executive Officer\n\nRyan Clement -- Interim Chief Financial Officer\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nBill Grant -- Chief Operating Officer\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nDaniel Grosslight -- Citi -- Analyst\n\nBob Grant -- President, Senior Segment\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nMore SLQT analysis\n\nAll earnings call transcripts"
}