{
  "companyName": "Raytheon Technologies",
  "companyTicker": "RTX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/raytheon-technologies-rtx-q3-2022-earnings-call-tr/",
  "content": "Raytheon Technologies (RTX 0.59%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Raytheon Technologies third quarter 2022 earnings conference call. My name is Livia, and I will be your operator for today. As a reminder, this conference is being recorded for replay purposes. On the call today are Greg Hayes, chairman and chief executive officer, Neil Mitchill, chief financial officer, and Jennifer Reed, vice president of investor relations.\n\nThis call is being carried live on the Internet, and there's presentation available for download from Raytheon Technologies' website at www.rtx.com. Please note, except where otherwise noted, the company will speak to results from continuing operations, excluding acquisition accounting adjustments and net nonrecurring and/or significant items often referred to by management as other significant items. The company also reminds listeners that the earnings and cash flow expectations and any other forward-looking statements provided in this call are subject to risks and uncertainties. Raytheon Technologies' SEC filings, including its Form 8-K, 10-Q and 10-K, provide details on important factors that could cause actual results to differ materially from those anticipated in forward-looking statements.\n\n[Operator instructions] With that, I will turn the call over to Mr. Hayes.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nThank you, Livia, and good morning, everybody. As you can see in the press release this morning, RTX had another solid quarter of growth led by commercial aerospace and extremely strong demand for our products, with over $22 billion of awards in the quarter. I think it's important to note our balanced aerospace and defense portfolio, along with operational resiliency, remain the key differentiators, which enable us to deliver on our commitments despite some near-term macro challenges and uncertainties. I'm not sure what that noise is.\n\nI think it's also important to note, we've overcome some significant headwinds in 2022, from transitioning out of Russia to record inflation and a strained supply chain. I think it's important. Those are short-term issues. And while we continue the day-to-day work to mitigate those challenges, we also continue to grow our $168 billion backlogs and invest in the future through over $9 billion of R&D, capital expenditures and customer-funded research and development.\n\nThose investments, coupled with strong demand for our systems across each of our businesses, positions us for significant growth runway as the near-term headwinds recede. Before we get to the results, let me just spend a few minutes discussing the trends we're seeing in some of our end markets. On the defense side, no surprises. The elevated threat environment has significantly influenced how the US and our allies are thinking about their defense capabilities and readiness.\n\nAnd as a result, this has driven global defense budgets substantially higher, a trend we expect to continue for the foreseeable future. Just as an example, in Europe, Switzerland recently signed a $6.25 billion contract to buy 36 F-35 jets, modernizing their fleet and driving demand, of course, for our F135 engine through the end of the decade. We're also seeing significant global demand for advanced air defense systems, especially in Eastern Europe, as the Russians and Ukraine conflict, unfortunately, continues. This includes two of our NASAMS system, which is the short surface-to-air missile system that will help protect the people of Ukraine.\n\nAnd we expect more orders beyond those two to follow shortly. The heightened threat environment continues to drive strong orders. During the quarter, we saw strong domestic and international demand for our products with a number of significant defense awards, which resulted in a book-to-bill of 1.22 and a backlog that's up about $2 billion sequentially. Of particular note, our missiles and defense business was awarded $1 billion to develop the Hypersonic Attack Cruise Missile, or HACM, for the US Air Force.\n\nIt's a first-of-its-kind missile that leverages air breathing scramjet propulsion technology and that can travel at hypersonic speeds of Mach 5 or greater. Additionally, RMD completed the systems requirement review for the hypersonic glide phase interceptor program prototype. This is designed to protect the United States from increasing hypersonic missile threats. Both of these accomplishments demonstrate that Raytheon Technologies is a leader in the race to develop and deploy operational hypersonic and, importantly, counter-hypersonic systems, a key strategic priority for the Department of Defense.\n\nRMD also was awarded about $1 billion from the US Air Force, Navy and international customers for advanced AMRAAM, which is the Advanced Medium-Range Air-to-Air Missile. These missiles have been upgraded with the most sophisticated technology needed to maintain the edge over adversaries of the US and our international allies. At RIS, we saw an additional $1.6 billion in classified awards in the quarter. The team was also awarded $215 million from the FAA to upgrade their Wide Area Augmentation System to enhance safer air travel in support of the national aerospace system.\n\nAt Pratt & Whitney, the team recently delivered the 1,000th F135 engine and was awarded over $800 million through the quarter -- in the quarter to continue supporting the F135, which is the safest, most capable and best value military jet engine in operation. And we're working on the F135 engine core upgrade, known as the Enhanced Engine Package or EEP. This will allow the F135 to provide even more thrust, range and electrification to the aircraft. The EEP offers the most cost-effective and lowest-risk solution to enable the F-35's Block 4 upgrade.\n\nAt Collins, we received a $583 million IDIQ award for the MAPS Gen II program, which maintains the integrity of positioning and timing in a GPS contested or denied environment. And it's an important award to ensure mission success within a more connected battle space. As you can see, the defense pipeline remains robust, and we expect continued order strength in the future as we continue to win key awards to successfully demonstrate our technology leadership and innovation capabilities. Moving to the commercial side.\n\nAir traffic remains strong as third quarter global revenue passenger miles reached 75% of 2019 levels. In the US, travelers through TSA checkpoints reached 91% of 2019 levels, with Labor Day domestic traffic exceeding 2019. And we continue to see steady improvement in long-haul international traffic with wide-body hours flown up nearly 40% year over year. The strong demand -- the strong commercial aerospace recovery was driving demand for our commercial products and services, and we continue to innovate to deliver value for our customers.\n\nFor example, just a few weeks ago, Pratt began development flight testing of the GTF Advantage engine on the A320neo aircraft in Toulouse, France. The GTF Advantage reduces fuel consumption and CO2 emissions by a total of 17% compared to the prior generation engines, extending the engine's lead as the most efficient power plant for the A320 family. Also during the quarter, Pratt completed the first flight test of the GTF-powered A321XLR, or Xtra Long Range, two significant milestones for the GTF family of engines. So even with some near-term challenges, we continue to invest in innovation for continued growth in air travel and to meet the strong defense demand.\n\nOK. With that as a background, let's turn to slide two, some highlights in the quarter. In the quarter, we delivered another strong organic sales growth of 6%. Adjusted EPS was ahead of our expectations at $1.21, and free cash flow is also ahead of our expectations despite a $1.5 billion additional tax payment we made related to the R&D amortization.\n\nSales growth was again led by strong commercial aftermarket sales that were up 24% over the prior year. However, we continue to see challenges related to supply chain and labor availability in each of our businesses. On the capital allocation front, we repurchased over $600 million of shares in the quarter, putting us at $2.4 billion year-to-date. And we remain on track to repurchase at least $2.5 billion for the year.\n\nThrough the end of the third quarter, we have returned over $12 billion of capital to share owners since the merger, and we're well on our way with our commitment to return at least $20 billion in the first four years following the merger. Before I hand it over to Neil, notwithstanding the strength in demand that we're seeing across our businesses, the industrywide challenges we're facing remain the same. You've heard me talk about them before: supply chain, labor and inflation. But we continue to focus on what we can control by proactively managing the businesses through these dynamic times.\n\nLet me give you some examples of what we're doing. On the microelectronics front, we're working closely with our distributors and the OEMs to bring more capacity online. We also have a direct engagement, which has led to higher deliveries and an acceleration of expected recoveries for certain wafers and chips. At RMD, we're working hand in hand with our rocket motor supplier holding daily senior management meetings to track work in progress and solve technical problems real time.\n\nWe're also leveraging RTX's contract labor agreements to help source labor in our supply base. To mitigate the impacts of inflation, we take multiple -- we've been taking multiple actions. For example, we're leveraging our raw material contracts from the business from RTX to get best prices for our suppliers as well. And while supply chain disruptions are frustrating, we are seeing some stabilization, and we're encouraged by the demand signals across the business.\n\nThat said, these headwinds continue to pressure the business. So as we finish out the year, just a couple of thoughts. We're going to have to adjust our full year sales outlook slightly to a new range of $67 billion to $67.3 billion. We're going to bring up the bottom of our adjusted EPS range by $0.10 to $4.70 to $4.80.\n\nAnd we continue to see free cash flow of about $4 billion for the year. With that, let me turn it over to Neil and Jennifer to take you through the details. Neil?\n\nNeil Mitchill -- Chief Financial Officer\n\nThank you, Greg. Before I get into the full year, let's look at our Q3 results on slide three. Sales of $17 billion grew 6% organically versus the prior year, with organic growth at Collins, Pratt and RIS more than offsetting the decline in RMD. The ongoing recovery of commercial air travel and a strong summer travel season drove our aerospace performance while we continue to see challenges in the supply chain, as Greg mentioned.\n\nAdjusted earnings per share of $1.21 was down 4% year over year, but ahead of our expectations on better commercial aero. Segment operating profit growth of 12% was more than offset by the absence of a prior year tax benefit and lower pension income. GAAP earnings per share from continuing operations was $0.94 per share and included $0.27 of acquisition accounting adjustments and restructuring. And free cash flow of $263 million was also ahead of our expectations and included the impact of the $1.5 billion cash payment that Greg just mentioned.\n\nOn the cost reduction front, we achieved an incremental $105 million of gross merger cost synergies in the quarter, bringing our merger-to-date total to $1.3 billion of our $1.5 billion commitment in the four years following the merger. Before I hand it over to Jennifer, a few comments on our full year outlook. The commercial air recovery remains robust, and we continue to expect that global RPMs will recover to about 90% of 2019 levels as we exit this year. Domestic and short-haul international travel also remain strong, and we continue to see a steady recovery in long-haul international travel.\n\nHowever, as Greg discussed, while we're seeing some stabilization in certain areas of the supply chain and labor market, these constraints continue to put pressure on our businesses. As a result, we're reducing our full year RTX sales outlook to a new range of $67 billion to $67.3 billion, which translates to between 5% and 6% organic sales growth. This is down from our prior range of $67.75 billion to $68.75 billion. However, despite the lower sales outlook, we're raising the bottom end of our adjusted EPS range by $0.10 to $4.70 to $4.80 per share from our prior range of $4.60 to $4.80.\n\nContinued aftermarket strength, favorable OE mix and cost containment actions across RTX are partially offsetting lower sales and lower productivity in our defense businesses. You'll also recall that we previously assumed the legislation requiring capitalization of R&D expenses for tax purposes would be repealed or deferred this year. Since that hasn't happened, we've realized an EPS benefit of about $0.11 year-to-date and estimate that the full year impact is about $0.15 per share. And on the cash front, we continue to expect free cash flow of about $4 billion for the full year.\n\nIn the fourth quarter, we're expecting lower tax payments in several large international receipts. And finally, we provided an updated outlook for the segments and some below-the-line items in the webcast appendix. So with that, let me hand it over to Jennifer to take you through the third quarter segment results and updated outlook. Jennifer?\n\nJennifer Reed -- Vice President, Investor Relations\n\nThanks, Neil. Starting with Collins Aerospace on slide four. Sales were $5.1 billion in the quarter, up 11% on an adjusted basis and up 13% organically, driven primarily by the continued recovery in commercial aerospace end markets. By channel, commercial aftermarket sales were up 25% driven by a 44% increase in provisioning and a 31% increase in parts and repair, while modification and upgrades were up 3% organically in the quarter.\n\nSequentially, commercial aftermarket sales were up 4%. Commercial OE sales were up 16% versus prior year, driven principally by the strength in narrowbody. Military sales were down 6%, driven primarily by lower material receipts and decreased volume. Adjusted operating profit of $630 million was up $150 million from the prior year.\n\nDrop-through on higher commercial aftermarket and OE more than offset lower volume on military program, as well as higher SG&A and R&D expense. Looking ahead, we continue to see Collins' full year sales up low double digits. And as a result of stronger commercial aftermarket, we're bringing up the low end of Collins' adjusted operating profit to a new range of up $750 million to $825 million from the prior range of up $700 million to $825 million versus last year. Shifting to Pratt & Whitney on slide five.\n\nSales of $5.4 billion were up 14% on an adjusted basis and up 15% organically, with sales growth in large commercial engines in Pratt Canada more than offsetting lower military sales. Commercial OE sales were up 26% driven by favorable mix within Pratt's large commercial engine and Pratt Canada's businesses, along with higher GTF and Pratt Canada volume. Commercial aftermarket sales were up 23% in the quarter with growth in both legacy large commercial engine and Pratt Canada shop visits. Sequentially, commercial aftermarket sales were up 14%.\n\nIn the military business, sales were down 2%, driven primarily by lower expected F135 production volume that was partially offset by higher F135 sustainment volume. The adjusted operating profit of $318 million was up $129 million from the prior year. The drop-through on higher commercial aftermarket and favorable military and commercial OE sales mix more than offset higher SG&A and R&D expense. Looking ahead, we continue to expect Pratt sales to be up low teens.\n\nAnd we're increasing Pratt's adjusted operating profit to a new range of up $650 million to $700 million from our prior range of up $550 million to $650 million versus 2021, reflecting the strength of the aerospace recovery. Turning now to slide six. RIS sales of $3.6 billion were down 3% versus prior year on an adjusted basis driven by the divestiture of the Global Training and Services business. On an organic basis, sales were up 2% versus prior year due to higher classified sales in sensing and effects that were partially offset by lower expected sales in command, control and communications, including lower sales in tactical communications program.\n\nAdjusted operating profit in the quarter of $371 million was down $20 million versus prior year. Excluding the impact of the divestiture, operating profit was up $8 million, driven primarily by favorable net program efficiencies. RIS had $3.9 billion of bookings in the quarter, resulting in a book-to-bill of 1.18 and a backlog of $17 billion. For the full year, we continue to expect RIS' book-to-bill to be greater than one.\n\nTurning to RIS full year outlook. A result of the ongoing material availability delays and the associated productivity impacts, as well as anticipated cost reduction actions and award delays, we are reducing RIS sales to the low end of our prior outlook and now expect RIS sales to be down mid-single digit from our prior outlook of down mid-single digit to down low single digits on a reported basis versus prior year. On an organic basis, we now expect RIS' sales to be down slightly versus our prior outlook of about flat. And as a result of lower sales outlook and program efficiencies, we are reducing RIS' adjusted operating profit to a new range of down $125 million to down $75 million from a prior range of down $50 million to flat versus prior year.\n\nTurning now to slide seven. RMD sales was $3.7 billion, down 6% on an adjusted basis and down 5% organically, primarily driven by continuing delays in material availability and lower volume in Land Warfare and Air Defense and Naval Power programs. This was partially offset by higher volume on Strategic Missile Defense programs, including Next Generation Interceptor development. Adjusted operating profit of $116 million was $74 million lower than prior year driven by unfavorable program mix and lower volume, primarily in Land Warfare and Air Defense programs, as well as lower net program efficiencies resulted from continued supply chain and labor constraints.\n\nRMD's bookings in the quarter were approximately $5.4 billion, resulting in a book-to-bill of 1.5 and backlog of $32 billion. For the full year, we now expect RMD's book-to-bill to be at or better than 1.2. As a result of ongoing material availability delays and the associated productivity impacts and cost reduction actions, we now expect RMD sales to be down low single digits versus our prior outlook of up slightly versus 2021. And as a result of the lower sales outlook and lower program efficiencies, we are reducing RMD's adjusted operating profit to a new range of down $300 million to down $250 million from the prior range of down $50 million to flat versus 2021.\n\nWith that, I'll turn it back to Neil.\n\nNeil Mitchill -- Chief Financial Officer\n\nThank you, Jennifer. A lot to cover there. I'm on slide eight. While we aren't providing our '23 outlook today, let me tell you how I'm thinking about next year.\n\nOverall, we expect another year of organic sales and segment operating profit growth with solid free cash flow generation at RTX. On the positive side, we expect that commercial air traffic will continue to recover and the global demand for our defense products and technologies will remain strong. We expect to exit next year at or above 2019 levels for global air traffic, and the significant defense orders we have won should begin to convert to sales. We will continue to drive operational excellence, and we are focused on improving our cost competitiveness.\n\nWe're using the core operating system to align goals and drive targeted improvements with technology. The collaboration across RTX has already yielded 180 approved projects with a growing pipeline of over 350 future projects, which are focused on smart factories, automation and machine upgrades that will apply best practices to further reduce our structural costs. We will leverage our scale, these additional cost reduction opportunities and pricing to help address the inflation pressures that we expect to remain elevated well into next year. And while we are working many actions across our businesses every day to mitigate the impacts of supply chain constraints and labor availability, as I said, we do expect these pressures will continue to persist into next year as well.\n\nAdditionally, as we sit here today, we see pressure from increasing interest rates and market volatility and anticipate a pension headwind next year that could be about $0.40 on a year-over-year basis due to current market conditions. That said, it's important to note that our US plans remain well funded and have even seen an improvement in their funded status year-to-date. And of course, everyone is watching the geopolitical landscape, energy supply in Europe, the continuing resolution and the global tax environment. So with that, let me hand it back to Greg for some closing remarks.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nOK. Thanks, Neil. So there's a lot going on, a lot of moving pieces. And I think the key takeaways that I hope people get from this is most importantly, our backlog is up $12 billion since the beginning of the year.\n\nAnd we're investing $9 billion this year to support the growth that's going to come over these next couple of years. The future remains absolutely bright for RTX. The 2025 commitments that we laid out a year ago may remain in sight. And we're not going to back off from any of those, be it top line, bottom line or cash flow.\n\nSo Neil laid out three challenges that are out there, right, supply chain, right? It's a challenge. There's no doubt about it. We've got 13,000 suppliers. And of those 13,000, about 400 of them are a problem for us.\n\nBut we've deployed teams to almost all of those suppliers to work with them on a daily basis, getting them raw material, giving them contract labor, giving them technical support, all of the things that you would expect us to be doing. On labor availability, it's a challenge. Everybody sees it, especially in the supply chain. And I think what's interesting for -- at RTX is we have hired 27,000 people in 2022.\n\nThat's about 3,000 a month since the beginning of the year. Our total headcount today is over 180,000. The challenge though is we would need about 10,000 more people. So a lot of work yet to do on labor.\n\nIt's out there. It's a great place to work. And people come to RTX because of the mission. And so, we have a, I think, a very good pipeline.\n\nWe'll continue to hire at this rate. And again, the challenge will be in the supply chain. On inflation, we came into the year expecting about $1.5 billion of cost growth between compensation and what we saw in the supply chain and energy prices. That $1.5 billion has turned out to be closer to $2 billion, so about $500 million of additional headwind that we didn't expect as we came into the year.\n\nYou couple that with about $200 million of headwind from the cessation of activities in Russia back in February, and there's about $700 million of headwind that we came into the year that we had to overcome. The good news is we have found ways to save. We have cut costs across the business. We've got about 500 cost reduction projects that we're currently working.\n\nAnd so, despite that $700 million, we've been able to maintain guidance for the year just where we saw it back in January of this year. So it's been a tough year. It's going to be a tough year going forward. We know that.\n\nWe recognize it. But the fact is we have the tools and the people to make it all happen. So I'll stop there, and we'll turn it back to the operator, and we'll take whatever questions you might have.\n\nOperator\n\n[Operator instructions] And our first question coming from the line of Peter Arment with Baird. Your line is open.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nYes. Good morning, Greg. Maybe if you could just, at a high level, how you're thinking about -- I know you're not giving formal 2023 guidance, but just The Street is obviously expecting across-the-board growth. Would you kind of feel that commercial aerospace will continue to recover and obviously, defense, maybe you'll finally start to convert some of these wins and actually showing some top line growth? Just maybe just high level how you're thinking about '23.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nYes. I think, Peter, you're exactly right. We expect strong growth on the commercial aerospace side to continue. RPMs will continue to recover back to the 2019 levels.\n\nAnd so, we're going to see strong OE growth as Boeing and Airbus take up production rates. And we expect to see strong aftermarket growth as well, again, as airlines continue to add capacity and try and keep the planes they have flying. So commercial aero, I think it's all good for next year. On the defense side, we will see some growth.\n\nIt won't be as robust as we would like. I would tell you, it goes back to those challenges that we talked about. Really, it's about labor availability and some of the supply chain challenges. But we should start to -- again, we saw stabilization here in the third quarter in the supply chain.\n\nWe've gotten a little bit better in terms of bringing material in, but we've got a long way to go. So that will be the governor, I would say. It's not the backlog. It's simply the availability of material coming into the shops.\n\nNeil Mitchill -- Chief Financial Officer\n\nYes. Peter, the other point I would add from a sales perspective, everything Greg said, I agree with. And we do expect to see mid- to high single-digit sales growth in 2023. So good top line growth, as Greg mentioned.\n\nI do expect most of that to come from our commercial businesses. I think even more importantly, we'll see segment operating profit growth exceed the growth rate of sales. So we do expect margin expansion as well next year. And you heard me mention the pension headwind in my prepared remarks.\n\nWe'll also have to normalize for a tax rate that will be a little bit higher as we come off of a year where we do expect R&D to be repealed into next year, at least that's our current planning assumption. So more to come on that. But just a few extra points on the 2023 outlook. We'll, of course, come back in January with a much better look at what the segments are going to look like.\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nAppreciate that.\n\nOperator\n\nThank you. And one moment for our next question. And our next question coming from the line of Noah Poponak with Goldman Sachs. Your line is open.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nHey. Good morning, everybody.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nGood morning, Noah.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nHey. Can you hear me?\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nYes, we can.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nObviously, what's happening with your defense top line is a little surprising, but it can largely be explained by industrywide factors. I think the margins are maybe more surprising. And obviously, there's absorption from that top line impact, and we know there's inflation. But it's an industry where the margins really don't move around that quickly, and your peers aren't really seeing that much margin movement versus this kind of quarterly volatility we're seeing from you.\n\nSo can you maybe just explain that a little further? And then when we look to next year, should we think about your defense segment margins being closer to the '22 level or closer to your longer-term targets?\n\nNeil Mitchill -- Chief Financial Officer\n\nI'll start with that one, Noah. I'm not going to comment on next year's margins. Right now, we're focused on making sure we get through the rest of this year. But a couple of thoughts on the margin profile.\n\nThe first thing that's really dragging down the margins this year relative to our initial expectations are the lack of productivity. And that lack of productivity has principally been driven by the delay in material receipts, which is obviously jamming up the production and development cycles within the businesses, and it's most notable at RMD. We've also talked about a mix shift in the products. RMD has gone through a product upgrade really across many of our platforms there.\n\nSo that has had a negative impact on the margins overall. And certainly, we'll come through that as we turn into more production rate-type contracts. One thing that I'd say was encouraging during the quarter is last quarter, we had net productivity that was actually an expense, whereas sequentially, we're seeing about $140 million of favorability in productivity. So productivity for RIS and RMD was positive, albeit nowhere near the levels that we're used to.\n\nBut we are starting to see some improvement there. We've been adversely affected, to your point, on absorption as a result of that slowdown and the throughput that's coming through in the rates, which is causing that productivity to be muted from what we're used to seeing. I do expect as the volume starts to fill up the factories when we deliver that $67 billion of defense backlog, we will start to see improvements in productivity as well. Greg, I don't know if there's anything else you wanted to add to that.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nNo, I think you pretty well covered it. I mean, the other obvious issue is international sales, which tend to be more profitable on the defense side are down comparatively. And again, some of the newer contracts have much lower margins than what we had on some of the existing. As we transition from Patriot to LTAMDS production, you're going to see a big mix shift there or margin degradation for a couple of years until we get through the low rate initial production contracts.\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nOK. I'll leave it there. Thank you.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nThanks, Noah.\n\nOperator\n\nThank you. one moment for our next question. And our next question coming from the line of Sheila Kahyaoglu from Jefferies. Your line is open.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nGood morning, guys. Thank you for the time. Neil, I wanted to ask about comms profitability. Guidance implies that margins inflect up 200 bps in Q4 versus about a 12% rate year-to-date on margins.\n\nHow do you think about the bridge and some of the drivers there as we exit the year? And maybe if you could comment on price and mix actions as well.\n\nNeil Mitchill -- Chief Financial Officer\n\nI'm sorry, the last part, Sheila?\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nJust price and mix as we head into 2023.\n\nNeil Mitchill -- Chief Financial Officer\n\nSure. Yes. And so, we've already seen substantial Collins margin expansion as we've gone through the first nine months of the year. And I expect as the wide-body international traffic recovers, we will continue to see a broadening of the margins at Collins.\n\nI'm pretty pleased with the trajectory that they're on. They've been doing a great job controlling costs as well, and they'll do more of that here in the fourth quarter. As you look out into next year, we've talked about some of the pricing actions that we've already taken in our Pratt & Whitney business, Collins and our Pratt Canada business. We'll also introduce revised pricing as we usually do at the beginning of the year.\n\nSo we do expect that to be considerably higher than what we've seen in the past, reflecting the inflation that we're dealing with across the business. So we're attacking both price and cost as we look at the business going forward. So a number of projects in the pipeline that all of the businesses and Collins, in particular, are looking at. And as I think I said a couple of months ago, many of the projects that we have looked at around footprint consolidation and automation and digitization of our factories are much more attractive with the inflationary pressures that we're seeing today.\n\nSo those 350 projects that I alluded to, we're ready to move forward on those and make sure that we structurally change the cost profile of our business going forward.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nShould we assume it's a 35%, 40% incremental margin business going forward?\n\nNeil Mitchill -- Chief Financial Officer\n\nI think getting out of this year, you'll start to see muted incrementals because the compares get a little more challenging. But clearly, we're on our way back to the 20% margins that we committed to at our investor day back in 2021.\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. And our next question coming from the line of Robert Stallard with Vertical Research Partners. Your line is open.\n\nRobert Stallard -- Vertical Research Partners -- Analyst\n\nThank you very much. Good morning.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nGood morning, Rob.\n\nRobert Stallard -- Vertical Research Partners -- Analyst\n\nGreg, on the defense side of things, particularly RMD, you're in this sort of interesting situation where defense -- sorry, demand is clearly very strong, but supply continues to be constrained. How do you see this panning out from here? When will these two come into equilibrium? And are you seeing any help from your customers in getting this fixed?\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nYes. Look, I think we're all in this together. And as we sit here in Washington and we're going to be talking to the folks at DoD tomorrow, there is concern about the supply chain challenges as we are. And they're putting DPAS ratings on many things to try and move up in the queue with the supply chain.\n\nBut the challenge, and again, it's not just defense. I mean, I go to the -- on Pratt structural castings, we've been talking about it all year, still remain a challenge. And it's not necessarily a capacity issue. It's a labor availability.\n\nI mean, how do you get trained welders working efficiently? And it's -- that remains a challenge. As I think about this though, we saw about a 5% incremental improvement in our build or kit efficiencies this quarter. We had hoped to be about 10 points higher than that. By the end of the year, we hope to be at 80%.\n\nWe're not going to get there. I think if we're lucky, we'll get to about a 70% kit fill rate by the end of the year, which is the reason why we had to take RMD sales guidance down. I do think, as we're looking through this, that by the end of next year, we should start to see some of this abate. Again, because the economy is slowing down, more people available in the supply chain to work.\n\nBut some things like rocket motors, we literally do not see a recovery path there to -- on contract until sometime in the first half of 2024. So this is not a short-term fix. And I think we're fully prepared that next year is going to be kind of a hand to mouth on the supply chain. As I said in the opening comments, we have worked with like the chip manufacturers, the OE, the OEMs to get some assured supply, and that seems to be working.\n\nThe offset of that, of course, is there's a lot of inventory sitting here. We've added about $1.1 billion of inventory for the year to make sure that we do have the things that we need to build these products. So long-winded answer, it's not over yet, and I think it's going to be most of 2023 before we really get out of the woods on the supply chain.\n\nThat's very helpful. Thank you.\n\nOperator\n\nAnd our next question coming from the line of Ron Epstein with Bank of America. Ron Epstein, your line is open.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning, everyone.  Maybe switching gears a little bit, and I'm certain everybody is going to focus on RMD. Greg, if you could maybe discuss a little bit, when you think about aircraft propulsion technology, you guys have the geared platform. Your primary competitor is working on an unducted fan.\n\nWhat legs does the gear have? I mean where can we go to from here? How much of a threat is an unducted fan? And then if we go one step beyond that to hybrid propulsion, that sort of thing, when do you see all that happening?\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nA long time from now. Let's be clear, right? We're just introducing the Advantage engine, the A320 or the 1100 GTF Advantage engine. That will go into service in 2024. That will have a very long life cycle, like 30 years on it.\n\nOver the next 20 years, I think what you're going to see, Ron, and you know this, there's going to be an evolution probably toward hybrid electric propulsion at least in regional jet and turboprop markets. We have yet to find a way to make the case for long-range propulsion with anything other than Jet A. And that's the challenge. I mean, we're talking -- we're working with hydrogen.\n\nWe're working with ammonia. We're working with a number of different things to improve efficiency. SAF is an interesting option. It's not carbon-free, really depending upon the feedstocks.\n\nSo that's -- again, that will help in terms of the emissions mandate, but it's not the solution. So I think we're investing a lot of money today in these advanced technologies. And we've got a project, as you know, between Collins and Pratt to do a hybrid electric demonstrator on a regional turboprop. But again, I think those technologies are 15 or 20 years out.\n\nWe're going to focus now on kind of incremental improvements in the gear. And the gear is not done, right? I mean the gear, we've always said this, it can scale up, it can scale down. And we've got a great family of engines today. And I think, as we think about next-generation single aisle whenever that is, probably 2030, we're going to have, I would say, the next evolution of the gear.\n\nBut it's still going to be jet engine as you see it today with Jet A. Maybe it's all SAF, but it's still the same turbomachinery that we're talking about today.\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. And one moment for our next question. And our next question coming from the line of David Strauss with Barclays. David Strauss, your line is open.\n\nDavid Strauss -- Barclays -- Analyst\n\nGreat. Thanks. Good morning, everyone.\n\nNeil Mitchill -- Chief Financial Officer\n\nGood morning, David.\n\nDavid Strauss -- Barclays -- Analyst\n\nI wanted to see if you could give some initial thoughts on free cash flow in 2023. It looks like 2022 free cash flow will grow about $1 billion. That's the R&D hit. So I guess, Neil, obviously, you're talking about probably close to $1 billion of EBIT growth.\n\nBut I think you have a bit of a pension, pension CAS headwind. Not sure what you're expecting for working capital. So maybe some help with the moving pieces on '23 through cash flow.\n\nNeil Mitchill -- Chief Financial Officer\n\nThanks, David. I'll keep this at a high level, but certainly back -- coming in January, I'll give you a little more details. But with the operating profit growth, we would expect that to convert to free cash flow. I expect a little bit of headwind on capital as that inches up just a tad as we finish off some of these large investments, particularly an upgrade of our facilities in Texas at the RIS business, as well as the completion of the Asheville facility for Pratt.\n\nHowever, a couple of other moving pieces. Working capital, I expect we'll see inventory to continue to grow. We'll try to manage that through payables and other parts of our working capital. But certainly, we need the inventory with all the constraints that we faced in the supply chain this year.\n\nWe want to make sure we're prepared to deliver on the growing aftermarket and growing OE business that we'll see. Long story short, I do expect free cash flow to grow organically. We'll also -- we're anticipating a refund of the tax payments that we're making this year, again, assuming that the -- there is ultimately a repeal of the R&D capitalization provision. So let me leave it at that for now.\n\nBut certainly, in January, we'll provide a better walk.\n\nDavid Strauss -- Barclays -- Analyst\n\nAnd a quick follow-up on pension, the $0.40. Is that $0.40 incremental versus this year? I think you were already anticipating kind of a $0.10 incremental hit. Is that $0.40 incremental to that or just $0.40 incremental for this year?\n\nNeil Mitchill -- Chief Financial Officer\n\nNo. It's $0.30 incremental to the $0.10 we had already forecasted. And that's really driven by asset returns being below our EROA, as well as rising interest rates causing higher interest expense. So more to come.\n\nWe obviously threw all those assumptions up at the end of the year, but that's where we see it as of today. I do not expect that to be a major cash issue for us. And if there are any future FAS funding requirements, those will be offset by higher CAS recoveries in the future. So not a cash issue, but a P&L issue right now.\n\nDavid Strauss -- Barclays -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. And one moment for our next question. And our next question coming from the line of Seth Seifman with J.P. Morgan.\n\nYour line is now open.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nHey. Thanks very much, and good morning. I wonder if you could talk a little bit about Pratt for a second and strong results in the quarter. Been running about $300 million of profit per quarter year-to-date.\n\nI think the guidance is basically for a step down to $250 million or a little bit below that in the fourth quarter. Now, I'm sure when I ask about that, you're going to talk about higher engine deliveries. But I mean, I think there was a price increase as well for spares. And so, how do we think about that evolution of Pratt, why it comes down so much in the fourth quarter, as well as where it goes from here and how much progress Pratt can make in '23 toward the out-year margin target that you have?\n\nNeil Mitchill -- Chief Financial Officer\n\nSo you hit the nail on the head. As you look sequentially from Q3 into Q4, most of the degradation, if you will, the step-down in that profit is higher commercial engine shipments which, as we've been talking about, have been kind of pushed to the back end of the year. So that's really the major driver of what you see in terms of the walk from Q3 to Q4 on op profit. As we look out a little further, I'm not going to get into specific numbers, but we certainly expect OE deliveries in the large engine business to step up next year aligned with our customer requirements.\n\nAnd I do expect we'll see some movement toward the margin goals that Pratt put out there a year and a half ago. There's a long ways to go here, but a lot of that will be fueled by a growing aftermarket, the recovery on the V2500s. We've also seen considerable strength in the PW2000s and 4000s. Recall that about 40% of that fleet powers cargo aircraft.\n\nSo continues to be really strong there. And of course, the GTF will turn to profit. And we will see -- on the aftermarket side, we will see the shop visits begin as we get through next year and into the middle of the decade. So Pratt is positioned to expand the margins.\n\nThere's still a lot of work to do. Greg talked about some of the incremental cost reduction actions that they're taking. They're going through an exhaustive review of every element of the business in terms of driving out both SG&A, as well as structural operational costs in the manufacturing facility. So I find it encouraging, but I'm not going to commit to some numbers today, but we'll get that out there again in January, and you'll see that in full transparency then.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nGreat. Just if I could follow up real quickly, the military part of Pratt has been down this year. Can that stabilize or grow again in '23?\n\nNeil Mitchill -- Chief Financial Officer\n\nI think it can, yes. It's been down as we planned for lower F135 deliveries. That's been partially offset by growing sustainment revenues, and we've talked about that aftermarket for the F135 engine will continue to grow in the future as well. So we should see that stabilize.\n\nSimilarly at Collins, military is down mid-single digits for the year. I do expect same phenomena to begin as we turn the page into 2023.\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. One moment for our next question. And our next question coming from the line of Myles Walton from Wolfe Research. Myles Walton, your line is open.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nThanks. Good morning. Neil, I think you mentioned fourth quarter cash would be driven by lower tax payments in several large international receipts. And I just wonder on the international receipt portion, are you awaiting government approvals? Is there a timing risk here? And is that -- are those international receipts tied to the fourth quarter, mid-13% targeted margin you're looking for at RMD?\n\nNeil Mitchill -- Chief Financial Officer\n\nSo great question. The international cash receipts are not tied to the margin in the fourth quarter. However, every international advance is subject to some risk. And there's a couple of very large ones here.\n\nI believe that we have line of sight to get them within the year. But if it's not within the year, it's certainly just timing. But certainly a watch item for us, not subject to government approval. But certainly a watch item for us, and hence, the reason I called it out there in the script as we look at the rest of the year.\n\nBut I do feel good about the rest of our actions to drive free cash flow. We had very, very strong cash flow, notwithstanding the $1.5 billion payment. Tax payments will be less, obviously, in the fourth quarter as we make the rest of the payment we're required to make to meet the new law for R&D.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nOK. And Greg, just a high level, the US review of the US-Saudi relationship, any expectation there in terms of impact on your business?\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nRight now, we follow the lead of the DoD state on sales to Saudi Arabia. We still continue to work with Saudi Arabia and especially on the defensive side. I think it's important. We've had a very long-term relationship with the Saudis.\n\nAnd again, the key for us is providing the Saudis with defensive capabilities. And primarily, that means GEM-T missiles for the Patriot antimissile, anti-aircraft battery. So we have not seen any impact from some of the talk in Washington about suspending arm sales. Just to, again, put it in perspective, it's about 1.7% of our total sales go to Saudi Arabia.\n\nIt's not a big number. But I think it's an important ally. And I believe that we'll get through this difficult time that we're seeing right now in terms of diplomatic relations because ultimately, they are a staunch ally in the Middle East and a key player in Middle Eastern stability.\n\nMyles Walton -- Wolfe Research -- Analyst\n\nThanks.\n\nOperator\n\nThank you. One moment for our next question. And our next question coming from the line of Kristine Liwag with Morgan Stanley. Kristine Liwag, your line is open.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nGood morning. Neil and Greg, you highlighted inflation as a continuing challenge as you look out to 2023. I mean, that said, right, you're also expecting margins to expand next year. Can you provide more color on the moving pieces of how much inflation you're able to pass through to customers? How much you can offset with lower cost? And how we should think about that remaining exposure?\n\nNeil Mitchill -- Chief Financial Officer\n\nSo Kristine, there's a lot of moving pieces here. And obviously, our crystal ball is not terribly clear as to where inflation is going. But I do think it's going to persist at elevated levels as we go into 2023, and that's what we're planning for. And so, we, fortunately, have a good portion of our supply base is committed under long-term agreements.\n\nBut as you know, those continue to roll over. And we're looking at long-term pricing solutions and working with our suppliers to beat back some of those price increase requests. On the top line, I talked about the pricing actions that we've begun to take that we take every year. But they are significantly larger than our historical pricing increases in the commercial aftermarket business.\n\nAnd on the defense side, we're able to pass a lot of that through to our government customer as we set up new contracts with them and update our forward pricing rate. So we're working through all of that. I'm not going to put a number on it, but Greg talked about the level of inflation we've seen this year, and I expect it to be even larger next year. So it's going to require even more projects.\n\nWe've got all of those in process right now. The teams are working very aggressively to accelerate the savings from those projects. And many of them were started years ago, and they were starting to bear fruit in terms of the digitization that we're undertaking across the company, upgrades of our systems and improvement of information flow around the company. So a lot of actions, a lot of singles, some doubles.\n\nBut it's going to take a lot of work here for us to mitigate a sustained level of 6%, 7%, 8% types of inflation rates.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nYes, Kristine, just to add to that. I think the biggest inflationary impact really comes in compensation. So we spend roughly $20 billion a year in compensation. And every year, for the last 10 years, we've targeted somewhere around 3% or 3.5% increases.\n\nWe're obviously seeing more pressure on compensation, given what's going on in the marketplace today. But the fact is, this is not new. And we are always looking for productivity improvements, productivity improvements in the factories, productivity in the back-office functions and everything that we do. So it's a concerted effort.\n\nI'm not, again, terribly concerned about the impact on margins just because I know that we know how to take cost out of the business. Some of it we get to pass on, as Neil said, through our overhead rates to our government customers. And we're also, I think, being aggressive on pricing on the commercial side of the business. So we've got a lot of levers.\n\nInflation, hopefully, it's -- I won't even use the word transitory because I think that's been proven a myth. But it will be here for a while. So we're going to continue to look for ways to drive cost out and to pass cost on. And I think that's just what we do every day.\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nGreat. Thank you, Greg. Thank you, Neil.\n\nOperator\n\nThank you. One moment for our next question. And our next question coming from the line of Cai von Rumohr from Cowen. Your line is now open.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nYes. Thanks so much. So you indicated that you're going to do at least $2.5 billion in share repurchase for the year even though the cash flows impacted by Section 174. If 174 is pushed out, you clearly get a windfall to cash flow next year.\n\nHow should we think about share repurchase given that your longer-term outlook really looks pretty good? And if you do get 174 pushed out, you're going to have a lot of firepower.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nYes, Cai, obviously, the Section 174 nonsense is a little disconcerting because we're hoping, again, we're going to get a tax law change here at the end of the year with tax extenders which, as you know, will give us a refund of the $1.5 billion that we've already paid sometime in the first quarter of next year -- I guess, April, actually. But the fact is, as we think about share buyback, we are firmly committed to the $20 billion of capital return. This year, we said $2.5 billion plus. I suspect next year that will -- that number will look like a $3 billion-plus number.\n\nAnd again, the timing of that will really depend upon when we see the cash, if we do, from this Section 174 repeal. But again, I think you can count on us to continue to be aggressive in share buyback along with continue to increase the dividend each year.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nBut how much of that share of $3 billion plus would you do if Section 174 is not repealed?\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nWe'd still do $3 billion. We have programmed this in for the next couple of years to hit that $20 billion target. Keep in mind, this Section 174 is a timing issue. And eventually, we do get the deductions.\n\nIn fact, next year, we'll get it to deduct 20% of what we deferred this year, but it is a timing. And by 2025, most of the impact of this has abated because of the ability to amortize most of this. So again, while it's important, it's not going to really change capital allocation in terms of what we have committed to.\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. And our last question coming from the line of Ken Herbert with RBC Capital. Ken Herbert, your line is now open.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nHi. Good morning, Neil and Greg. Thanks for squeezing me in here.  I just wanted to see if you could provide a little bit more color on Pratt & Whitney. You have 14% sequentially in the aftermarket.\n\nCan you just talk about where that was from? How much was maybe volume versus price? And how should we think about where you are, specifically in the V2500 sort of shop visit recovery? Because I know that's, obviously, a big part of the story this year and next year. And how much growth did you see in the shop visits this year? And how do we think about that in the next year?\n\nNeil Mitchill -- Chief Financial Officer\n\nThanks, Ken. So a couple of thoughts. Most of what you're seeing at Pratt through the third quarter is really just volume. And we've talked about the shop visits going up about 20% on a full year basis.\n\nWe saw about a 10% growth here in the third quarter. I think we've got a pretty good line of sight to the fourth quarter at this point. So I think the 20% up year over year still sticks. The other element of the aftermarket that Pratt is seeing is higher content per shop visit, which again was expected for us to see that as these aircraft are now flying at much greater and sustained levels than they were over the last couple of years.\n\nSo good story on the aftermarket, but I don't think any of the pricing actions have yet to kind of flow through in the results reported to date.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nGreat. And the pricing actions just real quick, I think as those flow through for 2023, if I understand properly, you're looking at a little more step-up in pricing than you realized in '22, correct?\n\nNeil Mitchill -- Chief Financial Officer\n\nThat is true. Keep in mind, a number of our customers have contracts in place as well. So some of that increase is muted, but there's a number of them that do not. And you will see that drop through, and that will help to offset some of the headwinds that we're dealing with there as well.\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nGreat. Thank you.\n\nNeil Mitchill -- Chief Financial Officer\n\nYou bet.\n\nOperator\n\nThank you. I will now turn the call back over to Mr. Greg Hayes for closing remarks.\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nOK. Thank you, Livia, and thank you all for listening in. Just a reminder, Jennifer and team will be available today to take on your questions. Also just a note, this is Erin Somers' last earnings call with us.\n\nShe is moving on to be CFO of our international business for RMD. So congratulations, Erin, if you guys are talking to her later today. Thank you all for listening, and we'll see you soon. Take care.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGreg Hayes -- Chairman and Chief Executive Officer\n\nNeil Mitchill -- Chief Financial Officer\n\nJennifer Reed -- Vice President, Investor Relations\n\nPeter Arment -- Robert W. Baird and Company -- Analyst\n\nNoah Poponak -- Goldman Sachs -- Analyst\n\nSheila Kahyaoglu -- Jefferies -- Analyst\n\nRobert Stallard -- Vertical Research Partners -- Analyst\n\nRon Epstein -- Bank of America Merrill Lynch -- Analyst\n\nDavid Strauss -- Barclays -- Analyst\n\nSeth Seifman -- JPMorgan Chase and Company -- Analyst\n\nMyles Walton -- Wolfe Research -- Analyst\n\nKristine Liwag -- Morgan Stanley -- Analyst\n\nCai von Rumohr -- Cowen and Company -- Analyst\n\nKen Herbert -- RBC Capital Markets -- Analyst\n\nMore RTX analysis\n\nAll earnings call transcripts"
}