{
  "companyName": "Macy's",
  "companyTicker": "M",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/23/macys-m-q2-2022-earnings-call-transcript/",
  "content": "Macy's (M 0.93%)\nQ2 2022 Earnings Call\nAug 23, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to Macy's Inc. second quarter 2022 earnings conference call. [Operator instructions] I would now like to turn the call over to Mike McGuire, vice president and head of investor relations. Please go ahead.\n\nMike McGuire -- Head of Investor Relations\n\nThank you, operator. Good morning, everyone, and thanks for joining us to discuss our second quarter 2022 results. As always, with me on the call today are Jeff Gennette, our chairman and CEO; and Adrian Mitchell, our CFO. Jeff and Adrian have prepared remarks that they'll share.\n\nAfter which, we'll provide time for your questions. Given the time constraints, we ask that participants in the Q&A please limit their questions to one single-part question. Along with our press release from earlier this morning, a slide presentation has been posted on the investors section of our website, macysinc.com. In addition to information from our prepared remarks, the presentation includes supplementary facts and figures to assist you in your analysis of Macy's.\n\nAlso note that, unless otherwise noted, the comparisons that we'll speak to this morning will be versus 2021. Comparisons to 2019 are provided where appropriate to best benchmark our performance, given the impacts from the pandemic. I do have one housekeeping item to share with you this morning. On Thursday, September 8th, at 8:05 a.m.\n\nEastern Daylight Time, Adrian will be participating in a fireside chat at the Goldman Sachs Global Retailing Conference. This event will be webcast live on our Investor Relations website, so please circle the date on your calendars and plan to tune in. Keep in mind that all forward-looking statements are subject to the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from the expectations and assumptions mentioned today.\n\nA detailed discussion of these factors and uncertainties is contained in our filings with the Securities and Exchange Commission. In discussing the results of our operations, we will be providing certain non-GAAP financial measures. You can find additional information regarding these non-GAAP financial measures, as well as others used in our earnings release and our presentation on the investors section of our website. Finally, as a reminder, today's call is being webcast on our website.\n\nA replay will be available approximately two hours after the conclusion of this call, and it will be archived on our website for one year. With that, I will turn the call over to Jeff.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nThanks, Mike, and good morning, everyone. As you saw in this morning's press release, our team put together another solid quarter on both top and bottom lines in the face of an increasingly challenging consumer environment. We generated quarterly net sales above our expectations at 5.6 billion, while comparable owned-plus-license sales decreased 1.6%. We also delivered earnings above our expectations with adjusted EBITDA of 616 million and adjusted diluted EPS of $1.\n\nWe've benefited greatly from the steps we've taken to transform our business through our Polaris strategy. We are quicker and more agile and more prepared for the challenges in the current environment. Over the past two years, as consumer demand rapidly switched between categories and channels and macroeconomic pressures intensified, our teams have taken disciplined actions and made tough decisions in order to ensure stability and health of our enterprise. We have fortified our model and strengthened our balance sheet, all while delivering an easier and more convenient shopping experience for our customers across channels and the value spectrum.\n\nBefore we dive into the full details, I'd like to take some time to review how the pressures of the macroeconomic environment are affecting consumer behavior and what that means for us. During the quarter, Macy's brand customers across all income tiers slowed and shifted their spend. Persistently high inflation drove higher prices in food and fuel and, in turn, led to higher interest rates and a softening market. As a result, overall consumer discretionary spending and sentiment weakened compared to the prior year.\n\nConstrained consumer spend also shifted from goods to services, with more consumers choosing to spend on vacations, events, and dining out. Despite the weakened environment for Macy's, we continue to see strength in occasion-based categories, which include career and tailored sportswear, fragrances, shoes, dresses, and luggage. Sales for these categories were up 8% the second quarter of 2021 and up 21% the second quarter of 2019. Like last quarter, pandemic-related categories, which include active, casual sportswear, sleepwear, and soft home, continued to decelerate during the quarter, with sales down 18% compared to the second quarter of 2021 and down 12% compared to the second quarter of 2019.\n\nCustomers also exhibited more traditional pre-pandemic shopping behaviors, including more in-store shopping. This shift contributed to a digital sales decline of 5% and conversion that was down 3% compared to 2021. However, versus 2019, digital sales were up 37%, and conversion was up 14%. Spending patterns for Mother's Day and Father's Day were encouraging, signifying that, despite inflationary pressures, customers continued to shop at Macy's for celebrating life's moments with family, friends, and coworkers.\n\nLeading up to Mother's Day, we saw strength in beauty, dresses, career sportswear, and women's shoes. Before Father's Day, we saw strength in men's fragrances, tailored clothing, furnishings, outdoor sportswear, and shoes. Combined for the two weeks leading up to both holidays, these categories were up 9% over the prior year. Looking forward, we continue to feel confident in our position as a style source and leading gifting destination.\n\nHowever, spending trends fell as June progressed, with Macy's brands seen a decline in customer traffic and spending. Post-Father's Day into July, Macy's brand year-over-year sales trended nearly 5 percentage points lower than the preceding weeks of the quarter. Our teams were prepared to tackle the slowdown quickly through the inventory management competencies we gained through Polaris. Our work in this area in the first quarter position is better compared to others, and we came into the second quarter prepared to compete in an industry that was largely over inventoried.\n\nDuring the quarter, we observed that all retailers were working to shed their excess inventory, setting the industry up for higher permanent markdowns and promotional levels. The industrywide inventory levels, along with the slowdown in consumer discretionary spend, resulted in elevated inventory levels within certain categories. Additionally, supply chain pressures continue to ease as the quarter progressed. This resulted in receipts flowing in sooner than we experienced in the first quarter, and fallout rates continued to improve with a 15% follow-up rate, representing a 5-percentage-point improvement from the first quarter.\n\nTo better align inventory levels with consumer demand, we slowed receipts and market brands where we have more flexibility than our private brands. We effectively pulled the appropriate levers to manage inventory productivity while flowing fresh inventory to meet our customer needs. Over the past year and a half, I've spoken to the success our team has had in navigating supply chain volatility. This quarter was no different.\n\nThe improved use of data analytics enabled the team to respond quickly and adjust our inventory flow accordingly. We ended the quarter with inventory levels, up 7%. We acknowledge that we still have opportunities to improve our inventory balance by channel and store and mix of merchandise categories and brands. We are targeting appropriate inventory levels by the end of the year and plan to be aggressive in taking the necessary markdowns to drive faster sell-throughs in our aged inventory in seasonal goods, private brand merchandise, and pandemic-related categories.\n\nSimultaneously, we'll bring in fresh inventory and categories in which customers are signaling demand. As a leading style and gifting destination, we know that the lifeblood of a fashion retailer is its ability to bring in fresh and exciting inventory. We're making strategic decisions to fuel the second half of the year, particularly by rebalancing or a mix of market and private brands, to ensure that we have the products our customers expect to see over the holidays. Our current healthy financial position, when combined with the sensible management of our inventory through data analytics and pricing science, enables us to bring in the brands and products to meet demand at a rate higher than we've done in recent history.\n\nMore than 55% of our offerings during holiday 2022 will be new, an increase of over 30 percentage points from holiday 2019. And we believe this will position as well to meet customer expectations. Yet, we see risk and a continued deterioration of the consumer's discretionary spending in some of our categories in the industrywide glut of pandemic-related category inventory. In light of this, we think it's prudent to recast our fall season.\n\nOur lower outlook accounts for the pressures we see in the back half of the quarter and the excess inventory that remains in the industry. The impact of these factors is reflected in the markdowns and promotions. We anticipate needing to liquidate aged inventory and further reduce the merchandise category stock to sales and balances by the end of the year. Adrian will review this in further detail.\n\nWe've successfully navigated and weathered these type of challenges in economic downturns before. Today, we are better positioned with our advancements in technology and data science that enable us to meet customer demand while protecting our bottom line. We continue to enhance the customer experience with investments in personalization, our digital platform, and physical off-mall expansion, all supported by investments in our colleagues. Our people enhance our competitive advantage, and we're retaining and attracting the talent needed to advance our strategy.\n\nOur position as a leading omnichannel retailer across the value spectrum, as well as the efficiencies we built into our business through Polaris, have allowed us to respond effectively to the changes in consumer shopping behaviors across income tiers, channels, and categories. Looking at each of our nameplates. Comparable sales for the Macy's brand decreased 2.8% on an owned-plus-licensed basis. Macy's brand customer count increased 7% to 43.9 million active customers on a trailing 12-month basis.\n\nWe continue to see strength in our most loyal and engaged customers. Our Star Rewards active members totaled 29.5 million and accounted for 70% of our total owned-plus-licensed, which is a 5 percentage point rise year over year. Our highest loyalty tier, Platinum, was particularly strong. And we're continuing to grow our active accounts primarily by new Bronze accounts, our most diverse and younger customer tier.\n\nSimilar to what we experienced during the first quarter, tourism remains below 2019 levels, although we see strength from Central and South America as well as Europe. We continue to expect international tourism in 2022, consistent with the level we saw in 2021. At our stores and on digital, we're seeing encouraging results from our new brand platform, Own Your Style, which reaffirms our position as a style and fashion authority among our customers. After seeing our branding in the second quarter, polled active customers were more likely to see Macy's as a source for great value and style, with perception increasing 16 and 18 percentage points, respectively.\n\nOur price offerings backstage and the Bloomingdales outlet are well-positioned to capture demand during an economic downturn. During the quarter, backstage stores and store locations continue to post strong results, powered by men's, women's, and kids apparel, as well as beauty and luggage. And luxury continues to stand out, as both Bloomingdale's and Bluemercury outperformed in the quarter versus the prior-year period. Comparable sales in the quarter for our Bloomingdale's brand increased 5.8% on an owned-plus-licensed basis, driven by strength across women's and men's, and kids contemporary, dressy apparel, and luggage.\n\nBloomingdale's last 12 months' active customer accounts increased 14% compared to the prior year. Next month, Bloomingdale's will kick off its 150th anniversary celebration that will run through the holiday season and feature special events and luxury designer collaborations. Building on Bloomingdale's momentum, this celebration is expected to drive continued omnichannel growth and further customer engagement. Comparable sales for our Bluemercury brand increased 7.6%, driven by continued strength in color and skin care.\n\nBluemercury's active customer count increased 9% compared to the prior-year period. Overall, we remain focused on investing in the transformation of our operations to differentiate our business, drive market share, and strengthen customer engagement, all while maintaining a healthy financial profile. We're executing on several key initiatives to support our transformation. First, we are continuing to ramp up our digital capabilities, including personalization, that increases engagement with our customers and optimizes our omnichannel experience.\n\nWe are optimizing our online platforms to provide better digital experiences, following the redesign of our mobile app in 2021. And we have seen strong conversion and growth with active app customers up about 17%. Second, Macy's marketplace will launch in the coming weeks and will include product in a wide range of categories such as pants, home, kids, baby and maternity, beauty and health, and toys and electronics. We have a great, dedicated team in place to build out our marketplace to include hundreds of new brands over the next few months.\n\nWe look forward to sharing more details in the near future. Third, Macy's media network is growing year over year across revenue, advertiser, and campaign count. Recently, we started to test a more engaging advertising experience through on-site videos on our desktop platform, offering brands to tell their stories with engaging content. Fourth, we're making progress on reimagining and rethinking our private brand portfolio, which will begin to take shape in 2023 and scale over 2024 and into 2025.\n\nWhile we're in the early stages of reimagining the portfolio to be differentiated, defendable, and durable, we're excited for what's to come based on the success of our newest brand, And Now This, and the refresh of INC. And Now This, which we unveiled in mid-2021, has seen strong growth compared to more established private brands. And during the quarter, we began the rollout of our revamped INC private brand that has seen encouraging sell-throughs in new products. We look forward to our robust private brand portfolio that better entices existing customers while attracting new ones.\n\nFifth, we recently announced that by October 15th, we will expand our exclusive Toys R US partnership to include every Macy's location, just in time for the holiday and gifting season. We're encouraged by the customer response in the current store locations, and we're seeing an improved sales trend in our Kids' business, which typically sits next to Toys R US stores-within-store. Toys is a huge opportunity for us with a fair share of market opportunity of $1 billion in annual sales. Sixth, we're taking steps to reposition our physical store footprint to better serve our customers and support omnichannel market and sales growth.\n\nWe're advancing our optimal small-format store strategy by opening additional locations for both Macy's and Bloomingdale's, including our first replacement location in the St. Louis area. We look forward to sharing the findings in the future as they develop. And finally, we're executing our commitment to creating a more equitable and sustainable future through our Social Purpose Platform: Mission Every One.\n\nDuring the quarter, we increased our partnerships with diverse designers by refreshing Icons of Style. And to support our sustainability goals, we joined Better Cotton, an organization that promotes better standards and practices in cotton farming. At Macy's, Inc., over the past two years, we've built a culture of transformation within our organization that has enabled us to better connect with our customers and to definitely navigate the challenges we've faced while continuing to deliver results that move us toward our goals. Before I turn it over to Adrian, I want to acknowledge and thank our entire Macy's, Inc.\n\nteam for delivering another solid quarter. Our customers require us to be flexible and disciplined in every area of our operations. And our colleagues are constantly adapting to meet our customers whenever and however they want to shop. With that, I'll pass it to Adrian for a deeper look into the second quarter and details on the rest of the year.\n\nAdrian Mitchell -- Chief Financial Officer\n\nThanks, Jeff, and good morning, everyone. As Jeff noted, we delivered second quarter results above our expectations. Our financial health, our talented team, and our continued investments in new capabilities, particularly those related to the use of data science and pricing, have allowed us to thoughtfully navigate through this period of uncertainty. Looking ahead, we will continue to remain disciplined by focusing on further transformational investments yielding healthy returns, the effective execution of our Polaris initiatives, and the efficient use of cash.\n\nWe will do so while remaining financially healthy in order to emerge as an even stronger and more well-positioned business than we are today. At the same time, we remain committed to long-term sustainable and profitable growth, including low-single digit compound annual sales growth, and low-double digit adjusted EBITDA margins to maximize shareholder value over the long term. With that, let me walk through our second quarter performance within our five value creation levers before discussing our outlook. First is omnichannel sales.\n\nWe generated $5.6 billion in net sales during the quarter, a decline of 0.8% versus the prior year. Comparable sales on an owned-plus-licensed basis decreased by 1.6%, which was ahead of our expectations. As you may recall, the second quarter last year benefited from the accelerating economic recovery and government stimulus payments. Despite the absence of these benefits this quarter, 22% of omnichannel markets grew year over year with a large portion of those in our Western and Southern markets.\n\nThe second value creation lever is gross margin. For the quarter, gross margin was 38.9%, down 170 basis points from the prior-year period and consistent with our expectations. Merchandise margin decreased 160 basis points, driven by a year-over-year increase in clearance markdowns within Macy's. These markdowns were largely related to our pandemic categories, seasonal goods, and private brand merchandise.\n\nFor instance, pandemic categories within Macy's saw a year-over-year decline in merchandise margin rate that was approximately 6 percentage points higher than that of occasion-based categories. Promotional markdowns intensified in July as a result of the increasing price competition across the industry as all retailers work to clear out excess inventory. Additionally, given today's inflationary environment, consumers focused more on price and took greater advantage of easier price comparisons on digital platforms across retailers. We continue to make further investments in our pricing science capabilities to improve the speed and effectiveness of our pricing decisions that are necessary to compete in this climate.\n\nThose investments are focused on further enhancing the current suite of tools we have to support strategic pricing decisions. And we are launching additional capabilities to optimize pricing in more categories across locations and channels within the competitive landscape. Partially offsetting the additional markdowns in the second quarter were higher ticket prices and favorable category mix shifts that help drive an owned AUR up approximately 5% for Macy's, Inc. For Macy's brand, AURs with occasion-based categories saw growth of 12.5% over the prior year.\n\nHigher prices and lower promotions drove the results within these categories. AURs within pandemic categories declined 6% due to higher promotional and markdown actions. Delivery expense accounted for 4.5% of net sales that's 10 basis points higher than last year, largely driven by higher fuel costs and an increase in the percentage of digital sales were filled through the vendor direct channel. Together, these more than offset the impact from the two percentage point decrease in digital penetration and the work we've done to reduce cost per package.\n\nThe third value creation lever is inventory productivity. Inventory turnover for the trailing 12 months improved 15% compared to 2019, while remaining relatively consistent with 2021 levels. Inventory management is and will continue to be a key focus as we leverage our data science capabilities. An example of this is using our analytics to determine the optimal time to take markdowns at the style and location level in order to increase full-price sell-throughs and AURs.\n\nIts investments like this that will allow us to maintain healthy margins and strong cash flows over time. Expense discipline is a fourth value creation lever. SG&A expenses increased by $83 million or 4.4% to $2 billion. SG&A as a percent of net sales deteriorated by 180 basis points to 35.4%.\n\nAs a reminder, when comparing SG&A to the prior year, we had a significant number of open positions in 2021 due to the tightening labor market and since then has still the majority of the open positions. Additionally, as of May 1, all of our colleagues in stores and distribution centers are now at a minimum wage base of $15 per hour, if not above. And we continue to adjust colleague compensation to remain a competitive and attractive employer of choice, while at the same time remaining very disciplined in our SG&A productivity efforts. Compared to 2019, SG&A improved 390 basis points reflecting the impact of the $900 million of annualized permanent Polaris cost savings from the 2020 restructurings.\n\nDuring the quarter, SG&A also benefited from the growth of Macy's media network, which generated net revenues of $30 million in the quarter more than 60% higher than the prior year. Credit card revenues were $204 million, up $7 million from last year. As a percent of net sales, credit card revenues were up 10 basis points to 3.6%. Similar to last quarter, credit card revenues exceeded our expectations, driven by lower bad debt levels than expected, larger balances within the portfolio, and higher-than-expected spend on co-brand credit cards.\n\nAlthough, we've seen bad debt trends better than our expectations, we're taking a measured view on bad debt for the remainder of the year based on potential early signs of rising credit delinquencies and slower payment rates in the second quarter. Adjusted EBITDA $616 million for the quarter exceeded our expectations. After accounting for interest in taxes, these results generated adjusted diluted EPS of $1 down from $1.29 in 2021, yet up from $0.28 in 2019 and ahead of our expectations. Lastly, the fifth value creation lever is capital allocation.\n\nCritical to our success is our ability to manage our cash effectively and efficiently. Working capital productivity and maintaining a healthy balance sheet remain top priorities as we navigate through this uncertain environment. Year to date through July, we generated $303 million of operating cash flow and invested $582 million in capital expenditures. Year over year, operating cash flow was impacted by outflows from accounts payable and accrued liabilities, as well as the net outflow from the change in merchandise inventories, net of merchandise accounts payable due to the timing of inventory receipts and payments.\n\nYear to date, free cash flow was an outflow of $206 million. We are laser-focused on using cash to invest in high return opportunities that will accelerate the benefits of our Polaris strategy even with economic uncertainties that exist right now. For instance, supply chain modernization. We're building a faster, more efficient, and more flexible network to move product through our system at a lower cost.\n\nThis includes a number of projects we've announced this year, including market-based fulfillment centers and select stores and our distribution center being built in China Grove, North Carolina. Our investments in simplifying our technology infrastructure and growing our data analytics capabilities is designed to accelerate the speed of decision making within our operations and simplify the complexity that existed within our technology infrastructure. This will ultimately lower the cost of doing business. Digital marketplace is another high return investment that is all about assortment and brand expansion under a curated platform and without the inventory handling costs.\n\nAnd finally, personalization is necessary to increase the relevancy, quality, and frequency of our interactions with our customers in order to drive incremental sales and margins. While investing in our capabilities, we have and will continue to prioritize liquidity and balance sheet health in order to maintain flexibility and the ability to respond quickly to a variety of opportunities as they arise. Next, I'll walk you through our updated outlook for the third quarter and the remainder of the fiscal year. Full details of our updated guidance can be found within the presentation on our website.\n\nOur revised outlook for the year reflects a careful view of the impacts and pressures faced by the consumer and those placed on our business given the weakening macroeconomic environment. The consumer is not as healthy as they were in prior quarters. Studying much of the same industry data that many of you do, we have seen declining retail traffic in areas of weakening apparel sales over the quarter as the consumer faces higher costs on essential goods, particularly grocery. Wage growth is not keeping pace with inflation, which is putting pressures on savings rates.\n\nOur earnings outlook for the remainder of the year incorporates the risks we see in some of our discretionary categories, as well as risks associated with a more pronounced macroeconomic downturn. The actions we are taking are intended to drive sell-throughs and have the available product freshness, customers are looking for. Additional markdowns will be taken in order to end the year with inventory at the appropriate levels. So, for the fiscal year, here's what we expect from Macy's, Inc.\n\nNet sales of $24.3 billion to $24.6 billion, a drop of $120 million on both ends of the range from our prior guidance. Gross margin down roughly 150 basis points from 2021 lower than our prior guidance due to the additional markdowns previously discussed. SG&A as a percent of net sales deteriorates approximately 120 basis points from 2021. Net credit card revenues of approximately 3.3%.\n\nWe've also narrowed our range for asset sale gains. It had been $60 million to $90 million, and we've changed it to $75 million to $90 million. This reflects an updated asset sale gain expected for the third quarter of nearly $30 million. Our revised annual outlook now puts our adjusted EBITDA margin at roughly 10.5%.\n\nAfter interest and taxes, we're estimating annual adjusted earnings per share of $4 to $4.20. Our outlook does not consider the impact of any potential future share repurchases associated with our current share repurchase authorization. For the third quarter, we expect net sales between $5.16 billion and $5.23 billion and adjusted earnings per share between $0.15 and $0.21 inclusive of the asset sale gains we spoke of earlier. We estimate that gross margin deterioration versus 2021 will be no more than 350 basis points reflective of the impacts of the markdowns needed to drive higher inventory productivity and improve the composition of our inventory by year-end.\n\nIt also reflects the risk associated with the competitive promotional climate intensifying within the industry and elevated fuel costs that we expect will persist. While we are committed to taking the necessary markdowns, the year-over-year growth rate in inventory at the end of the third quarter is expected to be similar to the second quarter to ensure the appropriate freshness and inventory levels for the holiday season. For the fall season, we expect digital penetration to be approximately 35.5% considering the trends observed at the end of the second quarter and the expectation for digital return rates to remain elevated. In closing, I want to reiterate that our financial health provides us with significant flexibility to respond to changing trends.\n\nWe're investing in new capabilities to help us navigate through this uncertain period with strength. And with that, I'll turn it back over to Jeff for some final words.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nThanks, Adrian. Over the past two years, we have been thoughtful and measured in our decision making to better prepare us to confront the unprecedented challenges we faced while protecting our business. This would not have been possible without our talented team driving our durable strategy. While there is uncertainty ahead, our financial health and operational efficiencies bolster our confidence that we can effectively manage these difficult short-term pressures.\n\nAt the same time, we feel confident that we can deliver on our long-term initiatives as part of our Polaris strategy. We firmly believe that we'll be able to traverse the challenges ahead, grow market share and profitability, and emerge from this uncertain period as an even stronger business than when we entered. And with that, I'll turn it over to Q&A.\n\nOperator\n\n[Operator instructions] And our first question today comes from Oliver Chen of Cowen.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, good morning, Jeff and Adrian. We've also noticed cautious trends in July. Would love your thoughts on that month in terms of traffic and promotions and how that may interplay with your guidance, as well as the level of markdowns you'll need to take. As you think about Macy's as an ecosystem, just to follow up on the marketplace and media, they sound like big opportunities.\n\nHow should we think about how that may impact the financial model near or longer term? Thank you.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nHey, Oliver. Let's talk about July. So, the month of July, really, since Father's Day, we saw that the back half of the second quarter was about 5 percentage points lower than the front half. So, we had a very strong Mother's Day and Father's Day, as we quoted in the post.\n\nAnd that trend basically was -- you know, we took that all the way back through the back half of the year, which informed, you know, where we were going to be in terms of our guidance. We looked at the promotional levels. We looked at the inventory that was mounting in some of the pandemic categories, as well as though looking at our holiday opportunity and the newness, the gifting opportunities that we have, and how we experience gifting in Mother's Day and Father's Day. So, all are factored it into our guidance.\n\nAnd I'll tell you in the third quarter to date is basically conforming to our revised guidance. So, when we're seeing how back-to-school is performing and how the, you know, first three weeks of August are performing, so in line with that. I tell you that on marketplace, we're excited about that opportunity. It launches over the next number weeks.\n\nWe'll give a lot of detail on that and in future calls. But we definitely expect that to be, number one, it's going to give our customers lots more opportunities to transact on the Macy's brand, as well as the Bloomingdale's brand in the future. And then with Macy's media network, that one has been a standout for us. And so, when you look at the numbers that Adrian was quoted in the past, you know, $30 million of revenue in the second quarter.\n\nMost importantly, customers are really taking to it, and our brand partners are really enjoying the increased interaction that we're providing based on all the traffic that we get on our sites.\n\nOperator\n\nOur next question comes from Matt Boss of J.P. Morgan.\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nThe 8% category growth in occasion-based categories that you cited versus the double-digit drag in the pandemic categories, I guess, maybe larger picture, how has your overall view of the health of the consumer changed relative to three months ago? How are you planning demand for lower-income versus higher-income cohorts? And then, Adrian, just on the gross margin, when we incorporate the markdown actions that you have embedded in the third quarter, how do you anticipate the forward look on inventory as we exit the third quarter relative to the fourth quarter?\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nHey, Matt, let me start. So, basically when you look at the spend by tiers, it basically slowed it at that -- basically the same rate. And so, you know, we're not really seeing evidence yet of trade down going on between different buckets of income levels. What we saw was differences in engagement.\n\nAnd obviously our most productive customers, our platinum customers, and Star Rewards were highly engaged. And occasional shoppers were less engaged. To your question about occasion-based, you know, that is -- those are just very healthy categories for us. So, the AUR there was up about 13%, and you just got real standouts there where you've got men's clothing, you know, AUR was up 29%; missy career, which would be the equivalent of suiting and wear-to-work was up 20%; luggage was up 20%.\n\nSo, we expect those AURs to continue. As we get into those categories that we have excess inventory to supply, as well as where I would characterize the balance of the industry, you know, we expect those to be constrained. Certainly with pricing, a transparency, we're seeing those sell-throughs were depressed really since Father's Day. And so, that's what we factored in terms our gross margin, particularly the gross margin that we're quoting for the third quarter of responding to that.\n\nAdrian Mitchell -- Chief Financial Officer\n\nMatt, good morning. If I could speak, first, to the markdown question that you raised, and then I'll go into the inventory. You know, the big headline on the gross margin overall is that it really reflects the actions that we feel are necessary, given some of the challenges that you highlighted as we look ahead to the back half of the year. But with regards to the gross margin, there are really three things that we're managing through in the fall season.\n\nThe first, as you pointed out, is really taking the necessary markdowns to clear the aged inventory. Jeff spoke about the seasonal goods, the private brand merchandise, the slow-moving pandemic categories. We want to work through those -- that inventory and markdown appropriately to increase sell-throughs and position us better going into the next year. But we are also managing elevated supply chain costs.\n\nI've called that out as well. You know, when you think about freight and delivery, fuel costs are currently trending down, but they remain elevated to what we saw earlier in the year. As you think about where we were last year, we saw raw materials like cotton prices increase. And a lot of that is now flowing through this year, as we are receiving those receipts.\n\nThe third thing I'd point to in terms of margin is really just the pressures within certain categories that are experiencing increasing promotional intensity, as well as excess inventory across the retail industry. So, as Jeff spoke about earlier, categories like sleepwear, men and women's activewear, casual, sportswear, those are areas where we're going to have to respond. And we want to make sure that our margin profile actually reflects that. In contrast, you know, we're also making sure that we're going to be disciplined on our buys.\n\nWe are supporting freshness for the holiday season, but we're also very focused on inventory productivity and inventory health. And so, our pricing sciences watching the selling patterns in terms of the demand and anticipating and quickly responding to those are going to be the kinds of things that we're doing to manage our gross margin position. Now, if you think about the inventory, the inventory is an important piece to think through. As I mentioned earlier, we're going to take the markdowns necessary.\n\nWe're going to flow the appropriate receipts to support strengthen the holiday season. But the important thing to keep in mind is we will end this year with the appropriate level of inventory. Now, we do expect relative to last year, our ending Q3 inventory to be at similar levels on a rate basis relative to the second quarter. But that's really responding to the opportunity to be ready for holiday and have strength going into the back portion of the year.\n\nSo, that's how we're thinking about both the gross margin for the back portion of the year, as well as the inventory.\n\nOperator\n\nOur next question is from William Reuter of Bank of America.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nHi. I just have one question. In terms of the accelerated pace of asset monetization in the third quarter with this additional $30 million sale, does this say anything about the pace of monetization over the next couple of years? And if we were to think about what we might expect in terms of proceeds and aggregate over the next five years. Do you have a sense for what that could be? Thank you.\n\nAdrian Mitchell -- Chief Financial Officer\n\nGood morning, Bill, and thank you very much for your question. So, as I highlighted a little bit earlier, we continue to be comfortable with our asset sale forecast for this year. We do anticipate having an additional asset sale gain in the third quarter. So, that's reflected in narrowing the range to $75 million to $90 million.\n\nThat being said, you know, we continue to remain very committed to our real estate monetization priorities. You know, as we think about the kinds of factors that are outside of our control that we have to kind of look and manage, it's really the interest rate environment and kind of any kind of slowdown that may exist on the horizon. But we continue to be very excited about the opportunity around real estate monetization. We're watching the macroenvironment closely, and we're continuing to develop, you know, programs to monetize assets across our network.\n\nWe have not provided any guidance around what the next five years or three years may look like. We'll certainly speak to what 2023 will look like in a couple of quarters, but we just know that we remain very committed to real estate monetization.\n\nOperator\n\nOur next question is from Lorraine Hutchinson of Bank of America.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThanks, good morning. I was hoping just to get your views on your expected free cash flow profile for the back half of the year. And then also how you're thinking about the buyback, understanding it's not in guidance, but if you think that you will continue to repurchase shares with your excess capital in the back half.\n\nAdrian Mitchell -- Chief Financial Officer\n\nYeah. So, just to give a perspective on how we're thinking about both the free cash flow profile and buybacks, in times of uncertainty, our No. 1 focus is preserving cash and maintaining liquidity. That's really paramount for us.\n\nSo, as we think about our free cash from what's going to be driving it, one of the things that we're very focused on are continued investments in the kinds of initiatives that's going to drive margin expansion for us. We also want to preserve cash to maintain flexibility to support those fresh receipts that we spoke of earlier to really support the holiday season. And we want to make sure that we're maintaining balance sheet health as we navigate these on certain times. Just know that we'll end the year in terms of our cash position in a way that will allow us to support our business goals, But we continue to be committed to our dividend.\n\nWe continue to be committed to the remaining balance of share repurchase. But keep in mind that our share repurchase is open-ended. So, for us, just to kind of recap, Lorraine, it's all about preserving cash and liquidity in these uncertain times.\n\nOperator\n\nOur next question is from Omar Saad of Evercore Partners.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nGood morning. Thanks for taking my question. I actually first just wanted to clarify and that kind of slowdown that occurred during the 5-point slowdown that occurred during the quarter, Did both the COVID winning categories, as well as the occasion-based categories all slowdown that kind of same 5-point? And then I was also wondering if you could speak to the performance of your older consumers versus a lot of the younger consumers that you picked up during COVID, you talked about the platinum doing really well. Is that mostly a boomer-type consumer? Thanks.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nSo, Omar, let me start, the occasion-based categories did not slowdown at the rate that the pandemic categories slowed down. And when you look at our older customers, you know, they are -- when you look at kind of over 40 and under 40, we basically saw about the same level of slow down between those demographics. And as mentioned, the same thing we saw in the income buckets would really characterize the activity was really their productivity level within the proprietary program. So, the gold and platinum customers, you know, were retaining their spends and more of the less engaged customers are more occasion-based -- or the less occasion-based categories.\n\nThose customers downshifted.\n\nOperator\n\nOur next question is from Kimberly Greenberger of Morgan Stanley.\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nGreat. Thank you so much. Good morning. I wanted to just make sure I'm doing the math right here on the comp sales in the first half of the second quarters compared to the second half.\n\nIf I'm hearing you right, comps were actually around plus one in the first half of the second quarter and down around four. Is that right? Am I doing the math on that correctly?\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nYes, you're in the geography, right? Kimberly, yes.\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nOK, great. That's super helpful. And then, you know, Q3 to date has sort of continued at that minus 4% exit rate, it sounds like, Jeff, so far here during back to school?\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nIt's a little better than that, Kimberly. But yes, that's in the same -- it's in the ballpark.\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nOK, great. And then Jeff, I just wanted to ask about inventory. Because obviously consumers spending trends are changing, they're very dynamic. As you've come through the last three or four months, you've seen the categories that consumers are spending on change in some cases dramatically.\n\nSo, I'm guessing that you, along with the merchant team, are sort of rethinking the inventory by going forward. If I know you're sort of adjusting dynamically here through the fall season. But when in the future, did you have a blank slate where you could just rebuild the inventory sort of from the ground with a fresh forecast? In other words, when do you think the buy on the inventory is going to be optimally repositioned and you'll have it, you know, sort of fully where you want it to be?\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nYes. I think we're in good shape on this subject. Obviously, we spent a lot of time and effort on this. So, I would say that the buy for the fourth quarter onward and the stock levels that we will have entering into the fourth quarter are pretty much at the status that we would build from the ground up.\n\nSo, there may be -- that's assuming the sell-throughs that we've been getting really since Father's Day in some of the slower categories that they persist. We're taking more aggressive markdowns to ensure that when we talk about the kind of sell-throughs that we got since Father's Day. And some of these pandemic categories in second and third markdowns, that was off about a third from the rates that we were getting, you know, previously in the quarter. And then first markdowns were off about a half point.\n\nSo we've taken those kind of sell-throughs. We've applied it to being more aggressive on our hard markdowns in our POS on all those categories. But assuming that and you saw that in a kind of our guide on the 350 basis points, expectation -- degradation of gross margin in the third quarter versus 2021 levels. So, we believe that the stock to sales ratio are going to be close in the areas that are not trending.\n\nAnd we've been able -- we're already at status in those categories that are trending in both market and private brands. So, we're flowing those goods appropriately. As mentioned, we feel good about the receipts that we've got coming in for the fourth quarter. So, we feel that the post that we'll have in inventory at the end of the third quarter, as Adrian mentioned, similar to where we are right now, the second quarter.\n\nThat's appropriate to where we're going into the holiday season. We expect the holiday buying, you know, still will be starting in the month of October as it did in the pandemic years. We want to be fully ready for that. And then as Adrian mentioned, we expect that our stock to sales ratio will be appropriate by category, by channel, you know, entering 2023.\n\nAdrian Mitchell -- Chief Financial Officer\n\nKimberly, if I could just add a few things and amplify one thing that Jeff mentioned. You know, as a bit of context we are -- when you look at our inventory productivity, we're better than 2019 and relatively flat to last year when -- effectively, we were relatively lean, not only at Macy's, but across the industry. And I think that speaks to just the processes and capabilities that we built around this topic of inventory productivity. But there's kind of three things that we're looking at as we look at the business going forward.\n\nOne is just, to Jeff's point, really improving the composition of inventory by category, by brand and by channel, and doing that in a way while we're still managing our vibes very efficiently. The other piece is really leveraging our pricing science. We recognize that we're going to have to deliver competitive market prices in this environment, but we're doing it in a way that's going to improve our sell-throughs and improve relatively speaking our margins as well, based on what we've shared in our forecast. But the other piece is location level pricing.\n\nThis is something that we've spoken about earlier. And we're continuing to refine the mathematics and the technology around this, which just gives us much better precision around how we're actually managing at a local store level or by channel the pricing that helps us to remain competitive in this marketplace. And then the last piece that we're pretty excited about is really tapping into both the vendor direct and soon-to-be marketplace capabilities to really think about what channel or subchannel we're supplying those goods in the most profitable way. So, those are some of the things that we're doing to manage through the inventory dynamics that's ahead of us as well.\n\nOperator\n\nAnd we can go to Steph Wissink of Jefferies.\n\nSteph Wissink -- Jefferies -- Analyst\n\nThank you. I have two quick clarification questions. The first Adrian is just on the inventory balance year over year. Could you help us think about what inflation is in that figure versus units? And then I think you mentioned cuts and inventory with some of your national brands.\n\nCan you share with us a little bit about some of the categories where you're actually cutting inbound receipts? Thank you.\n\nAdrian Mitchell -- Chief Financial Officer\n\nSo, I'll start with the inventory and then I'll hand it over to Jeff to talk a bit about the assortment. So, from an inventory standpoint, we expect to end the year in a very healthy position or an appropriate position. As you look at, you know, the third quarter, what we do expect is that the increase relative to last year is going to be more in line with what we saw coming out of the second quarter. And this is really about making sure that we have the freshness going into the holiday season.\n\nAs you can imagine last year, having the appropriate freshness and time for holiday was certainly a challenge within the industry. We feel that we're much better positioned on that. As I mentioned a bit earlier, our input costs are higher. We're managing through inflation with regards to both logistics of getting the product to us, as well as the raw materials that are going into the products that we sell.\n\nSo, what would be implied there is that we're bringing in product at a higher cost, but on lower units to align with our unit velocity sell-through and our sales profile.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nSo, Steph, on the question on the kind of market brand. So, you know, recognizing that we -- when you talk about kind of the occasion based categories in the market brands, our demand is up when you looked at the second quarter up about 7% and inventories are up 5%. So, that's about the level that we want to see is having demand slightly outpace the supply assuming that the year-end question is the right base. And then when you look at the pandemic categories, if you look at our market brands, we've really been able to cut that back.\n\nSo, the demand there is down about 24%, and supply was down about the same. So, we were able to get those in status. And I feel pretty comfortable across our brands that we're in line with the categories that our customers are trending with. And, you know, we're always working through tweaks, but we're in pretty good shape there.\n\nAnd again, where we've got big opportunities in the third and the fourth quarters. I don't expect issues in supply chain to be able to hamper our ability to flow those goods. So, we're working with all of our market partners. And we've been doing that, obviously, in first and second quarters to get the rate -- get the receipt in line with demand.\n\nAnd we're basically there now. And as we go through the back half of the year, we're going to stay very disciplined in that view.\n\nOperator\n\nThe next question comes from Gabby Carbone of Deutsche Bank.\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nHi. Good morning, and thanks for taking our question. Just wanted to dig into Backstage, so flat comps for the quarter, which outperformed your Macy's full-line stores. You know, given kind of the excess inventory out there, do you think there is the opportunity to provide customers with even better value at Backstage moving ahead.\n\nAnd then it sounds like you aren't seeing a trade-down to Backstage from full-line stores. Is that correct?\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nYeah, that's correct. So, Gabby would -- if you look at the -- first off, Backstage is continuing to perform well for us. It definitely is a growth strategy for us. So, we now have 308 locations opened in store-within-stores.\n\nWe just opened State Street and Herald Square. When you look at -- and just what we've seen all the way through, you know, our journey with Backstage since 2015, is that customers who shop Backstage, you know, in our individual stores that also shop the balance of the store are our best customers. We're getting more frequent trips. They're more profitable for us.\n\nTheir spends are up quite strongly versus stores who are just shopping in a particular channel. So, we have not seen a big shift in the difference. When you look at the variance of the trends of those stores in Backstage versus the balance of the store during the second quarter versus what it was prior, not a difference. So, we don't see a down shift into, you know, the -- where you're seeing more customers from the full price going in the Backstage section.\n\nJust the customers that are shopping between them are very healthy customers.\n\nOperator\n\nWe can go to Paul Lejuez of Citi.\n\nTracy Kogan -- Citi -- Analyst\n\nThank you. This is Tracy Kogan filling in for Paul. I know you noted earlier that you hadn't yet seen the trade down customer in your stores. And I was wondering what you've seen in prior periods of consumer weakness, maybe in terms of early signs of the customer trading down, is it to your private brands? And then when you do get the trade down customer from other places to Macy's.\n\nWhen have you typically seen that, and where are they trading down from? Thanks.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nHi, Tracy. So, again, we have not seen a trade down as of yet. And I think it really -- I just would characterize our business is really just the difference between, you know, the categories that they're spending in right now. And so, from the point of view of where you have an abundance of stock in certain categories, you're going to need to liquidate those with lower prices.\n\nWe don't operate in a vacuum. Our competitors are in the same boat, so customers are going to take advantage of that. Where we still have customer wanted categories, and there's more scarcity of product with us and with the market, we're getting the higher AURs. I mentioned some of those earlier.\n\nSo, that's how I would characterize it right now. What I would talk about on the Bloomingdales, we're not seeing any -- we're seeing our most affluent customers continue to spend at very strong levels. The 150,000 and above, you know, we have not seen trade-down at Bloomingdales' either and their business continues to be quite robust. But nothing yet, and nothing that's informing us from prior recessions that's going to suggest anything that we haven't put into our guidance for the balance of the fall season.\n\nOperator\n\nNext question is from Chuck Grom of Gordon Haskett.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nThanks a lot. Good morning. Adrian, on the credit front, in order to get to 3.3% of revenues for the year implies a pretty big drop in the second half, you know, roughly 10% to 14% year-over-year. I guess, can you speak to, to what's driving that assumption? Are you seeing a big change in credit quality bad debt? And then, Jeff, just geographically over the past six weeks, just wondering if you're seeing any major trends across the country?\n\nAdrian Mitchell -- Chief Financial Officer\n\nGood morning to you. With regards to the credit card revenue, I think the punchline here is that we're just taking a measured view on bad debts for the remainder of the year. We're monitoring credit delinquencies, we're monitoring payment rates. And so, as we look ahead, there're just a number of factors that from our perspective, just continuing to take that measured view.\n\nSo, when we look at the industry more broadly, we see that inflation about pacing wage growth. That's just not sustainable for the consumer. We see that consumers are under pressure with regards to elevated gas prices, as well as double-digit increase in grocery prices. So, as we look at some of these different indicators, you know, we're just very thoughtful and very measured about what we believe bad debt will actually be.\n\nNow, that being said, we are seeing increased balances. We are seeing increased co-brand spend. So, that continues to drive more of a healthy guidance of about 3.3% of credit card revenues as percent of sales, as we think about what the outlook will be for the year.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nAnd then, Chuck, to your second question the Western and really the Southern markets are performing better than you saw in our -- if you take a look at our slide deck, it'll show you the 22% of our omni markets had increases in the second quarter. And what you'll see there is the Southern markets definitely perform better. The other comment I'd make that within the quarter is the return of the downtown locations. Not so much as a result of tourism, but certainly a return to work.\n\nAnd so, those return to work and getting the traffic around those buildings with more offices being filled, albeit, not certainly at levels that we were pre-pandemic, but certainly better than we were, you know, in the -- against the quarter of comparison. And that's really helping us. So, when you look at like downtown, certainly here at Herald Square, Union Square, you look at downtown Boston and Washington D.C. Those are all -- those locations are quite strong.\n\nSo, Southern markets and downtown locations would be how it characterize the geography question.\n\nOperator\n\nOur next question comes from Jay Sole of UBS.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you so much. We got three-part question. First is Jeff, can you elaborate a little bit on the toys opportunity specifically in 4Q? I think you said that toys sales grew 3x over 2Q of 2021, and you see $1 billion opportunity.\n\nSo, what does that imply, you know, about maybe the opportunity in 4Q? And then secondly, thinking about omicron last year and how that impacted comps and sales, you know, what do you think about lapping that this year? What kind of opportunity would that create for December? And then lastly, during the quarter announced the acceleration of the growth of the off-mall, small-format strategy, so could you just maybe give us a little bit of an update there and tell us what you're seeing and what the bigger picture opportunity is for the smaller-format stores? Thank you.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nYou got it. OK. Jay, so let's just take it from the top on toys. The fair share opportunity would be if you take Macy's percentage, you know, within these categories and you apply to the overall toy market, that's how you get to the $1 billion.\n\nThat's not to suggest we're going to get to $1 billion at the end of 2022, but that's currently what we're really pushing for. When we signed on with Toys R Us, and we decided to put, you know, the investment that we went against this, it was recognizing that we had a very small toy business. It was in Backstage and online. We did not have a developed toy business.\n\nThis is really putting us in the game. We do believe that Toys R Us offers us the most experiential omnichannel toy experience in America. When all is said and done, we'll have 400 Toys R Us shops that will be constructed, including some flagships by October 15. So, we're well on our way on that.\n\nSo, we have nothing but growth ahead of us with toys over the coming years. With respect to omicron, frankly, the omicron really affected us more in the month of January. Obviously, our smallest month of the year than the month of December. It started to -- we had a strong January last year.\n\nWe had a tough January. So, that's incorporated in our guidance. And then with respect to off-mall, small-door format, we're continuing here. We have three formats there that we're really playing with.\n\nThe first one is kind of the backfill strategy. That's where we've got high productive markets, omni-markets, and where there is zip codes in which our digital business is not as high as the balance of the market and where there may be opportunities for us to put a new brick and mortar. You just saw us open Johns Creek in Atlanta. That would be an example of that.\n\nThen we have replacement markets where we basically have stores that we've identified to say, we have about 60 more stores that were neighborhoods that we'd set over time, we might close. And those would be examples where by closing those in the past, we've seen us kind of firing customers. And how do we have a strategy in brick and mortar that retains those customers? So, Chesterfield is a big one for us. That's in St.\n\nLouis. We're opening up a Market by Macy's in October. We're closing the store that's in the Chesterfield mall, which is about two miles difference in and the Chesterfield Market by Macy's will be in a thriving strip center. So, we're going to see how that works, and we're going to be testing that.\n\nAnd then the third bucket is new markets, those places that have strong interest for Macy's. And we see that in the digital, in the buys in those zip codes and the opportunity to add a Market by Macy's in the future. So, you're going to see that flavor pop into 2023. We're also applying on the Bloomingdale's front.\n\nSo, we are in Mosaic. There is another one that we're opening this year. There's one that we will be opening in the beginning of 2023. We'll give everybody detail on that.\n\nBut the objective on this is recognizing that about 50% of brick-and-mortar business is done off-mall. And how can we play in our ecosystem with a small-door format that works for both the Bloomingdale's and the Macy's brands. So, we -- our hope is that we're going to have a scalable model in the future to be able to roll that out at scale.\n\nOperator\n\nThe next question is from Bob Drbul of Guggenheim.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nHi, good morning. Just, you know, one question that I have as you think about, you know, the back half of the year, and even into 2023, there's just been a lot of discussion around, you know, your vendors taking price increases. And I'm just curious if you've revisited any of [Audio gap] the direction around the sales over the -- you know, since post Father's Day? Thanks.\n\nAdrian Mitchell -- Chief Financial Officer\n\nHey, Bob. You --\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nHey, Bob. You kind of cut out in the middle of your question. So, you were talking about vendors and -- say that again, ask that again, please.\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nI'm sorry. The question that I have is just on, you know, price increases. Like there's a lot of vendors that have talked about taking price in the back half of the year or into 2023. Given the change in direction on the trends, are you revisiting some of these initiatives with your vendors? Just trying to understand how you're thinking about it going into the back half into next year?\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nYes. So, I think we're -- you've got a trending category and you have a price increase. What I'd say is that our manufacturing partners, market partners have done a great job of not just having a price increase, but in many cases, putting more quality into the goods, either more make or more trim, more quality, and that's commanding a higher price point. And when you're in a category that is, let's say occasion-based or, you know, other categories that are not pandemic in that particular flavor, we're passing on those cost increases.\n\nAnd the customers are responding quite well to it. So, I mentioned that in like men's clothing, I mentioned that in women's clothing, as well as luggage, but there's brands. I look at Ralph Lauren as a great example of that. Ralph Lauren has really improved their quality.\n\nWe're getting much higher AURs there. We're fully aligned with that brand in terms of our strategy together. And that includes, you know, improving the customer experience both online as well as in-store. So, if you've got a considered strategy about what you're doing and there's good value in the price increases you're making customers will transact quite well with that.\n\nSo, I think it depends on what category, what brand you're in. But it's a general comment, I think we're fully aligned with our vendor partners on that strategy.\n\nOperator\n\nOur next question comes from Michael Binetti of Credit Suisse.\n\nMike Binetti -- Credit Suisse -- Analyst\n\nHey guys. Thanks for taking all our questions here. I guess a lot of our questions have been answered. But I guess when you look at the year, you just guided us to and kind of step back, where do you think about where AUR will end the year, where units will end the year? And as you think about spring, I know there's some parts to the assortments you have to start forming up plans a little earlier.\n\nSo, maybe, at this point, just how you're thinking about positioning the business for return to growth next year lapping, you know, some of these AUR increases. Do you think about growth in terms of ordering units up as you look to spring to drive growth plans to recapture some level of full-price selling against the guidance for more markdowns in the back half? Maybe just help us think about how you, early on, think about driving the business for growth after year like 2022?\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nOK. So, Mike, let me take the AUR. And I'll talk about how we're thinking about kind of return to growth, and let Adrian add anything on that question. So, when you think about AURs, what we quoted in the beginning of the year pretty much stands where we are right now, which is we think we're going to be up about 5%.\n\nThat's what we were up in the second quarter with kind of the ins and outs of -- again, you've got pandemic categories, which is a chunk of our business. You've got other, which is a chunk of our business. Then you've got the occasion-based categories, which is a chunk of our business. And when you look at the blend of all of that, , you know, we're in the ballpark of that kind of mid, single digit AUR improvement as we look at it versus 2021.\n\nAs you kind of think about, , you know, where we -- really an answer to Kimberly's question, we are really talking about just what we're focused on in terms of inventory and ensuring we've got the right inventory by channel, by location, and certainly by category and brand. And so, we do believe that, you know, having a better status across all of that in a stock to sales ratio and making sure that you've got built in liquidity and just some reserve that is going on to be able to respond in season is really important. And so, that's a discipline that -- and Adrian went through all the tools that we're using. Once we get it in to make sure that we're maximizing the profitability on the way out, but also on the way in and the buy in, you have that same level of rigor that goes into how we're constructing it.\n\nSo, we want to retain flexibility. You know, we're not quoting yet what our guidance is for 2023. But just know that our inventory and our stock to sales ratios will be in line with those expectations.\n\nAdrian Mitchell -- Chief Financial Officer\n\nAnd, Mike, just to add to Jeff's point, you know, we remain committed to our long-term targets. And as you heard us speak to in prior calls, we're committed to low single-digit sales growth, as well as low double-digit adjusted EBITDA margins. But, you know, as we think about, you know, where we are today, we have to see how the consumer shopping behaviors and how the macroeconomic trends, really how they unfold for the balance of the year before we provide kind of a clear outlook for 2023. But that being said, as we think about longer-term targets, we remain committed.\n\nYou know, a demonstration of that conviction that we have is really in the actions that we can continue to invest in the near term. We're continuing to invest in initiatives that we believe are high-return initiatives, whether it's strengthening our pricing capabilities, our Macy's media network capabilities, which is our advertising agency, or even building new sales capabilities with things like marketplace. We're being very disciplined on inventory management to position ourselves for healthy and profitable growth next year. So, a lot of the inventory productivity and pricing initiatives that we're referencing are really capabilities that we continue to lean into with strength.\n\nBut I would also say that we're investing in our talent as well. We're investing in our talent to execute a strategy for Macy's that is an evolved Macy's. And it changed Macy's relative to what we've been investing over the last several years. But I think the overarching punchline in terms of how we're approaching it is to really, you know, do what's necessary to strengthen our competitive position with a healthy balance sheet, with new capabilities, with a talented team, so that we can take advantage of growth opportunities coming out of this uncertain period over the course of the next six to 12 months.\n\nMike McGuire -- Head of Investor Relations\n\nKevin, we'll take two more questions.\n\nOperator\n\nThe next question comes from Dana Telsey of Telsey Group.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nDana, you're up.\n\nOperator\n\nTelsey, your line is open.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. Can you hear me OK?\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nYeah, we can hear you now.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nPerfect. Can you expand on the magnitude of the digital returns, what you're seeing there? And is that in-store also? And just with the following up with the guidance adjustments, how you adjusting your holiday plans, including marketing spend given the current environment. Thank you.\n\nAdrian Mitchell -- Chief Financial Officer\n\nGood morning. I'll start with the topic of returns and then hand it over to Jeff to talk about our holiday plans. So, if you look at returns overall, returns are higher than last year, but actually lower than 2019. So, for example, on the digital side, in the second quarter, we saw returns were up about 4 percentage points higher than last year, but still 2 percentage points lower than 2019.\n\nSo, when you think about what's driving the higher returns, it's a lot of what you would actually expect. There has been a shift in the category mix toward apparel. So, when you think about dressier, more tailored apparel categories, they tend to have a higher-return rate than what we've seen in prior years with the demand around center core and home categories. And then if you compare it to kind of the trend that we've been seeing over the years, our digital penetration, for example, in the second quarter was 8 percentage points higher than 2019.\n\nAnd as you know, the digital channel tends to have a materially higher return rate than the stores channel. So, it's a really a combination of mix, a combination of digital penetration that's really impacting how we think about returns this year versus last year, but we're continuing to see favorability relative to our pre pandemic levels. And the category mix trends that, you know, I've just described, that's all reflected in our outlook for the balance of the year. But that's kind of how we would speak to the returns profile.\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nAnd then, Dana, on the marketing, marketing is definitely going to be commiserate with the sales expectations. You know, we had a slide down shift and overall volume for the back half of the year. So, when you think about the marketing that is going against those sales, pretty consistent to what you've seen in the first half of the year. What I talk about is some of the differences in marketing is that really our upper funnel tactics are really going to go to branding.\n\nSo, when you think about what we're doing with Own Your Style and being a gifting destination, you know, that's what you're going to see on the upper funnel. And the lower funnel tactics, a lot of digital tactics are going to really be about item price and more promotion and opportunities with that. So -- but we feel like we've got a good formula on that. It's certainly fitting within our SG&A rate.\n\nAnd it's definitely tied to our expectations on volume trends for holiday.\n\nOperator\n\nOur final question comes from Carla Casella of J.P. Morgan.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nHi. I'm wondering, just given your updates for your free cash flow, any change in your thoughts toward capital allocation and your leverage target?\n\nAdrian Mitchell -- Chief Financial Officer\n\nWe remain committed to our leverage target. We talked about two times or below. So, that's an important thing for us. If I take a step back for a moment, Carla, just really think about where we are from a cash standpoint, coming out of the second quarter, we're actually quite comfortable with our cash position.\n\nJust to put it in context, we did not tap our ABL. Our overall liquidity doesn't compass a $3 billion asset-based credit facility that we did not tap coming out of the second quarter. You know, inventory came in earlier than we expected because we were experiencing higher fill rates and the supply chain loosening. We managed through that.\n\nWe're managing through softening sales in the back portion of the quarter. Again, we managed through that. We have no debt maturities on the horizon. And so, you know, from our perspective coming out of the second quarter, we really maintained our financial flexibility to respond to any potential changes that may be ahead of us.\n\nAnd the most important thing we want to be responsive to is the approach of holiday. That's an important quarter for us, an important period for us, but also having the capacity to respond to any kind of macroeconomic scenario that may be on the horizon. So, from a cash standpoint, we'll continue to manage our cash efficiently and effectively. From a capital allocation priority, we were continuing to invest in high-return initiatives within the business, return capital to shareholders.\n\nSo, we're being very consistent with what we've shared in prior quarters as well.\n\nOperator\n\nAnd that does concludes the question-and-answer session for today's call. I'd like to hand the call back to Mike McGuire for any additional or closing remarks.\n\nMike McGuire -- Head of Investor Relations\n\nThank you, Kevin, and thanks everyone for joining us today and for your interest in Macy's, Inc. If you have any questions, please feel free to reach out to Michelle Cassiere and myself in investor relations. Remember to keep your feet on the ground, and keep reaching for the stars. And have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMike McGuire -- Head of Investor Relations\n\nJeff Gennette -- Chairman and Chief Executive Officer\n\nAdrian Mitchell -- Chief Financial Officer\n\nOliver Chen -- Cowen and Company -- Analyst\n\nMatt Boss -- JPMorgan Chase and Company -- Analyst\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nOmar Saad -- Evercore ISI -- Analyst\n\nKimberly Greenberger -- Morgan Stanley -- Analyst\n\nSteph Wissink -- Jefferies -- Analyst\n\nGabriella Carbone -- Deutsche Bank -- Analyst\n\nTracy Kogan -- Citi -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nJay Sole -- UBS -- Analyst\n\nBob Drbul -- Guggenheim Partners -- Analyst\n\nMike Binetti -- Credit Suisse -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nMore M analysis\n\nAll earnings call transcripts"
}