{
  "companyName": "MercadoLibre",
  "companyTicker": "MELI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/mercadolibre-meli-q3-2022-earnings-call-transcript/",
  "content": "MercadoLibre (MELI -2.31%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nPedro Arnt\n\nHello, everyone. I'm pleased to have the opportunity to share some of the achievements and key messages from our third quarter of 2022 results. During Q3, we were able to deliver a strong combination of growth in commerce and fintech with continued progress toward our annual targets for profit expansion. Our operating margin expanded more than 500 basis points to 11%, contributing to quarterly profit of $296 million, while operating cash generation was solid once again.\n\nThis reflects the strong performance of our business, our ability to dilute costs as we scale and our long-term commitment to delivering sustainable and profitable growth. Our commerce business continues to show resilience amid macroeconomic challenges and as physical retail fully reopens, with GMV growing 32% on an FX-neutral basis. Our investments across the businesses over the last few years in technology have enabled us to improve our service levels significantly, and this is translating into market share gains across geographies both on a consolidated level and also across multiple product categories. Logistics investments have been the other major contributor to the improvements in service levels as our managed Mercado Envios network penetration hit 92% during the third quarter, up 5 percentage points over the last 12 months.\n\nWe are progressing our strategy to increase monetization with our ads business reaching 1.3% penetration over gross merchandise volume, a small but steady increase on previous quarters. We delivered a series of improvements in our ad tools and we have a road map of improvements that is accelerating. Mercado Pago had another exceptional with unique fintech active users surpassing 40 million mark for the first time. Off-platform TPV achieved its fourth consecutive quarter of triple-digit growth, reaching $23 billion with growth of 122%.\n\nOur MPOS businesses in Mexico and Chile made a strong contribution to this growth, as did QR in Brazil and our digital banking account solutions in Argentina. Mercado credito's portfolio reached $2.8 billion, growing at a slower rate than in past quarter as we slowed originations. This is a reflection of our prioritization of risk management and margin over growth. Our credit business delivered a resilient financial performance with annualized IMAL spreads rising quarter-on-quarter to 37%.\n\nOur early NPLs are versus the prior quarter, which is a reflection of the steps we took risks in weaker lending environment, particularly in Brazil. With significant gross profit and operating margin expansion, we closed out another quarter of strong financial results that reflect the growth of higher-margin businesses, our disciplined approach to short-term growth investments as well as our focus on leveraging our scale to deliver cost dilution on COGS, sales and marketing and G&A expense lines. This has enabled us to continue to invest in engineering headcount, which is reflected in higher product and development expenses as a percentage of sales as we had anticipated. A more detailed review of the third quarter operational and financial results is available in the shareholder letter, which is published on our IR Relations website.\n\nAnd before turning to live Q&A section of today's earnings, I'll hand it back to Richard to get through some of the latest updates to the MELI product and user experience. Thank you.\n\nRichard Cathcart -- Director, Investor Relations Officer\n\nIn our mission to democratize access to commerce and financial services, we continued to deliver improvements in the shopping experience of our marketplace. One example of this is the short videos that can be found on the homepage of our e-commerce app where consumers can discover products and learn more details and features about the products they're looking to purchase. This introduces enjoyable content, a discovery element to the search experience, helps promote user engagement and for our sellers as a new channel for marketing sales. When shopping for apparel and fashion products offered by thousands of sellers, brands and official stores, the search experience matters.\n\nWe improved the user experience of our fashion segment, and you can now browse through different product segments, lifestyles and brands. This enhances the discovery experience that is key for this category.As buyers search for something they need, they have better filters to facilitate their search. This is another example of improvements that have been enabled by our continued investment in technology this year that you can find much more on our app. And as always, we will deliver it quickly to your house so you can start using your new item as soon as possible.\n\nOn the path to improving delivery times and bringing down logistics costs, we have introduced our crowdsourcing solution for the last mile in Brazil and Mexico, leveraging on our service centers network. With this innovation, our vans will take products destined for high-density delivery neighborhoods to a service center that serves as our last-mile facility instead of delivering them from door-to-door. From there, the drivers from our crowdsourcing platforms make the deliveries to our final customers. All of this is underpinned by technology developed by the 1,500 engineers are dedicated to logistics.\n\nThese developers continue to work on logistics projects like this that make our network more effective and cost-efficient from inbound to delivery and returns. The MELI places network has grown to almost 7,000 locations with over 99% enabled for pickup and returns. On our path to democratize financial services across the LATAM region, we launched many new products over the last 18 months. This includes debit and credit cards, savings and investments, crypto wallets insurance, personal loans and many other products.\n\nWe now have a complete offering tailored to the needs of our users, allowing tens of millions of people to manage all of their financial services within our ecosystem, whether they're individuals or small, medium and large entrepreneurs. And this is not just happening in Brazil as the approval of our IFPE license in Mexico allows us to begin to market Mercado Pago and actively offer its tools to the country's large unbanked and underbanked populations. MercadoLibre will continue to deliver better products and services, focusing on the experience of our millions of users with solutions tailored to their needs. To underline that commitment, we will have hired an additional 4,000 engineers by year-end, all of whom will work to develop and extend the competitive advantages of our ecosystem.\n\nAs always, the best is yet to come.\n\nOperator\n\n[Operator instructions] Our first question comes from Andrew Ruben with Morgan Stanley. Please go ahead.\n\nAndrew Ruben -- Morgan Stanley -- Analyst\n\nHi. Thanks very much for the question. So some strong results overall. But just to focus on credit and particularly the past due rates.\n\nSo when considering the moving pieces, you mentioned origination, loan performance and the 360-day dynamics. How do you see the evolution of this metric playing out? Really, any color on the drivers when you think this past due cycle could end and what the necessary factors might be? Anything around that would be highly appreciated. Thank you.\n\nOsvaldo Gimenez -- Chief Executive Officer of Mercado Pago\n\nHi, Andrew. This is Osvaldo. So I think we -- when we see the total, we see it's fairly in line with what we expected. When we look at the segments in terms of past due dates, we see that they are basically performing as we expected them to perform.\n\nWe did see some degradation of metrics, particularly in Brazil mostly during the second quarter, and that was where we started to limit the amount of loans we offer, particularly the personal loans. And since then, the results this quarter has been in line with what we expected. Going forward, we don't provide guidance, but we believe that probably interest rates in Brazil have -- are close to -- have peaked already or close to peaking. And probably next year, should start coming down.\n\nIt's still too early to tell. Brazil elected a new President last week, so it's still very early to tell. But with that in mind, we expect that macro conditions will start to improve in Brazil, which was the country where we were more concerned about degradation of credit lines. So I think that all is working out according to what we expected.\n\nAndrew Ruben -- Morgan Stanley -- Analyst\n\nVery helpful. Thanks, Osvaldo.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Irma Sgarz with Goldman Sachs. Please go ahead.\n\nIrma Sgarz -- Goldman Sachs -- Analyst\n\nYes. Hi. Thank you for taking my question. So with ads now reaching 1.3% of GMV, I was hoping you could just shed a little bit more light on what drove this quarter-over-quarter increase as you correct -- as you pointed out, it was just a small but steady increase.\n\nSo I was wondering if you already feel that you saw an impact from the launch of the new ads tools that you've been developing or if this is just much more something for the quarters to come off even for 2023? And the second quick question is, with encouraging metrics that you've posted once again around user growth and engagement, I was wondering if you could perhaps just share your latest thoughts around shifting to a different perhaps two-tiered loyalty program going forward?\n\nPedro Arnt\n\nGreat. Thanks, Irma. So on advertising, I think most of the rollout of the new product tools have come toward the end of the quarter. And the impact of those, and this is obviously a constantly evolving and improving product, I think we should see more in the upcoming quarters than the entire third quarter.\n\nI think what we see in the third quarter is just the natural evolution of an advertising business that there's very strong demand for despite the macro backdrop given where we play along the conversion funnel. And as we continue to invest resources and roll out the tools that came out toward the end of the quarter, but also new tools that we have, we continue to think that there's a lot of upside from our advertising solutions to come in the future. In terms of loyalty, we continue to work toward launching a next version of the loyalty program. I think we've identified that where most of the value is, is in L6.\n\nWe continue to see a strong evolution of users buying L6. The overwhelming majority of Level 6 users are purchased users and not users who have earned their way toward L6. And so we would hope to be launching a new version of the loyalty program in the upcoming quarters. That really positions it increasingly better to be a subscription model with more and more benefits that we will continue to build for that highest level where a majority of users will probably purchase, but we will continue most likely to offer the ability to be earned into that as well.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Thiago Macruz from Itau. Please go ahead.\n\nThiago Macruz -- Itau BBA -- Analyst\n\nHi, guys. Thanks for taking my question. Well, my first question is regarding Mercado Pago's cost of funding. You've been consistently bringing it down, but arguably, there's still some way to go to reach levels similar to those of your competition.\n\nWhich alternatives do you feel you have to accelerate this process? Is it fair to say that your cost of funding keeps you from maybe entering any lower spread credit products today? And my second question is regarding the World Cup and Black Friday, very unique combination at the end of this year. Should we expect you to become maybe a little bit more aggressive on your 1P product in the upcoming months? Thank you.\n\nPedro Arnt\n\nSo let's see. You're correct in saying that there is still room to continue to drive down the cost of funding through renegotiation in physique structures, more use of CDBs. For the current segments where we participate and where we still think most of our focus will be, the quality of the underwriting is still by far the most significant driver of the margins in that business and less so incremental basis points or hundreds of basis points even that we can derive from cost of funding. I think if you take a longer-term view, then what you bring up is valid.\n\nAnd as we look to penetrate higher income segments or pursue lower spread credit products, then we will have to continue expanding our cost of funding windows and alternatives to look for increasingly lower cost of funding. But that's not a short-term priority right now, it's more something that it's in more of a midterm road map. In terms of fourth quarter. Historically, the fourth quarter, we do lean into it more in terms of the 1P business.\n\nYou see that in the results last year where the profitability in the fourth quarter was significantly lower than prior quarters. But I think we continue to see a combination of a 1P business that has a better margin structure than it had last year, an overall business with a better margin structure. And so although there will be a ramp-up in the pace of investment, I don't encourage investors to assume that what happened last year is what we will replicate this year. I think the margin in the fourth quarter should be better this year than it was last year.\n\nSo don't extrapolate from prior-year performance.\n\nThiago Macruz -- Itau BBA -- Analyst\n\nThat was clear, Pedro. Thank you very much.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Bob Ford with Bank of America. Thank you.\n\nOne moment for our next question.\n\nRob Ford -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good evening, Pedro, Richard, Osvaldo, congratulations on the quarter. How was the ad penetration across geographies? And how do you expect that to evolve? And in that context, how should we think about the contribution margin in Brazil and the outlook for that as well, please? And then Richard, you mentioned nearly 7,000 places in the opening remarks. Can you provide some year-on-year numbers for maybe the top three markets and describe any additional functionality besides the pickup and drop-off that you're doing now, please?\n\nPedro Arnt\n\nHey, Bob. So the margin structure for the advertising business is fairly consistent across geographies. It's a very high-margin business. I think we've set EBIT margins in the high 70s, low 80s.\n\nAttach rates or adoption do vary by geography. Mexico is the country with the highest attach rate. There is, I think, a combination there of 1P business but also simply how far we've executed and what the overall market dynamics are. But in general, I think with 1.3% of overall penetration, it's still incipient in any of the geographies that we look at, and we expect very solid growth over a multiyear period across all of the geos.\n\nRob Ford -- Bank of America Merrill Lynch -- Analyst\n\nThat make sense. And then with respect to the contribution margin from Brazil, how should we be thinking about that?\n\nPedro Arnt\n\nOn advertising?\n\nRob Ford -- Bank of America Merrill Lynch -- Analyst\n\nNo, the total contribution margin, it just seem to dip a little bit.\n\nPedro Arnt\n\nOK. It was a second question, sorry. So Brazil did have impression in contribution margin. A majority of that, you can explain really by top-line movement where our reticent to pass on incremental interest rate costs into the marketplace pricing, unlike what we did off marketplace generates a certain amount of compression in terms of take rates.\n\nAnd when you combine that with investments that have continued to grow at a constrained pace but somewhat faster than what revenue growth is where you see that compression. I think the overall idea is if we get a change in interest rate environment and just through natural scale going forward, we don't expect the Brazilian market to necessarily be one that doesn't add incremental margin, but it should also be able to scale going forward. Then on places and functions, so it's interesting. I think we've always said that places had potentially a very important role in adding nodes to our logistics network.\n\nSo for pickup, delivery and returns. Returns continued to grow in terms of percentage. But more importantly, the customer satisfaction that, that drives and ideally also better conversions. But if you look, for example, at Argentina, we began to see the other piece of the places thesis, which is the creation of a cash-in and a cash-out network that has the potential to rival ATM machines.\n\nSo these small store owners can make incremental revenue and drive incremental foot traffic by serving as cash-in and cash-out points and we're seeing strong execution on that front in Argentina, and it's something that we would look to mirror across all of the geographic footprint. Remember that we have these Kangu points in Brazil, in Mexico and in Chile as well.\n\nRob Ford -- Bank of America Merrill Lynch -- Analyst\n\nAnd right now, you're testing any other functionality around fintech or maybe apparel? Something like a little wardrobe where you try things on and return right there, and those types of things?\n\nPedro Arnt\n\nNo, not yet. I think we need to be cautious with how much extra operational demands we overlay on these corner shops and small stores. So the focus right now is on the two biggest opportunities we see short term, which are the nodes on the logistics network, drop-off, pickup, returns. And the ability to move money into and out of your digital wallets through these storefronts.\n\nRob Ford -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. Thank you very much.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Marcelo Santos of J.P. Morgan.\n\nPlease go ahead.\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nGood evening. Thanks for taking my question. I have two. The first is regarding fulfillment.\n\nThe penetration has been kind of around 40% for a while. What has been the performance there? What are your goals regarding this modality? And the second one is regarding logistic monetization. So I think a couple of quarters ago, you said you'd start to experiment some ways to try to differentiate the monetization of fulfillment. How has that been going? Maybe you can give some color geographically or in general.\n\nThank you very much.\n\nPedro Arnt\n\nHi, Marcelo. Thank you. So we continue to aspire to drive greater adoption of fulfilled by MELI in Brazil and across other markets. So we've invested in warehouses and the infrastructure that allows us to scale up and have a higher percentage of orders and purchases being made on MercadoLibre being fulfilled through us.\n\nAnd if you look at the evolution from Q3 to Q2, it was actually positive. We added about 3 percentage points of adoption of fulfillment in Brazil, added three in Chile as well. So Mexico has always been the highest penetration. It's over two-thirds of all orders fulfilled from our fulfillment centers.\n\nAnd the other markets we believe will continue to grow and trend toward a higher number. We have to see what the end state there is. But we continue to try to improve the experience for sellers in terms of sending inventory to us, removing inventory when it's not having the right kind of turn performance. And all of these things eventually should help make it easier and more attractive for merchants to continue to send more and more inventory to our fulfillment centers.\n\nSimultaneously, and this also explains the double act we're trying to carry out here, we have introduced monetization not only on low turning inventory, but simply on usage of our fulfillment centers. That obviously helps our P&L. But in a way, it generates a disincentive for merchants to send us inventory until they see that the added cost is more than offset by the improved conversion and lift in sales. That monetization is still very timid.\n\nSo we're talking something that's closer to $10 million a quarter of monetization than what its long-term potential could be. So it's still fairly slow because we're trying to carry out both the introduction of monetization, but more importantly, continuing to grow the adoption of fulfillment.\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nPerfect. Thank you very much. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Stephen Ju from credit Suisse. Please go ahead.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nOK, thank you. So hi, Pedro. I guess a follow-up question on the advertising business. So what about principal ad units that are driving the growth there? I think you talked about display as what sounds like sponsored search ad units.\n\nSo -- and also, how much more heavy lifting do you think you need to do on behalf of your sellers? Because some of them will be very sophisticated and will understand how to run ad campaigns on their own, but others may need some help. So can you talk about some of the advancements you may be driving with automation on their behalf? Thanks.\n\nPedro Arnt\n\nGreat. So still, the vast majority of the monetization is on product ads. So the insertion of sponsored listings that are interspersed within search results are identified as a sponsored listing, but they appear in the middle of a search result. We have growing capabilities and begin to see improved monetization in terms of display advertising and other more complex ways to work with larger merchants or even brands that want to promote the sales of their products either directly by themselves or from merchants that are already selling on the network, but that's still a smaller part of the revenue base and where a lot of the uptick can come from.\n\nYou're correct in saying that many of the merchants, especially the smaller merchants still have a learning curve. We see that very clearly when we look at the dollars invested per listing that we see from cross-border merchants, many of them coming from China and Asia that are much more sophisticated in terms of the use of advertising to help conversion rates. So over time, we will have to work with the local Latin American merchant base, which is by far the largest merchant base, for them to be able to gain the level of comfort and also ability to use the advertising product as we see in those cross-border merchants. And that will be a combination of better tools and greater automation, which is what we've been working on and also simply education and also patience over time.\n\nIn the case of the larger brands and larger merchants, it was more a matter of having improved reporting capabilities and improved abilities to segment and generate audiences within MercadoLibre and a lot of the more recent rollouts in the back half of this quarter were really tailored around that, reporting capabilities and the construction of audiences. So hopefully, as I answered in an earlier question, we'll begin to see the results of that over the next few quarters by seeing some of these larger brands and advertisers increasing their average spend on our platform.\n\nStephen Ju -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Marvin Fong with BTIG. Please go ahead.\n\nMarvin Fong -- BTIG -- Analyst\n\nGreat. Thank you for taking my question. A question on achieving the 40 million fintech users for the quarter. I think in terms of percentage growth and as well as absolute new users, this is the best quarter in recent memory.\n\nJust could you comment on any particular things that you think drove this higher adoption rate? Or do you think it was just general trends toward more fintech usage? And then a second question, just on contribution margins. I did note the decline in Brazil, but also Argentina increased pretty significantly even in U.S. dollars. What drove that improvement? Is it because the mix of fintech in Argentina is higher and that's a higher-margin category compared to commerce? Thank you.\n\nOsvaldo Gimenez -- Chief Executive Officer of Mercado Pago\n\nHi, Marvin. So with regards to the fintech users per quarter, I would say that this has been a year where we decreased the incentives we have been giving users to use our products, particularly we decreased mostly in the first and second quarter. In the past, we were offering more incentives and discounts for people to try our QR codes or pay utilities with or top their mobile phones using our wallet. We stopped pretty much doing all of that.\n\nAnd so I would say that it's more organic, the growth we are seeing now. And the focus has been mostly on increasing engagement, increasing principality, and having our users come and try different use cases and the larger possible amount of product flows. In terms of what are we going to do to continue doing that, it's mostly we continue rolling out new products and services. And in different countries, I would say today that the focus is at a given level in Argentina, Brazil and Mexico.\n\nAnd only now, we're starting to roll out more products to Chile. So there's room for us to continue with these rollouts and this growth.\n\nPedro Arnt\n\nSure. In Argentina, what we see is, yes, there's an increase in participation from fintech. In Argentina, the fintech business in general is also higher margin than in other markets given the scale that we've already reached there. I think one interesting data point is the digital account and the wallet in Argentina are already breakeven or actually slightly positive in terms of margin structure.\n\nThat's interesting because for us, it shows the way that ideally other markets will evolve over time as those businesses grow and gain scale. And then -- so on the back of that kind of high-level growth, some of that's burned by inflation, there is also a greater ability to dilute costs in general. So both at the gross profit level and also a direct contribution level, there is a significant amount of cost dilution given a much higher rate of growth of local currency revenues than the expenses that are mostly denominated in local currencies as well.\n\nMarvin Fong -- BTIG -- Analyst\n\nThat's terrific, color. Thanks, Osvaldo and Pedro.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Deepak Mathivanan with Wolfe Research. Please go ahead.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGreat. Thanks for taking the questions. So first, given the recent sort of changes in political climate in Brazil, do you anticipate any operational or sort of business strategy changes over the next maybe 12, 24 months in any areas that we should be aware of? And then maybe second question, Pedro, can you give us some color on the current profitability on the e-commerce segment? With advertising scaling and obviously, logistics monetization kind of coming through in many markets, how should we think about maybe at a high level, contribution from e-commerce to the total profitability over the next 12 months? Thank you so much.\n\nPedro Arnt\n\nGreat. So the answer to the first question is no. No change in strategy derived from any change in political governments. I think our business has thrived over the past 20-plus years throughout the entire region and has gone through multiple changes in Presidents and ideological lean of governing parties, and that's never changed our strategy.\n\nI think our users inform our strategy and the enormous need for digital commerce and digital payment that exists across the region. I think both on the e-commerce side and on the fintech side, the story and the way we're trying to manage the P&L continues to be, first and foremost, for growth and continued market share gains and hold our leadership position. But we believe that given the scale we have, some incremental profit engines that we found in the different commerce and fintech businesses, whether that be advertising, credit, the MPOS business, we can combine that growth with consistently delivering incremental EBIT over the upcoming periods. At least that's the aspiration in terms of a financial model.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Kaio Prato with UBS. Please go ahead.\n\nKaio Prato -- UBS -- Analyst\n\nHello, everyone. Good evening. Thanks for the opportunity for asking question. I have two on my side here regarding Mercado credito, please.\n\nSo we can see that the overall margins of your credit business actually expanded on a quarter-over-quarter basis. But if you take a look in your provision coverage, you actually reduced it if we look on 30 days or 90 days. So just wondering if you could talk a little bit more about your provision coverage going forward. If in the next quarters, we should see -- should we expect an increase in the provisions as a percentage of total portfolio in order to increase the short-term coverage ratio again or not, if this is a matter only of lower origination? And the second one is around your appetite toward the end of the year and the beginning of next year in terms of origination.\n\nIf you are already originating more during October or not? And what is the strategy going forward as well?\n\nOsvaldo Gimenez -- Chief Executive Officer of Mercado Pago\n\nHi, Kaio. We disclose more information this quarter in the shareholder letter, but there's -- it's clearly broken down how our current and 1 to 90 days past due or 90 days past due is provisioned in our portfolio. And when you look at that, you can see that basically, we are provisioning pretty much 93% of all of the loans that are over 90 days past due and over two-thirds, 68% of those that are between 1 and 90 days past due. So I think that we have been very conservative in our provisions.\n\nWe continue to be. We have remain using the same way to provision bad debt, and we have been very, very conservative. The increase you see in NPLs is related mostly to us slowing down the originations and having an average duration of about two months and keeping the bad loans in our books for a full year. But it's mostly related to that.\n\nWith regards to year-end and early next year, as you know, we provide a guidance. So far, what we have done is reduce the volume of origination. And as we see conditions improve, we will reverse that, but we're not giving guidance on when that should happen.\n\nKaio Prato -- UBS -- Analyst\n\nOK, thank you very much.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Geoffrey Elliott with Autonomous. Please go ahead.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nHello. Thanks very much for taking the question. On this topic of credit and when you can ramp up originations again. I mean the way you describe trends during the third quarter, it's kind of in line with what you expected.\n\nIt doesn't sound like things fell off a cliff. So what is it now that is stopping you from ramping back up? What would you need to see to get more profit on credit origination. Is it something in your portfolio? Is it something on the macro side? What do you need to see there?\n\nOsvaldo Gimenez -- Chief Executive Officer of Mercado Pago\n\nSo Geoffrey, what we did during the last end of the second quarter and during the third quarter, basically, we have scored users in 12 segments. And those that were lower ranking, we stopped offering them both personal loans and buy now pay later. Those that were a little bit better ranked but still not so high up, we stopped offering them personal loans. And we -- but we continue to offering them buy now pay later.\n\nThe good news that we saw is that we believe in hindsight that we took the right decision. This was a wise decision because on the one hand, those segments where we continue offering loans were profitable. And on the other hand, we kept control groups for those groups where we were not -- where we stopped offering loans and those who have not been profitable. So I think that we took a wise decision.\n\nAnd now we continue offering loans in terms of control groups. When we see conditions improving, we will be able to ramp up those segments again.\n\nPedro Arnt\n\nAnd if I can add a 30,000 foot here, I think the way we've always constructed MercadoLibre is with a long-term view we're not looking to maximize the size of the credit portfolio over the next two or three quarters. We're looking to build a very healthy and sustainable credit book and business over 10 years. And so I think we've said from the beginning that we would slow down when we thought that the quality of the underwriting merited that and make sure that we don't put the credit organization under any pressure to accelerate unless they are very comfortable that it's the right time to start accelerating originations again. So I think we will continue to manage it in that conservative fashion.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nThank you. And what's -- one of the Fujikis have made a date that would allow it to buy the loans as well as consumer and merchant loans. How soon could you start doing that, originating auto loans and funding them through the Fujiki channel?\n\nPedro Arnt\n\nNot sure I fully understood the question.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nSo there was a change in the offering memorandum of one of your Fujikis would improve in the last few weeks to allow it to hold auto loans. So the question was, are we going to see your Fujiki holding auto loans soon? How are they going to be originated? What was behind that change?\n\nPedro Arnt\n\nOK, auto loans was the question. Sorry, I apologize. We didn't pick up on that. So we are going to take our time over the next few quarters to make sure we build out the product, we build out the user experience.\n\nWe test the risk models. So don't expect any rapid ramp-up of auto loans. It is a segment that we're interested in. It's one that, over the long run, should be one of the multiple credit segments that we move into.\n\nBut we are still in the process of building out the product, building the user experience, testing product market fit and gathering data for the models. So it's not something that will be material in any way over the next few quarters.\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nThank you. Thanks very much for those answers. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Neha Agarwala from HSBC. Please go ahead.\n\nNeha Agarwala -- HSBC -- Analyst\n\nHi. Thank you for taking my questions. Congratulations on the results. On your credit book, could you give us some light -- throw some light on how the -- your underwriting models have performed across the geographies.\n\nHas one geography performed better than the other versus your expectation? And also across the different verticals, so across consumer loans and merchant loans. I noticed that the duration for the merchant loan book has gone down quarter-on-quarter. Is that on purpose or is that the kind of the one that you're seeing? And the second is on secured lending products, are you looking given the current environment where you're being cautious on the unsecured lending products, are there new secured lending products like, say, a collateralized credit card where you are looking to grow to compensate for the slow growth in the unsecured side? Thank you so much.\n\nOsvaldo Gimenez -- Chief Executive Officer of Mercado Pago\n\nI would say that -- let me start with the first part with regards to the different geographies and different products. So I think, again, we have three main geographies and mostly two or three products, merchant loans, which are split in online and in-store and then consumer loans. And each of those nine categories were profitable during the quarter. I would say that probably, we saw more pressure mostly on Brazilian consumers, and that is where we took the -- we became the most restrictive with regard to our loans, and that was compensated with higher profitability and higher margins in Argentina.\n\nBut all in, our IMAL numbers improved for the quarter. So we are happy with the results that we have seen. On top of that, sorry, merchant margins also improved, both in Brazil and Mexico.\n\nPedro Arnt\n\nOn collateralized credit cards or other secured lending, let me just separate. This is not a consequence of slowing down the unsecured lending. I think one of the beauties of MELI is we are not solely a financial institution that needs to grow the credit business in order to continue delivering growth and margin expansion. credit for us is a business that serves as a driver of more volume and sales and more wallet adoption and usage in our transactional businesses but we're not under any undue pressure to grow it because it is our core revenue stream.\n\nAnd so that allows us to pace ourselves going back to my previous answer. So I don't think we get into the more secured lending product because we're having to slow down unsecured. Those have always been attractive segments that have been within our view of what the product road map would be. Collateralized loans, credit cards is one alternative.\n\nWe mentioned auto loans. We've talked in the past about payroll loans. But those are all things that are in the future. So right now, some of those are being built like the auto loan product.\n\nOthers are just ideas. Eventually, we'll get there, but not as a consequence of what's happening in the unsecured lending businesses, which, by the way, continue to be very profitable and actually expanded margins despite the macro headwinds.\n\nNeha Agarwala -- HSBC -- Analyst\n\nPerfect. If I can just follow up on that. Have you been raising prices even in the third quarter for your loan products passing on the higher funding cost or passing on the higher risk perception that you have? Or are you largely done with the repricing initiative for the lend loans?\n\nPedro Arnt\n\nSo yes, there has been an increase in APRs as a consequence of an anticipation in certain deterioration of credit performance in the mid-risk segments. And for the lower risk segments, we actually turn those off in many aspects. But so yes, there has been a price increase in anticipation of weakening performance.\n\nNeha Agarwala -- HSBC -- Analyst\n\nAnd we should continue to expect that in the fourth quarter as well or do you think you're largely where you should be?\n\nPedro Arnt\n\nI think let's talk about the fourth quarter when we report the fourth quarter. It's still early in the quarter. Thank you.\n\nNeha Agarwala -- HSBC -- Analyst\n\nOK. OK. Thank you, Pedro. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Joao Soares with Citigroup. Please go ahead.\n\nJoao Soares -- Citi -- Analyst\n\nThanks. Thanks for taking the question. Just two quick ones on my side. The first one, Pedro, you mentioned the profitability of your ad business currently at 70 -- low -- high 70s, low 80s EBIT margin.\n\nCan we expect -- I mean, as this business changes, is this margin sustainable? How should we see this margin in the medium long run? That's my first question. The second question is a more broader question. When you take into consideration, I mean, you're basically stepping back on certain initiatives that have been dragging margins, right? And you're -- right now, as you revised the underwriting of the credit card business and reduced origination, you're also lowering at least as a percentage of net revenue, you're probably going to lower your provision. So it seems just to me, everything points out to constructive margin at least in the medium run.\n\nSo just wondering how -- what can you share in terms of messages on all those moving parts in terms of how should we see those margins going forward? I know you don't provide guidance, but just anything you can share would be very helpful. Thanks.\n\nPedro Arnt\n\nSure. So on advertising, we've said that we are going to start accelerating the rate of engineers that we allocate to the advertising businesses. We see very encouraging signs in terms of how big this could be. We see very strong product market fit and are getting very good feedback from advertisers.\n\nAnd so that probably implies that as we try to accelerate the revenue base and the penetration of GMV, those investments could compress those margins somewhat. I think we give out the high 70s to low 80s just to give a clear indication that even if you assume a ramp-up in investment to accelerate growth, this is still incredibly accretive to overall margins and an incredibly attractive business. But I think it's fair to expect that as we accelerate growth, by throwing more resources at it and most of that is actually research and development and engineers, you could see some margin compression. I think you're right, we don't guide bigger picture.\n\nWhat we've said is that we have made sure to be constantly reviewing our portfolio of revenue streams, and many of these revenue streams are newer revenue streams with negative EBIT margins. But that we have confidence that, over time, will grow into profitable businesses and to differentiate between the ones where we believe we should continue to invest aggressively and others where we are not going to give up. There are no changes in strategy or tactics, but we think that we can wait because they're strategically potentially less critical. So certain areas like supermarket, for example, there has been a strong effort to improve the margin structures there, and we're seeing good results so that we can reaccelerate as quickly as possible.\n\nThat's the largest category in terms of household spend and one that as we improve the margin structures, we can accelerate again. Others where potentially we think there's time, we can wait and not have to carry as steep losses as something that for us is a priority. So I think the takeaway I'm trying to transmit here is our strategy hasn't changed over the last few quarters. Tactically in this market, businesses that are very EBIT negative and that we don't see a strategic imperative, we're comfortable slowing down their growth.\n\nBut there still are some where we continue to invest. And then on the two other fronts, which are engineering headcount and product development salaries and wages and also the rollout of our logistics network, we've said that we've continued to invest aggressively there. We called out in the video, 4,000 engineers that we'll be adding this year. That's the same number that we had planned toward the end of last year and that remained unchanged for 2023.\n\nSo again, I think being reiterative, we continue to aspire for growth for market share gains and we think we can deliver that while also increasing our EBIT generation on an annual business. That's the financial model that we're striving to deliver.\n\nJoao Soares -- Citi -- Analyst\n\nVery clear. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from Sean Dunlop with Morningstar. Please go ahead.\n\nSean Dunlop -- Morningstar -- Analyst\n\nAwesome. Thanks for the question. It sounds like we're fairly constructive on the macro at least taking all those comments about Brazil and it was great to see ongoing market share gains. I guess I'm just wondering how we can think about buyer health in some of the key geos, Brazil, Argentina, Mexico? Any sort of color regarding the cadence of spend during the quarter? If you saw a good drop off toward the back half and the last month would be helpful among certain demographics or geographies.\n\nAnd then to the extent that we did see a downturn, would it be appropriate to look toward in 2014 to '16 or 2009 as an analog? Or are there maybe features of the business today that would render it more or less recession-resistant than these periods?\n\nPedro Arnt\n\nGreat. So let me take those in reverse order. Historically, our business has been resilient. We've never said countercyclical, but we do think that because of the breadth of selection that a marketplace can offer in tougher macro conditions, consumers have the ability to trade down while continuing to shop from us.\n\nNow, we have to see what happens. I wouldn't try to linearly extrapolate '14 to '16 because when you look at the overall percentage of retail, not even online retail, just overall retail that MELI represents today versus what it did in '14 or '16, that's changed significantly, and we need to see what happens. More importantly, the first part of your question, and again, it's still early. And really the peak period in Q4 is about to come about.\n\nSo we'll have to see what happens. But we don't see any indications of any significant weakening in consumer spend so far. Again, we'll address the full fourth quarter when we reconvene in February. But so far across most of the geos, nothing significant to report.\n\nArgentina potentially is the country where we're seeing some level of weakening. But elsewhere, nothing to call out at this point, and we'll go through the full quarter in February.\n\nSean Dunlop -- Morningstar -- Analyst\n\nAwesome. Really appreciate it.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from John Colantuoni with Jefferies. Please go ahead.\n\nUnknown speaker\n\nThis is Chris checking in for John. Thanks for taking my question. So your marketplace has been gaining share in Brazil over the past year. Can you just talk about what you think are the most impactful drivers of that outperformance? And then again, what gives you confidence kind of in the business ability to continue those share gains going forward? Thank you.\n\nPedro Arnt\n\nWe've been investing behind this business for over 20 years. I think we have an unparalleled tech team that's really, if you look at the pace of innovation on the user experience over the last two years, it's dramatically increased in quality and quantity of output. And I think our users begin to see that in the experience. We've expanded our selection.\n\nWe've gotten a lot better category management and we see that with market share gains in Brazil, if we look at our data, not only on a consolidated basis but also across most categories. And that's a reflection of more verticalized category experiences. Obviously, the overlay of our logistics network is a critical part to that, a network that today in Brazil, nearly 90% of all deliveries are done through what we call MELI logistics, so 3PLs that we control most of the routing and the experience. Pago is increasingly a differentiator on marketplace, the availability of credit, the ease of payment.\n\nSo again, I think we are now reaping the benefits of investments that we've been carrying out over the past five, six years.\n\nUnknown speaker\n\nGreat. Thanks so much.\n\nOperator\n\nI'm showing no further questions at this time. I'd now like to turn it back to Pedro, MercadoLibre's CFO, for closing remarks.\n\nPedro Arnt\n\nThanks, everyone. Thanks for the questions. We and the whole MELI team have a big fourth quarter coming up, moving into the peak season. So back to work for us.\n\nAnd like we said, we'll be able to go over the fourth quarter when we speak to you again in February. We look forward and until then. Bye-bye, everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPedro Arnt\n\nRichard Cathcart -- Director, Investor Relations Officer\n\nAndrew Ruben -- Morgan Stanley -- Analyst\n\nOsvaldo Gimenez -- Chief Executive Officer of Mercado Pago\n\nIrma Sgarz -- Goldman Sachs -- Analyst\n\nThiago Macruz -- Itau BBA -- Analyst\n\nRob Ford -- Bank of America Merrill Lynch -- Analyst\n\nMarcelo Santos -- J.P. Morgan -- Analyst\n\nStephen Ju -- Credit Suisse -- Analyst\n\nMarvin Fong -- BTIG -- Analyst\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nKaio Prato -- UBS -- Analyst\n\nGeoffrey Elliott -- Autonomous Research -- Analyst\n\nNeha Agarwala -- HSBC -- Analyst\n\nJoao Soares -- Citi -- Analyst\n\nSean Dunlop -- Morningstar -- Analyst\n\nUnknown speaker\n\nMore MELI analysis\n\nAll earnings call transcripts"
}