{
  "companyName": "Johnson Controls International",
  "companyTicker": "JCI",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/johnson-controls-international-jci-q4-2022-earning/",
  "content": "Johnson Controls International (JCI -0.71%)\nQ4 2022 Earnings Call\nNov 03, 2022, 8:30 a.m. ET\n\nOperator\n\nWelcome to the Johnson Controls' fourth quarter 2022 earnings call. [Operator instructions] This conference is being recorded. If you have any objection, you may disconnect at this time. I will now turn the call over to Michael Gates, senior director, investor relations.\n\nThank you.\n\nMichael Gates -- Senior Director, Investor Relations\n\nGood morning, and thank you for joining our conference call to discuss Johnson Controls fourth quarter fiscal 2022 results. The press release and all related tables issued earlier this morning as well as the conference call slide presentation can be found on the investor relations portion of our website at johnsoncontrols.com. Joining me on the call today are Johnson Controls' chairman and chief executive officer, George Oliver; and our chief financial officer, Olivier Leonetti. As a reminder, before we begin, during the course of today's call, we will be providing certain forward-looking information.\n\nWe ask that you review today's press release and read through the forward-looking cautionary informational statements that we've included there. In addition, we will use certain non-GAAP measures in our discussions, and we ask that you read through those sections of our press release that address the use of these items. In discussing our results during the call, references are made to adjusted earnings per share EBITA and EBIT, excluding restructuring as well as other special items. These metrics, together with organic sales, free cash flow and other measures specified in the slide presentation are non-GAAP measures and are reconciled in the schedules attached to our press release and in the appendix to the presentation posted on our website.\n\nAdditionally, all comparisons to the prior year are on a continuing ops basis. With that, I will turn the call over to George.\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nThanks, Mike, and good morning, everyone. Thank you for joining us on the call today. I will start out with a quick look back at fiscal year 2022 and update you on our progress across our strategic priorities. Olivier will provide a detailed review of our fourth quarter results and our fiscal 2023 guidance.\n\nAs always, we will leave the remainder of the call to take your questions. Let's begin with Slide 3. As we rounded out fiscal year 2022, we delivered another quarter of solid results that had us meeting or exceeding our updated outlook for the full year. Despite a challenging macroeconomic environment that saw our unprecedented inflation levels, foreign exchange headwinds and continued supply chain disruptions, we achieved robust top-line growth and maintained margin strength as we close out the fiscal year.\n\nCompared to the prior year, reported sales for the year increased approximately 7% to $25 billion and grew 9% organically, in line with the high end of our guide. The strong demand is also shown in total field orders, up approximately 10% organically year over year in our record backlog, which grew significantly, up 13% year over year. This strong demand backdrop further highlights our unique value proposition for mission-critical products and services supported by secular trends that continue to drive the industry. We've made significant progress over the year, working closely with our suppliers to mitigate the impact of supply chain disruptions.\n\nWe have also continued to execute our productivity savings plan exceeding our $230 million cost savings target throughout the fiscal year. Lastly, our disciplined approach to pricing has helped drive sequential margin improvement offsetting material foreign exchange impacts as we continue to cycle through our higher-margin backlog during the second half of the fiscal year. With our focus on fundamentals and execution, our team's work this year positions Johnson Controls to capitalize on our strong momentum heading into fiscal year 2023. Overall, 2022 was a significant year in improving our operations and increasing our competitive edge as we continue to deliver on enhancing our digital capabilities, leading the way for smart and connected building solutions.\n\nAcross the organization, we have continued to invest in key technologies and foster partnerships, allowing us to capitalize on the vectors of growth we serve. We've also continued to gain market share across our global products and services driven by commercial HVAC, industrial refrigeration and fire detection. We are in a great position to realize the benefits of our transformative service offerings through our differentiated digital platform. And as the trends for healthy and sustainable buildings continue to expand, I am confident in the strength of our capabilities, which continues to serve the needs of our customers.\n\nLastly, while the market is faced with macro uncertainties, we are seeing tailwinds within our business, favorable government incentives across the world, global heat pump demand and continued backlog strength will provide us with additional momentum heading into fiscal year 2023. Now turning to Slide 4. OpenBlue suite of connected solutions continues to play a vital role in meeting our customers' needs, laying the blueprint for the future of smart buildings. In fiscal year 2022, we have significantly expanded our suite of digital services and offerings, spanning across a breadth of devices from connected chillers, industrial refrigeration equipment to connected controls and BAS systems.\n\nTo date, we have enhanced the existing connectivity of almost 11,000 chillers through OpenBlue, representing a 106% increase year over year. This provides customers with added levels of connectivity to monitor and improve performance with actionable insights. We've also made significant progress in advancing the latest addition of our OpenBlue bridge. With this solution, we can seamlessly reduce the complexity of integrating devices and expand the range of building solutions and devices that interface with the OpenBlue stack.\n\nThis provides our customers with the added benefits of AI at the Edge and gives them the peace of mind that comes with Zero Trust cybersecurity explicitly tailored for operational equipment. Our enterprise Software-as-a-Solution offerings continue to expand, spanning from comprehensive enterprise management to specific customer use cases covering decarbonization, occupant health and safety. Along with these added capabilities, our footprint is also expanding. During the fourth quarter, we are proud to announce our recently launched OpenBlue enterprise management solution for Ali Cloud, supporting our expansion of smart building solutions into China.\n\nThe future lies with OpenBlue, and we are excited to continue disrupting the building environment as we look ahead to the upcoming year. Moving on to Slide 5. While our digital growth strategies continue to mature, we have accelerated our core service growth through our field business and the strength of our OpenBlue service offerings. In fiscal year 2022, core service orders increased during the fourth quarter, with orders and revenues up over 7% and 8% year over year.\n\nBy 2024, we anticipate additional service revenue opportunities of more than $2 billion. On to Slide 6. Turning to our growth vectors. We are successfully growing our sustainability initiatives.\n\nJohnson Controls is uniquely positioned to take full advantage of recent favorable market tailwinds, including credits for renewable offerings from the Inflation Reduction Act to an actionable shift toward heat pump usage as Europe continues to push for energy independence and low-emission alternatives. Heat pump demand continues to be a momentum driver, and we have gained market share, realizing $800 million in the quarter, representing 48% of total HVAC sales. Our partnership with Microsoft is driving results in their Beijing's West Campus, helping reduce emissions and improve uptime. In addition, our work with Colorado State University has helped transform the campus and reached net zero electricity throughout our 20-year relationship.\n\nWe help customers design, digitize and deploy solutions to achieve net zero. We are continuously expanding our OpenBlue net zero buildings offerings. Decarbonization is a priority among our customers. And as climate change poses an impending risk, we continue to build out energy-efficient and secure solutions.\n\nDuring Q4, we had our largest historical quarter of about $420 million in orders, which led to secured orders of over $1 billion for the full year, growing 12% year over year. Turning to Slide 7. The healthy buildings market opportunity remains strong as our customers invest in unlocking employee health, wellness and productivity benefits associated with well-managed indoor environments. We are positioned to capture this trend and help customers manage challenges through our OpenBlue indoor air quality as a service with some exciting wins coming in Q4.\n\nAdditionally, we're leading the way in advancing new solutions and research into the linkage between healthy buildings and decarbonization, helping our customers achieve both outcomes simultaneously. Notably, during the quarter, we delivered promising results. In fiscal year '22, orders increased 45% year over year. Our Healthy buildings pipeline represents over $1.3 billion in revenue and we expect continued order growth as more customers leverage the value of improved indoor environmental quality.\n\nNow, we turn to Slide 8. We consistently demonstrate our commitment to sustainability. During the quarter, Fortune's 2022 Change the World list recognized Johnson Controls for our service offerings of OpenBlue solutions and OpenBlue NetZero buildings. I'm also very proud that we have been named one of Forbes World's Best Employers in 2022.\n\nI am now going to turn the call over to Olivier to go through the financial details of the quarter.\n\nOlivier Leonetti -- Chief Financial Officer\n\nThanks, George, and good morning, everyone. Let me start with the summary on Slide 9. Sales in the quarter were up 10% organically at the high end of our guidance of 9% to 10% growth, with price contributing nearly nine points in line with what we originally anticipated. We saw a strong performance across our shorter-cycle global products portfolio, up 11%.\n\nAnd our longer-cycle field businesses also performed well, up 10% with solid growth in both service and install. Segment EBITA increased 9% with margins expanding 55 basis points to 16.5%, better leverage on higher volumes, favorable mix and the incremental benefits of our ongoing SG&A and COGS programs more than offset continued supply chain constraints and dilutive but improving price cost. EPS of $0.99 was at the midpoint of our guidance and increased 13% year over year, benefiting from higher profitability as well as lower share count. During the quarter, we absorbed an additional $0.03 of FX headwinds versus the prior guide.\n\nFull year free cash flow conversion was 67%. As a result of the disruptions of the supply chain over the last two years, we have built up our inventory to meet customer demand. Turning to our EPS bridge on Slide 10. Overall, operations contributed $0.16 versus the prior year, including a $0.07 benefit from our COGS and SG&A productivity program helping to exceed our targeted savings for the year.\n\nIn the quarter, FX was a $0.05 headwind. In addition, higher net financing charges and noncontrolling interest impacts were offset by a lower share count. Please turn to Slide 11. Orders for our field businesses increased 9% in aggregate.\n\nInstall orders increased low double digits in the quarter with continued demand for applied HVAC and controls systems. We are also seeing continued strength in our service business with orders up 7%, driven by double-digit growth in both EMEALA and APAC. Bill backlog remains at record levels, growing 13% to $11.1 billion, a $1.2 billion increase versus the prior year while remaining flat quarter over quarter. Lastly, our global products third-party backlog grew more than 25% to $2.3 billion and continues to show strength.\n\nLet's discuss our segment results in more details on Slides 12 and 13. Sales in North America were up 9% organically with broad-based growth across the portfolio. Our installed business grew low double digits with increased retrofit and upgrade projects and new construction growth. Overall, HVAC and controls grew low double digits and fire and security increased high single digits.\n\nOrders were up 13%, with strong growth of more than 50% in our sustainability infrastructure business as our decarbonization solutions continue to resonate with our customers. Applied HVAC orders grew nearly 20% with another solid quarter for equipment orders, up over 30%. Fire and security orders declined low single digits. Total backlog ended the quarter at $7.5 billion, up 18% year over year.\n\nSegment margins in the quarter were 14.7%, a sequential improvement of 400 basis points, driven by increased volume leverage and the execution of projects with an improved booked margin profile. A direct result of the pricing discipline implemented earlier in the year. In the quarter, North America continued to be impacted by supply chain disruptions. Overall, supply chain was a $50 million headwind contributing to a 50 basis points decrease in the quarter year over year.\n\nSales in EMEALA were up 9% organically with continued strength in fire and security business, which grew at a low double-digit rate in Q4, while industrial refrigeration, HVAC and controls grew high single digits and mid-single digits, respectively. By geography, revenue growth was broad-based, with strength in Europe, partially offset by low single-digit decline in both Latin America and the Middle East. Orders were up 3%, led by high single-digit growth in our fire and security platform. Backlog was up 7% to $2 billion.\n\nSegment EBITA margin declined 160 basis points to 9.4% as a result of unfavorable region and project mix, along with continued FX headwinds, which offset favorable volume leverage and the benefit of cost savings during the quarter. Sales in Asia Pacific increased 12%, driven by high-teens growth in our HVAC and controls platform. Service performed well in the quarter, growing low double digits in aggregate, benefiting from our shorter-term transactional business in China. Overall, China grew 16%.\n\nOrders increased 3%, driven by low double-digit growth in services. Install orders remained flat year over year, backlog of $1.6 billion declined 2% year over year. Segment EBITA margins declined 140 basis points to 14%, driven by FX headwinds, lower volumes and unfavorable mix due to higher HVAC shipments, offsetting positive price cost and the benefit of cost savings. Sales in our shorter-cycle global products business increased 11% in Q4, benefiting from strong price realization of 12%.\n\ncommercial HVAC log sales were up mid-teens in aggregate, with strength in light commercial driven by 25% growth in North America and EMEALA, respectively. Applied HVAC sales were up 9% with continued chiller demand within our data center end markets. Outside of North America, our global residential HVAC sales were up 8% in the aggregate. North America resi HVAC was up mid-single digits, benefiting from both higher growth in our equipment and parts business and strong price realization.\n\nOur HVAC business grew low double digits, led by strong double-digit growth in Europe, driven by continued demand for our Hitachi residential heat pumps. APAC resi HVAC sales grew high single digits, led by strong growth in Japan. Fire and security products grew low double digits in aggregate, led by our access control and video solutions business and strong demand in North America and EMEALA for our fire detection products. EBITA margin expanded 300 basis points to 21.9%, driven by the benefit of our productivity actions, higher volume leverage and favorable mix.\n\nTurning to our balance sheet and cash flow on Slide 14. We ended Q4 with $2 billion in available cash and net debt at 1.9 times, which is lower than our target range of two to two and a half times. As previously mentioned, free cash flow was impacted by temporarily building up inventory to meet customer demand. In Q4, capex spend declined 29%.\n\nHowever, for the year, it increased 7% as we continued to make selective investments to improve efficiency and expand capabilities. Before we get into next year's guidance, I wanted to provide some commentary on the special item recorded in the quarter. We recorded a $255 million charge to increase our environmental remediation and related reserves primarily related to our facility in Marinette, Wisconsin, where contamination exists for the use of fire fighting foam containing PFAS compounds. Over the last three years, our team has made significant progress in our investigation and remediation activities, including completing construction of a groundwater extraction and treatment system.\n\nAs a result of that work, we were able to perform a refreshed analysis based on currently available information known to us to date. This resulted in a reasonable estimate of the cost associated with the long-term remediation actions we expect to perform over an estimated period of up to 20 years. Now, let's discuss our fiscal year '23 guidance on Slide 15. Currently, we are seeing continued strength in demand adding into the first quarter of fiscal year 2023.\n\nOur backlog, which is at historical levels, continue to build along with our continued momentum across end markets. Orders remained strong, ending into Q1 with low double-digit organic growth expected as our value proposition continues to resonate with our customers. We anticipate low double-digit organic revenue growth with price contributing 10%. Segment EBITA margin is expected to expand 120 to 130 basis points and adjusted EPS is expected in the range of $0.65 to $0.67, which represents year-over-year growth of 20% to 24%.\n\nOn a full year basis, we are taking a prudent approach and providing a wide range to reflect the macroeconomic uncertainty that could potentially impact the balance of the fiscal year. Our full year adjusted EPS guidance range of $3.20 to $3.60 represent a 7% to 20% growth rate, respectively. The top quartile of our range signifies our base case scenario. This accounts for normalized GDP growth, continued growth, vector acceleration and conversion of our existing backlog.\n\nThe low end of this range, $3.20 provide a bookend reflecting a potential downside scenario. This scenario accounts for potential degradation of global GDP, which we believe will be offset by our resilient services and commercial market presence along with additional cost mitigation actions. On the top line, we anticipate high single-digit to low double-digit organic growth with price representing about 10% as our offering continues to resonate with our customers. We anticipate segment EBITA margin expansion of 80 to 120 basis points as we continue to execute our higher booked margin backlog throughout the fiscal year.\n\nFull year cash flow is expected to be between 80% and 90%. Operationally, we continue to improve our working capital management and expect further improvements from the gradual reduction of inventories as supply chain normalizes. As we close our fiscal year, we look forward to accelerating our strategic initiatives. We have aligned our business to minimize potential headwinds to enhance operational improvements, improved cost structure and productivity enhancements.\n\nWe are optimistic given the strong fundamentals across our businesses. The resiliency of our products and services continue to resonate with our customers as our order velocity and backlog remains strong. Adding into fiscal year 2023, we look to continue our growth momentum and invest in advancing our digital service offering while capitalizing on secular trends. With that, operator, please open up the lines for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Andrew Obin, Bank of America. Your line is now open.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nYes. Good morning. \n\nOlivier Leonetti -- Chief Financial Officer\n\nGood morning.\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nGood morning, Andrew.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nYes. Just a question in terms of very nice pricing outlook into next year. I was just wondering if you could give us some color as to what the backlog looks in terms of pricing and what gives you confidence that this kind of pricing will be achievable next year?\n\nOlivier Leonetti -- Chief Financial Officer\n\nSo if you look at next year, indeed, we are modeling in our guide, 10% of price and about 1% of volume growth. In Q1, the volume would be much higher, about 3% with the price being about 10%. If you look at today, our order velocity today, which includes this kind of pricing is still growing. As we said in our prepared remarks, Q1 order is actually being very healthy and actually accelerating in Q1 relative to Q4.\n\nSo we believe that the value proposition of our offering is resonating. The backlog is strong and we believe we can command this kind of pricing, Andrew.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nThank you. And the next question, we've actually got a couple of questions from investors just regarding your guide for next year. Top line, pretty good. Margin, pretty good.\n\nI think the low end of the guide just if you sort of try to look versus consensus. Just trying to see if there are any below-the-line items that are sort of impacting the EPS guide, as I said, because the top line and margin looks very much in line or better than the Street, but sort of the midpoint ends up being below. Thank you.\n\nOlivier Leonetti -- Chief Financial Officer\n\nSo what we indicated in our prepared remarks is that the wider range add two scenarios from a macro standpoint, a base scenario, which is what we believe is going to be the most likely case which will be the top quartile of the guide. That would equate to an EPS range of $3.60 to $3.50. Why do we believe it's the base scenario? A few reasons for that. One, at a macro level, the economy we are facing is still growing.\n\nDodge, if you take the U.S., 51%. ABI is still strong. PMI at about 50. So no indication today that we have a slowdown.\n\nThat's point number one. Point number two, our order velocity is still very strong. And we mentioned what those numbers were for Q1. We have various incentive programs around the world, in the U.S., Europe.\n\nWe have a strong backlog. We have a very resilient service business and a strong commercial exposure. So we believe that the base case is a top quartile guide. Now, we're also listening to what is happening out there and you have some economies, some CEO mentioning that we could have a slowdown next year.\n\nWe believe that the worst case scenario from a slowdown standpoint will translate into a GDP based upon economist estimates of 0% to 1% in terms of growth. And we wanted to give you a bookend of how we will perform in the case we would have a major slowdown of GDP. But today, that's not what we are facing, Andrew, hence, the top quartile reference.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Perfect sense. Thanks so much for the great explanation.\n\nOlivier Leonetti -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Steve Tusa. Your line is now open.\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning, guys. How are you? \n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nGood morning, Steve.\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nCan you just give a little more color on the guidance by the various segments? And then anything on the bridge that stands out, I guess, just from a residual cost savings or recovery of inefficiencies from this year? And anything that you guys can detail on the EPS bridge. Thanks.\n\nOlivier Leonetti -- Chief Financial Officer\n\nOf course. So if you look at the elements of the guide, today, we see the business for services to be strong. We expect the service business to grow in the 11%, give or take, in-store business to be low double digits and global products to be in the mid-teens. price cost would be positive.\n\nOf course, it was already, Steve, in the year. The price cost equation is still going to be dilutive though next year. as we are not fully realizing -- covering the inflation we have been facing. That will be the main points regarding the guide, Steve.\n\nOperator\n\nThank you. Our next question comes from Jeff Sprague with Vertical Research Partners. Your line is now open.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nThanks. Good morning, everyone. Just one more on the guide, and it doesn't look like you're including much, if any, capital deployment in the guide. What are your thoughts around that? And is there an active M&A pipeline?\n\nOlivier Leonetti -- Chief Financial Officer\n\nSo you're right, we are going to have a modest increase in capex that was embedded in our free cash flow guide regarding M&A. We have a very active pipeline. We are looking at tuck-in M&A. We're going to be careful about how we deploy cash, particularly in the current climate.\n\nAnd we will invest mainly in our digital and IP acquisitions for our global products, Jeff.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nGreat. And just on PFAS, always fun to talk about, right, but topical today. Just pivoting more to the MDL and the like. I just wonder if you could give us a update on what your strategy is, if this recent ruling kind of against the idea of the government contract or defense in any way kind of changes your posture or how you kind of approach trying to work through a settlement here.\n\nOlivier Leonetti -- Chief Financial Officer\n\nNo change. The reserve does not include litigation recovery. The litigation is ongoing, and we believe we have a strong defense, including our government contractor defense, Jeff. We also have, as you know, insurance coverage.\n\nAnd at this point, we believe that any financial impact on our company is not probable and/or estimable. So we have not reserved for this particular item.\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Nicole DeBlase with Deutsche Bank. Your line is now open.\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nYeah. Thanks. Good morning, guys. \n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nHi, Nicole.\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nI just want to ask a three-part question kind of clarifying a few items in the guidance. Number one, is there any supply chain constraints embedded in the outlook versus the $50 million you realized in 4Q? Number two, SG&A cost savings. You guys mentioned that you over executed in fiscal '22. Just curious how much you're getting in fiscal '23? And number three, does the guidance -- could you just confirm that it does not include any buybacks? Thank you.\n\nOlivier Leonetti -- Chief Financial Officer\n\nOn the supply chain, we expect the supply chain to normalize half through fiscal year '23. It's still improving sequentially but we believe we are now going to be back to our normal state until midyear. That's point number one. Point number two, on SG&A, and that is embedded in our guide.\n\nWe actually expect to deliver more productivity savings, and that is included in the guide we gave you, Nicole. And in terms of buyback, as we have said now for a number of quarters, we want to deploy 100% of free cash flow to dividend and buyback. We expect dividend to grow with earnings and the balance to be in buyback, that would be about $1 billion in buyback, Nicole, embedded in our guide.\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from John Walsh with Credit Suisse. Your line is now open.\n\nJohn Walsh -- Credit Suisse -- Analyst\n\nHi. Good morning.\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nHi, John.\n\nJohn Walsh -- Credit Suisse -- Analyst\n\nI wanted to ask you, I guess, this is a little bit about the recent capex increase. But obviously, you've took up your capability in U.S. residential. Just curious if you're done expanding production there and kind of how the reception has been in the market with the new product.\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nYeah, I'll take that, John. As it relates to the DOE 2023 and the cutover, we are going -- everything is going well and on plan. And when you look at more than half of our residential portfolio is meeting the DOE 2023 requirements, which have been launched and we're on target to launch the remaining pieces of the portfolio before the required conversion dates. What we've seen is customers can order -- place orders for the products that are already launched.\n\nAnd we're providing customers the opportunity to prebuy products before they're actually formally launched. Now we've been working through the existing backlog and inventory to ensure a seamless transition. We are about 100% done. Cutover is complete in the South, and we're working on the cutover in the north by year-end.\n\nCommercial products are on schedule and set to launch through the balance of the calendar year. And so overall, we're on track. And I think a lot of the investment that was required to be able to meet those requirements has been put into place, and we feel very good about the way that we're executing on that. I think as this transitions, that will provide a tailwind for us.\n\nAs you know, we've had a large backlog in residential this year. We've been converting that backlog. We've been timing this transition appropriately with the launch of the new products. And we feel, as we go forward, not only do we get higher price on the new products.\n\nBut as we now get our run rates better, improve now with the launch, we see significant pickup in our ability to be able to not only reduce the backlog, but be able to then take on new orders with our capacity expansion in residential.\n\nJohn Walsh -- Credit Suisse -- Analyst\n\nGreat. And then maybe just looking at the forward guidance, can you provide any color on how much of the current backlog will ship next year or just how we should think about the backlog conversion into next year?\n\nOlivier Leonetti -- Chief Financial Officer\n\nSo our backlog is about $13 billion. We believe that a large proportion of that should convert next year. And again, going back to the conversation we have had about the guide. That's why also our best case would be a top quartile in terms of EPS range.\n\nThe backlog will give us a nice coverage. An additional comment on the backlog. This backlog is very resilient. It's associated with very bespoke projects, which are capital tied for our customers.\n\nSo they want that to be delivered to them.\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nJohn, let me add some color on that. When you look at our global product businesses and how that played out through the year, certainly, we had a low first half and then we had a pretty significant step up here with our seasonality in Q3. And we've continued to improve our supply chain to maintain that pace as we get into the first half of 2023. And so we've seen a nice recovery in our units.\n\nAs far as our supply chain recovery, it has been across our applied in building management system products. We've had a little bit of a constraint within our residential, but as I said earlier, that is being addressed with our capacity expansion and through the conversion now to the DOE 2023. We've got all of our suppliers now on a recovery rate that supports a run rate through the first half that gets us positioned to recover a lot of the backlog in the first half as we ramp up for the seasonality in 2023 in third quarter. So we've made a lot of progress.\n\nOur supply chain teams have done a heck of a job working through this, and feel confident that we'll get back to normal lead times and normal backlogs by the end of 2023.\n\nJohn Walsh -- Credit Suisse -- Analyst\n\nGreat. Thank you. I'll pass along.\n\nOperator\n\nOur next question comes from Julian Mitchell with Barclays. Your line is now open.\n\nJulian Mitchell -- Barclays -- Analyst\n\nHi. Good morning. I just wanted to circle back to the guidance. I think you'd said that you're assuming only 1% volume growth in fiscal '23.\n\nBut I just wondered if you've got this big backlog and supply chain is easing, why wouldn't the volume growth be several points higher? And maybe tied to that, your guide embeds faster margin expansion early in the year than the balance even though price cost and supply chain get easier as the year goes on. So just trying to understand that. Is there something assumed in the volume guide for the back half or something on mix, which is kind of pulling down the margin and offsetting the supply chain and price cost tailwind?\n\nOlivier Leonetti -- Chief Financial Officer\n\nYou're right. This is a prudent assumption. If you look at Q1, where we have more visibility, volume is actually three points of the growth, which would be back to historical average. We are planning for the year, a lower level of volume based upon us being prudent.\n\nAnd that prudence is also reflected in the guide in the second half as well in the best case.\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nJulian, let me comment on that also. In the first half, we're trying to take the backlog here in the first and second quarter. Typically, we do go down seasonally. And then we're -- given the progress we've made in the third and fourth quarter, we're trying to pick up some of that backlog in the first part of the year.\n\nCertainly, we get the leverage on that. We're -- on a year-on-year compare, we get much better leverage on that. And so I think -- and then it turns, in our field-based business, we're working to get back to our normal turn rate in our projects where with this supply chain disruption over the last 18 months, we've -- anywhere from a month to two in our ability to turn projects. So we see that improving during the course of the year.\n\nSo you'll see some acceleration of that in the first half as well as our units with our recovery of our product-based businesses. And so I think that's -- some of those -- those are some of the fundamentals that are playing out in the numbers.\n\nJulian Mitchell -- Barclays -- Analyst\n\nThat's very helpful. Thank you. And then maybe a more sort of fiddly financial question. And going back to a question earlier about below-the-line items.\n\nI think one thing that maybe people underestimated was the financing charges in '23. So you're guiding those at about $300 million. Q4 was about $60 million. So is that step up more just kind of variable interest rates flowing through? Is anything assumed around the gross debt? And just wondered if there's any kind of pension impact in the P&L in 2023 year on year?\n\nOlivier Leonetti -- Chief Financial Officer\n\nYou are right about all of those. So in terms of interest, that's the by-product of the interest rate rising. We are not factoring any significant increase in the level of debt and pension income is indeed going to decline. That's the assumption.\n\nJulian Mitchell -- Barclays -- Analyst\n\nGreat. Thank you.\n\nOlivier Leonetti -- Chief Financial Officer\n\nThank you very much, Julian.\n\nOperator\n\nOur next question comes from Chris Snyder with UBS. Your line is now open.\n\nChris Snyder -- UBS -- Analyst\n\nThank you. So order momentum, clearly pretty strong through the fiscal fourth quarter. What's the outlook here on orders into '23? At what point should we expect this to moderate, just given the backlog and stabilizing, I think even potentially shortening lead times?\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nWell, I'd say -- I'll take that. I'd say the pipelines that we're currently working on, both in direct and indirect continue to be strong. We continue to convert at the rates that we've been here in the second half of this year. We're actually projecting a very strong Q1 with orders.\n\nAnd so we're watching this closely. The one area that we'll watch is in the residential space, given that we think we're at the peak of the market now and what is going to play out there. Now for us, it's because we've been constrained with our capacity. And with the supply chain disruptions, we have not been able to convert at the rate that we could if we had the capacity.\n\nAnd so now on a go-forward basis with our recovery, we'll be able to take on more orders there with the new product that we're launching. And so net-net, obviously, we're watching it closely. But I think we see -- we still see good momentum across the businesses.\n\nChris Snyder -- UBS -- Analyst\n\nThank you for that. And then for my follow-up, I wanted to ask on service. And just if there's anything you could provide around pricing on the service side just so we can kind of get a feel for what type of market share benefits we're seeing from the digital initiatives. Thank you.\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nYeah, we have been very disciplined with pricing on services and not only with the traditional more of the mechanical services. But as you know, we've been enhancing our services with OpenBlue and with connectivity and new software applications. And so that's where you start to get a higher mix of service as we add on those capabilities. Overall, we've been able to more than offset the cost as we have across now all of the segments.\n\nAnd so I think on a go-forward basis, as we get a higher mix of connectivity, higher mix of software services, we'll start to see a real accretion on service margin rate. But we've -- obviously, while we've been expanding, we've been very disciplined on the pricing that we're getting for the value proposition that we're providing to our customers.\n\nChris Snyder -- UBS -- Analyst\n\nThank you. Appreciate that.\n\nOperator\n\nOur next question comes from Scott Davis with Melius Research. Your line is now open.\n\nScott Davis -- Melius Research -- Analyst\n\nHey. Good morning, guys. \n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nHey, Scott.\n\nScott Davis -- Melius Research -- Analyst\n\nA couple of small nits here. Is the margin structure on heat pumps at scale kind of comparable to the average of the other product lines or is it a tad better?\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nYeah. So when you look -- you got to look at the mix of heat pumps, Scott. We're about -- of our HVAC portfolio, we're about 50% heat pumps and that spans pretty much all of the platforms. Now as we're creating these new value propositions around decarbonization and electrification of these units, certainly, there's a pickup in margin because there's a higher demand as we're launching these new products.\n\nAnd so that mix will continue to improve with the new products that are being launched. We've seen good strength in our industrial refrigeration business. Even our Hitachi business has a high mix of heat pumps, and we're putting those heat pumps. We're seeing good growth in Europe as well as across the globe, actually, but a big pickup in Europe.\n\nAnd so as we're making the investments and the demand signals are increasing because of decarbonization, sustainability and the value proposition that these bring where we're getting incremental margins as a result.\n\nScott Davis -- Melius Research -- Analyst\n\nOK. Helpful. And then just a follow-up on the prior question on price because you weren't explicit and perhaps that's on purpose. But if the average -- company average is 9% price or the guide is 10%, will service -- will the service and install side be close to that average you think in 2023?\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nNo. When you look at our pricing across the segments, we've been -- obviously, our book-and-build business and global products, we've been very aggressive, Scott, in making sure that we're recovering. With shorter cycles, we've recovered all of the costs through price and we're going to get back to the margins where we were previous to the ramp-up of inflation. On the field-based businesses within install and services, we have -- with the project-based business, as you know, we -- when we -- you go back two years ago when we were projecting cost, we were under costing projects because we didn't factor in the level of inflation that was experienced.\n\nNow that all was fixed a year ago. And that's been -- as you see now, the mix coming through the field project-based business, is very strong, right, with the pricing that was put in place as a result of now taking into account the -- all of the costs and even some of the disruption costs that we're experiencing. So the project-based businesses are very high, recovering the margin that previously we were short on. On the service-based business, it's lower because we maintain the value proposition, and we haven't seen the amount of inflation that comes through the mix of our services that we provide.\n\nAnd so -- but again, we're offsetting cost. And then with the value proposition that we bring with OpenBlue with the digital offerings, we then accrete margin in addition to that with those value propositions, Scott. So it's lower than the 9% of just pure price cost. But now we're going to get a higher mix because of the additive services.\n\nScott Davis -- Melius Research -- Analyst\n\nYeah, that color is super helpful. Thank you, guys. Best of luck in '23. I'll pass it on.\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nThank you, Scott.\n\nOlivier Leonetti -- Chief Financial Officer\n\nThank you, Scott.\n\nOperator\n\nThank you. Our next question comes from Joe Ritchie with Goldman Sachs. Your line is now open.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nThanks. Good morning, guys. \n\nOlivier Leonetti -- Chief Financial Officer\n\nGood morning.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nSo I'd like to start on supply chain. Once again, I think, Olivier, you mentioned that supply chain destructions were roughly $50 million this quarter. I think they were roughly $65 million last quarter. So on the margin, it got a little bit better.\n\nBut I'm just curious, are you seeing this -- Is this still a labor issue? Is this a component issue? Like where -- what have you seen get better? And where are you still seeing constraints?\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nYeah, Joe, I'll take that. We've done incredible work over the last 18 months when this all got turned upside down because of lead times and all of the critical components being extended and more than double the lead times is really what started the disruption. And as a result of that, we've done a lot of good work around how do we commonize all of our components and ultimately then get aligned with our strategic suppliers and getting the volumes that we need not only short term, but supporting the growth going forward. And we've done that pretty much across all of our commodities.\n\nAnd obviously, the one that initially impacted us was the microchips and semiconductor materials, and we're fully lined out on that now in a good recovery position as we go forward. And so we are seeing, on a run rate basis, good improvement as we're heading into Q1. And so as we've been, we've been very proactive. We've been -- I would say now, as we look at our run rates of being able to reduce our backlog, we're now getting suppliers aligned and getting firm commitments that we can meet these run rates to ultimately bring this backlog down and achieve the growth that we're positioned to achieve in 2023.\n\nOur supply chain team has done a great job. Our manufacturing sites have been keeping production going while we're continuing this recovery of materials. And we went from $65 million in the third quarter to $50 million in the fourth. We expect that to be reduced again in the first quarter.\n\nBut we do -- this is -- we've got everyone lined out to a recovery rate here for second quarter, so that as we position for third and fourth, which is our seasonal high quarters, we're going to be well positioned not only to have recovered our backlog, but now to be positioned with lead times that are very competitive in our ability to be able to take on additional volume in the second half of the year. And that's what we're positioned to do. So even though we have a little bit of headwind still with disruption, we've been pricing that disruption in our go-forward pricing. And then with the offsetting some of the headwinds is the additional COGS and SG&A work that we're doing to lean out the company and offset any additional headwinds that we might achieve.\n\nBut overall, I would tell you from where we are from six months ago to where we are today, we're in a much different spot.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nGot it, George. That's super helpful. And then I guess maybe just one other question on the margin -- or maybe not the margin, but the 2023 bridge. And so as you kind of think through it, I think we were originally expecting $260 million in costout.\n\nIt sounds like price cost from a dollar perspective should be positive. Are there any other key items to really think through as we're thinking through like that's what the incrementals should look like in 2023 versus 2022. I recognize that you guys have a low volume expectation. But are those the kind of key items or is there anything else that you would like to call out as we try to look at just like the adjusted EBITA segment?\n\nOlivier Leonetti -- Chief Financial Officer\n\nNo, you're right. If you look at the impact of the disruption on next year, we are modeling about 40 basis points, 4, 0. And if you look at the incremental before -- including the disruptions, the incrementals, I expect that next year to be at about 33% net of disruptions. Excluding them, in other words, we should be at over 40%, Joe.\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nGot it. OK, helpful. Thank you.\n\nOlivier Leonetti -- Chief Financial Officer\n\nWelcome.\n\nOperator\n\nOur next question comes from Josh Pokrzywinski with Morgan Stanley. Your line is now open.\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nHey. Good morning, guys. Just want to follow up on that supply chain. \n\nOlivier Leonetti -- Chief Financial Officer\n\nGood morning.\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nGood morning. Just on the kind of supply chain easing and backlog conversion. During the seasonally slower period, George, like you mentioned, first quarter, second quarter, how much do you think you were able to sort of pull in as a function of, hey, maybe demand normally in these quarters wouldn't be this high, but we have extra backlog and they'll take it whenever they can get it. There's some sort of buffer in first quarter, especially that we should be aware of that's maybe kind of backlog-driven or supply chain normalization driven?\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nYeah. So when we look at backlog and we look at our run rate, we're pretty well positioned here through the first quarter because of our backlog and the run rates that we're achieving across each one of these product businesses, we're actually trying to -- on these markets that are unconstrained, meaning that there's even more growth that we can go after if we can commit cycle times that are lower. We're actually doing that to fill in additional volume later in the year. And so what we're doing is, in the first quarter, you do have less days but we're targeting to try to maintain our run rates across all of our sites at the same level that we had in the fourth quarter.\n\nAnd so to your point, does that give us an ability to be able to not only achieve the -- it gives us good ability to achieve the forecast we've made. And then as we track that in Q2, we believe that, that will continue. So at this stage, we feel good about where we are and we do see continued improvement as we get through the first half of the year.\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nOK. Got it. And then on the price in revenue versus price in orders, I know that was sort of a big talking point last quarter, Olivier. Just getting that sequential price or higher uptick.\n\nWhat was that phenomenon like this quarter, i.e., are you still getting more price in the order book than that is coming out of the backlog and shipping and revenue today?\n\nOlivier Leonetti -- Chief Financial Officer\n\nIn the order book, the level of pricing has increased in Q4 relative to Q3 for our field business. The level of orders and price into it is about 1.5 points higher than it was in Q3. So we're in more than the mid-teens pricing in orders. So strong pricing based upon the strength of our value proposition, I would say, Josh.\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nGot it. That's helpful. Appreciate it. Best of luck.\n\nOlivier Leonetti -- Chief Financial Officer\n\nTake care.\n\nOperator\n\nOur next question comes from Deane Dray with RBC. Your line is now open.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nThank you. Good morning, everyone. \n\nOlivier Leonetti -- Chief Financial Officer\n\nGood morning.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nI was hoping to get some more context on the free cash flow guide for '23, the 80% to 90%. Are you assuming any drawdown on working capital as the supply chain normalizes? Or is that a potential upside to the free cash flow target?\n\nOlivier Leonetti -- Chief Financial Officer\n\nSo our guide is 80% to 90%. There are two elements into this. One, to your point, we are growing -- we are going to grow at a steady pace. That is going to be using working capital.\n\nIf you look at the number of days, we will improve all the elements of the cash conversion cycle to improve. DSO will keep improving. That has been a theme now for a number of quarters, DPO, the same. DIO will improve, but will not go back to the '21 level yet.\n\nWe believe it's going to be our item in financial fiscal year '24, Deane. \n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nOK. That's helpful. And then just any color on Europe? Look like that was fairly strong, but any change at the margin, the frontlog conversion of orders, anything that you would highlight?\n\nOlivier Leonetti -- Chief Financial Officer\n\nSo orders is still strong in Europe. Actually, in Q4, we see the order growth improving. And if you look at the margin profile of Europe, it's not where we want it to be, but we see it improving as well. It has improved sequentially in Q4 versus Q3, and we expect that to be the case still as we go forward.\n\nSofar in Europe, so good, I would say, Deane.\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Gautam Khanna with Cowen. Your line is now open.\n\nJack Ayers -- Cowen and Company -- Analyst\n\nHey, guys. Good morning. This is Jack Ayers on for Gautam today. \n\nOlivier Leonetti -- Chief Financial Officer\n\nGood morning. \n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nGood morning. \n\nJack Ayers -- Cowen and Company -- Analyst\n\nGood morning. I know the '23 guide has obviously been covered here. But kind of just wanted to ask about the long-term targets provided at the investor day last fall. Just any color there.\n\nI know we've had some headwinds with supply chain, but it seems like things are getting incrementally better. Just how do we think about the 250 to 300-basis-point margin expansion? And I guess, what has to happen there in regards to supply chain to really meet those targets?\n\nOlivier Leonetti -- Chief Financial Officer\n\nI mean, clearly, and I'm going to state the obvious here, Jack. When we put our guide, the environment was very different. Inflation, COVID, supply chain, war in Europe, FX, all those were variable, which were not part of our guide. If we are -- if we do not have a slowdown as -- and a GP of zero to one next year, which is not the expectation.\n\nIf we meet our base case, the guide for '24 is still within reach. It's going to be more difficult. But if you were to do a squeeze, the revenue you need the margin expansion you need and the EPS expansion you need to reach our target is going to be harder, but still within reach. A lot will depend, Jack, on what happened this year from a macro standpoint.\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nWhat I would say, Jack -- Jack, I'd add that when you look at the secular trends that are underway, some of these are entire recessional relative to the decarbonization and the demand that we see there with a lot of the incentives that are being provided. And so that's going to help and we see that now playing out with heat pumps and there's a lot of different parts of the business that's benefiting from that. Services. I think even during this period of time, services are going to be more attractive because of the value proposition that we're providing not only operationally to help our customers, but also aligned to being able to achieve their net zero goals.\n\nAnd so there's a lot of fundamentals when you look at the space we're in and the strategy we outlined that we're confident that we're going to get to those fundamentals. It's just a matter of what is the timing because of some of these environmental events here that's having an impact on us. But we're completely confident that we have the right product technologies, combined with now OpenBlue in the way that, that now is accelerating, our ability to be able to build services and recurring revenue and really attack what we see to be very attractive growth vectors, which is decarbonization, sustainability, healthy buildings and more around this whole -- how do we create autonomous buildings that is an incredible value proposition that we can bring to our customers. So that hasn't changed one bit.\n\nIt's just a matter of timing with some of these environmental factors that we're weighing in. \n\nJack Ayers -- Cowen and Company -- Analyst\n\nThat's great. Thanks, guys. I appreciate the color. \n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nSo with that, operator, why don't we close the Q&A. As we continue to execute, I'd say I'm very encouraged by our progress. We're in a very strong position to carry out our strategic initiatives, continue to showcase our leadership in support of our customers' mission-critical needs, and we see that every day expanding. I'd like to thank our Johnson Controls colleagues worldwide for your continued efforts, our customers for their ongoing support and all of you as we enter the next fiscal year and continuing to build a better, healthier and safer future in 2023.\n\nSo thank you all for joining, and I look forward to speaking with many of you soon. Operator, that concludes our call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMichael Gates -- Senior Director, Investor Relations\n\nGeorge Oliver -- Chairman and Chief Executive Officer\n\nOlivier Leonetti -- Chief Financial Officer\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nSteve Tusa -- JPMorgan Chase and Company -- Analyst\n\nJeff Sprague -- Vertical Research Partners -- Analyst\n\nNicole DeBlase -- Deutsche Bank -- Analyst\n\nJohn Walsh -- Credit Suisse -- Analyst\n\nJulian Mitchell -- Barclays -- Analyst\n\nChris Snyder -- UBS -- Analyst\n\nScott Davis -- Melius Research -- Analyst\n\nJoe Ritchie -- Goldman Sachs -- Analyst\n\nJosh Pokrzywinski -- Morgan Stanley -- Analyst\n\nDeane Dray -- RBC Capital Markets -- Analyst\n\nJack Ayers -- Cowen and Company -- Analyst\n\nMore JCI analysis\n\nAll earnings call transcripts"
}