{
  "companyName": "Lovesac",
  "companyTicker": "LOVE",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/07/lovesac-love-q3-2023-earnings-call-transcript/",
  "content": "Lovesac (LOVE 3.00%)\nQ3 2023 Earnings Call\nDec 07, 2022, 8:30 a.m. ET\n\nOperator\n\nGreetings, and welcome to the Lovesac third quarter fiscal 2023 earnings call. [Operator instructions] I would now like to turn the conference over to your host, Ms. Rachel Schacter with ICR. Thank you.\n\nYou may begin.\n\nRachel Schacter -- Investor Relations\n\nThank you. Good morning, everyone. With me on the call is Shawn Nelson, chief executive officer; Mary Fox, president and chief operating officer; and Donna Dellomo, chief financial officer. Before we get started, I would like to remind you that some of the information discussed will include forward-looking statements regarding future events and our future financial performance.\n\nThese include statements about our future expectations, financial projections, and our plans and prospects. Actual results may differ materially from those set forth in such statements. For a discussion of these risks and uncertainties, you should review the company's filings with the SEC, which includes today's press release. You should not rely on our forward-looking statements as predictions of future events.\n\nAll forward-looking statements that we make on this call are based on assumptions and beliefs as of today, and we undertake no obligation to update them, except as required by applicable law. Our discussion today will include non-GAAP financial measures, including EBITDA and adjusted EBITDA. These non-GAAP measures should be considered in addition to, and not as a substitute for, or in isolation from our GAAP results. A reconciliation of the most directly comparable GAAP financial measures to such non-GAAP financial measure has been provided as supplemental financial information in our press release.\n\nNow, I'd like to turn the call over to Shawn Nelson, chief executive officer of The Lovesac Company.\n\nShawn Nelson -- Chief Executive Officer\n\nThank you, Rachel. Good morning, everyone, and thank you for joining us today. I will start by reviewing the highlights of our third quarter fiscal 2023 performance and then discuss Lovesac's strong positioning within the industry. Then, Mary Fox, our President and COO, will update you on the progress we have made against strategic initiatives this quarter.\n\nAnd finally, Donna Dellomo, our CFO, will review our financial results and a few other items related to our outlook in more detail. Jack Krause, chief strategy officer, is also in the room to participate in the Q&A session. During the third quarter, the industry backdrop remained challenging. Given the significant inflationary pressures that U.S.\n\nconsumer is facing, we observed that the furniture category overall is down off late in the mid-teens percent-wise versus last year. Despite this operating environment, we again delivered strong results against tough comparisons from a record set in Q3 last year. And remember, our performance represents a real time pulse on demand. Sactionals, Sacs, and StealthTech products almost always ship out just days from order placement via FedEx or common carrier, as opposed to long unwinding backlogs that sometimes bolster other home furnishing competitors' sales.\n\nWith more than 210 physical locations, mostly in shopping malls, we are currently in the midst of our largest quarter from a sales and profitability and cash flow perspective. We are projecting to end this fiscal year with over 75 million in total liquidity, which includes cash, cash equivalents, and availability under our line of credit. We have a strong debt free balance sheet that is fit to whether any further macro disruptions that may arise into next year. Our continued outperformance and market share gains are a testament to our differentiated business model, including our value proposition and patented innovation, Designed for Life platform, foundation of sustainability, inflecting brand awareness, and consumer adoption, with an industry leading in-stock position.\n\nWe see our in-stock position and our inventory itself as a huge competitive advantage. Our inventory is not seasonal and is designed intentionally to carry little to no fashion risk. It is primarily made up of just a few key evergreen SKUs. Sactionals and all of our newest inventions on the platform are the antithesis of obsolescence.\n\nEven StealthTech, as a recent add-on, was designed to be reverse-compatible with all Sactionals' pieces ever sold over the past decade or so. Our high in-stock levels have allowed us to gain significant market share and increase customer satisfaction by delivering to the consumer rapidly before, during, and now after the pandemic as well. As we allow our inventory levels to rationalize naturally through the peak of this holiday season happening right now and on into next year, we are seeing working capital become a source of positive cash flow. As I've said before, our addressable opportunity is significant at 46.2 billion for the couch plus home audio TAM, which, combined with the fragmentation of the market, presents a very attractive and long runway for our growth and share gains as we continue to innovate, broadening our opportunity in these categories and new ones to come.\n\nNow, let me review the highlights of our third quarter performance. Total net sales were 134.8 million, up 15.5% versus the prior-year period. We delivered total comparable sales growth of 8.9% with broad-based strength from both new and existing customers. And adjusted EBITDA loss of 8.4 million was better than our expectations for the quarter, driven by the better than planned gross margin declines.\n\nWe believe that Q3 represented the toughest comparisons we have faced to date or will face for the balance of this fiscal year. We're very proud of these results, especially considering the delta they represent versus the overall furniture category, which is down in the mid-teens of late. Using that as a baseline comparison really emphasizes the resiliency of our business model and our brand, which we have been building very strategically for years now. We are generating real-time demand for our superior products even in this challenging macro backdrop.\n\nA full 38% of recent customers report not cross-shopping with their Sactionals purchase against any other competitor whatsoever. This is a sign of the growing power of our reputation and of true demand for this brand and this product over and above customers just shopping the marketplace for a sofa. Our results are also evidence of the deft and nimble execution of the entire Lovesac team who are working tirelessly to remain agile in this choppy environment. We are proud of the culture of excellence we are building together.\n\nWe continue to be very disciplined on the cost side, while still investing across the business in support of our growth initiatives. Coming off four years of nearly 50% growth rates, headcount growth has always lagged. So, with all hiring at Lovesac now, mostly frozen out of an abundance of caution, our cost model needs no drastic rationalization to what is now a sizable revenue base. Last quarter, I discussed the importance of technology supply chain and our focus on ensuring that we are building a necessary infrastructure to support our multiyear growth runway.\n\nAccordingly, we were thrilled to announce the hiring of John Legg as our chief supply chain officer. John's vast industry knowledge, leadership experience, and vision will play a fundamental role in building best-in-class supply chain operations at Lovesac. He will continue to enhance our world-class supply chain network, which supports our unparalleled customer experience, Designed for Life products, and Circle to Consumer philosophy. Mary will give you an update on the broad-based progress we are making on our growth initiatives, so I want to shift gears to what we are focused on as we close out the year and look into next year.\n\nLooking ahead, based on current performance quarter to date, we are confident in our positioning for the all-important holiday season. We are seeing notable cost release, especially on the inbound freight side. And we are starting to see some of that benefit come through in Q4, with most of the benefit expected to be realized next fiscal year. However, the much discussed inflationary pressures across key cost items continue to impact our overall cost base with labor as a notable example.\n\nWe continue to deploy levers to help offset some of these inflationary pressures, even as we remain very surgical in terms of any price actions. Those levers include adjusting promotional campaigns and managing our merchandising and mix across our channels, which the team has done really well to date as reflected in our results. They also include tight expense management and careful prioritization of spend to ensure we are investing in the most critical areas to solidify our foundation for growth. As we look beyond Q4 and into next year, while we are not ready to provide guidance, I do want to share some context for how we are approaching next year.\n\nWe expect the macro backdrop to remain challenging. In such an environment, we believe we will continue to significantly outperform our category and generate growth, but at a more modest rate versus this year overall. Even in the recessionary environment, we believe we can continue to deliver sales growth supported by our planned showroom growth and our highly differentiated products that are bolstered by years of consistent brand advertising, as well as the strides we're making across our initiatives and, of course, our innovation agenda. I don't want to divulge more on this last point just yet, but we are excited about our future and confident in our ability to compete and expand.\n\nThe past three to four years of rapid growth that we have delivered has been driven in a large part by rapid increases in dollar spend and planned and focused marketing. In fact, our marketing spend has gone from 9.2 million spent back in 2018 to 71 million total spend projected this fiscal year, or a CAGR of about 53%. It is likely the largest-focused spend in the subcategory of couches in the marketplace. The long-tail benefits of this compounding marketing spend has generated significant awareness for our brand, momentum, and demand for Sactionals and StealthTech ongoing.\n\nIt will continue to underpin our expected growth. We have demonstrated and expect to continue to improve customer satisfaction and brand affinity through improvements in process and service levels that affect the customer experience even while aggressively taking market share and outperforming the category. We are about to issue our second annual ESG report with more fulsome disclosures, and we will relentlessly pursue progress in all key ESG areas. We leverage our Designed for Life philosophy to bring more sustained, hyphenable products to market at scale, which can make a huge impact on our carbon footprint.\n\nThese are products that can actually sustain, being built to last a lifetime and designed to evolve with the user. We believe this approach to sustainability is totally unique to Lovesac and will ultimately position us as the leader in this realm. We have already repurposed more than 159 million plastic bottles to date, converting them to our Sactionals and Saks upholstery fabric, which is made from 100% recycled input. And we are now committed to our goal of diverting more than a billion plastic bottles from the waste stream.\n\nWe are making progress toward our stated goals of achieving zero waste and zero emissions by 2040. We believe we can become a significantly larger multi-billion dollar company over the longer term, and we see a real incredible path to getting there. In order to realize these ambitions, we will continue to invest in innovation and R&D while scaling our infrastructure cautiously even in this challenged macro environment. Our core business generates strong profitability, which is not fully appearing in our P&L as we are in this investment mode right now.\n\nWe have a strong debt-free balance sheet and a model that we are confident can deliver continued relative outperformance even with a recessionary backdrop. We will stay disciplined on the cost front, controlling what we can control without jeopardizing our ability to capitalize on the growth opportunity we have. Our focus is on generating long-term shareholder value and positioning this business to realize and maximize this open-ended growth opportunity, even as we responsibly manage the business with great discipline. Finally, I want to thank the entire Lovesac team for their tireless execution of our strategy and delivery of our goals.\n\nOur disruptive model enables us to continue to grow, thrive, and innovate and invest in this business at a time when many other companies are scrambling for cash and even experiencing degrowth. I could not be prouder of this amazing team we have built, and with our continued success comes exciting growth opportunities for all who are a part of this #LovesacFamily. With that said, I will hand it over to Mary to cover our strategic priorities and progress. Mary?\n\nMary Fox -- President and Chief Operating Officer\n\nThank you, Shawn, and good morning, everyone. Our Quarter 3 results marked a record third quarter for our company and our demand growth of 22% outpaced our revenue growth, which is in sharp contrast to the category decline that Shawn shared. Our performance was significantly stronger than any of our key competitors' results, which were primarily driven by back order delayed shipments from previous quarters. We are extremely proud of the outstanding performance.\n\nAnd using fiscal 2020 as our baseline, our three-year comp growth stack is 146%. This demonstrates the significant market share gains we have experienced over the last three years and more. And we estimate that no other brands with a significant market share in the category has kept pace with our growth. Through that same time period, our position in the market has grown from a challenger to being a market share leader in the categories we compete in.\n\nThe ability to be the market share leader across our categories is testament to our focus on inventing and designing a product platform with products that will best deliver value for our consumer and creating an experience and ecosystem around that platform. Our evergreen inventory position and operational focus has driven our customer satisfaction scores to record levels as our brand experience continues to delight our customers, which, in turn, accelerates our flywheel of demand with word-of-mouth being our No. 1 awareness driver. We are uniquely positioned to continue to profitably take share even through the current market dynamics.\n\nI will now provide key highlights on our strategic initiatives. Starting with one, products and innovation. We continue to be pleased with the progress with StealthTech, which was a game changer for us and the category from an innovation standpoint. The brand continues to gain share as we believe that brands have the ability to generate hundreds of millions annually for Lovesac and be a market leader.\n\nAnd here are some key highlights. We continue to see attachment rates increase as the year progresses as adoption continues to grow on a sequential basis. Year to date, Sactionals that were sold with StealthTech have an average order value close to $9,000, or nearly three times the average Sactional average order value. The initial success of the launch and the sequential progress we are seeing provides us reassurance that the launch support and product continue to build relevance and appeal, along with a strong lever to grow our customer lifetime value.\n\nAlso, during this quarter, we continue to innovate with unique product collaborations that our customers love, including Disney's very successful recent release of the \"Hocus Pocus 2\" movie and our partnership with Alice and Olivia launched through New York Fashion Week in September, which delivered a billion impressions during the event coverage. Number two, omnichannel experience. In Quarter 3, as part of our continuous improvement of the customer omnichannel journey, we relaunched our website configurating experience. The new configurator was designed through a combination of listening to our customers and building the most intuitive path to purchase, infusing more technology by introducing augmented reality.\n\nWe also improved the omnichannel experience by incorporating some of the best practices from our touch points. Launch to date, we've seen some very compelling results and some highlights are: stronger attachment rates of up to 400 basis points from higher-margin products, such as StealthTech and storage fees; and our digital satisfaction scores have increased by 350 basis points versus year to date pre-launch, and our conversion has increased over 6% with the new configurator. As the year has progressed, we have accelerated our planned opening pace with touch points as we continue to see a high return on capital with a payback period of around one year. We believe we can penetrate significantly more markets than our competitors, driven by our category-leading productivity.\n\nOur touch point network will drive a long-term strategic advantage as consumers continue to show their preference to physically experience our product as part of their path to purchase. We are continuing to drive improvements on touch point economics as we can build on our brand strength to drive traffic. Traffic in Q3 grew 34% to last year, which significantly outpaced U.S. traffic trend as reported by Sensormatic.\n\nThis strength, coupled with our real estate strategy, has allowed us to deliver lower occupancy costs, which bodes well for the already-strong four-wall contribution of our touch points. As we continue to focus on delivering a best-in-class omnichannel experience, in Quarter 3, we launched a new cloud-based POS system pilot in partnership with PredictSpring. PredictSpring is a world-class POS center that aligns with our objective of leveraging technology to increase transaction efficiency, reduce manual reconciliation, and set the foundation for our continued growth. And learnings will be applied to an extended pilot in early fiscal 2024.\n\nIn Q3, we leaned into returning to Costco with our physical roadshows and saw some really terrific success. In Quarter 3, we operated over 60 physical roadshows that have productivity in line with the pre-COVID levels. And we have seen the productivity increase as our teams get used to selling in a Costco environment. Lastly, customer satisfaction performance.\n\nWe continue to experience tremendous improvements on our CSAT as our focus on digital and post-purchase as our priority drivers is really gaining traction. These gains are critical as we know that our No. 1 source of our purchaser awareness comes from word-of-mouth. And as we create a more satisfied customer base, we expect to be able to continue to leverage word-of-mouth.\n\nOur third initiative, ecosystem, the vision for this is rooted in Circle to Consumer, C2C, and the development of an ecosystem for our customers and products, driving optimal value for our customers and for their designs for life product platforms they've invested in. We know this to be true for our biggest brand fans, and we have continued to see encouraging signs that our customers are already leaning into generating more value for themselves by evolving their brand platforms to better suit their lives as they change. This dynamic is unique to us in our category and illustrated by our recent customer metrics with over four out of 10 transactions in Quarter 3 from repeat customers. Complementary to our strong word-of-mouth, our marketing mix continues to drive best-in-class category growth performance, and our brand health metrics continue to strengthen.\n\nIn Quarter 3, we continue to see our overall marketing performance trending within our projections, and we are still seeing outside demand growth to our marketing spend. Our customer lifetime value and acquisition cost ratio remained strong. And our ability to be nimble by closely monitoring programs and shifting spend has allowed us to be efficient and conversion-focused. For example, SMS marketing has been performing extremely well as the last click conversion tactic.\n\nAnd we lead the industry in our KPIs for open and conversion rates. This tactic is very strong during key events with last click sales improvements of over 200% to last year. Leveraging the strength of our business model as we are agnostic to where a sale takes place, our digital spend is focused on driving omnichannel sales. And we are very successful in converting throughout the funnel and allowing us to drive sales wherever the customer goes.\n\nAnd then, our final initiative, making disciplined infrastructure investments, as I shared, in Quarter 3, our customer satisfaction was at the highest level we have measured. And one key contributor of this is our ability to deliver completed orders quickly to our customers, which is enabled by the investments we're making in our infrastructure. In Quarter 2, I had shared our infrastructure plans, and we successfully opened our fifth DC in the Dallas Fort Worth area at the end of the quarter, ahead of schedule and will be fully at scale by the end of the fourth quarter. This additional DC investment enables us to continue to deliver our growth, as well as benefit from last-mile savings as we operate closer to our customers in the south.\n\nOur supply chain is advantaged by our focused number of SKUs that are not also exposed to being obsolete due to seasonality. This means we can carry inventory in confidence that we will sell through it and can absorb changes in demand. We have industry-leading delivery times to our customers in their days. And in Quarter 3, we're at record in stock levels of 98%.\n\nWe have been strengthening our supply chain capabilities to deliver strong unit economics, driven by our productivity loop of focused assortment growth and scale efficiencies, as well as optimizing inventory through the planned OMS implementation. I'm thrilled that John Legg, our new chief supply chain officer, will be leading this work, and we expect to see these benefits starting in fiscal 2024 and beyond. As Donna will share, we have also started to see significant inbound freight reductions over the last quarter that will mainly flow through to our P&L in fiscal '24. So, in summary, we are very proud of our financial and operational performance during Quarter 3.\n\nAs we look to closing out the year, we will continue to focus on our products, omnichannel experience, and ecosystem to deliver the best experience and product value for our consumers. By the end of this year, we plan to have doubled our business in just two years. And I want to thank our teams for all their great work to deliver these results. We will continue to invest to drive our growth, as well as leverage our scale for efficiencies and savings.\n\nWe are proud of our outperformance for the category, which is being driven by our compelling value proposition that our Designed for Life business model offers. We will continue to play offence, staying agile, controlling what we can, and delivering a great customer experience. I'll now pass the call over to Donna to review our Quarter 3 results and a few details relating to our fiscal 2023 outlook. Donna?\n\nDonna Dellomo -- Chief Financial Officer\n\nThank you, Mary, and good morning, everyone. I will begin my remarks with a review of our third quarter results and then provide guidance for the remainder of fiscal 2023. We are pleased with our third quarter results. Net sales increased 18.1 million, or 15.5%, to 134.8 million in the third quarter of fiscal 2023 with the year-over-year increase driven by growth in the retail and other channels.\n\nShowroom net sales increased 13.3 million, or 19%, to $83 million in the third quarter of fiscal 2023. This increase was due in large part to a comparable net sales increase of 10.4 million, or 18.5%, to 66.4 million in the third quarter of fiscal 2023, compared to 56.1 million in the prior-year period related to higher point of sales transactions, driven by strong promotional campaigns and the addition of 41 new showrooms and 13 new kiosks. As a reminder, point of sale transactions represents orders placed through our showrooms, which does not always reflect a point at which control transfers to the customer and when net sales are recorded. Other net sales, which include pop-up shop, shop-in-shop, and barter inventory transactions increased 7.1 million, or 61.8%, to 18.5 million in the third quarter of fiscal 2023 as compared to 11.4 million in the prior-year period.\n\nThe increase was driven largely by continued planned open-box returned inventory transactions with ICON, our inventory barter partner; the reintroduction of Costco physical top of shops that were put on hold during fiscal 2021 because of COVID shutdowns; and the addition of 17 new Best Buy shop-in-shops. We now operate 22 Best Buy shop-in-shops locations. As a reminder, our inventory transactions with ICON are part of our CTC, DFL, and ESG initiatives. We repurpose returned open-box inventory in exchange for media credits, which are being used to support our advertising initiatives to create brand awareness and drive net sales growth.\n\nInternet net sales, sales made directly to customers through our e-commerce channel, decreased 2.2 million, or 6.3%, to 33.3 million in the third quarter of fiscal 2023 as compared to 35.5 million in the prior-year period as we continue to see some shifts back to in-person shopping. Internet net sales have increased 11% over the prior-year nine-month period. By product category, our Sactionals net sales increased 18.9% and our other category net sales, which includes decorative pillows, blankets, and other accessories increased 36.5% over the prior year period. Due to shifts in our Sacs promotional activity, Sacs net sales decreased 11.6% in the third quarter but had increased 4% over the prior-year nine-month period.\n\nThe decrease in gross margin rate of 300 basis points over the prior-year period was driven by an increase of approximately 160 basis points in total freight costs, which includes inbound and outbound freight, tariff expenses, and warehousing costs; and 140 basis-point decrease in product margin driven by higher planned promotional activity. Our gross margin rate exceeded our guidance, driven primarily by lower inbound freight costs and realization of the lower freight rate benefits through the P&L earlier than we have projected, partially offset by a slightly lower product margin rate. We do anticipate inbound freight rates to stabilize at this level for the remainder of fiscal 2023, but because of the amount of inventory we maintain on hand to support customer satisfaction of the brand, we will not see the full benefit to the P&L of the drop in these rates as compared to prior year until the associated inventory is sold during late Q4 and continuing through the first half of fiscal 2024. The 40.8% year-over-year increase in SG&A was largely driven by an increase in employment costs due to new hires and variable compensation, an increase in rent expense related to the addition of 54 new touch points, and higher percent rent related to the touchpoint net sales increase.\n\nOverhead expenses increased due to infrastructure investments, such as technology and professional fees and selling-related expenses, principally due to credit card fees related to the net sales increase. SG&A expense as a percent of net sales increased by 720 basis points, which was primarily due to planned deleverage unemployment costs, infrastructure investments, rent, selling-related expenses, travel and insurance, partially offset by higher leverage in equity-based compensation. The deleverage in certain expenses relate to the continuous investments we are making into the business to support our ongoing growth. Advertising and marketing expenses increased 3.2 million or 20.3% to 19.1 million for the third quarter of fiscal 2023 as compared to 15.8 million in the prior-year period.\n\nAdvertising and marketing expenses were 14.1% of net sales in the third quarter of fiscal 2023 as compared to 13.6% of net sales in the prior-year period. The increase in advertising and marketing as a percentage of net sales is primarily due to an increase in media spending to support our third quarter and projected fourth quarter net sales growth. As a reminder, advertising and marketing investments benefit multiple fiscal periods. Depreciation and amortization increased $700,000 from the prior year to 2.5 million, principally related to capital investments for new and remodeled showrooms.\n\nThe operating loss for the quarter was 11.6 million compared to operating income of $3 million in the third quarter of last year, driven by the factors just discussed. Net interest expense of $68,000 for the third quarter was slightly higher than the prior year period related to unused line of credit fees that increased due to the increase in our revolving line of credit earlier this year. Before we turn our attention to net loss, net loss per diluted share, and adjusted EBITDA, please refer to the terminology and reconciliation between each of our adjusted metrics in their most directly comparable GAAP measurements in our earnings release issued earlier today. Net loss for the quarter was 8.4 million, or $0.55 per diluted share, compared to net income of 2.8 million, or $0.17 per diluted share, in the prior-year period.\n\nDuring the third quarter of fiscal 2023, the company recorded a $3.2 million income tax benefit related to the operating loss for the quarter, as compared to a $200,000 income tax provision for the third quarter of fiscal 2022. The effective tax rate increased to 27.8% in the third quarter of fiscal 2023 from the 5.9% in the prior-year period. This is due to fiscal 2022 having the benefit of the release of the valuation allowances on the company's net deferred tax assets. The valuation allowance was fully released as of the end of fiscal 2022.\n\nWe had an adjusted EBITDA loss of 8.3 million in the third quarter of fiscal 2023, as compared to an adjusted EBITDA income of 5.8 million in the prior-year period. Adjusted EBITDA for the third quarter was ahead of our expectations, driven by the better than planned gross margin declines discussed earlier. Turning to our balance sheet. Our inventory levels are in line with our projections.\n\nInventory increased 63% year over year, and we feel very good about both the quality and the quantity of our inventory. Our evergreen in-stock inventory is a competitive advantage. And as it is not comprised of seasonal merchandise, we do not run the risk of being overstocked or having to be promotional to reduce inventory levels. Our inventory levels are in line with our goals to maintain industry-leading in-stock positions and delivery times.\n\nAs we move into fiscal 2024, we see the opportunity for inventory levels to moderate as we see inbound freight relief. And our recent technology investments enable us to programmatically allocate inventory more efficiently. We ended the third quarter with 3.8 million in cash and cash equivalents and $36 million in availability on our revolving line of credit with no borrowings. This reflects the timing of our inventory investments and the seasonality of our net sales, profitability, and cash generation.\n\nThe fourth quarter of our fiscal year will be and has always been the quarter that generates the most significant cash flow from operations for the fiscal year. And as a result, we currently have and we expect to end the fiscal year with total cash, cash equivalents, and availability under our line of credit in excess of $75 million. Please refer to our earnings press release for other details on the third quarter fiscal year 2023 financial performance. Regarding our outlook, we continue to operate in a dynamic environment with wider range of potential outcomes as it relates to the fourth quarter.\n\nAs a result, our outlook assumes net sales growth over the prior year will range from high single digits to the mid-teens range. While we are tracking to the high end of this range quarter to date, we still have huge volume holiday weeks ahead of us and believe it is prudent to factor in some variability in our guidance. We expect to continue to see the benefit of lower inbound freight costs flowing through the P&L with the greatest benefit of these lower costs being most impactful to gross margin in fiscal 2024. In the fourth quarter, gross margin is expected to be up modestly approximately 115 basis points from the prior-year period, due to lower inbound freight expense that is expected to more than offset higher promotional discounting, warehousing costs, and outbound last-mile fuel surcharges.\n\nWe expect adjusted EBITDA margin rate increase approximately 325 basis points year over year in the fourth quarter of fiscal 2023. The increase in Q4 over the previous year is due to the gross margin rate increase and expected leverage of total operating expenses with the seasonality higher net sales volumes. So, in conclusion, we are quite pleased with our third quarter fiscal 2023 results. Despite the challenging macro environment, our team continues to execute against our growth strategies and operate the business with discipline.\n\nWe are confident in our positioning for the all-important fourth quarter of the year, which drives the most significant amount of net sales, profits, and operating cash flow. We will continue to capitalize on the attractive opportunities we see for long-term growth and market share gains. With that, we would now like to turn the call back to the operator who can open it up for questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Maria Ripps with Canaccord Genuity. Please proceed with your question.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGood morning, and thanks for taking my questions. So, you talked about the category being down, and it seems like the Q4 guide is a little bit softer versus your prior outlook. Is there anything you can maybe share about sort of consumer sentiment today? Are you seeing any customers sort of deferring a purchase decision? And then, maybe more broadly, how are you thinking about the impact of higher interest rates and sort of a tight housing market on demand? And then, I have a quick follow-up.\n\nMary Fox -- President and Chief Operating Officer\n\nGood morning, Maria. Thank you for your question. So, I think, obviously, as we see for -- you know, as you talked about the category down, that started earlier this year. We've continued to outperform the category naturally.\n\nBased on our latest numbers, we're seeing a wider gap to our performance. And as you can see, you know, as you look at sales Donna shared, you know, we're tracking at the higher end of our guidance and have obviously factored in some variability. In terms of, you know, what we're seeing for, you know, consumer shifts or some changes, I think, as everybody has reported, we're seeing more promotions in the category. So, we've responded to that, which is all planned in.\n\nBut they are much more benign to the pre-pandemic levels. Demand is a bit choppier. So, for us, as an example, Black Friday was super strong. And then, Saturday and Sunday is OK, and then Cyber Monday was really strong.\n\nAs we see the -- you know, shoppers are holding out thinking that there'll be stronger promotions from that side. So, you know, the shape and the timing of fourth quarter, you know, we've planned for, we feel very good based on where we're tracking at the high end of our guidance. We have record pipelines. We're just looking at the teams.\n\nEven this morning, it's so strong. And with the strong promotional cadence, you know, the marketing investments that Shawn talked about, we feel very good to deliver, as Donna shared, with our guidance. I think in terms of any other shift within consumers, which is the second part of your question, in general, we're seeing, obviously, a little bit of a mix shift, but that truly is up against the channel mix shift as a bit of movement back to touch points versus last year. But as you know, last year was really driven in Quarter 3 by some broader post-COVID dynamics.\n\nWithin the consumer purchasing, the mid to large purchase sizes, and obviously, also StealthTech, we see that being very strong. A little bit of shift to financing, but really nothing around sensitivity to discount. On the lower end, we are seeing some trends with smaller purchases that they are having a high conversion when on promotion. So, very similar, Maria, to obviously what everyone else is seeing, but no other shifts, you know, we see.\n\nBut obviously, the good news is our core consumer is very affluent, and we have a great plan that we will continue to foster through for Quarter 4.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGot it. That's very helpful. And then, Mary, you touched on this a little bit, but maybe can you expand a little bit on the extent of your promotional efforts this holiday season relative to competitors and maybe the broader retail environment, or even prior holiday periods?\n\nMary Fox -- President and Chief Operating Officer\n\nYeah. I mean, I think for us, as we look at the promotions that we've planned, we have a little bit more frequency and a little bit more depth through the Black Friday and the Cyber Monday, but less deep than we're seeing with other competitors because, frankly, our brand strength is so good. And as we think about, you know, just the growth that we've had and the brand stickiness, we don't need to extend that. And I think, as Shawn talked about, I think 38% of our most recent customers, they don't even cross-shop with anybody.\n\nThey just want to come to us, and they come and build out, obviously, their quotes with us. And then, as we think about our marketing investments that Shawn shared, you know, we've got great alignment around the key big weeks through the rest of this year, very efficient and effective. And I think I shared a couple of with you around SMS, as an example, but just others. And the team are very agile and they keep on adjusting.\n\nSo, we actually feel very good about what is planned through the rest of the quarter.\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nGreat. Thanks a lot, and good luck with the holiday season.\n\nMary Fox -- President and Chief Operating Officer\n\nYeah. Thank you, Maria.\n\nOperator\n\nThank you. Our next question comes from the line of Thomas Forte with D.A. Davidson. Please proceed with your question.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. So, first off, congrats on the quarter. Second, for my first question, Shawn, you've been very thoughtful and very experienced when it comes to supply chain. And I'm very interested right now in the role of China, not just for Lovesac, but for the industry, and I'd love to hear your thoughts on what you're thinking about for the next five years on how China will play a role in your supply chain, how rest of world will play a role, and how much progress do you intend to make on shortening the distance between where your product is made and where your product is consumed.\n\nShawn Nelson -- Chief Executive Officer\n\nYes, Tom, thanks for the question. We, as you know, have been very vigilant in trying to diversify our supply chain. It's been a strength of the company. It continues to underpin our success in different ways and manifest itself in different ways as the world evolves.\n\nAt this moment, China's -- you know, so, let's rewind three years ago, maybe China was nearly 100% of our -- represented 100% of our overseas production and probably 90% of our overall production. And today, you know, that's down somewhere below 30%. And we have redundancy for almost all the products that we make there. So, we make like-for-like Sactionals in Vietnam, in Indonesia, sorry, in -- yeah, and Malaysia.\n\nAnd our point of view is that the world and the global supply chains continue to become more fructuous, and we want to have more diversity. So, we're pursuing, again, redundant supply chain manufacturing opportunities in North America, in Mexico actively. And, you know, we're focused on the longer term of being more vertical, even if not owned, and more sustainable. You know, manufacturing stuff, using more sustainable inputs closer to the consumer, delivering over shorter distances, lower carbon footprint, with, of course, the caveat that we believe that point of view can be done less expensively, you know, and bring our gross margins up over time.\n\nI mean, that -- we not only believe that, but we have reason to believe that that will be the outcome. So, we view all of these as just a step to that end, all these moves that we're making as a step in that direction. And, you know, we think that as much as China has been a great supply chain for -- in many realms, we're all watching the same news. We all believe that there can be risk there.\n\nAnd we've seen of late, through COVID, what happens when there are shocks to the supply chain. And so, our focus is on bolstering, you know, creating a strong business with diversity in the supply chain, redundant manufacturing. And I think we've done a good job of that so far, and we hope to be ahead of that curve as that curve continues to present itself in real time. Ultimately, the most difficult piece in this category will be fabric.\n\nAs you may be familiar with, you know, China's supply chain in mills is extremely strong. And thankfully, we've made great headway in Mexico and North America in discovering new sources for fabrics that can give us the redundancy needed to be prepared for anything. And also, of course, to continue to focus on our, first, product costs, bringing costs down, driving gross margins up, even as we finally begin to recover from all of the supply chain headwinds in the form of the inbound freight, etc., that have weighed on those realms of our business and many others. So, you know, I appreciate t`he question and the opportunity to discuss.\n\nThis is something that, again, we're proud to be focused on and hopefully ahead of the curve on.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nExcellent. And then for my follow-up question, you talked about the opportunity for gross margin improvement next fiscal year on better freight. So, at a high level, how should we think about your planned use of the higher gross profits to the extent that you may engage in more promotional activity or more marketing, or to the extent you let more flow through to the bottom line? Just -- can you talk about it at a high level?\n\nShawn Nelson -- Chief Executive Officer\n\nYes.\n\nDonna Dellomo -- Chief Financial Officer\n\nGood morning. So, yeah, we are planning to see some gross margin expansion out of lower freight rates next year. There's a couple of things that we're looking at, although we're not going to guide to next year where we -- there is -- a part of it is going to be used to mitigate some of the higher outbound freight costs that everybody is experiencing through the FedEx and the UPS of the world. Higher -- we are projecting to see some higher warehousing costs that are relative to the increase in labor cost at our 3PL.\n\nSo, a piece of that will be used to mitigate that. And we will be investing a portion back into the business next year as we continue to say that we still have some foundational infrastructure investments we need. And we do anticipate a portion of that gross margin expansion to flow through to the bottom line, but we're going to navigate that. You know us.\n\nWe're extremely agile, and we're going to navigate that and allow as much as we think we can flow to the bottom line next year as we navigate through the year. So, we have -- there is use of that gross margin expansion, but we will continue to operate the way that we always are and very fiscally responsible and agile. And we believe we have a lot of opportunity next year.\n\nTom Forte -- D.A. Davidson -- Analyst\n\nGreat. Thanks for taking my questions.\n\nOperator\n\nThank you. Our next question comes from the line of Brian Nagel with Oppenheimer. Please proceed with your question.\n\nAndrew Chasanoff -- Oppenheimer and Company -- Analyst\n\nThis is Andrew Chasanoff on for Brian Nagel. I just want to start off by congratulating you guys on another great quarter. My first question is in regards to just the sales in the period. On the Q2 call, you discussed the potential pull-forward for about 9.5 million in sales.\n\nCan you discuss any other drivers to the Q3 sales slowdown? And then, my follow-up question will just be a follow-up to the first question on the outlook for the balance of the year. Can you discuss some of the drivers, the expected slowdowns, and any dynamics that may have changed since you laid out prior guidance for low 20% growth for Q4? Thank you.\n\nMary Fox -- President and Chief Operating Officer\n\nHey. Good morning, Andrew. It's Mary. Thank you for your question.\n\nI'll take the first part. So, in terms of sales, as you referenced, we have discussed last quarter, there was that 9.5 million of revenue that was pulled forward, some was increased throughput and some was the open-box inventory that we talked about. And then, obviously, as I said in my remarks, for Quarter 3, while our revenue was up 15.5%, if you factored in for that pull-forward, our revenue really is at 24%, and slightly ahead of, obviously, the strength that we saw in our total demand for the quarter at 22%, which we see as being the strongest growth in revenue compared to anyone else that has recently reported from that side. So, you know, you see that continuation in performance growth.\n\nAnd then, obviously, one of the key benefits for us is our omnichannel model. So, we really are able to respond to where our customers want to go for sales. So, whether it be more in person or whether it be online, you know, we're agnostic to where the sales, you know, will be from that side. And then, I think, Donna, do you want to talk through on Quarter 4 in terms of the guidance and a bit of that profile?\n\nDonna Dellomo -- Chief Financial Officer\n\nYeah. Sure. So, the guidance that we're providing for Q4, as far as being high single digits, mid-teens range, is that growth is coming out of the comp showroom sales, noncomp showroom sales. We're adding Costco pop-up shops, which we didn't have this time last year.\n\nWe're adding the Costco roadshow perform at the -- that comp show performance is coming through stronger than we've seen in prior periods. And we do have the addition of the additional Best Buy shop-in-shops that we did not have this year. As far as the decrease in the guidance that we provided for the year on our second quarter earnings call, you know, we are experienced but at a lot lesser impact, where you see other retailers are. So, again, what Mary said, what Shawn had said, we are very, very happy with the performance of our net sales volume, our associates and, you know, still coming through.\n\nEven if you use the midrange of the high single digits to mid-teens, you know, that indicates approximately a 26% year-over-year growth rate, which is very, very strong for our category this year.\n\nAndrew Chasanoff -- Oppenheimer and Company -- Analyst\n\nThank you so much.\n\nOperator\n\nThank you. Our next question comes from the line of Matt Koranda with ROTH Capital Partners. Please proceed with your question.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nHi guys. Good morning. Just really quickly on the fourth quarter trends that you mentioned, I think you said, you're tracking toward the higher end of the fourth quarter guidance on the top line. So, just wanted to confirm that that's what we've seen specifically quarter to date in terms of year-over-year growth? And then, just any spikes or trends within the Black Friday, Cyber Monday period to call out?\n\nMary Fox -- President and Chief Operating Officer\n\nHey. Good morning, Matt. Thank you for the question. So, yes, as we shared, we are tracking at the high end of the range and have seen, you know, really good strength as we think about, for example, Black Friday that you've asked about, very strong.\n\nThe weekend was a little bit softer, but still growing. And then Cyber Monday was strong. And actually, what's really been good is kind of the days following Cyber Monday have also been really strong. So, I think similar to what you've heard from others, I think comparing to last year is not a great comparison because everybody bought earlier because they were concerned about inventory shortages.\n\nSo, the whole shape of the quarter was a little bit different, and we're seeing strengthening demand that just keeps on coming. And I think on top of promotional cadence, strength that we have, and some softer comparisons in December, for example, and even a bit into January, plus very strong marketing campaigns, we feel good for, you know, where we're going to land and obviously continue to lead the category in our performance map.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. Very helpful, Mary. And then I guess -- I'd take the follow-up, which is, why have a -- sort of on the low-end, a mid single-digit guide for the top line for the quarter, just given that you've tracked toward the mid-teens quarter to date, and then, comparisons seem to get easier as we move through the quarter, just given the cadence that you mentioned, I guess. Just curious like, sort of why -- what would drive you guys down toward that lower end of the guide? Or does that assume some sort of significant macro deterioration? What are the assumptions have been in the lower end of the guide? That would be helpful.\n\nDonna Dellomo -- Chief Financial Officer\n\nIt's the conservatism, right. I think everybody knows us to be extremely conservative. But -- and that's why we called out that although we are providing that range, we are trending quarter to date, even through yesterday, absolutely to the higher range. But you never know what could happen macro-wise, right? So, we thought it'd be very prudent to build a range in there, although, again, we're trending to the higher side.\n\nAnd you know us always build some type of conservatism into our modeling. And that's why we elected to provide that range. There's no indicators to us right now that we should be coming in at that lower end. And again, our performance is extremely strong, and it continues to be every single day as we monitor, you know, our demand volume.\n\nSo, again, it's purely baked out of conservatism and some variability as to what macro impacts could happen, you know, as we finish up the fourth quarter. That's the only reason we provided that low end of the guidance.\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nOK. Very helpful. Thanks for that, Donna. I'll jump back in queue.\n\nOperator\n\nThank you. Our next question comes from the line of Alex Fuhrman with Craig-Hallum Capital Group. Please proceed with your question.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nHi, guys. Thanks very much for taking my question. I wanted to ask about StealthTech. That was a very impressive number you gave about the initial purchase price being about three times what you see for a typical first-time Sactional purchase.\n\nCan you give us a little bit more insight as to how those transactions are stacking up? Are they typically more pieces than you would see bought in initial Sactional purchase or more premium covers? And then, just as you're kind of looking at what you've seen in the last couple of months and the overall category slowing down, I'm curious if you've seen any sort of resistance to StealthTech as well, or if that's been more immune given the high price points.\n\nMary Fox -- President and Chief Operating Officer\n\nGreat. Thank you, Alex, and a good question. You know, our passion for StealthTech, and obviously, you heard earlier just the continued momentum. So, I think in terms of, you know, your first question around, you know, the average order value , and obviously being so much higher to transactions without StealthTech, we see that both in terms of, you know, consumers just love the experience.\n\nI mean, you know. You've been to a showroom. You've sat and experienced and heard of StealthTech. It's amazing.\n\nSo, the showrooms are doing an incredible job of demoing it, and that's one of the great successes of our business model. And consumers are loving and buying into it. And actually, as I shared, we continue to see StealthTech build month over month and are very happy to see the performance. And even, for example, Best Buy, we are significantly advantaged with StealthTech performance there, you know, more than double what we see for the rest of the fleet.\n\nSo, it just shows us the potential as well from that side. In terms of what else are we seeing in the dynamics of the purchase, we're seeing big setup purchases. You know, not really seeing any shift in terms of what people are buying around covers. We are seeing a bit of a trend up in terms of the more premium sale.\n\nAs you know, Lovesoft, which was contrary to where we were early in the year, where we saw a bit more of a shift to standard. So, everything really continues to show us with our affluent customer base. They come to Lovesac to buy our product because they love it. Not generally, you know, four in 10 are not even cross-shopping because they just buy into the Designed for Life product platform and the ability to flex and change to your life.\n\nSo, you know, we continue to feel very good about how StealthTech will build. And it's only a year. We should have actually sung happy birthday to it. It's a year for the build, a lot of campaign success, and we will continue to build, as Shawn always talks about for many years, in what we see as a market-leading innovation.\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nGreat. That's really helpful. Thank you very much.\n\nMary Fox -- President and Chief Operating Officer\n\nMy pleasure. Thank you, Alex.\n\nOperator\n\nThank you. Our final question this morning comes from the line of Lamont Williams with Stifel. Please proceed with your question.\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nHi, good morning. Just kind of in general, how are you thinking about the promotional cadence that you're going to basically employ going forward as we've seen the promotional landscape get more intense with inventory levels coming back? How do you anticipate offering promotions? You looked like you picked up a little bit in terms of the level of discount. But how do you kind of view that going forward at a high level? And secondly, how are you thinking about kind of the number of distribution openings for next fiscal year? Thank you.\n\nMary Fox -- President and Chief Operating Officer\n\nYeah, ll take the first question on promo cadence, and then we can talk a bit about your question for next year. So, obviously, as everybody has reported, there has been an uptick in promotions. But obviously, that was up against last year where it was incredibly benign. And even for this year, it is very benign to pre-pandemic levels, so we feel good in terms of what we have seen.\n\nAnd as we have been testing with the team's agility, sometimes, you know, our customers are responding as much to financing as they are to depth of promotion. So, everything that we're seeing is that we won't need to be more aggressive with everything we know today. We've got strong promotional campaigns, but also coupled with the marketing campaigns that we are driving. You know, I talked about SMS as an example, just a great conversion tactic that really enables us to be top of mind for our customers.\n\nSo, it plans in. We've planned it into our guidance and, obviously, feel good to adjust if we need to. But everything we see today, we think that we have the right plan to close out the quarter and have a very strong year. I don't know, Donna, if you want to talk about FY 2024?\n\nDonna Dellomo -- Chief Financial Officer\n\nAs far as promotional cadence, we're not planning to be any more promotional or have any more promotional activity, any specific promotional activity. And what we're looking at next year, again, we're not providing any type of formal guidance for next year. I can just tell you on the plans that we're building internally, we have a lot of opportunity next year, which will not require us to be any more promotional between the add-on of additional showrooms, the expansion of Best Buy shop-in-shops, the expansion of Costco in-person, pop-up shops, and some other really exciting things we have next -- going on next year that I believe Shawn briefly alluded to, but not really in his script earlier today. So, a lot of opportunity next year, which will -- you know, we don't plan to have to be any more promotional to still drive some very strong top-line growth next year.\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. Ladies and gentlemen, this concludes our question-and-answer session. I'll turn the floor back to Mr. Nelson for any final comments.\n\nShawn Nelson -- Chief Executive Officer\n\nYes. Just want to say thank you so much to the amazing Lovesac team that has built a company, putting up some of the highest growth in the category for the year as we round out the year in this critical fourth quarter. I appreciate all of the hard work and effort. I appreciate our investors for continuing to support us.\n\nAnd looking forward to a bright New Year as we get through the fourth quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRachel Schacter -- Investor Relations\n\nShawn Nelson -- Chief Executive Officer\n\nMary Fox -- President and Chief Operating Officer\n\nDonna Dellomo -- Chief Financial Officer\n\nMaria Ripps -- Canaccord Genuity -- Analyst\n\nTom Forte -- D.A. Davidson -- Analyst\n\nAndrew Chasanoff -- Oppenheimer and Company -- Analyst\n\nMatt Koranda -- ROTH Capital Partners -- Analyst\n\nAlex Fuhrman -- Craig-Hallum Capital Group -- Analyst\n\nLamont Williams -- Stifel Financial Corp. -- Analyst\n\nMore LOVE analysis\n\nAll earnings call transcripts"
}