{
  "companyName": "Apple",
  "companyTicker": "AAPL",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/apple-aapl-q4-2022-earnings-call-transcript/",
  "content": "Apple (AAPL 0.25%)\nQ4 2022 Earnings Call\nOct 27, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the Apple Q4 fiscal year 2022 earnings conference call. For your information, today's call is being recorded. At this time, for opening remarks and introductions, I would like to turn the call over to Tejas Gala, director of investor relations and corporate finance. Please go ahead.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nSpeaking first today is Apple's CEO, Tim Cook; and he'll be followed by CFO, Luca Maestri. After that, we'll open the call to questions from analysts. Before turning the call over to Tim, I would like to remind you that approximately once every six years, we add a week to the December quarter to realign our fiscal periods with the December calendar. So this December quarter will span 14 weeks rather than the usual 13 and will end on December 31.\n\nPlease note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding revenue, gross margin, operating expense, other income and expense, taxes, capital allocation, and future business outlook, including the potential impact of COVID-19 on the company's business and results of operations. These statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast. For more information, please refer to the risk factors discussed in Apple's most recently filed annual report on Form 10-K and the Form 8-K filed with the SEC today, along with the associated press release. Apple assumes no obligation to update any forward-looking statements or information, which speak as of their respective dates.\n\nI'd now like to turn the call over to Tim for introductory remarks.\n\nTim Cook -- Chief Executive Officer\n\nThank you, Tejas. Good afternoon, everyone, and thank you for joining the call today. Over the past year, despite a range of challenges facing the world, our teams have come together in incredible ways to drive unparalleled innovation and deliver again and again for our customers.For the September quarter, we reported record revenue of $90.1 billion, which was better than we anticipated despite stronger-than-expected foreign currency headwinds. We set an all-time revenue record for Mac and September quarter records for iPhone and wearables, home, and accessories.\n\nServices notched a September quarter record as well with revenue of $19.2 billion and more than 900 million paid subscriptions. We reached another record on our installed base of active devices, thanks to a quarterly record of upgraders and double-digit growth in switchers on iPhone. Across nearly every geographic segment, we reached a new revenue record for the quarter. And we continue to perform incredibly well in emerging markets with very strong double-digit growth in India, Southeast Asia, and Latin America.\n\nI'm also happy to report that during the quarter, silicon-related supply constraints were not significant. I want to acknowledge that we are still living through unprecedented times. From war in Eastern Europe to the persistence of COVID-19, from climate disasters around the world to an increasingly difficult economic environment, a lot of people and a lot of places are struggling. Through it all, we've aimed to help our customers navigate through the challenges while giving them the tools to drive progress for themselves and their communities.\n\nAt Apple, creativity and collaboration have always been at the core of who we are. That spirit of ingenuity and teamwork helped us provide our customers with incredible innovations this year and led to another yearly revenue record. In fiscal 2022, Apple achieved revenue of $394 billion, representing 8% annual growth. We set records for iPhone, Mac, wearables, home and accessories and services while growing double-digits in emerging markets and setting records in the vast majority of markets we track.\n\nCustomers are loving our iPhone 14 lineup. Loaded with camera upgrades for sharper photos, Action Mode for smoother videos and new safety features like Crash Detection and Emergency SOS via Satellite, iPhone is even more indispensable to our daily lives. iPhone 14 and iPhone 14 Plus come with a new dual-camera system, industry-leading durability, incredible power and amazing battery life. And our iPhone 14 Pro models are packed with even more groundbreaking innovations, including a new camera system as well as always-on display and the Dynamic Island, which offers a whole new way to interact with iPhone.\n\nJust yesterday, our most advanced iPad and iPad Pro ever landed in stores. With its all-screen design, advanced cameras and faster wireless connectivity, the tenth-generation iPad looks and performs better than ever. For creatives, iPad Pro, now turbocharged by the blazingly fast M2 chip, is the perfect device to make something amazing. Our Mac customers have already been raving about the power of M2 since the arrival of our newest MacBook Air and MacBook Pro this summer.\n\nTheir incredible long battery life, stunningly rich display and lightning-fast speeds are a signature part of the Mac experience and helped drive an all-time record revenue for Mac during the September quarter. In wearables, home and accessories a wave of innovation spurred 10% year-over-year revenue growth during the September quarter. New features in Apple Watch Series 8, including temperature sensing capabilities, retrospective ovulation estimates and crash detection are helping to keep customers healthier and safer. And the updated Apple Watch SE is a great way for users to start their Apple Watch journey, delivering advanced features at a new low price.\n\nThe biggest, brightest and boldest Apple Watch ever made, Apple Watch Ultra pushes the boundaries of what a smartwatch can do. Packed with innovations like advanced navigation tools and the new Oceanic+ app, which turns it into a dive computer, Apple Watch Ultra has something for athletes and adventures on land and sea. The second generation of AirPods Pro powered by the new H2 chip are receiving rave reviews for delivering an unmatched wireless earbud audio experience, while canceling up to twice as much noise over the previous model. There's no better place to discover the rich spatial audio capabilities of AirPods Pro than Apple Music, the largest music catalog anywhere now with more than 100 million songs.\n\nAnd there's no other company that fuses best-in-class hardware with cutting-edge software and services to create a truly integrated and seamless experience. With iOS 16, we're giving customers more ways to personalize their iPhones through a customizable lock screen and focus filters. New features in Messages and Mail enable users to connect and collaborate like never before. Stage Manager in iPadOS 16 and macOS Ventura, helps users stay more productive with smoother multitasking.\n\nAnd watchOS 9 is empowering customers to live a healthier day through updates to the Sleep App, a new FDA-cleared AFib history feature and the new Medications app. Across our Services, we continue to see enthusiasm and strong engagement from our subscribers. Apple TV Plus hits like Severance, Bad Sisters, and Blackbird have taken center stage on screens around the world. And baseball fans were glued to their seats this season watching Friday Night Baseball.\n\nMeanwhile, Apple TV Plus productions continue to earn accolades. At the 74th Primetime Emmy Awards in September, Apple brought home nine statues, including a second consecutive win for Best Comedy Series for Ted Lasso. And soon, we're going to give audiences an even better entertainment experience when the all-new Apple TV 4K hit stores next week. We're also bringing Fitness+ to more customers than ever by making our entire library of over 3,000 studio-style workouts and meditations available to iPhone users in 21 countries, even those without an Apple Watch.\n\nThese updates are arriving just in time for a new Artist Spotlight series with workouts featuring the music of Taylor Swift and a new workout program, Yoga for Every Runner featuring and design with one of the world's top ultramarathon athletes, Scott Jurek. While Fitness+ helps subscribers stay active, Apple Card is designed with our customers' financial health in mind. For the second year in a row, Apple Card has been ranked highest in customer satisfaction for midsized credit card issuers by J.D. Power.\n\nAnd our users' favorite Apple Card benefit just got even better with the upcoming addition of a new high-yield savings account to help them save and grow their daily cash rewards. Turning to retail. Last month, our team members welcomed customers to the all-new Apple Jamsil in South Korea. And through today at Apple Creative Studios, we partnered with non-profits in cities around the world to help young diverse creatives pursue their passions and connect with local mentors.\n\nAnd our retail teams have done exceptional work, helping customers explore our latest products and features. As we approach the holiday season with our product lineup set, I'd like to share my gratitude to our retail, AppleCare, and channel teams for the work they are doing to support customers. At Apple, we're proud of the ways we are able to help customers be productive, get healthy, stay safe and unlock their creative potential. We also understand we have important responsibilities to the communities we serve.\n\nThat's why we continue to invest in education, racial equity and justice and the environment. And we are making important progress toward a more inclusive and diverse workforce. Through our Community Education Initiative, we're working alongside more than 150 partners to help students around the world learn new science and technology skills. This summer, we joined with community partners to support coding academies across the United States from Code Academy in Nashville to One Summer Chicago to the Coding 5K Camp for Girls right next door in San Jose.\n\nWe've also just expanded our racial equity and justice initiative into the U.K. for the first time. Alongside the South Pink Center, we're helping aspiring creators develop their own voices and position themselves for long-lasting careers. Back in the U.S., we welcomed a new class of Black, Latino, and indigenous entrepreneurs to Apple's second Impact Accelerator.\n\nThis group of innovators is focused on using green technology to mitigate the effects of climate change and serve communities most affected by it. At Apple, we care deeply about protecting the planet for future generations. To that end, in support of our 2030 environmental goals, we have asked all of our suppliers to become carbon-neutral across their entire Apple-related footprint by the end of the decade. We are also providing them with resources based on what we learned achieving net-zero carbon in our own global operations.\n\nAcross our entire product lineup, we also continue to source more materials through recycling while taking less from the Earth. Every iPhone 14 is made with 100% recycled rare-earth elements in all magnets, including those used in MagSafe. And in a first for Apple Watch and iPad, we're using recycled gold in the plating of multiple printed circuit boards in our newest devices. While we're working to reduce the footprint of our hardware, we're making changes to our software to be more environmentally friendly with the soon-to-be released Clean Energy charging feature for iPhone.\n\nOur 2030 goal is a reflection of our relentless focus on the future at Apple. The world continues to be unpredictable as old challenges evolve and new ones emerge. What remains constant is the ability of our teams to create great products, services and experiences while being a force for good in the world. Whatever challenges lie ahead in the new year, we're moving forward, as we always have, investing for the long-term to deliver incredible innovations for our customers like only Apple can.\n\nAnd now, I'll hand it over to Luca for more details on our performance.\n\nLuca Maestri -- Chief Financial Officer\n\nThank you, Tim, and good afternoon, everyone. We are very pleased to report record financial results for the September quarter that capped another record fiscal year for Apple despite a challenging and volatile macroeconomic backdrop. We reached a September quarter revenue record of $90.1 billion, up 8% year over year despite over 600 basis points of negative foreign exchange impact, with new September quarter records in the Americas, Europe, Greater China, and rest of Asia Pacific. Importantly, in constant currency, we grew nicely in each of our geographic segments, with strong double-digit growth outside the U.S.\n\nProducts revenue was $71 billion, up 9% over last year despite FX headwinds and a record for the September quarter. And it was a September quarter revenue record for iPhone and wearables, home and accessories and an all-time revenue record for Mac. Overall, our installed base of active devices continue to grow nicely. It reached an all-time high for all major product categories and geographic segments at the end of the quarter, thanks to extremely strong customer satisfaction and loyalty and a high number of customers that are new to our products.\n\nOur Services set a September quarter revenue record of $19.2 billion, up 5% over a year ago despite over 600 basis points of negative impact from foreign exchange. We reached September quarter revenue records in the Americas, Europe, Greater China and rest of Asia Pacific and also in many services categories, including all-time revenue records for cloud services and payment services. Company gross margin was a September quarter record at 42.3%. It was down 100 basis points from last quarter due to unfavorable foreign exchange and a different mix, partially offset by leverage.\n\nProducts gross margin was 34.6%, up 10 basis points sequentially, with improved leverage and favorable mix partially offset by foreign exchange. Services gross margin was 70.5%, down 100 basis points sequentially, primarily due to foreign exchange. Net income of $20.7 billion, diluted earnings per share of $1.29 and operating cash flow of $24.1 billion were all September quarter records. Let me now get into more detail for each of our revenue categories.\n\niPhone revenue grew 10% year over year to a September quarter record of $42.6 billion, despite significant foreign exchange headwinds. We set September quarter records in the vast majority of markets we track, and our performance was particularly impressive in several large emerging markets, with India setting a new all-time revenue record and Thailand, Vietnam, Indonesia, and Mexico more than doubling year over year. Thanks to our strong iPhone lineup, we set a quarterly record for upgraders and grew switchers double digits. This level of sales performance, along with unmatched customer loyalty, drove the active installed base of iPhones to a new all-time high across all geographic segments.\n\nAnd the latest survey of U.S. consumers from 451 Research indicates iPhone customer satisfaction of 98%. It was a great quarter for Mac. We achieved an all-time revenue record of $11.5 billion, up 25% year-over-year, despite significant FX headwinds.\n\nThere were three key items that helped drive this performance. First, we benefited from the launch of our new MacBook Air and MacBook Pro powered by the M2 chip. Second, we were able to satisfy pent-up demand that carried forward from the significant supply constraints we faced during the June quarter. Third, as our supply position improved, we were able to fill the channel.\n\nImportantly, our investment in the category has attracted both upgraders and customers new to Mac and helped our installed base reach an all-time high. In fact, we set a quarterly record for upgraders, while nearly half of customers buying Macs during the quarter were new to the device. iPad revenue was $7.2 billion, down 13% year over year due to significant negative foreign exchange and a challenging compare due to the launch of new iPads a year ago. Despite this, the iPad installed base reached a new all-time high, thanks to incredible customer loyalty and a high number of new customers.\n\nIn fact, over half of the customers who purchased iPads during the quarter were new to the product. Wearables, home and accessories revenue was $9.7 billion, growing 10% year over year, driven by the launch of Apple Watch and new AirPods Pro. This level of safe performance along with very strong new tool rates, drove our installed base of devices in the category to a new all-time record. For instance, two-thirds of customers purchasing an Apple Watch during the quarter were new to the product.\n\nMoving to Services, as I mentioned, we set a September quarter record in aggregate and in most geographic segments, generating $19.2 billion in revenue in spite of very large foreign exchange headwinds. It is important to remember, that we achieved double-digit constant currency growth in services on top of growing 26% during the September quarter a year ago. However, certain services were impacted by macroeconomic headwinds, including foreign exchange. Digital advertising and gaming are areas where we've seen some softness.\n\nThroughout the quarter, we continued to observe several trends that reflect the strength of our ecosystem and our long-term opportunity in the category. First, our continued installed base growth across each geographic segment and each major product category represents a great foundation for future expansion of our ecosystem. Second, we saw increased customer engagement with our services during the quarter. Both our transacting accounts and paid accounts grew double digits year over year, each setting a new all-time record.\n\nThe percentage of accounts that pay for our services continues to increase, and we still see plenty of opportunity ahead of us. Third, paid subscriptions showed very strong growth. We now have more than 900 million paid subscriptions across the services on our platform, up more than 155 million during the last 12 months alone and double what we had just three years ago. We continue investing in new content and features, across our service offerings.\n\nFor example, we added several popular sports titles to Apple Arcade. We're also excited about our global partnership with Major League Soccer, where starting next season, fans can stream every single MLS match through the Apple TV app. This momentum helped us achieve over $78 billion in services revenue during fiscal 2022, a new record and up 14% year over year. We continue to invest confidently and believe strongly in the long-term potential of our services business, which is already the size of a Fortune 50 business on its own, and has nearly doubled during the last four years.\n\nIt was not only a record year for services but also for our entire company. During the past four quarters, we grew our business by 8% or $29 billion, reaching more than $394 billion of revenue. We grew diluted earnings per share by 9% and generated over $111 billion of free cash flow, up 20% year over year. It was also a strong year for our enterprise business, as we set new annual records for iPhone, iPad and Mac during fiscal 2022 and grew strong double-digits year over year as our devices and services continue to help more and more companies empower their employees and serve their customers.\n\nFor instance, Ford Manufacturing employees are using iPad and iPhone to help further improve the quality of its game-changing Ford F-150 Lightning electric trucks. iPhone's powerful A-series chip and advanced camera systems, along with third-party iOS apps, are enabling Ford to automate the visual quality inspection process in real-time to help address issues before they impact customers. And Cisco expanded its Macs as a choice program and is now offering it to all its employees to help attract and retain top talent. And when given this choice, employees have chosen Macs twice as often as other options.\n\nIn addition, many enterprise customers are taking advantage of the high residual value of our products and simple trade-in process to standardize the refresh cycles for their fleets of Apple devices. This allows employees to upgrade to the latest devices regularly while making it highly predictable and cost effective for the business. Let me now turn to our cash position. Our business continues to generate very strong cash flow, which enabled us to return over $29 billion to shareholders during the September quarter.\n\nThis included $3.7 billion in dividends and equivalents and $25.2 billion through open market repurchases of 160 million Apple shares. We ended the quarter with $169 billion in cash and marketable securities. We repaid $2.8 billion in maturing debt and decreased commercial paper by $1 billion while issuing $5.5 billion of new debt, leaving us with total debt of $120 billion. As a result, net cash was $49 billion at the end of the quarter as we continue to make progress toward our goal of becoming net cash neutral over time.\n\nAs we move ahead into the December quarter, I'd like to review our outlook, which includes the types of forward-looking information that Tejas referred to at the beginning of the call. Given the continued uncertainty around the world in the near term, we are not providing revenue guidance but we are sharing some directional insights based on the assumption that the macroeconomic outlook and COVID-related impacts to our business do not worsen from what we are projecting today for the current quarter. Overall, we believe total company year-over-year revenue performance will decelerate during the December quarter as compared to the September quarter for a number of reasons. First, we expect nearly 10 percentage points of negative year-over-year impact from foreign exchange.\n\nSecond, on Mac, in addition to increasing FX headwinds, we have a very challenging compare against last year, which had the benefit of the launch and associated channel fill of our newly redesigned MacBook Pro with M1. Therefore, we expect Mac revenue to decline substantially year over year during the December quarter. Specifically on services, we expect to grow but to be impacted by the macroeconomic environment increasingly affecting foreign exchange, digital advertising and gaming. We expect gross margin to be between 42.5% and 43.5%.\n\nWe expect opex to be between $14.7 billion and $14.9 billion. We expect OI&E to be around negative $300 million, excluding any potential impact from the mark-to-market of minority investments and our tax rate to be around 16.5%. Finally, today, our board of directors has declared a cash dividend of $0.23 per share of common stock, payable on November 10, 2022, to shareholders of record as of November 7, 2022. With that, let's open the call to questions.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nThank you, Luca. We ask that you limit yourself to two questions. Operator, may we please have the first question?\n\nOperator\n\nWe'll go ahead and take our first question from Shannon Cross calling from Credit Suisse. Please go ahead.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you very much. It's great to talk to you on the call again. I'm wondering, can you just talk a bit about how you're thinking about this iPhone generation? On the positive side, you've raised prices. It seems to be mixing up.\n\nOn the negative side, investors are concerned about impacted demand from the higher prices, what Huawei meant to you in prior years versus what could happen now. There are just some pressures out there. So I'm curious if you can talk to what you're seeing initially in iPhone demand and how you think it will move through. With the caveat that I understand, things are pretty uncertain out there.\n\nAnd then I have a follow-up. Thank you.\n\nTim Cook -- Chief Executive Officer\n\nShannon, it's Tim. Welcome back. iPhone grew 10% in the Q4 timeframe to $42.6 billion. Customer demand was strong and better than we anticipated that it would be.\n\nAnd keep in mind that this is on top of a fiscal year of 2021 that had iPhone revenue grow by 39%, and so it's a tough compare as well. And so we were happy with it. In terms of the new products, the 14 and the 14 Pro and Pro Max, it's still very early. But since the beginning, we've been constrained on the 14 Pro and the 14 Pro Max and we continue to be constrained today.\n\nAnd so we're working very hard to fulfill the demand. It's difficult to say what the mix will be until we can satisfy the demand because we're not able to determine the accurate mix until then. But we're working very hard to do that. We were really pleased with the broadness of the iPhone strength last quarter.\n\nWe had three of the top four smartphones in the U.S. and the U.K., the top three in Urban China, the top six in Australia, four out of the top five in Germany and the top two in Japan. And customer satisfaction for the iPhone remains very, very strong at 98%. And so we feel very good about how we performed in Q4.\n\nAnd certainly, the start of this generation would suggest that we're going to be constrained for a little while on the 14 Pro and 14 Pro Max. But we're working very hard to try to remedy that.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you. And then, Luca, can you talk a bit about gross margin puts and takes? Just how we should think about, I mean, 10 basis points of currency this coming quarter is, I don't want to say unprecedented, but maybe it is. So I know you have hedges, but how do we think about it flowing through? And then what other -- components seem to be very favorable. But what else should we throw into the mix as we look forward?\n\nLuca Maestri -- Chief Financial Officer\n\nYeah. Well, let me start with gross margin in Q4 and then I'll get to Q1. It was a September quarter record for the company. We did 42.3%, and that is in spite of, as you mentioned, very significant negative FX, for example, for Q4, on a sequential basis, FX was negative 70 basis points and on a year-over-year basis it was negative 170 basis points.\n\nEssentially every currency around the world has weakened against the dollar. Now, we have guided Q1 to 42.5% to 43.5% in spite of the fact that we have, on a year-over-year basis, 330 basis points of negative exchange. Sequentially, it's 120 basis points unfavorable. So obviously, the strong dollar makes it difficult in a number of areas.\n\nObviously, our pricing in emerging markets makes it difficult, and the translation of that revenue back into dollars is affected. But on the positive side, we are seeing commodities behave fairly favorably for us. And so we believe we can offset the negative foreign exchange that we're seeing. And I think that the guidance that we provided reflects that.\n\nIt takes into account, of course, FX. It takes into account some level of inflationary pressures. But I think the outcome is, I think, is a good one.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nGreat. Thank you very much.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nThanks, Shannon. Can we have the next question, please?\n\nOperator\n\nOur next question is coming from Erik Woodring with Morgan Stanley. Please go ahead, sir.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nHey, guys. Thanks very much for taking my questions. I have two as well. Maybe if we could just start.\n\nLuca, we saw quite the divergence in iPad and Mac performance this quarter. Both were relatively constrained from a supply perspective. So maybe can you just elaborate on some of the most impacted -- important factors that contributed to kind of the divergence in performance and whether after we get through the December quarter, those can reverse or normalize? And then I have a follow-up.\n\nTim Cook -- Chief Executive Officer\n\nYeah, Erik, it's Tim. I'll take your question. If you look at the Mac, the Mac, it was the best quarter we've ever had in the history of the company. It was helped by the product launch of the MacBook Air with M2.\n\nIt was helped that in the previous quarter, in the June quarter, if you remember, we lost output from the factory for a significant portion of the quarter. And so we had a backlog exiting our Q3 headed into Q4. We were able to satisfy all of that demand during Q4 and filled the channel for the Mac. And so that led to an incredible Mac quarter.\n\nIf you look at iPad, iPad had sort of the opposite happening from a launch point of view. The comp from a year ago, we launched iPads in September. We launched iPads this year in October. The other point to remember is that the iPad Pro had just launched before the quarter started in the year-ago quarter so it was our first full quarter of iPad Pro.\n\nSo it was an exceptionally strong iPad quarter a year ago, and the launches were really key to that performance. And so that's the reason iPad contracted during this quarter.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nOK.That's helpful. Thank you, Tim. And then maybe, Luca, if I were just to ask you, obviously, Tejas at the beginning of the call talked about the 14-week quarter. Maybe can you just elaborate a little bit on how you think that 14-week quarter impacts different line items, whether it's products or certain segments within the product business or the services stand-alone? Just where we should see that 14-week quarter provide a bit more of a tailwind versus maybe not have an impact at all? And that's it for me.\n\nThanks.\n\nLuca Maestri -- Chief Financial Officer\n\nIn general, we have a few more days in the quarter that we're going to -- are going to affect both our revenues and our costs. Not every week is equal because obviously, we have certain peaks during the course of the quarter. Think about Black Friday or the Christmas holiday. But, in general, we're adding a few days of sale and additional opex as well on the cost front.\n\nSo that's what happens to us every approximately six years as we need to align our weekly calendar to the fiscal calendar.\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nSuper. Thanks, guys.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nThanks, Erik. Can we have the next question, please?\n\nOperator\n\nThe next question is coming from Ben Bollin calling from Cleveland Research.\n\nBen Bollin -- Cleveland Research -- Analyst\n\nGood afternoon, everyone. Thank you for taking the question. Tim, I was hoping we could talk a little bit about services, pieces within the portfolio. It looks like there's been some price adjustments as of late with respect to Music, TV Plus and the One bundle.\n\nI'm curious how you think about balancing the consumer price versus your own costs and kind of the associated follow-through. And then I have a follow-up.\n\nTim Cook -- Chief Executive Officer\n\nYes. If you look at the price increase that you referenced, Ben, on Monday of this week, we announced a price increase on Apple Music and on Apple TV Plus and then the corresponding Apple One, that is the consolidated bundle that includes both of those. There's really two different situations here. With Music, the cost of licensing increased.\n\nAnd so we are paying more for music. The good thing about that is the artist will also get more money for their songs that are enjoyed on streaming. And so there's some bit of good news there, I suppose. And then on Apple TV Plus, if you look at when we first priced it, we only had a very few shows.\n\nWe were at the beginning. We are very focused on originals only, and so we had four or five shows or so in the beginning and priced it quite low. We now have a lot more content and are coming out with more each and every month. And so, we've increased the price to represent the value of the service.\n\nAnd of course, Apple One is just the consolidation of those two price changes.\n\nBen Bollin -- Cleveland Research -- Analyst\n\nOK. And then, another item. Any preliminary thoughts around capital intensity into fiscal 2023? Last couple of years, capex has been relatively stable. Can you talk to the big constituents of the capex figure and maybe any moving pieces and how we could think about that to 2023? Thank you.\n\nLuca Maestri -- Chief Financial Officer\n\nYes, Ben. So when we look at our capex, as you correctly said, I mean, we've been fairly stable, and I think our capital intensity is really very good. We have three major buckets in capex for the company. We have certain dedicated tools for the manufacturing facilities.\n\nWe had some spend around data centers, and we have spent around our office facilities around the world. We obviously monitor all of them. There is nothing unusual that we see for the next 12 months.\n\nBen Bollin -- Cleveland Research -- Analyst\n\nOK. Thanks, guys.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nThanks, Ben. Can we have our next question, please?\n\nOperator\n\nOur next question is coming from Kyle McNealy calling from Jefferies. Please go ahead.\n\nKyle McNealy -- Jefferies -- Analyst\n\nHi. Thanks very much. Just wanted to see if you could give us a sense for what drove the Wearables result and the strength there this quarter. Was it from the maybe strong iPhone attach rates or the new products that you have available that were announced this quarter, or maybe you're still getting some benefit from customers that are more willing to come into the store now and try things on versus the pandemic when that was kind of shut down?\n\nTim Cook -- Chief Executive Officer\n\nYes. Kyle, it's Tim. If you look at Wearables, we grew 10%, which we were very happy with. If you look at the individual pieces of that, Apple Watch was a contributor.\n\nAnd in particular, the new lineup was a contributor, including the Apple Watch Ultra and the Apple Watch Series 8 and the SE. The Ultra is -- was supply constrained and continues to be supply constrained during this quarter thus far. And so we're working hard to satisfy the demand bearing, get those products to customers. We also announced and launched the AirPods Pro in September.\n\nAnd the reviews for the product have just been off the charts in terms of the noise cancellation features and the sound quality. We're getting great, great reviews from there. In terms of what played the other way, the headwinds, obviously, FX was a headwind that affected wearables, home, and accessories, just like it affected the rest of our products and services. And we also had effect from the business in Russia, obviously, or the impact there.\n\nSo that's sort of the pro and the con. The other thing that I should mention is that about two-thirds of the Apple Watches that we sold were to customers that had not previously owned an Apple Watch. And so we're still very much selling to new customers here, which is very, very good for the future.\n\nKyle McNealy -- Jefferies -- Analyst\n\nOK. Great. One more quick one on Mac. I wanted to see if you could quantify at all how much the channel fill and how much came from satisfying back orders from the June period for Mac.\n\nWe're just trying to get a sense for where the baseline is, if there's any sense you can give us on that. What would it have grown if not for those factors? Anything you can give us would be great. Thanks.\n\nTim Cook -- Chief Executive Officer\n\nYes. I would just say that all three of the reasons that I gave were key in achieving the 25%. The M2 MacBook Air, the launch of the new product, satisfying the back orders from the previous quarter and then filling the channel, all of those were key contributors.\n\nKyle McNealy -- Jefferies -- Analyst\n\nOK, Tim. Thanks.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nThanks, Kyle. Can we have our next question, please?\n\nOperator\n\nThe next question is coming from Mr. Jim Suva calling from Citigroup.\n\nJim Suva -- Citi -- Analyst\n\nThank you, and it's great to see that you talked about your suppliers going carbon-neutral, something -- a small statement I really took to heart. Thank you. My question is on the services. Could it possibly be impacted more by FX than product, meaning the Jim Suva family has Apple One and TV Plus and all that, and we pay typically on annual, but then when we go into the store to buy new Watches and iPad, the price is adjusted more quickly.\n\nSo could it be that services growth was impacted a little bit more by FX and down the road, we could see growth reaccelerate, or am I just reading too much into the FX impact that could be different from services versus product? Thank you.\n\nLuca Maestri -- Chief Financial Officer\n\nJim, it's Luca. No. You're right. Obviously, the FX impact on our business depends on the geographic mix of the sales that we do.\n\nAnd so yes, it can be -- services and products can have slightly different effects on foreign exchange. And so, if we look at our services business in constant currency, we would have grown double digits. And so we're very pleased with that. As I mentioned, there were some areas that we could see some softness in digital advertising.\n\nOf course, you know that part, and gaming on the App Store was affected. But we were very happy with what we saw in terms of the behavior of our customers with the engagement with services. And I mentioned a number of things during the prepared remarks, the fact that, obviously, that installed base is growing, that's a positive and it's a great foundation for the future. We are seeing more transacting accounts and more paid accounts, they're both growing double digits.\n\nPaid accounts are growing faster than transacting accounts, so the penetration of paid accounts is increasing. We have a great subscription business, 900 million paid subs now on the platform and growing very fast. We doubled in 3 years. So when we look at all those dynamics, that's the part that is really interesting to us because we really believe that the engine for services growth is there and foreign exchange is a temporary thing and -- but the fundamentals are very good.\n\nJim Suva -- Citi -- Analyst\n\nThank you. Congratulations for your team.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nThanks, Jim. Can we have the next question, please?\n\nOperator\n\nThe next question is coming from Amit Daryanani from Evercore. Please go ahead.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nThanks for taking my question. I have two as well. The first one really is around the iPhone trajectory. There's been a fair amount of focus in terms of what's going to happen to iPhone demand, given the macro worries.\n\nIt would be really helpful to understand though, given the strength you're seeing, where do you think channel inventory is for iPhones today versus where it would be from a historical perspective? And do you see the channel getting to an optimal level by end of December quarter? Because evenly right now given the lead time data, it looks like your revenue trajectory in iPhones is more driven by the supply you have versus demand. So any color on the channel inventory would be helpful.\n\nTim Cook -- Chief Executive Officer\n\nYes. If you look at where we ended, Amit, in the September quarter, we exited below our target inventory range on iPhone and that's -- that in and of itself is not too unusual in the quarter. We start the ramp and demand is robust and so forth. And so I wouldn't call it that abnormal from the past.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nGot it. And then I guess, Tim, you folks have been talking about digital advertising a fair bit over the last few quarters, I think. Is there any metrics, any vectors you can talk about kind of to give us a sense of how big those businesses or what vectors are you focused on? And really, if you could talk about, do you think Apple can build an advertising business at scale without sacrificing consumer privacy?\n\nTim Cook -- Chief Executive Officer\n\nSo first and foremost, we focus on privacy and so we would not do anything that stepped away from that. We feel that privacy is a basic fundamental human right, and so that's sort of the lens that we look at it under. Our specific advertising business is not large and relative to others and so forth. But we don't release the exact numbers on it, but it's clearly not large.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nThanks, Amit. Can we have the next question, please?\n\nOperator\n\nWe'll now move on to Mr. Harsh Kumar calling from Piper Sandler. Please go ahead.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nYeah. Hey, thanks guys, First of all, fellows congratulations on stellar performance. There's a lot of large-cap companies that are getting ripped around, so we appreciate the steady cadence here. Tim, I wanted to ask you about inflation pressures and labor problems here in the U.S.\n\nand globally. And maybe talk about what steps can Apple take to mitigate those? And maybe Luca, on that end, FX is becoming a pretty significant headwind. I was curious what -- if at all, if there's anything that can be done to mitigate that.\n\nTim Cook -- Chief Executive Officer\n\nI'll let Luca talk about FX. In terms of the people piece, we're focused on taking care of our teams and offering them the best benefits and best compensation so that we can empower them to do the best work of their lives. And so that's what we're focused on in terms of our teams. In terms of inflation, there's clearly wage inflation.\n\nThere's inflation related to logistics as well. If you compare it to pre-pandemic kind of levels, that has not returned to pre-pandemic levels by any means. And there's certain silicon components that are -- have inflationary pressure as well. And so that's not an all-inclusive list of where we see it, but it gives you some ingredients of where we see inflation pressure.\n\nAnd we've obviously taken that into consideration in the gross margin guidance that Luca gave earlier in the call.\n\nLuca Maestri -- Chief Financial Officer\n\nYes. And on foreign exchange, you're right. I mean, it's obviously a very significant factor that is affecting our results, both revenue and gross margin. What do we do about situation like this, one where we have a very strong dollar? Of course, we hedge our exposures.\n\nWe try to hedge them in as many places as possible around the world. For example, I think we've been probably the first company that started hedging our exposure in China several years ago. There may be a few currency, small ones, where we don't hedge because the cost is prohibitive or the market is not there. But in general, we tend to hedge because it gives us significant level of margin stability.\n\nObviously, over time, that protection reduces because the hedges roll over and we need to buy new contracts. But that's the primary tool that we use to offset some of the FX pressure. Of course, when we launch new products, in particular, we look at the FX situation. And in some cases, for example, customers in international markets had to -- they saw some price increases when we launched the new products, which is not something that, for example, U.S.\n\ncustomers have seen. And that's unfortunately the situation that we're in right now with the strong dollar. So that's the way we try to deal with that. I have to say that one of the things that we've really appreciated the most during the quarter was the fact that in spite of this very strong dollar and the difficult FX environment, we have seen very strong performance in many international markets, particularly some very large emerging markets where even in reported currencies, so in U.S.\n\ndollars, we're seeing very strong double-digit growth in places like India, Indonesia, Mexico, Vietnam, many places where we've done incredibly well. And obviously, in local currency, those growth rates are even higher. It's important for us to look at how these markets perform in local currency because it really gives us a good sense for the customer response to our products, the engagement with our ecosystem and in general, the strength of the brand. And I have to say, in that respect, we feel very, very good about the progress that we're making in a lot of markets around the world.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nThanks, Tim and Luca. I had a follow-up. Luca, in your prepared remarks for the guidance, you mentioned that for the December quarter, you expect the performance to decelerate relative to September. So September was a year-over-year about, call it, 8%.\n\nShould I think that, that 8% number will go down on a year-over-year basis as we look at December? Maybe you could provide some color on what you're thinking. And are we still looking -- are we looking at a positive number, or are we thinking maybe that the growth rate will be negative on a year-over-year basis?\n\nLuca Maestri -- Chief Financial Officer\n\nWhat we said is that we're going to be decelerating from September, so September was 8%, so it's going to be a lower percentage than 8%. We're not providing guidance for the reasons that we've explained. There's a lot of uncertainty there. And so we see how the quarter progresses.\n\nKeep in mind the 10 points of exchange. Certainly, in normal times, we will be talking about very different numbers, but that's where we are right now.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nThank you, guys.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nThanks, Harsh. Can we have the next question, please?\n\nOperator\n\nNext question is coming from Krish Sankar calling from Cowen & Company. Please go ahead.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nYeah. Hi. Thanks for taking my question. I had two of them.\n\nFirst one, either for Tim or Luca, on cash and capital allocation. Given there's some correction and valuation for some of the private and public companies, does it change your thought process on the time line to get to cash-neutral? In other words, would you be more aggressive with acquisitions, or you think holding on to more cash due to interest income becomes more attractive versus your prior investment goals? And then I had a quick follow-up.\n\nTim Cook -- Chief Executive Officer\n\nThis is Tim. In terms of acquisitions, we averaged about one per month, I believe, in across fiscal year 2022. And so we're constantly looking in the market. And what's out there.\n\nAnd what things would be synergistic. And which things would provide either intellectual property or talent or preferably both that we would need. And so we're constantly looking at acquisitions of all sizes.\n\nLuca Maestri -- Chief Financial Officer\n\nIn terms of cash deployment, obviously, we like to look at the capital return program over the long arc of time. And we have done, since the beginning of the program we've done over $550 billion of buyback at an average repurchase price of $47. So the program has been incredibly successful. We are still in a position where we have net cash.\n\nAnd we said all along, we want to get to cash-neutral at some point. Our cash generation has been very, very strong over the years, particularly last year. I think I mentioned in the prepared remarks, we did $111 billion of free cash flow. That's up 20% year over year.\n\nAnd so we will put that capital to use for investors.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Very helpful, Tim and Luca. And then a quick follow-up for Luca on the December guidance, thanks for the color on that. I'm just kind of curious, the extra week in the quarter, is that not helping offset some of the FX, or in other words, the 10 percentage point negative impact from FX will be much higher if that's a 13-week quarter?\n\nLuca Maestri -- Chief Financial Officer\n\nNo. I wouldn't say that because those are percentages. So yeah, no, the 10 points wouldn't be different. 13 or 14 weeks would be the same.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nGot it. Got it. Thanks a lot, Luca.\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nThank you, Krish. A replay of today's call will be available for two weeks on Apple Podcasts, as a Webcast on apple.com/investor and via telephone. The number for the telephone replay is 866-583-1035. Please enter confirmation code 7086300, followed by the pound sign.\n\nThese replays will be available by approximately 5:00 p.m. Pacific Time today. Members of the press with additional questions can contact Josh Rosenstock at 408-862-1142. Financial analysts can contact me with additional questions at 669-227-2402.\n\nThank you again for joining us.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTejas Gala -- Director of Investor Relations and Corporate Finance\n\nTim Cook -- Chief Executive Officer\n\nLuca Maestri -- Chief Financial Officer\n\nShannon Cross -- Credit Suisse -- Analyst\n\nErik Woodring -- Morgan Stanley -- Analyst\n\nBen Bollin -- Cleveland Research -- Analyst\n\nKyle McNealy -- Jefferies -- Analyst\n\nJim Suva -- Citi -- Analyst\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nMore AAPL analysis\n\nAll earnings call transcripts"
}