{
  "companyName": "QuidelOrtho",
  "companyTicker": "QDEL",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/quidelortho-qdel-q2-2022-earnings-call-transcript/",
  "content": "QuidelOrtho (QDEL 0.62%)\nQ2 2022 Earnings Call\nAug 04, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the QuidelOrtho second quarter 2022 financial results conference call and webcast. At this time, all participants are in a listen-only mode. For those of you participating in the conference call, there will be an opportunity for your questions at the end of today's prepared remarks. Please note this conference call is being recorded.\n\nAn audio replay of the conference call will be available on the company's website shortly after this call. I would now like to turn the call over to Bryan Brokmeier, vice president of investor relations. Please proceed.\n\nBryan Brokmeier -- Vice President, Investor Relations\n\nThank you, operator. Good afternoon, everyone, and welcome to the QuidelOrtho second quarter financial results conference call. With me, today to discuss our financial results are Douglas Bryant, QuidelOrtho chairman and CEO; and Joe Busky, QuidelOrtho chief financial officer. This conference call is being simultaneously webcast on the Investor Relations page of our website, and the version of today's presentation can be downloaded there.\n\nBefore we begin, I will cover our Safe Harbor statement. Some of the statements we'll make during the call about the company's future expectations, plans, and prospects constitute forward-looking statements within the meaning of Section 21-E of the Securities Exchange Act of 1934, which provides a safe harbor from such statements. Our use of forward-looking statements is subject to a number of risks, uncertainties, and other factors that could cause actual results to differ materially from our current expectations. These risks and uncertainties include but are not limited to those factors identified in the Joint Proxy Statement Prospectus, our quarterly report on Form 10-Q that we plan to file tomorrow, and our other filings with the SEC.\n\nPlease refer to our SEC filings for a more detailed discussion of forward-looking statements and the risks and uncertainties of such statements. We cannot assure you that the forward-looking statements we make are implied by our statements, will be realized. Furthermore, this conference call contains time-sensitive information that is accurate only as of today. Except as required by law, we undertake no obligation to update any forward-looking statement or time-sensitive information to reflect future events, developments, or changed circumstances, or for any other reason.\n\nAlso, during today's call to facilitate a comparison of the company's operating performance from the second quarter of 2021 to the second quarter of 2022, we'll be discussing supplemental second quarter 2022 and 2021 revenues, and adjusted operating results as QuidelOrtho have been combined for the period. We'll refer to this information as our supplemental combined information. This supplemental combined information, as well as certain other items we will discuss do not conform to U.S. generally accepted accounting principles or GAAP.\n\nPlease see slide three for a list of non-GAAP measures. Reconciliations of these non-GAAP measures to the most directly comparable GAAP measures are included in the appendix of the investor presentation and press release issued this afternoon, both of which are available on the Investor Relations page of the QuidelOrtho website. Lastly, [inaudible] otherwise, all year-over-year revenue growth rates, including revenue growth ranges given on today's call, are given on a comparable constant currency basis. Now I'd like to turn the call over to Douglas Bryant, QuidelOrtho chairman, and CEO.\n\nDoug.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nThank you, Bryan. Good afternoon, everyone. As Quidel and Ortho have combined to become QuidelOrtho. So this is our first call as a combined company.\n\nThanks for joining us. I sincerely appreciate your time and your interest in our company. For those of you that were either shareholder of the ortho business, or are entirely new to our story, I joined QuidelOrtho from that Quidel business where I was president, and CEO for more than 13 years. Along with Bryan, joining me on this afternoon's call is our chief financial officer, Joe Busky.\n\nBoth Joe, and Brian joined us from the Ortho Clinical Diagnostics business. I'm happy to have them joining me on this afternoon's call. Beginning with our results, we delivered a strong performance highlighted by 37.5% supplemental combined revenue growth, 32% supplemental combined adjusted EBITDA margin, and triple-digit supplemental combined adjusted EPS growth. As the newly formed team did a terrific job in executing on our strategic priorities.\n\nExcluding COVID, supplemental combined revenue grew 9% year-over-year, and very pleased with the way both of our organizations have engaged each other and coalesced in such a short amount of time. We had strong execution across QuidelOrtho businesses, as our commercial R&D and operations teams maintained their focus on both near-term and longer-term growth opportunities. Supplemental combined revenue for the second quarter, including both Quidel and Ortho for the full quarter, reached $898.5 million, supported by double-digit growth, and point of care, and molecular diagnostics along with solid high single-digit combined growth for labs and transfusion medicine. As we review our notable achievements in the quarter, I'd like to introduce our five strategic priorities, which are one, integration and corporate culture.\n\nTwo, product innovation. Three, global commercial excellence. Four, operational excellence. And five, capital deployment.\n\nAnd I'll start with the integration and our culture. The integration of the two organizations is our top priority. As I emphasized on prior calls, we started on the pre-integration work almost immediately following the announcement of the signing of the business combination agreement in late December, enabling us to hit the ground running with the integration immediately after we completed the transaction at the end of May. As we work through the integration, we are focused on maintaining business as usual, keeping at our unrelenting focus on our employees and commercial excellence, while preserving the best attributes of both cultures as we define our company going forward.\n\nWe've made substantial progress since the transaction closed on May 27. We achieved over 240 critical integration milestones, identified over 100 integration projects, and are executing on over two dozen functional and cross-functional workstreams. To announce my leadership team, as well as other senior executives, developed business unit structures, announced regional leaders, and established systems integration roadmaps. We appointed a strong integration leader who is focused on cultural alignment, combining our operating models, and monitoring plans for our specific DNA synergy targets.\n\nTo minimize customer disruption and maintain our industry-awarded service levels, regional commercial leaders were announced soon after we closed, and we are organizing a joint commercial effort as quickly as possible. Beginning with a U.S. lead sharing program that is expected to accelerate cross sales. Through this process, we are finding that the two organizations balance each other quite well.\n\nQuidel has proven to be agile and innovative, allowing it to take advantage of market opportunities to grow rapidly. Ortho, on the other hand, with its long history in the diagnostics market has established a global infrastructure and processes that enable its stable 93% recurring revenue. That balance of agility and stability is critical, as we plan to drive market share gains by responding to the needs of the market more quickly and serving our customers better than some of our bigger competitors. As discussed on prior calls, we expect to realize cost synergies from the transaction of $90 million in cross-selling revenue synergies of over $100 million by the end of year three, following transaction close, though, we do expect the commercial momentum to continue beyond that time frame.\n\nWhile our integration is still in the early days, the pieces are aligning, and the chemistry is even better than expected, which is remarkable given our high expectations. With this progress in mind, our leadership team is even more excited now than when we first announced the deal. Moving on to product innovation. In addition to executing against our integration plans, our team is working to further advance our product pipeline.\n\nWe will continue to make significant investments in R&D to advance Savanna, our new molecular multiplexing platform. While supporting continued expansion of both our Sofia and [inaudible] test menus. Across the board, we've made good progress on the approximately 100 R&D projects we currently have underway. Long term, we plan to continue to invest in R&D to develop and broaden our portfolio, which we will leverage to accelerate worldwide market penetration.\n\nAs chairman, early on, I made the decision to establish the Science and Technology Board Committee, to oversee and advise management on innovation, new product development, and strategic R&D goals and objectives, which I think is critical at this point in time. Led by our lead independent director, Dr. Kenneth Buechler, the co-founder of BioSite, and the creative genius behind the development of the bridge product line. The members of this committee have incredible expertise that we will leverage.\n\nNext, while I won't talk about all the projects on this call, I can provide you with a few updates on some of our key growth drivers starting with our point of care business unit. We are driving progress on Sofia, which has come a long way in a few short years. Since the pandemic began, we grew the Sofia installed base by approximately 90% to 80 thousand instruments. The vast majority of this installed base remains active, and most of the instruments we placed during the pandemic included signed three-year contracts to run COVID, flu, strep, and RSV tests.\n\nThis is driving strong growth for all these assets. Joe will expand further, but our non-covid revenue per analyzer is significantly over the last year, which justifies the many R&D projects underway to further expand our Sofia test menu. Our commercial team is focused on driving the new pool through on Sofia, and supporting incremental per unit revenue growth. Importantly, our significant leadership position in the flu testing market has translated into significant demand for our ABC combo test, that tests for both flu A, and flu B, as well as COVID 19.\n\nWe are also excited about our progress toward delivering the first high-sensitivity cardiac Troponin solution for the point-of-care market. Due to the pandemic, the clinical validation has taken longer than originally planned. Our 18 clinical sites are continuing to enroll subjects with the expectation of meeting the FDA's performance criteria later next year. We expect the five 10-K submissions will follow shortly after the completion of the clinical validation and will utilize the combined cardiac expertise of both QUIDEL and Ortho.\n\nWe expect that the review and subsequent clearance will occur in the normal timeframe, but there is no guarantee that the effects of the pandemic and [inaudible] filings will have resolved by the time of the submission. We are selling in Europe, and intend to increase the rollout. Once launched in the U.S., we are confident that our current customer base or readily adopt the new assay. More broadly, our integration work has uncovered greater potential cross-selling opportunities for triage through our global sales team than initially anticipated in our synergy plan.\n\nIn our Labs business unit, we launched seven new assets globally in the quarter. Most notable was the OUS launch of hemoglobin C, which has seen very strong demand and significant opportunities in our sales funnel. We expect to launch in the U.S. in the second half of this year.\n\nAdditionally, we have continued to support several studies with our COVID IgG quad assay, demonstrating the correlation of our assay to neutralizing antibodies, as well as a larger CDC study focused on population antibody levels, and breakthrough infections. We believe these studies could better our understanding of immunity and may help inform public health recommendations related to COVID vaccination and precautions in the future. Turning to transfusion medicine, we're seeing strong growth following the completed refreshment of our transfusion medicine portfolio last year. We are pleased to announce that QuidelOrtho reached a major milestone vision placements by surpassing 5000 installations globally during the quarter.\n\nThis milestone is a testament to our technology service and thought leadership in transfusion medicine. We are dedicated to providing best-in-class technology and solutions in this area. Lastly, in Molecular Diagnostics, we continue to march forward secured global regulatory clearances for our Savanna molecular multiplexing platform. Our limited European launch of Savanna with RBP4 continues to go well with some early wins.\n\nAs manufacturing capacity ramps, we planned a full European launch in Q4, followed by 2023 menu expansions. Stateside, we completed the Savanna [inaudible] submission with RBP4 in May, and continue to make progress toward [inaudible] submission expected this year. We expect that that submission will be followed by 510 case submissions for four additional panels in 2023. Looking at global commercial excellence, our third strategic priority we're firing on all cylinders to advance commercial excellence across multiple channels.\n\nWith a relentless focus on base business execution, we are exceeding our revenue synergy targets at this time. We've kicked off cross-selling of our combined product portfolio to our global commercial teams. With a fresh prioritization of OUS opportunities crystallized through our expanded commercial team. Specifically, we have initiated go-to-market programs in both the U.S.\n\nand China to reflect the new combined capabilities. Overall, our commercial integration efforts are accelerating our near-term value creation by identifying quick win opportunities by country and region, in ways to make the best use of our in-market organizations along with existing distributors. As such, we believe we are on track to deliver on our 2023 revenue synergy target. Implementation of Ortho's Commercial Excellence Program across our entire QuidelOrtho is well underway.\n\nWe track multiple key performance metrics to enable us to deliver our products, promises, and a customer experience that is second to none. And the results we see are compelling. We're driving market penetration of our integrated clinical lab instruments, and enabling the pull-through of recurring revenue. In the process, our lab business has gone from low single-digit to mid-single-digit growth.\n\nIn the quarter, our VITROS integrated analyzer installed base grew by 12% year-over-year, including the double-digit growth in Europe, Middle East, and Africa, China, and our other U.S. regions, and high single-digit growth in North America. Customer-centered service and follow-through are key components of our commercial excellence strategy, and have been central to the Quidel and ortho cultures long before the combination. Our ability to provide quality customer service is critically important and highly valued across our customer base.\n\nTo this end, I am pleased to announce that last week, we were ranked first for the seventh consecutive time in the Service Track Clinical Laboratory Survey for Integrated Systems, which includes the top ranking in customer service and overall system performance. We were also recognized as number one in overall service performance for chemistry, and amino acid systems. Importantly, as part of the ranking, service track records a net promoter score for each of the vendors, QuidelOrtho score was 20 points higher than our next closest competitor. Highlighting that this is a first-class service organization, which along with lengthy meantime between service calls and our VITROS analyzers, is a competitive advantage, which portends well for QuidelOrthos' growth in this category.\n\nIn terms of the OTC space, we continue to strengthen our positioning throughout our QuickVue at-home OTC COVID 19 tests. During the first two years of the pandemic, we scaled our U.S.based manufacturing capacity exponentially, and now have the automated production lines and trained personnel to produce millions of QuickVue at-home tests a month on the low end, and ramping [inaudible] to tens of millions of tests in a matter of months. While we have adjusted our capacity, and contingent employees to support softer demand at the end of the first quarter, we have maintained capacity as part of our warm base manufacturing initiative, and recently began to ramp up production, giving us the ability to respond to demands of our customers and the U.S. government as caseloads change.\n\nWe have the relationships in place with retailers so that as these new variants become more prevalent, we expect to have competitive shelf space. We are currently working with CVS, Walgreens, Amazon, and other major retail distributors on ways to expand our availability, and are excited that QuickVue recently became available via Amazon Prime. We also sell through over 5000 independent pharmacies via our partnership with McKesson, and are continuing to pursue additional partnerships with institutional and government agencies through advanced testing accessibility. We did complete the 108 million test U.S.\n\ngovernment contracts in the second quarter, and discussions with the U.S. government are ongoing. But we are including further government orders and revenue expectations at this time. Turning now to operational excellence.\n\nThis is a bit of a soup-to-nuts category, but I'd point you to a metric that is both a roll-up and a single data point to watch. We believe we are on track to deliver a third of our targeted $90 million cost synergies in 2023. We are well on our way with competitively bidding insurance and Odyssey's, technology agreements, and indirect sourcing consolidation, and eliminating duplicate costs as we bring the businesses together. Our cost synergy target does not include the $45 million in interest expense savings that we have secured.\n\nAchieving our cost synergies is critical to our integration planning, and accordingly, the Board and I decided to hire a chief administrative officer to run the integration, and strategically build on our corporate culture. We want to build our brand reputation so that we are an employer of choice, able to attract and retain talented people for all levels with engaging and rewarding careers, keeping people happy, and engaged, and productive. These are all areas on which our chief administrative officer is focused. Strengthening our supply chain as another operational priority to help meet our customer commitments.\n\nGiven our experienced supply chain team, coupled with our strong balance sheet and cash flow, our capacity to stabilize our supply chain and inventories could become a differentiated capability that we would leverage to compete in the marketplace. If we make it a priority and a must-have, it could potentially make supply chain a competitive advantage. All companies are facing supply chain challenges, but not all will be able to address them equally. Regardless of location, figuring out how to leverage our plants and equipment to drive our business for it is a priority.\n\nRight now, for a number of products, there is more demand and we have been able to meet, and we are working to hire a new team throughout all our factories to step up capacity. For example, we know there is more demand for clinical chemistry, consumables, integrated instruments, and Savanna than we have been able to produce. And while production is ramped, we are managing our customer contracts and expectations based on our ability to deliver instruments with the availability of [inaudible] as well as the availability of consumables. Again, building out redundancy across our supply chain is so important as we believe it could turn into a competitive advantage, allowing us to meet elevated demand when our key competitors may not.\n\nLast but far from the list on our list of strategic priorities, as can capital deployment. From this standpoint, our strong balance sheet and cash generation give us the flexibility to allocate funds toward several strategic priorities. We look at our capital deployment opportunities in five buckets, investing in R&D, manufacturing capacity expansion, debt paydown, share repurchases, and strategic M&A. Investing in our business is critical to our growth, which is why investing in R&D and in our manufacturing capacity are our top capital deployment priorities.\n\nWe are investing in R&D, both supporting menu expansion across our platforms, while also driving development of innovative new instruments and technologies. We are also putting money into building additional manufacturing capacity to meet demand for our broad portfolio, including Savanna and consumables for our VITROS analyzers. The next item is debt pay down. The combination of Quidel and Ortho was structured such that we have a very attractive debt profile, which we intend to improve over the coming years, as we work through our current integration plans.\n\nAlso under consideration, as returning capital to shareholders via a share repurchase program. Strategic M&A is our lowest capital deployment priority, but we will consider the right opportunities as they present themselves. We will continue to be very selective and opportunistic, valuing the right organizational fit as our main criterion. If we execute on all five of these strategic priorities, we believe that we will be better positioned to drive innovation, support long-term growth, and unlock shareholder value.\n\nIn closing, I'd like to thank all the QuidelOrtho team for their incredible work and commitment to bring us to this point. We have many opportunities ahead of us to continue driving improved outcomes for our patients across the globe, as we expand our portfolio, extend our reach, and make progress in integrating our organization. I look forward to advancing this mission to drive long-term growth for our business. With that, I'd like to turn the call over to Joe, to further discuss our Q2 financial results and 2022 guidance.\n\nJoe.\n\nJoe Busky -- Chief Financial Officer\n\nThanks, Doug. Good afternoon, everyone. I'll begin with a bit more detail on our operating results for the quarter. As mentioned previously, to facilitate a comparison of the company's operating performance from the second quarter of 21 to the second quarter of 22.\n\nAll figures that I referenced are presented on a supplemental combined basis. As Quidel and Ortho have been combined for the applicable periods and may be referred to as supplemental combined information. So starting with a breakdown of revenue on slide 13. In the second quarter, we recorded revenue of $899 million, an increase of 38% in constant currency.\n\nCurrency translation decreased sales growth by 320 basis points, resulting in 34% total sales growth. Revenue growth was primarily driven by the strong recurring revenue pull-through on our broad instrument portfolio, serving the diagnostic continuum, as well as QuickVue sales to government and retail customers. In the second quarter of 22, we generated $298 million COVID-related revenue. So excluding the COVID-related revenue, total revenue increased 9% in constant currency driven by point of care and molecular diagnostics.\n\nLooking at year to date, total revenue was up 57% in constant currency to $2.4 billion. Again, excluding COVID-related revenue, total revenue increased 11% in constant currency. Turning to our Q2 performance by business unit, point of care revenue being 181% in the quarter, and grew 19% excluding COVID-related revenues. This is largely driven by the pull-through of our broad respiratory menu.\n\nLabs revenue, which includes ortho clinical labs, and non-core revenue, as well as Quidel specialized diagnostic solutions, grew 3% in the quarter, and grew 6% excluding COVID-related revenues, largely driven by [inaudible] revenue. Transfusion medicine revenue grew 9%, driven by strengthened donor screening, notably plasma, which is a smaller market but growing at roughly twice the blood market. Molecular diagnostics revenue declined 40% in the quarter, but grew 45% excluding COVID-related revenues, largely driven by strength in our Savanna and Atlanta product lines. Now turning to our quarterly performance by geography, on a constant currency basis.\n\nNorth America revenue grew 59%, EMEA grew 6%, China grew 25%, and other regions, which include Latin America, Japan, and other Asia-Pac markets, grew 2%. Excluding COVID-related revenue, North America revenue grew 16%, EMEA grew 8%, China declined 10%, and other regions grew 5%. North America, our largest geography by revenue, delivered strong growth driven by point of care, labs, and transfusion medicine. Point of care was particularly strong due to the shipment of the last 35 million tests to the federal government, pursuant to our 108 billion test contract.\n\nHowever, we were still grew [inaudible], excluding COVID-related revenue driven by pull through of respiratory revenue on our large Sofia installed base, as well as strength in clinical consumables, and thermal screening. In EMEA, strong growth was driven by labs. Strength was particularly notable, [inaudible] across Western Europe, as well as Eastern Europe, and Middle East. In China, our team executed exceptionally well despite the numerous macro challenges, including COVID 19 lockdowns that continued longer than expected in the quarter, as well as localization, and more onerous import application requirements.\n\nLooking ahead, we continue to monitor the situation closely for further outbreaks and regional lockdowns. China is a very profitable market for us and is a big investment area for us. As evidence of this, we are in the process of expanding our footprint with both analyzer and assay partnerships, with the goal of providing a local manufacturing presence in the near term. Now, looking at our revenue by category, recurring revenue, which includes reagents, services, and other consumables, grew 1% and was up 9% excluding COVID-related revenue.\n\nDriven by across-the-board strength and menu [inaudible] instruments. Quick Vue revenue grew 756%, largely driven by COVID 19. Instrument revenue grew 2%, which is an improvement from the first quarter. But open less instrument orders due to global supply chain challenges are relatively flat sequentially and approximately 600 instruments.\n\nNow turning to Slide 14, I'd like to comment on our second quarter financial performance versus the prior year. Again, on a supplemental combined basis, we delivered a strong quarter performance below the top line, with improvements in gross margin, operating expenses, and free cash flow in the quarter. Profit margin for the quarter was 53.6%, which is an 80 basis point increase versus prior year due to volume growth, mix, and positive pricing in both labs and transfused medicine, Partially offset by lower margin on COVID-related revenue, including a $25 million QuickVue inventory reserve recognized in the quarter due to the timing of a government order. Moving down to P&L, R&D expenses increased 2% year-over-year, indicative of our investments [inaudible] platforms and revenue expansion, including for necessary global regulatory clearances.\n\nSales, marketing, and administrative expenses were flat, as operational improvements offset the distribution cost increases, including COVID-related expenses. As a percentage of revenue, sales, marketing, and administrative expenses decreased by 100 basis points year-over-year to approximately 22%. Adjusted EBITDA grew 75% to $291 million, and adjusted EBITDA margin expanded 760 basis points year-over-year to 32.4%, largely driven by the previously mentioned drivers of gross margin and efficient operating spending. Net interest expense for the period was $29 million, which is a decrease of $4 million as anticipated due to lower interest rates, partially offset by the increases in the average outstanding debt balances related to the combination.\n\nOf provision for income taxes was $63 million compared to $13 million for the prior period. And on a supplemental combined basis, our adjusted earnings per fully diluted share for the second quarter increased 123% year-over-year to $2.12, driven by the increase in our COVID 19 volumes, and our solid operating performance as well as lower interest expense. The previously mentioned QuickVue inventory reserve actually reduced adjusted EPS by $0.28. Turning the cash flow and balance sheet by slide 15.\n\nIn the second quarter, and on a GAAP basis, we generated operating cash flow of $225 million. After funding $26 million in CapEx and adding back $80 million in acquisition-related costs, we estimate recurring free cash flow to be $279 million. We ended the quarter with cash, cash equivalents, and marketable securities of $446.7 billion, and total debt of $2.7 billion. We ended the quarter with a $1.1 net debt to EBITDA leverage ratio on supplemental combined basis, and its covered revenue declines to an endemic level of revenue over the coming year, we expect leverage to increase to roughly two times.\n\nSo now turning to our outlook for the remainder of the year on slide 16. First, I'd like to provide some broader context on our full-year 2012 guidance. The point of care market is showing signs of strength, which we expect to continue to translate into strong non-COVID recurring revenue, both in our large installed base Sofia instruments. We expect to last in transition [inaudible] businesses, excluding COVID-related sales, combined to grow mid-single digits.\n\nSavana sales in Europe are expected to drive growth within our molecular diagnostics business. China continues to be important growth driver for our business, and we expect recurring revenues to grow mid-single digits. However, instruments are expected to be soft due to previously mentioned lockdowns and by local requirements. Inflation and global supply chain disruptions continue to be a challenge.\n\nWe are seeing greater access to semiconductor chips, and expect challenges to further ease as we move through the back of the year and into 2023. So in light of all these dynamics just mentioned, we are introducing supplemental combined fiscal year 22 guidance as follows. First, revenue, excluding COVID-related sales, is expected to grow 6% to 9% on a constant currency basis to $2.49 to $2.57 billion. Next, we expect COVID-related revenues to be $1.9 to $1.34 billion in 2022, including $1.15 billion in the first half of the year.\n\nAnd that compares to $1.3 billion recognized in fiscal 21. Total revenue is expected to grow 3% to 6% on a constant currency basis to $3.78 to $3.91 billion. Adjusted EBITDA is expected to be $1.38 to $1.45 billion, representing the margin of 36.5% to 37%. And finally, adjusted diluted EPS is expected to be $11.08 to $12.75 based on full-year diluted weighted average share count of $68 million.\n\nIn addition, I'd like to provide assumptions that likely will be helpful for modeling purposes. At current rates, currency translation is expected to decrease full-year sales growth by 150 to 200 basis points. We expect flu-related revenue to be $200 to $260 million in the full year 22, including $121 million in the first half of this year, compared to $72 million for fiscal year 21. And given the seasonality in our business, including our above expectations for flu, the fourth quarter is expected to grow at least 20% over the third quarter.\n\nNote that there are no differences in the number of billing days in 22 compared to 21. Net interest expense is expected to be in the range of $118 to $123 million, with most of the decrease versus prior year from the fourth quarter run rate to be in the second half of 22. We are expecting a tax rate for the full year of approximately 25%, and given our $1.2 billion internal wealth, we expect an approximate $20 million savings on cash taxes this year, and $40 to $50 million on an annualized basis. In the second half of the year, we expect adjusted free cash flow to be $130 to $180 million.\n\nWith that, I'll turn the call back over to Doug to make a few summary comments.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nThanks, Joe. And summary, we had a strong quarter. The integration is going well, and we're even more excited about the growth opportunities ahead. To provide investors with deeper insights into our business, and our key growth initiatives, I'm pleased to announce that we plan to host an Investor Day on the afternoon of December 13th, 2022, in New York City.\n\nI look forward to engaging with you in that forum, which will include in-depth management presentations and opportunities for Q&A and informal interaction with the management team. More details about that event will be forthcoming, but please save the date on your calendars. And with that operator, we are now ready to open the call for questions.\n\nOperator\n\n[Operator instruction] Our first question is from the line of Brian Weinstein with William Blair. Please proceed.\n\nDustin Scaringe -- William Blair and Company -- Analyst\n\nHey, guys, this is Dustin on the line for Brian. I know you provide us with full-year guidance and some color on the fourth quarter, but I'm wondering if you could provide a little bit more detail on the different business segments as we move to the third and the fourth quarter. How should we expect those to move relative to the second quarter, up or down sequentially? Any additional insight that would be helpful. Thank you.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nI'll just start by saying we're not going to provide a lot of detail here, but I think it's safe to say that for both companies, Q3 is typically a softer quarter. And so we're looking more at sharing with you what we expect for the total for the second half. And I think that's the guidance that you've provided. And then what else would you add, Joe\n\nJoe Busky -- Chief Financial Officer\n\nI think that covers.\n\nDustin Scaringe -- William Blair and Company -- Analyst\n\nGot it. Great. Thank you. I guess as you provide the guidance for 22, just wondering how you guys are thinking about next year.\n\nI know there's certainly a lot of variables of color coming out of the business, and certainly have a lot of macro headwinds on their hand. But if you could talk about the setup for next year, just where we should be thinking about numbers and where the different businesses can go?\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nYeah, at this stage what we see is that we should be able to deliver on the cost synergies that we suggested, and that does not include the $45 million of interest rate, interest expense excuse me, reduction annually. On the revenue side, provided that we can manufacture the instruments that we have in the forecast, we feel very comfortable both on the clinical chemistry, and immunoassay systems as well as on the Savanna. And what I would point to I think generally is to the S4, in those forecasts and suggest to you that those are solidly intact. What else would you?\n\nJoe Busky -- Chief Financial Officer\n\nI would just add that it will reiterate what we've said about 2023 and beyond that the top line number ex-COVID, will be in the high single-digit to low double-digit range. And we believe that the COVID revenue, once it gets into an endemic stage as we move into next year, will be in that $150 to $200 million range annual revenue [inaudible]\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nWhich wouldn't necessarily capture the ABC combo revenue. But that would be added to the $150 to $200 grand.\n\nDustin Scaringe -- William Blair and Company -- Analyst\n\nGreat. Thank you for taking the questions.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nOh, you're welcome.\n\nOperator\n\nThank you. The next question is from the line of Jack Meehan with Nephron Research. Please proceed.\n\nJack Meehan -- Nephron Research -- Analyst\n\nThank you. Good afternoon. I really appreciate all the color in the [inaudible] and released today. I wanted to start with a question for Joe or Doug on the guide here.\n\nSo the 118 to 175 EPS. So you did 204, I'm sorry, 804 in the first quarter, 212 in the second quarter, by my math, that's a buck 64 to 259 in the second half of the year kind of annualized, 328 to 518. Is that am I thinking about it the right way in terms of like starting to build 2023, and layering on some of the cost synergies and maybe growth? Just any color around, starting to think about where 2023 EPS might come out would be helpful.\n\nJoe Busky -- Chief Financial Officer\n\nHi, Jack, it's Joe. Yeah. I don't want to get too much in 2023 other than what we just getting to the previous question. But when you look at the guidance for 22 that we just gave, keep in mind in the comments I made about the Q3, Q4 seasonality, Q3 is it's historically a seasonally no quarter for both sides of the business on Ortho as well as Quidel.\n\nAnd so you'll see, you know the [inaudible] share that second half EPS fall into Q4 versus Q3. And again, as far as 2023, as you think about the cost base, I do think that you can use the cost base on a supplemental combined basis in the operating expenses that we've given to you in the information we sent out a month or so ago, as well as within the release today, you can use that as a guide for the second half operating expense. And even as a jumping-off point as you move into 23 and then all the synergies, the impact of the synergies offset off that base, we're running out right now for operating expense.\n\nJack Meehan -- Nephron Research -- Analyst\n\nOK. Second question on Sofia, and I'm sorry if I missed this during the script, just what were the Sofia sales in the quarter? And I know Doug and Joe, you talked about just confidence and kind of broader utilization long term, if there's a color you can provide around, just what you're seeing in the field, on Non-covid testing on Sofia. Any updates would be great on it.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nYes, thanks, Jack. It's a really intuitive question. When you back out COVID 19 and look at the Sofia business, you know, what does that look like? And what we see on a comparison year-over-year is a difference of about 25%. So we're up 25% in revenue on a trailing 12 on the Sofia business, about 25% over the prior year.\n\nJoe Busky -- Chief Financial Officer\n\nAnd Jack, if you just take that a step further, [inaudible] break it into price and volume. When you look at price, Jack, it's the price is up slightly. It's flat up slightly, which means that it's primarily all volume. And you're looking at the pull through [inaudible] it's almost all volume.\n\nSo it's a really good sign for us on that trailing 12-month basis.\n\nJack Meehan -- Nephron Research -- Analyst\n\nJust one clarification on that 25%, how much of that is coming from ABC? Are there any other tests that are standing out as you look at the utilization?\n\nYeah. And then that last question, just to be clear on the savanna timeline, it sounds like 510 K approval. Is that looking more like 2023 now? Just any comment on sales in the quarter there? Thank you.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nYeah. We're going to enter this product in Europe on a full launch basis. So obviously, we have [inaudible] way for the U.S. We expect to have the vaccine cadence mentioned down by the end of the year for sure.\n\nJack Meehan -- Nephron Research -- Analyst\n\nThank you Doug.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nWas that your question?\n\nJack Meehan -- Nephron Research -- Analyst\n\nWell, you'll have the submission.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nYeah. We submitted [inaudible] RBP4 in May. And then we've been working on the 510 K since. So we expect to have that in before the end of year.\n\nJack Meehan -- Nephron Research -- Analyst\n\nAnd then but then it's like a 90-day. Well, historically, it's been like a 90-day review after that. Right?\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nYeah. But remember the pressure that the FDA is under with a huge workload. And we don't know exactly what all the requirements for 510 K [inaudible] may be at the end of the day until we get into interactive discussions with the [inaudible] So, you're right, 90 days is typical. I think the FDA is pretty darn good job on these high-priority products.\n\nBut, our business guys, I'm sure, would like to have a little cushion, but I don't think we're going to be greatly delayed if we realize enough.\n\nJack Meehan -- Nephron Research -- Analyst\n\nOkay. Sounds good. Thank you, guys.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nSure.\n\nOperator\n\nThank you. The next question is from the line of Andrew Cooper with Raymond James. Please proceed.\n\nAndrew Cooper -- Raymond James -- Analyst\n\nHey, everybody, thanks for the question. Maybe first on the financial, I'm just thinking about the longer-term target you laid out when the deal was first announced, the 30% EBITDA on margin target. Obviously, some things have changed on the inflation side, and just the overall cost side, as well as the tax side. So how do we think about that? That [inaudible] had changed at all.\n\nAnd then if there's any difference to the timeline as to get there, and anything related to that, would be helpful.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nWell, Andrew, your question is certainly timely. We were talking about this just a couple hours ago. Yeah, there are some moving things that we're having to evaluate. So then the question is, can we achieve more cost synergies than we saw before? I think what I would say is, even if we can't get to greater than 30%, EBITDA in 2023 if we cannot, but we're still not changing the target for the time frame.\n\nWe're still going to work to try to get back over 30%. I don't think that that's an inappropriate goal. So but you are right, there's a lot of factors, including, how much product can we make when we can, what if any regulatory hurdles get in our way, what's happening with on the supply chain side with costs because of inflation. These are all factors that obviously, we're not known to be necessarily modeled on.\n\nBut we still firmly believe we can get there. When you say that's true, Joe.\n\nJoe Busky -- Chief Financial Officer\n\nYeah, I agree. I certainly not coming off the 30%, but our margin, and when you do the math on the guidance we gave you, you'll see that the second half, even our margins are below that 30% target. But that's because, again, the business is seasonal low in Q3, and that's historically been the case for years for both businesses, and then Q4, you got to remember you've got a heavier load of instrument revenue that typically comes through in the fourth quarter, though, margins down a bit. So when you look at the second half versus say a full year, that's probably going to be most of our lowest EBITDA margin quarters.\n\nAnd as you move into 23, not only do you get the cost synergy tailwind that Doug mentioned, but you're also going to get the tailwind of the growth on Savanna, as that ramp, and that launch continues, and that revenue continues to grow, that is going to drive some GP, and some of our margin tailwinds to march itself closer to that 30% or over that 30%.\n\nOperator\n\nThank you. Our next question is from the line of Casey Woodring with J.P. Morgan. Please proceed.\n\nCasey Woodring -- J.P. Morgan -- Analyst\n\nHi, guys. Thanks for taking my questions. So I know estimates are sort of all over the place right now with pro forma numbers, but it looks like EPS came in below expectations. And when accounting for that inventory reserve dynamic.\n\nI think that's likely due to QuickVue margin assumptions. So can you maybe help us think about what the drop-through is there now is likely pricing has come down versus where you may have been modeling prior?\n\nJoe Busky -- Chief Financial Officer\n\nSo, Casey, just to reiterate.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nSuggesting EPS is kind of.\n\nJoe Busky -- Chief Financial Officer\n\nYeah. So, the QuickVue, the inventory reserve that we mentioned, the $25 million, net of tax, that's $18 million of a hit. So to take impact on the quarter. So obviously if you remove that, we would have exceeded expectations on a lot of fronts.\n\nNow that reserve, depending on what happens with second half corporate revenue, could come back. I'm not saying it will, but it could.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nBut I like that we've covered both sides. We said it doesn't happen. We've got a reserve to take care of the absolute inventory. But on the flip side, we also said ramp up because, we've been strongly encouraged to keep manufacturing products, which we will do.\n\nSo any event, we're going to be well placed as we move forward. But there is a potential that we don't need that, right? \n\nCasey Woodring -- J.P. Morgan -- Analyst\n\nGot it. And then just on the clinical labs business. So just curious on if headwinds in China and the Non-covid piece have subsided here in 3Q. And if anything is being contemplated for lockdowns in the back half of the year? And then on that open order comment to 600 instruments, I'm curious on what labs would have grown if you could have killed those open orders.\n\nThank you.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nYeah. So you're right, we do have a number of open orders, I would say, just generally before flipping over to Joe. My impression is that the Chinese team as well is pretty nicely the lockdown and all that. And we also have plans in place to make sure that we can compete with the changes, and whatever requirements for local manufacturing, etc..\n\nBut have you done the math in your head already? I was just trying to give you an idea of that.\n\nJoe Busky -- Chief Financial Officer\n\nYeah, actually, we try to hit both of them quickly because were running out of time. We have in the guidance we provided, anticipated more caution on future lockdowns in China, as well as by local movements in the country that's potentially impacting revenues. So all this factored into the guidance. The other thing you need to keep in mind is that the vaccine deal is impacting revenue in our China market, too.\n\nSo if you look at the Q2 numbers that we've just presented, we show that the China market was down 10% constant currency in the second quarter. If you were to take out the back end, impact should be up low single-digits. So that has a big impact. And again, that's no impact on the margins.\n\nIt's just a revenue play. So just keep that in mind as well. And when you're installed base or your insurance backlog question, you would have added about two points of growth into the numbers have been able to get all of them.\n\nOperator\n\nThank you. Our last question is from the line of Alex Nowak with Craig-Hallum. Please proceed.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nOK. Good afternoon [inaudible] ABC combo first. This is going to be the first potentially normal respiratory season in a long time. Just how are the point of care customers approaching it this year? Is the expectation that if they have associated they're going to be ordering ABC combo? Are you starting to see any purchases ahead of that season yet and maybe any status of the ABC OTC product?\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nYeah. I think we see evidence, Alex, that this is a viable product in that space. We certainly saw ourselves with the product, and we are building products now with that expectation. So who knows with flu? But at the end of the day, there's certainly a concern at the government level that there's going to be flu in the back half of this year.\n\nSo that's what we're planning on, and that's what we're saying early on in terms of demand. All that are returning to that crazy demand that we saw in Q4 2021. No, but I do think there's realistic demand for the product.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nOK. Understood. And then on the R&D budget. You mentioned all the systems just go in the pipeline here.\n\nIf you had a name of top one or top two projects, and then major expansion, Savanna, maybe expand your cardiovascular Ortho, just what is the first or second projects that the main priority for the combined business?\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nOh, there's a lot of priority ones. For example, to start on the transfusion medicine side, we know that to be competitive longer term in that space, we need to provide better solutions. And so we've got a project internally that we've been calling [inaudible] and that's progressing. That's probably a third I think of that R&D budget is on that project alone.\n\nSavanna clearly spending what's necessary to make the transfer from R&D into manufacturing that scale is a big lift, and a big effort as well. And don't forget also we've got Project Leapfrog running in the background too, which is our next-generation amino acid platform. So there's three or four big hitters. So I just stop there because I realize we're getting to the end here.\n\nGo ahead, please. Operator.\n\nOperator\n\nI was going to turn it back to Douglas Bryant for closing remarks.\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nGreat. Perfect timing. So in conclusion, Q3 was our first quarter report as a combined company. It was certainly fun put in the call together this quarter for sure.\n\nNo matter how you slice it, this stands out as a strong quarter across our commercial, corporate, and cultural metrics. We came in with a roadmap, and these results underscore our ability to execute on strategic plans. There's a lot of talent in this organization. Achieving our expected cost and synergies, and revenue synergies will be a three-year marathon.\n\nIt's not a one or two-quarter sprint, but we believe our current pace is exceeding our plans. The necessary pieces are here and match the fit that we anticipated, and as I had mentioned earlier, the cultural chemistry is even better than I expected. I'm encouraged, our team is excited, were moving forward with purpose and confidence, happy and [inaudible] that were making a difference in human health, and equally important in our people. On behalf of our entire management team, I like to thank you for your continued support, and interest in our new combined QuidelOrtho.\n\nWe look forward to sharing our journey with you. Thanks and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBryan Brokmeier -- Vice President, Investor Relations\n\nDouglas Bryant -- Chairman and Chief Executive Officer\n\nJoe Busky -- Chief Financial Officer\n\nDustin Scaringe -- William Blair and Company -- Analyst\n\nJack Meehan -- Nephron Research -- Analyst\n\nAndrew Cooper -- Raymond James -- Analyst\n\nCasey Woodring -- J.P. Morgan -- Analyst\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nAll earnings call transcripts"
}