{
  "companyName": "Amarin",
  "companyTicker": "AMRN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/amarin-amrn-q3-2022-earnings-call-transcript/",
  "content": "Amarin (AMRN 0.83%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:00 a.m. ET\n\nOperator\n\nWelcome to Amarin Corporation's conference call to discuss its third quarter 2022 financial results and operational updates. This conference call is being recorded October 27, 2022. I would now like to turn the conference call over to Lisa DeFrancesco, senior vice president, investor relations and corporate affairs at Amarin.\n\nLisa DeFrancesco -- Senior Vice President, Investor Relations\n\nGood morning, everyone, and thank you for joining us. Please be aware that this conference call will contain forward-looking statements that are intended to be covered under the safe harbor provided by the Private Securities Litigation Reform Act. We may not achieve our goals, carry out our plans and intentions or meet the expectations disclosed in our forward-looking statements. Actual results or events could differ materially, so you should not place undue reliance on these statements.\n\nWe assume no obligation to update these statements as circumstances change Our forward-looking statements do not reflect the potential impact of significant transactions we may enter into such as mergers, acquisitions, dispositions, joint ventures or any material agreements that we may enter into, amend or terminate. For additional information concerning the risk factors that could cause actual results to differ materially, please see the Risk Factors section of our annual report on Form 10-K for the year ended December 31, 2021, and our Form 10-Q for the quarter ended September 30, 2022, which have been filed with the SEC and are available throughout the investor relations section of our website at www.amarincorp.com. We encourage everyone to read these documents. This call is intended for investors in Amarin and is not intended to promote the use of Vascepa.\n\nAn archive of this call will be posted on Amarin's website in the investor relations section. Karim Mikhail, Amarin's President and chief executive officer, will lead our discussion; and Tom Reilly, Amarin's chief financial officer, will provide a more detailed review of our third quarter 2022 financial results. After prepared remarks, we will open the call to your questions. I remind you that multiple audiences typically listen to calls of this nature, including existing investors, potential new investors, employees, current and potential collaborators and current and potential competitors.\n\nAs always, in this call, we will attempt to provide constructive information without compromising our competitive and strategic positioning. I will now turn the call over to Karim Mikhail, President and chief executive officer of Amarin. Karim?\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nThank you, Lisa. Good morning, and thank you all for joining us today. We began this year embarking on a bold strategy to grow and expand globally. We focused our three-dimensional growth strategy, breadth or geographic expansion, height representing diversification and depth or core operational evolution.\n\nNow with 2022 needing a close and despite the significant headwinds and challenges faced early in the year, we are pleased to report that we made significant progress across our key priorities, and we continue to achieve what we committed to. Most importantly, we have turned around our cash burn levels as we strengthened our foundation through operational excellence, strengthened our leadership team and laid the groundwork for a true transformation of Amarin in 2023. I'm going to begin today by discussing the results of our cash preservation initiatives because I believe this progress is significant and critical to support our future growth and expansion plans. There are two key initiatives that were central to our efforts and the progress delivered.\n\nFirst, in June, we took swift action announcing an extensive cost savings plan to reduce our operating expenses by $100 million over 12 months. This initiative was comprehensive and involved cost reductions across the entire organization, and we are beginning to realize these savings this quarter exactly as planned. Second, beginning last quarter and as part of our companywide focus on operational excellence, we took steps to evolve our supply chain strategy and amend our supplier agreements to align supply arrangements with current and future demand within our U.S. business.\n\nThese initiatives, which Tom will discuss in more detail shortly, have resulted in significantly lower cash burn quarter over quarter. In fact, this quarter, we are cash positive, excluding restructuring charges. Also contributing to the improvement of our cash runway is the consistent stabilization of the U.S. revenue over the last three quarters despite continued pressure from additional generic competition.\n\nWe achieved this by refocusing our core U.S. team efforts to sustain and support the Vascepa brand. Additionally, and as a result of the difficult decisions made at the right time to reduce commercial footprint in the U.S., we remain highly profitable, supporting future international growth. As I look at our third quarter results and in the U.S.\n\nbusiness, I'm pleased to say our strategy is working. In the third quarter of 2022, we recorded $89.9 million in total net revenue, including $87.9 million in U.S. product sales, largely unchanged from last quarter despite the continued pressure from generic competition and the restructuring effort we announced in June, which reduced our sales and marketing efforts and commercial footprint in the U.S. significantly.\n\nThis is now the third consecutive quarter with relatively consistent revenue performance despite continued generic competition, which is unprecedented in the industry. And the third quarter performance was achieved with a more efficient footprint and resources, which speaks to the strength and efforts of the for U.S. team. Our steps to focus on promoting our brand are working.\n\nBased on the latest prescription trends, we are maintaining current share at roughly 60% of the total IPE market on a quarterly basis. We will continue to closely monitor the market dynamics in the U.S. and remain ready to adjust as necessary whatever possible. With the stabilization of the U.S.\n\nbusiness and the bold cash preservation actions we have taken, we have successfully extended our cash runway to ensure we can fund our expansion plans. While I began today's discussion with the recent actions dedicated to strengthening our financial foundation and preserving our U.S. revenues, we remain laser focused on our core future objective, which is global growth and expansion for Vascepa/Vazkepa in Europe and internationally, as this is the key to shareholder value creation. 2022 has been about playing the foundation for our future across Europe, and we are now beginning to see the take shape before our eyes.\n\nWe are now officially on the market and in commercial launch stage in the U.K. and Sweden. We recently received final positive national reimbursement in Finland and Northern Ireland at a price in line with our recent U.K. pricing.\n\nWe also received individual reimbursement in Austria with a process underway for national reimbursement. Although there are no set time lines in any of the remaining major markets, we are now negotiating reimbursement and are now in the advanced stages in all markets. In particular, price negotiations are nearing conclusion with Spain's Ministry of Health, which could allow for a possible pricing and reimbursement decision shortly before the end of 2022. In the Netherlands, we received a positive scientific assessment by the National Healthcare Institute, Zin for reimbursement and are beginning pricing negotiation with the Dutch Ministry of Health.\n\nIn Italy, we achieved a key milestone of a positive scientific assessment, allowing for our dossier to advance from the scientific assessment phase into the pricing and reimbursement negotiation phase with the Italian authorities. Our strategy has always been around building a strong, diverse and sustainable revenue stream in Europe. This is why we have filed in 13 markets simultaneously since 2021 and are now in the mid to late stage reimbursement negotiations in France, Italy, Spain, the Netherlands and Norway. This progress thus far and specifically the level of reimbursed net price we have received acknowledges the value of Vascepa and our ability to demonstrate this value to payers across Europe.\n\nTurning to commercialization efforts in Europe. In the U.K., our launch is underway since mid-October and is progressing well and in line with our expectation based on our deep understanding of the market. To provide some context on the U.K. market and how it operates, there are three distinct tiers of healthcare administration in England.\n\nNHS England or the National Health Services, which provides guidance on usage. Next, the integrated care systems are consolidations of organizations that plan for service delivery and funding. The final tier are local accounts with formularies, which list the reimbursed products. As you recall, since receiving our final approval in July, we have been following the typical process while we await approval for public funding.\n\nWe spent the first 90 days post approval focused on gaining formulary access through education, medical and scientific engagement, implementing formulary guidelines and building awareness and adoption through multiple educational and commercial channels. And we are simultaneously building a strong team in the U.K. As I mentioned earlier this month, public funding is now becoming available, and we are transitioning to the commercial focus. The number of formulary inclusion of Vascepa continues to track ahead of analogs and is improving weekly thanks to the clear step-wise approach to achieve both formulary relisting and medicines pathway inclusion.\n\nWe are proud that Vaskepa is making its way as a new standard of care to reduce the risk of CV events beyond LDL-C management in England. We will be updating investors with our U.K. performance to ensure everyone can keep track of our progress versus benchmarks over the next quarters. Turning to the rest of Europe.\n\nWe're also progressing in other major markets as well as continuing to advance our reimbursement discussions with national health authorities in Norway, Italy, France, the Netherlands, Portugal and Switzerland, where we have recently submitted and are now on file for reimbursement discussions. We remain on track to receive reimbursement decisions in up to eight countries and to launch Vasqueppa and up to six European countries this year, and we remain confident that 2023 will be the beginning of strong, sustainable revenue generation toward $1 billion-plus peak opportunity in Europe. Our progress continues beyond Europe, where we continue our plan to file in up to 20 countries through 2024. I'm pleased to say thus far, we have filed in 10 markets with the potential for a number of others before year-end and into early 2023.\n\nWe Specifically, Amarin's marketing authorization submissions for Vascepa/Vazkepa have been achieved in Hong Kong, Saudi Arabia and Bahrain, and applications remain pending in a number of other markets, including Australia and New Zealand, which are continuing to advance their local procedures. We've also confirmed that our regulatory filings are now actively under review in South Africa and other markets. This is critical as we continue our search for the right partner in all those international territories where we do not plan to build our own infrastructure. Our current partners continue to make progress as well, including Eddingpharm, our partner in China, recently stated that they have received confirmation that the Chinese government has completed the product testing and has initiated the final review period prior to approval.\n\nThis final review began earlier this month and has a clock of up to 67 business days. Our partner has communicated to us that they anticipate an approval could still be achieved before year-end. In Canada, HLS Therapeutics Inc. has obtained reimbursement from all major public payers, gaining access to the vast majority of eligible patients in Canada.\n\nThey continue to be in the launch phase in the public sector. We remain confident in the multibillion dollar global market opportunity for Vascepa/Vazkepa in Europe and internationally. And we continue to invest in our data and evidence building of IPE now with a global focus. Following a leading presence at the European Society of Cardiology Congress over the summer, we remain committed to maintaining a strong presence at important medical meetings, including the upcoming Canadian Cardiovascular Congress American Heart Association and the International Society for Pharmaceutical Outcome Research in Europe, which is a premier Congress to discuss healthcare outcomes research.\n\nOur data was selected for presentation demonstrating the cost effectiveness of Vascepa in treating cardiovascular outcomes in the Netherlands. Lastly, we continue to develop our fixed-dose combination, which ensures our ongoing progress with this important program that combines Vascepa with a stent. To summarize our progress year-to-date, we are experiencing stable business trends in the U.S., taking important steps to preserve our cash, our global expansion plans remain on track, and we are continuing to focus on building data evidence and furthering our pipeline for the future. With that, I'll turn it over to Tom to talk more about our progress and strong results this quarter.\n\nTom?\n\nTom Reilly -- Chief Financial Officer\n\nThank you, Karim. Good morning, everyone. I am pleased to report our financial performance for the third quarter of 2022. I'm glad to note when excluding the $25 million Q2 restructuring payments made in Q3, we were cash positive in the third quarter of 2022.\n\nWe -- let me begin with our revenue performance. For the third quarter of 2022, we reported total net revenue of $89.9 million, including net product revenue of $89.2 million, a decrease of 37% compared to the third quarter of 2021. U.S. product revenue was $87.9 million, a decline of only $2.8 million versus the second quarter of 2022, reflecting relatively stable trends in both volume and price.\n\nBeginning last quarter, we are not investing to grow the IP molecule in the U.S. market but are investing in sustaining and supporting the Vascepa brand and prescriber base we have today in the U.S. While we are pleased with the relatively stable trends, we expect volumes and price will continue to experience some pressure throughout this year and into next year. The results included international product revenue of $1.3 million, which includes European product revenue of $0.7 million.\n\nCost of goods sold for the three months ended September 30, 2022, was $27 million compared to $30.2 million in the corresponding period of 2021. During the three months ended September 30, 2022, Amarin continued the initiative, which began last quarter to take steps to amend supply agreements to align supply arrangements with current and future market demand, resulting in a charge of $3.1 million this quarter. The renegotiation of these agreements is a very important step in our cash preservation strategy and lowering our future inventory purchases. Excluding the impact of this item, gross margin was 73% for the three months ended September 30, 2022 compared to 79% in Q3 of 2021.\n\nMoving to operating expenses. During the third quarter of 2022, we reported expenses of $68 million compared to $124.9 million in the third quarter of 2021, a decrease of $56.9 million or 46%. The results this quarter included $4.4 million restructuring expense related to the discontinuation of operations in Germany and the third quarter of 2021 included a $14.1 million restructuring charge related to the U.S. The decrease compared to last year is related to the cost-saving initiatives that were announced in September of 2021 and in June of 2022.\n\nThese savings were partially offset by our investments in growth and expansion in Europe. Operating expenses decreased $38.5 million or 36% versus the second quarter of 2022. This is a $28 million decrease versus Q2 2022, excluding net restructuring charges and stock compensation expense. We began to realize the benefits of the June cost reduction this quarter, and we expect to continue to realize the benefit through mid-2023, totaling $100 million in savings.\n\nThe U.S. business continues to be profitable from a contribution margin perspective and provides all the necessary financial support for the expansion into Europe and other geographies around the world. Under U.S. GAAP, Amarin reported a net loss of $5.1 million for the third quarter 2022 or basic and diluted loss per share of $0.01.\n\nAs of September 30, 2022, Amarin reported aggregate cash and investments of $306 million, demonstrating a significantly lower cash burn relative to earlier quarters in 2022. We have taken significant steps to strengthen the company operationally. We plan to continue to manage our cash prudently relative to business performance. With the recent operational initiatives and the stabilized revenue trends in the U.S., we have significantly lowered our cash burn and believe our current available cash and resources, including U.S.\n\nprofitability, are adequate to support continued operations, including European launch activities. Now I will turn the call back to Karim for closing remarks. Karim?\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nThank you, Tom, for that financial overview and our results during the third quarter. I'm pleased with the results this quarter and thus far this year. We have made a great deal of progress despite the many challenges. As we look to the remainder of 2022 and into the early part of 2023, we will continue to ensure we remain operationally strong from a cash perspective dedicated to driving our global expansion plans with the launch materializing in Europe and continuing to build evidence globally to support Vascepa/Vazkepa, and we remain focused on our bold vision to stop cardiovascular disease from being a leading cause of death worldwide.\n\nAnd with that, operator, we are ready to take questions.\n\nOperator\n\n[Operator instructions] Your first question for today is coming from Michael Yee. Please announce your affiliation, then pose your question.\n\nMike Yee -- Jefferies -- Analyst\n\nHi. Good morning, Karim. It's Mike Yee from Jefferies. Can you hear me?\n\nLisa DeFrancesco -- Senior Vice President, Investor Relations\n\nWe can hear you. Hi, Mike.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nHi. Good morning, Mike.\n\nMike Yee -- Jefferies -- Analyst\n\nHey. Great. We had two questions. First, congrats on the U.S., it looks to be quite stable, which is great.\n\nCan you remind me, do you guys expect continued generics to come in at some point as supply opens up? Or do you also have exclusive contracts and preferred contracts, which is also helping. Can you remind me how that dynamic works in the U.S.? That would give us some visibility there? And then secondly is on Europe. I know that you're working on different regions and they're coming on. Can you just describe how you expect the cadence and importantly, the investment or the spend to grow there as you get through 2023? Thank you.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nOK. Thanks, Mike. So we'll start with the first question with regards to generics. Just to remind, this was a very unusual generic launch sequence -- we've had one in October of 2021, then we've had one six months later than the third one came in Q1 2022, Apotex launched in February.\n\nAnd we have also seen Teva launch the 500 milligram just two weeks of this last quarter. So we still see new generic entrants. Now so far, Teva only came with the 500 milligram, which is really 2% of the market. We'll have to wait and see when they come -- if they come with the 1 gram.\n\nI think what we can share is that even with three on the market, we've seen a stabilization of our prescription and our revenue in the first, second and third quarter of this year. So we keep tracking this. The situation is dynamic. But having said that, we feel confident that where we stand today, we did stabilize the revenue.\n\nWe are losing in low single digit in prescription and things are progressing as we plan them. Now of course, we have to be ready for any possible scenario, right? We could have different events coming up. And for that, we have multiple sort of scenarios ready. We are ready to go for an authorized generic and press on the button and immediately switch if we need be and even other plans that we could implement in that case.\n\nBut that's for the U.S. We feel confident the situation is so far stable, and we continue our efforts with our core efficient team in the U.S. Moving on to Europe. As you've seen, we have had consistent pricing reimbursement positive decisions in Europe, right? We started with Sweden at the price of $180 per month, almost 2,000 annually.\n\nThen we've had the U.K., which is far more sophisticated, more complex system that also agreed to the same price. This quarter, we announced a third country, which is Finland announcing also approval for this price and just to give even more color and detail. Finland initially rejected the five completely, and we had to resubmit from scratch, and we still got the price we asked for from Finland aligned with the other markets. So Things are progressing well.\n\nYou've just heard also that we received the positive scientific assessment from the Netherlands. We received a positive assessment from Italy, and we are in final price negotiation in Spain. So I don't want to say we're accelerating, but things are progressing in the right direction with regards to pricing reimbursement. At the same time, we are starting now commercial launches, right? We're starting commercial launches in the U.K.\n\nand in Sweden and things are progressing as planned. And we believe we will be able to share some U.K. metrics in the next quarters to ensure that all investors and shareholders are updated with our performance in Europe. Thank you.\n\nOperator\n\nYour next question is coming from Georgi Yordanov. Please announce your affiliation, then pose your question.\n\nGeorgi Yordanov -- Cowen and Company -- Analyst\n\nHi. Thank you so much for taking our questions. This is Georgi Yordanov from Cowen and Company. Maybe just to follow up on the previous question.\n\nJust on the generics. Do you have any idea or thoughts around like why their share has plateaued around that 10% to 15%. And your renegotiated supply agreement that you mentioned, does that kind of maybe provide additional capacity for those generics? And then I just have one follow-up.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nOK. So I don't know which company you really quoted as to flat in terms of generic share. I mean there -- some of them are at 15, some are at less. The reality is this is now an open market, and every generic is going after its business.\n\nSo we do not know why their share is where it is. We know what we are doing, right? What we are doing is we're fully focused on brand promotion. We're not investing $1 to grow the molecule, which ends up going to generic business, right? So that's what we're focusing on. We're making sure we have an appealing offer to our plans so that they continue to work with us because we have a sustained supply with efficient cost of goods.\n\nSo that's what we are doing. And so far, as you can see, it is working, right? We are stabilizing the erosion from a share perspective. On a quarterly basis, we are at 60%, which is great. Now what can happen tomorrow.\n\nLook, for the moment, our strategy is working. We continue to monitor. Is there enough supply for the generics, you bet there is enough supply, right? So if there is an estimate or an assumption that generics are not selling because they don't have enough supply, I can tell you, it takes 18 months to have enough supply. So we've been beyond the 18 months with generics on the market, there is enough supply beyond what anybody probably needs.\n\nSo it's not a question of supply. Now with our renegotiated arrangements, this was necessary from a cash burn perspective, right? And you see the results and the very positive impact on our cash burn because that's an initiative that's here to stay. So this is not something that you do that in a way, you eliminate cash burn for a quarter and then it's going to come back. In reality, this is going to be a stable situation.\n\nWe have enough inventory for the U.S. And we don't believe that the extra supply that's going to anybody else can really change the story because there was already enough supply on the market even before that. So that's not changing really the situation.\n\nGeorgi Yordanov -- Cowen and Company -- Analyst\n\nThat's actually very helpful. And then my follow-up was just as we think about the positive decision in the upcoming launch in the U.K., do you -- kind of like as we try to understand the size of that specific market, in particular, do you have any kind of like data on usually what percentage of pharmaceutical sales in Europe come from the U.K.? And how should we be thinking about the ramp up there in terms of the launch?\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nYeah, so the U.K. is definitely one of the top five, right? You're talking about a population of close to 70 million. It's a big market. In general, it will usually be No.\n\n3, No. 4, depending on the uptake. Because it's a highly scientific market, by the way, prescribers tend to be skeptical and that's an advantage for us because we have evidence. So we believe it's a market that we can do well early on.\n\nSo far, we can see that we are tracking better than analog in terms of formulary inclusion. That's the most important proxy that tells you how much uptake you're going to get because your product has to be listed and has to be funded on the local formulary. So far, we're ahead of analogs. So it is a significant market.\n\nWe are confident that this is going to be an important launch. And again, we continue to prepare and we will update over the next quarter with the results.\n\nGeorgi Yordanov -- Cowen and Company -- Analyst\n\nThank you. That's very helpful. And congrats on the progress.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nThank you.\n\nOperator\n\nYour next question for today is coming from Roanna Ruiz. Please announce your affiliation, then pose your question.\n\nRoanna Ruiz -- SVB Securities -- Analyst\n\nHi. Yes, Roanna Ruiz from SVB Securities. Good morning, everybody. \n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nGood morning, Roanna. \n\nRoanna Ruiz -- SVB Securities -- Analyst\n\nSo I wanted to check in -- yeah, check in a little bit about Germany and the arbitration decision. I was curious if you still expect to be on track for a mid-November update there?\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nYeah. So on Germany, the timing of the arbitration is mid to end November. As you've seen from prior disclosures, we already took all the actions needed basically to eliminate cash burn in Germany waiting for a decision. In general, arbitrations usually do not lead to a positive decision.\n\nLet's be very real. That's usually a low probability of success. And if you succeed usually, there is risk in lowering the price, which will have impact on other markets. The decision we took, which is to say, look, we're going to suspend the operations in Germany was to protect the price in the U.K., in Sweden and Finland, the price we're negotiating in Spain, as you can imagine, and other prices because the value of Germany as a country, let's assume that a large market is 15% of total Europe, right? So if that country is going to give you a price 15% less than your average European, you are at a loss, right? So we are not going to accept a price less than 15% because so far, we have a very consistent approval pricing level.\n\nat a European level, right? I mean if you look at our Finland price, I mean it looks today maybe just slightly lower than the U.K. In fact, it's only because of exchange. In reality, it's higher based on earlier calculation. So that's really for Germany and arbitration.\n\nRoanna Ruiz -- SVB Securities -- Analyst\n\nGot it. Yeah, that makes sense. And I also want to check in on your fixed-dose combination work for Vascepa with a statin? Any updates on how that's progressing? And could we expect any data or program updates later this year or into 2023?\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nYeah, so we're working very hard on this initiative, and you've seen that we're making a lot of effort to keep our disclosures to a minimum because there is a lot going on that we need to keep sort of confidential until the right moment. Once we will be ready to communicate, we will. And it is over the next quarter or two that we are going to come out with an update. So there is a lot going on.\n\nIt's just that it's not the right time to disclose it at this stage. But the program continues and progresses successfully.\n\nRoanna Ruiz -- SVB Securities -- Analyst\n\nUnderstood. Helpful. We'll keep watch for that. Thanks.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nThank you, Roanna.\n\nOperator\n\nYour next question for today is coming from Louise Chen. Please announce your affiliation, then pose your question.\n\nCarvey Leung -- Cantor Fitzgerald -- Analyst\n\nHi. Good morning, everyone. This is Carvey on for Louise from Cantor. Thank you for taking our questions.\n\nFirst question is, would you expect to be the biggest catalyst in the next 12 to 18 months? Second question is on the $100 million cost savings through mid-2023, can you speak more about the pace of saving realization? Should we expect more savings to be realized early on, say, later of this year or more sort of beginning of next year? And our last question is, you've guided the commercial launch in Hong Kong for some time this year, which is a separate track with China. Is there any updates here? Thank you so much.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nSure. Thank you. So I'll take the first question about the most important catalyst. I believe the most critical one is for us to achieve pricing reimbursement in another large market.\n\nThis is really what's going to drive shareholder value. The price that we have in the U.K. is very positive. But I think the key question is with the situation in Germany and the challenges we say, can we actually achieve the same pricing and reimbursement level in other larger markets.\n\nAnd that's a very critical one, and we are working to deliver on this over the next few months in the very near term because we are in very active pricing negotiation with the Spanish government. So to me, that's one of the most critical key milestones. Another one would be that we come out with an update on our fixed dose combination. I think there's very little known about this at this stage.\n\nAnd when we will go public with this, I mean, many of the shareholders will understand the value that this cost combination really brings short and long term for the business. So that's really at a high level. Now, for the question on cost savings and sequence, I'll leave Tom sort of give more detail on that.\n\nTom Reilly -- Chief Financial Officer\n\nSure. Thanks, Carvey, for the question. So we had -- we committed to $100 million of cost savings through mid of 2023. And you'll see for this quarter, we realized just about approximately $25 million.\n\nSo the way to think about this on a moving forward basis over the next three quarters is within that range on a quarterly basis. So we'll deliver the $100 million. I think the other thing just to keep in mind, they did really timely with our investments in Europe as we're getting reimbursement. So as reimbursement comes in, obviously, the spend will adjust and if it doesn't come down the time we're expecting then we'll adjust accordingly as well.\n\nSo we're being very prudent on that as we continue with our cash preservation.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nAnd finally, on Hong Kong and China, as you know, Asia is still, by the way, severely impacted by Covid and things sort of start, restart and multiple and we are in discussions to see what is the best sort of moment to go ahead with the launch. Hong Kong is a small market. Honestly, we're focusing more on the larger ones that will make a big difference in creating shareholder value. And as you've seen from our disclosures, we put in a lot of information about updates on filing in other Asian markets because we believe it's so critical when we are active in Asia, that we're active in multiple territories because they do synergize our effort at the end of the day.\n\nThank you for the question.\n\nCarvey Leung -- Cantor Fitzgerald -- Analyst\n\nThank you so much.\n\nOperator\n\nYour next question for today is coming from Daniel Wolle. Please announce your affiliation, then pose your question.\n\nDaniel Wolle -- JPMorgan Chase and Company -- Analyst\n\nThis is Daniel from J.P. Morgan. Thank you for taking our questions. Karim, you highlighted a potential peak opportunity of $1 billion for Europe.\n\nDoes that assume launch in Germany as well? And within Germany, you sort of mentioned that Finland, you got rejected, but then you still managed to get an approval, you have outlined a process by which you can -- you're trying to submit a dose year for that, put that process to restart again. So maybe can you give us a little bit detail on what the process is involved and what type of new clinical evidence can you provide to support the therapeutic benefits Vascepa, and I have one follow-up question.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nOK. So with regards to Germany, yes, we confirm based on the pricing and reimbursement levels that we are getting in Europe today that we believe that the peak is upwards of $1 billion, right, even without Germany, right? Now the way it's going to work is the following. We're currently today in arbitration. We'll have to wait to see how the arbitration decision goes.\n\nThere has been one precedent on the German market where a product that received a negative decision that went back and applied. In that case, they actually used real-world evidence data to support the clinical benefit. I'm not saying this is exactly what we're going to do, but that's -- I'm just mentioning that there is a path that is a very specific path to resubmitting a file in Germany. Having said that, the most important part today is to focus on the other larger markets, making sure that we get pricing reimbursement in Spain, making sure we get pricing reimbursement in Italy and France because that's really what's going to drive the value overall.\n\nDaniel Wolle -- JPMorgan Chase and Company -- Analyst\n\nGot it. Make sense. And then in terms of generics in the U.S., beyond supply issues, we've heard that pricing of APIs have become more competitive for the generic manufacturers. Do you believe there is any impact from that on the stability of Vascepa?\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nLook, I mean there was a period where pricing was stable, then there was a period that pricing was unstable beginning of this year. So it's difficult to predict, right, at what price and whether there will be. But look, it would be unreasonable, not to think that there will be future price competition, right? If you have more generics, theoretically, you're going to have more price competition. And we have taken that into account in the way we look at the business and the way we sized our footprint, I remind people that a year ago, our footprint was 780 people.\n\nToday, our footprint is 75 reps. So we are at a 10% footprint. So that's why we believe we are still driving significant contribution margin from the U.S. no matter what the price impacts are or volume impacts are.\n\nAnd if we need to, we have an authorized generic plan ready with a lot of supply that's just ready to go to the market. And that's why you've seen us confident in coming out and saying we're extending our cash runway because we believe in whatever scenario we're going to be, we will be able to get to revenue from Europe with our investments and with the contribution margin we're getting from the U.S.\n\nDaniel Wolle -- JPMorgan Chase and Company -- Analyst\n\nGot it. And last question for me. Understanding that you haven't disclosed much about the fixed-dose combo. Do you believe it can provide any new patent profile to Vascepa by any chance in the U.S.?\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nSo there is a question of patent, but there is also a question of other protection. And today, let's face it, this opportunity is going to be very, very critical for Europe, right? Because this is where we're talking about the $1 billion opportunity. This is where we're creating shareholder value. So most of our efforts are really making sure that, that's going to add additional right opportunity to Europe, which I believe everybody is seeing moving in the right direction.\n\nWhat will it provide to the U.S. will depend very much on where the generic market is going to be when we come out with a fixed-dose combination, right, which is going to be a couple of years or more from now. So this is really going to be focused mainly on Europe and international markets, and we're going to talk more about it when we are ready to disclose more details.\n\nDaniel Wolle -- JPMorgan Chase and Company -- Analyst\n\nGreat, thank you very much.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nThank you.\n\nOperator\n\n[Operator instructions] Your next question for today is coming from Paul Choi. Please announce your affiliation, then pose your question.\n\nPaul Choi -- Goldman Sachs -- Analyst\n\nHi. Thanks. Paul Choi with Goldman Sachs. A quick financial question for Tom.\n\nJust one point of clarification with regard to the $100 million in savings that you're targeting through mid-'23. How much of that is incremental savings from the current run rate versus the discontinuation of operations from Germany. Can you quantify that for us?\n\nTom Reilly -- Chief Financial Officer\n\nSure, Paul. Thanks for the question. So the way we've previously disclosed and we're committed to -- the way we look at this is we looked at the full year of 2021 as our base which was approximately $450 million of operating expenses. So we've committed that the $100 million of savings that we anticipate through mid of 2023 will be based off that $450 million benchmark.\n\nPaul Choi -- Goldman Sachs -- Analyst\n\nOK. Well, I'm just trying to understand how much is like from your discontinuation of operations in Germany versus your '21 base of that $100 million target?\n\nTom Reilly -- Chief Financial Officer\n\nIt's baked in. It's baked in. It's part of the overall net investments related to Europe.\n\nPaul Choi -- Goldman Sachs -- Analyst\n\nOK. OK, great. Thanks for that. And then a follow-up for Karim.\n\nYou talked about some additional partners for geographies where you're not going to necessarily be directly commercializing yourself in ex-U.S. markets. Can you maybe just give us a sense for as to when those partnerships or agreements might potentially be finalized and then how you're thinking about the incremental launch timing in those external markets relative to the U.S.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nThanks, Paul. So we are trying to align the dates of these partnerships with the dates of regulatory approvals, right? Because that's really when it becomes critical. And for the moment, we did discuss and engage with local partner in some of the larger markets internationally, we did engage with regional partners in other regions like Asia or Latin America, but we're also engaging with global partners that can take multiple territories at an international level. And we're working very hard to align those approvals.\n\nWe're going to have some approvals by end of this year, some next year and some 2024. So that continues to be a top priority because we believe that that's just going to open another revenue stream with no basically cost, no burn on our side. So it's definitely a priority. And hopefully, we will be announcing something by early 2023.\n\nPaul Choi -- Goldman Sachs -- Analyst\n\nOK, thank you very much for taking our questions.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nThank you.\n\nOperator\n\nThat is all the time we have for questions today. I would like to turn the floor back over to the Amarin management team for closing remarks.\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nSo I just want to thank everyone. I mean this has been a very solid quarter coming up from Q1 and Q2 with the U.S. revenue stabilization. The fact that we are cash positive, excluding restructuring charges, and we continue to make strides in pricing reimbursement in Europe and now launching effectively in one of the largest countries.\n\nSo we thank you, and we look forward to speak in the next quarter and to update you on our results. Thank you, all.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLisa DeFrancesco -- Senior Vice President, Investor Relations\n\nKarim Mikhail -- Senior Vice President and Head of Commercial\n\nTom Reilly -- Chief Financial Officer\n\nMike Yee -- Jefferies -- Analyst\n\nGeorgi Yordanov -- Cowen and Company -- Analyst\n\nRoanna Ruiz -- SVB Securities -- Analyst\n\nCarvey Leung -- Cantor Fitzgerald -- Analyst\n\nDaniel Wolle -- JPMorgan Chase and Company -- Analyst\n\nPaul Choi -- Goldman Sachs -- Analyst\n\nMore AMRN analysis\n\nAll earnings call transcripts"
}