{
  "companyName": "Novartis",
  "companyTicker": "NVS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/novartis-nvs-q3-2022-earnings-call-transcript/",
  "content": "Novartis (NVS -0.96%)\nQ3 2022 Earnings Call\nOct 25, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning, and good afternoon, and welcome to the Novartis Q3 2022 results release conference call and live webcast. [Operator instructions] The conference is being recorded. [Operator instructions] A recording of the conference call, including the Q&A session, will be available on our website shortly after the call. And with that, I would like to hand over to Mr.\n\nSamir Shah, global head of investor relations. Please go ahead, sir.\n\nSamir Shah -- Global Head of Investor Relations\n\nThank you very much, and good morning and good afternoon, everybody. Thank you again for taking the time to participate in Novartis' Quarter 3 conference call. Before we start, just a quick reminder of the safe harbor. The information presented today contains forward-looking statements that involve known and unknown risks, uncertainties, and other factors.\n\nThese may cause the actual results to be materially different from any future results, performance, or achievements expressed or implied by such statements. For a description of some of these factors, please refer to the company's Form 20-F, its most recent quarterly results on Form 6-K that respectively were filed with and furnished to the U.S. Securities and Exchange Commission. And with that, I'll hand across to Vas.\n\nVas Narasimhan -- Chief Executive Officer\n\nThank you, Samir, and thanks, everyone, for joining on today's conference call. Moving to the first slide, we take a couple of slides forward. Novartis delivered solid Quarter 3 performance really across all of our core value drivers. From a growth standpoint, group sales were up 4% in constant currencies.\n\nThat was driven both by solid performance in IM at 4% as well as in Sandoz. U.S. IM sales were up 8%, consistent with our strategy to continue to improve our position in the U.S. market.\n\nFrom a productivity standpoint, group core operating income was up 5%, again driven by IM, which was up 7%. We also had continued our margin progression with a one percentage point improvement. Our savings from our SG&A program are on track and Harry will cover that in a bit more detail. From an innovation standpoint, we had some important events, particularly the approval of Pluvicto with a positive opinion in Europe from the CHMP.\n\nAnd the readout we had and announced earlier this week of Iptacopan in PNH across two superiority endpoints versus anti-C5, and I'll go through that in a bit more detail. Lastly, on an ESG front, we had an important announcement with respect to our work with the Medicines Patent Pool as well as additional important milestones for two development programs with Hydroxyurea in sickle cell disease as well as in malaria. Moving to the next slide. The performance in the quarter was really driven by Entresto, Kesimpta, Kigali, and Pluvicto.\n\nAnd you can see the growth here for each of these brands. Entresto continues its strong trajectory. Kesimpta and Kisqali, performing well. And Pluvicto in its first full quarter in the launch, also performing very well in its early days.\n\nWe also saw good performance across some of the other brands, and we'll come to that brand by brand in the upcoming section. Moving to Slide 6. One important element of our story is our ability to make our 6 key in-market growth drivers into multibillion-dollar medicines. And we stayed on track with respect to that to really continue our confidence in our midterm growth outlook.\n\nThose six brands now account for 33% of IM sales, and they were growing 23% in the quarter. And as noted, both Scemblix and Pluvicto now are off to a good start and could one day be added to that list of six brands to also be potential multibillion-dollar brands in the future, depending on how readouts go in the earlier lines. Moving to the next slide. Now we'll just take a walk through each of the individual brands, and I'll give you some of the key highlights from the quarter.\n\nCosentyx showed steady growth in the quarter. You can see 7% growth in Quarter 3. We were maintaining our competitive position in our three core geographies. We have over 875,000 patients now treated.\n\nIn the U.S., we saw solid volume growth, but we also saw the impact of increased revenue deductions, particularly in Medicaid and 340B segments relative to a previous uplift we saw in revenue deductions in the previous year. That's something we'll expect to continue in Quarter 4. Now with respect to Europe, we maintain our leadership position among originator biologics in psoriasis and spondyloarthritis. Future growth drivers for Cosentyx to get to that $7 billion peak sales will be driven by our continued expansion in China.\n\nNotably, in China at the moment, we do face headwinds with the ongoing lockdowns, but we continue to expect China to be an important part of our story. Hidradenitis suppurativa has now been submitted, filed in both FDA and EMA. I'll tell you a little bit more about why we feel like we have a good opportunity with this indication. We expect to submit our IV regulatory file in Quarter 4.\n\nAnd we also continue to advance our life cycle management program across additional indications, including giant cell arteritis where we saw pretty solid Phase 2b data. Now moving to Slide 8. Entresto continues strongly across all geographies, 31% growth in the quarter. You can see here the weekly TRx has continued to set record after record, really strong performance in the U.S., but also around the world.\n\nWe now have over 8 million patients on therapy. Accelerating momentum in the U.S., strong demand in Europe. When you look at the future growth drivers of the brand, it's worth noting that only a third of eligible HFrEF patients are currently on treatment in the G7. And there's a strong profile we continue to build in clinical and real real-world settings in heart failure.\n\nWe have guidelines that continue to support the use of Entresto and HFrEF and also support its use in HFpEF. And we're also seeing good demand from the hypertension indications we were able to secure in Japan and in China. Now moving to Slide 9. Zolgensma had a little bit of a challenged quarter.\n\nWe now are predominantly seeing -- we're seeing demand from the incident population. Both U.S. and ex U.S. have shifted to an incident patient population.\n\nYear-to-date, we still have double-digit growth in incident patients treated, and we've exceeded 2,500 patients treated worldwide. Going forward, what will be key for us is to continue to expand into new markets. It's a foundational treatment, as you all know, for Type 1 in newborns. We are approved in 45 countries, and we have access negotiations ongoing now in 10-plus markets, including some important markets as Brazil.\n\nWe also continue to work to increase newborn screening rates to above 35% in Europe and hopefully get over time to the rates that we see in the U.S., where we're close to 98% of newborn screen. Taken together, we expect Zolgensma to -- we continue to expect Zolgensma to reach the $1.5 billion to $2 billion sales level in the IV indication alone. But getting beyond that sales level will require expansion into the intrathecal indication in the 2 to 18-year-old patient segment where the Steer study is continuing to enroll and we also have the Strength study looking at the IV utilization in that indication starting in Q4 2022. Now moving to Slide 10 Kisqali had a really strong quarter across all regions, with 49% growth on the quarter.\n\nyou can see, importantly, in the middle panel of the slide, the trend break we've had with respect to NBRx share in the U.S. in the metastatic population, where we've been able to climb over the course of this year from 12% to 13% to now 26% exiting in August. That's really on the back of the strong data that we have with respect to OS across all of the metastatic lines. It's the only CDK4/6 with overall survival benefit across three Phase 3 studies.\n\nWe also have a strong data with respect to quality of life. We've launched a head-to-head study, the Harmonia study versus Ibrance to further solidify that profile. And the Natalee study continues. We have not had any feedback yet from the steering committee with respect to the first interim analysis.\n\nAnd when that feedback becomes available, if it indicates any action on our part, we'll, of course, inform the market. Moving to Slide 11. Now Kesimpta had strong sales growth as well in the quarter, driven by its U.S. launch momentum, 172% you can see here on its launch trajectory.\n\nReally, all of the key metrics are trending in a favorable direction. TRx, 131%. NBRx, 47% versus a market notably that's declining 20%. We are up to 30% NBRx share in B-cell -- among B-cell therapies in MS in the U.S.\n\nwith a goal to reach 50% share. We're adding 100 new writers per month. Our initiation programs with our patient hub are performing extremely well. And we also released new four-year data in recently diagnosed and treatment-naive Kesimpta patients that support its use in earlier stages in RMS disease.\n\nSo really good trajectory here and an opportunity for us now to also accelerate our efforts outside of the United States to bring this medicine to more multiple sclerosis patients around the world. Now moving to the next slide. Now with Leqvio, as we've noted, this is a steady build over the course of 2023 and the first half of 2024. Last quarter, we highlighted that we have good data or good positioning right now with respect to market access with 70% of lives covered at or near the full label.\n\nThe vast majority of patients are able to access the medicine with a low co-pay. And now what we're doing is step-by-step expanding HCP adoption with now 4,800 or so physicians that have been able to initiate a patient on Leqvio. What is critical now for us is to guide these physicians through the process so that they're able to get their patients on board, they're able to see how buy and bill work. And importantly, they're also able to see the impact of the medicine on lowering LDL for their patients.\n\nWhat we find is in physicians that have gone through that process and have ultimately seen the impact on their patients, over 80% of patient -- physicians are pleased by the process and are pleased by the clinical and safety profile of the medicine. We just need to get more physicians through that process. So you can see some of the other data on the right-hand side. We have a free trial offer as well that's launched has seen strong uptake.\n\nSo we'll continue to work through the hurdle step by step. I think the right things are happening. But again, this is going to take time. And we really think it's midyear next year before you would expect to see any further acceleration beyond the linear path that we're on at the moment.\n\nNow moving to the next slide. Pluvicto, as I noted in my opening comments, is off to a strong start in the U.S. We're seeing very rapid launch uptake for this brand in the third, fourth-line castrate-resistant prostate cancer, metastatic prostate cancer segment. $80 million in share, we're already up to 14% NBRx share in the post-taxane setting.\n\nWe have 120 centers actively ordering, and we're really focused on servicing those centers in an outstanding way. 75% of insured lives are covered, and we have a permanent A code now in effect as of October. Now looking ahead, as we prepare for additional data and potential expansion of the indications for this medicine, we're expanding the number of treatment centers. We expect to, over time, get to 350 to 400 centers.\n\nWe're significantly increasing our manufacturing capacity. And we have our Italian site at Ivrea online and Millburn and Indianapolis are planned for 2023. I mentioned already the positive CHMP opinion, and we're on track for the readout of PSMAfore before the end of this year and PSMAAddition. And of note, PSMAfore, our current assessment is this would cover all pre-taxane metastatic patients, eliminating the need for one of the additional studies we had previously expected to be running in that setting.\n\nAnd in PSMAAddition, in the hormone-sensitive setting, we would expect to read out in 2024. So more to come, but overall, a solid launch so far with Pluvicto. Now moving to the next slide, looking at Scemblix. Scemblix, also continuing a solid launch momentum through Quarter 3.\n\nYou can see $41 million in sales, 13% total overall patient share in the third-line setting, and 39% third-line new patient share. That new patient share growth has slowed a bit, as we would have expected, as we need patients to switch off of therapies that they're currently in line to be typically moved to Scemblix. Looking ahead, we've had the accelerated approval converted to a regular approval based on 96-week data. The global rollout is ongoing.\n\nAnd importantly, our Phase 3 study is enrolling ahead of plan. Right now, we forecast the readout expected on this first [Technical difficulty]\n\nOperator\n\nPlease continue to stand by, your conference will resume shortly.\n\nVas Narasimhan -- Chief Executive Officer\n\nHi, operator. This is Vas, we're back.\n\nOperator\n\nThank you, sir. You are live.\n\nSamir Shah -- Global Head of Investor Relations\n\nI think we were trying to [Inaudible]\n\nVas Narasimhan -- Chief Executive Officer\n\nSo I think I'll just step back, operator, to one slide previously. So when I talk about moving to the first line, Scemblix, which would be on Slide 14. We continue to see strong launch momentum where we have Q3 sales driven in part by -- Q3 sales were $41 million, and we had a 13% patient share in the third-line setting. NBRx is at 39%.\n\nAnd overall, we expect Scemblix, the critical element now, will be moving forward our ability to move into the earlier line. The study is enrolling ahead of plan, and we'll provide further updates. But right now, we forecast the second half 2024 outlook for Scemblix. Now turning to some of the clinical data we had in the quarter.\n\nCosentyx, we had previously top-line data, 16-week in hidradenitis suppurativa. Now we have the 52-week data in-house. And just to remind everyone that it's a high unmet need patient population, one of the more common dermatological conditions that dermatologists see. 95% of Eligible patients are not on a biologic today and 50% of biologic-treated patients lose the response over time.\n\nSo there's definitely a need for a better therapy that can sustain its efficacy over time. With the Sunrise and Sunrise data set, we were able to collect data both at the 16-week and 52-week time period. We've already demonstrated data that showed a rapid relief from pain flares and lesion, but now we have data in-house to suggest that we have a unique benefit to sustain the response over 52 weeks, along with a favorable safety profile. So we look forward to sharing that data.\n\nWe have filed, as I mentioned already, with the regulators. And overall, we're hopeful that this can be a key growth driver for Cosentyx over the coming years. Now moving to the next slide. Earlier this week, we announced the release of the Iptacopan Phase 3 data in PNH, and this is a medicine we believe can become a pipeline in a pill over time with the range of indications we're currently developing the medicine for.\n\nAs a reminder, we are in -- we read out the PNH Phase 3 with an additional Phase 3 upcoming, the APPOINT-PNH study. We're in Phase 3 studies in IgAN, C3G, and atypical hemolytic uremic syndrome. And we have a range of additional indications currently ongoing. As a reminder, the APPLY-PNH study related to the treatment of patients who had refractory anemia after treatment with an anti-C5, and the Appoint study is in treatment-naive patients to anti-C5 antibodies, also expected to read out in 2022.\n\nNow looking on the next slide, Slide 17, to the APPLY-PNH study specifically. This is a study, as I mentioned, patients were on C5 therapy for up to eight weeks. They then switched to -- if they had refractory anemia that demonstrated hemoglobin levels of less than 10 grams per deciliter, they were randomized to either receive Iptacopan or an anti-C5 therapy for 24 weeks. And after that period of time, they would continue on Iptacopan for the extension period.\n\nWe demonstrated superiority for both endpoints, and I would say clinically meaningful superiority on both endpoints in terms of proportion of patients at greater than 2 grams and greater than 12 grams per dl. We have submitted this data or plan to submit this data to an upcoming medical congress, where we would share not only the magnitude of the effect in the primary endpoint but also secondary endpoints, including transfusion independence, quality of life, overall response rate as well as other measures. So moving to the next slide. Just as a reminder, our goal with this medicine is to be a first-line therapy for all patients with PNH.\n\nAnd that is the positioning that we plan to achieve both through our labeling and through the launch process. 10 to 20 cases per million is the current estimate of PNH with a current prevalence in the United States of 4,000 to 6,000. In the population of the current study that we just read out, about 40% of patients remain anemic with hemoglobin less than 10 grams per deciliter on anti-C5 therapies. It's also worth noting that a higher proportion of patients have some level of anemia, some level of fatigue or other clinical manifestations of the disease.\n\nSo the unmet need is significant even in the case of anti-C5 treatments. And 50% of patients -- of these patients receive transfusions. We believe Iptacopan presents a unique opportunity to address both intra and extravascular hemolysis, potential for lower transfusion requirements and improvements in the quality of life. We think the oral administration in this setting makes a lot of sense, and then we can talk more about that in the Q&A.\n\nAnd we believe that this -- there is a potential for this medicine to have a broad first-line label. Moving to the next slide. Lastly, before handing it over to Harry, Sandoz has delivered another solid quarter of growth. And you can see the growth rates here where we once again had a 4% sales growth.\n\nThis was driven in part by Europe, but particularly by our performance in the rest of world markets where we had double-digit growth. This is the fourth consecutive quarter of solid top-line growth for Sandoz despite having to overcome the impact of Russia and Ukraine and absorbing inflation and other headwinds. We've revised the full-year guidance upwards, and Harry will speak more about that. And we want to just remind again that biosimilars are the key future growth driver of the business.\n\nWe had the file acceptance of adalimumab high concentration and natalizumab in the quarter as well as a positive Phase 3 result for denosumab as well on the biosimilars unit. So with that, I will -- and we're on track, I should say, as well for the planned spin in the second half of next year. So with that, I'll hand it over to Harry.\n\nHarry Kirsch -- Chief Financial Officer\n\nYes. Thank you, Vas. Good morning, good afternoon, everyone. I'm now going to walk you through some of the financials for the third quarter and the first nine months of the year.\n\nAnd as always, my comments refer to growth rates in constant currencies. This is, of course, particularly important given the significant currency fluctuations we all see, and so we believe it offers a better view of the underlying operational performance. On Slide 21, this shows the usual summary of our operational performance for the third quarter and the first nine months. We have also provided growth rates with and without the impact of the prior year Roche income to allow a better understanding of the underlying business.\n\nAs you can see, we maintained our growth momentum in the quarter, with Quarter 3 sales growing plus 4% and core operating income plus 5%, with sales growth driven by our major Innovative Medicines brands, in particular Entresto, Kesimpta, and Kisqali. Higher sales were also reflected in higher core operating income growth and inflationary headwinds have been offset by productivity efforts. Operating and net income declined in the quarter, mainly due to higher impairments of about $0.5 billion and higher restructuring costs of about $0.4 billion versus prior year which were mainly due to the implementation of our previously announced streamlined organizational model. Core EPS grew 1%.\n\nHowever, if you exclude the impact of the prior-year Roche income, core EPS would have grown 10%. Free cash flow in the quarter was strong with $4.2 billion, but declined 6% in U.S. dollars versus prior year with a significant impact from currencies. Turning to the first nine months.\n\nWe delivered a slightly stronger growth year to date, with sales growing 5% and core operating income growing 6%. Core EPS in the first nine months grew 11%, excluding the Roche stake impact. On the next slide, I would like to drill down, as usual, into the performance by division. So for Q3 Innovative Medicines top line grew 4%, and the bottom line, 7%, resulting in an improvement of the core margin of 100 basis points to 38.1%.\n\nSandoz net sales also grew 4%, although core operating income decreased 5%, mainly due to increased M&S investments versus a quite low prior year base and prior year small divestment gains. This was reflected in the core margin, which decreased to approximately 22% of sales which is also in line with the year-to-date core margin for Sandoz. Overall, for the first nine months, we saw a slightly stronger sales performance for both divisions. IM sales grew 5% and core operating income, 6%.\n\nAnd for Sandoz, sales grew 6% and 5% on the bottom line, benefiting from a strong cough and cold season, return toward normal business dynamics and a low prior year base in the first half of the year. Our year-to-date core margin improved by 50 basis points for IM, which drove then also the 50 basis points improvement for the group. Now on to Slide 23. On the next slide, a reminder of the cost impacts of our simplified organizational model.\n\nWe continue to expect to deliver USD 1.5 billion in structural cost savings to be fully embedded by 2024. And as a reminder, we also expect onetime restructuring costs to be 1 to 1.2 times this annual structural savings. And for year to date this year, we have around $0.8 billion in restructuring costs related to the new streamlined model and expect approximately a total of $1 billion for the full year of restructuring costs on this topic. The rest of the onetime restructuring costs we anticipate will largely fall into 2023.\n\nThis year, we do expect to see some savings. As you can see here illustrative on the chart. But the overall impact will be minimal as this will offset higher energy cost inflationary pressures. All of these elements are, of course, part of our 2022 guidance.\n\nAs a reminder, part of the $1.5 billion savings we expect to be reinvested into our pipeline and a significant part will contribute to achieve our approximately 40% plus margin target in the 2027 plus time frame. Now turning to Page 24. Within the divisions, we expect Innovative Medicine sales growing mid-single digit and core operating income growing mid- to high single digits ahead of sales. The anticipated Innovative Medicines' core margin increase should be driven by the expected continued good top-line momentum and the continuation of our productivity programs, including the new streamlined organization model.\n\nFor Sandoz, the performance year to date allows us to upgrade sales and core operating income guidance, and sales are now expected to grow low to mid-single digit, revised upward from low single digit. And core operating income is now expected to grow low single digit, revised upward from broadly in line. For the group, we confirm our overall guidance. We continue to expect both top and bottom line to grow mid-single digit in 2022.\n\nAnd as you have seen from our year-to-date results, we are quite on track -- very much on track to deliver on that guidance. The key assumption for this guidance is that we see continuing return to normal global prescribing behavior and healthcare systems and no Sandostatin LAR generics would enter in the U.S. in 2022. The guidance also takes into account the entry of Gilenya that have now launched in the U.S.\n\nFor your information, Gilenya U.S. sales in Quarter 3 were $326 million. On Slide 25, I would like to provide an update on the other key financial elements of our expected core net income performance. As indicated on the Q2 call, we expect core net financial expenses to be slightly lower than in 2021, around $100 million to $150 million favorable versus 2021, revised from broadly in line versus 2021.\n\nAnd this change is mainly due to the higher financial income from reinvesting the proceeds of the Roche divestment and increased interest income for deposits. And the 2022 core tax rate is now expected to be around 16.5%, revised from the 17% to 17.5% range. This is mainly driven by a favorable change in the geographical profit mix. On Slide 26, I want to provide an update on expected currency impacts if currencies stay at current levels.\n\nObviously, currency impacts are significant this year given the strength in U.S. dollar against many, if not all, currencies. For Quarter 4, if currencies stay as they are now, we expect sales to be impacted by negative 9% and core operating income by negative 11% points. For the full year, we estimate the impact on the top line to be negative seven points, on the bottom line, negative 8 points.\n\nNow into '23, we would expect the sales to be impacted by negative 4% and the bottom line negative 5% versus 2022. As a reminder, as currencies move quite dynamically, we update currency impacts every month on our website. And with that, I hand back to Vas.\n\nVas Narasimhan -- Chief Executive Officer\n\nThank you, Harry. So moving to Slide 28. Just as a reminder, at our recent meet the management, we articulated our new Novartis strategy, high-value medicines, greatest disease burdens through technology, leadership in R&D and novel access approaches, a focused therapeutic area mindset across five core therapeutic areas, two plus three technology platforms in four priority geographies and a renewed focus on high-value medicines, not necessarily volume of medicines, but delivering truly high-value medicines, along with the other elements of our strategy on delivering returns and strengthening the foundation. And translating that into this year's priorities on to Slide 29.\n\nWe continue to maintain our growth momentum, and we confirm our 2022 guidance. Our top 22 priorities remain on track across launches and growth momentum on our six key brands. The pipeline is progressing per plan. I think the focused strategy, as I mentioned, has been executed against, and we're on track with the spin of Sandoz planned for next year.\n\nWe continue our productivity plans through our new organizational model, delivering $1.5 billion of additional savings. And we continue to strengthen the foundations of the company, culture driving performance, data science to drive value and working toward ESG leadership. So with that, I will open the line for questions. [Operator instructions] Thank you.\n\nOperator\n\n[Operator instructions] We will now take our first question. And your first question comes from Graham Parry from Bank of America.\n\nGraham Parry -- Bank of America Merrill Lynch -- Analyst\n\nSo it's on Pluvicto. So very strong launch. Obviously, that's not inventory because you can't build inventory on Pluvicto. So I was wondering actually, has this caused any capacity constraints given you're only supplying from the Italian facility at the moment? And therefore, could we expect actually sales to flat [Inaudible] quarter until you see new capacity come online? If you could just give us an update on the timing of the New Jersey and Indianapolis plants next year, are they still second quarter and the second half? Anything you can do to bring those online faster?\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Graham. So with respect to Pluvicto, we're able to supply the U.S. demand across the 150 -- 125-plus centers now we have currently set up.\n\nAnd we would expect demand growth to continue in Quarter 4. So we're able to make that supply. What's critical for us is as we move into the period where we hope to have a positive readout in the earlier lines of the SMA4 study, we would need additional capacity to be able to service that earlier, large indication. Right now, we hope to be able to file the Millburn facility back to the Pluvicto file before the end of this year.\n\nand hope to have that online in the first part of next year. And we're on track for the Indianapolis facility to come online in the middle of next year. So once the Millburn facility comes online, we've invested in that facility, we have additional capacity, we would be well positioned already for that new indication and the demand surge. And then once Indianapolis comes online, we would be in a position where we can service the U.S.\n\nfrom two manufacturing plants in the U.S., dedicate our European facilities to Europe and ex U.S., and then look at adding additional capacity in Asia and other markets over time. Thank you, Graham.\n\nOperator\n\nYour next question comes from the line of Wimal Kapadia from Bernstein.\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nCan I just ask about Zolgensma, please. So some of your commentary, Vas, now suggests you've penetrated a large part of the bolus pool and it's really about the incident population moving forward. I think it's probably fair to say, or please correct me, it's not that previously the $2 billion peak sales guide ex the intrathecal was a fair estimate. That's now saying $1.5 billion to $2 billion.\n\nso I just want to be clear, is that a change in expectations? And particularly given we're going to get close to $1.5 billion this year alone. And then just maybe, you mentioned Brazil. Which are the key countries and maybe some timing on those countries would be great.\n\nVas Narasimhan -- Chief Executive Officer\n\nYes, absolutely. So the dynamics on Zolgensma, as you all well know, we just to go through them, is that we -- as we add markets, we initially penetrate a bolus of patients in the under two age group, and then we move back to the incident patient population. And in the incident patient population, the demand is driven by expanding newborn screening, particularly outside of the United States. Right now, the key for us is to add those additional markets.\n\nSo those markets range from Saudi Arabia and Brazil to Turkey and India. So there's a number of markets and other markets around the world where we're currently in active negotiation. And our hope is by adding those markets online, we'll be able to build that overall pool, not only of prevalent patients which will increase sales for a period of time, but also build up the base of incident patients who are receiving Zolgensma on an ongoing basis. I think as we now look at the trajectory, we're ranging just because we -- it's hard for us to predict exactly as we learn more when exactly these markets will come online.\n\nSo we think it's prudent to say 1.5 to 2. We certainly have the aspiration to get to two, but it's going to depend on how many more markets we're actually able to get on to national programs. And of course, our teams are working very hard to do that. We're currently enrolling the intrathecal indication for a 2 to 18-year olds, as I mentioned, both to generate additional data for IV, where we do have a broader label in certain markets including the EU, up to five years of age.\n\nWe want to generate additional data for the IV and the pivotal study and 2 to 18 year olds. And we remain on track. We hope to have that filing in 2024 and then approved in the first part of 2025. And that would give us the momentum to make the medicine beyond $2 billion over time.\n\nAnd I think we'll have a better sense of how large it could be depending on the magnitude of the effect we see in those indications. Thanks for the question, Wimal.\n\nOperator\n\nYour next question comes from the line of Richard Parkes, BNP Paribas.\n\nRichard Parkes -- Exane BNP Paribas -- Analyst\n\nJust a question on Iptacopan in PNH. You've outlined the data for us on measures of extravascular hemolysis, but I wondered if you could give us any indication on how data on measures of intravascular hemolysis, such as LDH and rated breakthrough hemolysis were trending. I know you'll present the data, but just wondering if you've got confidence there's at least no deterioration in those measures when switching from standard of care. And maybe you could just give us a sense of how you think about the launch uptake in that indication given we have standard of care with long-term outcomes data beyond control of anemia.\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Richard. So first, I think it's worth remembering that in Phase 2b as -- in the Phase 2b data sets for Iptacopan, Iptacopan demonstrated strong LDH lowering and a very favorable safety profile also with respect to breakthrough hemolysis. Given that we are in the midst of filing this data or submitting this data for congresses, I don't want to [Inaudible] update on the secondary endpoints.\n\nWe'll present all of that as soon as possible in an upcoming medical meeting. But we feel very confident about the overall safety profile of Iptacopan with respect to the various other elements that one would want to measure across intravascular and extravascular hemolysis. Importantly as well, what will be important is an upcoming data set as in the frontline setting in treatment-naive patients to demonstrate that the profile holds up. Taken together, based on everything that we've seen thus far, we -- our aspiration remains to be a medicine that can be used in naive patients, in patients -- to switch patients off of anti-C5s on to what we believe could be a more beneficial therapy.\n\nAnd then if desired, it can also be used as an add-on therapy to really cover the full range of potential indications with this medicine, a twice-a-day oral medicine, that we think can be really an attractive option, not only in the U.S., but also when you consider that half of the PNH market is currently an ex U.S. market, a two-day oral could be highly, highly attractive. So all things to work through. We look forward to presenting the data in more detail shortly.\n\nThanks, Richard.\n\nOperator\n\nYour next question comes from the line of Emmanuel Papadakis from Deutsche Bank.\n\nEmmanuel Papadakis -- Deutsche Bank -- Analyst\n\nPerhaps I could take one on Leqvio. We don't seem to see much of an impact from the first of July J-code award. So just your latest perspective on how things are trending and what confidence on what actually drives that mid-'23 inflection? Is there something that in your view is going to capitalize a step change in the middle of next year? Or is it more really a build through the course of 2023 and your confidence that will still get to blockbuster status pre-outcomes data in '26?\n\nVas Narasimhan -- Chief Executive Officer\n\nThanks, Emmanuel. The key here is to get enough physicians who have gone through the process of getting a patient on therapy, both then seeing the LDL reduction after the first and second dose, second dose is at the three-month time point, and having successfully been reimbursed in the Part B program. When those things happen, we see physicians, 80% plus of physicians, at least that we've internally surveyed, have a positive experience, both from a clinical standpoint and from a Part B reimbursement standpoint, regardless of whether they used an alternative injection center or used their own clinic. So that's all the positive data that we have, but we need to move physicians through that process.\n\nSo the reason we highlight 4,000 physicians now have initiated shows that we have that kind of -- in the early part of the funnel physicians moving through the process, they probably trialed a few patients. We now had to get them through that entire process. And if they presumably have that positive overall experience, they will add additional patients on to the therapy. And so this is going to be a build.\n\nBut as we build that base, we hope then to convert entire practices over to using Leqvio over time. And that would hopefully then lead to a compounding effect and an acceleration. Overall, we remain confident that we will get to the blockbuster status ahead of outcomes data, that's for certain. And a lot of work to do, but it absolutely remains our goal.\n\nThank you, Emmanuel.\n\nOperator\n\nYour next question comes from the line of Matthew Weston, Credit Suisse.\n\nMatthew Weston -- Credit Suisse -- Analyst\n\nI got a follow on with Emmanuel's question, again touching on Leqvio. So Vas, as you pointed out, the market inflection not until 18 months into launch. As I recall, going back to Diovan and Entresto, I thought they took four years to break even as products. And now we have the risk of the IRA potentially limiting small molecule life to nine years.\n\nCan you just lay out whether or not you feel that Leqvio will break even before that four-year level we saw with large cardiovascular medicines? And if so, why? And then I guess the other question is whether having invested so heavily in buy and bill, are there other cardiovascular assets that you hope to bring on board or have in the pipeline that you can put through the similar channel to give doctors the comfort that investing in all the practice infrastructure isn't just a single product with Leqvio, but there's a stream of products that they can capitalize on.\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Matthew. So first, on the payback period, I'll have Harry comment, and I'll come back on the second part of your question.\n\nHarry Kirsch -- Chief Financial Officer\n\nMatthew, I think we -- as we discussed before, these cardiovascular launches, in my experience, like GP primary care launches, and of course all of them are different depending on the product and the category and so on, but in my experience, usually then the breakeven happens roughly in Year 4 plus/minus. While, of course, high-priced specialty launches sometimes have a breakeven in Year 1 or at least in Year 2. So clearly, nine years versus 13 years is not a positive, right? That's why I think also there will be initiatives to move those closer to the 13 years, both of them. But at the moment, it's nine years.\n\nBut of course, in any of these launches, one wants to have the uptake to be as fast as possible, just cardiovascular is slow. And I would expect the usually breakeven in Year 4.\n\nVas Narasimhan -- Chief Executive Officer\n\nI think, Matthew, in terms of having -- it is on our mind to build a broader portfolio of medicines. So both in-house, we have efforts ongoing both in terms of life cycle management of Leqvio as well as other novel therapeutics which are still moving through the research pathway or research labs to try to accelerate now to make sure we have a stream of medicines. I also say broadly in the industry, there are other medicines as well that I think would also fit in terms -- into the buy-and-bill model. But on a stand-alone basis, for most practices that we've analyzed, the number of cholesterol patients in a practice, it is favorable for cardiologists once they have the setup and have it moving to do it just for Leqvio.\n\nSo I think it's an important point that it's not a requirement that you have multiple medicines. Even this one medicine alone, where you have also the certainty that you know the patient is on therapy, you see the result on the cholesterol lowering. It's highly attractive from that point clinically. And also the practice has the cost reimbursement elements as well.\n\nIt's pretty attractive, we find with most practices that have gone through the process. So we'll not only focus on Leqvio, but also build a pipeline behind it. And as Harry mentioned, I think a top priority has to be to ensure small molecules and related technologies are not penalized relative to large molecules. So that, of course, will take time to shape public policy.\n\nThanks, Matthew.\n\nOperator\n\nYour next question comes from the line of Simon Baker of Redburn.\n\nSimon Baker -- Redburn Partners -- Analyst\n\nAnd the risk of being boring, I'm going to follow Matthew and Emmanuel on Leqvio. Vas, just on this -- your expectation of a linear trend to the middle of next year, with the two drivers of more doctors being set up to administer the drug and more patients per physician, I mean that does sound a little conservative because, I mean, that in itself should -- if both of those are increasing, that should drive more than linear growth. So I'm just trying to understand a little bit more about that. And also related to that, you are running a DTC campaign with two adverts at the moment in the U.S.\n\nfor Leqvio. Do you have any sense of how patient demand is exceeding the billing capabilities of physicians at the moment? It's not the case of unfilled scripts, but unsatisfied patient demand. Is there any indication you can give us on that?\n\nVas Narasimhan -- Chief Executive Officer\n\nYes, Simon. I think on the first question, I think it's just -- we've learned over the years, it's prudent on cardiovascular launches to be appropriately cautious until we see evidence that in the sales line, we see a trend break. And I think at the moment, all of the inputs look positive, as you say. We have the number of physicians that we have that have initiated some action on Leqvio, the feedback we get from physicians going through the process.\n\nWe're starting to see improvements, so we'd like to see more improvements in depth per practice that are on that are using Leqvio already. So all of the things are in the right direction Reimbursement is at higher levels than PCSK9s achieved in Year 5. We've said high levels of patients don't have to pay any co-pay to access the medicine. So again, all in the right direction.\n\nBut I think we would feel better if we actually saw a trend break before we start promising anything bigger than a linear trend. So that's kind of our mindset at the moment. And if it happens, that would be terrific and we, of course, share that with all of you as soon as it does. We do have a very active DTC campaign to activate patients on the benefits of a twice-a-year therapy that can deliver up to 60% lowering on LDL cholesterol.\n\nWe do see the beginnings of increased patient demand. I would note that, actually, we don't see capacity as an issue because we are able to use the AIC networks, which are continuing to expand to absorb any excess patient volume. So if a practice is not able to set a buy and bill immediately, we're able to educate practices about AICs, which are available in the community that are set up. And we've worked very closely with that expanding network of alternative injection centers to make Leqvio available.\n\nOne of the things we've learned that we need to get much smoother at is that transition of helping a practice that sent the patient to the AIC and then back to the practice. We're working on smoothing that out. But that AIC creates a pretty big surge capacity. But what we do hear from practices in general is, over time, they would like to set up the buy-and-build capacity within their own practice.\n\nIt's just a matter of can they do that immediately? Or would they like to do that in the future? Thanks, Simon.\n\nOperator\n\nYour next question comes from the line of Tim Anderson, Wolfe Research.\n\nRichard Wagner -- Wolfe Research -- Analyst\n\nThis is Richard Wagner on behalf of Tim with Wolfe Research. It's about Cosentyx. And could we get an update on the competitive landscape in the U.S. as AbbVie works to lock in formulary positioning for its various I&I products in 2023 onwards as Humira biosimilars approach.\n\nWhat would be the impact or could be the impact on net pricing and formulary placement?\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Richard. When you look at Cosentyx, we're still in the midst of the formulary negotiations at this time. But our best belief in indication, given that formularies want to have an IL-17A available for patients, that we'll be able to maintain our formulary position at roughly equivalent position in terms of our gross to net as we have this year.\n\nI think looking forward, what will be absolutely critical for us to continue Cosentyx's growth dynamics and really maximize the medicine is the approval of additional indications in hidradenitis. We have the IV indication as well. As I mentioned, we plan to file -- we have a 2 ml syringe, which we're also in the midst of filing. Those would be the next big three.\n\nAnd then beyond that, indications, as I mentioned, giant cell arteritis, tendinitis, among others. That's going to be the next wave we're going to need to maintain strong position on formularies, but also to enable the brand to continue to grow. But for 2023, based on our negotiations to date and reviews we've had with our managed market teams, we feel comfortable with where we'll be on formularies for next year.\n\nOperator\n\nYour next question comes from the line of Stephen Scala from Cowen.\n\nStephen Scala -- Cowen and Company -- Analyst\n\nFirst, an observation than a question. So the observation is that in response to the Pluvicto question, it makes it sound as though Q4 sales will be appreciably above Q3. And I guess you must have some visibility since Q4 is about a third over already. The question is, Vas, in the past, you have been cautious on the use of A-beta antibodies for the treatment of Alzheimer's disease.\n\nGiven recent news, do you have any reason to change your view? And if yes, then how will Novartis gain a position in A-beta antibodies or some other approach in Alzheimer's?\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Steve. On the A-beta antibodies, I think what's most important, particularly given the amount of investment that would need to be made by healthcare systems for therapies, and we of course are active in Alzheimer's disease research, is the benefit that we're seeing not only statistically significant but clinically meaningful. And I think with the various measures that are currently used, it's hard to judge what is clinically meaningful ultimately for a patient.\n\nAnd I think that's going to be the question for payers, advisors, etc., in the U.S. markets. Is this clinically meaningful enough? A very -- the 0.4, 0.45 or whatever the number is, on the ADAS ACOG scores. So I think we'll have to see.\n\nThat will be for others to judge. Our focus is on other mechanisms of action. I mean we think -- we don't know, but certainly, our labs are working on other approaches across the full range of neurodegenerative diseases, where we have programs in the clinic, as you know, on Huntington's and Parkinson's, and continue to also look at various targets in Alzheimer's. But I wouldn't expect us to take any action on A beta, and none of the data that I've seen thus far would trigger us to make a shift at this point in time.\n\nOperator\n\nYour next question comes from the line of Kerry Holford from Berenberg.\n\nKerry Holford -- Berenberg Capital Markets -- Analyst\n\nQuestion for Harry. Just looking at the UNR844 termination, that product that you acquired by the Encore Vision acquisition. Was there an asset impairment taken in the quarter? And if not, is that coming next quarter? I wonder if you can quantify how big that might be.\n\nHarry Kirsch -- Chief Financial Officer\n\nYes. Thank you, Kerry. Actually, the majority of our impairment recorded in Quarter 3 was UNR. The potential presbyopia drops of roughly net impact of $0.5 billion.\n\nSo we immediately, when we stopped the program, we immediately booked it. So that has happened in Quarter 3.\n\nVas Narasimhan -- Chief Executive Officer\n\nGreat. Thank you, Kerry.\n\nOperator\n\nYour next question comes from the line of Richard Vosser J.P. Morgan.\n\nRichard Vosser -- JPMorgan Chase and Company -- Analyst\n\nMaybe we could talk about Natalee. And maybe you could give us an update where we are in terms of the interim analysis. Is it still a case that the 70% interim should be expected at the end of the year? And then, of course, the final analysis within the second half of next year? Just some thoughts there would be great.\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Richard. So we continue to expect the first interim to read out before the end of this year. But we have not heard back from the DMC at this point in time.\n\nAnd our approach will be that if the DMC advises us to make a change, we'll let the markets know. And if you don't hear from us, that means the DMC told us that the study should continue as planned. We expect the second interim to happen in the first half of next year and the final study should complete at the second half of next year. Another study that -- another question that often comes up is related to how we'll approach OS in these various settings.\n\nAnd the FDA has confirmed to us that as long as there is no detriment to OS at any of these time points, that would be sufficient for them to consider the data set as pivotal for a potential approval. Thanks, Richard.\n\nOperator\n\nYour next question comes from the line of Emily Field from Barclays.\n\nEmily Field -- Barclays -- Analyst\n\nJust on MS. On Gilenya, I know your prior guidance assumed no launches in the U.S. So good to maintain that. Just the impact on core operating margin, should we think of that as a pretty straight drop-down given that it's probably a pretty high-margin product? And then just on Kesimpta, your share assumptions in the class going forward, do you expect those to be impacted by the potential launch of subcutaneous Ocrevus?\n\nVas Narasimhan -- Chief Executive Officer\n\nSo first on Gilenya, Harry?\n\nHarry Kirsch -- Chief Financial Officer\n\nYes. Thank you, Emily. Yes, this is -- it's a very high gross margin product. There's some royalty on it, but it's, of course, also small molecule, high priced.\n\nSo the product margin is quite high. As you can imagine, at the end of the life cycle, there is not much M&S on it. So it's pretty much a straight drop down to the bottom line. But of course, we have mitigating actions and productivity plans, and it's fully embedded in our guidance this year.\n\nVas Narasimhan -- Chief Executive Officer\n\nAnd then with respect to Kesimpta, Kesimpta has really been successful as a first line for switch medicine in the neurology settings that are not currently participating in infusions, as is the case with our competitor product. I think first, we need to see if a high-dose subcu can be delivered without any sort of reactions and other complications. I don't think that's a given. I mean, of course, data will have to bear that out.\n\nAnd then it's worth remembering our positioning will be for patients who want a monthly injection at home and don't want to go into the infusion center. Clearly, the subcu might reduce the time of the infusion center, but it remains to be seen how will steroid pretreatment need to be happened. Will it need to be continued to be IV? Is it sufficient for it to be oral? What kind of monitoring requirements FDA will require? So I think it still remains that there is a segment of the market that will want to use IV infusion or subcu infusion therapies. And there's a segment where Novartis and Kesimpta, we hope to become the clear leader among patients first class -- first treatment or first switch who want a very convenient, at-home, highly safe, high efficacious B-cell therapy, and that's our focus.\n\nAnd Harry has a point.\n\nHarry Kirsch -- Chief Financial Officer\n\nYes. Just Emily, a follow-on clarification also on Gilenya. I mentioned that this is fully in our guidance for 2022. I just want to mention also that this has no impact to our mid- to long-term guidance.\n\nPrior to this turn of the U.S. courts, if you will, we were expecting to lose U.S. exclusivity, if you will, or have generic entries in the middle of '24 roughly, right? From that standpoint, our 40% plus margin goal in 2027 plus was already fully assuming that generics would have ended several years before that.\n\nVas Narasimhan -- Chief Executive Officer\n\nGreat. Thanks, Harry. And so we still have a number of questions in the queue. [Operator instructions]\n\nOperator\n\nYour next question comes from the line of Keyur Parekh from Goldman Sachs.\n\nKeyur Parekh -- Goldman Sachs -- Analyst\n\nVas, you mentioned that you would like for Iptacopan to be the therapy of choice kind of in the frontline setting. What data do you think you would need to see kind of from the frontline study to allow for Iptacopan to be in that position given the headstart that the Alexion products already have in that market?\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Keyur. I think what will be important is if we can demonstrate we can generate clear control of the disease. And of course, across the various parameters, LDH, safety, etc., that we have a compelling profile.\n\nI think when you look broadly, first, if you think first principle to biology of this disease, this is an alternative complement pathway-driven disease Factor B is a relatively unique component of this in that it's not as abundant as C3 and C5, and an oral agent can get to both to extravascular and intravascular sources of Factor B and inhibit those. And those include tissues that go beyond the liver, which is an important consideration when you consider ASOs and siRNAs in oral therapy the unique profile in being able to reach the full broad range of tissues. So overall, we think Factor B for these alternative complement-driven diseases, including PNH, is an ideal target. And overall, the PK/PD we see for this medicine, the preclinical and clinical safety we see, has been very good.\n\nThat's been borne out now in the APPLY-PNH study that we've already headlined. And we hope to continue to see that in the frontline study. And then next year in C3G, in particular, but also in IgAN. And then in other alternative complement pathway-driven diseases, including what's called a gluten disease, MPGN.\n\nSo there's a range of diseases where we believe the medicine is well suited. And I think we're excited that the medicine has, so far in its first pivotal readout, borne out the clinical and preclinical hypotheses that we set forward. So we'll look forward to providing the data in an upcoming medical congress as I outlined. And then the second study as well will read out before the end of this year.\n\nOperator\n\nYour next question comes from the line of Mark Purcell from Morgan Stanley.\n\nMark Purcell -- Morgan Stanley -- Analyst\n\nFirst, just returning to Natalee, the interim analysis. Is that based on all comers? Or do you need to see a significant benefit specifically in the intermediate-risk patients, which may be, I guess, as low as 25%, 30% of the events?\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. So, Mark, I think it's important to note that we're looking at both grade two, grade patients in the study. And the way we're powered is across the entire population. And we've relooked at powering many times now, and we feel very comfortable based on the study design and what we've seen from other competitors and the fact that we power it up by 1,000 additional patients.\n\nAnd so the results, the IDFS results, will be based on the overall population, and that's how the endpoints are designed. As a separate point, and just to be clear, the FDA, can, at any point in time, decide that they want to take cuts between stage two and stage three patients. but our focus for our primary analysis is Stage 2, Stage 2 and Stage 3 patients as defined in the protocol, and the endpoint will be driven off of that entire patient population.\n\nOperator\n\nYour next question comes from the line of Seamus Fernandez, Guggenheim Securities.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nI guess one quick question just on Leqvio. Can you just help us understand where those patients are coming from? Are they predominantly switched patients from existing PCSK9 therapy? Or is this a new patient pool? And then just very quickly, second question. Vas, as we look toward potential business development becoming increasingly critical as the years progress, just wondering where your particular focus is given the commentary around primary care cardiovascular product launches and the ability to launch into those efficiently.\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Seamus. So first, on Leqvio [Inaudible] business. Just as a reminder, the target patient population in the U.S.\n\nis 18 million patients. And across all of the core markets, EU plus the top markets around the world, is around 70 million patients. These are patients who have had a prior cardiovascular event and are not reaching 70 milligrams per deciliter on their LDL score. And that is the guideline directed, that is the goal.\n\nSo it's a big, big patient population. Right now, I think what we can say is that the primary prescribers that we see are prescribers who also have experience with PCSK9 monoclonal antibodies. That could be low experience, it could be high experience, harder for us to say given that this is a Part B medicine, the source of business from a patient standpoint. But I presume then we're either getting switch patients on PCSK9 monoclonal antibodies or we're at least getting a broader share of physicians that are open to the PCSK9 class.\n\nAnd so our focus right now is to really say how can we get broad adoption within, let's call it, PCSK9-minded physicians. And then over time, try to expand further and further through our work with systems of care, population health agreements, etc., into the broader patient population of 18 million patients. Clearly, we don't need that bigger share of that 18 million patients to reach our overall financial goals. From a public health standpoint, we would, of course, want to [Inaudible] many of those patients as possible, because right now, the odds of a patient having a subsequent event go up quite dramatically if they're not at that 70 goal.\n\nSo that's kind of overall how we approach it. There's no updates with respect to M&A and BD. We continue to focus on, let's call them, sub-$3 billion, $4 billion M&A deal, broad range of licensing opportunities, focused primarily on science and does the science work? Is it fitting in our core therapeutic areas? Does it fit in our two plus three technology areas as we've outlined at the meet the management. And we continue to assess.\n\nThen if we find something that's attractive, where we have a differentiated view that would justify the premium and generate, we believe, value creation for our shareholders, we'll, of course, pursue it. Other than that, we're also willing to be patient. We believe in our pipeline. We believe with our new leadership within R&D and the addition of a strategy and growth officer, we can unlock the full potential of Novartis research and development and then have a steady stream of medicines going forward.\n\nAnd so we're going to remain disciplined as we move ahead.\n\nOperator\n\nYour next question comes from the line of Florent Cespedes from Societe Generale.\n\nFlorent Cespedes -- Societe Generale -- Analyst\n\nVas, a quick one on China, please. As China is a key country for you. Could you please elaborate on the dynamic there for your key products and if there is any, let's say, impact from lockdowns. And could you refresh our memories and please remind us the current contribution and your ambition on this country.\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. With respect -- thanks, Florent. For China, we've outlined our aspiration to become a top three player by 2024, which would be a player that exceeds $4 billion in sales in the market. We've had really a record performance in terms of number of approvals over recent years.\n\nAnd then also moving forward, I think we'll lead the industry as well in terms of NRDL listings. Key drivers for us has been our oncology portfolio, Entresto, Cosentyx, Lucentis, among others. Now we were growing in the high teens from a sales growth standpoint before the lockdowns. And I think the lockdown -- we continue to grow, but we're growing more in the high single-digit frame at the moment.\n\nAnd we would expect that to continue until we would see a shift in the overall ability for patients to access medical care in more normal dynamics. That's part of the reason why you see the slowdown in Cosentyx that we saw. With Entresto, given the strength of our overall performance globally, it doesn't really move the needle on that particular brand. So the key brand where it has an impact is Cosentyx and, to a smaller extent, in some of the other brands.\n\nNonetheless, we continue to believe, given that there's over 1 billion patients -- 1 billion people we can serve with our portfolio of medicines, we have to continue to find ways to continue to reach patients in the framework that is currently in place. And then also be ready that if there's a further opening up, to continue to expand our growth in the market. And importantly, we believe Leqvio and some of our other medicines, Pluvicto, Leqvio, among others, could be significant medicines in China over time.\n\nOperator\n\nYour next question comes from the line of Andrew Baum from Citi.\n\nAndrew Baum -- Citi -- Analyst\n\nA question on the IRA impact on catastrophic coverage and the burden on PBMs and managed care. A significant part of Kisqali is through the Medicare channel. Ibrance seems to be available at a much lower price post genericization. To what extent -- to what extent, excuse me, do you see deflation of the price of Kisqali within the Medicare segment because there'll be preauthorization step [Inaudible] within Medicare prior to gaining access to Kisqali? And do you see any risk of spillover of that, assuming that thesis is correct, to the commercial book of business?\n\nVas Narasimhan -- Chief Executive Officer\n\nThat's a good question, Andrew. I think in general I'd say we're doing a lot of scenario planning on how the IRA could impact various brands. And I think certainly on our minds is how the increased exposure of PBMs in the catastrophic, how that will get transferred or translated into actions against some of our medicines. I think the key for us to differentiate versus a generic in a class like in the CDK4/6, will be having a broader indication -- set of indications relative to the existing medicine.\n\nSo I think that's going to be absolutely critical for us in this class to hopefully have the opportunity to expand into, as I mentioned earlier, Stage 2a, Stage 2b, and Stage 3 patients. Otherwise, I think there could certainly be spillover from -- in the metastatic setting if there aren't broad indications for the other 2 players. So we'll have to see how this plays out. I would also say, in general, in some of these cancer classes, such as the CDK4/6, you do see contracting and you do see the opportunity for commercial insurers to get rebates from branded products.\n\nSo that would be the, I think, tension there in the system, is they would have to give up their commercial rebates to potentially utilize the generic. So we'll have to see ultimately how all of this plays out. Thank you, Andrew.\n\nOperator\n\nYour next question comes from the line of Peter Welford from Jefferies.\n\nPeter Welford -- Jefferies -- Analyst\n\nI just wanted to return to Pluvicto. I wonder if you could give us any more color at all in the centers that are currently using it. Are these generally academic centers? Are these generally centers that are using via the radiation oncologist? Or is it more nuclear medicine physicians? And particularly with regards to then the diagnostic. Just wondering, does it largely use your own local vets? Or are you seeing use of other diagnostics before treatment? And is that potentially a source of revenue for you in the future, the diagnostics? Or should we think of this as largely a wash for Novartis as the focus is on therapy.\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Peter. Overall, I'd say it's a mix. You have high academic centers.\n\nYou also have large-scale centers which are, in the case of prostate cancer, a combination of urology and nuclear medicine working in conjunction with medical oncology. We see that in some very large centers. And then we also see some nuclear radiology as well. That's -- and we generally are focused right now on larger volume centers in this first phase of launch.\n\nI would note that if we were able to open it up even further in terms of the number of centers, we would expect even higher volumes for this medicine given the overall demand that we're seeing. But we're taking it stepwise, making sure we can service this first level of centers absolutely fully. And now we're in the process of adding additional centers step by step. So it's a very different situation than with Lutathera, where because of the lower volumes and also neuroendocrine tumors being treated by certain specialists, there's a very relatively limited number of centers that were interested.\n\nWhereas here, we have more demand from centers, and then within the centers we're in very high demand that we're seeing at the moment. So those are all the dynamics we're seeing. Overall, I would say, from a diagnostic standpoint, there is, of course, a preference for gallium. We do see other pet ligands also used.\n\nWe wouldn't view our locum business as a driver for Novartis or something that can materially impact. It's kind of -- as you said, kind of a. Wash, it's much more about identifying patients. One of the dynamics, however, that's very important to understand, as you think about Pluvicto in across all lines of metastatic prostate cancer with the PSA for study that still needs to read out, is the broadening use of PET imaging for identifying patients who have an elevated PSA and to determine the extent of the metastases for their cancer.\n\nThat is a dynamic that works very much in the favor of Pluvicto because if you identify these patients through the pet ligand, you're more likely to use a radioligand because you've seen the tumor and now you know the therapy can target what you see. and that, I think, is an important dynamic for the brand in the longer run.\n\nOperator\n\nPlease switch to the backup feeds. Please continue to stand by, your conference will resume shortly. [Technical difficulty] Hello again. You are now live again.\n\nVas Narasimhan -- Chief Executive Officer\n\nYes, sorry, I don't know what's going on today.\n\nOperator\n\nYour next question comes from the line of Wimal Kapadia from Bernstein.\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nGreat. Thank you for the second question. Vas, you mentioned oral being quite important for Iptacopan. So I'm just curious how you think about the issue of adherence with an oral therapy in the real world setting.\n\nAnd then maybe you could talk here about the potential for breakthrough hemolysis as a result of potentially lower adherence.\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Wimal. I mean I think there's a couple of topics that we'll have to work through. So there's always the risk of compliance and how we manage that.\n\nWe can certainly share as we have more data the experience we have in clinical -- in the controlled clinical trial setting. And as I mentioned earlier, we're confident in the profile we see with respect to breakthrough hemolysis. I think for many patients, having either regular infusions, weekly infusions, biweekly, subcu infusions, all these are quite burdensome. And at least our experience has been in severe diseases that patients are highly compliant with their oral therapies given that they know these are absolutely critical for their health and well-being.\n\nSo we believe that the compliance topic can be handled in an ultrarare population that is extremely well informed about their condition, and of course, we'll take the steps necessary. And that the benefits of what we believe and hope the clinical trial data will ultimately bear out, is improved efficacy, improved safety, improved overall control, improved secondary endpoints to be highlighted in the upcoming disclosures, will motivate patients to want to get on the best therapy for the management of their disease. And that's, I think, the case we'll have to make. Alongside that, of course, comes up the question on if you're competing against Part B medicines, how will that impact? Our assessment is that, in general, most of the hematologists who use this medicine are very low volume with respect given that there's only 4,000 to 6,000 patients in the U.S And that can be managed given that this is likely not a large cost recovery driver for those physicians.\n\nOutside of the U.S., we would expect our ability to use an oral therapy to reduce the burden on healthcare systems as well as hopefully reach many of the patients who can't afford the currently approved therapies would allow us to, again, treat the majority, I hope, the majority of patients with these complement-driven diseases, including TNH, over time.\n\nOperator\n\nYour next question comes from the line of Graham Parry, Bank of America.\n\nGraham Parry -- Bank of America Merrill Lynch -- Analyst\n\nSo just following up again on Pluvicto, just to reiterate on Steve's point. So are you at capacity now though in Q3? Or should fourth quarter be higher than third quarter before you bring on next level of supply? And then in the pre-taxane setting, can you help us understand the proportion of patients in that first-line metastatic indication that goes through a large center, such as the ones you're targeting at the moment, versus community oncology and community urology centers? And on that last group, how do you stop them from just using taxane upfront anyway? Because if they refer a patient, they'll essentially lose the income from that patient, at least for the treatment portion of the disease. And then just lastly, a question we've had a few times this morning, just why the conservatism in the guidance if Innovative Medicines is growing mid- to high single digits and Sandoz also now growing? You've upgraded Sandoz twice now without upgrading the group guidance. So just what's sort of the difference, the bridge between IM, mid- to high, and then group guidance [Inaudible].\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Graham. First, on supply, to reiterate, we have adequate supply to meet the demand for the post-taxane vision population for Pluvicto. We see very high levels of demand, and we expect continued growth of the brand in the coming quarters, in that third, fourth line -- third, fourth line setting.\n\nAnd we allocate all capacity that is available in our network to the United States launch. If anything, we'll -- if we needed, we would prioritize launches in other markets as to ensure that the U.S. is at full demand. I guess what I was trying to indicate is we -- even with respect to the higher demand and higher volumes, we expect to see in Quarter 4 those volumes could be even higher if we were to completely unconstrain the number of centers that would want to bring this medicine on board.\n\nSo all on the right trajectory. With respect to the pre-taxane setting, we would roughly expect the new data, if positive, to triple to quadruple the number of patients that would be eligible for -- so basically the broad range of patients in the metastatic setting, first, second, third line, but the full range of metastatic prostate cancer patients who have the key constrainer who have a pet scan. So once they have a pet scan, we would expect them to be eligible for our medicine. I think it's much more of PET scan availability that will drive a lot of the movement toward radioligand therapy perhaps versus taxanes or other available therapeutics.\n\nAnd I guess what I'd say is it's really going to be in terms of referral patterns from community oncology to larger centers. Two dynamics there. One, how fast can we move out, because we believe that if we get to 400 or so centers, we can cover the full range of the population, the acceptability would be there. And then second, the quality of the data, so that physicians feel compelled to refer even if there's a risk that the patient has moved to another center.\n\nI think, in general, oncologists want what's best for their patients in all cases. And so I think that's going to be the other part of the story. For more specific data, let us come back to you. We have to probably do some more work in terms of the specifics of community oncology versus large-scale centers and where the patients are in that broad metastatic population.\n\nIn terms of the guidance, Harry?\n\nHarry Kirsch -- Chief Financial Officer\n\nGraham, I was expecting that question, of course. But I would say we are guiding for the total company mid-single-digit top line and bottom line on our core sales and core bank. We have delivered on the company for the first 9 months 5% and 6%. And I expect, without getting into a very detailed Quarter 4 guidance, that we are roughly in that range again in Quarter 4.\n\nBut of course, you have to take into account that U.S. Gilenya now has a generic entry, so maybe the top line a little bit less than the year to date, but a good mid- to high single digit on the bottom line. So overall, I think you see on the first nine months that we are very much on track for the guidance. If it's a little bit stronger on the bottom line, so be it.\n\nBut I think it is roughly in line with what you have seen so far.\n\nVas Narasimhan -- Chief Executive Officer\n\nThanks, Graham.\n\nOperator\n\nYour next question comes from line of Matthew Weston, Credit Suisse.\n\nMatthew Weston -- Credit Suisse -- Analyst\n\nIt's a simple question for Harry on tax. Obviously, you've changed guidance for full year '22 with a reduced tax rate and you highlighted the change in geographic mix. Harry, I wondered if that new lower tax rate is the best indication for 2023 or whether or not you see any meaningful changes that mean it's not a good indicator for the midterm?\n\nHarry Kirsch -- Chief Financial Officer\n\nYes. Thank you, Matthew. So overall, there is always a bit of volatility on geographic profit mix. Then we adjust, if you will, to each quarter to what we believe is our full-year estimate on the core and reported taxes.\n\nSo basically, we moved our full-year estimate from 16.9%, as we had in the first 6 months, to 16.5%. Now I would -- again, we give detailed guidance, of course, for '23 then when we have our full-year results in January or early February actually. And then -- but I would expect the tax rate to be in that range of 16.5% to 17.5%. We will update you with that then early February.\n\nVas Narasimhan -- Chief Executive Officer\n\nYour next question comes from the line of Kerry Holford, Berenberg.\n\nKerry Holford -- Berenberg Capital Markets -- Analyst\n\nA follow-up question on Pluvicto. Just looking at Slide 33, it highlights a change to your approach in metastatic setting. So could you confirm why you're now moving to start Phase 2 next year rather than a Phase 3 this year? Can you just clarify those changes and perhaps the opportunity in that setting as well, please?\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Kerry. In the non-metastatic setting, the way our previous study was designed and based on feedback from the various investigators and the FDA, we believe the PSMA4 study covers the population that we had previously believed we needed to do an additional study for. So we redesigned our program to generate additional data in a different -- I don't have the detail at hand, but a different population within the non-metastatic setting.\n\nI would also say we're evaluating now Pluvicto as well in earlier lines of therapy to see if we can delay progression as well as evaluating combination therapies as well given the overall interest we've seen on the medicine and the clinical profile that we're seeing. So that's the reason we made that switch, based on the understanding from the regulators and experts in the United States.\n\nOperator\n\nYour next question comes from the line of Richard Vosser, J.P. Morgan.\n\nRichard Vosser -- JPMorgan Chase and Company -- Analyst\n\nWhen I look at the latest prescriptions for Tafinlar Mekinist, they seem to have gone more into a decline in Q4. Is there anything that we should think about in terms of the dynamics you're seeing in the melanoma market, perhaps likely approval impacting those two brands that we should not think of the strong growth we've seen thus far continuing beyond for the brand?\n\nVas Narasimhan -- Chief Executive Officer\n\nYes. Thanks, Richard. I mean, overall, I think we didn't note any significant change, [Inaudible] us any significant competitive issues with respect to Tafinlar Mekinist in the U.S. or in our other key markets.\n\nBut I think it's a good question and let us do some homework and get back to you. I don't think we have the answers straight in hand.\n\nOperator\n\nYour next question comes from the line of Mark Purcell from Morgan Stanley.\n\nMark Purcell -- Morgan Stanley -- Analyst\n\nVas, could you help us understand the scope of the free trial offer on Leqvio when it comes to patient initiation and what -- and how that might influence increase in ACP adoption? And then secondly, on the interest of LOE in China, what's the latest situation there in terms of your best guess?\n\nVas Narasimhan -- Chief Executive Officer\n\nSo on the pretrial offer, really, the idea was to -- while we already provide payment terms that allow physicians to stock doses and have time to get reimbursed before they would have to ultimately pay for the doses, we also noted that for some physicians, there was a need to provide an alternative option to get them comfortable to start to stop the medicine. So in July, we rolled out a free trial offer program that provides a dose -- first dose for a patient free and then -- so the physician can get comfortable, use those doses and then hopefully then pull through to follow, keep the patient on therapy as they also get comfortable with the buy and bill process. We've had a very strong uptake of that program. And so I think over 1,000 physicians plus have signed up for the free trial offer program at the last look, which was still a month ago.\n\nSo that's been a very positive step, I think, to get more physicians to stock Leqvio in the offices so that ultimately they can provide it to patients and then hopefully get more comfortable with an ongoing procedure to start the medicine, provide the medicine and get reimbursement. Now with respect to Entresto in China, we currently are continuing our discussions with the -- our, I guess, our litigations with the -- in China against the various generics. I mean at this point in time, we would expect Entresto to be fully on -- protected through '23 and '24 and then impacts in '25 and beyond. But that's something we'll have to continue to look at because it's an evolving landscape with respect to data protection and the ongoing litigations that we have in the country.\n\nSo we'll keep you updated accordingly. And I believe with that, we've cleared the entire question queue. I want to thank everyone, and apologies for the two technical disruptions. And we'll look forward to keep you up to date over the course of the remainder of this year.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSamir Shah -- Global Head of Investor Relations\n\nVas Narasimhan -- Chief Executive Officer\n\nHarry Kirsch -- Chief Financial Officer\n\nGraham Parry -- Bank of America Merrill Lynch -- Analyst\n\nWimal Kapadia -- AllianceBernstein -- Analyst\n\nRichard Parkes -- Exane BNP Paribas -- Analyst\n\nEmmanuel Papadakis -- Deutsche Bank -- Analyst\n\nMatthew Weston -- Credit Suisse -- Analyst\n\nSimon Baker -- Redburn Partners -- Analyst\n\nRichard Wagner -- Wolfe Research -- Analyst\n\nStephen Scala -- Cowen and Company -- Analyst\n\nKerry Holford -- Berenberg Capital Markets -- Analyst\n\nRichard Vosser -- JPMorgan Chase and Company -- Analyst\n\nEmily Field -- Barclays -- Analyst\n\nKeyur Parekh -- Goldman Sachs -- Analyst\n\nMark Purcell -- Morgan Stanley -- Analyst\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nFlorent Cespedes -- Societe Generale -- Analyst\n\nAndrew Baum -- Citi -- Analyst\n\nPeter Welford -- Jefferies -- Analyst\n\nMore NVS analysis\n\nAll earnings call transcripts"
}