{
  "companyName": "Stereotaxis",
  "companyTicker": "STXS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/stereotaxis-stxs-q2-2022-earnings-call-transcript/",
  "content": "Stereotaxis (STXS)\nQ2 2022 Earnings Call\nAug 09, 2022, 10:00 a.m. ET\n\nOperator\n\nGood morning. Thank you for joining us for Stereotaxis' second quarter 2022 earnings conference call. Certain statements during the conference call and question-and-answer period to follow may relate to future events, expectations and, as such, constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the company in the future to be materially different from the statements that the company's executives may make today.\n\nThese risks are described in detail in our public filings with the Securities and Exchange Commission, including our latest periodic report on Form 10-K or 10-Q. We assume no duty to update these statements. [Operator instructions] As a reminder, today's call is being recorded. It is now my pleasure to turn the floor over to your host, David Fischel, chairman and CEO of Stereotaxis.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nThank you, Operator, and good morning, everyone. I'm joined today by Kim Peery, our chief financial officer. We are operating in an environment that remains very similar to what I described on our last call in May. It is both a challenging and exciting period for Stereotaxis.\n\nThe macro business environment remains littered with a host of pandemic-related supply chain, regulatory, personnel and economic disruptions. We saw a nearly 70% reduction in China procedure volumes during the second quarter, continued to see delays to hospital purchasing decisions and construction projects, have not yet observed an improvement in supply chain reliability and see inflationary pressures on various expenses. The optics of our financial results in the quarter reflect these challenges, particularly the delays in hospital construction, with negligible system revenue recognized in the quarter contributing to reduced revenue compared to last year's second quarter. Despite these pressures and the poor optics of our financial results, Stereotaxis is making significant progress commercially and technologically.\n\nI'm pleased with our progress and confident in where we stand and the path ahead of us. We have continued demand for our technology. We are advancing a transformative innovation pipeline. We are assembling an all-star commercial team.\n\nAnd we are doing all this while maintaining financial stability and strength. Let me first touch upon our recent commercial performance. During the second quarter, we received three orders for Genesis systems, two of which were received since our last call. All three of the orders came from the United States.\n\nTwo orders are replacement-cycle systems where Genesis will replace aged Niobes at existing hospitals. The third order is unique and exciting. An existing hospital customer who already operates a successful robotic EP program decided to establish a second robotic lab at the same hospital. This is a prestigious hospital led by a key opinion leader in the field and will be the first EP program in the U.S.\n\nwith two of our robotic systems. Our continued pace of Genesis orders bodes well for future financial results, as we now have over $12 million in backlog of system orders waiting to be shipped, installed and converted into revenue. While timing of revenue recognition is often outside of our control and dependent on hospital construction, orders in our backlog are essentially guaranteed, with an over 99% conversion rate and significant nonrefundable down payments providing confidence in their realization. Our efforts to grow capital sales are performed alongside a continued commitment to the success of existing robotic practices and the development of the holistic commercial infrastructure that drives such success.\n\nTwo highlights from the second quarter include graduation of an additional cohort of Fellows in our Robotic EP Fellows Program and the publication of the robotic special issue in the Journal of AFib. 11 Electrophysiology Fellows graduated from our Fellows program in the past quarter. We expect to graduate 19 this year, and in total, 65 Fellows have graduated from our program globally since it was launched. These Fellows represent the future of the field and enter it with appreciation and confidence in our technology, which bodes well for us going forward.\n\nThe body of clinical literature supporting the clinical value of robotics in EP also substantially increased, with 16 peer-reviewed publications included in a special issue of the Journal of AFib in June. The publications covered a broad range of topics, including the use of our technology across the spectrum of arrhythmias and in several more novel ways, alongside various preoperative imaging and intraoperative mapping technologies without the use of X-ray and remotely over long distances. We continue to view the quantity and quality of clinical data on our technology as a strong foundation for future adoption. Most impactful to our mid- and long-term commercial performance remains the realization of Stereotaxis' strategic innovation plan.\n\nAs a reminder, our innovation strategy consists of five key pillars: a mobile system that enables broad accessibility of robotics; our own independent ablation catheter portfolio; devices that expand our technology to new endovascular indications; a China-specific product ecosystem; and a digital platform for broad operating room connectivity. Each of these will individually serve as substantial growth drivers that dwarf our existing business, but the five efforts are also synergistic and collectively serve as a foundational product ecosystem in our mission to transform endovascular surgery with robotics. We were very pleased a month ago to announce CE Mark submission of our proprietary robotically navigated ablation catheter, MAGiC. Submission of MAGiC reflects the culmination of an extensive design, development, manufacturing and testing effort, and I want to congratulate the many individuals who were instrumental in that effort.\n\nThe submission was made on schedule with the timeline we provided at the start of this year and complies with the recent more stringent MDR regulations in Europe. While the timeline for approval of the catheter is not knowable at this stage, we are preparing for commercialization upon receipt of CE Mark as early as year-end. The catheter design builds upon nearly 20 years of experience and learnings since the existing Biosense magnetic catheter was developed, and we are very excited for the clinical, commercial and strategic benefits MAGiC will provide. Beyond this significant milestone with MAGiC, we are methodically advancing the other technological pillars to our innovation strategy.\n\nThese are advancing against the headwinds of supply chain challenges, of COVID quarantine in China, personnel disruptions and the regulatory distractions caused by MDR in Europe. Despite those, we still view an initial launch of the mobile robot around this time next year as realistic, and the hardware, electronics and software aspects of the system are advancing nicely. The MicroPort and Stereotaxis collaboration continues to progress well, and we view a comprehensive product ecosystem in China coming together during the second half of 2023. Ramping up production of guidewires for the required regulatory testing has gone slower than projected at our contract manufacturer, and we now expect regulatory approvals and an initial launch in the first half of 2023, rather than at the start of the year.\n\nFinally, submission of an application to the FDA to initiate a prospective IDE trial for the MAGiC catheter is currently waiting on certain animal trials that we expect to complete by year-end. Development progress is inherently nonlinear, particularly in this environment, but we are pleased by the breadth and quality of impactful developments being advanced. The methodical progress across multiple fronts on our innovation strategy brings us closer to a commercial breakout and consistent long-term revenue growth. As our technology pipeline becomes derisked and approaches the market, we are placing increased focus on ensuring the right commercial team, infrastructure and processes are in place to drive substantial revenue growth.\n\nI was very excited to be able to announce last week that teo highly experienced and successful commercial leaders are joining Stereotaxis. Frank Van Hyfte and Tim Glynn bring to Stereotaxis decades of significant and highly relevant experience. They have scaled businesses like ours in order of magnitude larger and lived through the complexity and rapid pace of pioneering new markets. Their skill sets and geographical focuses are complementary to each other and are complementary and additive to our commercial leaders, Mike Tropea and Casey Payne.\n\nThat we were able to find leaders of this caliber to enthusiastically join us is a testament to the opportunity in front of us and the company we are building. I personally feel grateful to have these commercial leaders as partners in our journey and encouraged by the fact that their leadership will guide our commercial activities. The puzzle pieces are starting to come together on both the technological ecosystem and commercial organization. Our progress on both these fronts supports substantial long-term growth in electrophysiology and, more broadly, in endovascular interventions.\n\nKim will now provide some commentary on our financial results, and then I will make a few financial comments as well before opening the call to Q&A.\n\nKim Peery -- Chief Financial Officer\n\nThank you, David, and good morning, everyone. Revenue for the second quarter of 2022 totaled $6.2 million. This is down from $9.1 million in the prior year second quarter, primarily due to recognizing revenue on just a partial robotics system this quarter, compared to two systems last year. Recurring revenue for the quarter was $5.6 million, compared to $6.1 million in the prior year second quarter, reflecting headwinds in procedure volumes and some reduction in service revenue as hospitals approach replacement cycles.\n\nGross margin for the second quarter of 2022 was 76% of revenue, with system gross margin of 16% and recurring revenue gross margin of 83%. Operating expenses in the quarter of $9.8 million included $2.7 million in noncash stock compensation expense. Excluding stock compensation expense, adjusted operating expenses were $7.2 million, consistent with the prior year second quarter. Operating loss and net loss for the second quarter of 2022 were both $5.2 million, compared to $3.4 million and $1.2 million in the previous year.\n\nAdjusted operating loss and adjusted net loss, excluding noncash stock compensation expense, were $2.5 million in the current year quarter, compared to negative $0.6 million and positive $1.6 million in the prior year quarter. Negative free cash flow for the second quarter was $1.8 million, compared to $0.1 million in the prior year second quarter and $1.2 million in the second quarter of 2020. At June 30, we had cash and cash equivalents of $35.1 million and no debt. I will now hand the call back to David.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nThank you, Kim. I wanted to add a few additional comments on two key topics: revenue expectations for the remainder of this year and our balance sheet and financial stability. On the first topic, we view the revenue reported this quarter as a nadir in our performance. Our pace of system orders and current system backlog of over $12 million supports our prior guidance of system revenue and overall revenue growth for the year.\n\nIf we were able to install all the systems in our backlog, we would expect approximately $15 million in system sales for this year. Typically, we have discussed an approximate three- to 12-months timeline between when a robot is ordered to when it is shipped or installed for revenue recognition. We have seen significant variability in these timelines, with various hospital projects delayed long beyond what our customers originally expected. Those hospital construction delays introduce risk that a sufficient portion of backlog may not be recognized this year and, instead, next year, introducing caution to that guidance.\n\nAs all of the orders in our backlog will be delivered eventually, any such delays would generate revenue growth in the coming year. The significant timelines associated with capital purchases and hospital construction reinforce the importance of our strategy to make robotics broadly accessible by bypassing logistic and construction complexities. As mentioned earlier, based on our current progress we expect commercial availability of our mobile robot by the middle of next year. On the topic of financial stability, we are obviously cognizant of evolving macro concerns and the potential for extended periods of economic and capital market pressure.\n\nOur commitment to managing Stereotaxis in a financially prudent and disciplined fashion serves us well in that environment. Recent inflationary pressures have started to impact various costs for supplies, services and transportation. We are working to mitigate cost increases and overall remain confident in our financial position and ability to manage the business with a modest controlled burn as we invest for growth. While we had higher than normal cash utilization in the first half of this year, much of this was due to increased spending on inventory and onetime costs to establish our new headquarter.\n\nWe expect continued investment in inventory in the back half of the year, but expect to end the year with approximately $32 million in cash and no debt. I view our normalized operating business as having approximately a $1 million cash burn rate per quarter. That financial prudence, combined with our strong balance sheet, leaves us in a comfortable position to continue advancing our strategy in a self-sufficient fashion without the need for additional financings. I recognize the poor optics of our financial results, but view this alongside a confidence that our fundamental progress is significant and position is strong.\n\nWe have continued demand for our technology, we are advancing a transformative innovation pipeline with multiple impactful launches in 2023 and beyond, we are assembling an all-star commercial team, and we are able to do this while maintaining financial stability and strength. We look forward to now taking your questions. Operator, can you please open the line to Q&A?\n\nOperator\n\n[Operator instructions] We will now take our first question from Josh Jennings, with Cowen. Please go ahead.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nHi. Good morning. Thanks for taking the questions. David, it was great to see some new system orders come in this quarter, and our check suggests that demand for robotic navigation is building.\n\nI was just wondering if you could just help us think about the sales funnel, both the replacement channel and the greenfield channel, as we sit here today and relative to earlier in the year.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nJosh, we've continued to make progress on the infrastructure for managing a sales pipeline. I think on the last call we talked a little bit more about that new infrastructure that was being built. And that has been fairly kind of fully operationalized now in the United States and is in the process of being operationalized outside the United States. Overall, the sales funnel looks relatively good.\n\nI don't think there's dramatic differences from the type of commentary we gave at the beginning of the year where we said we had a few dozen, a couple of dozen, more than a couple of dozen, systems in that pipeline, but we have more -- there's better quality of information now that we have the improved capital sales pipeline infrastructure. And then overall, we still see a good range of both replacement cycle and greenfield systems in that pipeline globally, and we've been grinding away at them. I think, like you say, the pace of orders that we've had is consistent with overall guidance that would drive growth this year and that would drive growth in future years. But hopefully, we can also increase that pace at some point.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nAnd just thinking about the order attached to the build-out of the second robotics lab at one of your customer's center, I mean, our sense is that that center is within a big hospital network. And I know we've talked about this before a little bit on the last earnings call as well, but just can you remind us of how you're positioned and your commercial team is attacking IDNs? And any other details you could share about the decision by this EP lab to build out a second robotic lab?\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. So you are correct. That was a good guess that it is a hospital that has a good historical experience with our system, is part of a large IDN across the U.S. and decided based on that experience to buy a second robot.\n\nOverall, I'd say that, obviously, the reason why they adopted a second system is because they have experience with both the clinical value of our technology and with the economic value for the hospital of our technology in allowing them to treat patients that otherwise they wouldn't be able to treat and in driving efficiencies across the system. It was very nice earlier this year visiting the hospital, and the head of the cardiovascular service line was talking so highly about how when they review all their data, how our system has made complex ablations far more efficient and reduced the variability and timelines of those procedures. And so, that kind of was really a vote of confidence, not just from the clinicians but also from the administrators there. From an IDN perspective, we do think that we have sufficient experience in the field, again both from a clinical data perspective and from an economic value from a hospital perspective, to have meaningful conversations with larger IDNs with a goal of having a relationship that spreads robotics more broadly across an IDN and proves that there's value not just when robotics is adopted from a bottom-up perspective, but also from a top-down perspective.\n\nAnd those discussions are obviously larger strategic-style discussion. So it's always difficult to know when or how those will evolve. But we definitely have those discussions and think that at some point that makes a lot of sense for an IDN to enter into. So hopefully, at some point we'll be able to talk to you more.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nThanks a lot, David. Appreciate it.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nThank you, Josh.\n\nOperator\n\nAnd the next question comes from Adam Maeder, with Piper Sandler. Please go ahead.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nHey, David. Hi, Kim. Good morning and thanks for taking the questions. Maybe just to start, one clarification question on the mobile RMN system.\n\nI think I heard you expect launch by [Inaudible] both the U.S. and O-U.S. I just wanted to clarify that. And then, maybe just talk about kind of where are we from a design standpoint, do we have design lock, and just level of confidence in hitting these timelines.\n\nAnd then, I had a follow-up or two.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. Adam, you came out a little bit during your question. So I think I understood it fully, but in case I'm wrong please correct me. So we talked about, given where we are right now in the development process, feeling confident that we should be able to have a launch by this time next year.\n\nI'd say that that would be in one of those two major geographies, either Europe or the U.S. at least, though I would assume that both geographies would be relatively soon after each other. So within a couple of months, within a few months of each other. But at least one of those, we should have a launch by mid-next year.\n\nAnd overall, from a development perspective, again there's the mechanical aspects, the electrical aspects, the control software, the user interface software. So there's various parts that have to come together. There has been all sorts of challenges along the path, particularly on the supply chain side, on the electronic side and also on the capital hardware side. But overall, the parts are coming together.\n\nWe have not yet started V&V testing of a system, but we've done large amounts of the development and overall feel very good where we stand that we'll start the V&V testing prior to year-end and we'll be able to submit for regulatory approval around that time and that that will lead kind of to the timeline we suggested of a launch by midyear.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nThat's very helpful color, David. And then, maybe for the next question, just on the MAGiC RF ablation catheter. I heard the message on expected timelines for Europe and launch there. But maybe I wanted to ask a question on path forward in the U.S.\n\nmarketplace. Just when do you think the U.S. IDE trial can get going? Anything on trial design that you can share at this point in time? And ultimately, how do we think about potential U.S. approval for that technology?\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. So the European submission required a huge body of testing, kind of bench testing, lab-related testing. It required a whole range, I mean, dozens of animal studies and did not require a human study. It will require a post-approval study in the E.U.\n\nIn the U.S., we have all of those same requirements, and the vast majority of the CE Mark dossier will be identical or nearly identical for the U.S. IDE submission. And so, that's kind of all set and all ready. We do have, though, a few, about a dozen, additional animal studies that were requested by the FDA beyond the few dozen studies that we submitted for the European submission.\n\nAnd those animal studies require kind of a follow-up period, a relatively short but still a follow-up period. And so, we've been building out -- in order to run those studies we've been developing our own animal study capability. And that has been really the -- that's the one gating factor to being able to complete those studies and submit the IDE to the FDA. And so, we expect to complete those studies before year-end and to be able to submit the IDE kind of immediately upon that.\n\nWe've had multiple discussions with FDA so far. So we have a fairly clear understanding of what the trial design should be. And I would expect around, let's say, a 150-, or so, patient study in one specific clinical indication, one specific type of arrhythmia, with a relatively short follow-up of a maximum three-month follow-up. And so, given that it's a very common arrhythmia, given that we have an installed base of users and the catheter would be able to be used either with the Niobe or the Genesis system so we can really benefit from our full installed base there, I think that that's a trial that should enroll very quickly.\n\nOnce we gain IDE approval and we can actually start the study, both enrollment and follow-up should happen fairly quickly.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nOK. Great. That's very helpful color. And if you don't mind, I'm going to try and sneak one more in.\n\nI noticed in the, I think it was in the press release, there was some commentary about the commercial infrastructure and the progress being made there and kind of laying the foundation. And historically, you've been very judicious and conservative with spend. But I also think in the past you've talked about the MAGiC catheter launch kind of being an impetus for kind of going more on the offensive. And I know we're not quite there yet, but just wondering kind of what are the plans looking ahead for commercial infrastructure and building out the team.\n\nJust any additional color you can provide would be much appreciated.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. So yes, I think you're completely right that we are -- we take seriously our commitment to running the company in a financially judicious fashion. I think that that discipline does create a lot of value for Stereotaxis and it ensures that we don't waste shareholder value and capital. But as now that product ecosystem starts to come together, obviously, the catheter, but also the mobile system and the range of technologies that are coming together, it does obviously warrant focusing more on the commercial team and how to ensure that we have an excellent commercial organization.\n\nAnd so, with that kind of, obviously, Europe is going to be a particular area of focus given the launch next year. Putting in place the right leadership is the first step in that. And as we start the launch and go through the launch, I would expect a fairly substantial build-out of our European commercial team. Again, I think that given the step-up in revenue per procedure that the MAGiC catheter provides, that will be a fairly -- from a financial perspective for the company, a fairly low risk build-out of the team, as you can do that very much hand-in-hand with adoption of the MAGiC catheter at specific accounts.\n\nAnd so, you can do a very kind of laser-focused pinpointed hiring where there's a high ROI for each hire. And so, I think you'll see us kind of probably over the course of next year doing a fairly substantial build-out, perhaps even the doubling of the European team.\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nThanks for the color, David.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd our next question comes from Neil Chatterji, from B. Riley. Please go ahead.\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nHi. Thanks for taking the questions. Maybe just circling back just on the hospital construction environment. Just curious now that we're over a month into the new quarter, just kind of curious if you've seen any signs of improvement here in July and now August and then also if there's any way to potentially characterize any barriers to conversion you would see for the systems that are in backlog.\n\nFor example, are some tied to larger hospital construction projects?\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. Neil, overall, obviously, the commentary we gave today is as of today. So we continue to see delays in hospital construction, where even a couple of the orders that we received late last year, they are where we would have expected to be installing systems around now, it's still unclear whether we are going to deliver systems in a couple of months, a few months or if it's going to take them longer. So there is kind of quite a lot of uncertainty and just kind of delays when it comes to our hospital customers and their own processes in building out labs and getting themselves organized to be ready for us to install.\n\nSo I'd say kind of it still is a fairly messy world out there. On the side of your second question, you kind of asked about uncertainty with conversion. And so, I didn't know if that kind of in terms of the timeline of when an order or backlog would be converted into revenue or risk in terms of the overall will it convert into revenue. Could you clarify that?\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nI mean, maybe just in relation to the construction environment. So just in terms of are some of these tied to larger construction projects where because it's a larger project that's delaying it even more so than if it was just the EP lab conversion.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nIt's a mix. There are some where you have full build-outs of wings or full build-outs of a floor of a hospital. So those are kind of part of obviously a much larger project. Other ones might just be that lab.\n\nBut then oftentimes what you see is that there might be eight labs in a cardiovascular kind of wing of the hospital, and the hospital will just go through lab-by-lab-by-lab. So they're doing Lab 1. When Lab 1 finishes, they're going to do Lab 2. When Lab 2 finishes, they're going to do Lab 3.\n\nAnd we might be Lab whatever in that line. And so, as you have any delays, you have kind of start to impact like a domino effect the labs after them. And so, usually that is a fairly common scenario.\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nGot it. Got it. If I can add another question here. So just curious in terms of switching gears to the potential MAGiC launch in Europe.\n\nJust curious in terms of what your expectation is for how quickly sites could switch over to using MAGiC, including any, I guess, regional nuances you might see there.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. So there's a range, obviously. I'd say kind of there will be -- from a purely logistic and legal ability to launch, upon CE Mark in certain countries we'll be able to launch pretty much immediately. We'll have to have a hospital contract for purchasing the product, but that should happen very, very quickly, and we can be primed to enter into those agreements almost immediately upon CE Mark.\n\nAnd so, that's kind of very easy from a logistics perspective. While in some countries, particularly the Nordic countries and France, let's say, there are tenders, either country tenders or regional tenders, that you have to enter into. So you can usually sell some amount of an approved product outside of the tender under new technology clauses or other things, but you can't pursue wholesale adoption, wholesale transition of a site until you go through that tender. And so, that logistic aspect will mean that in certain countries, certain accounts, there will be only partial adoption for the first, let's say, until you get over those tenders, which could take, let's say, anywhere between six months to a year after CE Mark process.\n\nBut again, at other hospitals, I'd say particularly in Netherlands, Belgium, Germany, some of the other countries, you really have no logistic hurdles once you have CE Mark. The other kind of real effort that we'll have to overcome is obviously that some physicians will be motivated and excited to be the first ones in the world to use it and will be kind of very much pioneering in that effort; while other hospitals, I'm sure, other physicians will want to see that one of their peers has first done 10 cases of arrhythmia A or arrhythmia B and kind of has had good outcomes and will want to be able to speak with that physician and then based on that will be comfortable trying it themselves. And so, that's just kind of the normal variability in physician dynamics. I think kind of we're working hard on our side as an organization to ensure that there is a thoughtful business plan for every one of our 30-some hospital accounts in Europe, where we're thinking about what are the drivers for adoption, how do we kind of approach that with the individual physicians, how do we approach the hospital as an account, if there are any logistics things how do we know exactly what applications and forms and logistic efforts we have to go through to get into the account.\n\nAnd so, I think we're going to kind of be ready. That's our role, is to be ready so that as we gain approval we can move as efficiently as possible and as thoughtfully as possible throughout that process.\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nGreat. Thanks for that. I'll jump back in queue.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\n Thank you.\n\nOperator\n\nAnd we will now take the next question from Alex Nowak, with Craig-Hallum Capital Group. Please go ahead.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Good morning, everyone. I was hoping to expand on the construction question around hospitals, but maybe speak to the capex environment at the hospitals. What is their willingness to go out there and place orders right now, particularly if they're seeing these delays in construction projects? I know some of the peers are seeing a recovery; others not so much.\n\nSo just the current state on the capex for the cath lab.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. Hi, Alex. So overall, obviously, we have been receiving still orders at a relatively regular pace. We still see a pipeline of hospital customers that are interested.\n\nAnd so, I'd say that you are right that when there are construction delays that does oftentimes lead to delays in us receiving an order. But at some point, they need to order. And then, there might be delays even after that, beyond what they thought were the delays that they were expecting. And so, I mean, definitely, there have been delays of orders because of the construction dynamics at hospitals.\n\nBut in the end of the day, the world is still running, hospitals are still operating, they still need to upgrade labs, they still need to build new labs. And so, those delays do impact the order schedules, but orders do get done. And then unfortunately, sometimes they get done and then you still have delays after that, and then you're waiting kind of on the sideline to be able to deliver and install. But again, that's really kind of a matter of timeline, not a matter of if.\n\nAnd so, we kind of -- we sit here and do our best given that environment.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nUnderstood. And then, maybe expand on the real-world study of MAGiC in Europe. What is that going to look like? How many patients? Follow-up time? And is there a specific number of selected? Or is this just going to be basically depending on demand?\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSo the post-market study in Europe, that will be defined more clearly in our discussions with the notified body in Europe over the next few months, I assume, as we get questions. And so, we've proposed kind of a study design to them. Overall, again, I would not view -- that will be kind of across a broader range of arrhythmias, probably kind of in the low hundreds of patients overall. We'll be able to do that across a broad range of our sites in Europe.\n\nAnd so, overall, kind of we think that will be a good trial for just building relatively broad kind of data on the catheter in Europe. Given that it's kind of post approval, there's kind of obviously somewhat less pressure on that. But obviously, it will be important for us to be able to run that trial and to be able to kind of show that there's value across a broad range of arrhythmias through that trial.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nOK. Got it. And then just lastly, just a clarification. What is the system backlog right now? I think it was $12 million, $1.5 million per system roughly.\n\n[Inaudible], is that the right number?\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSo it's over $12 million of system backlog. It's a little bit complicated to define it as exactly one system. Because as you saw, let's say, in the second quarter, we reported revenue on kind of half of a system. We have both the X-ray component, the robot component, there's also sometimes the large screen display component.\n\nAnd so, we have some hospitals where there is a mix of those kind of in play. But in total, yes, kind of it's a mid- to high-single-digit number of systems that come up to that. There's some half-systems out there where we've shipped one of the parts but not the other part. And so, kind of it's a partial shipment.\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nI see. I understand. All right. Thank you.\n\nOperator\n\nWe will now take our next question from Frank Takkinen, with Lake Street Capital Markets. Please go ahead.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nHey, David, thanks for taking my questions. I wanted to ask a little bit more on the mix of replacement versus greenfield. You provided some color around the funnel, and I think what I heard was dozens. Maybe just talk to what the mix of that looks like from a replacement versus greenfield perspective and then how you expect that to trend on a go-forward basis.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. Frank, overall, it's a good mix between the two. I'd say a relatively even mix. And when we look at the late-stage pipeline, I think there is more and more -- the replacement cycle that we've talked about in the past is becoming more and more real.\n\nYou see that, obviously, in the results of the last quarter. I expect it also probably in the results in kind of the upcoming quarters. There's definitely kind of -- some of those replacement projects are now taking place. And so, kind of we are seeing some of those now come through.\n\nWith that, I'd say that, obviously, from a fundamental perspective for us as a company, driving greenfield adoption is valuable. And so, we're putting kind of more and more focus there, and we still have a range of greenfield hospitals in the pipeline. And so, I think you'll kind of see a mix, but I'd say that at least in the very late stage pipeline it's probably skewed more toward the replacement side.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nOK. That's helpful. And then, maybe just an update on utilization. I know some of the newer sites have been trending above some of the legacy sites.\n\nSo maybe just any color you could provide about utilization in the quarter and how that's been trending.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSo if you exclude the dynamic of kind of Asia, last quarter, overall, the utilization has been -- I don't have the exact numbers again for the Genesis installs or the new greenfield installs that we just had from the beginning of this year. But overall, the utilization has remained very nice and kind of above average levels in the second quarter. And so, kind of we're very happy with the way the greenfield sites and Genesis systems are being used. I don't know if anyone on the call had an opportunity, the new launch that we had in Warsaw in the first quarter, late in the second quarter, they had a conference that they hosted at their hospital.\n\nTwo of I think out of four live cases from that conference were using our technology. They had a lot of commentary at that conference where they commented how impressed they were with the system, how they were using it across the broad range of arrhythmias. And so overall, kind of I'd say that the experience at our existing sites, the new launches, the Genesis sites has been overall very nice. And so, that's kind of -- and outside of that, I'd say overall utilization remains kind of relatively stable.\n\nWe have kind of sometimes pressures like the second quarter in Asia Pacific, but overall, have a relatively sticky recurring revenue base. And so, that kind of has been obviously a bright spot in allowing us to have kind of an overall stable foundation to the business upon which to build upon.\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nOK. That's helpful. I'll stop there. Thanks for taking my questions.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nThanks, Frank.\n\nOperator\n\nWe will now take the next question from Nathan Weinstein, with Aegis Capital. Please go ahead.\n\nNathan Weinstein -- Aegis Capital -- Analyst\n\nHi, David. Good morning and thanks for taking my questions. These questions are about the innovation sellers, basically. Can you remind us from your perspective what you see as the top endovascular adjacencies that could be most attractive [Inaudible] Stereotaxis? And then, secondly, any update on the China-specific product ecosystem? And does that remain an attractive opportunity as you see it?\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. So let me touch upon both of those. So from an endovascular intervention kind of as an adjacency to what we're doing in electrophysiology, that's kind of obviously one of the big pillars of our growth. I think our technology, the robotic magnetic navigation, the concept of moving endovascular devices from their distal tip and, by doing so, allowing for precision and safety and reach and stability that otherwise is not possible with a manual catheter, I think that's kind of has inherently a lot of advantages across a range of endovascular surgery.\n\nAt our kind of R&D Innovation Day that we hosted late last year, we talked about five specific clinical applications where there is kind of challenge and unmet medical need that we think can be addressed very nicely with robotics with our technology. And so, we are kind of building the ecosystem of interventional devices, guidewires, guide catheters, that can be used across those clinical applications. I think places like neuro intervention, where you have particularly complex anatomy, particularly delicate anatomy, there's significant unmet medical need with many patients not getting therapy at all or not getting the therapy that would be beneficial to them, those are particularly kind of attractive areas that I think we can provide a lot of value in. But again, there were kind of all five of the clinical areas where we kind of have our sights on.\n\nThe others outside of neurointervention being interventional cardiology, peripheral arterial disease, AAA grafts and embolization for cancer. And so, I think kind of those five are where we currently have our sights on. And as we bring out the right tool set to address them, I think you'll kind of hopefully see in the first year or so a range of clinical literature addressing kind of multiple different clinical specialties. And on the China side, obviously, the disruptions and the quarantines [Inaudible] in the second quarter were not very beneficial to overall progress, but it was very impressive continuing to work with the MicroPort team even while many of them were in quarantine and advancing the range of this kind of product ecosystem that we're developing together in China.\n\nAgain, the product ecosystem includes obviously regulatory approvals for our robots, an X-ray system, mapping integration with MicroPort's mapping system and then a range of ablation and potentially diagnostic catheters also in China, bringing the MAGiC catheter there, development of several MicroPort catheters. And so, there's kind of quite a lot going on in that collaboration. And overall, kind of we're very, very happy and very pleased to see the way that that collaboration is working well together, the way we're developing a range of -- advancing a range of the technologies together there. And so, I think kind of the right ecosystem coming together, like I said in the prepared remarks, should be available in the second half of next year.\n\nProbably kind of different aspects of that ecosystem will come in and be available at different times, but that's kind of coming all together. I think kind of as we start to get toward the back half of next year, you'll start to see kind of that coming into play. And that's really when you can start to benefit from the substantial commercial organization of MicroPort in really driving kind of broader adoption across, again, a fairly large sales team.\n\nNathan Weinstein -- Aegis Capital -- Analyst\n\nGreat. Thank you, David.\n\nOperator\n\nOur next question comes from Javier Fonseca, with Spartan Capital. Please go ahead.\n\nJavier Fonseca -- Spartan Capital -- Analyst\n\nHello. Thanks for taking my question. I have a quick question on the front for capital sales. So with the underlying macro challenges that we've seen so far in 2022, how has overall commercial strategy for new system installs changed? I know the science is still there, it's still a good system, there's still demand, but in the face of all these challenges has there been any two or three changes to overall strategy?\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nJavier, no, I don't think there is any real change to the overarching strategy. The overarching strategy is, obviously, we have a technology which provides a lot of value. We have still very small market share, less than 1% market share, of just the electrophysiology market. I think the clinical value and healthcare system value that we provide [Inaudible] a substantially higher market share in electrophysiology.\n\nAnd so, we are doing the right things on the commercial side to gain a fair share of that market. And then in tandem, obviously, doing the strategic innovations that allow us to kind of gain adoption much more easily than the current product setup, which requires construction, that provides us with our own proprietary disposable, giving us the ability to build sales teams in a different fashion, in a much more substantial fashion, and building out the technology ecosystem so that it can be used across multiple clinical applications and not just electrophysiology. And so, I think that strategy is very sound, and we're continuing to advance that.\n\nJavier Fonseca -- Spartan Capital -- Analyst\n\nOK. Thank you very much. No follow up question.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nThank you, Javier.\n\nOperator\n\nAnd we have a follow-up question from Josh Jennings, with Cowen. Please go ahead.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nHi, David. Thanks for taking the following up David and Kim, sorry. I wanted to just ask about the neurovascular indication. I mean, since the Innovation Day in December there's been a number of months.\n\nI'm sure you've interacted with some neurovascular interventionalists and neurosurgeons. And I wanted to just hear from you what type of feedback you've gotten there, any specifics on clinicians' views on the clinical value proposition. And then your team's internal, I guess, optimism level, I'm sure it's increased over the last seven months, but if you could share that that would be great. I think you gave some, provided part of the answer already in one of the previous questions, but I appreciate the follow-up.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nSure. So actually, in the second quarter, we hosted two neurosurgeons from two different hospitals who came to St. Louis and were working with us, with the devices we've developed with [Inaudible]. We'll have probably a few more visiting us late in the third or early fourth quarter.\n\nAnd so, we've kind of had a -- we've been fortunate to benefit from kind of a fairly passionate group of prestigious neurosurgeons who have been helping us in that development. And overall, I think that kind of the clinical value of being able to navigate tortuous vasculature is significant in neuro intervention, whether you look at from [Inaudible] cases, kind of aspiration cases, for ischemic stroke or you look at coiling cases for hemorrhagic stroke, there are a large range of patients who do not get therapy at all or who when the physician is trying to reach the site that needs therapy could struggle for 20, 40, 60, 80, 100 minutes trying to just get through the tortuous vasculature. And obviously, in stroke, time is brain. And so, there's a lot of clinical value to be had if you can improve the efficiency of reaching the target site and you can do so in a safe fashion.\n\nAnd so, I think that's really what motivates those physicians, is that they see that with our tools they can get places that otherwise they wouldn't be able to get or they can get to places much more efficiently, much more quickly without using a whole range of tools. And so, that is kind of really where the value proposition is. And I think kind of as we get those tools to market, that will allow us to start to obviously prove it in the clinical literature.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nAppreciate it. Thank you.\n\nOperator\n\nAnd we have no further questions for today's call. So I would like to turn the call back to David Fischel for any additional or closing remarks.\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nOK. Thank you very much, everyone, for your questions and for your continued support. We look forward to working hard on your behalf in the coming months and speaking again next quarter. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDavid Fischel -- Chairman and Chief Executive Officer\n\nKim Peery -- Chief Financial Officer\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nAdam Maeder -- Piper Sandler -- Analyst\n\nNeil Chatterji -- B. Riley Securities -- Analyst\n\nAlex Nowak -- Craig-Hallum Capital Group -- Analyst\n\nFrank Takkinen -- Lake Street Capital Markets -- Analyst\n\nNathan Weinstein -- Aegis Capital -- Analyst\n\nJavier Fonseca -- Spartan Capital -- Analyst\n\nMore STXS analysis\n\nAll earnings call transcripts"
}