{
  "companyName": "Western Digital",
  "companyTicker": "WDC",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/western-digital-wdc-q1-2023-earnings-call-transcri/",
  "content": "Western Digital (WDC -0.06%)\nQ1 2023 Earnings Call\nOct 27, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and welcome to the Western Digital first quarter fiscal 2023 earnings conference call. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Peter Andrew. Please go ahead.\n\nPeter Andrew -- Vice President, Investor Relations\n\nThank you, and good morning, everyone. Joining me today are David Goeckeler, chief executive officer; and Wissam Jabre, chief financial officer. Before we begin, let me remind everyone that today's discussion contains forward-looking statements, including product portfolio expectations, business plans and performance, demand and market trends, and financial outlook based on management's current assumptions and expectations, and as such, does include risks and uncertainties. We assume no obligation to update these statements.\n\nPlease refer to our most recent financial report on Form 10-K filed with the SEC for more information on the risks and uncertainties that could cause actual results to differ materially. We will also make references to non-GAAP financial measures today. Reconciliations between the non-GAAP and comparable GAAP financial measures are included in the press release and other materials that are being posted in the Investor Relations section of our website. With that, I'll now turn the call over to David for introductory remarks.\n\nDavid Goeckeler -- Chief Executive Officer\n\nThank you, Peter. Good morning, everyone, and thank you for joining the call to discuss our 2023 first quarter results. I am pleased to see the Western Digital team work together to deliver revenue at the upper half of the guidance range in the midst of an incredibly dynamic and challenging macroeconomic environment. We reported first quarter revenue of $3.7 billion and non-GAAP operating income of $307 million.\n\nOur operating income performance was above the midpoint implied by our guidance and demonstrated our ability to actively respond and navigate this environment. Our non-GAAP earnings per share was $0.20 and included an approximately $0.30 impact due to higher than forecasted tax rate. Overall, the actions we have taken over the past few years are enabling us to manage through business cycle troughs more effectively and position the company to thrive as market conditions improve. These efforts have reinvigorated the Western Digital innovation engine and strengthened our product portfolio.\n\nIn particular, we are leading the transition to SMR-based hard drives alongside our cloud customers, showcasing our product leadership. In flash, we have nearly tripled our bit shipments in the NVMe enterprise SSD product category as compared to the last down cycle, adding another large and growing end market in which we can allocate our flash bits. Our industry-leading innovation, diversified portfolio, and broad go-to-market strategy across cloud, client, and consumer end markets allow us to enjoy strong relationships with our customers and meet the full range of storage needs. The breadth of markets we address also offers us unique visibility into end-market demand signals, which allowed us to recognize potential challenges to our business as they unfolded.\n\nWe have proactively and effectively managed our business through weakening consumer demand by optimizing product mix and rightsizing our hard drive manufacturing footprint. As part of these efforts to manage through this part of the cycle, we are reducing our capital investments and operating expenses as we move to align our cash flow and cost structure with market conditions. Wissam will go over our efforts in more detail. As we closely monitor the macro environment, we are encouraged to see retail flash and channel demand leveling out and orders from PC customers stabilizing, a sign that consumer-led inventory correction is abating.\n\nWe believe the long-term growth in flash demand, combined with reduced flash industry supply will restore supply and demand balance in the next couple of quarters. Before I jump into updates on our HD and Flash businesses, I want to provide a short update on our strategic review process. The executive committee of our Board, which I lead, continues its process, which I previously announced includes the participation of Elliott Management under a non-disclosure agreement. Given the ongoing nature and confidentiality of the process, we will not be answering any questions about the strategic review today.\n\nWe will provide updates as we have them. Now turning to our HDD business. During the first quarter, our HDD revenue declined modestly as we had forecasted in August. Sequentially, total HDD and nearline exabyte shipments were both flat.\n\nContinued momentum with U.S. cloud customers and accelerated adoption of SMR hard drives were offset by softness in other capacity enterprise product channels and consumer HDD demand. Shipment of capacity enterprise drives based on SMR technologies exceeded 25% of this category, one quarter ahead of our expectations. We now expect SMR to represent over 40% of our capacity enterprise exabyte shipment exiting fiscal year 2023.\n\nSMR adoption drove a 19% sequential and 21% year-over-year increase in average capacity to 17 terabytes per capacity enterprise drive, and our 20-terabyte drive exabyte shipments increased more than 150% sequentially. We are deep into the process of qualifying our latest generation of hard drives, including our 26 terabyte UltraSMR hard drives at multiple U.S. cloud and OEM customers. Interest in SMR from other hyperscalers worldwide is increasing as the 20% capacity gain offers multi-generation TCO benefits to the most complex data centers worldwide.\n\nLooking ahead, our U.S. cloud customers have started sharply reducing their hard drive inventory alongside other components for their data center build-outs. This, along with continued subdued demand across markets in China, will impact near-term demand over the next few quarters. Despite these near-term corrections, it is clear from our conversations with these customers that HDD products will be the foundational storage for their continued cloud build-out in the years to come.\n\nOur product leadership and innovation engine remain as strong as ever and we are confident that Western Digital's hard drive business will thrive over the long term as demand improves and new products continue to ramp. Turning to flash. Revenue was slightly ahead of our expectations. Thanks to our broad portfolio, diverse routes to market, and leading brands, including WD Black, SanDisk, and SanDisk Professional that are recognized globally for their cutting-edge innovation, performance, and quality.\n\nI'm pleased to say that we exceeded our bit shipment forecast this quarter. Our client SSD products for PC OEM, retail, and mobile drove the upside in bit shipments. Average capacity per client SSD increased 24% sequentially and 54% year over year, driven by doubling of standard storage capacity for PCs sold by multiple OEMs. This is another reminder of the insatiable demand for data storage and the resilience of flash demand as price elasticity drives increased consumption per device.\n\nOn the technology front, BiCS5 accelerated to over two-thirds of our flash revenue in the September quarter, up from about half in the previous quarter. BiCS6 yield and development of subsequent 3D NAND flash are both progressing well. For the December quarter, we expect flash shipments to increase sequentially, led by seasonal strength in retail and mobile. With the abrupt change in market conditions, we are acting decisively to adjust our supply trajectory to align with demand.\n\nWe are pushing out BiCS6 transition to meaningfully reduce our capital expenditures for fiscal year 2023 which may offer us a potential opportunity to leapfrog to a future BiCS technology node as demand normalizes. With that, let me now turn the call over to Wissam, who will discuss our first quarter results in greater detail and provide an outlook for the second quarter.\n\nWissam Jabre -- Chief Financial Officer\n\nThank you, David, and good morning, everyone. As David mentioned, revenue was in line, thanks to our team's agility and resilience in managing through this dynamic environment. Total revenue for the quarter was $3.7 billion, down 17% sequentially and 26% year over year. Non-GAAP earnings per share was $0.20 and, as David mentioned, included an approximately $0.30 impact due to the higher than forecasted tax rate.\n\nLooking at our end markets, cloud represented 49% of revenue at $1.8 billion, down 13% sequentially and 18% year over year. Compared to the prior quarter, continued momentum in capacity enterprise drives sold to U.S. cloud customers and an increase in smart video hard drive demand partly offset the decline in all other hard drive product channels and flash. Sequentially, nearline bit shipments were flat at 112 exabytes, driven by our success in leading the industry transition to SMR hard drives.\n\nThe year-over-year decrease was due to broad-based decline across both hard drive and flash products. Clients represented 33% of total revenue at $1.2 billion, down 25% sequentially and 34% year over year. Sequentially, the decline was attributed to flash driven by inventory reduction at PC OEMs and lower pricing. The year-over-year decline resulted primarily from the reduced flash pricing.\n\nLastly, consumer represented 18% of revenue at $0.7 billion, down 15% sequentially and 30% year over year. On both a sequential and year-over-year basis, the revenue decline was due to flash pricing and lower retail HDD shipments. Turning now to revenue by segment. We reported HDD revenue of $2 billion, down 5% sequentially and 21% year over year.\n\nCompared to the prior quarter, total HDD exabyte shipments increased by 1%, and average price per hard drive increased by 4% to $125. On a year-over-year basis, total HDD exabyte shipments decreased by 12% and average price per unit increased by 23%. Flash revenue was $1.7 billion, down 28% sequentially and 31% year over year. Sequentially, flash ASPs were down 22% on a blended basis and 17% on a like-for-like basis.\n\nFlash bit shipments decreased 10% sequentially and 7% year over year. As we move to costs and expenses, please note that my comments will be related to non-GAAP results unless stated otherwise. Gross margin for the fiscal first quarter was 26.7%, down 5.6 percentage points sequentially and 7.2 percentage points year over year. Our HDD gross margin was 28.5%, up 30 basis points sequentially and down 2.4 percentage points year over year.\n\nOur flash gross margin was 24.5%, down 11.4 percentage points sequentially and 12.5 percentage points year over year. Operating expenses were $689 million, down $71 million sequentially and below our guidance range due to lower variable expenses and tighter expense management, including reduction of discretionary spending. Operating income was $307 million, representing a 56% decrease from the prior quarter and a 68% decrease year over year. As David mentioned, we are pleased to have delivered operating income above the midpoint implied by our guidance in a challenging market backdrop.\n\nOur tax expense was $168 million, resulting in a tax rate of 72% higher than previously forecasted. Tax expense is influenced by several factors, including the projected quarterly profitability for the rest of the year and our corporate tax structure. Earnings per share was $0.20 compared to $1.78 in the prior quarter and $2.49 in the year-ago quarter. Operating cash flow for the first quarter was $6 million and free cash flow was an outflow of $215 million.\n\nCash capital expenditures, which includes the purchase of property, plant, equipment, and activity related to our flash joint ventures on our cash flow statement represented a cash outflow of $221 million. Our gross debt outstanding remained at $7.1 billion at the end of the fiscal first quarter. Our liquidity position continues to be strong. At the end of the quarter, we had $2 billion of cash and cash equivalents and revolver capacity of $2.25 billion.\n\nOur trailing 12-month adjusted EBITDA at the end of the first quarter, as defined in our credit agreement, was $4.1 billion, resulting in a gross leverage ratio of 1.7 times, compared to two times a year ago. As a reminder, our credit agreement includes $0.9 billion in depreciation add-back associated with the flash ventures. This is not reflected in the cash flow statement. Please refer to the earnings presentation on the Investor Relations website for further details.\n\nBefore I go over guidance for the fiscal second quarter, I would like to discuss the business outlook for the balance of this fiscal year and the actions we are taking to align our execution plan with the changes in business environment. In flash, we expect shipments to increase sequentially in the fiscal second quarter and the balance of the fiscal year 2023 as the market stabilizes. In HDD, we expect our revenue to recover as our U.S. cloud customers reduced their inventories over the next two quarters.\n\nOn the manufacturing front, we have sharply reduced client hard drive production capacity by approximately 40%. For the fiscal year 2023, we are reducing our gross capital expenditures to $2.7 billion. We are also aiming to reduce our cash capital expenditure by 20% versus our prior expectation. The main drivers of our lower capital expenditures are primarily the push out of BiCS6 transition in flash and reduced investments in hard drive manufacturing.\n\nAs for our operating expenses, we proactively reduced our spending by approximately $80 million in the first fiscal quarter relative to the midpoint of the guidance range. We are also taking further action to lower our ongoing operating expenses range to $650 million to $700 million as we navigate this dynamic environment. We believe these actions we are taking will allow us to continue to invest in innovation as a top priority for our company going forward. For the fiscal second quarter, our non-GAAP guidance is as follows.\n\nWe expect revenue to be in the range of $2.9 billion to $3.1 billion. We expect gross margin to be between 20% and 22%. We expect operating expenses to be between $650 million and $670 million. Interest and other expenses are expected to be approximately $80 million.\n\nWe expect the tax benefit between $70 million and $90 million. We expect loss per share of $0.25 to earnings per share of $0.05 in the second quarter, assuming approximately 319 million fully diluted shares outstanding. I'll now turn the call back over to David.\n\nDavid Goeckeler -- Chief Executive Officer\n\nThanks, Wissam. Let me briefly wrap up, and then we'll open up for questions. While near-term market conditions are challenging, digital transformation continues to drive long-term growth for data storage from client to edge to cloud. With products and solutions that play in every part of the technology ecosystem, Western Digital can meet customers' needs across the spectrum and unlock the possibilities of data.\n\nFor example, while we are successfully managing through the consumer-led downturn, which is showing signs of stabilization, we are ramping multiple new products into data centers worldwide. As we remain focused on innovation and execution, I am optimistic that Western Digital will emerge stronger as we continue to ramp multiple new products into data centers worldwide and market conditions improve. With our top-tier team innovative and diversified portfolio, broad customer base and differentiated go-to-market engine, we are uniquely positioned to capture the opportunities stemming from the rapid global adoption of the cloud and the expansive and growing ecosystem it supports. Finally, I want to thank our employees for their hard work during this quarter and for solidifying our leadership in storage.\n\nIn the face of an extremely challenging macro environment, our team worked together to deliver solid financial performance for Western Digital. I'm proud of what this team has accomplished and excited to see what we can do together in calendar 2023 and beyond. All right, Peter. With that, let's open it up for Q&A.\n\nOperator\n\n[Operator instructions] Our first question today comes from Aaron Rakers with Wells Fargo. Please go ahead.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nYes. Thanks for taking the question. I want to go into the Flash business and kind of parse out kind of how you're thinking about the gross margin trajectory into the December quarter guidance? And specifically, within that, your JV partner, Kioxia announced a couple of weeks ago that they were going to cut production by as much as 30%. I'm curious your gross margin expectations.\n\nHave you taken any actions to take out production? And with that, any underutilization charges that are baked into your expectations into the December quarter? Thank you.\n\nDavid Goeckeler -- Chief Executive Officer\n\nYes, Aaron. Good morning. And thanks for the question. We have not taken any major underutilization actions in the fab.\n\nWe always reserve that right in the future, depending on market conditions. So when we look at our -- the way to think about Q4, and I'll invite calendar Q4, Wissam, obviously, make some comments. I mean we're still under a -- pricing is still under pressure. I think that's fairly clear what's going on in the market.\n\nAnd then we've got a sequential increase, slight increase in bit shipments. So think that's one way to think about how we're thinking about the quarter. Wissam, anything to add?\n\nWissam Jabre -- Chief Financial Officer\n\nYes. The only thing -- I mean, I think the only thing I would add, David, is yes, pricing is pretty much what's going to be the main driver of gross margin in the calendar Q4.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nAnd then as a quick follow-up on the hard disk drive, the nearline, it sounds like you and your competitors are going through some digestion at some of your CSP partners. What's the expectation for the December quarter? It sounds like you expect -- is the expectation is that shipments start to improve going into the March quarter at this point? And then I'll see the floor. Thank you.\n\nDavid Goeckeler -- Chief Executive Officer\n\nYes. We're going to -- you've got it. We're going to see a sharp decline in shipments in calendar Q4 and that's going to lead to some pretty significant absorption charges or underutilization charges. And then will grow back out of that as we move through 2023.\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from C.J. Muse with Evercore. Please go ahead.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYes. Good morning. Thank you for taking the question. I guess a follow-up to the prior first question around NAND.\n\nI was hoping you could speak maybe more broadly around your NAND bit allocation strategy. You spoke to no underutilization charges today. I think your NAND gross margins, obviously moving lower. And in the last cycle, I think in 2019, we troughed at 19%, so curious, how are you thinking about what business you'll take, what you won't take and how that will impact, whether desire to build inventory and/or choose to cut utilization at some point.\n\nDavid Goeckeler -- Chief Executive Officer\n\nGood morning. So I think this is -- the strategy we've been executing over the last couple of years and what we've been talking about, I think, is really paying off for us now at this part of the cycle. We've worked very hard to drive the portfolio abroad and deep portfolio across consumer, across mobile. We obviously still stay qualified at all the vendors, the client SSD portfolio is an anchor of the portfolio, gaming.\n\nAnd now we've added enterprise SSD into the mix. So we've always talked about -- we want to have a broad portfolio to be qualified everywhere we can. And then be able to mix based on what gets us to the best return. And so I think at this part of the cycle, we're able to do that.\n\nAnd it also gives us quite a few homes for our supply. So that allows us in a tough quarter, have sequential bit growth. Obviously, pricing is market-based pricing. So we participate in the market and it allows us to basically just change the mix to get the best return we can.\n\nSo again, I think the portfolio strategy we've been pursuing and we've been talking about getting qualified at the hyperscalers on enterprise SSD, and that gives us another really important home for our supply. So that's how we're thinking about it. I think when you look across the portfolio, we have five or six categories, depending on the quarter, if you look at it for the whole fiscal year, we'll have six different categories where we have a double-digit mix of bits going into those different parts of the market. So I think it gives us a lot of optionality and the ability to generate the best return we can.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nThat's very helpful. I guess, a follow-up on your technology road map. You talked about theoretically potentially skipping a node. And historically, players in the market have not done very well when they pursue that strategy.\n\nSo I guess, can you kind of walk through what gives you the confidence that, that's something that would make sense for you guys, just given the historical precedents?\n\nDavid Goeckeler -- Chief Executive Officer\n\nYes. I think the way we think about it right now, BiCS6 is -- we're taking the actions around capital investment to slow down our bit supply in the market to try and get the market balance. I think everybody is doing that. There's really an enormous number of actions to try and get the market back in balance.\n\nWe feel good about those. We'll take effect next year as we move through the year. What it means for us is BiCS6 will be a shorter node. At this point, the follow-on node BiCS8 is progressing very, very well.\n\nAnd as we move through the year, we'll be able to make a judgment about how long we're going to stay on which node. There's a number of issues around qualifications of products and all those kinds of things. So we'll make thoughtful decisions about that when we get closer to that point as we move through 2023. But we feel very good about where both nodes are and how they're progressing and that will give us the -- give us, again, more optionality about how we think about what products we put in the market to get us the best financial return and obviously, the best solution for our customers.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Joe Moore with Morgan Stanley. Please go ahead.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. Sounds like you guys are pretty optimistic that this improves. But I guess in the event that it doesn't, if earnings stay at this level for a few quarters or get worse, it looks like you might be challenged on the leverage ratio.\n\nWe've talked to a bunch of people in credit, and it sounds like that's a relatively easy amendment to make that there's no strain to it, if you do it quickly. So just wondering how are you thinking about that? Are you -- and then just sort of broader, more philosophically, it feels like it's going to be a tough economic year next year, there could be a lot of challenges. But with Chinese supply out of the mix, the next NAND cycle should be pretty exciting. So I feel like as you think about more negative scenarios, how do you think about weathering the storm and making sure that the kind of $15 of earnings power you did a few years ago is something we might see in the future?\n\nWissam Jabre -- Chief Financial Officer\n\nYes. Good morning, Joe, thanks for the question. So with respect to the first part of your question, look, we're -- we entered this down cycle in a very much stronger financial position than the previous one. If you recall, we reduced our debt by $2.7 billion.\n\nWe've improved the earnings power of the business. We strengthened our portfolio. And also, if you look at our liquidity at the end of Q1, we had around $4.3 billion between a little bit more than $2 billion of cash and cash equivalents and the $2.25 billion revolver that's undrawn. So we have ample liquidity to operate within the -- in the next few quarters.\n\nAnd from where we are now, we're very comfortable in terms of the continued profitability of the business.\n\nDavid Goeckeler -- Chief Executive Officer\n\nJoe, and just to add to that, I mean, we're thinking about how you are. I mean, look, we've got to get through this phase of the cycle. I think there's been a lot of discussion about everything from reduced utilization to pushing out capex. To your point, there are some regulations that are going to impact supply in the market in 2023.\n\nSo we're optimistic about the next cycle about getting there. The market is all the -- we're reacting strongly to get supply and demand back in balance. But as Wissam said, we've invested in our balance sheet -- we've invested in innovation in our portfolio to build the resiliency and the agility in the business to manage through this.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nOK. Thank you.\n\nOperator\n\n[Operator instructions] The next question comes from Toshiya Hari with Goldman Sachs. Please go ahead.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for taking the question. I had a question on the NAND business as well.\n\nSo David, based on the capex decisions you've made over the past couple of months, how should we think about your bit supply growth in, say, calendar 2023. Obviously, you've got bids on your balance sheet. But on a manufacturing basis, given the decisions you've made, how should we think about bit supply growth. And it seems like you're not cutting production like many of your other peers.\n\nI guess, my question is, why not? Is that a function of the contaminant issue earlier in the year and you're looking to regain some ground? Or is there something else? Thank you.\n\nDavid Goeckeler -- Chief Executive Officer\n\nNo. On the second part of your question, it's not because of that at all. It's because we have a lot of homes for our supply, and we're able to get, we think, a good economic return for that. So from -- just purely from an economic point of view, it makes sense for us to continue to build the supply.\n\nWe're definitely going to slow down our bit supply. I think you can think like low to mid-20s for supply next year is kind of the way we're thinking about it.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nOK. Helpful. Thank you.\n\nOperator\n\nThe next question comes from Wamsi Mohan with Bank of America. Please go ahead.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nYes. Thank you. Good morning. I wanted to go back to your initial comments around consumer stabilization.\n\nI know you alluded to some points around retail and PC orders. And I was hoping that you can maybe double click a little bit on what you're seeing both in retail and PC orders, specifically. And also perhaps touch on your expectation of inventory levels exiting the December quarter. Thank you so much.\n\nDavid Goeckeler -- Chief Executive Officer\n\nSo let me take the first part, and I'll ask Wissam to comment on inventory. If we go back and we look at kind of the progression of what's happened this year. Back in March, roughly the March time frame, we saw the consumer market come under pressure. We talked a lot about that.\n\nIn let's call it, the June time frame, we saw the PC OEMs really start adjusting their inventory very aggressively. We talked about that last quarter. And we've seen that play out during the quarter now in a number of different fronts. And then just within the last month or two, we've started to see the big data center operators do the same thing, really sharply adjust their inventory.\n\nAnd obviously, that's factored into our guide. So we've seen this kind of rolling change as it goes through one market to the next. If you look at the other side of it, where are they at in that process, consumer market, we're seeing relatively predictable behavior, it's not like it's at a great point, but it's not falling the way it was, our ability to predict where it's going to be week over week and month over month have increased. And so we've got more confidence we understand where that market is at and how it's going to play out going forward.\n\nIn the PC market and see Q4, we're actually going to see some sequential growth in units of client SSD, not a huge amount, but it's sequential growth. Again, we talked about a very, very sharp inventory correction. So we're starting to see -- we're getting to the point there where the inventory correction last quarter was quite severe. I mean, when customers going down to less than 10% of their usual demand.\n\nNow we see things coming back and stabilizing a little bit. So I don't want to leave you with the impression that things are back up and back up and to the right, but they're stabilizing a bit, and we're starting to see some signs that we're getting more predictable behavior and then that we can then grow out at this point. Obviously, the data center, the big U.S. hyperscalers were just kind of going into that.\n\nAnd we'll have more to say as we -- it's going to be a couple of quarters, but we'll have more to say as we go through the quarter of what we're seeing and then what we see going into next quarter. Inventory?\n\nWissam Jabre -- Chief Financial Officer\n\nYes. And on the second part of the question, Wamsi. In Q1, we saw approximately a couple of hundred million dollars of growth in inventory at the end of the quarter. Our days of inventory were at 128.\n\nWe're expecting to see a similar type of trends in the calendar Q4, roughly speaking, let's say, $100 million to $200 million growth and a bit of an increase in our days of inventory.\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nThe next question comes from Timothy Arcuri with UBS. Please go ahead.\n\nTimothy Arcuri -- UBS -- Analyst\n\nHi. I had a question, and then I had a clarification. So the question is on NAND cost. And the question really is sort of what the push out of BiCS6 does to your longer term? And when I say longer term, I mean like inside of calendar 2023 and into 2024, like what that does to your NAND cost curve? You've been bringing costs down mid-teens.\n\nI know it's going to be less than that next year. But what is the push out due to your cost curve? And then I wanted to clarify on the HDD margin assumption for December, can you sort of disaggregate a little bit what you think HDD margins will be for December like what's implied? It seems like gross margin is down to smidge that's being implied in your guidance? Thanks.\n\nDavid Goeckeler -- Chief Executive Officer\n\nYes. On NAND cost, when we went through the capex exercise, we obviously kept a very close eye on still being able to drive cost declines. It's a very important element of the whole model of what we're doing here. So we're still comfortable with you modeling 15% year-over-year cost declines.\n\nI mean, clearly, there'll be some variability from quarter to quarter, but we still target that 15% year over year. It's a big part -- I've talked about this a lot in the past. It's an actual input into the process, into the design process, not an output. And so we really designed to meet that, and it's a strong part of what the whole business is about.\n\nHDD margins will be under pressure next quarter. As I said before, we'll have some significant underutilization costs that will go into the financials -- the other side of that is pricing in nearline and capacity enterprise has been stable benign about what we expect. But we're clearly going to have to -- we're going to slow down production significantly, and that will hit us in the margin line next quarter. And then we'll grow out of that as volume comes back.\n\nAnd as we go through 2023, we also feel very -- we feel very good that we're going to be ramping into the 22-terabyte drive, which is deep in qualification at a lot of different places around the world. And also the 26-terabyte UltraSMR drive is in qualification as well. And we talked a lot about SMR in the prepared remarks, that is a technology we believe very strongly. That's the next phase of the data center is SMR.\n\nAnd it was -- just last quarter, we talked about ending the year with 25% of our exabytes in that market being SMR, we achieved that a quarter early. And now we expect to exit the fiscal year with over 40% of our exabytes being shipped on SMR. So I feel really good about where the portfolio is. And as we grow out of this sharp inventory correction through 2023, we'll be going into strength in the product roadmap.\n\nOperator\n\nThe next question comes from Shannon Cross with Credit Suisse. Please go ahead.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you very much for taking my question. I'm just wondering, can you talk a bit about the pricing environment, both in NAND and drives. And how both -- you expect the prices to move from an absolute basis and then also from a mixed basis, the 22, 26, etc. comes out over time.\n\nI'm just wondering how we should sort of think about that. Thank you.\n\nDavid Goeckeler -- Chief Executive Officer\n\nPricing in HTD has been something we've been very much focused on. We feel very, very positive about the innovation we're bringing to market. I mean, that's where all -- everything about pricing starts with innovation. You got to bring a great product to market.\n\nYou got to continue to drive a better value proposition for our customers. And we believe strongly we're doing that. These new drives have very good TCO benefits for our -- the largest data center operators in the world. So pricing in nearline has been, I think benign is the word I've used for many quarters now, and I would continue to use that word.\n\nAnd we're going to be focused on value-based pricing as we ramp into 22 and 26. So that's the way we're thinking about it. Again, it's all about driving a better TCO value proposition through innovation, and then we get to share that benefit of that with our customers. In NAND pricing has clearly been under pressure.\n\nI think that's very well documented. As I said before that look at our pricing last quarter, like for like minus 17%, blended minus 22%, we're clearly mixing this -- the mix hurts the pricing a bit, but it also allows us to move a lot of supply. And we think it's the right -- we think it's the right decision for the business. We expect pricing to be under pressure in calendar Q4 as well.\n\nOperator\n\nThe next question comes from Krish Sankar with Cowen & Company. Please go ahead.\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nHi. Thanks for taking my question. I had a quick one on SMR. Can you talk a little bit about how to think about SMR in terms of your revenue mix? And also how many customers you have? And are you seeing any nearline HDD share shifts because of the SMR position? Thank you.\n\nDavid Goeckeler -- Chief Executive Officer\n\nYes. We don't talk about specific customers. But what I can say is there's multiple, very large customers committed to SMR, some of the largest data center operators in the world. And I think the whole industry is especially UltraSMR.\n\nI mean, SMR has been around a long time, right? SMR has been shipped and client drives for a long time, but it actually requires some work on the host side for the data center operators. So when we were able to introduce UltraSMR and get plus 20% on a CMR drive versus the industry standard of plus 10% that really changed the equation a bit. And when you can get 20% capacity uplift, it's worth the investment on the host site. And we're seeing that -- we're seeing that move across a lot of operators be very interested in that.\n\nSo we don't break out specific customers. I said on an exabyte basis, we expect it to be over 40% exiting the fiscal year. I think you can assume on a revenue basis, it'll be slightly more than that. But I think that's how we think about it.\n\nOperator\n\nThe next question comes from Mehdi Hosseini with SIG. Please go ahead.\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nYes. Thanks for taking the question. I also have one question, two parts. Your wafer purchase based on cost plus and given continued weakness in NAND prices, how is that going to impact your margin? There was a reference earlier of a minimum margin of 19%, and I just want to make sure that we understand that there is that minimum gross margin given the fact that you actually purchase wafer from the JV.\n\nAnd on the HDD side, as you think about the dynamics, if we're actually seeing the bottoming into next year, how are you planning for your capacity and what kind of exabyte growth are you forecasting for your HDD manufacturing capacity that you have online? And in other words, how are you thinking about your HDD capacity? What kind of assumption for shipment you have? Thank you.\n\nDavid Goeckeler -- Chief Executive Officer\n\nAll right. I'll make some comments here and then I'm sure Wissam will probably have something to add as well. So first of all, let's clarify the comment on gross margin. There is no minimum gross margin.\n\nI think the comment was that in the last down cycle, the company's gross margin bottomed at 19% in flash. I will note that that number did not include the underutilization charges. And when you include the underutilization charges, Wissam, I know we calculated this number.\n\nWissam Jabre -- Chief Financial Officer\n\nYes. We're in the sort of let's say between the -- it's in the low teens.\n\nDavid Goeckeler -- Chief Executive Officer\n\nLow teens, OK. So I think that was just a -- Mehdi, I just think that was a benchmark that one of the previous questioners was using. So you're right about how we get the -- how the JV economics work. But again, our -- the way we think about the portfolio is if we can get the -- if we can -- if we have a home for the bits, that's number of -- that's the first thing like, do we have a place where we can -- do we have customers that value our innovation in our portfolio and we have a place to put the supply and then we look at pricing and then we look at that equation and does it make economic sense to do that and we drive the portfolio.\n\nWe're actually given where we are in the cycle, we're pleased with the gross margin we're able to drive in the business at this point. So that's how we're thinking about it. Exabyte growth, I mean, clearly we're going to slow down ACD exabyte growth. I think this -- that the industry is going through a pretty large digestion cycle.\n\nPart of the capex pushout that we saw them talked about, the lion share of that is on the flash side of the business. But we're also moving out ACD capex as well to slow down our exabyte growth there. We have a lot of conviction that the market's still going to grow in that high 20, 30 plus range on exabyte growth, but we're going to have to grow back into that as we go through this inventory correction.\n\nOperator\n\nThe next question comes from Harlan Sur with J.P. Morgan. Please go ahead.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nHi. Good morning. Thanks for taking my question. On the inventories 6% sequential growth and I know you guys expect more sequential growth in inventories this quarter.\n\nIs the build more flash or HDD driven? I'm talking about the September quarter. And then given the sharp pull back in clouds, you guys are cutting utilizations in HDD this quarter. But are you guys also holding back shipments of HDD in the December quarter? And then on the NAND side, despite the sequential growth for bits and flash, are you guys holding back some shipments in the December quarter?\n\nWissam Jabre -- Chief Financial Officer\n\nSo let me take the question. So with respect to inventory in the September quarter the majority of the inventory growth was in NAND. On the HDD side, we were mostly flattish. As we look into the December quarter, we're expecting to continue to see more NAND inventory growth and there will be some HDD inventory growth, but not as much as we are anticipating to see NAND growth there.\n\nAnd the HDD growth will be basically just driven by the weakness we're seeing in the market. But also we will -- we're carefully managing our utilization. They will be under absorption costs. We're also trying to carefully manage our utilization going forward.\n\nAnd in terms of the -- the part of the question with respect to holding shipments no, we're not planning to hold shipments.\n\nOperator\n\nThe next question comes from Tom O'Malley with Barclays. Please go ahead.\n\nTom OMalley -- Barclays -- Analyst\n\nHey. Thanks for taking my question, guys. You guys have seen a pretty long stretchier of seeing HDD ASPs on the rise. Obviously, with a lot of moving parts with the weakness that you're seeing, could you guys comment on what you expect HDD ASPs as a whole? You report the number every quarter to do sequentially.\n\nIs it falling because of mix or is there any puts and takes that we need to be considering when we look at the December guide? Thank you.\n\nWissam Jabre -- Chief Financial Officer\n\nYes. The transition is primarily driven by mix. That's a key driver for HDD.\n\nPeter Andrew -- Vice President, Investor Relations\n\nYes. So, Tom, if you look at calendar Q4, you should expect ASP for HDDs to be down, mainly driven by mix as the hyperscale guys go through the digestion phase.\n\nTom OMalley -- Barclays -- Analyst\n\nHelpful. Thank you.\n\nOperator\n\nThe next question comes from Jim Suva with Citigroup. Please go ahead.\n\nJim Suva -- Citi -- Analyst\n\nThank you. You mentioned Q4 will be burdened or December quarter will be burdened with underutilization charges. Is that kind of the brunt of it, the worst or the most amount to be absorbed there, and then we start to improve going after? Or does it continue? And you mentioned capex, you're slowing that down. Could you quantify or give us some capex guidance about where we should kind of anticipate for capex and for modeling cash flow around capex? Thank you.\n\nWissam Jabre -- Chief Financial Officer\n\nYes. So on the comment with respect to underutilization, yes, from where we stand today, this seems to be where we see probably underutilization at its lowest. And we would start getting ourselves out of that as demand improves. With respect to capex, we are aiming to reduce our cash capex for the fiscal year by 20%.\n\nIdeally we want to do more. The way to think of it is in our cash capex the 20% is roughly split around the 30% reduction with respect -- and these are relative to our previous expectations. So 30% lower than previously expected on the NAND side. And on the HTD side, it's a reduction of 10% to 15% relative to the previous expectations.\n\nOperator\n\nThe next question comes from Sidney Ho with Deutsche Bank. Please go ahead.\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nThanks for taking my question. I want to ask about the free cash flow expectation. What is your expectation for the December quarter and for fiscal 2023 and perhaps kind of trajectory of how things go? And maybe I'll throw this one in too. When you look at the inventory still going up next quarter, are you concerned about inventory write-downs, especially given name gross margin? I think it was 25% probably going down for a couple more quarters.\n\nThanks.\n\nWissam Jabre -- Chief Financial Officer\n\nYes. So, Sidney, for free cash flow, we're projecting a negative free cash flow in the December quarter and for the fiscal year. Keep in mind that we have the IRS settlement payment that is still projected to be in the fiscal 2023. And this was estimated at $600 million to $700 million.\n\nWith respect to inventory, look, we did see a small impact in terms of write-down in the September quarter. Ultimately, it all depends on how the net pricing develops in the next few quarters. So it's difficult to predict at this time, but it will depend on where the net pricing progresses.\n\nOperator\n\nThe next question comes from Ananda Baruah with Loop Capital. Please go ahead.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nGood morning, guys, and thanks for taking the question.\n\nDavid Goeckeler -- Chief Executive Officer\n\nGood morning.\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nYes. Good morning. Yeah. Just interested in hearing what you're seeing and what your thoughts are with regards to nearline demand from your OEM customers that might go to the on-premise spending.\n\nDavid Goeckeler -- Chief Executive Officer\n\nYes. I would say, those are under pressure as well. I mean, I think across the whole data center business, we see pressure on that part of the market, both from the OEM side and the hyperscalers. I would say the hyperscaler is a little more severe correction, but we're seeing pressure on both sides of the data center business.\n\nOperator\n\nThe next question comes from Karl Ackerman with BNP Paribas. Please go ahead.\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nYes. Thank you. I was hoping you could discuss the run rate level of opex for the next few quarters. And as you address that question, how much of the $70 million improvement this quarter is from the 40% reduction in hard drive capacity versus changes in accounting for R&D in NAND? As well as, could you touch on your ability to redeploy heads in media production into cloud products where demand should grow very well on a structural basis going forward? Thank you.\n\nWissam Jabre -- Chief Financial Officer\n\nYes. So with respect to the run rate of opex when you look at -- maybe I'll talk a little bit about where we ended in Q1, because this is a bit relevant on how we think about it going forward. So in Q1 we saw an approximately $70 million to $80 million actually drop from the prior quarter. So we ended it around $689 million.\n\nWe took action on variable expenses and non-discretionary spend. Basically, we are tightening the -- totally the expenses management. As we look forward for the next few quarters, the run rate is expected to be $650 million to $700 million. And we're still contemplating few other actions that may help us keep things even tighter.\n\nSo that's the run rate. On the part of the question related to the client capacity restructuring, the opex does not reflect that. This mostly -- the impact of that is mostly on the cost of goods sold. And with the reduction of approximately 40% of our capacity, we expect to see on an annual basis, roughly $45 million to $50 million benefit.\n\nSo that's roughly speaking a little bit more than $10 million, let's call it around, $10 million to $12 million a quarter. In terms of the last part of the question on the heads and media, some of this capacity is fungible. And we can -- part of our capital investment was to continue to invest in our heads and media to ensure we have the capacity to drive the -- or supply the growth expected in the future. But as we talked about that, also we are managing our capital expenditures over the next few quarters to manage our cash.\n\nDavid Goeckeler -- Chief Executive Officer\n\nI think you've got the headset right, which is in the transition from client to cloud, we move all the heads and media over to cloud. We've been in that transition for a long time. We're very, very deep in that. I would say we're in the last stages of that transition.\n\nSo simple thing with client drives have a lot more discs and heads in them and we use all that capacity.\n\nOperator\n\nThe next question comes from Mark Miller with Benchmark Company. Please go ahead.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nThank you for the question. You saw a decline in cash in the current quarter and you're talking about negative free cash flow. Where do you think cash will be at the end of December quarter in the year?\n\nWissam Jabre -- Chief Financial Officer\n\nYes. So I won't necessarily guide to a cash number, but we're expecting a negative free cash flow quarter in the calendar Q4. From a liquidity perspective, look, we ended the Q1 at $4.3 billion with around $2 billion of cash. And we still have $2.25 billion of revolver.\n\nAnd so from a liquidity perspective we're comfortable in the ability for us to continue to operate comfortably.\n\nMark Miller -- The Benchmark Company -- Analyst\n\nThank you.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to David Goeckeler for any closing remarks.\n\nDavid Goeckeler -- Chief Executive Officer\n\nAll right. Thanks, everyone for joining us. Look, we'll be talking to all of you throughout the quarter. We appreciate your participation in the call.\n\nIt's obviously a very dynamic environment we're all facing out there. Feel really good about the way we've been navigating this. Hopefully, we've given you some good color about how we're thinking about the business going forward. Again, have a great day everyone.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPeter Andrew -- Vice President, Investor Relations\n\nDavid Goeckeler -- Chief Executive Officer\n\nWissam Jabre -- Chief Financial Officer\n\nAaron Rakers -- Wells Fargo Securities -- Analyst\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nWamsi Mohan -- Bank of America Merrill Lynch -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nShannon Cross -- Credit Suisse -- Analyst\n\nKrish Sankar -- Cowen and Company -- Analyst\n\nMehdi Hosseini -- Susquehanna International Group -- Analyst\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nTom OMalley -- Barclays -- Analyst\n\nJim Suva -- Citi -- Analyst\n\nSidney Ho -- Deutsche Bank -- Analyst\n\nAnanda Baruah -- Loop Capital Markets -- Analyst\n\nKarl Ackerman -- Exane BNP Paribas -- Analyst\n\nMark Miller -- The Benchmark Company -- Analyst\n\nMore WDC analysis\n\nAll earnings call transcripts"
}