{
  "companyName": "Aspira Women's Health Inc.",
  "companyTicker": "AWH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/aspira-womens-health-inc-awh-q2-2022-earnings-call/",
  "content": "Aspira Women's Health Inc. (AWH 0.82%)\nQ2 2022 Earnings Call\nAug 10, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to Aspira Women's Health, Inc.'s second quarter 2022 conference call. My name is Vikram, and I will be your coordinator for the call today. [Operator instructions] As a reminder, this call is being recorded today. Leading the call today are Nicole Sandford, president and chief executive officer, Bob Beechey, chief financial officer, and Dr.\n\nRyan Phan, chief scientific officer and chief operating officer. After the prepared remarks, we will open the call for Q&A. Before we begin, I'd like to remind everyone that forward-looking statements, as defined under the Private Securities Litigation Reform Act of 1995, will be made during this call, including statements relating to Aspira's expected future performance, future business prospects, and future events or plans. Although the company believes that the expectations reflected in such forward-looking statements are based upon reasonable assumptions, actual outcomes and results are subject to risks and uncertainties and could differ materially from those anticipated due to the impact of many factors beyond the control of Aspira.\n\nThe company assumes no obligation to update or supplement any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. Participants are directed to cautionary note set forth in today's press release, as well as the risk factors set forth in Aspira's most recent Form 10-K filed with the SEC for a description of factors that could cause actual results to differ materially from those anticipated in the forward-looking statements. At this time, I'd like to turn the call over to the call to Nicole Sandford, president and chief executive officer. Please go ahead, ma'am.\n\nNicole Sandford -- President and Chief Executive Officer\n\nThank you, operator, and thank you, everyone, for joining us today. We are very pleased to provide an update on our progress in the second quarter. Joining me on the call today are Bob Beechey, our chief financial officer, and Dr. Ryan Phan Fan, our chief scientific and chief operating officer.\n\nI will begin with an overview of our second quarter performance and an update on a number of important strategic developments. Dr. Phan will follow with an update on our product pipeline before handing the call to Bob, who will provide a financial update. After our prepared remarks, we will then open the lines for a question-and-answer session.\n\nLast quarter, I shared my priorities for 2022. I told you then that my focus and the focus of the entire company would be on execution across three dimensions: growth, innovation, and operational excellence. While we still have much to do, I am happy to report encouraging progress in all three areas in the second quarter of 2022. Let's begin with an update on our cash utilization as it sets an important context for the rest of the conversation.\n\nWhen I joined the company, I made it a priority to align our spending and resources to the most important business needs. I ask my executive leadership team to exercise fiscal conservatism, but to do so without jeopardizing our strategic vision. We have made significant progress since then. In the second quarter of 2022, we utilized $6.4 million in cash, roughly 40% less than we utilized in the first quarter of 2022, and 16% less than the fourth quarter of 2021.\n\nThis was a major achievement that required the attention of every Aspira team member, and I'm extremely proud of our progress. We achieved this reduction in utilization without sacrificing our growth or innovation goals, as you'll hear shortly. We continue to hire individuals to fill key roles, especially in the commercial and R&D organizations, and invest in the infrastructure required to increase our volume and deliver on our Aspira synergy contracts. We plan to operate the business this way going forward.\n\nI'll ask that you keep that reduced cash utilization number in mind as Ryan, Bob, and I detail our second quarter achievements. First, let's talk about growth. In Q2, we broke through the $2 million revenue threshold for the first time in a single quarter with a volume of 5,411 tests performed. This represents an 11% increase in revenue over the first quarter of 2022 and an 18% increase over the same period in 2021.\n\nOur testing volume increased to 83 tests performed per day in Q2 compared to 75 tests performed per day in Q1. We achieved this growth while continuing to execute our previously disclosed commercial transformation, which I'm happy to report is largely complete. As of today, 67% of our sales professionals have been with the company for more than three months and 58% have been with us for more than six months. In the second quarter of 2022, approximately 593 physicians ordered an OVA product for the first time, which is essentially flat with new ordering physicians in the first quarter.\n\nWe aim to increase the number of physicians ordering for the first time and do more to drive repeat orders from existing physicians. The latter will be a focus area for the rest of the year. Bob will provide additional information about revenue and AUP later in the call. While I'm happy to see the uptick in volume, I'm far from satisfied with overall revenue growth.\n\nThis quarter, I've spent time in the field with our reps and physicians, and I will continue to do so in the third quarter, to better understand challenges to adoption and overall growth. Elsewhere on the growth front, Aspira and BioReference established a national collaboration to co-market and distribute OVA1Plus. BioReference is one of the largest full-service specialty laboratories in the United States with a leading position in women's health, oncology, and urology, and 40 years of expertise in clinical diagnostics. We are targeting a launch of the arrangement no later than the fourth quarter of this year.\n\nIt is our expectation that the relationship will drive incremental volume in 2023 and beyond. Both Aspira and BioReference are deeply committed to enhancing health outcomes for women, and I've found the cultures to be very complementary. I believe this is the beginning of a mutually beneficial long-term relationship, and I'm working hard to ensure a strong start. Separately, Aspira Women's Health has established a stand-alone agreement with Scarlet Health, an innovative mobile phlebotomy solution, providing collections for Aspira's patients from the comfort of their home.\n\nAs an update to the Aspira Synergy platform rollout, we are encouraged by adoption from our first physician super group, which I am now able to identify as women's care. We were able to design and implement a commercially reproducible solution in playbook for future Aspira synergy opportunities while implementing an arrangement that has helped both women's care and Aspira achieve their shared mission to expand patient access. Now turning to innovation. It is my pleasure to welcome Dr.\n\nRyan Phan to our call for the first time. Dr. Phan, can I ask you to briefly introduce yourself and then provide an update related to our product portfolio, including today's announcement of an expansion to our relationship with Harvard's Dana-Farber Cancer Institute and a number of other academic institutions to include endometriosis in addition to our ongoing collaboration related to ovarian cancer.\n\nRyan Phan -- Chief Scientific and Operating Officer\n\nThank you, Nicole. I'm honored to join Aspira as chief scientific and operating officer after many rewarding years in leadership and academy institution, healthcare system, and more recently at CareDx, where I was the senior vice president of lab service and medical director. As a member of CareDx leadership executive team, I led the commercial testing operation, clinical development pipeline, manufacturing, supply chain, regulatory affairs and compliance, and automation and engineering divisions. In addition, I served as a licensed medical director of the company's clear cap laboratory and played a key role in the growth and expansion of the company's testing revenues and portfolio.\n\nPrior to joining CareDx, I was managing director and head of regional molecular genetic pathology and cytogenetics at Kaiser Permanente in Northern California. Before that, I was effective member of the University of California Los Angeles and the Los Angeles VA Medical Center. I received my bachelor's decrease from us UC Berkeley and my PhD from Colombia University in New York. I completed my post-doctoral training Harvard Medical School, where I worked the cancer research entity panel and American Society of Hematology scholar.\n\nI look forward to working with everyone at Aspira to strengthen our innovation efforts, accelerate the expansion of our product portfolio, and scale our commercial testing service as we move forward. Now let me turn to our product portfolio by reiterating our intention to launch OvaWatch, our next generation ovarian cancer assessment by the end of the year. With its superior negative predictive value, OvaWatch is noninvasive tests that provide additional data points for clinician initial assessment in women with an actual mass. This lab developed test will support physicians in making informed clinical decisions in the management of women with actual masses.\n\nOvaWatch represents a significant expansion of our potential patient population when compared with our existing FDA-cleared OVA1Plus test, which are only approved for use in women with masses that have been referred for surgery. We estimate the total addressable market for OvaWatch to be three or more times the resale market for OVA1Plus. As we previously disclosed, our paper entitled, Analytical Validation of a Deep Neural Network Algorithm for the detection of Ovarian Cancer were accepted for publication by JCO Clinical Cancer Informatics. While our ability to collect samples for the study were significantly impacted by COVID surge over the past two years.\n\nToday, I can report that we recently completed enrollment of our multisite prospective study based on real-world data in support of our plan to launch OvaWatch. We are in the final stage of analysis and are preparing a manuscript for peer review of application. We are satisfied that the data provided in the analytical and clinical valuation study will be sufficient to write decision and payer adoption. OvaWatch and OVA1Plus will be marketed together as part of our newly reimaged ovarian cancer portfolio, we have branded as Ova Suite.\n\nPhysician will be encouraged to consider an Ova Suite test for all women with an actual masses to provide a more informed clinical decision in the assessment and management of their patient risk for ovarian cancer. In this regard, a single test requisition form of Ova Suite will allow clinicians to determine which test is appropriate for their patient. We are on track to launch the product in the fourth quarter of this year and expect to see meaningful volume from OvaWatch during the early months of 2023. We can also report on our ongoing efforts to support research related to the impact of rate on the detection of ovarian cancer.\n\nSponsored by Aspira's clinical research efforts in the Philippines, a manuscript entitled, Clinical Performance of a Multi-vari Index Assay in Detecting Early stage Ovarian Cancer in Filipino Women has been accepted for publication in the International Journal of Environment and Health in its special issue on ovarian cancer preventive and treatment. The study was designed to validate the effectiveness of a multi-vari index assay of OVA1Plus in the assessment of ovarian cancer risk in Filipino women.. As soon as the report is published, we will say it on our website. You will hear more about our suite of ovarian cancer offerings, including a presentation regarding the clinical application of OVA1Plus and Overwatch on August 24 at 12 p.m.\n\nEastern time when Nicole and I host the webinar with Dr. Charles Dunton, Aspira's chief medical officer, Dr. Nicole Williams of the Gynecology Institue of Chicago, and Dr. Gerard Reilly of Axia Women's Health.\n\nAn invitation to the event were distributed by LifeSci Advisors. Registration details can be found on the investor relations page of our website. Moving on to our endometriosis product offerings, we are excited to announce that we have entered into a sponsored research agreement with Harvard's Dana-Farber Cancer Institute, Brigham & Women's Hospital, and Medical University of Lodz for the generation of a  multi-omic, non-invasive diagnostic aid to identify endometriosis based on circulating microRNAs and proteins. We will collaborate with this prestigious group of well renowned institutions to identify candidate markers and build a series of diagnostic models for women being evaluated for possible endometriosis.\n\nWe intend for the collaboration to be completed, we anticipate the total cost of the partnership to be approximately $1.2 million. The resolve the technology to drive medical and clinical management women with our pelvic presenting a symptom of endometriosis and to limit surgical evaluation for those cases where noninvasive tests provide difficult or in-home surgical excision of endometriosis is clinically indicated. This research collaboration agreement will build on our extensive R&D efforts, and we have spent our assets to appropriate samples as well as scientific resources required to accelerate the commercialization of our EndoCheck diagnotic test. We believe this agreement help to ensure a launch of an endometriosis diagnostic test in 2023, which continue to be our goal.\n\nWe plan to host a second webinar to provide additional insight on our endometriosis test, and we'll announce the timing of that webinar. I now turn the Bob Beechey for a discussion about our financial performance. Bob?\n\nBob Beechey -- Chief Financial Officer\n\nThank you, Ryan. Second quarter 2022 OVA1Plus revenue was $2 million, an increase of 17% year over year and a 10% increase sequentially. The revenue and volume numbers represent a record quarter for the company. The revenue per OVA1Plus test performed was $373 for the second quarter of 2022 compared to $378 during the second quarter of 2021 and $380 for the first quarter of 2022.\n\nThe year-on-year price and sequential 1% decrease in revenue per OVA1Plus test performed was driven by the mix of payer type would decrease patient pay collection for the second quarter of 2022, as well as our strategic initiative to serve the Medicaid population, which currently has a lower price when compared to our average and representing a higher percentage of our revenue. Our price for Medicaid was $90 in the second quarter of 2022 and represented approximately 12% of volume. Gross profit margin on OVA1Plus was 48.6% in the second quarter of 2022 compared to 52% for the same period in 2021 and 53.2% in the first quarter of 2022. The decreases were driven primarily by software license costs and maintenance costs.\n\nResearch and development expenses for the three months ended June 30, 2022, were $1.4 million, roughly flat when compared to the prior year second quarter of $1.47 million and the first quarter 2022 spend of $1.35 million. The spending was focused primarily on product development costs related to OvaWatch and EndoCheck. Sales and marketing expenses were $3.6 million for the three months ended June 30, 2022, a decrease of $917,000 compared to the second quarter of 2021 and $439,000 compared to the first quarter of 2022. The decrease was driven by decreases in personnel costs associated with our first quarter reorganization, as well as reduced consulting costs.\n\nGeneral and administrative expenses were $4.2 million for the three months ended June 30, 2022. We incurred $3.3 million in general and administrative expenses in the prior year quarter and $4.4 million in the first quarter of 2022. The year-over-year variance is attributable to headcount and personnel expenses, while the sequential decrease is driven by reduced consulting costs. We ended the second quarter of 2022 with approximately $20.7 million in cash, cash equivalents, and restricted cash.\n\nCash used in the second quarter of 2022 was $6.4 million. As Nicole mentioned, we are focusing our investments on development of products with a near-term impact, namely OvaWatch and EndoCheck, and enhancing our sales and marketing in preparation for the BioReference collaboration and the launch of OvaWatch. This focus on execution has resulted in reductions in spend on more speculative long-term research and a reduction in awareness marketing which we concluded was not yielding adequate returns. In addition, we have rationalized our cost structure across all functions while maintaining appropriate quality, and we are pleased with the resulting cash utilization in the second quarter.\n\nWe expect to sustain our reduced cash utilization levels in the coming quarters. We expect to utilize in the range of 14 million to 15.5 million total during the second half of the year. This outlook includes cash that we expect to use to maintain our current staffing levels and the required investments to launch to OvaWatch, kick off our partnership with BioReference, and continue discovery and development of EndoCheck. The cash utilization expectation does not contemplate any revenue contributions in the fourth quarter from the OvaWatch launch or from the BioReference partnership initiation.\n\nNote, we do expect an increase in cash utilization in the third quarter compared to the second quarter of 2022 as we expect to fund endometriosis development of approximately $1.2 million. We expect the fourth quarter will then revert to levels in the range of the second quarter. We're examining all options for extending our cash runway, and we'll announce specific plans as appropriate. With that, I will now turn the call back over to Nicole.\n\nNicole?\n\nNicole Sandford -- President and Chief Executive Officer\n\nThank you, Bob. And as a final update, let me introduce and welcome two new board Members, Dr. Robert Auerbach and Ruby Sharma. Dr.\n\nAuerbach is the retired President of CooperSurgical. He brings extensive clinical and executive experience in the medical industry, including experience as a director and as an executive officer. Ms. Sharma, the managing partner at RMB Strategic Advisors, brings decades of senior leadership, accounting and audit committee experience.\n\nEach brings different but equally critical skills and expertise to the board. Bob's medical background and track record of success as an executive in the women's health sector, along with Ruby's strategic mindset and extensive financial, business, and governance acumen, will be highly valuable to Aspira as we accelerate our strategic execution in today's challenging environment. Overall, we are pleased by our accomplishments this quarter and our strategic focus on growth, innovation and operational excellence. Things you can expect from us in the coming months include: Launch of our BioReference relationship in the second half of this year, launch of OvaWatch in the fourth quarter of this year, launch of an endometriosis diagnostic test in the second half of 2023, and continued focus on cash utilization and sources of liquidity, with the expectation for cash usage to be between $14 million and $15.5 million for the balance of the year.\n\nIn closing, our executive team remains committed to our strategic vision, and we are focusing all of our efforts on execution for the remainder of 2022 and beyond. We've made tremendous progress, and more is yet to come. With that, I would like to now open the call for questions. Operator?\n\nOperator\n\nThank you very much. [Operator instructions] We have a first question from the line of Brian Weinstein with William Blair. Please go ahead.\n\nGriffin Soriano -- William Blair and Company -- Analyst\n\nGood morning. This is Griffin on for Brian. Thanks for the questions. Maybe just to start on the sponsored research agreement for the endometriosis test.\n\nJust to clarify, is this product separate from EndoCheck, or more of an extension of the existing R&D work that you guys have already done? And then I think Endo, the LDT launch was expected in '23. So I just want to better understand how this research agreement work compares to the Endo product.\n\nNicole Sandford -- President and Chief Executive Officer\n\nSure. Great. Well, thanks for the question. I'll start, and then Ryan, you can add your thoughts as appropriate.\n\nSo the sponsored research agreement is best characterized as an extension of our R&D efforts overall. So as I think we've talked about in prior calls, we have been looking for opportunities to accelerate and sort of ensure a launch of an endometriosis LDT in 2023. And this arrangement will give us access to resources and, importantly, specimens and expertise to complete both protein and microRNA development work. So the exact LDT to be launched, we will obviously give more information about that when the time is appropriate.\n\nBut I think the way to think about it is the latter in your question, as an extension of our team and access to additional resources. Ryan, anything to add to that?\n\nRyan Phan -- Chief Scientific and Operating Officer\n\nNo, I think you covered it, Nicole. Thank you for the question.\n\nGriffin Soriano -- William Blair and Company -- Analyst\n\nOK. And then on the BioReference lab comarketing distribution agreement, I know it might be limited in what you can say, but can you give us a sense of maybe how many reps on their side will be carrying the OVA1 product? And with your focus being more on depth in the second half year in driving adoption, utilization against existing docks, is that -- are they going to be helpful here? Will that also be these reps focused? And then any details on the economics of this agreement, the revenue share potential margin impact would be helpful.\n\nNicole Sandford -- President and Chief Executive Officer\n\nYes. So it's challenging to give anything that's going to satisfy you in terms of details. So I apologize in advance for that. But I will say, we're extremely satisfied with the commitment that BioReference has made to us in terms of their promotion of this relationship and our products with their sales team, and I really can't comment on the -- it wouldn't be appropriate for me to comment on the size of their sales team.\n\nAll I can say is they've been incredibly supportive, and we found the cultural fit between what we're each trying to achieve with this relationship has been extremely positive. So we feel really confident that they're going to do what they can to drive adoption within their -- both within their sales force, but then obviously, importantly, within their customer base. And the economics are consistent with our current OVA1Plus sales, although I would ask Bob to just confirm that there's nothing else you'd want to say on that.\n\nBob Beechey -- Chief Financial Officer\n\nI would just comment that our expectation is that it's attractive to both sides, and we expect our margin profile to be consistent.\n\nGriffin Soriano -- William Blair and Company -- Analyst\n\nOK. I appreciate that. And then just last one here on the capital situation, the burn was down nicely year-over-year. And Bob I appreciate the color on sort of second half expectations.\n\nMaybe can you just talk a little broadly about how you're thinking about the cash burn in 2023 and ultimately addressing what will likely be a financing need?\n\nBob Beechey -- Chief Financial Officer\n\nWell, we haven't given guidance for Q3 -- I mean, for 2023. Obviously, the major catalysts are the BRL relationship and the OvaWatch launch. So we would expect top line, sequentially, year on year, to be meaningfully higher, and we don't anticipate any significant cost increases. We believe the R&D that we just spoke about relative to the partnership is what's necessary to get over the finish line on Endo in terms of our development.\n\nWe're not at the point where we've assessed the marketing needs, and that's on the comp. So the only cost step function that might be appropriate as the front end on marketing relating to Endo, but look for top line growth with consistent cost discipline, and we think the majority of the R&D is covered by this research. The majority of R&D development discovery is going to be covered by this Harvard Dana-Farber relationship that we're going to fund in the current year?\n\nGriffin Soriano -- William Blair and Company -- Analyst\n\nOK. Thank you for the questions.\n\nNicole Sandford -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe have next question from the line of Ross Osborn with Cantor Fitzgerald. Please go ahead.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nHi. Thanks for taking the question. Starting off, could you walk through the 2Q cadence and then how July shaped up maybe relative to June?\n\nNicole Sandford -- President and Chief Executive Officer\n\nHey there. Thanks for the question. I'm sorry. could you just clarify what are you looking for on the first part?\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nHow the volume progressed over the quarter, accelerating volumes month over month, and then how July and then even now how August volumes have turned?\n\nNicole Sandford -- President and Chief Executive Officer\n\nSure, sure. Well, too soon to say much about August. In terms of volume for the second quarter, it was pretty consistent month to month, and we continue to see marginal growth in April, for sure. And frankly, July is never a great month, but we've actually seen strong volume in July so far.\n\nSo pretty even growth over the three months.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nOK. Got it. And then on the Scarlet relationship, could you just walk through how that testing process works?\n\nNicole Sandford -- President and Chief Executive Officer\n\nYes. So again, I don't want to get too over my skis by describing somebody else's product, but how it essentially would work is as a mobile phlebotomy. So a patient can choose, instead of going to a draw station, to have a scarlet mobile phlebotomy visit and have a draw at their house. So it will help with people, or anywhere else for that matter work, whatever.\n\nSo it gives additional gives additional optionality for having blood drawn for tests like this. And also, what's really exciting is that the coverage is also inclusive of rural folks as well. So rural areas as well. So really nice national coverage, and we think will be helpful to get our tests to be more available to all women, which, as you know, is a big part of our mission.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nOK. Great. And then I guess, lastly, so it looks like the OvaWatch timeline has narrowed down in the second half of this year to the fourth quarter. How should we think about the fourth quarter rollout of OvaWatch?\n\nNicole Sandford -- President and Chief Executive Officer\n\nYes. So our plan is to spend the time between now and the launch, which we expect to be pretty early in the fourth quarter, to secure additional progress relative to reimbursement. We're submitting our clinical dossier in Novitas in the next two weeks and then lots of work to do on reimbursement there. We're feeling very positive about the progress that we expect to make between now and the launch there.\n\nSo I think I would look at it as an early fourth quarter event. We've said that we are not counting on revenue this year for either OvaWatch or the BioReference co-marketing arrangement. There could be some uplift there, but frankly, we just -- we didn't think it was appropriate to rely on that.\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nOK. Got it. Thanks for taking my questions.\n\nNicole Sandford -- President and Chief Executive Officer\n\nSure. Thanks for the question.\n\nOperator\n\nThank you. Ladies and gentlemen, we have reached the end of the question-and-answer session. And I'd like to turn the call back over to Nicole Sandford for closing remarks. Over to you, ma'am.\n\nNicole Sandford -- President and Chief Executive Officer\n\nThank you, everyone, for joining us today. We look forward to seeing all of you on our KOL event on August 24.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNicole Sandford -- President and Chief Executive Officer\n\nRyan Phan -- Chief Scientific and Operating Officer\n\nBob Beechey -- Chief Financial Officer\n\nGriffin Soriano -- William Blair and Company -- Analyst\n\nRoss Osborn -- Cantor Fitzgerald -- Analyst\n\nMore AWH analysis\n\nAll earnings call transcripts"
}