{
  "companyName": "Baidu",
  "companyTicker": "BIDU",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/30/baidu-bidu-q2-2022-earnings-call-transcript/",
  "content": "Baidu (BIDU -0.63%)\nQ2 2022 Earnings Call\nAug 30, 2022, 8:00 a.m. ET\n\nOperator\n\nThank you for standing by, and welcome to the Baidu second quarter 2022 earnings conference call. [Operator instructions] I would now like to hand the conference over to Juan Lin, head of investor relations for Baidu. Please go ahead.\n\nJuan Lin -- Director of Investor Relations\n\nHello, everyone, and welcome to the second quarter 2022 earnings conference call. Baidu's earnings release was distributed earlier today, and you can find a copy on our website as well as on Newswire services. On the call today, we have Robin Li, our co-founder and CEO; Rong Luo, our CFO; Dou Shen, our EVP in charge of Baidu AI cloud group; and Jenny Li, our SVP in charge of Baidu intelligent driving. After our prepared remarks, we will hold a Q&A session.\n\nPlease note that the discussion today will contain forward-looking statements made under the safe harbor provision of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from our current expectations. For detailed discussions of these risks and uncertainties, please refer to our latest annual report and other documents filed with the SEC and Hong Kong Exchange.\n\nBaidu does not undertake any obligation to update any forward-looking statements except as required under applicable law. Our earnings press release and this call include discussions of certain another non-GAAP financial measures. Our press release a reconciliation of the note non-GAAP measures to the analysis most directly comparable GAAP measures and is available on our IR website at ir.baidu.com. As a reminder, this conference is being recorded.\n\nIn addition, a webcast of this conference call will be available on Baidu's IR website. I will now turn the call over to our CEO, Robin.\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nHello, everyone. Baidu Core earned RMB 23.2 billion in revenues and 5.1 billion in non-GAAP operating profit in the second quarter. The resurgence of COVID-19 led to an unfavorable macro environment in the quarter. However, Baidu AI cloud and intelligent driving business maintained their rapid growth momentum as we aligned well with the government's repeated cost for technology innovation.\n\nEspecially Q2 revenues from Baidu AI Cloud increased by 31% year over year outgrowing many of our peers, contributing 18% of Baidu Core's revenues in the quarter. That's up from 14% in the same period last year. Further, the operating margin for Baidu AI Cloud improved on both a year over year and quarter-over-quarter basis. Apollo Go completed 287,000 lines in Q2, increasing by almost 500% year over year.\n\nOn July 20, Apollo Go's accumulative price reached 1 million. And in July, we unveiled Apollo RT6, the sixth generation Apollo robotaxi vehicle, bringing the cost of robotaxi to the price of mass-market electric vehicles for the first time in China and globally. We aim to put a sizable amount of RV vehicles into operation in the year 2024. While Baidu Core ad revenue decreased by 10% over the year, in second quarter due to a challenging macro environment, our mobile ecosystem continued to generate strong cash flow as we focused on operational excellence and efficiency.\n\nSince early June, we have seen signs of recovery as the control measures were gradually lifted. For example, the year-over-year decline of our ad revenues narrowed in June and July. In particular, ad revenues from retail customers resumed year-over-year growth during the 618 shopping festival. Project implementation for Baidu AI cloud has also been improving, thanks to the gradual removal of some major travel restrictions.\n\nWhile the recovery is likely to be at a gradual pace, and there are still some uncertainties about the development of COVID-19, our long-term goals, strategies and capabilities for shareholder value creation remain intact. As I do, we have built a discipline of long-term thinking, which we believe is a strong asset in this fast-evolving innovative and highly competitive wins environment. Cost optimization and operational efficiencies are always top of mind for us. Our mobile ecosystem business should continue to generate strong cash flow to fuel and fund our investments in Baidu AI cloud and intelligent driving over the long term.\n\nNow let's review the second quarter operational highlights. Revenues from Baidu AI Cloud grew by 31% year over year in the quarter, once again, stating our peers despite the macro challenges brought by COVID-19 resurgence. Our growth was driven by the strong performance in cloud business within enterprise business and the public sector. Fortunately, we managed to improve our operating margin both on a year over year and quarter-over-quarter basis in Q2 as we focused on healthier and more sustainable cloud revenue growth.\n\nWe aim to achieve profitability as we scale up further. AI cloud continues to benefit from the growth opportunity in China, digital and intelligent transformation. We believe this transformation is due at the early stage, and organizations are eager to leverage technologies to improve efficiency and productivity. Over the past years, we have made tremendous advances in AI technologies, made our AI capabilities widely available to enterprises and developers through our open platform, gained valuable for industry expertise, saw significant improvements in productivity in areas like manufacturing, transportation, energy and utilities and the public sector.\n\nBaidu AI cloud's differentiating strengths are our AI capabilities and deep understanding of industry-specific pain points to help our customers to accelerate their transformation. In short, our competitiveness enables us to take full advantage of the tailwind offered by these new secular trends. Revenues from ACE Smart Transportation increased by about 40% in Q2. During the second quarter, we won several new projects for highway and in urban roads, both from our new and existing customers.\n\nBy the end of second quarter, Baidu ACE Smart Transportation has been adopted by 51 cities up from 20 cities a year ago and 41 cities a quarter ago based on the contract amount over RMB 20 million. Going forward, we will continue to focus on key industries and enable cross-industry replications for similar use cases by utilizing AI innovation. By doing so, we believe we will be able to reduce the operating losses and achieve profitability over time. In the meanwhile, we will continue to focus on quality and sustainable revenue growth and aim to continue outgrowing our peers.\n\nMoving to Intelligent Driving, Apollo continues to take a big step toward building up operations, strengthening its lead position as the world's fifth autonomous ride-hailing service provider. In Q2, Apollo Go provided 287,000 rides to the public, up from almost 500% year over year and 50% quarter over quarter. On July 20, 2022, Apollo Go accumulated rides reached 1 million. In the Edon region of Beijing, according to our estimate, Apollo Go has obtained a 10% market share for ride-hailing services with pickup and drop-off both in EDRAM.\n\nApollo Go already becomes an important supplement for daily commuting after we launched the services less than two years ago. Now more than 100 callable vehicles are serving the resident on a daily basis, and each vehicle on average, completes more than 20 per day. In July, Apollo Go branched out to Huali and Chengdu and is now operating in more than 10 cities charging fees in seven cities across China. We believe large-scale operation allows us to improve our level for autonomous driving technologies further.\n\nWith data generated from everyday operation, we can identify problems that are not visible during the testing phase. The number of corona cases incurred during operations has far exceeded the ones found by vehicles and testing. In addition, Apollo Go has made some exciting progress since our last earnings call, marked by receiving the green light to provide fully drive ride-hailing service systems and launching of the sixth-generation robotaxi vehicle, RT6. Earlier this month, we obtained the regulatory permits in Chongqing and Wuhan to provide fully driverless ride-hailing services on all panels.\n\nWe were also authorized to collect fees on those services. We are proud to be the first and only company in China now to offer fully driverless ride-hailing services to the public, opting out entirely without human drivers in the car. Such achievements validate our superior level four autonomous driving technology and endorse our strategy of utilizing large-scale operations to boost further technological advancements. On July 21, Baidu World, we unrolled Apollo RT6, the sixth-generation with a targeted mass production cost of RMB 50,000.\n\nThis is significantly lower than the mass production cost of the fifth-generation vehicle and is in the price range of mass-market electric vehicles. Art is designed to offer large-scale fully driver-side heating services and launched at a time that both our technology, both our technological and operational capabilities are ready. We believe that China's smart EV value chain has already been well established. Some of the auto parts and components for level four on an driving solutions are already being produced in China at a much lower price than a few years ago.\n\nMoreover, RT6 is a passenger-centric vehicle, so we have removed some components, especially designed for drivers. For example, RT6 has a detachable steering wheel, which could unlock space for extra seat, luggages, rests and even some entertainment equipment in reaching the in-car experience for the passengers. Such achievements have set a strong foundation for Apollo Go to significantly reduce the two largest cost items for its operations, labor cost and the robotaxi vehicle cost. This is a critical step for Apollo Go to build a revolutionary business model and accelerate its expansion.\n\nOver the long term, we aim to make Apollo Go an alternative mobility option for millions of people, creating tremendous economic and social values. Baidu's Apollo Auto Solutions, including ASD and our OS for auto continues to gain popularity among automakers. As an increasing number of auto OEMs have publicly committed their brands to autonomous and connected vehicles, we're pleased to say that many have chosen to form alliances with Baidu to expedite their time line and plan. Recently, the total projected accumulated sales of our auto solutions have grown to RMB 10.3 billion per our internal estimate.\n\nMoving to the mobile ecosystem, the user base of our mobile ecosystem continued to grow steadily. We once again delivered strong margins in the second quarter despite the negative impact on our absence caused by macro weakness. On the user side, Baidu app's MAU increased by 8% year over year to 628 million in June. Data search and the content is distributed through Baidu app grew double digits year over year in Q2.\n\nOur innovations and efforts in delivering a closed-loop experience has made by as increasingly valuable to users. In addition to searching for information and knowledge, people come to buy the app to look for ways to fulfill their needs. We have enabled them to order services, purchase products and interacted with industry experts and others without leaving the lab. Here are some metrics to share.\n\n84% of our DAU in June were locking users -- that's up from 76% a year ago. People have discovered that their user experience within Baidu App continues to improve once they are locked in. quarterly GMV facilitated Baidu Search, LotSmart grow by about 127% year over year. In particular, during the 618 shopping festival, GMV increased by about 260% year over year.\n\nIn June, while 130,000 industry experts actively signed up for our instant replies future, up from about 100,000 in March. Total daily instant replies increased by about 190% year over year, up about 30% from March. Another highlight is our progress in short below. Currently, about 85% of the content distributed within Baidu app feed are short video.\n\nDuring the quarter, we expanded the fully immersive video experience in the service home page to all the users. This feature is now available on both search and feed helping a short video consumption on value app. In Q2, short videos distributed through certain feed increased by double digits year over year. In addition, we are also using AI to expand our content portfolio.\n\nWe give common creator AI tools, which they can use to produce video content more efficiently. AI-generated content work particularly well for long-term content and breaking mils. While using our close look experience, more and more users leading their footprint within our mobile ecosystem, increasing our capability to understand user needs and enabling strong conversion optimization at each step of their journey. Together with our continuous effort to optimize the advertising technologies, this has helped us to significantly improve the app conversion rate for our customers.\n\nLooking ahead, here are some key takeaways I'd like to give you. First, operationally, we have built strong new growth engines for Baidu Core which we believe will boost Baidu Core's revenue growth in the coming years. Willis uniquely in AI capabilities continues to outgrow most of our peers. Apollo continues to solidify its position as the largest autonomous ride-hailing service provider in the world.\n\n[Inaudible] has entered a new chapter with fully family slide heating open -- while the long term our purpose-built RT6 robotaxi vehicles for rita at really low cost, Apollo is set to accelerate its operation, further differentiating from our peers in both technology and operation. And the second takeaway financially is -- the mobile ecosystem will continue to generate strong cash flow to fund our investments in cloud and intelligent driving. On a separate note, we are also excited about IT's continuous efforts in improving operational efficiency. So once again generated operating profit in Q2, the second consecutive quarter to report positive operating profit on both GAAP and non-GAAP financial measure.\n\nFurthermore, IC generated positive net operating cash flow in the quarter for the first time. Before I turn the call to Rong, I'd like to highlight that we will be added to the Hang Seng Index from September 5. We believe with the inclusion of Hang Seng Index, one of the best-known industries in Asia the Hong Kong shares of Baidu will receive more flow. Overall, I'm very proud of the team's strong execution in the quarter and remain excited about our future.\n\nWith that, let me turn the call over to Rong to go through our financial highlights.\n\nRong Luo -- Chief Financial Officer\n\nThank you, Robin. Now let me walk you through the details of our second quarter financial results. Total revenue was RMB 29.6 billion, decreasing 5% year over year. Revenue from Baidu Core was RMB 23.2 billion, decreasing 4% year over year.\n\nBaidu Core, online marketing revenue was RMB 17.1 billion, decreasing 10% year over year. Baidu Core non-online marketing revenue was CNY 16.1 billion, up 22% year over year. driven by cloud and other AI power businesses. In Q2, Baidu AI car increased by 31%, 31% year over year to RMB 4.3 billion.\n\nRevenue from IT was RMB 6.7 billion, decreasing 13% year over year. Cost of revenues was RMB 15.2 billion, decreasing 5% year over year. primarily due to a decrease in content cases, partially offset by the increase in personnel-related expenses and other courses related to new AI businesses. Operating expenses were RMB 11.1 billion, decreasing 8% year over year, primarily due to an increase in channel spending and promotional marketing expenses.\n\nOperating income was RMB 3.4 billion. Baidu Core operating income was RMB 3.2 billion, and Baidu Core operating margin was 14% on for -- non-GAAP operating income was RMB 5.5 billion. Non-GAAP Baidu's core operating income was RMB 5.1 billion, and non-GAAP Baidu Core operating margin was 22%. Total other income net was RMB 151 million compared to a total other loss of RMB 2.4 billion last year, which included a fair value loss of RMB 3.1 billion from long-term investments.\n\nIn the second quarter of 2022, we recognized a favorable gain of RMB 536 million, a significant portion of long-term investments including, but not limited to, investments in equity securities of public and private companies, private equity funds and digital assets is subject to quarterly fair value adjustments which may contribute to a net income volatility in future periods. Income tax expenses was CNY 125 million, decreasing 99% year over year, primarily due to the reversal of certain tax expenses accrued for 2021 based on the 2021 tax return filed in the second quarter of 2022 and an increase in deduction on certain expenses are considered not deductible in the second quarter of 2021. Net income attributable to Baidu was RMB 3.6 billion, and diluted earnings per ADS was RMB 9.97 in Net income attributable to Baidu Core was RMB 3.7 billion. Non-GAAP net income attributable to bias RMB 5.5 billion, -- non-GAAP diluted earnings per ADS were RMB 15.79%.\n\nNon-GAAP net income attributable to Baidu Core was RMB 5.4 billion. and non-GAAP net margin for Baidu Core was 24%. Adjusted EBITDA was RMB 7.1 billion, and adjusted EBITDA margin was 24%. Adjusted EBITDA for Baidu Core was RMB 6.6 billion, and adjusted EBITDA margin for Baidu Core was 28%.\n\nAs of June 30, 2022, cash, cash cadence restricted cash and shopping investments were RMB 189.4 billion and cash, cash equivalents -- the state cash and short-term investments, excluding IT were RMB 184.5 billion. Free cash flow was RMB 5.5 billion and free cash flow, excluding IT, was RMB 5.5 billion. Baidu Core had approximately 36,000 employees as of June 30, 2022. With that, operator, let's now open the call to questions.\n\nOperator\n\n[Operator instructions] First question is from Alex Yao of J.P. Morgan. Please go ahead.\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\nManagement I note you guys mentioned that you are seeing a sign of recovery in your advertising business since -- could management just share more color on the recovery in terms of advertising categories? Looking into the second half of 2022, how do you expect the advertising to develop -- and in the medium to longer term, if we look beyond the near-term impact on COVID, how do you foresee the advertising business to develop in the medium term?\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nAlex, this is Robin. As you know, by the quarter, ad revenues decreased about 10% year over year last quarter because of the challenging macro environment. In April and May, our ad revenues experienced a significant year-over-year decrease because COVID-19 impacted some of China's major cities, especially Shanghai and to a lesser extent, Beijing. In June, our ad revenue started to recover, when the situation gradually improved and July was better than June.\n\nIn terms of ad verticals, some verticals got hit really hard in April and May. That includes the retail sector, travel, local services and healthcare. As spending from these verticals has been picking up quickly since June. Looking into the second half of the year, we're still facing macro uncertainties.\n\nIt is hard for us to predict the divestment of [Inaudible] at this stage. For example, the resurgence in some of the hot travel destinations like Kenya, caused by the early ending of the summer travel peak season. Our search app is highly correlated with China's GDP growth and the performance of China's SMEs. So we believe our ad revenue should recover when macro improves.\n\nWe have also seen some opportunities for our mobile ecosystem around e-commerce and short videos. For example, integrating e-commerce and short videos with our search and feed. In fact, more and more short videos are available in our search results. This should help us to improve the user experience.\n\nI think in the mid- to long term, our in which the content in key verticals and our capabilities in facilitating transactions within Baidu App as well as our closed-loop experience for users, will help us to create more user insights for our customers.\n\nOperator\n\nThe next question comes from Kenneth Fong of Credit Suisse.\n\nKenneth Fong -- Credit Suisse -- Analyst\n\nCongratulations on another quarter with a strong cloud revenue growth. Can you help us understand the underlying drivers that help Baidu AI cloud to outperform your peers? What's your outlook for the cloud business for the second half of the year? And I'm wondering if you can also help us understand your strategy as well as time line for the cloud business to reach breakeven?\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nThank you, Ken, for your question. I will address the revenue part and leave the second part to One. as Robin just mentioned, right, Baidu AI cloud continues to grow pretty well in Q2 despite the challenging macro environment. And the revenue was up 31% year over year, and the AI cloud now contributed to almost 20% of the total BidCo revenue.\n\nWe believe what differentiates by cloud from our peers is that we have been dedicated to integrate cloud computing with AI so that our AI capabilities can help our customers to improve efficiency. To be more specific, as a cloud vendor, we have strong AI capabilities. While on the other side, as an AI solution provider, we have strong cloud computing capabilities. So also as we mentioned, right, so the enterprises in the public sector were the main growth driver for cloud computing.\n\nSo we built that in China, the traditional enterprises in the public sector are still at the early stage of digital and intelligent transformation. So clearly, this transformation means organization is no matter big or small, they want to use AI to improve their efficiency and their competitiveness, so which will further drive the demand for high-performance computing. So as a result, right, the combined revenues for -- from manufacturing, energy, utilities and the public sector almost doubled in Q2. In the smart transportation, we continue to leverage our leading AI technologies and the deep understanding of autonomous driving to grow our business.\n\nSo we see small transportation has already become one of the largest verticals for our Baidu AI cloud. So with that, we are confident that revenues from enterprises in the public sector will continue to drive the growth of Baidu AI cloud in the future. Also since early June, we have seen some gradual improvement in project implementation. But for sure, there are still some uncertainties around COVID-19 in the near term.\n\nBut however, we believe the strong need and the trend for China remain unchanged. And with that, we aim to continue growing faster than our peers.\n\nRong Luo -- Chief Financial Officer\n\nSo I will answer the question about margins. As the AI cloud continue to generate positive gross margins in the second quarter, same as we in the first quarter. On top of that, we managed to improve our operating margin thanks to our strategy to focus on quality and sustainable revenue growth. So we have two parts in our AI cloud, the first place in the personal cloud.\n\nThe personal cloud contributes a small portion of the overall cloud revenue it should continue to generate big operating profit, and its revenue is growing a little bit slower than overall cloud. And the second part, which is the majority part is enterprise and pubs cloud, which continue to generate positive gross profit in the second quarter. We improved operating margin growth on a year over year and quarter-over-quarter basis. This was because we practically focus on high-quality revenue growth and gradually will reduce the unhealthy projects.\n\nI think in the future, we will work very hard to narrow the loss margins. Within enterprise and public sector cloud, the ACE Smart Transportation, which just as mentioned by to, just not already insurance a very healthy gross margin. because of the higher portion of the software and AI components. We think ACE's Smart transportations may achieve breakeven earlier than any other verticals in the coming quarters.\n\nand because we have focused on to provide mortalized solutions and products to for the key use cases, for example, urban roads, highways and power Secondly, I think we are also working very hard to replicate the similar scenarios in use cases across different industries. Require AI technology to find our connections across many different scenarios. We believe that our AI technology, such as the large models will help us to achieve that goal. Overall, we will continue to focus on quality and sustainable revenue growth to improve margins and reach profitability in the next few years.\n\nOperator\n\nThe next question comes from Lincoln Kong of Goldman Sachs.\n\nLincoln Kong -- Goldman Sachs -- Analyst\n\nMy question is about robotaxi. So we're quite impressed that RT6 is targeting a cost of RMB 250,000 per car. -- and that's significantly lower than the generation of the taxi models. So can management help us understand what's the main driver for this cost reduction? And what's our outlook for the future cost trend? And how should we think about robotaxi's economic mechanism on this cost? And any time line, I think when to expect major commercial contribution from the robotaxi business.\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nLincoln, this is Robin. I think there are three drivers for the cost reduction. First, it's our deep knowledge in the autonomous driving technology and operations. Over the past nine years, Baidu has seen strong level four technology and gained industrial industry know-how on the auto industry and how to operate our four ride-hailing services.\n\nAlso, we have become the largest home heating service provider in the world. So we fully understand the auto drive seating market and understand our passengers' needs. We know where we can simply find our in-car features and where we should allocate more resources. For example, RT6 is a passenger-centric vehicle, another driver-centric vehicle.\n\nSo on one hand, we have reduced some in-car features designed for the driver to reduce the cost like I mentioned during the prepared remarks, RT6 can remove the steering well and exclude some other accessories such as white screen, while display screen for drivers. On the other hand, we put more efforts on safety performance and the passenger experience to make RT6 passenger centric. For example, we have used safety redundancy in seven parts of rice setting an industry standard. This includes redundancy for computing unit, sensors, steering systems, braking systems, communication system, power supply and auto architecture.\n\nAlso RT6 is designed for more in-car space and better in-car experience. I also want to highlight that about 60% of our RT6 BOMs for intelligent features like L4 and automating capabilities. The second driver is scale. We plan to leverage third-party automakers to produce arc for us.\n\nSo RDX will not retrofit on a passenger vehicle. This is a key differentiator of RT6. We will pay for the BOM of 6 instead of the retail price like what we did in the past. One by moving away from retrofitting vehicles to use third-party automakers to produce RDI, that's because we have the capability to offer large scale will protect the operation.\n\nsupported by our leading autonomous driving technology and operational capabilities. And I think the third driver is the divestment of the value chain for China's intelligent EV industry. RT6 was launched at the time when China's intelligent industry is well built up with many new EV companies and auto part producers in the market. In particular, many autonomous driving-related auto parts are now being produced locally.\n\nSo intelligent EVs are becoming more affordable than before. And for the automotive-related auto parts, its cost is also much lower than before. For example, LiDAR. LiDAR is the most important component for autonomous driving solutions.\n\nIt was charged hundreds of thousands of U.S. dollars in the beginning, but now it only costs like $1,000. So in the future, we believe the BOM for our robotaxi will continue to decrease because China's intelligent EV industry will continue to develop. And Apollo Go will continue to scale.\n\nOur approach is a gradual approach. We will continue to roll out regions in different cities. So, therefore, scale up our robotaxi service, as we gain scale, as we improve continuously on technology, I think that the cost for operating such a service will continue to drop. And we certainly have the first-mover advantage and the barrier to entry for this will become higher and higher.\n\nOperator\n\nThe next question comes from Alicia Yap of Citigroup.\n\nAlicia Yap -- Citi -- Analyst\n\nI have a follow-up question on Apollo Go. So congratulations on some of the solid achievements recently. Can management provide some update on regulatory environment for autonomous driving and robotaxi in China? And how Baidu will capture this trend? And then can management also provide updates on Baidu's goal and strategy for this fully driverless operation?\n\nJen Li -- Senior Vice President and Head of Intelligent Driving\n\nThank you. Thanks. This is Jen. Just as Robin said, OGO is already the largest automotive service wiring.\n\nIn Quarter 2, optical has completed 287,000 rides and were clearly ridesharing surpassed $1 million. This number is much higher than option -- our strategy is to leverage a large operation to improve level technology and growing faster and larger. This is very important in China because of the road and traffic acquisition are when we communicated here and the data generated from larger steel operations will help us to improve our lower hall technology and open the problem. Today, our goal is already available in more than 10 cities including all the Tier 1 cities in China.\n\nOur operating areas are many places, including visions, office buildings and the hospitals cities. On the upside, we're also expanding of [Inaudible]. With [Inaudible] RT6 as a target market production cost or RMB 250,000. We will be able to purchase grow off-rate at a faster pace.\n\nIn the future, we will continue to improve our level four technology, and grow our operation. Also, we will try to push and make our influence on China's regulation or autonomous drive. For technology, we started up to offer autonomous ride-hailing services on open growth in Wuhan on May 1. In less than three months, we will allow us to provide fully dressing services on the open road.\n\nThe great progress is for our leading technologies and capability.\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nFor operation and the EDRAM region in as Robin mentioned, we have already acquired about 10% back share for riding heating services in the region. Our average each of tactical commit more than 25. As a pioneer in the industry, Baidu worked closely with the regulator to set up regulations and industry standards. Recently, the Chinese ministry for transport issued a draft of deadline for the driving record transportation safety services.\n\nThe guidelines aim to push the commercial operations or autonomous ride-hailing services in China. This is the first regulation on our ride-hailing services. At a central government level globally. It matched efforts in promoting high-level autonomous driving.\n\nWe are proud to be the first and only company in China to offer fully [Inaudible] free ride-hailing services. In early August, Baidu was allowed to provide fully publicwide heating services and classic in Chongqing and Wuhan who owned China's major cities in the Middle East. In the future, we will continue to scale up our region and try to push fully drives the right heading to mortgages.\n\nOperator\n\nThe next question comes from Eddie Leung of Bank of America Merrill Lynch.\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nI have a question about your autonomous driving solution for OEMs. So you mentioned that the contract value after the end quarter was just over $10 billion. It doesn't seem to be increased increasing much from the last quarterly result, could you tell a little bit about the reason behind that? And then could you also remind us some of the automakers that have been working with you guys in using your autonomous driving solutions?\n\nRong Luo -- Chief Financial Officer\n\nEd, let me answer your questions. I think as Robin mentioned in the remarks, yes, the total projected cumulative sales of our ad solutions has been RMB 10.3 billion as per our own estimates. I think later talk about the numbers we need to keep in mind, the smart EV is a trend that is irreversible. For cars, we believe that over the long term, electrification is just a part of the play and intelligence in the game changer.\n\nSo in the future, EV without intelligent driving capabilities will not be competitive. And many automakers like some leading domestic or even international automakers, they are interested in using our solutions for their models to capture this kind of new market opportunity. Based on our conversations with them, we understand the automakers like our AI capabilities, our insights of the autonomous driving and our strong brand. And we are talking with many of the automakers, both locally and globally, and some are very large names in the industry.\n\nI want to emphasize that each automaker has its own schedule for setting up the countries with the suppliers. This could result in a different pace of our backlog. This is absolutely normal in auto industry. As of today, we have partnered with many automakers, including some leading like Audi Denver model and so on.\n\nAnd in addition to our in-car infotainment solutions, more and more customers now are adopting our Apollo self-driving products, including the AMP products Apollo Navigation Pilot for highways or urban roads. The automatic AVP products and HD Maps products. I think in the future, we will continue to expand our partnership to work with more automakers -- and as more and more models equate our auto solutions are set to be launched into the market in the coming three years, the auto solution should start generating many revenues.\n\nOperator\n\nThe next question comes from Gary Yu of Morgan Stanley.\n\nGary Yu -- Morgan Stanley -- Analyst\n\nCongratulations on the solid results. My question is about margin and cost control and optimization. We saw that you achieved another strong quarter results with margin better than expected. Could you please elaborate the efforts to talk for such encouraging results and what is the margin outlook for the second half of the year?\n\nRong Luo -- Chief Financial Officer\n\nYes, thanks so much, Gary, and I'll answer this question. I think despite of the very challenging macro environment in Q2, Baidu cost, non-GAAP operating margin is 22%, which is up five percentage points quarter over quarter. Over the past few months, I think we have made a lot of efforts to improve our operational efficiencies -- and for example, the Baidu cost, SG&A was down by 12% year over year in the second quarter. I think our business are at a different stage of development.\n\nSo we have different strategies of investment for each business. For the mobile ecosystem, which is relatively mature business, our goal is to keep its profits and margins solid. So that our remote ecosystem can continue to generate a very strong cash flow to support our investments in the new AI initiatives. I think for our new AI businesses, we will be focused on AI cloud and intelligent driving.\n\nBoth of them grew very fast in the past few quarters, which you can see there. So we will continue to make necessary investments as needed. AI now will remain focused on here and sustainable revenue growth, and we aim to continue improving our operating margins in the future.\n\nOperator\n\nThe next question comes from James Lee of Mizuho.\n\nJames Lee -- Mizuho Securities -- Analyst\n\nMy question is regarding Jidu, and congratulations, by the way, on your launch in June. And at the same time, you guys also launched RT6. I'm just curious about maybe the positioning of Jidu and RT6. Can you guys talk about the customer segmentation strategy of the two autonomous driving vehicles? Just curious how much overlap in demand between the two.\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nYes. This is Robin. The position for Jidu and RT6 are very different. Before I talk about Jidu, let me first talk about our strategy for intelligent driving.\n\nOur goal is to provide large-scale fully driverless ride-hailing services on open road. This is powered by our L4 autonomous driving technology. And at the same time, we use some of our L4 capabilities to put them into assisted driving features to support automakers' intelligent driving needs. And Jidu is just a perfect example of such automakers.\n\nSo if you look at our bus portfolio for intelligent driving, we have RT6. RT6 represents Baidu's best automating technology. RT6 is for large-scale fully driverless ride-hailing services on open road. That is not a consumer-facing vehicle.\n\nI mean it's not selling to the consumer. Jidu's ROBO-01 is a consumer seating product. We put on our Level 4 technology into level three or level two plus, if you will. Jidu ROBO-01 will be equipped with AMP 3.0, our most advanced autonomous driving solution.\n\nAMP 3.0 can handle end-to-end intelligent driving and parking, urban roads and highways. Also, our smart cabin will be installed in the car. It allows Jidu to provide voice interaction, insights and outside the car. We believe these new features will help us to expand our business.\n\nFor the timeline, we could see everything is well on track. We could see the first mass-produced ROBO-01 finished very soon. The time line demonstrate Jidu's capability from design to mass production. Jidu plans to take orders for ROBO-01 later this year and deliver the vehicles starting 2023 And Jidu has the second model planned to launch at the end of this year, then start taking orders in 2023 and deliver in 2024 for our second model.\n\nOperator\n\nOur last question will come from Wei Xiong of UBS.\n\nWei Xiong -- UBS -- Analyst\n\nFirst, I'm wondering if management can share some updates on your capital allocation. Could management talk a bit more on the implementation of your share buyback program? And how do you balance the investments into new businesses versus doing more buybacks or dividend? And second, as we recently saw the development between the U.S. and Chinese regulators regarding the audit inspections of ADRs, could management also share your thoughts on this progress? And given some of your peers have started the process to convert into dual primary listing, I was wondering would Baidu also consider such a U.S. Hong Kong due primary listing status?\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nYes. Thank you for your questions. Let me to your questions. I think as of today, we have returned about USD 2.9 billion to shareholders under the 2020 share repurchase program.\n\nThe program authorized USD 4.5 billion cap which means we still have around USD 1.6 billion left in the program. Baidu will continue to buy back our shares from open markets since we quite strongly believing our long-term developments. If you're looking to our balance sheet, as of Q2, our cash equivalents, restricted cash and short-term investments were USD 28.3 billion, and we also have the other USD 11.1 billion in our loan term investments. And if you look into our business today, some of that was mentioned in our previous remarks, I think for mobile system, it continues to generate wide healthy profits and margins.\n\nFor Baidu AI cloud, the revenue has been growing very fast, faster than our peers in this industry. For Apollo Go, it's already the largest outside heading service provided in the world. So everything is pretty much on track. So we believe that we are on the right direction, and we will continue to invest in other steps.\n\nAnd about the second question about the delisting and the primary in Hong Kong, I think the most recent statement of the protocol site between the PCOB and the Chinese authorities marks the very important first step toward opening access for the PCOB to investigate complete to the rest public accounting fund in China. I think which is a very important milestone for both countries and China-based issue with the ADR trading in the U.S. Also, we can feel that the two governments are practically seeking solutions. For Baidu, we have already had the Hong Kong secondary listing, and we have some major shareholders who converted their ADR into ordinary shares in Hong Kong.\n\nAlso, we are also very glad to be included in the index. It will take effect on September 5. We believe with the inclusion to the Hang Seng Index, our Hong Kong shares will receive more front flow. For the primary listing, as far as what we understand, the process of switching from the secondary to primary listing in Hong Kong should be straightforward.\n\nWe don't see any kind of hurdles for us to achieve that. But I think what's more important for us is to remain focused on business fundamentals and drive long-term shareholder values. Also, Baidu will continue to comply with applicable loss in both China and the United States and try to maintain listing both in NASDAQ and Hong Kong exchange.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJuan Lin -- Director of Investor Relations\n\nRobin Li -- Co-Founder and Chief Executive Officer\n\nRong Luo -- Chief Financial Officer\n\nAlex Yao -- JPMorgan Chase and Company -- Analyst\n\nKenneth Fong -- Credit Suisse -- Analyst\n\nLincoln Kong -- Goldman Sachs -- Analyst\n\nAlicia Yap -- Citi -- Analyst\n\nJen Li -- Senior Vice President and Head of Intelligent Driving\n\nEddie Leung -- Bank of America Merrill Lynch -- Analyst\n\nGary Yu -- Morgan Stanley -- Analyst\n\nJames Lee -- Mizuho Securities -- Analyst\n\nWei Xiong -- UBS -- Analyst\n\nMore BIDU analysis\n\nAll earnings call transcripts"
}