{
  "companyName": "nCino",
  "companyTicker": "NCNO",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/01/ncino-ncno-q3-2023-earnings-call-transcript/",
  "content": "nCino (NCNO 1.77%)\nQ3 2023 Earnings Call\nNov 30, 2022, 4:30 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to nCino's third quarter fiscal year 2023 financial results conference call. At this time, all participants are in listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator instructions] As a reminder, today's program is being recorded.\n\nAnd now, I'd like to introduce your host for today's program, Harrison Masters, investor relations. Please go ahead, sir.\n\nHarrison Masters -- Investor Relations\n\nGood afternoon and welcome to nCino's third quarter fiscal 2023 earnings call. With me on today's call are Pierre Naude, nCino's chairman and chief executive officer; David Rudow, chief financial officer; and Josh Glover, president and chief revenue officer. During the course of this conference call, we will make forward-looking statements regarding trends, strategies, and the anticipated performance of our business, including, without limitation, the acquisition and integration of SimpleNexus. These forward-looking statements are based on management's current views and expectations, entail certain assumptions made as of today's date and are subject to various risks and uncertainties described in our SEC filings and other publicly available documents, the financial services industry, and global economic conditions.\n\nnCino disclaims any obligation to update or revise any forward-looking statements. Further, on today's call, we will also discuss certain non-GAAP metrics that we believe aid in the understanding of our financial results. A reconciliation to comparable GAAP metrics can be found in today's earnings release, which is available on our website and as an exhibit to the Form 8-K furnished with the SEC just before this call. With that, I will now turn the call over to Pierre. \n\nPierre Naude -- Chairman and Chief Executive Officer\n\nThanks, Harrison, and thank you all for joining us today. I'm extremely proud of our team's execution in the third quarter as we once again exceeded top and bottom-line expectations. We generated $105.3 million in total revenues including SimpleNexus, a 50% increase over the third quarter of fiscal '22. Subscription revenues were $88.3 million, an increase of 55% year over year.\n\nExcluding SimpleNexus, subscription revenues grew 28% organically. This quarter marked our first quarter with over $100 million in total revenues and also our first profitable quarter on a non-GAAP operating income basis. For the past two earnings calls, we have emphasized our commitment to profitability in fiscal '24, and I'm very happy with the progress we have made to date. We plan to significantly increase our non-GAAP operating income next year, and I will touch upon that shortly.\n\nOn the customer front, we were pleased to issue a press release shortly before this call, announcing that the Bank of New Zealand has selected the nCino Bank Operating System as a foundational technology platform, making the Bank of New Zealand one of our largest customers globally. With over $55 billion in assets, Bank of New Zealand is one of the country's largest financial institutions. We couldn't be prouder to be in business with them and greatly appreciate the opportunity to showcase the value our solutions can bring to financial institutions around the globe. I'm also pleased that following the announcement last month of a successful go-live with Kiraboshi Bank in Tokyo, we have two additional go-lives in Japan in the quarter, including SMBC Trust Bank.\n\nWe are excited to see good momentum and traction in the market representing an estimated $1 billion opportunity. Among numerous other go-lives in the third quarter, our first customer in Germany is now live. Hamburg Commercial Bank, or HCOB, was recently recognized by Euromoney as the world's best bank transformation for 2022. We are honored to be their partner as they continue optimizing systems and processes to maintain their market leadership position.\n\nAs I've mentioned before, getting customers live and referable is what we truly celebrate at nCino, and this is of particular importance in our newer markets. I also would like to highlight the performance of SimpleNexus business, which had another strong quarter under difficult market conditions. SimpleNexus grew total revenues 38% organically year over year and had six competitive takeaways and five cross-sells to nCino customers. Despite the current headwinds in the U.S.\n\nmortgage market, we believe the quality of this business, including its people, technology, and recurring subscription-based revenue model, positions us to continue to take market share and emerge on the other side of this rising interest rate environment as the clear leader in this space. Obviously, the banking environment remains top of mind. We have spoken with numerous customers and prospects about market conditions, and their feedback has generally been positive. With banks and credit unions sharing that they are well capitalized, realizing improved net interest margins and that credit risks are in check, this bodes well for nCino over the long term.\n\nFinancial institutions remain focused on the need to digitally transform in order to be competitive and to better serve their clients. And as a result, our sales pipeline remains healthy and continues to grow nicely. That said, we are not tone-deaf to external conditions and the bottom-line expectations of the market, which have changed materially over the past year. Against the backdrop of macroeconomic and geopolitical uncertainty, we are seeing a more measured buying environment and increased executive scrutiny on purchasing decisions, particularly in Europe, which extend sales cycles and the time required to close deals.\n\nAdditionally, FX headwinds and a challenging U.S. mortgage market persisted through the third quarter. So, what does this mean for our business? Well, we actually view this more challenging macro environment as an opportunity to aggressively evolve from a best-in-class growth SaaS company into a best-in-class profitable growth SaaS company. With the investments we have already made in sales, products, customer support, professional services, and geographies, we are very well-positioned to grow market share and continue leading the digital transformation of financial institutions around the world.\n\nOn the bottom line, you have seen a significant improvement in our performance during the course of this fiscal year, and we expect that trend to continue next year and beyond as we further optimize our cost structure and drive more meaningful leverage on the expense side of the P&L. We have been able to accomplish this improved bottom-line performance without changing our strategy or investment priorities, but instead, through a more conservative approach to managing headcount and disciplined investment decision-making with an even more relentless focus on ROI. We have also been able to realize cost synergies from the SimpleNexus acquisition as the two businesses work more closely together and our integration activities accelerate. On the top line, the fourth quarter has typically been our strongest sales period, and we still have two months left in the fiscal year.\n\nSo, we will wait until our Q4 earnings call to provide specific financial guidance for fiscal '24. However, we think it is important in uncertain times to provide even greater visibility into our current thinking. As we factor in the impact of the three headwinds I mentioned earlier and the overall macro environment, we are currently planning for nCino to be a Rule of 30 company next fiscal year with a mix between total revenue growth and non-GAAP operating income margin trending toward 20% and 10%, respectively. We will accomplish this without changing our investment priorities, which remain making sure we have the right sales coverage for our addressable markets that our support and professional services organizations provide the best customer experience in the industry and that we continue investing in our product portfolio to extend our track record of innovation.\n\nWith that, I'll turn the call over to Josh to go through more business highlights from the quarter. Josh? \n\nJosh Glover -- President and Chief Revenue Officer\n\nThanks, Pierre. The Bank of New Zealand win was certainly a highlight of our continued success in Asia Pac. We're pleased this quarter to also add a new logo in Australia with a government-sponsored lender and an expansion deal within a New Zealand bank for commercial pricing and profitability. The ability of our nIQ products to embed intelligence, insights, and data into the bank operating system is a huge differentiator.\n\nOur nIQ offerings are resonating with our customer base and are now a standard part of prospecting and expansion conversations. Also in the quarter, we signed an expansion deal for a new line of business with a big four U.K. bank, again demonstrating our success in adding value across business lines within our customer base. That customer's initial contract was signed in the first quarter of fiscal '23, so we expanded to a second business line in less than nine months.\n\nWe also closed several solid multiproduct commitments with new customers in the community and regional market this quarter. A few examples include our single platform vision, resonating with a $14 billion bank in Oklahoma as they selected nCino for both commercial and retail lending; and agricultural lenders selecting us for commercial and retail lending, deposit account opening, and treasury sales and onboarding, which will provide a true 360-degree view of their customer relationships; and a $3 billion bank in Virginia, embracing nIQ with their initial nCino contract, selecting us for commercial lending, pricing, and profitability and automated spreading, which will enable their commercial lending employees to compete with the largest financial institutions. We also had significant expansion deals with existing customers in the community and regional market, including a $7 billion Colorado Bank, expanding their use of nCino from commercial lending to add deposit account opening and treasury sales and onboarding, and a $7 billion bank in Hawaii adding retail lending and deposit account opening. Another highlight of the third quarter was our portfolio analytics team signing the biggest deal in the history of that business with the addition of one of the largest trade unions in the world as a loan analytics customer.\n\nAs Pierre mentioned, go-lives are our key measures of success here at nCino, and this quarter marked a record for successful implementations aided by a significant contribution from the portfolio analytics team as the CECL adoption deadline approaches. Our first commercial lending customer in Germany, a business banking customer in Canada, Japanese market early adopters, and a retail lending customer in the U.S. regional market were all beneficiaries of focused efforts from nCino professional services teams and certified system integration partners. As always, I'm deeply appreciative of the trust our customers and partners place in nCino, and I'm proud of the team's commitment, energy, and resolve as we continue to tell the story globally.\n\nDavid, can you take us through the numbers?\n\nDavid Rudow -- Chief Financial Officer\n\nThank you, Josh, and thanks, everyone, for joining us this afternoon to review our third quarter fiscal '23 financial results. Please note that all numbers referenced in my remarks are on a non-GAAP basis, unless otherwise stated. A reconciliation to comparable GAAP metrics can be found in today's earnings release, which is available on our website and as an exhibit to our Form 8-K furnished with the SEC just before this call. We again delivered strong results for the third fiscal quarter.\n\nTotal revenues were $105.3 million, an increase of 50% year over year, including a negative $2.3 million impact from FX. Subscription revenues for the third quarter were $88.3 million, an increase of 55% year over year, representing 84% of total revenues. Organic subscription revenues were $72.9 million, representing 28% year-over-year growth. Professional services revenues were $17 million in the quarter, representing 31% year over year.\n\nProfessional services revenues included approximately $1.5 million of SimpleNexus services and other revenues. Non-U.S. revenues were $15.9 million or 15% of total revenues in the third quarter, up 36% year over year or 55% growth in constant currency. Non-GAAP gross profit for the third quarter of fiscal '23 was $68.6 million, an increase of 54% year over year.\n\nNon-GAAP gross margin was 65% compared to 64% in the third quarter of fiscal '22. Our gross margins again improved due to subscription product mix as enterprise and international customers comprise more of our revenues, as well as the impact from subscription revenues being a larger contributor to total revenues. Non-GAAP operating income for the third quarter of fiscal '23 was $2.5 million with a $3.2 million loss in the third quarter of fiscal '22. Our non-GAAP operating margin for the third quarter was positive 2% compared with negative 4% in the third quarter of fiscal '22.\n\nAs Pierre mentioned, this profitability was achieved through a more conservative approach to managing headcount, particularly in R&D and G&A, as well as savings on insurance and synergies from the SimpleNexus acquisition. Non-GAAP net loss attributable to nCino for the third quarter fiscal '23 was negative $1.4 million or negative $0.01 per share compared to negative $3.7 million or negative $0.04 per share in the third quarter of fiscal '22. Our remaining performance obligation, or RPO, increased to $919.2 million as of October 31, 2022, up 28% over $717.7 million as of October 31, 2021, with $603.9 million in less than 24-month category, up 43% from $420.9 million as of October 31, 2021. New and expansion sales contributed more to the sequential increase in RPO than renewals this quarter.\n\nTurning to cash. We ended the quarter with cash and cash equivalents of $111.8 million, including restricted cash. Net cash used in operating activities was negative $4.1 million compared to negative $19.1 million in the third quarter of fiscal '22. Capital expenditures were $4.6 million in the quarter, resulting in free cash flow of negative $8.7 million for the third quarter of fiscal '23.\n\nDuring the quarter, we drew down approximately $30 million on our line of credit as the fourth quarter is a seasonally slower period for customer collections. In providing Q4 guidance and updating our full year outlook we are taking a few factors into account: first, longer sales cycles, particularly in Europe; second, the state of the mortgage market, including elevated churn in the IMP space in SimpleNexus; and finally, a 2% to 3% negative revenue impact from FX. For the fourth quarter, we expect total revenues of $104 million to $105 million with subscription revenues of $90 million to $91 million. This guidance assumes year-over-year subscription growth of 44% at the midpoint of our range with approximately 28% organic subscription growth for the fourth quarter.\n\nAs a reminder, the fourth quarter is typically seasonally slower for professional services revenues. Non-GAAP operating loss is expected to be approximately negative $3 million to negative $4 million and non-GAAP net loss attributable to nCino per share to be negative $0.04 to negative $0.05. This is based upon a weighted average of approximately 111 million basic shares outstanding. Note that we expect our non-GAAP operating loss in Q4 to be impacted by elevated payroll taxes, professional services fees, and additional investments in marketing, technology, and automation.\n\nFor fiscal '23, we expect total revenues of $403 million to $404 million with subscription revenues of $342 million to $343 million. This full year guidance assumes the year-over-year subscription growth of 52% at the midpoint of our range with approximately 28% organic subscription growth. For SimpleNexus, we now expect full year subscription revenues of approximately $59 million versus the $60 million we previously expected for the year. We are improving our non-GAAP operating loss guidance for fiscal '23 to negative $7 million to negative $8 million.\n\nNon-GAAP net loss attributable to nCino per share is expected to be negative $0.15 to negative $0.17 per share based on a weighted average of approximately 110.5 million shares outstanding. We are proud of the financial milestones we achieved in the third quarter and remain focused on serving our customers and continuing to improve profitability. With that, we will open the line for questions. \n\nOperator\n\nCertainly. [Operator instructions] One moment as we compile our roster. And our first question comes from the line of Terry Tillman from Truist Securities. Your question, please.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nYeah. Thanks for taking my questions. Hi, Pierre, Josh, and David. But a couple of questions.\n\nOne might be a multipart question. So technically, it could almost be three questions. But it's good to see the profitability in the quarter at the operating line -- operating profit line. The first question might be kind of a twofold question – or two-part is, David, on the $603.9 million for the current or 24 months RPO, can you kind of double-click in terms of the organic growth? And then the second part of this question is the SimpleNexus run rate.\n\nHow do you think about that going into next year given the independent mortgage brokers and the headwind there? And then I have a follow-up.\n\nDavid Rudow -- Chief Financial Officer\n\nYep. On the RPO side, organically, nCino grew total RPO by 18% and less than 24 months at 28% and the long term at 4%. And then on SimpleNexus run rate, we took our guidance down for SimpleNexus subscription revenues from $60 million to $59 million. So, we expect to see a slight decline sequentially into Q4 for subscription revenue of SimpleNexus.\n\nI think it's too early to look at next year given what we're seeing in the mortgage market. It's quite volatile right now. And so, we are in the current -- currently in the planning stage, and we will update you on SimpleNexus numbers for next year when we report numbers for Q4.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nUnderstood. And just a follow-up question. I don't know if this is -- or who this is for. But Pierre, really appreciate some of the perspective for next year, and you typically don't guide, but those are some good kind of guardrails for us, I think, the 20% growth in a potentially 10% EBIT margin.\n\nAre any of those kind of run rate dynamics? Or is that actually kind of like that would be like for FY '24? And is it assuming that maybe you just -- the seasonally strong 4Q bookings, it just doesn't play out like you typically would expect? Thank you.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYeah. Thanks, Terry. It's very early, and we're in the planning stages here. We look at SimpleNexus and Europe, and those two combined make up 50% of our SAM.\n\nAnd if half of your market has got serious headwinds and you've got FX on top of that, then you have to look at what that macro environment impact will be. So, 50% of your SAM is impacted, as I mentioned. Our view was we're still in the planning stages. We've not finalized the plans.\n\nThe fourth quarter looks great. Our pipelines are healthy. So, the demand for the product is there. Deals are not going away, but they are just slower to close.\n\nWe don't see a slowdown in the U.S., but we are picking up a sentiment of caution, which is different than Europe, where we clearly see a slower decision-making and just like in mortgage. So, when you take all of that mixed bag and you put it in there, and we decided at this stage it's wise to give an indication to our investors of how we're thinking about next year. But it's early stages in planning.\n\nTerry Tillman -- Truist Securities -- Analyst\n\nUnderstood. Thank you and good luck. Thank you.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. And our next question comes from the line of Brent Bracelin from Piper Sandler. Your question, please. \n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. Despite the challenging macro here, it looks like organic CPR growth actually ticked up this quarter. Your Q4 guide here implies subscription growth organically will remain, I think, for the fourth consecutive quarter in this 28% range.\n\nSo, my question here is what is resonating with the platform with banks at least willing to send money here? Is it cost savings that's primarily still enticing some banks to continue to lean in on the software stack? Just be curious to hear any sort of color commentary on what's resonating just given the consistency that we're seeing in subscription growth and a slight uptick in CRPO.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYeah. First thing, in general, Brent, thanks a lot for your question, the platform approach that we take and digital transformation in general are compelling value propositions. And it's very interesting. The drivers of digital transformation very slightly as you go around the world markets.\n\nAs I mentioned before, when you look at Japan, there's an aging population and the reduction in the workforce. That is a massive issue for that economy. If you come down to Australia and New Zealand, it's more of a modernization, profitability drive. If you go to Europe, it's actually driven by compliance regulations, etc., and visibility into their lending practices, as well as ESG.\n\nWhen you come to the U.S., and its profitability, market share drivers, efficiency, cost reductions, and compliance. So, it varies, and the emphasis is just slightly different in different places. But digital transformation is here to stay. Banks know it's not a decision anymore.\n\nIt's actually an impediment, and then some are leaders, and some are laggards. But that's what we're seeing in the market in general. So, the trend for us for the long-term future is fantastic, and I see it in the pipeline. I just think we have to get through this slight sentiment of uncertainty as we get to the economic turmoil.\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nGreat. And then, David, just a quick follow-up here. As you think about kind of 20% growth next year to 10% EBIT margins to the extent that business maybe starts to pick up, would you look to invest toward the back half of the year in hiring capacity for the following year? Or how are you kind of thinking about the balancing kind of growth and profitability going forward?\n\nDavid Rudow -- Chief Financial Officer\n\nYeah. Our No. 1 priority is growth. We are committed to that Rule of 30 model.\n\nAs we -- because we're just starting planning now, we've got an important Q4 in front of us. So, it's early in the process. But we are looking to make investments as the market improves. So, it's -- if the mortgage market improves, if FX turns, that could change that.\n\nBut for now, we're planning on 20% revenue growth, and that will be 20% subscription, 20% total, and targeting that 10% margin target for the year. \n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nMakes sense and certainly encouraging to see the progress this quarter. Thank you.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. And our next question comes from the line of Brad Sills from Bank of America. Your question, please.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nHi. This is Carly on for Brad. Just want to ask a follow-on on the macro. I guess it's glad to hear the new expansion momentum remains strong.\n\nBut just curious in the U.S., I guess, in particular, what have you been hearing from your conversations with the CIOs on -- with regard to their willingness to take on these, I guess, new digital transformation projects for loan origination for the upcoming quarter and also on the upcoming year 2023?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYes. In the U.S., as I've mentioned, we still see strong demand. We see good pickup. You have to divide the U.S.\n\nin two segments. There's a community regional, which had a little hangover from COVID because they were busy with PPP plus coming back to the office, etc. We see some nice progression on that front, and that market is performing well for us. On the enterprise side, it's more of a lumpy market because it's big deals and they only come so often.\n\nBut if you look at overall the IT spend and the budgets we've heard so far, it looks very positive. However, as I mentioned earlier, there is a slight sentiment of caution creeping in, where people just take a little bit longer to make a decision or scrutinize it a little bit deeper. But we feel very good about the direction of the business. I also firmly believe in times like this that healthy companies with the benefit of being able to show they can be profitable and growing actually can keep our investment levels high on product, as well as our sales and marketing.\n\nAnd as such, we are keeping our coverage of our SAM on a global basis in place. And as soon as these markets turn, nCino will be the brand that is known for their customer service, for the quality of innovation, as well as market coverage. And that's how we plan to proceed.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nYeah. Thank you for that. Very helpful. I guess just a follow-up on the non-U.S.\n\nperformance. I guess it's really positive to see that you guys landed the deal with Bank of New Zealand, and then also the U.K. expansion deal seems impressive. But what are some other, I guess, outperformance in Europe, especially -- just any color that you could provide on the non-U.S.\n\noutperformance? And any other like emerging areas, I guess?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYes. We see Asia Pacific is strong. South Africa is developing a nice market for us. Europe overall is going through a very difficult time.\n\nAs you may know, the energy crisis or price increases there. The war of Ukraine is much of a real thing there. It's not far away from the home front when you talk to the people. So there clearly is a psychological impact.\n\nThere's a level of conservatism creeping in. There's a different regulatory emphasis in Europe, as well as ESG has a bigger role. And so, all of these different factors is putting Europe a bit more in a conservative mode as far as we can see. We have optimized our organization there.\n\nWe maintain the investments to keep the market coverage as we see these deals slowly moving forward. So, we are committed to the continent. And I am pleased we've got marquee brand names there. And as that market loosens up, we will actually expand our footprint.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nYeah. That makes sense. Thank you very much.\n\nOperator\n\nThank you. One moment for our next question. And our next question comes from the line of James Faucette from Morgan Stanley.\n\nMichael Infante -- Morgan Stanley -- Analyst\n\nHey, everyone. It's Michael Infante on for James. Thanks for taking our questions. Appreciate there are a lot of moving pieces here, and you're still a couple of months away in terms of your outlook formulation.\n\nBut how should we sort of think about how conservative the directional commentary you provided on FY '24 was, particularly given it looks like loan growth is expected to decelerate from roughly 12% this year to almost half that next year? I just wanted to sort of pressure-test what you're seeing in terms of the relationship to loan growth broadly.\n\nJosh Glover -- President and Chief Revenue Officer\n\nI can speak to that. This is Josh. Look, in most of the commercial accounts that we serve, new credit is actually not the majority of the volume that they do within the commercial bank. Most of the banks that we serve would see 50% to 75% of their loan volume would actually be renewals and modifications.\n\nAnd they also have to monitor that portfolio. Monitoring it is even more important with the challenging economic environment. Because at the end of the day, regardless of the environment, these banks are trying to do their best to balance risk and reward while growing as much as they can. So even if growth does slow, they're going to want to run their banks efficiently.\n\nThey're going to want to minimize risk where they can and have transparency into their portfolios, and they're going to want to upsize their reward as much as possible. So, our nIQ offerings, pricing, and profitability, our auto spreading offering obviously add a lot of value to those renewals and modifications and monitoring activities. Our portfolio analytics tool also helps the visibility in the portfolio. So, we're confident in the value that we'll provide even if loan volume does compress.\n\nDoes that answer your question?\n\nMichael Infante -- Morgan Stanley -- Analyst\n\nYeah. That's great. Thanks, Josh. Maybe just one other one on SimpleNexus.\n\nI think it's pretty impressive the sequential growth we're seeing there just given all the data points that we're observing in the mortgage market sort of speak to the resilience of the model you guys have talked about previously. I just wanted to quickly hit on the composition of contract duration there. Is there any particular skew we should be aware of between one, two, and three years? And then as a follow-up to that, you previously talked about elevated SimpleNexus churn in the back half. I was just curious how renewal discussions have been faring for SimpleNexus in this environment.\n\nDavid Rudow -- Chief Financial Officer\n\nYeah. What we see on SimpleNexus side, the contract duration, that really hasn't changed much. We see one to two years, kind of averages about one and a half years. That's not really changed.\n\nWe are seeing a higher level of churn, though, in the business on the IMB side. I mean it's a little more volatile market for us. The refis happened. They corrected their cost structures.\n\nNow the originators are correcting their cost structures. So, we would assume that churn will remain elevated for some time.\n\nMichael Infante -- Morgan Stanley -- Analyst\n\nGot it. Thanks, David.\n\nOperator\n\nThank you. One moment for our next question. And our next question comes from the line of Alex Sklar from Raymond James. Your question, please.\n\nAlex Sklar -- Raymond James -- Analyst\n\nGreat. David, some nice opex leverage in the model again this quarter. As you're thinking about that 10% margin outlook for next year, how should we think about overall hiring plans? Do you think you can achieve kind of that level just through revenue growth and some mix improvements? Or is there any kind of reevaluation on the hiring side?\n\nDavid Rudow -- Chief Financial Officer\n\nYeah. We're still early in the planning process, as we said earlier. We're looking at all costs. It's not just headcount.\n\nWe're looking at non-head count-related costs as well. We've done a nice job this year by moderating spending and headcount adds for the year to come down to the level that we're at. We will be looking to gain more efficiencies next year though, too.\n\nAlex Sklar -- Raymond James -- Analyst\n\nOK. Great. And then, Pierre, Josh, just in terms of overall deal sizes, I know you've been talking about some of the larger digital transformation-type deals that are in the pipeline. I think Bank of New Zealand one, it's a nice one that just closed.\n\nHow should we think about kind of the overall appetite, though, particularly in the U.S. for some of those larger digital transformation versus kind of smaller, quicker ones?\n\nJosh Glover -- President and Chief Revenue Officer\n\nEach of our segments are deal sizes are in line with where they've been. As Pierre commented earlier about just the timing in the market, it's less of a size impact than it is on a sales cycle duration impact from our perspective.\n\nAlex Sklar -- Raymond James -- Analyst\n\nOK. Great. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Bob Napoli from William Blair. Your question, please.\n\nAdib Choudhury -- William Blair -- Analyst\n\nHey, good evening, guys. This is Adib Choudhury on for Bob. Our first question was around gross margin. Could you kind of remind us and speak to your confidence of tracking toward your 70% gross margin target over time, some of the drivers that we might see some margin expansion from? I think in the past, you've talked about international as being accretive to margins but -- that would be helpful.\n\nDavid Rudow -- Chief Financial Officer\n\nYes. We are still kind of a long-term model at 70%. We do have a product mix benefit as we sell less to the community regional space. We have higher margin on that business because we can bundle the Salesforce suite into that.\n\nAlso, as we expand our nIQ product offering that's on AWS, and that comes at a much higher gross margin. We will see efficiencies in support. We made a lot of investments on the support side. And then on the professional services side, we would expect to see margins continue to improve as we look out over the next couple of years as well. \n\nAdib Choudhury -- William Blair -- Analyst\n\nGreat. Thank you. And just for the follow-up, can you kind of give an update on some of the competitive dynamics in retail? I guess since the last quarter, if they've changed at all meaningfully, as well as any update on cross-sell of retail with commercial clients? Thanks.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nOur retail count is up 30% year over year. The competitive landscape hasn't really changed there. It's a rip-and-replace market. We're making good progress.\n\nI believe our platform story is superior, and people like that. It's a client-centric approach to banking. So, we are on track there and meeting and beating our expectations. Deposit account opening is up 25% year over year.\n\nSo that whole client-centric platform story is playing well with us. We are finding our small business offerings to include a retail-like experience as well at the low end of small business. And all of those road maps, as people see what we are doing and how we are client-focused helping the bank to actually get there and continue to invest in innovation, I think that innovation mindset is playing out in the market and is making us the preferred vendor. So, I feel good about those new products.\n\nJosh Glover -- President and Chief Revenue Officer\n\nAlso, we spoke about it in the prepared comments, but the validation points of the single-platform deals, multiple community regional accounts, those are really nice accounts that came on board with our known commercial solution. But they also rolled in retail because they want to be able to connect with their customers, take care of them really well across multiple products. From our perspective, that's a good validation point.\n\nAdib Choudhury -- William Blair -- Analyst\n\nUnderstood. Thanks very much.\n\nOperator\n\nThank you. [Operator instructions] And our next question comes from the line of Jason Adler from Adler -- pardon me, from MoffettNathanson SVB. Your question, please.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nAll right. Thanks. Hey, guys. Thanks for taking the question.\n\nThe first one is on the pipeline. So, you're kind of seeing customers maybe -- I understand it takes a little bit longer to sign the deals. But do you expect -- when the pipeline starts to build and there's a little bit of a backup or a backlog in there, have you seen customers in the past be anticipatory on the other side? When things start to look a little bit better, do they go ahead and does the sales cycle start to actually contract? Or are these just conservative banks, and they wait for the coast to be absolutely clear before they start resuming normal transactions again?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nI would say -- remember, we started the company in 2012. And so, we've been on a quite a phenomenal economic run from '12 to '22 in an interest rate environment that was very low with a roaring economy. In a previous life, I have experience going through '08, '09, '10, '11, '12, selling to banks, etc. And what you'll find is initially, there will be a pause to get a full understanding of the market landscape.\n\nAnd then very quickly, the ones who stop investing realize they're going to fall behind, and then it comes back, OK? I've seen this in the financial crisis. I expect the same thing to happen right now. And people regret when they start putting these investments on hold because there are competitors. People talk a lot about competition to banking coming from the outside banks.\n\nAnd I remind bankers all the time, they've got a massive benefit over any other industry coming in there because of the cost of funding, which they have to achieve deposits. And so, your biggest competition in banking is another bank. And if the other bank in your town or your city is innovating and driving innovation through technology, then you better keep up. So, I believe this is a short-term pause year or a slowdown or a caution, which is normal, but it always comes back.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nOK. All right. Great. Thank you.\n\nAnd then just on the segment outlook for next year, what kind of mortgage banker or loan origination officer headcount growth is baked into that Rule of 30? Do you expect things to get worse, better, stay the same?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYeah. We're at very early stages of planning. As you can imagine, we're in beginning December, January. We're going to see how that market evolves over the next few months.\n\nAnd we cannot comment yet what's going to happen to that mortgage market. You see how the market reacts just based on Colin Powell's comments today. So, we have to see how they develop before we finalize our plans.\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nOK. All right. That's fair. Thank you.\n\nOperator\n\nThank you. One moment for our next question. And our next question comes from the line of Nick Altmann from Scotiabank. Your question, please.\n\nNick Altmann -- Scotiabank -- Analyst\n\nGreat. Thanks, guys. I just wanted to ask a question about the margins next year. Over the past couple of quarters, you guys have made comments around how the core nCino business is profitable today, and investments in the SimpleNexus were really the drag on margins.\n\nSo, I guess with that 10% target for next year in mind, is there any way to sort of parse out the margin profile between core nCino versus SimpleNexus?\n\nDavid Rudow -- Chief Financial Officer\n\nFor next year, the 10%, we're going to look at the business as a whole. And we'll make decisions as a company as a whole, not by segments. SimpleNexus is going to lose money this year, and nCino is profitable legacy business. If you take it like the next layer, I think SimpleNexus would have to get breakeven.\n\nI think we were greatly positioned there. We have the No. 1 product in the space. The mortgage market will return.\n\nSo, we don't want to leave the market or any opportunity for the competition to catch up with us. So, the idea is to maintain investments as we can and look as we start seeing the market return to normal, invest more money and just be better positioned coming out of this.\n\nNick Altmann -- Scotiabank -- Analyst\n\nGreat. And then just maybe one for Josh. Just given the challenging demand environment, how are you sort of thinking about making go-to-market tweaks heading to next year? Or are there maybe plans in place to shift sales resources into the upsell side given that new customer side of the equation might be a little bit more difficult or maybe kind of focus on smaller, higher-velocity deals with shorter sales cycles? Just any commentary around go-to-market tweaks maybe that you're planning for heading into next year given the macro backdrop would be really interesting. Thanks.\n\nJosh Glover -- President and Chief Revenue Officer\n\nAbsolutely. And I would say, I'll start with international. If you look at the proof points that we hit earlier, great wins in New Zealand, go-lives in Japan and Germany, expansion within London, and go-live in Canada. We are committed to the countries that we're in.\n\nSo, we're going to make sure we're there to help those customers succeed and continue to -- continue running at the opportunity in those markets. Within the U.S., we don't do hunter/farmer. From our perspective, it makes sense to have one account executive that covers the account for the long run, sets us up for better expansion and longer-term relationships. So, we don't intend to do any major changes there.\n\nWe're going to play the long game with those accounts and ensure that just as they're going to want to come out of the other side of any headwinds stronger, we'll be there with them.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYeah. I would like to emphasize that even as we're going into a profitable growth company, our posture will always be to favor growth. We believe market share gains is important for our long-term health, as well as long-term profitability.\n\nJosh Glover -- President and Chief Revenue Officer\n\nWhen you look at our footprint in these strategic accounts, 23 of the top 50, a lot of those were conversations that have played out over time, and we're going to make sure we're there for them.\n\nNick Altmann -- Scotiabank -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. One moment for our next question. And our next question comes from the line of Josh Beck from KeyBanc. Your question, please.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nThank you, team, for taking the question. I wanted to just ask a little bit higher level about the visibility that you have going into the next fiscal year. Obviously, you benefit from multiyear, time-based milestone types of contracts. So, I feel like, in general, that gives you pretty good visibility.\n\nHowever, the macro is very fluid. You certainly talked about European sales cycle, churn and SimpleNexus and FX. So, I guess my question is like as we go through Q4, what are going to be some of the really key items? Is it U.S. sales cycles? Is it what happens with mortgage rates? What are going to be some of the key items that you're tracking to kind of maybe get a little more precision about how fiscal Q4 could play out?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nI would say -- firstly, we're in the planning stages. And as you can imagine, we track all these various factors literally on a daily and a weekly basis. But the U.S. keep on performing.\n\nI would say, I would love to see FX stabilize and improve in our favor. That will be a great little bonus. Secondly, if we get any indication that mortgage rates just top out and start coming down, you're going to see refi volumes go back up, and you're going to see people get like a new lease on life in the mortgage business. And that will just rip that market open, OK? And then realizes those companies who then is going to expand by using tools like SimpleNexus will actually buy from stable financial companies that's profitable and has proven that they do their development and their work in the U.S.\n\nAnd then finally, I think the European story is a bit longer term. We've got some great customers there and great prospects. But I would say that is the third one that probably could be on the upside as that environment improves, but I can't see around corners.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nOK. That's very helpful. And then just in terms of maybe how banks are approaching at least the next calendar year for them. Obviously, things like unemployment, things like credit losses have all been pretty actually encouraging thus far this calendar year.\n\nWe heard from Credit Karma yesterday that banks, to some degree, it may be the lower end of the market kind of near prime and below, are starting to be a little more conservative with respect to their marketing budgets, which are obviously very discretionary. So, when they are maybe trying to be prepared, let's say, from whatever the scenarios are next year, where would you rank the priority around modernizing certainly some of their loan and deposit account systems, maybe versus other investment initiatives at some of the banks?\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nAs I mentioned earlier, digital transformation is an imperative long term. And most banks that we talk to do not ask us why we justify to do it anymore. They just want to know how to get there because it is difficult to take out all the systems, change processes, etc. So, I would say that the demand will be there.\n\nThe question is whether they prioritize it. I would also tell you that, whether we like it or not, the way to get inflation under control is at some point to get the labor market under control. And that will impact the consumer, which will impact consumer credit. And we -- I need to wait and see because the banks we talk to will all tell you that they are well-capitalized and that their credit risk is in good place so it must be somebody else, which is, of course, interesting somewhere, somebody is going to pay the price.\n\nWe see some caution, like I mentioned, a cautious sentiment, but I don't see in the U.S. necessarily a slowdown yet. \n\nJosh Glover -- President and Chief Revenue Officer\n\nAnd we just don't see a lot of banks telling us today that they want a more manual process or that they want less digital engagements with their customers. So, the long-run opportunity is still there.\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nVery helpful. Thanks, team.\n\nOperator\n\nThank you. One moment for our next question. [Operator instructions] Our next question comes from the line of Saket Kalia from Barclays. Your question, please.\n\nSaket Kalia -- Barclays -- Analyst\n\nHey, guys. Thanks for taking my questions here and fitting me in. Pierre, maybe for you, great to see the Bank of New Zealand win. I'm wondering, as you've made more headway internationally, are you starting to see any of the changes? Are you starting to see any changes in the sales cycles and competitiveness of those deals? I guess I'm just curious because you've had multiple wins now in numerous international markets.\n\nSo, I wonder if it's just getting easier and maybe what type of competition you're seeing?\n\nJosh Glover -- President and Chief Revenue Officer\n\nHey, Saket, this is Josh. Yeah, we see lots of banks that want to be early but very few that are willing to be first. So, getting that first press release out, getting that first go-live helps us go to that market with the story based on banks that look and feel a lot like our prospect being live and enjoying nCino. So, it absolutely helps.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nYeah. And if you look at -- these are critical-mass countries, OK? If you look at New Zealand now, it's got critical mass, and then the deals come. If you look at Canada, you won one, two, three and then boom, we've got the majority of the banks, OK? And the difference between the U.S. and international is I have to win each of those countries because it only in country is referenceable.\n\nAustralia and New Zealand may be slightly an exception, but the Germans want to see that other German banks are successful. We've got a great example, but now we have to get that market to accelerate. But the markets where we had that critical mass like New Zealand and Canada, absolutely. South Africa is coming around.\n\nWe've got two, three customers there now. The U.K. is like that. But we would still like to see France, Spain, Germany, etc. \n\nSaket Kalia -- Barclays -- Analyst\n\nGot it. That makes sense. David, maybe for you for my follow-up. Can you just talk about the health of underlying bookings in the quarter? I mean, clearly, the visibility on revenue is super high.\n\nYou gave a helpful framework for how to think about revenue growth for next year. But I'm curious, how are the leading indicators looking now qualitatively, of course, for just revenue growth drivers in the future? Does it make sense?\n\nDavid Rudow -- Chief Financial Officer\n\nThat does. And we do not disclose bookings, but I can talk about sales activity. So, sales activity in the quarter, despite Europe being slow, we had some FX impact and SimpleNexus. It was pretty much in line with our expectations.\n\nAnd we talked about this earlier about the year. We returned to a more normal cycle in terms of sales for the year, where the second half is higher-weighted than we saw over the last couple of years during COVID. So, Q4 this year will be our biggest quarter of the year. But activity in the third quarter was pretty much in line with our expectations.\n\nSaket Kalia -- Barclays -- Analyst\n\nVery helpful. Thanks, guys.\n\nOperator\n\nThank you. Our next question – just one moment for our final question for today. And our final question for today comes in the line of Charles Nabhan from Stephens. Your question, please.\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nGreat. Good afternoon, and thank you for fitting me in. So, my question is on the impact of the elongated sales cycles and the delays in decision-making on your existing customer base. So, I would imagine it's more pronounced on potentially new deals, but land and expand has been really the centerpiece of your strategy.\n\nSo, I'm curious in terms of what you're seeing within your existing customer base in terms of a reluctance or an acceptance to expand existing relationships. And I guess, sort of as a follow-up to that to put a finer point on it, I'm curious what that could potentially mean for net retention levels and ACV expansion going forward.\n\nJosh Glover -- President and Chief Revenue Officer\n\nAbsolutely. And we do value those customer relationships and we're -- in the nCino journey, we have seen headwinds. We find that those customer conversations are the easiest to keep going. So, we continue to see ongoing success and proof points of our ability to cross-sell these solutions.\n\nWe talked about adding retail and DAO into a $7 billion bank in Hawaii. We added CPP into a New Zealand enterprise account, this one we're particularly proud of. That was a competitive deal and a fantastic account. We're also seeing, despite everything we discussed a good validation of SimpleNexus value in the bank market, right? Five cross-sales into nCino banks and credit unions.\n\nAnd frankly, those are our larger deals that we would sell into IMBs. So, we feel that is something that we'll continue to focus on. And we always aspire, because we deliver for our accounts, to be continuing those conversations from a position of success and partnership.\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nGot it. And just as a quick follow-up, and I apologize if I missed this somewhere. But can you talk about LBA where and the impact or contribution that had to SimpleNexus, as well as what you're seeing in that business in terms of traction?\n\nDavid Rudow -- Chief Financial Officer\n\nYeah. I mean we've had some cross-sales into the base of nCino, but we don't have any more details. We're going to break down details because that really is integrated into the SimpleNexus platform now. And so, that's all the detail we can give.\n\nAnd we also see that as a real differentiator for them. You look at six competitive takeaways. You look at the logos that they're adding, even this challenged marketing is because of that fantastic package, not just a POS but the full home buying journey and integrated tools like LBA where it helped them differentiate.\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nThank you. This does conclude the question-and-answer session of today's program. I'd like to hand the program back to Pierre Naude for any further remarks.\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nThank you. And thank you, everyone, for attending today. Thank you for your support, and we appreciate you attending today. You have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHarrison Masters -- Investor Relations\n\nPierre Naude -- Chairman and Chief Executive Officer\n\nJosh Glover -- President and Chief Revenue Officer\n\nDavid Rudow -- Chief Financial Officer\n\nTerry Tillman -- Truist Securities -- Analyst\n\nBrent Bracelin -- Piper Sandler -- Analyst\n\nUnknown speaker -- Bank of America Merrill Lynch -- Analyst\n\nMichael Infante -- Morgan Stanley -- Analyst\n\nAlex Sklar -- Raymond James -- Analyst\n\nAdib Choudhury -- William Blair -- Analyst\n\nNick Altmann -- Scotiabank -- Analyst\n\nJosh Beck -- KeyBanc Capital Markets -- Analyst\n\nSaket Kalia -- Barclays -- Analyst\n\nCharles Nabhan -- Stephens Inc. -- Analyst\n\nMore NCNO analysis\n\nAll earnings call transcripts"
}