{
  "companyName": "Traeger, Inc.",
  "companyTicker": "COOK",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/traeger-inc-cook-q3-2022-earnings-call-transcript/",
  "content": "Traeger, Inc. (COOK -0.35%)\nQ3 2022 Earnings Call\nNov 09, 2022, 4:30 p.m. ET\n\nOperator\n\nHello, and welcome to today's Traeger third quarter fiscal 2022 earnings conference call. My name is Bailey, and I'll be your moderator for today's call. [Operator instructions] I would now like to pass the conference over to our host, Nick Bacchus, vice president of investor relations. Please go ahead.\n\nNick Bacchus -- Vice President, Investor Relations\n\nGood afternoon, everyone. Thank you for joining Traeger's call to discuss its third quarter 2022 results, which were released this afternoon and can be found on our website at investors.traeger.com. I'm Nick Bacchus, vice president of investor relations at Traeger. With me on the call today are Jeremy Andrus, our chief executive officer; and Dom Blosil, our chief financial officer.\n\nBefore I get started, I want to remind everyone that management's remarks on this call may contain forward-looking statements that are based on current expectations but are subject to substantial risks and uncertainties that could cause actual results to differ materially from those expressed or implied herein. We encourage you to review our annual report on Form 10-K for the year ended December 31, 2021 and our quarterly report on Form 10-Q for the quarter ended September 30, 2022 once filed and our other SEC filings for a discussion of these factors and uncertainties which are also available on the investor relations portion of our website. You should not take undue reliance on these forward-looking statements. We speak only as of today, and we undertake no obligation to update or revise them for any new information.\n\nThis call will also contain certain non-GAAP financial measures, which we believe are useful supplemental measures. The most comparable GAAP financial measures and reconciliations of the GAAP measures contained herein to such GAAP measures are included in our earnings release, which is available on the investor relations portion of our website at investors.traeger.com. Now, I'd like to turn the call over to Jeremy Andrus, chief executive officer of Traeger. Jeremy?\n\nJeremy Andrus -- Chief Executive Officer\n\nThank you, Nick. Thank you for joining our third quarter earnings call. Today, I will discuss our third quarter results, our near-term strategic priorities and our progress on our key growth pillars. I will then turn the call over to Dom to discuss details on our quarterly financial performance and to provide an update on our fiscal 2022 guidance.\n\nAs we anticipated, third quarter was a highly challenging period. After two years of record growth in 2020 and 2021, the grill industry is contracting in 2022. Consumers are shifting expenditures toward services and leisure, away from discretionary big-ticket goods and decades high inflation and ongoing geopolitical uncertainty are negatively impacting sentiment. Moreover, retailers are increasingly cautious in their ordering behavior given heightened levels of channel inventories, as well as the risk of a recessionary slowdown.\n\nThese factors drove a 42% decline in our third quarter sales, with particular softness in our grill sales, which were down 64% versus last year. Despite these challenges, we are making progress on our near-term priorities as we navigate the current environment. We believe that our ongoing efforts to rationalize inventory, reduce costs and to bolster our balance sheet and liquidity profile will allow Traeger to navigate the current operating environment and position the company for strong improvement the macroeconomic pressures subside. Having said that, we acknowledge at the pace at which we can drive certain of these improvements will be influenced by the broader economic environment, which remains highly volatile.\n\nThe third quarter largely played out as we anticipated. Sell-through of our grills in retail was lower than last year, but consumer demand was roughly in line with our forecast coming into the quarter. While demand was lower than 2021, the year-over-year decline in sell-through during the quarter moderated from the declines we experienced in the first half of the year and grew a strong three-year CAGR. We continue to view near-term sell-through trends as challenging.\n\nHowever, we are seeing a modestly higher level of predictability in terms of consumer demand relative to earlier in the year. Sell-through in the quarter benefited from our strategy to drive incremental consumer demand with strategic promotions. The consumer responded favorably to promotional discounts with both our Summer and Labor Day promotions driving healthy consumer demand, allowing our retail partners to further work through on-hand inventory. Despite sell-through trends that were in line with our projections in Q3, excess inventories across both the grill category and other product categories, as well as cautious sentiment around the consumer and the macroeconomic environment are causing our retail partners to be highly conservative in their ordering behavior.\n\nThis is impacting our fourth quarter and we now expect our full year results to come in at or slightly below the low end of our prior guidance at $635 million to $640 million in sales and $33 million to $35 million in EBITDA. It is important to understand the magnitude of retailer destocking, which is the largest driver of the decline in our grill sales in the second half of 2022. We believe that more than two third of the anticipated decline in grill sales in the second half of the year can be attributed to retailer destocking as opposed to lower levels of consumer demand. Despite this near-term rebalancing of supply and demand, we do not believe retailers are retrenching from the growth category or from Traeger.\n\nThe outdoor cooking category is resilient and historically has experienced fairly predictable growth. We believe our retail partners remain committed to outdoor cooking and in particular to our brand as we are long-term caretakers and drive premiumization of the grill category. The trade organization is committed to ensuring that the company is positioned for long-term profitable growth. At the same time, we are keenly aware of the near-term challenges that face our industry, as well as the overall economy and therefore, our focus on executing our key tactical priorities.\n\nThese near-term priorities will preserve profitability in cash flow while also create a healthier marketplace. Specifically, as we discussed last quarter, our key near-term priorities are reducing our cost structure, rightsizing inventories and driving improvement in gross margin. In July, we implemented a restructuring plan in an effort to both drive operational efficiencies and to streamline organizational focus on our highest return initiatives. These actions include the closure of Traeger provisions, as well as a reduction in force.\n\nWe realize meaningful savings from these actions in the third quarter and are reiterating our target of run rate annualized savings of $20 million. We are aggressively managing our expenses and we'll continue to stay highly disciplined as we move into 2023. Additionally, we have also taken steps to reduce our near-term outlook for capital expenditures as we look to enhance cash flow and liquidity. Our next near-term priority is rightsizing inventories, which remain elevated, both in-channel and on our balance sheet.\n\nIn terms of in-channel inventory in the third quarter, we strategically increased our promotional cadence, adding two promotional periods with a focus on discounts SKUs with excess channel inventory. In terms of inventory on our balance sheet, we have materially lowered production in Asia to give us the opportunity to work through our on-hand inventory. These actions, combined with our retailers destocking efforts, resulted in some progress on our inventories. However, this remains an ongoing effort which we expect to continue into the first half of 2023.\n\nOur next strategic priorities to drive gross margins. Recapturing gross margin is a key focus across the organization. Our gross margin task force continued to work to identify and execute on cost savings across the supply chain. Notably, the team's efforts have led to expected improvements in product, packaging and transportation costs in 2023 across our grill assortment, as well as additional cost savings associated with lower pellet and packing costs in our pellet business.\n\nWe're also seeing substantial reductions in certain input costs, including inbound freight rates and commodities like steel. We are optimistic that our cost savings efforts and lower input costs should be margin tailwinds in 2023. However, it is important to note that we do not expect to see a material impact flowing through our income statement until we've worked through our higher cost inventory in mid-2023. Moreover, we expect we will look to strategically and selectively reinvest some of these input cost improvements back into product and into pricing as we move into 2023.\n\nOur tactical priorities are of critical importance. However, we remain committed to our long-term strategic growth pillars. Let me discuss the progress we've made in each of these areas. Driving awareness of the Trager brand remains our largest long-term growth opportunity at 3.5% household penetration across the U.S.\n\nand mid-teens penetration in our most mature markets. We believe there is substantial upside to be realized in driving brand awareness. It is a testament to the momentum of our brand that we continue to make strong inroads in driving awareness despite a highly challenging market backdrop and lower top-of-funnel marketing investment capacity. In fact, our unaided brand awareness hit an all-time high in the third quarter, improving by 15% versus the beginning of this year and up 50% versus two years ago.\n\nThe continued growth and awareness of the Traeger brand in one of the most difficult periods in drilling history speaks to the energy behind the brand and the strong connection we have with our user base. Our grill owners are passionate about Traeger and act as evangelist organically driving brand recognition. This is evident when we look at our social media KPIs in the third quarter with our user-generated content post up nearly 50% and video views more than tripling year over year across social platforms. We also continue to drive awareness of the Traeger brand to enhance merchandising and product presentation in retail.\n\nIn September, we rolled out a new merchandising treatment called Flex Wall across 871 Home Depot doors. Flex Wall is a Traeger branded in-bay backing that allows for branding, shelving and hanging space for our products and is featured in Home Depot doors with premium Traeger merchandising. Additionally, we added 314 Traeger islands at Home Depot doors in the third quarter. These new merchandising enhancement further add to Traeger's visibility on Home Depot floors.\n\nNow, on to product innovation, our next growth pillar. In the third quarter, we had significant innovation on the consumables side. In late September, Trager partnered with WhistlePig to collaborate on new products at the intersection of smoke and whiskey. WhistlePig Whiskey is one of the most awarded craft distilleries in the U.S.\n\nAnd so, we are thrilled to launch our whiskey barrel pellet brand, Whiskey Hog barbecue sauce and Whiskey Dust Rub in collaboration with WhistlePig. DTC orders have had good momentum and the launch has picked up positive PR in Men's Journal, burn blog and food side. In terms of grill innovation, we are extremely excited about the new product pipeline as we move into 2023. We expect to launch two new grills next year, both of which are planned to be on retail floors in the first quarter.\n\nWe have shown these new grills to some of our key retail partners, and the early response has been fantastic. It is too early to discuss these new products. However, we will be able to provide more details when we report fourth quarter in March next year. Suffice it to say, we expect Traeger to continue to deliver game-changing innovation in 2023 and beyond.\n\nOur next growth pillar is in driving recurring revenues. While our consumables business was down versus prior year in the third quarter, sell-through pellets was slightly below prior year and in line with 2020 levels. As we look at connected cook data, the number of cooks continues to increase strongly as we grow our installed base of grills. In fact, there were over 1 million more cooks in the third quarter versus prior year and almost 3 million more cooks versus the third quarter in 2020.\n\nThis gives us confidence in the long-term recurring revenue nature of the consumables business. In the third quarter, we continue to expand our pellet offering with the introduction of 30-pound value-sized bags. Furthermore, we continue to expand distribution of pellets into the grocery channel and remain on track to gain 600 additional grocery doors for the year as we sell into grocers like Meyer, Giant Eagle, Harris Teeter and Albertsons. Our fourth growth pillar is to expand the Traeger brand globally.\n\nSimilar to the U.S., our international markets faced challenges in the third quarter as geopolitical turmoil inflation negatively impacted consumer sentiment. Despite these near-term challenges, we continue to see evidence that the Traeger brand has meaningful upside outside of our core U.S. market. For example, we are seeing Traeger success with the Home Depot in the U.S.\n\ntranslate to the Canadian market as well. The Home Depot Canada has leaned into the wood pellet drilling category, allowing Traeger to increase sell-through by strong double digits in the third quarter. Contributing to increased sell-through was an increase in the assortment and floor space of Traeger products and marketing investments behind the brand. In summary, we are highly focused on executing upon our near-term strategic priorities as we navigate the current environment while remaining committed to our key long-term growth pillars.\n\nAs a disruptor in outdoor cooking, we are positioned extremely well for long-term success and I remain highly confident in the growth thesis for Traeger. In the near term, we will focus on the variables that are within our control, and we remain agile given the volatile environment. With that, I'd like to turn the call over to Dom. Dom?\n\nDom Blosil -- Chief Financial Officer\n\nThanks, Jeremy, and good afternoon, everyone. Today, I will review our third quarter performance before providing an update on our outlook for fiscal year 2022. I will also discuss some initial thoughts on 2023. Second quarter revenues declined 42% to $94 million.\n\nGrill revenue declined 64% to $30 million, impacted by materially lower unit volumes as our retail partners aggressively reduced replenishment orders in an effort to lower end channel inventories, partially offset by higher average selling prices related to price increases taken in the second half of 2021 in the first quarter of 2022. Consumables revenue decreased 10% to $25 million due to lower sales of pellets as retailers reduced on-hand inventories, offset by higher sales of rubs and sauces, which benefited from increased distribution. Accessories revenue increased 18% to $30 million, driven by strong growth at MEATER, offset by lower sales of Traeger branded accessories. Geographically, North American revenue was pressured by the aforementioned challenges in our U.S.\n\nbusiness along with negative growth in Canada. Our rest of world business grew 10%, driven by growth in MEATER revenues in international markets. Gross profit for the second quarter decreased to $26 million from $54 million last year. Gross profit margin was 27.7%, down 580 basis points to last year.\n\nExcluding $1.6 million of onetime costs related to restructuring actions, gross margin was 29.4%. The decline in gross margin was driven by: one, higher logistics costs due to decreased leverage and increased outbound freight costs, which resulted in 400 basis points of margin pressure; two, accrued discounts related to promotional activity, which resulted in 240 basis points of margin pressure; three, onetime costs related to restructuring activities in the third quarter which resulted in 170 basis points of margin compression; four, higher drill costs and mix impact of 140 basis points; and five, the net impact of provisions inventory liquidation, which impacted margins by 90 basis points. These pressures were offset by 440 basis points of favorability driven by our pricing actions. Sales and marketing expenses were $25 million compared to $49 million in the third quarter last year.\n\nThe decrease was driven primarily by lower stock-based compensation and a reduction in top of funnel marketing and lower professional fees. Third quarter sales and marketing expense benefited from restructuring and cost savings actions taken in the third quarter in response to the lower revenue run rate. General and administrative expenses were $71 million compared to $76 million in the third quarter of last year. The decrease in general and administrative expense was driven primarily by lower professional fees and performance compensation expense, offset by higher stock-based compensation expense, largely due to the expense related to the accelerated investing of the CEO RSUs and PSUs.\n\nExcluding stock-based compensation, general and administrative expense was down $11 million versus prior year. In the third quarter, we recorded a $110 million noncash impairment charge to our goodwill related to the adverse impacts of macroeconomic conditions. Please note this amount is an estimate and will be finalized prior to filing our third quarter 10-Q. As a result of these factors, net loss for the third quarter was $210 million as compared to a net loss of $89 million in the third quarter last year.\n\nNet loss per diluted share was $1.75 compared to a loss of $0.78 in the third quarter of last year. Adjusted net loss for the quarter was $26 million or $0.21 per diluted share as compared to adjusted net income of $7 million or $0.06 per diluted share in the same period last year. Adjusted EBITDA was a loss of $12.5 million in the third quarter as compared to adjusted EBITDA of $4.1 million in the same period last year. Now, turning to the balance sheet.\n\nAt the end of the third quarter, cash and cash equivalents totaled $8 million compared to $17 million at the end of the previous fiscal year. We ended the quarter with $392 million of long-term debt. Additionally, as of the end of the quarter, the company had drawn down $13 million under its receivables financing agreement and $47 million on its revolving credit facility, resulting in total net debt of $444 million and a net leverage ratio of 8.9%. From a liquidity perspective, we ended the third quarter with total liquidity of $86 million.\n\nInventory at the end of the third quarter was $162 million compared to $115 million at the end of the third quarter last year. Three factors contributed to the increase in inventory versus prior year. First, the landed cost of the grills increased versus prior year, driven by higher inbound freight and other input costs. Second, grill units in inventory remained elevated given lower-than-anticipated sales in 2022.\n\nFinally, MEATER accounted for approximately $5 million of the increase, with this level of growth aligned with its strong top line momentum versus last year. As Jeremy discussed, we are actively working to optimize our on-hand inventory, and we have materially reduced production to better align supply with the reduced demand forecast. With respect to channel inventories, we continue to be highly focused on rightsizing excess supply and channel in collaboration with our retail partners. During the quarter, sell-through of grills remained negative to last year.\n\nHowever, the decline moderated relative to the first half of the year. This improvement was partially driven by the addition of two promotions, which resulted in stronger sell-through and allowed our retail partners to accelerate the reduction of their existing inventories. While the improvement in sell-through combined with the retailer destocking efforts drove a sequential reduction in inventory weeks of supply, channel inventories remain elevated, and we expect retailer destocking to continue into the first half of next year. Turning to our outlook for full year 2022.\n\nWe now anticipate full year sales of $635 million to $640 million and EBITDA of $33 million to $35 million. Our updated takes no account anticipated pressure on fourth quarter sales, driven by retailers destocking actions, which will negatively impact both grill and consumable sales in the quarter, offset by expected strength in our MEATER business. Furthermore, we are also expecting pressure on our pellets business as a large customer introduces a private label pellet offering. Excluding this customer, our pellet business is healthy, and we are expecting pellet sell-through to be flat to up to last year in the fourth quarter.\n\nShifting to gross margin. We continue to forecast full year gross margin of approximately 35% when adjusting for the $1.6 million of onetime restructuring costs we incurred in the third quarter. We expect that fourth quarter sales and marketing and general and administrative expenses will benefit from the cost reduction efforts, and we reiterate our target of $20 million in run rate annualized savings. Last, while it is too early to discuss specific guidance for 2023, I'd like to provide some initial high-level thoughts as we look forward to and plan for next year.\n\nWe believe that retailer destocking will continue to pressure our sell-in during the first half of 2023 as channel inventories remain elevated and retailer sentiment is cautious. As we exit our peak selling season in Q2 and move into the second half of 2023, we believe inventory and replenishment dynamics should be more normalized and further, we will be lapping the large destocking that occurred in the second half of 2022. The pace at which inventory dynamics normalize will be governed by consumer demand. Given the wide range of outcomes in terms of inflation, GDP growth and employment next year, we will remain nimble and we will plan our business prudently.\n\nFor gross margin, we are expecting a more favorable cost backdrop in 2023 as we are seeing tailwinds in input costs, including inbound freight rates and commodities. Furthermore, we will begin to realize some savings related to our efforts to reduce supply chain and input costs. However, as Jeremy noted earlier, we do not expect to see the benefit of these margin tailwinds flow through the P&L until we work through our existing high-cost inventory. We will also look to selectively reinvest some of the savings from input cost reductions back into pricing and into product.\n\nGiven the volatility of the environment, we will continue to manage our expenses tightly with a focus on investing into our highest return initiatives in conjunction with cost reduction efforts to drive efficiency and to enhance profitability and cash flow. Furthermore, next year's expenses will benefit from the annualization of the restructuring and cost savings actions we took earlier in the third quarter of 2022. In summary, we are taking the necessary actions to rightsize inventories and to optimize our cost structure to enhance profitability and liquidity. These actions will allow trigger to successfully navigate the current environment, as well as position the business for strong growth and profitability for the long term.\n\nAnd with that, we will open the call to questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question today comes from the line of Simeon Segal from BMO. Please go ahead. Your line is now open.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nThanks. Hey, guys. Good evening. So I guess I'm just wondering how you guys -- Jeremy, so I'm just wondering how you assess what is too much supply forcing pricing pressure versus maybe just a lighter level of demand as depo worked through post-pandemic replenishment cycles? And on the back of that, how you guys are going to approach thinking about the need for go-forward promotional discount needs? And then, maybe lastly, just on the back of that.\n\nDo you guys want to give us a like-for-like version of ASP to counter some of the mix dynamics?\n\nDom Blosil -- Chief Financial Officer\n\nThanks, Simeon. Yes, I think I can some of those. So on the demand question, I think it's pretty straightforward in terms of the dynamics between sell-through and this concept of destocking. And you can see it in our seasonality, right? Like we've never seen or experienced seasonality shift this low in terms of the trough and in Q3 and the slight uptick in Q4.\n\nAnd as you kind of marry that dynamic with sell-through trends, what we're seeing is sequential improvements in terms of the year over year comp coming out of peak season in the first half of the year. And on top of that, as we post a few incremental promotions in Q3, we've actually seen nice comps even over prior year in the data. And so, we're seeing some stability from a sell-through standpoint. And the growth rate, as you measure that against prior year, is very different than what you're seeing from a sell-in standpoint.\n\nAnd so, effectively, consumer demand is holding relative to our expectations in the back half of the year. It sounds some steadiness over the first half of the year. And the three-year comp is still holding really well as you compare this year versus kind of pre-pandemic norms. So those, I think, are positive signals that from a demand standpoint, although there's softness, it's still positive from our perspective.\n\nBut the challenge is the fact that we have too much inventory in channel. And I think that's contributing to the sell-in dynamic as retailers destock and we kind of take some of that impact from a revenue standpoint this year, which we're obviously deliberately willing to do. And I think that's what you're kind of seeing in our P&L relative to what we're seeing from a demand standpoint. From a promotional standpoint, I mean, yes, we'll continue to think through the promotional lever.\n\nLike I said, we do see a real uptick and kind of uplift in sell-throughs. And that helps advance the cause in terms of just cleaning up in-channel inventory levels. Like I said on the prior call or one of us said that there are limits to how aggressive we'll be from a promotional standpoint. But to the extent that they're within reason, we will pull promotions to help kind of move excess inventory through channel so long as it checks the box on profitability, as well as just the health of the brand.\n\nAnd then, can you just maybe ask your question one more time on the ASP front?\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nSo I think you called out -- so I think you called out ASP had the ongoing effect from product mix introducing the higher price. So anything to think about if we were to take out product mix, how ASP looks on any form of a like-for-like basis?\n\nDom Blosil -- Chief Financial Officer\n\nYes. I mean, I would say that from a mix standpoint, the only real difference is the introduction of our Timberline XL and -- look, the new Timberline launch, obviously, those are at very high price points. And then, that did contribute to some ASP lift. But most of this is being driven by price increases that remain in effect the three pricing increases that we took to last year and then one earlier this year.\n\nOffset by some of the incremental promotions, as well as holding price slightly lower coming out of Q2 on our entry price point being the Pro 22 and the Pro 34.\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nGreat. Thanks a lot, guys. Best of luck for holiday.\n\nDom Blosil -- Chief Financial Officer\n\nAppreciate it.\n\nOperator\n\nThank you. The next question today comes from the line of John Glass from Morgan Stanley. Please go ahead. Your line is now open.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThanks very much. First, can you just talk about what -- to the extent you know what the channel inventory actually looks like now, maybe how it's changed quarter-to-quarter given the promotional activity? Do you have reasonably good knowledge just given what you've sold to them and their sell-through or do you not really know exactly what shell in the tray looks like?\n\nDom Blosil -- Chief Financial Officer\n\nNo, we do. I mean, at least for our larger accounts, we have good visibility into in-channel inventory levels. Some of our smaller accounts like specialty, we talked about in the past, where they don't have the capacity to carry a lot of inventory. And so, we're less concerned with that long tail of specialty.\n\nBut as we measure in channel inventory levels across our largest accounts, which obviously make up a majority of the business and where we have the best information within kind of the sell-through data that we collect, we are seeing sequential improvements over Q2 on that front. And it really varies from SKU to SKU or certain SKUs are heavier and other SKUs are actually finding a path toward a more kind of rightsized level. And so, it's a continued kind of progression as we help our retailers work through these inventory levels and channel, posting promotions helps accelerate that. But part of this is really going to be about time, right? And kind of letting these inventory levels work through accordingly at the cost of some revenue.\n\nAnd that will be the biggest lever, especially when we head into Q1 and Q2 of next year where we start to really ramp up volumes. And that will, in turn, accelerate the bleed down of in-channel inventory levels, as well as help improve our own balance sheet.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nRight. You mentioned that there was a large retailer that starting a private label talent business. How important is that retailer to your overall pellet sales? And how do you think about that maybe becoming a bigger issue over time if there's other possibilities you see private label and other retailers, for example? How do you sort of frame what happened and why it happened and how big a retailer that is that's doing that?\n\nJeremy Andrus -- Chief Executive Officer\n\nYes, John. So first of all, it is an important retailer to us. With that said, I would add a couple of thoughts. One is that we do see stable attach in high loyalty on trader pellets to our installed base.\n\nThe second is, we believe just understanding our retailers, their strategies, their scales that this is a -- this is likely a one-off situation. We actually did see another one of our large retailers attempt to private label. It was on shelf for six to eight months, didn't perform well. And so, they pulled in.\n\nSo we do see some private label from time to time, but candidly, we don't see the impact in our business much. I think this this -- it is a function of the strategy of this retailer. If you were to exclude this customer, our pellet sales was actually sort of flat to up outside of that one specific customer. So we feel good about our pellet business near and long term.\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question today comes from the line of Randy Konik from Jefferies. Please go ahead. Your line is now open.\n\nRandy Konik -- Jefferies -- Analyst\n\nYes. Thanks, guys. I guess for Dom, can you give us some perspective on how you -- I don't know if you guided -- I didn't hear you say it, capex guidance for this year and kind of how you're thinking about capex for next year? And then along that, I'm just trying to get a sense of how we should be thinking about free cash flow generation? When you talked about the cost cut of $20 million, I believe, annualized. Are you thinking through like this could just be a first step in a number of steps? Or do you think that you've done enough on the $20 million to kind of generate enough cash in the business to start kind of delevering? Or I guess, relatedly, how do you think about delevering going forward? What's that kind of -- what's the strategy there?\n\nDom Blosil -- Chief Financial Officer\n\nYes. Great questions. On the capex front, I would expect capex to trend similar -- at similar levels that we saw in Q3, which we brought down fairly dramatically. And so, I think we've done a fairly good job of halting certain investments.\n\nOne of the biggest ones was a planned investment in a rollout of new fixtures for 2023. We're going to leverage the assets that we have, update the kind of the POP and kind of look and feel of those fixtures but await incremental cost there. There are other measures that we're taking to kind of manage capex to a lower level, whether that be halting certain initiatives, slow rolling or just simply pulling them out of the system completely for now. And so, that level of capex will -- has come down dramatically, and then we expect it to kind of hover at similar or lower levels to Q3.\n\nAnd so, that's something that we're highly focused on and is certainly a benefit to how we manage liquidity in the short term. On your question regarding like where we go from here? We're definitely going to bank the $20 million of run rate savings. The difference is that -- and I think as an extension of that that's not where we're stopping. The differentiation between that $20 million and what we would do going forward is that $20 million was obviously tied to a restructuring event whereas we're now at a point in time when we can sort of manage deliberately a budget for 2023 that allows us to more deliberately plan for cost reductions and adjustments to our short-term plan that may be a slight deviation from how we think about this business long term to ensure that we're fully optimizing and kind of focus the larger top of funnel spend that was in the business the last couple of years and really focusing more on middle and lower funnel and higher returning performance marketing.\n\nSo there are a handful of things. We're sort of mid-budget cycle but that really is the overarching theme, right? We have a long-term plan that we continually refresh year after year. And that really guides how we think about the next handful of years. But the stepping stone between this year and, let's say, '24 is a real focus on austerity in '23 and using that as a fundamental principle in our planning process to adjust our expenses and kind of rightsize our cost structure in accordance with what we're seeing from a leverage, a liquidity, as well as potential risk to demand in '23.\n\nSo that's kind of a nice moment in time to do this in a more deliberate way versus reacting in the moment with restructuring and other adjustments that we took in Q3.\n\nRandy Konik -- Jefferies -- Analyst\n\nHelpful. And then, I guess, Jeremy, maybe this would be a good kind of question for you around your thoughts on industry in the cycle, right? So we obviously -- we had -- we were kind of a steady-eddy growth industry than a kind of super spike COVID with coming off of that. Maybe get your perspective on when -- where the industry starts to -- or when the industry starts to stabilize, at what levels do you think are appropriate for industry kind of volume levels, if you will? And then, how do you think after that time line that if you could lay out when you think it stabilizes the industry, what you think the appropriate kind of normalized growth algo for the industry would be recognizing you guys would be a share gainer within that industry growth going forward? So just that would be super helpful to get your thoughts there.\n\nJeremy Andrus -- Chief Executive Officer\n\nSure. This is obviously something we spend a lot of time thinking about size, growth, return to a more normalized replacement cycle cadence. I'd say, first of all, that as you alluded to, this tends to be a fairly steady and resilient category. Americans cook outside, they have for decades, and that is going to continue.\n\nThe -- we did see a double-digit decline in 2009. The industry fell by about 10% declined an incremental sort of 1% in next year. And then, it grew the next 11 years, 10 years. And s,o we are trying to really understand as we do the math around replacement cycles and overlaying, of course, macroeconomic conditions when we return to more normalized buying at a consumer level.\n\nThe industry is down year-to-date about 11% in units and about 20% in dollars. And of course -- I'm sorry, I said it backwards, down about 11% in dollars and about 20% in units. And of course, the dollar component is simply a function of inflation and price increases. It is -- as Dom said, it has started to stabilize in terms of growth rate year over year, and we expect to see that trend continue partly due to comps, but also partly due to starting to get ahead of some of the replacement cycles and some of the demand that was pulled in during the pandemic.\n\nWhen does that happen? Part of that is going to be a function of the economy, but we do believe that in an environment that is steady that over the next sort of 12 months that it's sort of flat from a replacement cycle perspective. We benefit a little bit by having a slightly shorter replacement cycle than the rest of the industry, both due to usage, as well as to innovation-driving compressed ownership cycles. And then, somewhere between '24 and '25, we think the industry returns to pre-pandemic levels, and it is just historically grown low single digits. And then, we go back to doing what we have always done to build this -- to build this brand, which is to bring disruptive product to market and to gain share through product experience and through building a brand.\n\nRandy Konik -- Jefferies -- Analyst\n\nSuper helpful. Thanks, guys.\n\nOperator\n\nThank you. The next question today comes from the line of Peter Benedict from Baird. Please go ahead. Your line is now open.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nGood afternoon, guys. Thanks for all the color. Just curious of your thoughts on distribution and any plans or considerations expanding distribution. You talked about on depo obviously doing well up in Canada.\n\nSo I'm thinking about just -- well, first, domestically, are there any opportunities that might help you with the -- with moving some of the products you have on hand? And then, is there anything internationally that you could do maybe over the next 12 months to accelerate the process? That's my first question.\n\nJeremy Andrus -- Chief Executive Officer\n\nYes, Peter, first of all, I would start by saying that the largest opportunity that we have is to really penetrate our current existing distribution. I was last week in meetings and have a chance to spend couple of days in market. And one of the things that was abundantly clear is that within our existing distribution channels, there are meaningful opportunities to upgrade assortment, to upgrade the quality of merchandising, to upgrade training within those retailers. That's really how we've built the brand.\n\nAnd as you look at sort of a heat map of Traeger penetration in sales across retail, it's very clear that it follows our heritage markets and where we've made investment. And so, we have an opportunity to make much deeper investments. And we spoke to some -- I spoke to some of those in my prepared remarks, we've seen some nice products, but there's a lot to go. And we often speak about the progress in Home Depot because it's the largest reseller in the world.\n\nAnd -- but it represents how we think about going to market and driving productivity at retail. And I would say even outside of Home Depot, we've got some great accounts where we just have an opportunity to take them through higher tiers of assortment merchandise. And so, that is focus. We're also filling in at the margin.\n\nThere's certainly doors that we're adding, but I would say more sort of local, regional furniture and appliance, barbecue specialty. And we believe that within our current channel, within our current distribution strategy in our footprint, if you look at a market like Utah, for example, that has high teens penetration, it's not that we have a lot more doors of distribution. It actually is probably fairly similar to other markets. The difference is that we have deeply penetrated those stores with the right assortment merchandising.\n\nSo that's the focus. We're always thinking about our channel strategy. We're always thinking about what's out there. But with a real commitment to depth and productivity at every point of sale, we think we're still many in each in front of us there.\n\nIn terms of international, no question, there's opportunity. We've got a fairly focused international strategy. Europe has been an area of focus. And I would say even more specifically between Germany and the U.K., these are markets where we think there's opportunity.\n\nOur focus for now is a ground game. It's been in retail. It's merchandising. It's all of the nuts and bolts of how we built the brands here.\n\nAnd then, it's basic level sort of brand assets, influencer social media, local to those markets. International markets will be -- we're incubating them, and they're steady growers. But over time, we will lean into them from a marketing investment perspective as we have done in the U.S. over the last few years.\n\nBut as we think about the size of our platform here, both given how large it is relative to other markets, but how underpenetrated it still is and how much growth we see. We will continue to disproportionately invest in the U.S. and Canadian markets.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nGot it. And then, I guess, maybe, Dom, just a follow-up on Randy's question, just can you maybe talk to us about the deleverage process? I'm not sure very much there where you stand with the debt covenants currently, just an update on that front? And with respect to capex, it looks like maybe the second -- if we just annualize the second half rate, are we talking $10 million to $12 million or so for next year? Is that a level that you think you can pull the capex down to? Just curious on that outlook for '23.\n\nDom Blosil -- Chief Financial Officer\n\nYes. So the focus on deleveraging really is a function of EBITDA in the short term, right? So I think at this point, we really want to build and kind of improve our liquidity position. That's priority No. 1.\n\nPriority No. 2 is to begin to make advancements and increase profitability in the business, which in turn will translate into higher EBITDA and therefore, help us deleverage from where we are. And so, I would say at this point, at least in the short term, deleveraging will come via improvements in profitability. However, to the extent that we're able to drive liquidity and improve our free cash flow situation next year.\n\nThat will, in turn, help drive some deleveraging, be it debt where we'll be able to pay down the revolving capacity. But we don't plan on delevering the kind of the term loan anytime soon. So those are probably the two main areas that we're focused on from a leverage standpoint in terms of improving that situation. On the capex side, we're not going to share -- we're not ready to share what the target is next year, but I will say that this has been a very intense and kind of -- it's been a real focus from the team.\n\nAnd I would say that the goal is to keep capex investments to a minimum and really prioritize where we're making those investments to ensure that we're not starving the business from a long-term standpoint. So one example of that would be tooling and/or investments we make in future product road map, that will be a priority and we'll deprioritize other areas. One example I gave earlier was pulling out capital expenditures for new fixtures in 2023. And so, we're not ready to give a number on capex for next year, but I would say that it will be lower than where we landed this year.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nOK. Great. Thanks very much.\n\nOperator\n\nThank you. The next question today -- apologies. Go ahead.\n\nDom Blosil -- Chief Financial Officer\n\nYes, I was going to follow up. And I think I missed his last question with regards to the credit facility, I apologize. So we talked earlier about the difference between leverage that we report through our financial statements and leverage that's defined by our credit agreements, which are very different. And so, our leverage as measured by the credit agreement is hovering around about six turns of leverage, which is due to two components: one being a different definition of net debt, which excludes the AR facility and it's measured on a first lien basis.\n\nAnd then, the second piece to that is the fact that we have a different definition of per the credit agreement which allows for additional or incremental add backs as an example, pro forma run rate adjustments where we execute on an initiative to either restructure or pull out or rightsized cost in certain areas. And we're able to keep and take up some of those run rate benefits that will be embedded into the future economics of our our P&L on a TTM basis. And so, that allows us to kind of navigate the credit agreement and the leverage ratio that's tied to a covenant accordingly. And we're sitting well from a leverage standpoint as per that definition in Q3 and don't anticipate that we would have any problems against that covenant through year-end.\n\nOperator\n\nThank you. The next question today comes from the line of Joe Feldman from Telsey Advisory Group. Please go ahead. Your line is now open.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nYeah. Hey, guys. Thanks for taking the question. So wanted to ask, you guys made a comment during the prepared remarks about really focusing on the highest return initiatives to invest in.\n\nAnd I was just hoping maybe you could share an example or two of what that exactly means to you guys?\n\nDom Blosil -- Chief Financial Officer\n\nYes. I mean, I think what the underpinning of that is the highest returning investment that's most immediate and most predictable, right? And the best example of that is how we allocate demand creation dollars, right? So when we spend on demand creation, whether -- so an example would be search engine marketing or sort of digital advertising, where it's highly measurable in terms of the correlation between what we spend and the corresponding return on investment via revenue. And so, it's really kind of a one-to-one relationship there. And that just gives us confidence that when we're allocating scarce resources.\n\nWe're doing so in areas that have the most predictable return in kind of the in-year and in-quarter kind of time frames. Something that would be longer term that we still believe in, but just unfortunately, are making those investments right now would be prospecting marketing, to longer-tail investments in top of funnel. That are really intended to drive and build brand awareness, which we've talked about on previous calls as being an important component to our long-term strategy whereby driving more consumers into the funnel, raising brand awareness, which in turn increases that initial consideration set for Traeger, these things have real benefit, but the tail is longer because you're prospecting and it will require incremental touches with the consumer to convert. And so, we just don't have the luxury to invest in those things right now, which is why we're reallocating dollars more to kind of middle, lower funnel marketing investments that do generate that return.\n\nAnother example, which I spoke to on capex is the fixture piece, right? And I think right now, we're just trying to be scrappy with the assets that we have. We can make improvements within point of sale, it's important. But we're going to delay other investments on that front until we have the capacity to do so. So those are a couple of examples of what we look at.\n\nWhether it's kind of near-term benefits to shifting resources in areas that have a higher and immediate return in year and delaying certain investments that are important for the long term, but don't necessarily contribute directly to growth in year and/or they're not quite as measurable as the other things that I mentioned.\n\nJeremy Andrus -- Chief Executive Officer\n\nJoe, the only thing that I would add to that is that product is one of the long lead time investments that that we believe we need to continue to make. It also to Dom's comment about predictability, we see a very predictable return on our product investment with healthy channels, strong brand, a community that is very anxiously looking at whatever we launch. We continue to invest in products. I think this has actually been a nice forcing mechanism to make sure that we are simplifying our product investments and making investments in the most important opportunities that really drive outsized returns, and it's a long lead time.\n\nSo it continues through good times and bad.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nGot it. That's really helpful. And then, if I could just follow up with one other. The -- I fully appreciate the slowing down the production of new grills until you kind of work through the balance sheet inventory you have.\n\nI was just wondering if from your factory partners in China and Vietnam, like are there any minimums that you have to produce a certain level to kind of maintain? Or is that nothing to really worry about here?\n\nDom Blosil -- Chief Financial Officer\n\nYes. So yes and no. I mean, if we had to completely paused production, we could do that. But we don't necessarily want to, right? I mean, our motivation is to ensure that we're also good partners to our factories, and we're protecting continuity for those factories.\n\nBecause there's disruption if you turn off production, they scale down labor and that comes at a cost to our factories, both in the short term, as well as when we need to ramp production, which is both a little bit more cumbersome for Traeger, as well as for our factories where they have to go back and find the labor to keep up with the demand that we're producing against from a supply standpoint. And so, we're motivated independent of any contractual obligations to keep them at minimum production levels that allow them to keep the lights on and protect continuity and sort of navigate and minimize the disruption to them, which in turn will extend kind of the length of time at which we're able to ramp down our own inventory levels. But obviously, it helps dramatically because we are operating at those min levels that allow us to naturally and progressively improve our inventory position through the end of this year and obviously through part of next year.\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nThat's very helpful. Thanks, guys. Appreciate it. Good luck with the quarter.\n\nDom Blosil -- Chief Financial Officer\n\nThank you. Appreciate it\n\nOperator\n\nThank you. Our final question today comes from the line of Peter Keith from Piper Sandler. Please go ahead. Your line is now open.\n\nMatt Egger -- Piper Sandler -- Analyst\n\nHi. This is Matt Egger on for Peter. Thanks for taking our questions. Just wanted to ask about gross margin.\n\nI realize you won't see the tailwinds until you work through the higher cost inventory. But how confident are you that that happens by 2Q '23? And then, is there any way you can quantify what the gross margin contracts to kind of take out in '23 as well?\n\nDom Blosil -- Chief Financial Officer\n\nYes. So on the first question, yes, we're pretty confident that come middle of the year, we'll start to benefit from some of the tailwinds that are building from a macro standpoint. It obviously takes time to work through the high-cost inventory that's sitting on our balance sheet. But I think headline news, as well as our own point of view as we navigate and kind of work with our freight forwarders on rolling forward new contracts at different rates, like spot rates have come down dramatically, right? So at one -- at a moment in time, once our inventory levels have improved and we're buying inventory at lower cost, we'll start to see that benefit roll through the P&L, which we're hoping to see at kind of the midpoint of next year, but take real full advantage of in outer years.\n\nAnd so, that will be a nice tailwind that will benefit from. FX is also one that will start to benefit as well the P&L and gross margin once we've worked through these higher inventory levels. So we're pretty confident that we'll get there. We won't be able to realize the full impact even in the back half of the year, but we'll start to see sequential improvements that will dramatically -- or not dramatically, but we'll sequentially and incrementally begin to improve gross margin through the course of 2023.\n\nMatt Egger -- Piper Sandler -- Analyst\n\nAnd the gross margin path for us. Is there any way to quantify what they've been working on?\n\nDom Blosil -- Chief Financial Officer\n\nYes. So I don't know that we're necessarily going to share the total dollars, but these things take shape weekly, monthly. And it's something that will be core and fundamental to our strategy for the long term. So it's not necessarily something where you pull a lever and suddenly, you found millions and millions of dollars.\n\nThis is kind of continuous improvement in the progression as we work through cost on on products to kind of negotiations with factories, to how we improve land side, movements in inventory and kind of optimize our footprint, whether it be warehousing or outbound transportation to ensure that we're moving product in the most efficient way. We've talked earlier about launching direct import with a couple of customers which is contributing nice gross margin enhancements really all throughout the course of this year. So it's one where we'll continue to work at it. And we have longer-term levers as you think about how we develop a product road map that optimizes margin structure.\n\nIt will be interesting to see what happens in kind of this macro dynamic and how we sort of navigate price strategy to optimize both gross margin and volumes as we see these commodities prices and inbound transportation rates decrease. So I think what I would say to you is there's a long list of items that we're focused on and kind of the partnership between the ops team and the finance team is very tight. And we're really excited about the opportunities that are in front of us. Some of which take some time to mature, but it is something that we're bullish on, and we'll start to realized this year, as well as over the course of next year.\n\nAnd without quantifying, I will say that it is something that will contribute to gross margin over time, and we'll continue to build on that strategy, not only through this year, but obviously over '23 and beyond.\n\nMatt Egger -- Piper Sandler -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThank you. There are no further questions waiting at this time. So I would like to pass the conference back over to Jeremy Andrus for any closing remarks. Please go ahead.\n\nJeremy Andrus -- Chief Executive Officer\n\nGreat. Thank you for joining our call. We look forward to speaking with you again in March when we update on our fourth quarter earnings. Take care.\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNick Bacchus -- Vice President, Investor Relations\n\nJeremy Andrus -- Chief Executive Officer\n\nDom Blosil -- Chief Financial Officer\n\nSimeon Siegel -- BMO Capital Markets -- Analyst\n\nJohn Glass -- Morgan Stanley -- Analyst\n\nRandy Konik -- Jefferies -- Analyst\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nJoe Feldman -- Telsey Advisory Group -- Analyst\n\nMatt Egger -- Piper Sandler -- Analyst\n\nMore COOK analysis\n\nAll earnings call transcripts"
}