{
  "companyName": "Best Buy",
  "companyTicker": "BBY",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/22/best-buy-bby-q3-2023-earnings-call-transcript/",
  "content": "Best Buy (BBY -1.27%)\nQ3 2023 Earnings Call\nNov 22, 2022, 8:00 a.m. ET\n\nOperator\n\nHello and welcome to the Best Buy Q3 full-year 2023 earnings call. My name is Laura, and I will be your coordinator for today's event. Please note this call is being recorded. And for the duration of the call, your lines will be on listen only.\n\nHowever, you will have the opportunity to ask questions at the end of the call. [Operator instructions] I will now hand it over to your host, Mollie O'Brien, to begin today's conference. Thank you.\n\nMollie O'Brien -- Vice President, Investor Relations\n\nThank you and good morning, everyone. Joining me on the call today are Corie Barry, our CEO, and Matt Bilunas, our CFO. During the call today, we will be discussing both GAAP and non-GAAP financial measures. A reconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures, and an explanation of why these non-GAAP financial measures are useful, can be found in this morning's earnings release, which is available on our website investors.bestbuy.com.\n\nSome of the statements we'll make today are considered forward looking within the meaning of the Private Securities Litigation Reform Act of 1995. These statements may address the financial condition, business initiatives, growth plans, investments, and expected performance of the company and are subject to risks and uncertainties that could cause actual results to differ materially from such forward-looking statements. Please refer to the company's current earnings release and our most recent 10-K and subsequent 10-Q for more information on these risks and uncertainties. The company undertakes no obligation to update or revise any forward-looking statements to reflect events or circumstances that may arise after the date of this call.\n\nI will now turn the call over to Corie.\n\nCorie Barry -- Chief Executive Officer\n\nGood morning, everyone, and thank you for joining us. I am proud of our team's execution and their relentless focus on providing amazing service to our customers during what is clearly a challenging environment for our industry. Customers have high expectations regarding service, and we were pleased to see NPS improvements across many areas of our business as we continue to focus on creating differentiated experiences that customers will love into the future. Today, we are reporting Q3 financial results that are ahead of our expectations.\n\nThroughout the quarter, we were committed to balancing our near-term response to current conditions and managing well what is in our control, while also advancing our strategic initiatives and investing in areas important for our long-term growth. Our comparable sales were down 10.4% on a year-over-year basis. This represents 8% revenue growth over the third quarter of pre-pandemic fiscal '20, which was consistent with the growth compared to fiscal '20 that we saw last quarter. As expected, our non-GAAP operating income rate declined compared to last year due to the increased promotional environment for consumer electronics, the investments in our growth initiative, and SG&A deleverage from the lower revenue.\n\nOur non-GAAP earnings per share was up 22% versus pre-pandemic fiscal '20. We continued to manage our inventory effectively. Our inventory at the end of Q3 was down almost 15% from the third quarter of last year. This is more than our Q3 sales decline and projected Q4 sales due to a few factors.\n\nFirst, from a timing perspective, some receipts came in a few days later than expected and arrived just after the quarter closed. Additionally, due to supply constraints last year, we focused on bringing inventory in earlier to secure it for holiday. So, October of last year ended with an unusually high level of inventory. For additional context, this year, $600 million in receipts moved from October into the first two weeks of November.\n\nThe shift equates to about 8% of our inventory. The promotional environment continues to be considerably more intense than last year. Like Q2, the level of promotionality in Q3 was similar to pre-pandemic levels and, in some areas, was even more promotional as the industry works through excess inventory in the channel, as well as response to softer customer demand. From a merchandising perspective, we saw year-over-year sales declines across most product categories.\n\nConsistent with the first half of the year, the largest impacts to our enterprise comparable sales came from computing and home theater. Compared to Q3 of fiscal '20, our computing revenue remains 23% higher, and our appliances revenue remains 37% higher. Our blended average selling price, or ASP, in Q3 was down slightly on a year-over-year basis. ASPs will likely continue to be lower on a year-over-year basis as promotional activity that was largely absent during much of the pandemic has returned.\n\nCompared to fiscal '20, ASPs continued to be higher, and we believe they will likely remain higher going forward. This is due to two factors that have been driving ASPs higher for years and accelerated during the pandemic. First, category mix. We have driven material growth and mixed more into products, like large appliances and large TVs, which carry high ASPs.\n\nSecond, within categories, customers have mixed into premium products at higher price points. I would like to pause here for a moment and talk about what we are seeing as it relates to consumer behavior. As I step back at the highest macro level across retail, each customer is making trade-offs, especially with the significant impact of inflation on the basics like food, fuel, and lodging. This disproportionately impacts lower-income consumers as a much larger proportion of their spend is on those basics.\n\nAcross consumers, we can also see that savings are being drawn down and credit usage is going up. And value clearly matters to everyone. During Q3, we continue to see more interest in sales events geared at exceptional value. As a result, there is no one way to describe all customers, and we have repeatedly referred to the impacts of the current macro environment on consumers as uneven and unsettled.\n\nAs it relates to our results as a specialty CE retailer, we saw relatively consistent behavior from our purchasing customers in Q3. Our demographic mix is basically steady versus last year and pre-pandemic. Our blended mix of premium product is higher, both units and dollars, than last year and pre-pandemic. Within some specific categories, we can see some cohorts of customers trading down, but it is not aggregating into an overall impact.\n\nWhile sales are down in our signature categories as we lap the strong growth of the pandemic years, our initiative to expand our presence in adjacent categories is driving sales growth. While still small overall, we are driving sales growth in e-bikes and outdoor living categories as we expand to more stores in addition to our online assortment. Outdoor furniture, in particular, is demonstrating strong growth driven by new showrooms for our Yardbird assortment, including in our Best Buy stores and new stand-alone showrooms. From a health and wellness perspective, we launched over-the-counter hearing aids last month in almost 300 stores and online, including a new online hearing assessment tool.\n\nVolume is still relatively low, but the Q3 sales growth rate exceeded our expectations and demonstrates that customers see Best Buy as a relevant provider of these products. As you have all likely noticed, the holiday shopping season has begun. And now, more than ever, our customers are looking to bring joy back into their holiday celebration. Like we said in our last earnings call, we expect shopping patterns will look more similar to historical holiday periods than what we have seen in the last two years.\n\nSpecifically, we expect there will be more customer shopping activity concentrated on Black Friday week, Cyber Monday, and the two weeks leading up to December 25th. Our results so far in October and the first two weeks of November have come in largely as expected and support this view thus far. From an inventory perspective, we have approached holidays strategically, placing bets in areas that require a longer lead time and taking a more flexible approach in other areas. We believe this gives us more room to invest and partner with vendors that changes in demand provide additional sales opportunities.\n\nI would also stress that while November typically represents the largest influx of inventory in Q4, we will continue to receive inventory every week throughout the holiday season to replenish inventory levels. While aligning inventory levels with uncertain and evolving customer demand is always challenging, we are well positioned and feel confident we will be able to react quickly to changes we may see in customer demand. From a labor standpoint, we have seen a strong pool of applicants for seasonal associates to supplement our store team. This, combined with our investments in wages over the past few years and comparably low turnover that remains close to pre-pandemic levels, means we are ready to provide our customers the great service they expect to find in our stores.\n\nWe are excited about the promotions and deals we have planned for all our customers, including special promotions available to Totaltech and My Best Buy members. We have curated gift lists with inspiration for all, from family members to foodies and content creators to gamers. For added ease of shopping and peace of mind, we have extended both our store hours and our product return policy for the holiday season. We're also offering free next-day delivery on thousands of items in addition to our convenient store and curbside pickup option.\n\nWe feel confident heading into what could be an uneven holiday season, and we have tailored our offerings to delight our customers, whatever their budget. Strategically, as we look ahead, we are positioning ourselves to lead the way in the future of retailing. This is a future where the customer is in control and expects seamless experiences across all touchpoints. It is becoming more evident every quarter that the pandemic-induced shopping behavior changes are sticky and that our digital penetration of domestic sales will likely remain above 30%.\n\nFor the first nine months of the year, our online sales as a percentage of domestic revenue were 31%, nearly twice as high as pre-pandemic. We expect that penetration rate to begin to increase again over time as it did pre-pandemic. Additionally, customer demand for other virtual interactions has remained elevated, and we have seen strong and sustained sales growth from our investments in chat, phone, and video sales experiences this year. Of course, that also means that almost 70% of customers are shopping in our stores, and customers representing 42% of our online sales pick up their products at our stores.\n\nAs such, it is imperative we continue to invest in our stores and elevate our unique experiences. One way we are doing that is with our 35,000-square-foot experience store remodel. We remain excited about these as we continue to see positive results from our longer-running Houston and Charlotte remodels, including stronger sales, increased customer penetration, and higher net promoter scores. These stores highlight broader assortment, including the opportunity to showcase the new categories I referenced earlier, and really bring them to life.\n\nThe remodels also include premium home theater and premium appliances, more space for consultations and services, and expanded fulfillment capabilities like larger warehouses in-store and curbside pickup, and 24/7 lockers. Additionally, as you would expect, they all include the very best, most up-to-date vendor experiences, showcasing premium merchandising and specialized labor. While market conditions have created a tough environment for delivering remodels, our incredible and dedicated team was able to deliver 42 of them by Black Friday. We plan to provide a broader update on our store portfolio refresh strategy at year-end.\n\nWe are also leveraging technology in our stores more than ever to continue to elevate our customer and employee experiences in more cost-effective ways. For example, we have introduced a new app for our associates called Solution Sidekick that provides a guided selling experience consistent across departments, channels, and locations. With the app, associates interacting with the customer can see the customer's profile in the moment, including historical purchases and active memberships. As the associate starts an order with product recommendations, the app automatically calculates total tax savings for existing and prospective members and recommends additional product solution.\n\nImportantly, if a customer isn't ready to buy in the moment, associates can send the product recommendations and a recap of the conversation to the customer via email, text or QR code so they can purchase later at their convenience. It is early, but we are very encouraged by the ramping employee adoption of the app and the higher revenue per transaction we are seeing when associates leverage Solution Sidekick. We are also leveraging our investment in electronic sign labels to provide a better and more efficient experience for customers who want to buy a product that is locked up or not readily available on the shelf. We've added new functionality that allows the customer to scan the QR code with their phone's camera and push a button, notifying they are ready to purchase.\n\nThis sends the store associate an instant and prioritized notification to pick the product and have it ready at pickup. We also took a much more digital approach when building out the experience for our 5,000-square-foot store pilot we opened in Charlotte over the summer, highly leveraging these digital tools. Similar to the U.S., we are evolving our model in Canada as well and continue to see better-than-expected financial results there. We have been piloting initiatives there, including technology subscription, online marketplace, a market-focused test and small-store formats.\n\nThis expands our testing and innovation capabilities and provides opportunities to learn from their experiences when they are able to iterate faster and are further along in their pilots. We are excited to be able to innovate and leverage learnings on both sides of the border. Turning to membership, our Best Buy Totaltech offering is a very important initiative to drive deeper relationships with our customers. Last month, we passed the one-year anniversary of our national launch, and we are pleased to report that Totaltech is driving the member behavior we envisioned.\n\nMembers are engaging more frequently with us and shifting their share of wallet to Best Buy. Additionally, members continue to rate our experiences higher. Our net promoter score from Totaltech members remained considerably higher than nonmembers, nearly half of the new members joining the program in the past year for either new or lapsed customers, reinforcing that the value of Totaltech resonates beyond our existing loyal customers. Very early retention data shows renewal rates running largely in line with our original expectations.\n\nTotaltech is a comprehensive membership with wide appeal across demographics. For example, younger generations and those with children utilize more of our newer warranty and member pricing benefits, and older generations utilize more of our enhanced services and support benefit. Our associates continue to love the program since it clearly provides value to every single customer and simplifies the sales interaction. While we are encouraged by the results in the first full year, we will continue to iterate based on the macro environment and what is most relevant to our customers.\n\nAs we said last quarter, we have been encouraged with the pace at which we have been acquiring new customers, considering the uniqueness of the offer, the macro environment, and the decline in our product sales. Nevertheless, these factors have resulted in a lower member count than our original expectations. Last quarter, we enhanced our in-store point-of-sale tools to better assist our team in showcasing the value of Totaltech to potential new members. And the early results continue to be positive.\n\nWe are also activating on ways to continue to improve acquisition through our digital channel. From an optimization perspective, we will evolve the program in ways that also reduce our costs to serve. We have now lapped the financial pressure from the initial investment impact and anticipate the program to have a neutral impact on Q4 from a year-over-year perspective. Over time, we expect the program to contribute to operating income rate expansion as the program continues to build and we iterate on the offering.\n\nIn the current economic environment, many consumers are facing increasing financial constraints. We believe we are well positioned to meet customers' needs in this environment. In addition to creating key promotional moments, offering competitive prices, repairing and supporting existing products, and scaling our Best Buy outlets, we offer multiple financing options to improve affordability. These include our co-branded Citibank credit card lease-to-own program, buy-now-pay-later options, and most recently, our exclusive Upgrade+ program for Apple MacBooks.\n\nUpgrade+, powered by Citizens Pay, is a brand-new program that allows customers to acquire Mac laptops and related accessories for a low monthly fee. After three years, they can easily turn in their old laptop and upgrade to the latest tech while they continue paying a low monthly fee. We can then refurbish this old laptop and offer it to a new customer through our outlet stores or digital platforms. This partnership with Apple is a great example of how we work with our vendors in unique ways to commercialize and showcase their technology innovation while also offering unique value and confidence to our customers.\n\nIn a different example of a unique vendor partnership, we have started a pilot in the homebuilder space through a collaboration with Whirlpool and one of the top homebuilders in the U.S. to provide and install everything from connected doorbells and thermostats to large appliances. So, early, we've delivered five of the roughly 45 markets for the homebuilder, which is giving us great insight for how we may be able to expand the pilot. Based on what we've learned, we see this model as an opportunity to partner with numerous other homebuilders to provide them similar or expanded solutions based on our capability.\n\nBefore closing and turning the call over to Matt, I would like to provide a few updates on our commitment to our employees and the communities we serve. The Best Buy Foundation's Teen Tech Centers are providing access, inspiration, and opportunity for young people in the communities that need it most. We continue to expand the program with 52 Teen Tech Centers open across the country, including opening our ninth tech center in the Twin Cities, our hometown. We also remain committed to creating an environment where all employees feel engaged and have access to specialized benefits and resources.\n\nWe're proud to have women leaders at the highest levels of our company and believe it reflects our commitment to support our employees and their loved ones. This year, we are honored to rank No. 15 on Forbes 2022 list of the world's top female-friendly company, which recognizes companies that support women professionally and personally. Similarly, we were honored to be named as one of Forbes 2022 America's Best Employers for Veterans, our first time on that list.\n\nIn summary, I am proud of our nimble execution this quarter and this year. Our teams have been navigating well through an incredibly dynamic environment, and I want to thank them for their ingenuity, drive, and commitment to our customers. There is, of course, ongoing macro uncertainty. And as we head through the holiday and into next year, we believe it will continue to be an uneven backdrop.\n\nIndicators remain unusually varied. The job market remains strong, consumer spending continues, and inflation appears to be slowing a bit. But savings are starting to erode, consumer confidence is low, the housing market is cooling, and inflation remains a particular concern on the basics like food, fuel, and lodging, all of which have a profound and sustained impact. As you would expect, we are planning for multiple scenarios given the very unsettled and uneven consumer response to these varied indicators.\n\nWe are adjusting our cost structure as we respond to current and potential future conditions. We are also making strategic decisions and trade-offs to continue to advance our initiatives. We are doubling down on our ability to lead the future of omnichannel retail and capitalize on opportunities as the industry moves through this downturn and eventually returns to growth again. We are as confident and excited about our future as ever.\n\nTechnology demand over the past few years has resulted in a larger install base, and customers will want and need to replace and upgrade their tech devices, particularly as we near the three-year mark since the start of the pandemic. At the same time, our technology vendor partners will continue to innovate and drive excitement and demand. We are the leading technology solutions provider for the home, a home increasingly dependent on all this technology working together and evolving over time. We are uniquely positioned to inspire and help customers with all aspects of their technology, from deciding what to purchase to installing it and getting the most out of it, all the way to helping when it's not working.\n\nWe leverage our specialized Geek Squad agents, our expert sales associates and consultants, experienced merchants, and sophisticated supply chain to deliver experiences no one else can in customers' homes virtually, digitally, and in our stores. I will now turn the call over to Matt for more details on our third-quarter financials and fourth-quarter outlook.\n\nMatt Bilunas -- Chief Financial Officerw\n\nGood morning, everyone. Hopefully, you are able to view our press release this morning with our detailed financial results. Before I get into the details specific to our third quarter, we'd like to step back and provide some context on how our financials have evolved since the start of the pandemic. As you are all aware, the past couple of years have come with varying levels of financial performance related to the pandemic impacts.\n\nThere have been quarters where our stores were closed, when promotions were nearly nonexistent, and quarters with higher and lower incentive compensation, just to name a few. We also saw record levels of demand as people were spending more time in their homes and receiving government stimulus benefits. And now, we're living through the pressures as we lap those periods. However, what has remained consistent over the past few years is the increased penetration of digital sales, which, as Corie mentioned, has nearly doubled since the start of the pandemic.\n\nAs a result, over the past couple of years, we have modified our store operating model, piloted new store formats, and rolled out a new membership offering. To better understand the financial impacts of all this change, I want to briefly give context on the decline in this year's non-GAAP operating rate outlook compared to pre-pandemic fiscal '20 full-year rate of 4.9%. First, our core domestic non-GAAP operating income rate has slightly improved as we have made structural changes in support of our increased digital sales mix. The reductions we have made in store payroll expenses largely offset increased parcel and inflationary supply chain costs, as well as our increased technology investments that are designed to support a more digital shopping experience.\n\nOver the same time horizon, our core product margin rates remained relatively unchanged. In addition, we have also improved the profitability of our international segment, which included the exit of our operations in Mexico. Second, investments we've made in Totaltech, Best Buy Health, and our retail store remodels represents approximately 130 basis points of non-GAAP operating income rate contraction. As we have shared in the past, these initiatives come with near-term pressure, but we expect they will improve our profitability in the future.\n\nThird, this year's financial performance has benefited from lower incentive compensation when compared to fiscal '20. As we reset performance targets at the start of next year, this is not a structural benefit. This highlights how we have been adjusting our cost structure to navigate the dramatic changes in our business while balancing the need to invest in our initiatives. Let me now transition to third-quarter results.\n\nEnterprise revenue of $10.6 billion declined 10.4% on a comparable basis and our non-GAAP operating income rate of 3.9% compared to 5.8% last year. A gross profit rate decline of approximately 50 basis points was the primary driver of the lower operating income rate. Our non-GAAP SG&A expenses were $188 million lower than last year but were 40 basis points unfavorable as a percentage of revenue. Compared to last year, our non-GAAP diluted earnings per share of $1.38 compared to $2.08 last year.\n\nA lower share count resulted in a $0.13 per share benefit on a year-over-year basis. While results were down to last year, our performance was ahead of our expectations we shared in our last earnings call. From a profitability standpoint, better-than-expected results were largely driven by disciplined expense management that resulted in favorable SG&A expense, both from a dollar and a rate perspective. The favorable SG&A was partially offset by slightly lower gross profit rate, which was primarily the result of more promotional environment than we expected.\n\nNext, I will walk through the details of our third-quarter results compared to last year before providing insights into how we were thinking about the fourth quarter. In our domestic segment, revenue decreased 10.8% to $9.8 billion, driven by comparable sales decline of 10.5%. From a monthly phasing standpoint, October's year-over-year comparable sales decline of 15% was the largest decline, while September was our best-performing month. Conversely, when comparing to the pre-pandemic fiscal '20 comparable period, October had the most growth.\n\nWhile holiday shopping was more prevalent this October compared to pre-pandemic fiscal '20, it was lower than last year when there was more of an urgency for consumers to get products early due to supply chain fears. In our international segment, revenue decreased 14.9% to $787 million. This decrease was driven by comparable sales decline of 9.3% in Canada and the negative impact of 480 basis points from unfavorable foreign currency exchange rates. Turning now to gross profit, our enterprise rate declined 150 basis points to 22%.\n\nOur domestic gross profit also declined 150 basis points, with the primary drivers consistent with expectations as well as the past two quarters. These drivers include, one, lower product margins, which were primarily due to increased promotions; two, lower services margins rates, including pressure from Totaltech; and three, the impact of higher supply chain costs. These items were partially offset by higher profit-sharing revenue from the company's credit card arrangement. As a reminder, the gross profit rate pressure from Totaltech primarily relates to the incremental customer benefits and associated costs compared to our previous Totaltech support offer.\n\nAs Corie shared, we fully lapped last year's national rollout in October. As a result, the approximately 60 basis points headwind to last year from lower services margin rates was a sequential improvement from the past two quarters. Moving next to SG&A. As I stated earlier, our enterprise non-GAAP SG&A decreased $188 million while increasing 40 basis points as a percentage of sales.\n\nWithin the domestic segment, the primary drivers were lower incentive compensation and reduced store payroll costs. Incentive compensation was favorable to last year by approximately $100 million this quarter and $365 million year to date. Our store payroll expense, which excludes the impact from incentive compensation, was favorable to last year, both in dollars and as a percentage of sales. International SG&A was $150 million, decreased $21 million while increasing 60 basis points as a percentage of sales.\n\nThe decrease was primarily driven by a lower incentive compensation expense and the favorable impact of foreign exchange rates. On a non-GAAP basis, our effective tax rate was 23.8% versus 25% last year. For the full year, we now expect our non-GAAP effective tax rate to be approximately 21% versus our previous guidance of approximately 23%. The lower outlook for the full year is primarily due to discrete tax matters in the fourth quarter.\n\nYear to date, we have returned over $1 billion to shareholders through dividends of $595 million and share repurchases of $465 million. We paused share repurchases during the second quarter and recently resumed repurchasing shares in early November. We now expect to spend a total of approximately $1 billion in share repurchases this fiscal year. We are committed to being a premium dividend payer.\n\nBased on our current planning assumptions for fiscal '23, a quarterly dividend of $0.88 per share will fall outside of our stated payout ratio target of 35% to 45% of non-GAAP net income. We view the target as long term in nature and do not plan to reduce the dividend outside the range in any one year. From a capital expenditure standpoint, we still expect to spend approximately $1 billion during the year. As we shared last quarter, the makeup of our capital expenditures looks a little different than last year, with store-related investments representing a larger portion of our overall spending.\n\nTechnology and digital capital are planned similar in terms of dollars versus last year, but its mix of overall capital spending is closer to 55% versus 75% last year. Next, let me spend a few moments on restructuring. In light of the ongoing changes in our business, during Q2, we commence an enterprisewide restructuring initiative to better align our spending with critical strategies and operations, as well as to optimize our cost structure. We incurred $26 million of such restructuring costs in the third quarter and $61 million year to date, which primarily related to employee termination benefits.\n\nWe're currently expecting to incur additional charges in the fourth quarter for this initiative. Consistent with the prior practice, restructuring costs are excluded from our non-GAAP results. Let me next share more color on our outlook for the full year and the fourth quarter. Starting with our top-line expectations, we are planning for comparable sales to decline approximately 10% for both the full year and the fourth quarter.\n\nThe improved outlook for the full year is entirely driven by our third-quarter results as our expectations remain unchanged for the fourth quarter. We continue to believe that the current macro environment trends will remain challenging for the remainder of the year. Although the year-over-year sales decline in Q4 is expected to be similar to sales decline we just reported for Q3, our outlook implies a larger deceleration versus the pre-pandemic fiscal '20. As expected, the year-over-year sales decline for the first few weeks of November is similar to the decline we saw in October.\n\nMoving next to profitability. We expect our full-year non-GAAP operating income rate to be slightly higher than our previous guidance of approximately 4%. Similar to our -top-line expectations, this improvement is driven by our third-quarter performance. Relative to our previous expectations, we now expect SG&A to be a little more favorable, whereas we are factoring in a little more gross profit rate pressure due to increased promotional activity.\n\nFor the fourth quarter specifically, while still expect a majority of the year-over-year operating income rate decline to be driven by lower gross profit rate, there's less pressure than prior quarters as we lap Totaltech and some of the supply chain inflationary impacts. I will now turn the call over to the operators for questions.\n\nOperator\n\nThank you, Matt. [Operator instructions] We'll now take our first question from Zach Fadem at Wells Fargo. Your line is open. Please go ahead.\n\nSam Reid -- Wells Fargo Securities -- Analyst\n\nAwesome. Thanks so much. This is Sam Reid pinch-hitting for Zach here. You guys gave a lot of good color around the Q4 outlook, but I guess I wanted to just unpack things a bit more there because Q3 really did come in nicely ahead of plan, yet you're keeping things through the balance of the year unchanged.\n\nYou know, can you give us a bit more detail there around your thinking? And can we interpret some of this as conservatism on your part, you know? Or is there a possibility that, you know, there might be some differences in sequencing around holiday sales this year versus last year that might be driving your decision to kind of Q4 unchanged? Thanks.\n\nMatt Bilunas -- Chief Financial Officerw\n\nSure. I'll start here. This is Matt. I think, you know, when you look at the Q4, similar to the whole year, it's been a bit difficult to properly reflect forecast in this environment.\n\nI think we're trying to plan appropriately with everything that we see. Q4 comp sales are expected decline about 10%. This is a deceleration from a FY '20 growth perspective as you think about the quarters as they progressed this year. The holiday, we do expect to look a little different than last year.\n\nSo, probably more around the sales events. So, less early shopping as we saw last year but more early shopping than we saw in fiscal '20. So, from what we can see, as we exited Q3 with October sales down around 15%, we're seeing November's sales start around that same amount. So, we're, at this point, in line with our expectations.\n\nHoliday is obviously quite different than it has been over the prior-year quarters. So, I think we're appropriately planned for where we see the consumer in front of us. \n\nSam Reid -- Wells Fargo Securities -- Analyst\n\nAwesome. Thanks so much. I'll pass it along.\n\nCorie Barry -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We'll now take our next question from Peter Keith at Piper Sandler. Your line is open. Please go ahead.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nHey, thanks. Good morning, everyone. Nice results. Just sticking on the Q4 theme, we know the macro stuff, but let's just talk about products.\n\nWhat are some of the product categories, looking out this holiday season, you guys are most excited about and putting in front of your customers?\n\nCorie Barry -- Chief Executive Officer\n\nYeah. I think I'd start with our holiday where -- and I said at the script -- but I mean, I think people are really just looking for some joy in their holiday and what feels like a little bit more \"normal,\" I say that in air quotes, holiday versus the last couple of years, Peter. So, I think what we see is exciting are those things families can do together. So, things like televisions and that -- again, not just the TV that's about streaming so much more content than people were before, things like VR that take you to new places and allow you new experiences and are increasingly having more and more content availability.\n\nGaming continues to be exciting for people. And, you know, that is a place where we're getting as much as we humanly can but there still is some constraint, and we all know that drives a little bit of excitement. Health and wearables, people really taking charge of their own health, we continue to see people very interested in, you know, taking control of health and fitness and their own abilities there, and then, still, computing and tablets and this kind of productivity question. And I mentioned it in the script, I mean, this is after almost three years now of the pandemic, you've got a cohort of people now who are looking for that latest and greatest and that ability to upgrade, stay on the go, keep their life, you know, in the kind of hybrid way that everyone's living. So, the cool part -- and then there's all the fun little stuff that we saw that I think people forget, the great gifts that are in things like small appliances and indoor garden, a connected coffee cup that keeps your coffee warm.\n\nThere's just this incredible array of really interesting products that technology continues to push the envelope on and evolve. And I think what we love most is these are gifts that change every single year. So, for the great gift giver, I think we have a lot to offer.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nOK. That's very helpful. And then, just taking a little bit of a longer-term question around Totaltech. So, you gave a lot of good information now that you've anniversaried the rollout.\n\nWe just think about that EBIT margin accretion. Is that something that we should now start to see going forward in the next 12 months? Or if you're running a little lower on memberships than you thought, is it maybe one year out before it starts to become margin accretive?\n\nMatt Bilunas -- Chief Financial Officerw\n\nYeah, I think -- consistent with our -- what we talked about at the March Investor Day, I think we expected back then for our initiatives to, you know, help improve our rate as we look toward FY '25. So, obviously, the world is much different than it was back then, and the program has continued to evolve, and we'll continue to iterate. But I think we would expect that Totaltech to help provide a bit of rate improvement year over year as we look into next year, but probably more so even as we look into FY '25. Clearly, there's a -- we're learning a lot around the program and looking to make tweaks to the offer as we progress this next year from all the learnings we're having.\n\nSo, it would be our expectation that, over time, it would help improve our rate from a pressure year over year.\n\nCorie Barry -- Chief Executive Officer\n\nAnd, Peter, I just want to make sure I reemphasize something that I said in the script here, which is the good news, is it is doing what we want it to do. This is a program that's geared at those stickier, longer-term relationships with customers, being high consideration for customers and, therefore, driving up that frequency and that greater share of wallet. So, I think those early indicators for us are very positive.\n\nPeter Keith -- Piper Sandler -- Analyst\n\nOK. Sounds good. Thanks so much and good luck.\n\nCorie Barry -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We'll now take our next question from Scot Ciccarelli at Truist. Your line is open. Please go ahead.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nMorning, guys. It's Scot Ciccarelli. So, the additional deceleration you've seen in October and so far in November, is that driven primarily from transactions, or is that more ASP pressures from the heightened promotional environment? And then, related to that, any feel for whether those declines are kind of across the board, or is that more concentrated in specific customer cohorts? Thanks.\n\nMatt Bilunas -- Chief Financial Officerw\n\nYeah. Consistent with what we've seen this year, most of that contraction is coming from transactions. ASPs have been a bit down as we -- as we mentioned. And we expect them to probably come down a little bit in Q4.\n\nIt's more of the transactions that are causing that top-line deceleration on a year-over-year basis. But importantly to what we said is, if you think about where we sit against FY '20 in Q3 and as we start -- our growth for this holiday season will likely come a little different than it did last year. And more of those sale events are drawing more sales later into -- into Q4 out of Q3. So, for most of that, organic is coming from transactions versus ASPs.\n\nCorie Barry -- Chief Executive Officer\n\nTo your question about customer cohorts, we don't -- I mean, you know, it varies a little bit week to week to week, but in general, what we've been seeing is a pretty consistent customer mix both versus last year and versus pre-pandemic. And when I say customer mix, I mean kind of demographically, we actually are seeing a pretty consistent mix of customers. Like I said, it can vary a little bit week to week depending on sales profiles and the values we're offering. But at the highest level, we're actually seeing pretty consistent behavior among our customer cohorts.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nGot it. Thank you.\n\nCorie Barry -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nWe'll now move on to our next question from Chris Horvers at J.P. Morgan. Your line is open. Please go ahead.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks and good morning. You mentioned some comments on 2023. Can you take us through the building blocks of margins next year? Is the -- is the basic math that we add back all the incentive comp savings this year and saying, a, you know, hypothetically, low single-digit positive comp environment, it just becomes a leverage story? Are there still structural SG&A savings and any comments on gross margin as well?\n\nMatt Bilunas -- Chief Financial Officerw\n\nYeah, there's probably a number of scenarios for planning for next year. We're going to provide guidance where we try to lay out some puts and takes around what's happening in business now to provide some context. We just talked about it here. The largest drivers of our decline year over year versus pre-pandemic have been those investments we're making.\n\nAnd as we talked about Totaltech, it also applies to Health, that we would expect some of those -- some of the contraction to kind of abate as we get into next year but, importantly, even as you look into FY '24. So, we would expect some of those initiatives. The pressure from -- coming from wood would lessen a little bit as we get into next year but more so even later into '25 -- FY '25. I think, from a short-term incentive perspective, you're right, we will reset our performance tables next year, and we'll likely have to add back anywhere from 200 million to 250 million of STI expense when we reset those tables and start next year's plan.\n\nSo, that will obviously be a pressure we're managing through. At this point, we don't necessarily see a lot of change to the product margin rates from this year into next year, but obviously, we're early in our planning branding process. And -- and, lastly, you're right, most importantly, where our OI rate might -- is going to be impacted by the level of sales that happened. And we're still in the middle of trying to understand, you know, what -- what type of sales environment will happen next year, but it is a large impact to how we plan what the overall rate will be.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then, in terms of, you know, the promotional environment, you mentioned certain categories being more promotional than expected. Is that home theater and computing or -- and/or another category? And then, as you think about what you're seeing in the market right now, some of the big retailers, other retailers have started their Black Friday promotions already. Most have already.\n\nSo, how are you seeing sort of the inventory in the market? And what categories in particular are you elevating your promotional expectations in the fourth quarter?\n\nCorie Barry -- Chief Executive Officer\n\nI think the Black Friday promotions started the day after Halloween for everyone. There is definitely a lot out there. I think if you rewind the clock for a second here -- I actually was rummaging back through last year -- and we actually said last year, heading into Q4, we expected CE to be more promotional. And coming out of it, we said there were actually some categories last year that were as promotional as pre-pandemic.\n\nAnd as we headed into this year that we're in now, we said we expected to see environment to get back to those pre-pandemic levels. I think it happened a little earlier than we thought. But in general, this is kind of how we expected that the year would play that, by now, we'd be back to those pre-pandemic levels. And obviously, with some of the demand softening and customers targeting value, I think that's happening at even more exacerbated rates.\n\nI think -- and so, there's that. We're even seeing some of this promotional intensity in the secondary channels as well because it's been well reported there is a great deal of inventory out there in the channel. So, it's it's broad-based promotionality, which is a little bit different than a historical holiday where we really, really targeted against some of the certain product drive times. To your specific question about what areas we're seeing it in, we're seeing it in across the board, honestly, but really mainly seeing it in some of the iconic traffic-driving products.\n\nThink about like headphones and wearables and then, you can imagine, anywhere where the supply is really ample. We're also seeing some of that promotional activity in those spaces. And I think back to the question on the Q4 guide and how we're thinking about it, I think that's part of what we see in the background and part of what we're trying to take into account as we look at a competitive environment going forward.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thanks so much. Have a great holiday.\n\nCorie Barry -- Chief Executive Officer\n\nThanks. You too.\n\nOperator\n\nThank you. We'll now move on to our next question from Liz Suzuki at Bank of America. Your line is open. Please go ahead.\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Just, you know, on the -- on your last comment, kind of talking about how some of the retailers have had this excess inventory. You've been fairly nimble in managing your inventory levels while, you know, a lot of your peers were kind of caught off guard by this changing demand landscape. So, I guess just, you know, given last quarter's sales came in a little better than what you expected -- and I know there's some timing in terms of, you know, when holiday is really expected to kind of peak -- but -- and do you expect to restock in particular categories? And what are you looking to have more of at this point?\n\nCorie Barry -- Chief Executive Officer\n\nYeah, first, I just want to say I give our teams a great deal of credit for navigating, to your point, what has been an incredibly volatile backdrop. I think the experience and analytics of our teams really shines in moments like this. So, we talked a bit in the prepared comments about some of this is just a shift in timing. Last year, recall, inventory levels were really challenged, and so, everyone was trying to bring in inventory really early, and there was lots of customer demand really early because people were worried about not being able to get the products throughout the holiday.\n\nThis year, as we said, we accept -- we expected the holiday to shape a little bit more traditionally like pre-pandemic, and therefore, our inventory flows are moving more in that direction. And we specifically said, in places where we have longer-lead-time categories, we placed some of those bets earlier and then allowed ourselves a little bit more ability to maneuver on those items that don't take quite as much long lead time. There are always some spotty places where we wish we had more inventory. This is almost always true in consumer electronics.\n\nI mentioned gaming consoles. That's commonly a place. And I think there has been some conversation about some of the more iconic phones and the production there and availability there. So, that's not anything that's new.\n\nThat's kind of typical as we head into holiday. But those were really be some of the spaces where we wish we had more. And what I like is that we have a lot of room to maneuver throughout the holiday in partnership with our vendors as we think about where the demand profiles might ebb and flow. We can bring that inventory in and we set it.\n\nWe bring in the majority in November, but we replenish the whole holiday season, and this allows us the room to bring in really what's resonating with customers.\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nGreat. And just, you know, on your comment earlier about, you know, online penetration being likely to grow as it did prior to the pandemic, are you agnostic to online versus in-person shopping? Or is online an inherently lower operating margin business than brick and mortar?\n\nCorie Barry -- Chief Executive Officer\n\nI'll start a bit and then Matt can add in. What -- what -- I actually believe that this combination of omnichannel is our strength. And not only are we agnostic, we love it when customers are using the multitude of channels that we have. And that includes consultations at home, that includes our virtual channels like chat and phone, that includes online, and that includes stores.\n\nAnd so, I -- instead of just even say agnostic, I actually would say we want to double down on a customer who wants to shop across all those channels. Matt, maybe you can provide some of the profitability color.\n\nMatt Bilunas -- Chief Financial Officerw\n\nSure. I think -- I think over the last number of years, the team has done an amazing job adjusting for a very different way of delivering to the customers. In my prepared remarks, we talked about how the core of our rate is actually slightly up compared to where it was pre-pandemic, and that's adjusting for a nearly doubling of the online mix and in addition to absorbing all of the inflationary costs that we've seen over the last couple of years. So, that gives a little evidence that, financially, we're able to actually do quite well in an environment where our dot com business can reach those levels of penetration.\n\nSo, we are absolutely -- on top of it, we just want to do what's right for the customer. The customers will lead us to where we need to be, and our model can absorb that in any -- any type of environment.\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nCorie Barry -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. We'll now move on to our next question from Steven Forbes of Guggenheim Partners. Your line is open. Please go ahead.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nGood morning, Corie, Matt. I wanted to focus on computing and home theater trends during the third quarter. I think you called out in the release the weakness in those categories on a year-over-year basis. But it looks, per the category detail in the press release, that the trends improved on a three-year basis.\n\nSo, curious if you could expand on what drove that reacceleration. And then, as my follow-up question, you know, is this reacceleration part of the reason to restart the share repurchase program, or any color on what gave you the confidence to do so?\n\nMatt Bilunas -- Chief Financial Officerw\n\nSure. Yeah, computing, start with that, I think it was actually a large driver of a sales decline in Q3, but compared to FY '20 was up 23%. So, we're still seeing very strong growth from the pre-pandemic period. You know, we've seen a very large growth in the install base over the past couple of years.\n\nClearly, it's now being impacted by a level of the normalization, if you will, from the spend. We're actually seeing a good start to our Apple plus program. We're actually seeing some customers mix toward some of the latest products versus the opening price points. So, it's still relatively small and new, but that's a good start.\n\nGaming continues to be a strong growth area compared to pre-pandemic. And the computing -- computing space with so much of the gaming world is now kind of blending between gaming consoles and the computing arena. And innovation continues on, and we expect that to continue. So, still down year over year but still a good strength and a great opportunity ahead of us.\n\nTVs -- as you said, home theater did have negative comps as well. TVs, our promotions are up on a year-over-year basis, significantly a lot more stronger inventory positions from our customers. And so, we still are very confident about TVs going forward. Holiday is always a great environment for TV.\n\nASP was down a little bit year over year, but again, we're seeing good mix into higher -- higher television sizes and premium products over the last couple of years. So, we're really encouraged by -- with what the business could offer. I think to the confidence of -- the share repurchase question, I think we -- I think we, appropriately, just took some time to understand the environment ahead of us on last year's and last quarter just to make sure we were appropriately planning for the holiday period, giving us enough space on inventory investment and where we needed to sit from a working capital perspective and feel confident about our position in Q4 and -- and where our inventory sits. And it's -- it is an established confidence on where we sit financially and as we head into next year, so.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nThank you.\n\nMatt Bilunas -- Chief Financial Officerw\n\nYou bet.\n\nOperator\n\nThank you. [Operator instructions] We will now move on to our next question from Seth Basham at Wedbush Securities. Your line is open. Please go ahead.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThanks a lot and good morning. My question's on Totaltech. You mentioned that numbers are tracking a little bit lower than your expectations. Can you also parse that out between the slower sales and demand environment versus attributes of the program?\n\nCorie Barry -- Chief Executive Officer\n\nNot right now. We're not going to kind of give the exact numbers and some of the science behind it. I think it's fair to say, as we head into next year, we'll probably give a little bit more color on what we're seeing there. And as you can imagine, it's very hard to parse out the two pieces there.\n\nI think what we are remaining focused on is striking the balance between what really resonates with our customers and accomplishes what we want in terms of share of wallet and frequency and the cost of the program, and ensuring that when we're investing in the program, it makes sense and it's in those pieces that really resonate over the long term, again, with our customers. And I think, you know -- not trying to skirt the question -- it is going to take us a little bit of time to parse those things because the frequency that we have with our customers is a little bit different than some other retailers. And so, we're assessing just whether or not this program is doing what we want. And to your specific question why people are choosing to or not to enroll, it's going to take us a little bit of time to pull those pieces apart.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nGot it. Thank you. Fair enough. And my follow-up question is on your store model and refresh program.\n\nI think you said you have 42 stores done now. What's your plan over the next year? And any more color you can provide in terms of the average sales or margin dollars lift from those stores that have been remodeled relative to the core?\n\nCorie Barry -- Chief Executive Officer\n\nYeah, we haven't really given the quantity of stores yet that we want to do into next year. And we actually mentioned that in the prepared remarks we're planning to give an update as we head into next year on our kind of experience refresh plan. I think it's important to note that everything that we're doing, we're trying to root in this really incredibly elevated shopping experience with this broader assortment, expanded fulfillment, best vendor experiences. And while we haven't given specific numbers, we have said we continue to see really good and improved sales results out of at least the two that have been open more than two years now, and NPS results consistently higher in those as well.\n\nSo, we continue to remain bullish on them now. We just opened a bunch of that swath of 42 here recently, so we'll get a read on how they're performing out of the gate. But like I said, I'll give you more of an update on our future plans as we head into next year.\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nThank you and happy holidays.\n\nCorie Barry -- Chief Executive Officer\n\nYou too. Thank you.\n\nOperator\n\nThank you. We'll now move on to our next question from Brad Thomas of KeyBanc Capital Markets. Your line is open. Please go ahead.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nHi, good morning. Thanks for taking my question. Want to ask another just about the state of the consumer. Obviously, nice to see the sequential improvement in trends, which I think is somewhat a function of the comparisons from stimulus and the pandemic getting behind us.\n\nI was wondering if you can talk a little bit more about what you're seeing in terms of mix and trade-up and trade-down, and comments on perhaps the trends in the appliance category where we're seeing a little bit of a slowdown. Thanks.\n\nCorie Barry -- Chief Executive Officer\n\nYeah, absolutely. If I take a really large step back -- I think Matt did a nice job in his prepared remarks saying, quarter to quarter, it is really difficult to sort through all the laps to what you said on stimulus, on stores, open stores, closed, promotionality, all of those things. And so, instead -- I think the sequentials all get difficult. At the end of the day, we're trying to take the biggest step back and look at a consumer that we know is really facing trade-off decisions, obviously, especially when you have inflation on the basics like food, fuel, and lodging.\n\nAnd we know this definitely impacts lower-income consumers to a greater extent. I mean, almost 70% of spend in the lowest-income earners are on those kind of basics versus more like 55% for the higher-income earners. So, you've got a large proportion of your spend going there. And so, we know, we know that people are looking for value across all of those cohorts.\n\nAnd there's no easy one way to describe the consumer. It's very uneven depending on how you came out of the pandemic. And it's very unsettled. You can see that even in just in some of the confidence numbers while people are trying to sort their way.\n\nI think as it relates to us specifically and, you know, again, specialty CE retailer, we're actually seeing relatively consistent behavior. And we mentioned this in the prepared remarks. Our demographic mix is essentially steady versus both last year and pre-pandemic. If anything, it's moved just a touch more into the lower-income brackets.\n\nAnd our blended mix of premium product is higher, both in units and dollars, than both last year and pre-pandemic. And we did that on a very specific, like, price point, SKU kind of level to look at where people were really opting into those more premium. Now, obviously, within some specific categories, we are seeing some cohorts of customers trading down, but it's not aggregating at this point into an overall impact that we're seeing consistently across every single category. So, again, it depends like you might see different behaviors in back to school than you might see as we're heading into holiday here.\n\nBut at the highest level, we're actually seeing the consumer behave relatively similarly as we did even pre-pandemic, I think more so with the overarching decisions about how they're going to make those trade-off decisions between things like services and restaurants and vacations and goods and those base needs that they have.\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thanks so much, Corie.\n\nCorie Barry -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd we'll now take our last question from Brian Nagel at Oppenheimer. Your line is open. Please go ahead.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi. Good morning. Thanks for slipping me in here. So, the question I have just with respect to holiday promotions.\n\nYeah, and you recognize -- and I know Best Buy wants to and keeps its plans close to the vest. But as you think about this holiday, and maybe what you've seen already, just given the crosscurrents with the -- from spending out there and, you know, some of the inventory positions, is Best Buy looking to take more, you know, leading promotions, or are you prepared more to react to what others do in the market? To what extent are you -- are you working closely with your supplier partners to -- to both stimulate demand but also sort of to alleviate some of these -- these excess inventories in the channel?\n\nCorie Barry -- Chief Executive Officer\n\nI would almost go back to how we talked about holidays pre-pandemic. And holidays are always a very different time of the year. This is about really making targeted decisions about when, how, and where any retailer wants to be promotional. And we have a -- I would argue, a good, long history of deciding where and how within the holiday we want to be promotional.\n\nThat doesn't mean you go toe to toe on exactly the same items exactly the same day as with every other retailer. It means you create a pretty foundational holiday plan, and then, you stick to that pivoting as you see where the customer might have more interest. To your point, that means you're partnering with vendors way upstream prior to holiday to really think through what we think is both going to resonate with the customer but also hit those promotional price points that make sense. Obviously, we are committed to being competitive on price.\n\nAnd our own data would actually say we've improved our price competitiveness, both compared to last year and compared to pre-pandemic. So, not only are we baseline, I think, more competitive, we are then obviously picking those targeted -- and I talked about it a lot in the prepared remarks -- places where we can offer value. And for us, that's across the spectrum of price points. Especially when we're still seeing consumers veer toward those more premium products, we're really going to try to offer any budget, that sense of value, and we're going to, in a targeted way, decide where and how we want to play throughout the holiday.\n\nAnd I think that is really the foundation of how Matt and the team have tried to forecast what we expect in Q4. And with that, I think that's our last question. I want to say thank you all so much for taking --\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nCorie Barry -- Chief Executive Officer\n\nThank you, Brian. I want to thank you all so much for joining us today. I hope you all have a wonderful holiday season. And we look forward to updating you on our results and progress during our next call in February.\n\nThank you.\n\nOperator\n\nThank you. Ladies and gentlemen, this concludes today's call. Thank you for your participation. Stay safe.\n\nYou may now disconnect.\n\nDuration: 0 minutes\n\nMollie O'Brien -- Vice President, Investor Relations\n\nCorie Barry -- Chief Executive Officer\n\nMatt Bilunas -- Chief Financial Officerw\n\nSam Reid -- Wells Fargo Securities -- Analyst\n\nPeter Keith -- Piper Sandler -- Analyst\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nSeth Basham -- Wedbush Securities -- Analyst\n\nBrad Thomas -- KeyBanc Capital Markets -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nMore BBY analysis\n\nAll earnings call transcripts"
}