{
  "companyName": "Intel",
  "companyTicker": "INTC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/intel-intc-q3-2022-earnings-call-transcript/",
  "content": "Intel (INTC 0.84%)\nQ3 2022 Earnings Call\nOct 27, 2022, 5:00 p.m. ET\n\nOperator\n\nThank you for standing by, and welcome to Intel's third quarter 2022 earnings conference call. [Operator instructions] As a reminder, today's program is being recorded. And now I'd like to introduce your host for today's program, John Pitzer, corporate vice president of investor relations. Please go ahead, sir.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nThank you, operator. By now, you should have received a copy of the Q3 earnings release and earnings presentation, both of which are available on our investor website, intc.com. For those joining us online today, the earnings presentation is also available in our webcast window. I'm joined today by our CEO, Pat Gelsinger; and our CFO, David Zinsner.\n\nIn a moment, we will hear brief comments from both followed by a Q&A session. Before we begin, please note that today's discussion contains forward-looking statements based on the environment as we currently see it. As such, it does involve risks and uncertainties. Our press release provides more information on the specific risk factors that could cause actual results to differ materially.\n\nWe have also provided both GAAP and non-GAAP financial measures this quarter, and we will be speaking to the non-GAAP financial measures when describing our consolidated results. The earnings release and earnings presentation include full GAAP and non-GAAP reconciliations. With that, let me turn things over to Pat.\n\nPat Gelsinger -- Chief Executive Officer\n\nThank you, John, and good afternoon, everyone. Despite growing economic headwinds, Q3 revenue was flat sequentially and only modestly below the midpoint of our guidance. In June, we were one of the first companies to highlight an abrupt and pronounced slowdown in demand, which has brought and beyond our initial expectations and is now having an industrywide impact across the electronic supply chain. We are adjusting our Q4 outlook, and we are planning for the economic uncertainty to persist into 2023.\n\nWhile we are not satisfied with our results, we remain laser-focused on controlling what we can, and we are pleased that our PC share stabilized in Q2 and is now showing meaningful improvement in Q3. Our service share, while not where we want it to be, is tracking in line with our expectations, and we are encouraged by good execution in the quarter against our product road map. In addition, we are intensifying our cost reduction and efficiency efforts, and we are aggressively moving into the next phase of IDM 2.0 geared to unlocking the full potential of the IDM advantage. This afternoon, I will focus my comments in three areas: one, the key trends and dynamics that shape Q3 and are informing our outlook; two, the progress we are making on IDM 2.0, including our momentum on process and product road maps and our recent announcement that we are implementing an internal foundry model; and three, the actions underway to drive cost savings and efficiency gains aimed at accelerating our transformation.\n\nSpecific to trends we are seeing, along with further deterioration in consumer PC demand in Q3, enterprise demand has begun to slow. We expect PC units to decline mid- to high teens to approximately 295 million units in calendar year '22. Our own Q3 results reflect a strong product portfolio with Raptor Lake building on Alder Lake's momentum, as well as working closely with customers to optimize their inventory, our market share and business objectives. We are still shipping below PC consumption and the inventory correction continued in Q3, but not as quickly as we forecasted.\n\nImportantly, however, PC usage remains strong, demonstrating the increased utility and value of the PC and ultimately supporting a TAM well above pre-pandemic levels. We are targeting a calendar year '23 PC unit TAM of between 270 million and 295 million units with a strong brand and product line driving additional share, especially at premium ASPs. The data center TAM is holding up better, although enterprise in China continue to show signs of weakness as to some but not all cloud customers. Across our infrastructure and industrial exposed businesses, NEX demand was very solid, though not immune from the weakening economy.\n\nPSG continues to be a true standout with record Q3 revenue, up over 25% year over year. PSG backlog is robust, and it continues to be an area where we are supply chain-limited. Despite the challenging business environment, we made solid progress toward our long-term transformation in Q3, and we remain fully committed to using the macro uncertainty to accelerate our efforts. Each quarter, our confidence grows in achieving our goal of five nodes in four years.\n\nOn Intel 4, we are progressing toward a high-volume manufacturing and will tape out the production stepping at Meteor Lake in Q4. The first stepping of Granite Rapids is out of the fab, yielding well with Intel 3 continuing to progress on schedule. Intel 4 and 3 are our first nodes deploying EUV and will represent a major step forward in terms of transistor performance per watt and density. On Intel 20A and 18A, the first nodes to benefit from RibbonFET and PowerVia our first internal test chips, and those of a major potential foundry customer have taped out with silicon running in the fab.\n\nWe continue to be on track to regain transistor performance and power performance leadership by 2025. IFS is a major beneficiary of our TD progress, and we are excited to welcome NVIDIA to the RAMP-C program, which enables both commercial foundry customers and the U.S. Department of Defense to take advantage of Intel's at scale investments in leading-edge technologies. Since Q2, IFS has expanded engagements to seven out of the 10 largest foundry customers, coupled with consistent pipeline growth to include 35 customer test chips.\n\nIn addition, IFS increased qualified opportunities by $1 billion to over $7 billion in deal value, all before we welcome the Tower team with the expected completion of the merger in Q1 '23. On the product front, we had a busy quarter. Within client, as mentioned earlier, we added to the strong Alder Lake momentum with the launch of Raptor Lake desktop in Q3, driving a more than a 40% improvement in multi-thread performance, unquestioned leadership in gaming, six gigahertz out of the box and record-setting overclocking. We currently have over 500 OEM design wins.\n\nWe launched Intel Unison to deliver best-in-industry multidevice user experience. In addition, we saw a meaningful development progress across multiple OEM designs on Intel four-based Meteor Lake with volume ramps in 2023. We now have all elements of the AXG portfolio in production with A770 giving our discrete graphics efforts a strong boost. The Flex family is building a strong pipeline of data center use cases, and Ponte Vecchio is now production of four HPC offerings and production blades deployed for lead customers.\n\nCombined with Sapphire Rapids and Sapphire Rapids HBM, PBC is the basis for strong traction with HPC customers like Argonne National Laboratory and Germany's Leibniz Supercomputing Centre. CSPs and telcos alike continue to move to software-based 5G, vRAN and O-RAN deployments. We announced Sapphire Rapids EE with vRAN Boost for in-line acceleration of 5G and network workloads. Edge and AI are proving a powerful combination for us with OpenVINO momentum building with customers like Chipotle, and we launched the Intel Geti computer vision software platform for RapidAI training with early customers such as Braven, Royal Brompton and Harefield hospitals.\n\nFurther evidence of our AI portfolio taking shape was seen by Red Hat announcing support for Gaudi, Cnvrg.io and OpenVINO. Inspur announced Gaudi 2 with Sapphire Rapids for advanced AI use cases. Amazon will be accelerating large transform models with Gaudi instances in EC2. This was also a very strong quarter for DCAI execution.\n\nSapphire Rapids volume SKUs have now PRQed with a high-quality leadership product and a very strong volume ramp expected. Google gave the first preview of its C3 instances showing Sapphire Rapids capabilities, as well as our leadership IPU, the E3200 or Mount Evans. We also saw strong milestones in the next three generations of server products. Emerald Rapids is showing good progress and is on track for calendar year '23.\n\nGranite Rapids is very healthy running multiple operating systems across many configurations. And with Sierra Forest, our first E-core product providing world-class performance per watt are both solidly on track for '24. It's obvious, but we're stating our strategy is only as good as our execution. We have been taking aggressive action to rebuild our execution engine, driving execution excellence across our people, design and development and operations.\n\nIn Q1, I discussed our return to OKRs and their importance to our culture. Last quarter, I touched upon the next evolution of our tick-tock model, or tick-tock 2, as a disciplined approach to consistent, predictable product execution. This quarter, I wanted to spend a bit of time on operational excellence and discuss our recently announced IDM 2.0 Acceleration Office, or IAO, ushering in the next phase of our IDM 2.0 strategy. During the first phase of IDM 2.0, we aggressively focus on making the needed investments to approve our TD road map to regain transistor leadership and to ensure we have at scale manufacturing capacity by building ahead on shelves.\n\nImprovements in both areas now enables us to move forward with our next set of priorities, evolving our systems, business practices and culture to embrace an internal foundry model and establish a leadership cost structure. This means we will create what I like to call a new and clean API for the company by establishing consistent processes, systems and guardrails between our manufacturing teams and our business units. This will place our BUs on the same economic footing as external IFS customers and will allow our manufacturing group and BUs to be more agile, make better decisions and uncover efficiency and cost savings. We have already identified nine different subcategories for operational improvement that our teams will aggressively pursue.\n\nFor example, product teams will be heavily incented to drive the high-quality A0 steppings, as they see the full cost of steppings, validation cycles, hot lots and capacity changes. Factories will move to rigorous capacity loading cycles, transparency of cost for loading changes and efficiency of capital utilization, structural and variable wafer costs. In addition to establishing better incentives, this new approach will provide transparency on our financial execution, allowing us to better benchmark ourselves against other foundries and drive to best-in-class performance. It will also provide improved transparency to our owners as we expect to share full internal foundry P&L into calendar year '24, ultimately, allowing you to better judge how we are creating value and allocating your capital.\n\nA key benefit of IDM 2.0 is to unlock our full financial potential by capturing multiple profit pools not available to any one of our peers across architecture, design, wafer manufacturing, advanced packaging, supply chain and software. These pools were only partially long-term margin targets we established at Investor Day in February. Simple math would suggest there is meaningful upside to those targets as we execute and exploit the margin-stacking potential IDM 2.0 provides best-in-class semiconductor companies achieved gross margin in the 60s and operating margins in the 40s. And we aim to be best-in-class.\n\nThis next phase of IDM 2.0 is a significant evolution in how we think and operate as a company. But just as we optimize to drive outside returns in the IDM 1.0 era, we will optimize to achieve best-in-class returns in the IDM 2.0 era. It's what engineers do, and we have the best engineers on the planet. Complementing and augmenting these efforts will be an intensified focus to reduce costs and drive efficiencies in everything we do.\n\nAs we stated during Q2 earnings, we have an obligation to our owners to be good stewards of your capital. We are responding to the current environment by taking aggressive actions to reduce costs across COGS and opex while mindfully protecting the investments needed to accelerate our transformation, ensure we are well-positioned for long-term market growth. In addition to reducing near-term costs, we have also identified structural cost reductions and efficiency drivers, which Dave will outline a bit later. In aggregate, our efforts should drive $3 billion in annual savings in the near term and $8 billion to $10 billion by the end of 2025.\n\nNot captured in these estimates are the start-up costs to support five nodes in four years which will begin to subside beyond calendar year '26, adding an additional $2 billion in COGS savings. Inclusive in our efforts will be steps to optimize our headcount. These are difficult decisions affecting our loyal Intel family, but we need to balance increased investment in areas like leadership and TD product and capacity in Ohio and Germany with efficiency measures elsewhere as we drive to have best-in-class structures. We will also continue to use our smart capital approach to support and inform our capital spending aspirations, aggressively building ahead on shells while aligning equipment purchases and installs with customer demand.\n\nWe continue to see skips like our partnership with Brookfield as an innovative financial structure to more closely align fab build-out costs with fab output returns. Likewise, we see U.S. and EU chips as vital to enable us to establish a geographically diverse and secure supply chain for the semiconductor industry. We are confident in reaccelerating free cash flow growth and driving industry-leading free cash flow margins, which we get through this period of economic uncertainty affecting the entire industry and our own elevated investments to accelerate our transformation.\n\nLastly, I was particularly pleased to join the Mobileye team earlier this week in New York to witness firsthand the successful completion of their IPO, especially in a difficult market. We believe that this will help unlock Mobileye's full operational and financial potential and is an additional avenue to create value for our owners. We remain committed to optimizing our value creation efforts through portfolio honing, reallocation of resources to higher returns, higher-growth businesses, M&A and where applicable, divestitures. Before turning it over to Dave, I want to close by saying I continue to be heartened and impressed by the dedication and commitment of all of our employees by far, the most important owners of this great company.\n\nThey are passionately committed like me to reestablish Intel as a dominant driver of innovation and by the opportunity to improve the lives of everyone on the planet. It was also rewarding to see that same drive and dedication in the faces of our broader developer community at Intel Innovation, the rebirth of Intel IDF in September. We are the building blocks, an enabler of their vision and aspirations, and it is our commitment to them to be great partners and collaborators. Our ambitions are equal by our passions and our efforts across manufacturing, design, products and foundry are well on their way to driving our transformation and creating the flywheel, which is IDM 2.0.\n\nDave Zinsner -- Chief Financial Officer\n\nThanks, Pat, and good afternoon, everyone. We had a solid third quarter despite the macroeconomic headwinds impacting the semiconductor industry. We expect these headwinds to persist and as a result, we're lowering our expectations for the fourth quarter. We will continue to be laser-focused on the things that we can control and use economic uncertainty to accelerate our transformation and drive cost cutting and efficiency gains.\n\nMoving to Q3 results. Revenue was $15.3 billion, flat sequentially and only modestly below the midpoint of our guide. Q3 revenue benefited from CCG's strength, offset by declining TAMs in DCAI and NEX. Gross margin for the quarter was 46%, below our guide, but largely in line relative to lower Q3 revenue.\n\nQ3 gross margin increased 100 basis points sequentially on lower inventory reserves. EPS was $0.59, $0.24 above our guide largely on lower-than-forecasted taxes. Adjusting for the lower tax rate, EPS would have been $0.37, $0.02 above our guide on better expense management. Operational cash flow for the quarter was $1 billion.\n\nNet capex for the quarter was $7.3 billion, resulting in an adjusted free cash flow of negative $6.3 billion. And we paid dividends of $1.5 billion. Our balance sheet remains strong with cash balances of $23 billion, modest leverage and a strong investment-grade credit profile. Turning to our business unit results.\n\nCCG revenue was $8.1 billion, up 6% sequentially, driven by higher ASPs on better mix and also benefiting from our efforts to work with customers to maximize our share position ahead of Q4 price increases. CCG revenue was down 17% year over year as customers continue to reduce inventory and we continue to under ship demand. Demand weakness year over year was most pronounced in the consumer, education and small medium business markets. Operating profit was $1.7 billion, up $570 million sequentially and down 54% year over year on lower revenue, increased 10-nanometer and Intel 7 mix and increased spending to further strengthen our product road map.\n\nDCAI revenue was $4.2 billion, down 27% year over year on TAM reductions and continued competitive pressures even as market share continues to track in line with our expectations. Operating profit was $17 million, below expectations and down significantly year over year. Profitability was impacted by lower revenue, higher advanced node start-up costs and higher product costs on transition to 10 nanometers. We also continue to invest aggressively in the product road map.\n\nNEX revenue was $2.3 billion, up 14% year over year on increased demand for 5G, Ethernet and edge products, partially offset by lower network Xeon demand. In Q3, we started to see macro-driven demand softness and customer inventory management impact NEX. Operating profit was $75 million, down 85% year over year due to the impact of softer demand on inventory valuation and increased road map investment. AXG revenue was $185 million, up 8% year over year on the ramp of our Blockscale products.\n\nOperating loss was $378 million, $129 million better sequentially, but $156 million worse than year over year due to softer demand and product readiness impacting inventory valuation, as well as increased investment to deliver the visual, supercompute and custom accelerated graphics road maps. Mobileye revenue was $450 million, up $124 million from Q3 2021, primarily driven by higher demand for EyeQ products. Operating income was $142 million, up $15 million from Q3 2021, primarily due to higher revenue. IFS revenue was $171 million, down 2% year over year, driven by automotive weakness with customers citing third-party component shortages, partially offset by growth in core foundry and IMS businesses.\n\nOperating loss was $103 million versus an operating loss of $44 million in Q3 '21 on increased spending to enable our foundry growth strategy. Turning to Q4 guidance. Given the deteriorating macro environment and based on input from our customers, we're now guiding Q4 revenue in a range of $14 billion to $15 billion with sequential decline driven by lower CCG revenue as customers reduced inventory lower NEX TAM and continued DCAI headwinds. We're forecasting gross margin of 45%, a tax rate of 14% and EPS of $0.20 at the midpoint of revenue guidance.\n\nFor Q4 adjusted free cash flow, we expect to see a meaningful sequential increase driven by working capital improvements and a $2 billion reduction in net capex, adjusting for a lower demand environment. These benefits will be partially offset by lower revenue. And as a result, we're reducing our full year adjusted free cash flow guidance to negative $2 billion to negative $4 billion. There is also a possibility that a portion of expected capital offsets could move from Q4 to Q1, shifting the cash flow benefit into next year.\n\nConsistent with our short-term financial model discussed at our Investor Day in February, our continued intent is to manage adjust this free cash flow at approximately breakeven as we go through this period of accelerated and elevated investments supported by our smart capital approach and the multiple pools of capital available to finance our strategy. Now turning to our long-term outlook and the changes we're making to transform the business. Beyond Q4, there's a high degree of macroeconomic uncertainty, and it appears that the current challenging market environment will extend well into 2023 with the potential for a global recession. Further, as I discussed in Q2 earnings, it's imperative that we drive for world-class product cost and operational efficiency to achieve our long-term financial model.\n\nAs Pat detailed earlier, to accelerate this transformation, we're forming the IDM 2.0 Acceleration Office and doubling down on our efforts to reduce costs and find efficiencies across the organization. We'll start with a focus on driving $3 billion of cost reduction in 2023, one-third in cost of sales and two-thirds in operating expenses. Note that our Q3 results include GAAP restructuring charges of $664 million that reflect initial efforts to rightsize our business and deliver these savings. In Q4, we expect to have additional restructuring charges of similar magnitude as we further rationalize our 2023 financial plan.\n\nLonger term, we will execute on continued structural cost savings and efficiency gains, which we expect to drive $8 billion to $10 billion in annual savings by the end of 2025, split roughly two-thirds in cost of sales and one-third in operating expense. These savings will be realized through multiple initiatives to optimize the business, including portfolio cuts, rightsizing of our support organizations, more stringent cost controls in all aspects of our spending and improved sales and marketing efficiency. As Pat outlined, also critical to driving this transformation is the implementation of our internal foundry operating model, dramatically increasing financial accountability and transparency, enabling all organizations to drive to world-class product cost and efficiency benchmarks. In addition, as we emerge from five nodes in four years and slower technology development cadence, we expect an additional approximately 200 basis points of gross margin after 2026.\n\nWe expect these efforts to provide potential upside to the financial targets we provided at the February Investor Day. This will be a multiyear journey, but as Pat said earlier, best-in-class semiconductor companies have a financial profile that includes gross margins in the 60s and operating margins in the 40s, and we aim to be best-in-class. In the short term, we will continue to manage to the opex, net capital intensity and adjusted free cash flow guardrails established and drive back to a gross margin percentage range of 51% to 53% once economic conditions improve and revenue growth returns. In closing, we remain committed to the strategy and financial model communicated at Investor Day.\n\nThe compelling long-term financial opportunity of strong revenue growth across our six business units and free cash flow at 20% of revenue remains. And I believe this downturn represents an opportunity to more quickly make the transformation necessary to achieve these goals. With that, let me turn it back over to John and get to your questions.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nThank you, Dave. As move into the Q&A session, we would ask each participant ask one question, and where appropriate, a brief follow-up question. Operator, please go ahead and introduce the first caller. \n\nOperator\n\nCertainly. [Operator instructions] Our first question comes from the line of Ross Seymore from Deutsche Bank. Your question, please.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nHi, guys. Thanks for letting me ask a question. You mentioned, both Dave and Pat, many times about the macroeconomic weakness, likely persisting into next year. So if you're willing to talk a little bit about the puts and takes in the market.\n\nYou talked about the PC market being down about 5%, Pat. But overall, from your segments, where do you see either market headwinds or tailwinds or individual Intel-specific areas for market share gains or still challenges into 2023?\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. Thank you, Ross. I'll start off on that. And like we said, it's just the macroeconomic, unpredictable, tough market outlook.\n\nAnd inside of that, it's just hard to see any points of good news on the horizon, inflation in the U.S., the situation in Europe with energy and the war and in Asia. So against that backdrop, we're still looking to have economic headwinds as we go into next year. And with that in mind, obviously, lowering our guide for Q4. As we think about it, at the industry level, obviously, some of that helps to accelerate some of the rebalancing of the supply chain, and some of that will help our business like lowering of DDR memory costs will decrease the premiums on DDR5 that makes Sapphire Rapids a more compelling platform.\n\nIn other areas, we still have a rebalancing of the supply chain in front of us on some of the older nodes. When we look at our business units, the PC, more critical device than ever. And as Sacha talked about yesterday on his earnings call, 20% more active devices usage increasing. That said, we do expect that the TAM, as I indicated in my formal comments, is going to be a bit lower next year.\n\nWe've given a range aligned with the industry. For servers, we have seen the slowdown in enterprise and to a lesser degree, in the cloud market, decreasing the TAM outlook there. We do, in our modeling, look at that as we're building our capacity. Obviously, our cost efforts have been very specific to give us flexibility for lowering the structural rate cost even as we stay true to the strategic investments that we're making and driving our transformation and disciplined cost modeling more quickly.\n\nSo it really is a challenging environment, unpredictable environment, and we're staying true to the strategy, making cost adjustments and trying to balance market outlooks as we gain share, right, in some segments, and we fight for share in other segments. And I was very pleased with how the team executed in improving our execution in an environment that really was quite tough. Thank you.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nRoss, do you have a brief follow-up?\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nYeah. Just following up to that last part that you said, Pat, about some of the areas of share gains or share losses. Where do you think those will be most acute in both directions, the good and the bad?\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. And we'd say we saw no -- if we go to the areas, we're just entering in the AXG business and IFS. So everything there is gaining share. In the NEX business, we saw our businesses entirely driven by the macro.\n\nAnd our market share seemed to have no real shift whatsoever, and we continue to be a grower in that segment. In PC, we had very market share gains this quarter, very strong product lines, so we think we're well-positioned. And in data center, we grew slower than the market. And as the product line gets stronger, we will be in a position to regain share, regain ASP, obviously, ramp the Sapphire Rapids.\n\nBut we still see ourselves not in a position that we're gaining share yet and expect that will be the case for a couple of more quarters.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nThank you, Ross. Jonathan, could we have the next question, please?\n\nOperator\n\nCertainly. Our next question comes from the line of Timothy Arcuri from UBS. Your question, please.\n\nTim Arcuri -- UBS -- Analyst\n\nThanks a lot. Pat, I had a question on the internal foundry. It seems sort of like the first step in basically splitting the company into an external foundry and a fabless company. Can you sort of play that out? Is that the idea? And sort of how does this create value? I guess, I mean, obviously, if you look at GlobalFoundries' market cap, that's like 30% of your market cap.\n\nBut how does it play out functionally, how it creates value?\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. When we definitely view that there are efficiencies for us to gain as we go through this internal foundry model, where we see numerous areas in the company that were not as rigorous as we need to be. In factory loading, where we make lots of change in factory loadings and we would run the factories more efficiently or stepping aren't accountable, right, through cost modeling back to the business units, and thus, driving the high-quality A0 stepping. And stepping changes being fully reflected internally and the cost of those will make us more efficient.\n\nLeveraging third-party IP more aggressively will make us more efficient. And the combination of that is a big piece of why we're stepping to this internal foundry model, and we expect that we're going to start giving more financial transparency that way so that you can start to see the benefits in the margin stacking being realized of both being a product company, as well as a fab foundry company. And that's what we're out to get with the structure that we're laying out. That said, we think that this tight coupling of the IDM 2.0 model is a powerful value generator for us, at least the three areas.\n\nOne, the technology benefits that we get to have a rapid pace of technology innovation and co-optimization between product and process. The second is the cash flows and balance sheet benefits that we get by having these internal to be able to drive the large investments required in the manufacturing network. And third is in the supply chain efficiency and flexibility being able to balance across the foundry and business unit structure. So these three areas for us are ones that we see that tight coupling bringing long-term meaningful value generation to the company and to our shareholders.\n\nBut we're going to do it against the backdrop that we are going to be benchmarking ourselves against the best-in-class in each area and that transparency, right? We'll provide more visibility to you, our shareholders, but also drive our teams internally. And an engineering, manufacturing team when they see benchmark that you're holding up against them, it just unleashes energy into the future. And that's the excitement that we are working to create with this internal foundry model. And as we've launched it this quarter, we're already starting to see the roots of that permeate through our teams.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nTim, do you have a brief follow-up?\n\nTim Arcuri -- UBS -- Analyst\n\nI do just quickly. I guess just a follow-up on that. So like what's the line in the sand, Dave? I guess, it's a question more on cash flow. What is the line in the sand? I think before, you said that 2024 was going to be free cash flow neutral.\n\nIs that still the line in the sand where whatever you have to do, you'll do -- you'll cut capex as much as you can to be free cash flow neutral in 2024? Is that still the free cash flow line on the sand?\n\nDave Zinsner -- Chief Financial Officer\n\nYeah. I mean we expect to manage in the near term, while we're in this investment phase to kind of a neutral free cash flow over the course of '23, '24 combined. Obviously, our long-term goal is to is actually significantly improve cash flow, and we still feel like the model we gave at Investor Day is the right model that we can generate 20% free cash flow, as a percent of revenue. And obviously, this year, I think we showed very good discipline on the capex side.\n\nWe brought our capex -- I think when we started the year, we thought capex would be in the $27 billion range on a net basis. We've adjusted that down to $21 billion. But we still preserved what Pat thought was the most important things to invest in to make sure that we're ready to go as we launch new nodes, as we bring out the IFS business and gain more customer traction in that space. And then next year, the real protection on the cash flow now will be around these spending reductions.\n\nWe have $3 billion of spending reductions we're going out to achieve in '23. No guidance yet on capex, but I would just say the model in the near term was to run essentially at 35% of revenue. And as Pat, I think, even mentioned on the investor -- at the Investor Day, we will manage to the model, and that's quite important to us. So we think we can manage both aspects of this protect cash flow, be smart around spending, but continue to operate our strategy and our road map to get to leadership on process and product, to bring out these emerging businesses like the foundry business and like graphics.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nTim, thank you for the question. Jonathan, could we have the next question, please?\n\nOperator\n\nCertainly. Our next question comes from the line of Vivek Arya from Bank of America. Your question, please.\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nThanks for taking my question. Pat, isn't it risky to plan for a $270 million to $290 million PC TAM. Then clearly, the market seems to be reverting back to pre-pandemic levels of $260 million or so. And since that time before the pandemic, one large customer has moved away from x86, and there have been share shift.\n\nSo what is the TAM next year is more like $250 million to $260 million? What impact will it have on your cost and fab loading assumptions? Thank you.\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. So first, the premise of the question, we clearly, over a number of quarters, we're above market forecast. That range that I described is exactly in line with the various forecast, our OEM feedback, the feedback from key software providers as well. So I'd say our range is now aligned with that industry range.\n\nSecond point being that ranges larger than and well above pre-pandemic levels at that point. It is a structurally larger market. There's lots of units out there waiting to be replaced that are aging in the footprint, clear markets that are yet to have the PC penetration. So we feel quite comfortable.\n\nAnd as I noted in the earlier question, PC usage is high, as seen by Microsoft and their metrics, and our product line is positioned to gain share. So somewhat independent of the size of the TAM, we have a great product line, and our product line is also in our brand is well suited with a higher margin segments of the market that have been more resilient, right, to the market effects, low-end consumers where you've seen the biggest issues and our product line is very strong. Alder Lake, Raptor Lake, stunning numbers that we're getting and well on track with Meteor Lake. All of that said, obviously, you have to make some assumptions as you build a factory network, and in the range that we gave has a lot of room inside of it.\n\nAnd as we're demonstrating by the near-term cost cutting, that Dave described, we're trying to build flexibility into our factory network even as we adjust the cost structure, which is largely a fixed cost structure. And obviously, as we're ramping into the next-generation products, we're building into our Intel 4 and 3 product lines and the costs associated with that even as we balance both the near term and the strategic agenda. So we feel like we're well-positioned to manage and thick or thin. And against that, with a strong product line, we believe we're a share gainer in this industry, and we're going to be quite aggressive to accomplish exactly that.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nVivek, do you have a quick follow-on?\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nYes. Thanks, John. So maybe, Pat, just following on to that. Do you think you are shipping to demand on the PC side? Or do you still think there is a channel inventory because as we head into Q1, that is often a seasonally softer period, but again, compares are very different this year.\n\nSo I was just hoping to get your perspective on what the supply demand balance is in the PC market as it exists kind of real time? Thank you.\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. Yeah. Our belief is that we ship below consumption levels. So our -- in other words, inventory levels at the OEM and in the channels decreased over the last quarter.\n\nThey didn't decrease as far as we were originally predicting. So consumption was a little bit weaker, but we still saw inventories systematically going down across the various routes to market throughout the quarter. We expect them to continue to go down next quarter at both the OEMs and at the channel level. And the numbers I gave on the TAM model would be our consumption models for next year, which are below the consumption models of this year.\n\nSo a somewhat smaller number for next year but not dramatically different as we already said. So overall, I think we're getting to a better point of supply demand equilibrium where we were way behind on demand and supply for many, many quarters in a row. Clearly, the last couple of quarters have been adjusting of inventory levels and we think that we're going to be in a better supply demand balance situation as we go into next year.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nThanks, Vivek. Jonathan, could we have the next question, please?\n\nOperator\n\nCertainly. Our next question comes from the line of Pierre Ferragu from New Street Research. Your question, please.\n\nPierre Ferragu -- New Street Research -- Analyst\n\nHi. Good evening. Thanks for taking my question. I'd love to talk a bit about like the very ambitious like efficiency plan you heard you've announced.\n\nAnd first, I'd like to understand the timing of it. The performance of Intel has been challenged in the last six months. Should we read that as a very reactive plan and you're basically --[Technical difficulty]\n\nDave Zinsner -- Chief Financial Officer\n\nPierre, are you still on?\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nOperator, I think we lost Pierre.\n\nDave Zinsner -- Chief Financial Officer\n\nI can answer as long as we're still on. OK. Just make sure we're live.\n\nOperator\n\nYes, you are.\n\nDave Zinsner -- Chief Financial Officer\n\nOK. Thank you. So thanks for the question, Pierre. Yes.\n\nSo keep in mind, as we look at this $8 billion to $10 billion of efficiency gains that we're talking about, we're actually making a pretty meaningful down pain on those efficiency gains in 2023. We expect to get $3 billion of savings from -- versus '22 in '23. And keep in mind, actually, we have some fixed expenses that come on next year. So the cash savings is actually more like $5 billion of savings next year.\n\nNow as it relates to the $8 billion to $10 billion, we think as we exit the 2025 period will roughly be in that $8 billion to $12 billion -- or $8 billion to $10 billion range. And as Pat kind of walked through, we just think we've already identified a lot of different efficiencies that will get us to this $8 billion. But also, as we start to manage the business in this internal foundry model, we think we'll find and cover a lot more opportunities to drive efficiency and savings. So we'll update you as we progress over the course of the next three years and let you know how we're doing in terms of our progress, but we have very good line of sight on the first $3 billion and pretty good line of sight on the full $8 billion to $10 billion.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nJonathan, could we go to the next question, please?\n\nOperator\n\nCertainly. Our next question comes from the line of Joseph Moore from Morgan Stanley. Your question, please.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nGreat. Thank you. I want to come back to the internal foundry model again. Can you talk about -- it's very clear how it makes your foundry business better.\n\nFrom the standpoint of the CPU business back when you guys were on top in process, there was a pretty clear indication that it was the alignment of the device business with the fab that was kind of creating this really good outcome. Is there any trade-off that you make with this from the standpoint, looking at it from the standpoint of the microprocessor part of the business?\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. Thanks, Joe, and I'll start on that one. The simple answer is our job is to keep that One Intel synergy. And when I describe the three value vectors that I'm expecting to continue to really leverage around this technology collaboration, co-optimization of the microprocessor with the process technology is one that's high on that list.\n\nAnd we've made a lot of -- actually quite a lot of progress since I've been back driving that. And we're really seeing the benefits of that. And for instance, the great health that we described on Granite Rapids as an example about the momentum that we're seeing from Meteor Lake, there were clear examples. So I do believe that we're well underway at keeping that rich cycle of technical collaboration and co-optimization.\n\nBut there's been many of these areas that I described that there hasn't been this intense accountability. Steppings were done too easily and without the quality A stepping. And some of that came through our stumbles as you went with 14 and 10 nanometers, but we lost the discipline of the understanding of what steppings cost and not just in the fab but also in the validation cycle. So we have to bring much more accountability and transparency to that.\n\nAlso, we expedited all the time. While expedites are a good thing when you're bringing a new product to marketplace, but they also create fab in efficiencies, and the results of that are we're not being accountable for the fab efficiencies. Otherwise, our margins will be markedly higher than they are today. So to me, it's really maintaining the good things and the three I described, the technology benefits, balance sheet capital and the supply chain while driving a lot more transparency, automation, efficiency and the result will be, I believe, is a much better Intel for the long term, not just for the external foundry customers, as you suggest, but for my internal customers as well.\n\nDave Zinsner -- Chief Financial Officer\n\nI would just add that we have six business units today. We measure them separately, but they actually do a very good job. In a lot of cases, they need to pull together to engage with customers, to develop products and so forth. And so I think we have a pretty good process and culture within Intel, where we can strike the right balance between creating some transparency and accountability for the internal foundry business, but also make sure that they're aligned to the overall Intel goals.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nJoe, do you have a quick follow-up?\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nYeah, I do. And thank you for that. That's very helpful. In terms of the accounting in 2024 around this internal foundry structure, is the goal there to sort of have a transfer price between the foundry business and the rest of it, that kind of reflects the market price? Or just how -- it seems like the accounting of how you're going to determine where the profits could get tricky.\n\nDave Zinsner -- Chief Financial Officer\n\nYeah, it's a good question. That's pretty much what we're thinking. I mean, we will have our own foundry business. So we'll have a good sense, I think, of the market.\n\nAnd so that's how we'll approach it. I would say in '23 it's going to be a somewhat light touch. We'll do this through mostly kind of spreadsheet-oriented analytics. Eventually, we -- and Pat's been pretty vocal on this.\n\nWe want to create more automation, systemization of everything that we're doing between the foundry and the product. So over time, this will get more robust. And ergo, we'll be able to drive more accountability, I think, as we progress through --\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. And just to add on to that a little bit, Joe. Here, this is a case where our internal processes and systems were optimized for IDM 1.0, right? We weren't having to say what is a sustainable wafer price that we should be designing against. And we were having a wafer cost view, right, which early in a process life is very high, right? And then it gets to mature, and how do design teams pick the right choice when you have such variability, whereas the foundry model gives a much more predictable wafer pricing that then enables a more efficient business unit model to pick the right technology choices to deliver the best products.\n\nSo that's just one example that we're finding that we're not making the best decisions today, and this will allow us to hold the manufacturing teams to be entirely accountable. You've given a price hit the defects, you hit the cost structures associated with it and the business units, you have a wafer cost and go build the best product against that and ramp it like crazy in the industry. And obviously, presenting those with clarity will help you as the Street understand the progress we're making to accomplish that.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nThank you, Joe. Jonathan, could we have the next question, please?\n\nOperator\n\nCertainly. Our next question comes from the line of C.J. Muse from Evercore ISI. Your question, please.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYeah, good afternoon. Thank you for taking the question. And one more question on your Intel foundry strategy. It makes perfect sense to me around the discipline and cost that you're looking to achieve here.\n\nBut if I'm a business unit head, and you've been pretty clear that you're playing catch up five node migrations over the next four years. If I'm a business unit head over the next two years, why would I not outsource completely? So I guess what are the guardrails to ensure that you're keeping capacity internally until you achieve the goals that you've set out for 2025?\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. Maybe three different perspectives on that C.J. Obviously, most of the design decisions that are being made by my product teams now are '25, '26, '27 decisions when we're back to process leadership, right? And they're seeing that progress day to day. And just as I said, hey, if you want to design the best product, have the best transistor.\n\nSo they're with the capability to look now at the Intel leadership process technologies as they make those decisions. Also, secondly, as I described, this is a tight binding and we're going to maintain that tight binding of optimization and co-optimization for relationships that are decades old between our teams, by bringing in a new discipline to the boundary between them. And the third answer is we already use external foundries. This is a process that's already pretty well established, and we're using a range of external foundries.\n\nOur design teams over the last five years or so have learned how to use external foundries. And the fact is they're interacting now with my internal foundry, many of those learnings on expectations of PDKs, design tools, IP libraries are driving the expectations for what is required to be a good internal foundry, which will make my internal foundry a better external foundry as well. So I see this as a very regenerative cycle as we unleash these energies. And ultimately, I'm the CEO across both, and we'll be making good decisions to hold both of them accountable even as we clarify the interfaces and the efficiencies between them.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nC.J., do you have a quick follow-up?\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYeah. Thanks, John. I guess, Dave, as you think about the strategy, how does it change capital intensity for the business, not into '23, but perhaps say, over the next five years? Is it still that 35% type of number? Or how should we be thinking about it? Thank you.\n\nDave Zinsner -- Chief Financial Officer\n\nYeah. Good question, C.J. So obviously, in this investment phase where we're catching up on node transitions, what we do, we will have a higher capex intensity, this 35%. But we do expect, as we get out of this phase, to be back down to a more normalized level of about 25% capex intensity.\n\nSo there definitely will be an evolution and adjustment. And that's one of the key components of allowing us to kick up our free cash flow to this 20% of revenue level that is ultimately the model.\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. And also just piling on to that, we also look -- we always look at that through the lens of our smart capital strategy, where clearly, we're viewing both the gross capex, but more importantly, the net capex from your perspective and how we access other pools of capital to be able to build that out in a very financially prudent way and those other approaches, EU, U.S. Chips Act, ITC skip give us a lot of flexibility, combined with the shell first strategy to be able to make sure we're spending the capital, the more expensive equipment capital, more timed with the market demand clarity.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nThank you, C.J. Jonathan, could we have the next caller, please?\n\nOperator\n\nCertainly. Our next question comes from the line of Mark Lipacis from Jefferies. Your question, please.\n\nMark Lipacis -- Jefferies -- Analyst\n\nHi. Thanks for taking my question. Pat, maybe for you, despite all the consolidation in the industry and the growth that Intel has seen and the larger foundries have seen, the capital intensity continued to seem to have moved higher, notwithstanding your hope that -- or expectations that it's going to come back down again. So given the high levels, you can make the argument that the industry actually needs even more consolidation than it has already seen at the level of the -- some of the biggest players in the industry.\n\nCan you share your thoughts on how you think about the potential for this large scale -- this kind of large-scale M&A or maybe joint ventures among the class of the leading-edge players? Or are they just -- are there issues like FTC-related or national security-related that just means that thinking about that kind of consolidation or joint ventures across borders is something that just takes it off the table and maybe it's a different analysis for consolidation versus joint ventures? Thank you.\n\nPat Gelsinger -- Chief Executive Officer\n\nWell, there's a lot packed into that question. And I would just say, I mean, I generally said that, hey, we see this industry being a consolidating industry over time, particularly on the manufacturing side because of the extreme capital intensity, but also the incredible R&D costs, right? If you think -- if you want to have a world-class technology development team, all you have to do is spend $5 billion a year in R& D and do that for 30 years, right? Now you're OK. Now you're world class, right? And these are just extraordinary long-term investments that you have to build up and operate this way. And against that, I've consistently said I expect that there will be further consolidations in the industry going forward.\n\nNow what shape those will take, what the timing of those will be, what will be the trigger points that would position such moves, and as you said, there's many factors associated with that in terms of regulatory, legal, financial steps associated with it. But fundamentally, economics 101, right, would say you will see further consolidations into the future, and we believe that will be the case. And we would expect to be a consolidator in that process over time.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nMark, do you have a quick follow-on?\n\nMark Lipacis -- Jefferies -- Analyst\n\nNo, that was good. Thank you, John. And thanks for that answer, Pat.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nPerfect. Jonathan, I think we've got time for one last question.\n\nOperator\n\nCertainly. And our final question for today comes from the line of Matt Ramsay from Cowen. Your question, please.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nThank you very much, John, for squeezing me in. Pat, I wanted to ask a question about the server road map. We've got some, I think, relief from some of the commentary for cloud capex during this earnings season in the last three days and particularly from Meta last night, but the rest of the big guys as well. But on the flip side, there's some rumblings that maybe there's a couple of more months before Sapphire Rapids might ramp in big volumes.\n\nSo I'm just -- maybe if you could help and level set us on the timing of big cloud volume of Sapphire Rapids and how that now dovetails in with the timing. It seems like you're keeping for Emerald Rapids in late '23. Thanks.\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. Thank you. And as I indicated, Sapphire Rapids is now peer queued and the ramp is underway. We are ramping the product as we speak, strong customer demand.\n\nWe expect this will be our fastest ever, Xeon to 1 million units, and we're going to push that quite aggressively, and the factories are ramping up as we speak. Obviously, this is good news for that business competitively, a big ASP uptick as well on the product. So lots of good things come. Also, we had a particularly good quarter on the execution front, not just Sapphire Rapids PRQ but great health on Granite Rapids, Emerald Rapids looking very good, Sierra Forest.\n\nSo the next three generation products are all making very good milestones, and I really feel like the worst of our execution is behind us. And we're really starting to see some enthusiasm, momentum, excitement building in those teams as they turn the corner on these products. We do think, as I said in the formal -- that the market is softer, right, on the enterprise side and somewhat on the cloud side as you reinforced by some of the other comments from others. That said, as we ramp these products, it's all about having the best product to gain share, to gain ASP, to improve the margins of the business.\n\nAnd we now feel like our portfolio is taking share or taking shape to accomplish exactly that. And we're going to be aggressive. We're going to fight for every socket. This is a game where we have to reestablish ourselves in the marketplace.\n\nAnd now we're starting to have the product line to do that. And that's exactly what you'll see. In addition to that, we're also building out our software assets to have an increased value proposition. And one of those is, for instance, with Sierra.\n\nSapphire Rapids is the market improvements in AI, but even more importantly, in security. And with our security services and capabilities, very differentiated areas like confidential computing are gaining quite a lot of interest in the industry for not just enterprise, but cloud customers as well. So a lot of things going on there. But overall, we feel like our momentum is being reestablished in this critical, critical area of our business and one that we know has a lot of attention from you all in the community.\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nMatt, do you have a quick follow-on?\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nYeah, John. Thank you. And thanks for that, Pat. One thing that piqued my interest, Pat, in your prepared script was -- I mean there's a lot of discussion of the five nodes in four years and halfway through that transition is 20A with RibbonFET or gate all around.\n\nSo you guys are going to need to go through that jump. Your competition as well. And you mentioned, I think, some tape-outs of your own stuff but also some tape-outs of potential external foundry customers on 20A that seemed, I don't know, from the language used, kind of meaningful. So if you could give us a status report there on sort of the gate all-around RibbonFET progress you see versus competition? And is this external customer really significant? Thank you.\n\nPat Gelsinger -- Chief Executive Officer\n\nYeah. Thank you. And on 20A and 18A, they go to RibbonFET, as you say. And Intel has driven every major transistor, right, in the volume production for the last 35 years.\n\nSo the idea that we're the ones who are going to drive this major new transistor structure into production is something that we're pretty committed to be a driver for 20A, as you said, on track, on schedule. We expect 20A will primarily be an internal node, not one that we have a lot of external foundry customers for the external foundry chipset or tape-outs are largely associated with 18A. And a very typical process for a foundry customer will be give me a test chip of my circuits on your process. and that's exactly what we take out.\n\nThe first one this quarter. We'll have several more in the pipeline. So now we're taking out not only our test chips for 18A, but our foundry customer test chips for 18A, and that's a pretty critical milestone when they see the results of the silicon for them making a volume decision for a foundry customer. So we're exactly on the time line that I described earlier for those tape-outs and those decisions.\n\nSo as they start to see the silicon results, which we think are going to be very promising we think that will be a key step to them making major foundry decisions. And overall, this just affirms our five nodes in four years. We're making the investments. We're seeing good progress to get back to process technology leadership, which for Intel is a tide that raises all boats in the company.\n\nIt makes our products better. It establishes our new business areas, positions us in a very profound way for foundry [Technical difficulty] economic environment. Macro, very challenged, but we're happy with the execution progress we made even though we're not happy with the reported results. And we know we have a lot more work to do there.\n\nIt was also thrilling to participate with the Mobileye IPO in a tough market with very good results. We're prepared for the economic headwinds. We're making the necessary adjustments structurally, as well as through our cost model to go through them. And we remain fully committed to being a value generator for our shareholders for the long term as we execute our 2.0.\n\nWe believe that that will be a great result for our owners for the long term. Thank you for joining us for the call today and look forward to our update next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJohn Pitzer -- Corporate Vice President of Investor Relations\n\nPat Gelsinger -- Chief Executive Officer\n\nDave Zinsner -- Chief Financial Officer\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nTim Arcuri -- UBS -- Analyst\n\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\n\nPierre Ferragu -- New Street Research -- Analyst\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nMark Lipacis -- Jefferies -- Analyst\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nMore INTC analysis\n\nAll earnings call transcripts"
}