{
  "companyName": "Blink Charging Co",
  "companyTicker": "BLNK",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/blink-charging-co-blnk-q2-2022-earnings-call-trans/",
  "content": "Blink Charging Co (BLNK 7.66%)\nQ2 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Blink Charging's second quarter 2022 earnings conference call. All participants are in listen-only mode, and there will be an opportunity for analysts to ask questions at the end of today's presentation. [Operator instructions]. Please note this conference is being recorded.\n\nA replay of this call will be available on the investor relations page of the company's website. At this time, I'd like to turn the presentation over to Vitalie Stelea, vice president of investor relations.\n\nVitalie Stelea -- Vice President, Investor Relations\n\nThank you, Ali. Welcome to Blink's second quarter 2022 earnings call. On the call today, we have Michael Farkas, chairman and chief executive officer; Brendan Jones, president; and Michael Rama, chief financial officer. Today's discussions will include non-GAAP references.\n\nThese are reconciled to the most comparable U.S. GAAP measures in the appendix of our earnings deck. You can find the deck along with the rest of our earnings materials and other important content on Blink's investor relations website. Please note today's discussion may also include forward-looking statements about our expectations.\n\nActual results may differ from those stated. The most significant factors that could cause actual results to differ are included on Page 2 of the second quarter earnings deck. Unless otherwise noted, all comparisons are year-over-year. And now regarding our [Inaudible] calendar, we have two upcoming engagements.\n\nOn August 10th, Michael Farkas, chairman and founder will present at the JPMorgan Auto Conference in New York. And on September 7th, Blink will participate at the Barclays, CEO Energy Power Conference, also in New York City. And now I will turn the call over to Michael Farkas, founder and CEO of Blink Charging. Go ahead, Michael.\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nGood afternoon, everyone. Thank you for joining us. We delivered a very strong second quarter of 2022, highlighted by record revenue of $11.5 million, an increase of over 164% over the second quarter of 2021. It is very important to note here that from an organic growth perspective, excluding 2022 acquisitions, our second quarter revenue doubled on a year-over-year basis, which proves that we have a solid strategy and robust growth on both our owner-operator side and the ancillary sales models.\n\nDuring the second quarter, our product sales grew by 170%. Service revenue grew by 155%, and recurring network fees grew by nearly 350%. Our record second quarter results are reflective of our strong fundamentals as these results do not, and I repeat, do not yet fully reflect the integration of our recent acquisitions of SemaConnect, and EV charging. In fact, our second quarter results include only half of a month of Sema's financials since this transaction closed on June 15th.\n\nGoing forward, the recent acquisitions will only accelerate our momentum in sales, network expansion and product development. In the quarter, we contracted shoulder deployed 5,630 commercial and residential chargers, an increase of 73% same quarter last year. During the same period, Blink was awarded an additional $2 million through various [Technical Difficulty] and $32 million since the beginning of 2021. In addition, we are extremely encouraged by yesterday's passage of the Inflation Reduction Act in the Senate.\n\nWe believe that the act's provisions for consumer incentives for both new and used electric vehicles, conversion of government fleet's to EVs, and its favorable tax and capex implications will contribute to a faster transition to electric transportation, resulting in higher demand for EV charging infrastructure. This aligns well with Blink's strategy and our future growth plans. On slide five is the most important highlight of this quarter, which is Blink's acquisition of SemaConnect. The combination of Blink and Sema creates a powerhouse of the charging industry, taking over 12,800 active chargers and 151,000 registered users to Blink's portfolio of chargers.\n\nAnd as importantly, this acquisition provides Blink with vertically integrated manufacturing capabilities in the US, which instantly qualifies Blink for the Buy American mandate within the Biden administration's $7.5 billion EV charging investment plan. Sema's large portfolio of technology and intellectual property includes Level 3 DC fast chargers, which significantly accelerates Blink's go-to-market strategy in the fast charging DC space. And financially, Sema has one of the highest, if not the highest margin profiles in the industry with a strong recurring sales and cash flow model and multiple revenue streams. We are very pleased with this acquisition and look forward to continuing the integration of Sema into the Blink family.\n\nMahi Reddy, founder and chief executive officer of SemaConnect, joined the Blink board of directors recently, a great addition, which will positively impact the integration process. On Page 6, you can see that SemaConnect acquisition was preceded by two other very important transactions. In April of 2022, we closed the EB Charging acquisition in the UK, giving us access to the UK and Ireland markets and adding nearly 1,200 chargers to Blink's global footprint. As a part of that transaction, the acquired confirmed order book of about $16 million, which is being fulfilled as we speak.\n\nPrior to that, in May 2021, we acquired Blue Corner in Continental Europe, establishing initial presence there, with plans to grow significantly in the fast-growing European market. This includes countries such as Belgium, Netherlands, France, among many others. Our strategy is paying off, as demonstrated by the recently announced agreements with Q-Park to deploy nearly 600 chargers across 80 sites in the UK and Ireland. Q-Park is one of the three largest providers of parking facilities in Western Europe.\n\nSo we're extremely excited about this new partnership. Blink's strategic and organic growth has contributed to our fast global expansion. As you can see on slide seven, our network has already established on three continents and key markets with a niche, and we are looking to spend further from here. We think that there is significant opportunity ahead for Blink, because of our equipment, our new and updated soon-to-be revealed software and our network are compatible with the charging infrastructure in most places on the globe.\n\nCombined with strong projected growth rates in EV penetration and EV infrastructure needs, we've seen bank is very well positioned for substantial organic and strategic growth. In fact, a recent study from McKenzie published in April of this year, argues that the United States alone could have 48 million EVs on the road by 2030, 48 million. And globally, Bloomberg new energy finance recently pointed the need of between 340 million to 450 million charges by 2040. I'm going to repeat that.\n\n340 million to 490 million chargers. It's massive. And interestingly, when you think about only 3% of those are projected to be superchargers. Blink is positioned to take advantage of this incredible growth environment due to our strong value proposition.\n\nAs you can see on Page 8, we believe Blink has the most advanced technology in the market right now, with strong intellectual property and vertical integration capabilities globally. We offer multiple business models to our customers for them to choose how they want to deploy their capital anywhere from full ownership to no capital requirement and a minimal involvement. And we have an extremely large footprint that we believe will only keep growing at a very, very accelerated pace. Nine, another thing that I'm tremendously excited about is Blink's new global framework empowered by our recent acquisitions, which we believe is a game changer in the EV charging industry.\n\nBesides having manufacturing capabilities in the US, India and Taiwan, our international network and portfolio of equipment is earned power today. Anywhere from New York to Brussels, Tel Aviv, London, even to Guam, you can use the same [Inaudible] network and branded chargers in six languages, 19 currencies across 21 countries, and we're only getting started. We have a lot of other countries and many more features to follow. In essence, whether we own and operate or sell the hardware, bring strives to deliver best-in-class products and services globally.\n\nThis is what enables a faster transition to EVs and what helps our customers and site hosts to make the switch to EVs and to Blink. With that, I'll turn the call over to Brendan Jones, president of Blink to discuss some of our recent developments.\n\nBrendan Jones -- President\n\nThanks, Michael, and good afternoon to everyone. As Michael talked about, it has been a very important and exciting quarter for Blink. We're going to begin with Slide 11 and not only in the last quarter, did we have strong financial performance driven by solid fundamentals. But we also accomplished the acquisitions of EV charging and SemaConnect.\n\nIf we talk just in EV charging in the UK, it has a unique business model for the owner-operator side of the business. We're typically in the UK, we are able to get 80% of the capex covered by government entities. This is particularly attractive to us especially since the UK government recently increased its commitment for the number of chargers by tenfold to 100,000 by the end of the decade. Alongside of this, the government is committed to 1.6 billion pounds to increase public EV infrastructure.\n\nThe acquisition of EV charging will allow Blink to tap into the opportunities for growth and increase its footprint across Europe, by leveraging synergies with Blue Corner or other European entity in Continental Europe. Now adding to that synergy, the SemaConnect acquisition brings Blink unmatched speed to market, reduce cost, lower expenses, revenue growth, and flexibility. It is another step toward our vision of creating the leading global electric vehicle charging ecosystem. It added thousands of chargers and registered users to the Blink portfolio while further enhancing our comprehensive suite of smart hardware and software solutions for both retail and commercial applications.\n\nAnd we cannot say enough about the talented individuals at SemaConnect and the industry knowledge they bring to Blink. We have essentially doubled our headcount through this acquisition. If we transition now look at Slide 12. As the world continues to struggle with broken supply chains and chip shortages, SemaConnect vertical integration is key to achieving end-to-end design in in-house manufacturing.\n\nIt will allow us to control the timeline for delivering a product that will satisfy multiple customer demands. And these will effectively contribute to better cost management and industry-leading margins. We also believe that the in-house manufacturing capacity will be key to leading increased demand. In the United States, in particular, SemaConnect's manufacturing facility in Bowie, Maryland, allows us to become by America compliant while we get to control the IP and the quality as well as the future ramp-up in capacity.\n\nSame also applies to our manufacturing facility in India. As we combine our complementary in-house engineering and software capabilities, we will be looking to leverage economies of scale across the board. As a matter of fact, we are already doing it. Our sales teams have started working hand-in-hand and addressing opportunities as one team, complementing each other's lead generation and product offerings.\n\nIf we flip now to Slide 13, when it comes to synergies on the revenue side, our plan includes upgrading existing SemaConnect customers to new Level 2 Blink chargers and transitioning them to the new Blink network. The hardware and accessories we revealed at CES this year have achieved great reviews from our existing customers. As a result, we are also looking to increase the number of chargers at high utilization SemaConnect sites, thus increasing hardware revenue, each incremental chargers sold. As we evaluate each site and our relationship with those new owners, we plan on providing SemaConnect customers with the option to switch to the hybrid revenue model thus increasing the LTV per charter by about 10 to 15 times.\n\nWe believe this will be a win-win situation, especially with customers who are looking to ease the cost of owning and operating a charging site. And besides the revenue synergies, we believe we have multiple opportunities on the cost side in both cost optimization, revenue, expense avoidance and cost reduction. When it comes to hardware, we'll be leveraging SemaConnect's low-cost manufacturing capabilities with a targeted cost reduction per unit of approximately 30%. I will say that again, 30% cost reduction.\n\nThis is significant. This is a decrease from our current costs. Regarding talent, we are very excited to welcome SemaConnect employees to the Blink family and scale these talented team members across the entire organization. More than one-fourth of semi connect employees are highly skilled engineers with complementary skill sets to what we have today.\n\nAnd last but definitely not least, we plan to optimize our sales and customer service efforts to leverage scale and deliver the best quality of service and sales experience in the EV industry today. If we transition to Slide 14 now, within the last one month, Blink has contracted, sold, deployed or acquired over 5,631 charters, both domestically and international, bringing the total charter count for the company to over 51,000 since Blink's inception, which also includes the SemaConnect charges. We have a healthy mix of deployments in the United States and abroad with 74% of the total companywide Blink chargers deployed in North America and 26% deployed internationally. Consumer demand for electric vehicles is steadily increasing, and the forecast from reputable thought leaders looks very optimistic, as Michael outlined earlier.\n\nWhen it comes to growth in charging infrastructure, our global network of chargers has kindly expanded quarter-over-quarter, and we expect this to continue well into the future. On slide 15, as you can see from the logos and verticals, this is a very comprehensive list and speaks to the breadth and depth of our products and services. We've won numerous multi-year contracts with a variety of well-respected commercial enterprises, healthcare facilities, multifamily complexes, plan communities and municipalities. SemaConnect equally comprehensive portfolio significantly complement Blink.\n\nIn fact, we are seeing tremendous opportunities to grow our customer base in the near future. If we move over to slide 16, this gives us an overview of our stations deployed in key geographic locations throughout the United States and Europe. As you can see, with the SemaConnect acquisition, our customer base has expanded significantly to over 423,000 drivers registered within our portfolio of targets. We have offices in nine locations across five countries, serving customers in more than 21 countries.\n\nInternationally, we are building the momentum achieved by Blue Corner and combined with our recent acquisition of EV charging. On Slide 17, just to remind everyone, we have launched and we'll be launching several exciting products in 2022, including Blink's advanced fleet management software and the accompanying mobile app designed to be used with the advanced MQ 200 hardware. MQ 200 was launched this past quarter and the initial feedback is very positive. The combination of hardware and software will provide a 360-degree fleet ecosystem.\n\nMoreover, we are preparing for the launch of an entirely redesigned Blink mobile app and cloud application, which is based on the latest tech stack and will make EV charging even more easier for drivers and operators. We are excited about the innovative Vision charger designed for the retail location, which has now been completely redesigned as can be seen on slide 17. In addition to that, the HQ200 is a residential charger which is fully networked and will allow customers to stay within the Blink network even in their home. And also as important, the newly added Series 8 family of chargers, which allows customers to use their credit card to pay for service, which is, in fact, a requirement effective January 1st, 2023 for retail and public locations in California.\n\nOverall, we have a comprehensive portfolio of charging solutions to fit the needs of any customers, public or private with the capability to penetrate numerous different markets. If we now go to Slide 18, this provides an overview of the historic $1.2 trillion federal infrastructure bill that includes an estimated $7.5 billion to be used for building the nationwide infrastructure to support the anticipated growth in the adoption of electric vehicles. Since January 2021, Blink has been awarded $32 million in grants from several different state organizations. We now have a tremendous opportunity to add to this number by capturing as much as possible of the $17.5 billion, and aid in the expansion of our charging footprint.\n\nIf we now flip to Slide 19, this shows some one of our big wins. Our business development teams from Blink, SemaConnect, Blue Corner, and EB are working together to develop and close deals across a large spectrum of customers, anywhere from established auto OEMs and suppliers to large real estate developments and management firms to local government fleets to retail and entertainment company among many others. On the government side, two recent examples of purchasing agreements with two governmental organizations; our Region 1 Planning Council in Northern Illinois and Florida Sheriffs Association Cooperative Purchasing Program. The Northern Illinois Council of Government helps local governments and agencies save time and money by leveraging the buying power of its 20-plus members within six county jurisdictions.\n\nThe contract for EV charging equipment services for up to 10 years will enable members of R1's council governments to participate under any of Blink's deployment model with favorable negotiated terms as awarded. The initial plan estimates up to 700 charging stations to be installed over the term of the purchasing agreement. Also in January, we announced -- in July, excuse me, we announced a successful contract award with the Florida Sheriffs Association Cooperative Purchasing Program as an official vendor for electric vehicle stations. CPP vendor's Blink products will be made available to CPP participants providing them with direct access to Blink EV charging stations.\n\nBlink now has the potential to reach and contract with thousands of state and local agencies, municipalities and educational organizations across Florida. All in all, we are very, very pleased with our performance in the second quarter. Our fundamentals are strong, as we delivered record financial performance in Q2, even without realizing the full benefit and synergies from recent acquisitions. The SemaConnect acquisition is transformational for Blink.\n\nWe not only doubled the size of our employee base with some of the best talent in the industry, but acquired key manufacturing capabilities and product know-how that positions us to continue to grow and benefit from the $7.5 billion infrastructure plan. We are excited for what's next for blank. And now I will turn it over to our CFO, Michael Rama, to run through some of the specific results for the quarter. Go ahead, Michael.\n\nMichael Rama -- Chief Financial Officer\n\nThank you, Brendan, and good afternoon, everyone. Turning to slide 21. Total revenue in the second quarter of 2022 grew to $11.5 million, another record for the company and an increase of 164% compared to the second quarter of 2021. Excluding the 2022 acquisitions, our revenues for the second quarter of 2022 doubled, which demonstrates the solid fundamentals of Blink's business and strong customer demand.\n\nWe are at a point in the industry where more and more consumers are choosing EVs for their transportation needs, and Blink provides the flexibility helping site hosts and consumers make the switch. Year-to-date through June 30, 2022, our total revenues were $21.3 million compared to $6.6 million for the first six months of 2021. What's noteworthy here is that our year-to-date revenues through June 2022 have already surpassed total revenues of $20.9 million for all of 2021. Product sales in the second quarter of 2022 were $8.8 million, an increase of 170% over the same period in 2021, as customers purchase greater volumes of our commercial chargers, DC fast chargers and residential chargers.\n\nSecond quarter 2022 service revenues, which consists of charging service revenues, network fees and ridesharing service revenues were $1.5 million, an increase of 155% compared to the second quarter of 2021. The year-over-year growth is primarily due to the increased utilization of our chargers and an increased number of chargers in Blink's networks. As you know, we combined these three service revenue line items into one amount to differentiate between the product and service aspects of our business. And this approach also aligns with our company's strategic goal of increasing the services component of our revenue mix and growing our recurring revenue base.\n\nIn time, as EV adoption accelerates and utilization by our charging stations increases, we anticipate seeing a larger mix of revenues come from services. Gross profit for the second quarter of 2022 was approximately $2 million, an increase of 204% over the same period of last year. We continue to look at ways to drive higher margins, especially in light of ongoing supply chain disruptions occurring globally. Now operating expenses in the second quarter of 2022 were $23.9 million, compared to $13 million in the prior year period.\n\nThis increase reflects acquisition-related expenses of approximately $3 million associated with the acquisitions of SemaConnect and EB. It also reflects higher expenses in the areas of accounting, legal, marketing, investor relations and consulting. Also included in the operating expenses for the second quarter of 2022, is increased amortization of intangible assets associated with the acquisitions of SemaConnect and EB. This expense will continue, but is noncash in nature.\n\nFurthermore, the increase in operating expenses includes operating expenses from Semi Connect and EB that were not included in the results for the second quarter of 2021. Because we strive to deliver best-in-class products and solutions, we continue to recruit talented individuals that will contribute to our company's growth and success. Many of those individuals participate in the research and development activity that will ensure that our products, software and innovative solutions remain above competition. In 2021, we began presenting adjusted EBITDA.\n\nOur management team believes this non-GAAP measure is useful in evaluating our company's core operating performance because it excludes items that are either on nonrecurring or significant noncash items. Adjusted EBITDA for the second quarter of 2022 was a loss of $15.6 million, compared to a loss of $8 million in the prior year period due to the previously -- higher previously mentioned operating expenses. Adjusted EBITDA as a percentage of revenues for the second quarter of 2022 improved 49 basis points, compared to the second quarter of 2021 and for the year has improved 88 basis points. This quarter, we are also introducing the non-GAAP measure adjusted earnings per share which is earnings per share, excluding significant noncash items such as amortization of intangible assets and nonrecurring expenses, such as acquisition-related expenses.\n\nAdjusted earnings per share for the second quarter of 2022 was a loss of $0.41 per diluted share compared to a loss of $0.31 in the prior year period. Now turn to Slide 22. Our revenues and gross profit performed well in the second quarter of 2022, continuing the upward trend that we've seen over the past several quarters now. As we execute on our flexible solutions of owner-operator strategy and selling of hardware.\n\nWe believe that we are well positioned to continue driving increased revenues and gross profit moving forward. Moving to our cash position at June 30, 2022, the company had approximately $85 million of cash compared to $175 million at the end of 2021. We believe we have sufficient cash on hand to fund our current operations. We are pleased with the second quarter of 2022, as we recorded another record quarter.\n\nThese improvements in our operating results are a direct reflection of the solid foundation we've built over the past several years and we believe we're well positioned to capitalize on the numerous opportunities and increased focus being placed on the EV industry. I will now turn the call back over to Michael Farkas for a few final comments. Michael?\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nYes. Hello, can you hear me?\n\nMichael Rama -- Chief Financial Officer\n\nGo ahead, Mike.\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nSecond quarter of 2022 was a transformational quarter for Blink. Not only did our second quarter revenue double organically year-over-year, but we closed on two significant acquisitions that position Blink well to take advantage of the rapid industry growth. We are very excited to integrate EB and Sema into the Blink family, and we continue to expand on our hardware and software solutions globally. With that, we will now open the call for questions.\n\nOperator\n\nLadies and gentlemen, the floor is now open for questions. [Operator instructions]. Your first question is coming from Matt Summerville with D.A. Davidson.\n\nPlease pose your question.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nThanks. Good evening. A couple of questions. I want to start with the core business.\n\nCan you give us some sort of idea when you look organically, how much revenue is being derived on a quarterly basis from new customers versus those we buying from them.\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nMike, jump on that one or --\n\nMichael Rama -- Chief Financial Officer\n\nYes, that would be fine.\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nYes. No, obviously -- Matt, thanks for joining. Organically, we're seeing recurring nature of our revenues from our customers, the good we have big customers that we've -- OEMs and the many partners that we've had organically, they continue to buy, obviously, the chargers, they're deploying into dealerships. So it's a continuous stream, but we're also adding new customers and new opportunities across the board.\n\nSo organically, obviously, as we mentioned in our comments, we doubled our revenues quarter-over-quarter, excluding the acquisitions, and we continue to see more -- obviously, our customers recurring, but also new ones added to the mix.\n\nMichael Rama -- Chief Financial Officer\n\nI'll add to that a little bit. We do see a lot of new customers. Obviously, there have been a lot of property owners that have been sitting on the sidelines waiting to see more traction in the EV space. There's no longer a question of whether or not EVs are going to be the mode of transportation moving forward.\n\nSo there's a lot more of those that have sat on the fence, I'm now putting in orders and looking at it across the portfolio of properties. There was literally one of the major developers, New York has been sitting for years looking at EV and now we were able to put in 50 units or so in some of their locations throughout the five borrowers. So we're seeing guys that have been sitting on the fence, and we're seeing a lot more customers who have EV charging in their locations of meeting or such a great combination of both new business and recurring.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nGot it. And then this one maybe a little bit more for Brendan, but I was curious, you mentioned in your prepared remarks that Sema will provide a basis by which you can reduce your cost of goods sold, I believe you said by 30 percentage points. Is there a way to sort of break that out a little bit, Brendan, in terms of how much may be coming from labor versus supply chain/procurement? How should we be thinking about what sort of underpins that 30 percentage points?\n\nBrendan Jones -- President\n\nYeah. Well, obviously, we're not going to break it out by dollar amount, but it's a combination of both labor and the manufacturing type of the charger and being direct. As you imagine, if you look at our current portfolio of charges without SemaConnect, some of that is -- it's our design. It's full contract manufacturing, meaning new contracts, our design, we are telling how we want to build and then they build it, right? But SemaConnect that model flips.\n\nIt is our design again. However, it's our technicians and everyone who is building it from the ground up. They are our employees, they are not contract employee. It's our manufacturing facilities, not contractors.\n\nWe're not selling from one entity the other to create a margin, so all that creates a reduced cost for us to be able to sell. And then when we combine those two systems together, even on Blink product, that's going to give us a reduced cost.\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nThanks. I'll get back in queue.\n\nOperator\n\nThank you. Our next question is coming from Stephen Gengaro with Stifel. Please pose your question.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nThanks. Good afternoon, everybody. Two things for me. The first, when you talk about the deployed and sold units, I think there's like 51,000.\n\nCan you give us a sense for how many of those are revenue generating assets for you from a service revenue perspective, from a charging perspective?\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nI'll jump in. There's about -- there's quite a few -- obviously, this includes all our networks. I just want to be clear that the 51,000 that includes between our core Blink, the Blue Corner that we acquired EV, as well as SemaConnect. So a lot of what's acquired through EV and SemaConnect already are networked on their systems.\n\nAnd then so probably good -- of the 51,000 probably good two-thirds maybe is our network, some sort of a network that we're in the process of combining, and that we'll see synergies on that as we move forward through integrations.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nOK. I'm trying to backfill and trying to figure out how to think about utilization and ultimately what kind of revenue per deploy chargers we can think about on the charging revenue line, right? And I was just try and see if there's any way to -- any color you could add to that?\n\nMichael Rama -- Chief Financial Officer\n\nWell, obviously, there are different business models that we have and some of the companies that we acquired really sold hardware, and we're now going to start introducing -- using our own and operating model on some of these companies we acquired. Our own and operated model has a much more robust potential for revenues than just having a charging station that we sold to a third-party and it's on our network, we get a few dollars a month for it. So again, we believe long-term, as more and more EVs on the road, utilization picks up. And as that happens, these charging stations become potentially very, very, very profitable.\n\nSo as things progress, as we integrate these networks together, we're going to have a very, very nice mix of different products and services. Some of it will be monthly connectivity fees and processing fees and not much on the sale of the energy, similar to charge points model. Again, that's part of what we do as well. But our thought is here is really to try to own and operate as many of the charging stations as possible.\n\nAnd I'm sure you've run the models and seen how potentially profitable essentially the Level 2 charging stations can be once around the field. So, as things progress and as this integration takes place, we'll be able to give a lot more visibility on that.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you. And then just one other one. You started providing us with sort of the adjusted EBITDA numbers recently, I think it was last quarter or the quarter before.\n\nAnd I was just curious, by doing that, you, in some way, suggests to me that your -- that number is headed toward breakeven/positive territory at some point, and it's a good measure of sort of progress for you as we look forward. Any guidance on sort of when we would see EBITDA get to the breakeven level?\n\nMichael Rama -- Chief Financial Officer\n\nWe look at that continuously. Obviously, we've been focused on investing in the business, obviously driving topline revenue. And then obviously, as we start going through the integration and synergies with the recent acquisitions, I get -- we target and we have a target and a goal. The first is to reduce the EBITDA losses and then we get it could be a couple of years out.\n\nSo -- but we're mindful. We want to be proactive. We will be making a lot of efforts over the next 12 months as we're integrating the acquisitions to really -- I like to call it drop down to some of the wood, right? So, but it's a high priority of all of ours and our initiatives.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you. It seems like a lot of good --\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nI'd like to add to that a little bit. Operating and developing technology in our space is not inexpensive. And having four companies being able to share on footprint, one customer service, one back end, one mobile application. There are going to be tremendous economies of scale integrating all these companies and these networks.\n\nA lot of savings, a lot of really the features that we're combining from the different networks. So, there's some really interesting and good times ahead of us. And to this role, we are, as Michael mentioned, we're looking to sharpen the pencils and really start focusing on chopping the wood and getting rid of expenses that are unnecessary. And there's a bunch of them now that we have overlaps.\n\nSo, it's really a great opportunity for us.\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you for the color, gentlemen.\n\nOperator\n\nThank you. Our next question is coming from Chris Souther with B. Riley. Please pose your question.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nHey, thanks for taking my question you guys. Given all the moving pieces with EB and half a month of Sema financials, could you give us a sense of what the run rate would have looked like had SemaConnect been in the business for the full quarter. I just wanted to get a sense of what the revenue run rate from SemaConnect and EV would have looked like on a pro forma basis for revenue as well as kind of gross margins for that product sales segment and a better sense of the opex and rate you should expect going forward after we add those and back out some of those acquisition expenses? Thanks.\n\nPerfect. Yes. No, that is very helpful. Maybe just on the gross margin piece then, given you've talked about SemaConnect having a really strong gross margin profile.\n\nI wanted to get a sense of where that would have stood, if you could?\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nWe didn't get that granular, to be honest, obviously, because some moving parts and synergies and -- but obviously, we look at that as -- I look at as upside from us from a post acquisition that we would realize going forward.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nOK. That's great to hear. And in any sense if you could kind of quantify the revenue opportunity as well as the cost side of upgrading SemaConnect's existing footprint. Sure its early days kind of working through conversations with some of those customers to the Blink owner model and as well as expanding footprint at some of those sites, but just wanted to get a sense of, if you could quantify what that opportunity looks like, just with the existing footprint over the next year or three years or kind of the road map there?\n\nBrendan Jones -- President\n\nSo let me jump in and answer this one. So we're cracking the numbers on that as we speak. So far, they're very promising. As some of you might know, we contracted with McKinsey Group to do two things.\n\nFirst, the initial synergies analysis between the organizations and then second, the road map to achieving those with definitive numbers and a plan to be implemented to achieve that. We're in the final stages now of validating the numbers, and then we're going to kick off the plan. So as soon as we validate those numbers, we can make them available. But at this point, we need one or two more weeks to get those.\n\nBut the big number is, it's very lucrative, both in the revenue enhancement thesis and in the cost of voidance pieces. Michael, you want to add any clarity to that?\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nNo, I'm fine.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nGot it. And maybe my last one here. Could you give us a sense -- I understand kind of with the large Blink network base, a lot of the acquisitions were going to strip product sales. I want to get a sense of the mix more recently, like this past quarter, even if you could, between owner-operated, commercial residential sales of the deployment.\n\nIt seems like we're getting really good momentum on the product side, even before SemaConnect, so maybe just -- I think you've kind of given a clear like, hey, where long term you think that mix sounds like it should -- you think it will be going, but curious where it is today and kind of the next couple of quarters based on what visibility you do have.\n\nMichael Rama -- Chief Financial Officer\n\nBrendan?\n\nBrendan Jones -- President\n\nIs that one going to me? I'm sorry, I thought Michael -- it was about the mix of sales and revenue. Mike, are you --\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nYes. I guess, on the sales, right, side of it. So, obviously, you could still see we're still -- we're generating about 75% of our revenue is still coming from the product side of it. But we're still again across the board looking at, when we contracted, we're still looking at a pretty good even split between owner/operator and hardware sales, so -- as we move forward.\n\nSo again, it takes a little bit more time, obviously, as the service revenues, as you get them deployed and start realizing and as the utilization start to really kick in that's where we're going to start seeing the -- as we saw the call it, the turn toward -- more toward service revenues as opposed to the product mix, if you will. But the sales have been pretty mixed right -- pretty close to 50-50 on the sales versus owner operated type sales.\n\nChris Souther -- B. Riley Financial -- Analyst\n\nOK. That's helpful. I'll hop back in the queue. Thanks, guys.\n\nOperator\n\nThank you. Our next question is coming from Oliver Huang with Tudor Pickering Holt. Please pose your question.\n\nOliver Huang -- Tudor, Pickering, Holt and Company -- Analyst\n\nGood afternoon, and thanks for taking my question. First one, just on the compensation and G&A line items. The quarterly increase understandably is coming from growing the business in addition to acquisitions and acquisition-related costs. But I was wondering if there is any incremental color on how we should be thinking about the run rate for each of those line items, especially with the comment of doubling the headcount from the Sema acquisition over, call it, the next 12 months or so?\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nWell, and obviously, we'll see that accelerate a little bit, right, not to the June, remember, it's going to be relative to the acquisition side. from the SemaConnect standpoint. Some we'll be able to give a bit more color coming on later this month to that because we're actually going to be filing the proforma financials with SemaConnect toward the end of the month. So that's from an acquisition standpoint.\n\nSo, we'll be able to provide a bit more color on some of that. But obviously, there will be an increase in the salaries. But that's not going to account consider any synergies that, as Brandan mentioned, that's going to be developed that we're going to work through as well as the scale that we're going to have that will relate to the increased volume that we anticipate.\n\nOliver Huang -- Tudor, Pickering, Holt and Company -- Analyst\n\nOK. Thank you. And for a second question, I was just wondering on the manufacturing facility, is there a timeline in terms of being able to expand that facility from the 10,000 to 50,000 units? And in terms of going beyond that, is there any sort of rule of thumb in terms of how we should be thinking about costs? And what -- how long such a buildout would kind of take?\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nThe timeline is being established now. So, we're not ready for primetime, but we'll have it within the next two to three weeks. The cost is low. So first, when we're going up over a period of time getting up to, let's call it, the 40,000-unit mark.\n\nAnd that's coming out of our facility in India and -- facility in India is basically manufacturing the parts and the facility in Bengaluru is assembling the chargers is the way to look at it. So the first aspect of that, we're going to be able to do with shift -- added shifts from going from one to two to three shifts. Then the second stage of that is cruising the line capacity out of our building three and four there in India and then increasing the capacity out of SemaConnect in Bengaluru by adding additional shifts there as well. So, first stage added shifts, up capacity second stage add some tables and tooling.\n\nIn the original estimate, the tooling and cable adds are very low in comparison. So we're not looking at a massive capex to get it expanded out. We're looking at additional shifts, primarily and some minor upgrades and tooling and equipment in order to get there. We'll have more definitive data out in the next two to three weeks as we finalize the synergy plan.\n\nOliver Huang -- Tudor, Pickering, Holt and Company -- Analyst\n\nOK. Perfect. That's helpful. Thanks for the time.\n\nOperator\n\nThank you, ladies and gentlemen. Our next question is coming from Noel Parks with Tuohy Brothers. Please pose your question.\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nHi. Good afternoon. [Inaudible] by you. I guess, just a reality check.\n\nCan you ballpark how many models -- in other words, ones that you plans to either have going live or are going to continue to win production? Will the combined companies have that they'll be selling. I imagine there's going to be some rationalization, some overlaps where you'll favor one company is existing model from another?\n\nBrendan Jones -- President\n\nYes, sure. I can touch on it briefly. So the product what we're calling the product rationalization study, it's in its second phase. So in the first phase, we reviewed all the products.\n\nWe looked at COGS, production capacity acceptance in the market, all the revenue data you want to look at. Now we're going to go to the second phase of that is, OK, what do we move forward with and what we do. There's some favorites identified within that but also there's nuances. And we mentioned earlier the Series 8 charter, which has a credit card reader already built into it, which is unique because it's not a slap-on version of a credit card.\n\nThat is going to be Blink SemaConnect combined together charger for sale in California for all publicly accessible places because in 2023, beginning in January, that's the only charger you can install there as a result of California mandate on that topic. Then we're going to continue to rationalize that portfolio out. And we're going to combine together, now down the road in the future, we'll talk about the different changes to look and feel and everything. But we got about a week or less in that rationalization study.\n\nIt's along with all the other synergy products we're going through. First review look great. And the idea is on making sure we can get the right amount of the product, the highest-quality product at the right cost of goods sold out to the public. And as you know, we're going to be hesitant at first to shutting off any one of our producers of chargers because chargers are in demand right now.\n\nMost manufacturers cannot deliver upon the orders that they have today. So there will be a degree of running parallel to make sure we can fulfill the backlog of orders we have.\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nI do want to add to that a bit. This is Michael Farkas. It's very important for us not only to trim our product line to make sure it satisfies our customer base, but really what we call Gen 3 and that's really the combined integration of Sema's trends and Blink's strengths and having that hardware fill that role. So while we're already on Gen 2, and we have amazing equipment across the board, we do look toward the future.\n\nAnd that future is going to be where we're going to receive really just tremendous amounts of benefit from the integration of the companies, so there's tremendous savings today, great product line. And as Brendan mentioned, the requirements in California is not only California, have a credit card swipe on those charges. There are many other states that follow exactly what California does. One of the attractive things about Sema was the fact that they had a product readily available to meet those needs in California, and there are very, very few, if any, of our competitors that can fulfill those requirements.\n\nSo we have a major, major advantage from most of our competitors in that regard.\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nThat's interesting. I wasn't aware of that.\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nAnd it's interesting, it's very interesting because people look at the transaction that we had with Sema, and the purchase price was $200 million, but people aren't really familiar with the fact that one of the largest investment banks in the world was going to do a $2 billion pre-money deal on Sema when the markets were at its height. So I agree with you, those were very, very frothy valuations, but at the bottom line, when you look at how we purchase companies in the past, we've always bought them for very good pricing. And we really look at the deal, although again, the valuations are the faster not the valuations of today, being able to buy a company for 10% of the value at a Goldman Sachs or the world was willing to offer them, we were able to take advantage of market timing as well as all the amazing things that Sema brings. It's another transaction that Street today just doesn't really fully value.\n\nVery, very similar to the acquisition we had in Europe, stand-alone on its -- if it's standing on its own two feet, the market would value our company at $1 billion and change. But being a part of Blink, we still have not received that value, really look at us according to some of our competitors, EVgo and ChargePoint and they have many multiples of our market cap. But we own and operate where some of them don't, and we have thousands or tens of thousands of charging stations in the ground, and they're 10% of our size with maybe two or three times our market cap. So again, I think when the Street really fully realizes the acquisitions that we've made and what their independent individual value it puts them together with Blink, I think that there will be a repricing and --\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nRight. So I absolutely agree. There's disconnect there. I guess, one thing I want to ask about just on the ground with the current Sema business.\n\nCan you just talk a little bit about what the logistics and maybe if you can even speak a bit to the cost of their maintenance, repair, module replacement or equipment upgrade cycles like, just curious, are there expenses in those lines pretty similar, analogous to yours, different in some ways, I don't know, because of regulation or anything?\n\nMichael Rama -- Chief Financial Officer\n\nI would say very different. And the reason why is as an owner and operator, you have a different philosophy in developing hardware. Our competitors, which none them own and operate the charging infrastructure after it's sold, they build equipment with upgrades built in that's their model. I mean like a cellphone.\n\nWe look at our equipment like a hot water heater or a refrigerator, and we wanted to last many, many, many years without upgrade cycles. And if there has to be an upgrade cycle, we don't want to have to rip out the entire machine. We want to be able to use that machine and maybe change the modem or change an RFID card and those things change. Obsolescence is extremely important to us.\n\nOur competitors, it is to them as well, but what their philosophy is they want a unit to become obsolete, and we don't. So our business is to have those units in the field as long as possible because we're going to generate the money off of the sale of the electricity through those charging stations. So, there's a reason why General Motors selected our hardware to be in their dealerships. There's a reason why Subaru did.\n\nThere's a reason why Audi did. These are industry veterans that literally benchmark all of this hardware against each other. This is not just some property owner that doesn't know what they're doing it you rip these things apart and there's a reason why -- some of the biggest investors in EV are using our charging stations. And this is not just blindly, this is something that they went through by benchmarking, by putting one unit against each clear.\n\nThere's a reason why Blink is getting chosen, it's because of our philosophy in how we build the hardware. We are an owner and operator and there's no other that do what we do. If you look at other owner/operators, you're looking at EVgo, they do not make their own hardware, they do not have their own network. If you look at Electrify America, it is the same thing.\n\nSo it's [Inaudible] in philosophy. So again, our hardwares lasting longer because it is designed to do that. Our competitors' hardware is designed to become obsolete after couple cycles, so you have to buy new hardware. You follow?\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nAbsolutely. I just want to add, just a liitle bit tied to that. Given that you are going to be seeing ultimately by 30% lower cost with the manufacturing integrated through Sema, I'm just wondering, does that cost differential have any impact on sort of maybe your regional growth in different areas of the country. I'm just thinking of EV adoption and EV charging trends have sort of correlated in some places with high power cost markets versus low power cost markets, just the speed of deployment.\n\nI just wonder if your big cost savings is going to change that and have for you any?\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nUltimately, when you see what's going on globally from a legislative perspective, the world is going EV. You see what's going on with the Biden administration. You see what's going on in China. It's all over Europe.\n\nIt's not necessarily about the cost of the fuel, which is electricity because it just happens to be a hell of a lot cheaper than whatever you're going to go and using gasoline. So, it's not necessarily about the cost of the power in different areas right now. There's a concerted effort by every single OEM globally to manufacture EVs. Even those holdouts like Toyota and Hyundai with at their portfolio of plug-ins now, there aren't more holdouts.\n\nIt's every single major brand and those are committing to stopping making internal combustion engine cars within some of the next five, 10, 15 years. So, this is no longer about choice. I mean, yes, you have a choice of a car to buy. You can still buy a Ford or Mercedes or BMW, but really, the power source for mobility has been chosen and it's EV.\n\nAnd the only shortcoming that EVs have is what we do, which is making sure that there is a fuel supply for them and it's us and other companies in the space. There's a whole switchover of mobility that's taking place right in front of our eyes. And you're just going to see all that investment, all that capital, all that revenue that was generated from pulling automobiles in the past, going from those legacy companies to those that are now supplying [Technical Difficulty] fully vertically integrated EV charging company that could [Technical Difficulty]. As we mentioned earlier, we have owners that want to own everything from A to Z.\n\nThey want to charge. They want to make money this additional revenue stream. We have other property owners that literally just want to provide us with a parking space, we handle everything from A to Z. They make no capital expenditure whatsoever on their part and we have a revenue share model with them.\n\nSo -- and we have every single different employment etiology in between. It really gives us an advantage over our competitors, and especially, with the theme that we've built, a lot of these calls in the past, we were always taking the task about not spending enough on R&D. We weren't big on technology. We were big on just getting a footprint.\n\nWe're big on building our base of locations. And our model was frowned upon. But now look at the base of locations we have and all the property owners we have and now the technology that we've developed after we built an amazing tech team, both here and in India. And now we're leaders in that space.\n\nLook at our equipment compared to, again, our competitors, it speaks for itself.\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nGreat. Thanks a lot.\n\nOperator\n\nThank you, ladies and gentlemen. We have time for one more question from Sameer Joshi with H.C. Wainwright. Please, pose your question.\n\nSameer Joshi -- H.C. Wainwright -- Analyst\n\nHey, guys. Thanks for taking my question. Just a quick one actually on the products that have been launched or are in the process of being launched. Would the SemaConnect manufacturing capability be able to manufacture those, the MQ 200, the Vision IQ, The Series 8, and the HQ 200?\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nSo the current plan for the products was to -- right, there. Let me address the HQ, the HQ is following its current manufacturing trajectory right now. As we get through the synergy study, we could see a transition to being produced out of the Indian facility. Then the same thing with the MQ is following that trajectory.\n\nNow, the MQ is a very well-received charger in the market today, with a very good COGS compared to other competitive fleet chargers in the market, also with the new state-of-the-art software added to that for fleet management on that. So as we talked about earlier, you're going to see some products that may and then some that may not. The MQ is one that we may maintain the current course. The vision is in final design now.\n\nAnd as we finish the design of the Vision, and we have a new concept that we're working through and looking at, we'll determine the manufacturing facility for that. And again, we're going to look for the best COGS we can get into the market where it's highly acceptable. I was going to keep in mind buying America qualifications, because those chargers do qualify the Vision type charger. So all of that is going to be taken into account.\n\nSo I don't want to tip the hand one way or another until we finish the study. But I wanted to give you a flavor for -- you got to follow each individual product and some might have a different plan than others.\n\nSameer Joshi -- H.C. Wainwright -- Analyst\n\nGot it. And actually, just one more. Are you seeing -- or looking at your existing customer base, do you have a concentration of a particular type of customer and/or a particular type of product that is being adopted more than others?\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nWell, I guess, if you look at -- and this is factual, if you look at the combined portfolio, the chargers that are being focused on are the higher-powered AC chargers for both commercial and public use. Those are the volume players for both companies out there. Both of them can go up to 19.2 kilowatts on there. The new emerging space that is now going to start to see higher volume is fleet target specific LC fleet chargers that are designed to be economical and cost effective because in the fleet situation, the customers typically own their equipment or go into some of charging as a service model, are the two dominant models that are in the fleet space.\n\nSo those are picking up in volume, but you're still not seeing the same level as you're going to see for chargers at library, chargers in parking lots, chargers and multifamily dwellings. Now -- when we look at what we're going to put in multifamily dwellings again, that's the least penetrated market in the United States. So likely, we're going to see a big increase in that segment as well and that's not always the 19.2 sometimes it is. So look for an increase there.\n\nBut right now, it's the 19.2 it's the IQ 200 and the similar complementary charger on the SemaConnect side. Those are the volume players.\n\nSameer Joshi -- H.C. Wainwright -- Analyst\n\nThanks for that. I'll take my other questions offline. Thanks for taking it.\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nAll right. Perfect.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nVitalie Stelea -- Vice President, Investor Relations\n\nMichael Farkas -- Chairman and Chief Executive Officer\n\nBrendan Jones -- President\n\nMichael Rama -- Chief Financial Officer\n\nMatt Summerville -- D.A. Davidson -- Analyst\n\nStephen Gengaro -- Stifel Financial Corp. -- Analyst\n\nChris Souther -- B. Riley Financial -- Analyst\n\nOliver Huang -- Tudor, Pickering, Holt and Company -- Analyst\n\nNoel Parks -- Tuohy Brothers -- Analyst\n\nSameer Joshi -- H.C. Wainwright -- Analyst\n\nMore BLNK analysis\n\nAll earnings call transcripts"
}