{
  "companyName": "Costco Wholesale",
  "companyTicker": "COST",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/09/costco-wholesale-cost-q1-2023-earnings-call-transc/",
  "content": "Costco Wholesale (COST -0.01%)\nQ1 2023 Earnings Call\nDec 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen, and welcome to the Costco Wholesale Corporation fiscal Q1 2023 conference call. At this time, all participants are in a listen-only mode, and please be advised that this call is being recorded. After the speakers' prepared remarks, there will be a question-and-answer session. [Operator instructions] And now, at this time, I'll turn the call over to Costco's CFO, Richard Galanti.\n\nRichard, please go ahead.\n\nRichard Galanti -- Chief Financial Officer\n\nThank you, Bo, and good afternoon to everyone. I will start by stating that these discussions will include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements involve risks and uncertainties that may cause actual events, results, and/or performance to differ materially from those indicated by such statements. The risks and uncertainties include, but are not limited to, those outlined in today's call, as well as other risks identified from time to time in the company's public statements and reports filed with the SEC.\n\nForward-looking statements speak only as of the date that they are made, and the company does not undertake to update these statements, except as required by law. In today's press release, we reported operating results for the first quarter of fiscal '23, the 12 weeks ended this past November 20. Reported net income for the quarter was $1.364 billion or $3.07 per diluted share. That compared to $1.324 billion or $2.98 a share last year.\n\nThis year's results included a charge of $93 million pre-tax or $0.15 per share, primarily related to downsizing our charter shipping activities, and a tax benefit of $53 million or $0.12 per diluted share related to stock-based compensation. Last year's results included an asset write-off of $118 million pre-tax or $0.20 per diluted share and a tax benefit of $91 million or $0.21 a share related to stock-based compensation. Additionally, the strength of the U.S. dollar resulted in our foreign company earnings translating into fewer U.S.\n\ndollars. With 25% to 30% of our earnings generally -- generated outside of the United States, this negatively impacted earnings by about $0.12 per share. In terms of sales, net sales for the first quarter increased 8.1% or $53.44 billion versus $49.42 billion reported last year. On a comparable sales basis during the first quarter, reported U.S.\n\nsales increased over the 12 weeks 9.3%; and excluding gas inflation and FX, 6.5%; Canada, 2.4%; reported 8.3% increase, ex gas inflation and FX. Other International reported minus 3.1%; excluding gas inflation, FX, plus 9.1%. So, you have, all told, 6.6% reported for the company and ex-gas inflation and FX of 7.1%. E-commerce, by the way, was reported of minus 3.7% and a minus 2%, excluding FX.\n\nIn terms of first-quarter comp sales metrics, traffic or shopping frequency increased 3.9% worldwide and up 2.2% in the U.S. Our average transaction size was up 2.6% worldwide and 6.9% U.S. during the first quarter. And foreign currencies relative to the U.S.\n\ndollar negatively impacted sales by a little over 3%, while gasoline price inflation positively impacted sales by approximately 2.5%. Moving down the income statement. Membership fee income reported in the quarter, our membership fee income came in right at $1 billion. That's $54 million or 5.7% higher than last year's reported number of $946 million.\n\nAgain, the relative weakness in foreign currencies relative to the U.S. dollar, excluding the impact of FX, we're assuming flat FX year over year, that $54 million number would have been increased by $32 million, and the membership on an adjusted basis would have been a little over 9% year over year on flat FX. In terms of renewal rates, at first quarter-end, our U.S. and Canada renewal rates were 92.5% compared to 92.4% a quarter ago.\n\nAnd worldwide rate came in both at this quarter-end and the previous quarter-end, the same level at 90.4%. We ended first quarter with 66.9 million paying household members and 120.9 million cardholders, both up 7% versus last year, and recognize we added about 22 units over the course of that last year. So, that was about just under 3% of that increase. At Q1 end, paid executive memberships were right at 30 million, an increase of 904,000 during the 12 weeks or 75,000 a week during the first quarter.\n\nExecutive members now represent 45% of our paid membership and just under 73% of worldwide sales. Moving down the income statement to gross margin. Our reported gross margin in the first quarter was lower year over year by 45 basis points and lower by 21 basis points, excluding gas inflation. And as I'll explain in a minute, the 93% pre-tax charge, excluding that 93% -- $93 million charge we took in the quarter, gross margin ex gas inflation would have been only down three basis points.\n\nAs I always ask you, jot down the following numbers: two columns and six line items. The first column is reported during the first quarter, a year-over-year delta change in basis points, and the second column, excluding gas inflation. On a core merchandise basis, we reported in the first quarter, minus 52 basis points; and ex-gas inflation, minus 31 basis points. Ancillary and other businesses, plus 23% on a reported basis and plus 30%; 2% reward, minus two and minus five; LIFO plus three and plus three; other, that's the $93 million charge, minus 17 and minus 18.\n\nSo, all told, again, reported basis was 45, ex gas inflation, 21. So, starting with the core. Core merchandise's contribution to gross margin on a reported basis was lower by 52 basis points year over year and lower by 31 basis points ex-gas inflation. In terms of the core margin on their own sales, in the first quarter, our core or core gross margin, if you will, was also lower by 31 basis points, with food and sundries being up a little bit, offset by nonfoods and fresh foods being down.\n\nFresh foods was down. As you know, for the last couple of years, it's been particularly strong, and it's come down a little bit. In addition, we are looking to hold prices on some of those price points despite inflated costs in some of the fresh food categories. Ancillary and other business gross margins were higher by 23 and higher by 30 basis points ex gas inflation in the quarter, with gas, business centers, and travel up year over year, offset in part by e-comm, food courts, and optical.\n\nOur 2% reward, minus two basis points; reported, minus 5%, excluding gas inflation, implying higher sales penetration coming from our executive members. LIFO, plus three basis points. We had a very small LIFO charge this year but lapped a $14 million charge in Q1 last year. You recall last year, during the four quarters, we had LIFO charges in excess of $400 million pre-tax with a small amount that $14 million in the first quarter over $100 million in Q3 and over $200 million in Q4.\n\nSo, we'll see what inflation does this year. Hopefully, it will continue to -- its current trends in the right direction. Other, the minus 17 and 18 basis points reported in ex-gas inflation. This is the $93 million charge, as mentioned in the earnings release, mostly related to downsizing our charter shipping activities.\n\nOver a year after COVID began, you will recall that the supply chain challenges related to shortages of the containers and shipping delays greatly intensified with container freight and shipping rate skyrocketing. It was in Q4 of 2021 on our earnings call that we mentioned our initial leasing of three ships and several thousand containers to help mitigate these challenges. Later, we added four additional vessels and additional needed containers with commitments made for up to three years. Our objectives at the time were twofold.\n\nFirst, to increase the ability for more timely shipping and arrival of overseas merchandise. This allowed us to better stay in stock and drive sales; and second, to reduce some of the skyrocketing shipping and associated container costs. We achieved those objectives for a period of time. Over the course of a year, year and a half, we controlled the shipping and delivery of nearly 50,000 containers, many that would have been greatly delayed and at an estimated savings as compared to the then-current shipping container costs of somewhere between $1,000 and $2,000 per container.\n\nThat, of course, fluctuated. Now, with a dramatic improvement in shipping times and much lower shipping and container costs, it made sense to downsize our commitment and lower prices for our members. Moving on to SG&A. Our reported SG&A in the first quarter was lower or better year over year by 35 basis points, coming in at a 920 compared to a year ago, 955.\n\nAnd that plus 35 basis point improvement would be plus 13 basis point improvement, excluding gas inflation. Again, writing down six line items and two columns. First column being reported, second ex gas inflation. During the first quarter, our core operations was lower or better by eight basis points, plus eight then; without gas inflation, minus nine; central, zero and minus three; stock compensation, plus three and plus one; preopening, zero and zero; other, plus 24 and plus 24; for a total first-column reported -- year-over-year reported SG&A plus 35 or lower by 35 basis points and ex gas inflation, lower by 13.\n\nNow, going through those numbers, the core operations component of SG&A was, again, lower by eight basis points reported but higher by nine, excluding impact of gas inflation. These results include three sets of wage increases that were done in the past year-plus, as well as a little lower sales results in Q1 as compared to the prior quarter, still increases but a little lower than the prior quarter. Central was flat or zero and higher by three, ex gas inflation. Stock comp, again, a little lower number in stock comp as a percent, so it came down, improved a little bit.\n\nPreopening, no impact. And the other, the 24 basis points you recall last year in Q1, this consisted of an asset write-off totaling $118 million pre-tax, which impacted the SG&A line last year. Below the operating income line, interest expense was $34 million this year, down $5 million or down from $39 million last year. And interest income and other for the quarter was higher by 11 year over year, $53 million versus $42 million a year ago.\n\nInterest income was higher year over year, offset by unfavorable FX. Overall, reported pre-tax income in the quarter was up 4%, coming in at $1.77 billion, compared to $1.696 billion a year ago. And excluding the charges described earlier in both years, pre-tax income was up around 3%. In terms of income taxes, our tax rate in Q1 was 23% compared to 20.7% Q1 last year, so a little higher this year.\n\nBoth years' tax rates benefited from the tax treatment of stock-based compensation, as mentioned earlier. The fiscal '23 effective tax rate, excluding these discrete items -- this discrete item, is currently projected to be between 26% and 27%. A few other items of note. In terms of warehouse expansion, we plan to open a net of 24 units this year, 27 openings, including three relocations, so net of 24.\n\nIn the first quarter, the net of that 24 included seven. We plan three more in Q2, four in Q3, and 10 in Q4. In the first quarter, we opened, as I mentioned, seven net new warehouses. Four were in the U.S., and one each was in Korea, our first in New Zealand, and our first in Sweden.\n\nAdditionally, last week, we opened another building in the U.S. And just yesterday, we opened our 14th location in Australia, our second on the country's West Coast in or near Perth. In fiscal '23, again, 27 total new openings, including three locations for a net of 24. Of the net 24, it's made up of 15 in the U.S.\n\nand nine in Other International, including our third and fourth locations in China. Regarding capex, in the first quarter, capex was approximately $1.06 billion. And our estimate for the entire fiscal year is capex of somewhere in the $3.8 billion to $4.0 billion range. Moving to e-commerce.\n\nE-commerce, as we mentioned in the press release, on a reported basis was -- for the quarter, year-over-year sales were minus 3.7 and minus two ex FX. Including sales -- what we don't include in this number is our sales through like same-day delivery for fresh foods with our partners like Instacart, which we don't include those, and they are fulfilled in our warehouse. Our e-comm comps, ex FX, would have been if we included it in the positive low single digits. Stronger departments in terms of year-over-year percentage increases were tickets and gift cards, tires, candy, and health and beauty aids.\n\nThe largest e-comm merchandise department majors, which includes consumer electronics and appliances, which represents over 40 -- close to 40% to 50% of our -- over 40% of our e-comm volume was down in the high single digits. Subsequent to quarter-end, we did have our two biggest e-comm selling days in our company history, both on Black Friday and Cyber Monday. Now, a few comments regarding inflation. Recall, we've seen some minor improvements in a few areas.\n\nHopefully, continuing the comment I made last quarter's earnings call, a little light at the end of the tunnel, but it's still little. Recall last quarter in fourth quarter, we estimated that year-over-year price inflation was about 8%. In the first quarter, we estimate the equivalent year-over-year inflation number in the range of 6% to 7%. Food and sundries is still up more than nonfoods, but overall, a little better level than a quarter ago for the company.\n\nAnd commodity costs are mostly coming down, whether it's corn flour, sugar, and butter or even some things like steel. A few things are up, but overall, we're seeing a little bit of a trend, but we'll keep you posted. Switching over to inventory levels. Recall that our total inventory in both -- at the end of Q3 and at the end of Q4 on a year-over-year basis were up 26% year over year.\n\nI'm happy to report that good progress was made during the first quarter of this fiscal year. Our increase as of Q1 end dropped to a 10% year-over-year increase, largely driven by an estimated 6% to 7% inflation and about just under 2% year-over-year unit growth. So, inventories, while we still have some pockets of a little over inventory, overall, we feel pretty good about it. As a reminder, in terms of upcoming releases, we will announce our December sales results for the five weeks ending Sunday, January 1, on Thursday, January 5, after the market closes.\n\nWith that, I will open it up to Q&A and turn it back over to Bo. Thank you.\n\nOperator\n\nThank you. [Operator instructions] We'll take our first question this afternoon from Simeon Gutman at Morgan Stanley.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nHey, thanks, guys. Good afternoon. Richard, I want to start with the short-term question. November, the slowdown in the stacks.\n\nIs there anything tip of the iceberg there, macro merchandising? Is there something obvious? I mean, you were living in pretty rarefied air, but curious if there's anything notable.\n\nRichard Galanti -- Chief Financial Officer\n\nNo, I think the biggest thing, as I've said a couple of times in a quiet way, it rains on all of us during these tougher times, particularly with bigger ticket discretionary items. We're comparing against some huge increases a year ago, frankly, over the last two or three years, as you know. And that's where we've seen some of the slowdown. As I mentioned, e-comm consumer electronics and appliances, as I mentioned, was down high singles.\n\nI think in line was also down some amount. So, that's where a big chunk of it is. When we look at food and sundries, that actually tends to be relatively strong for us. So, overall, I think it's impacting us a little bit with what's going on out there.\n\nI think it is a combination of compared to very strong stuff a year ago, as well as the fact that big-ticket discretionary has a little bit of weakness.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. And maybe just a two-part follow-up. One is just related to that answer. Does those two couple of days, I don't know if you can judge enough from it, does it bring you back to some type of trend line? Or it sounds like your tone is there's still some pressure? And then the real follow-up is on gas gross profits.\n\nIf you just think about the movement of the lap throughout this fiscal year, does it progressively get harder through the year in terms of the lap? And then can you highlight to us which quarter has the highest cents per gallon lap throughout the rest of the year?\n\nRichard Galanti -- Chief Financial Officer\n\nYeah. I have a couple of people in the room smiling. Of course, I can't tell you all that. But at the end of the day, first of all, if you look at our November reported numbers, the fact that those two dates -- those two high dates on e-comm were in the last week.\n\nKeep in mind, e-comm is still a little under 10% of our total company, but that helped a little bit relative to e-comm in the last four weeks that we reported. But overall, look, we don't know what kind of trend it means. We feel pretty good about what we're doing in terms of driving sales. And as I mentioned, the food and sundries as we get past big-ticket discretionary purchases for the holidays, for Christmas, and what have you, you'll have a higher penetration of some other things as well.\n\nAs it relates to gas, for several quarters now, even beyond a year ago, we talked about the gas profitability for us, and we believe our competitors -- other big chains of gas stations have made more in gas. And certainly, that's helped us use some of that to continue to hold prices where we can on some things. Who knows what the new normal is? What we know is that not only is gas more profitable than it has been in the past, and like I said the same thing a year ago, will that change at some point? Maybe. We don't know.\n\nSo, right now, it's good. And by the way, as we've mentioned a couple of times, we've seen strong gallon sales, and we're still taking market share. We -- when the U.S. gallon sales are generally close to flat, we're up in the 10% to 15% range in gallons.\n\nSo, we're driving people into the parking lot. And the fact that gallons of gas are profitable, that there's just a little bit more for us as well. So, that's helped us. There's always things that are going to help us, and there's always going to be puts and takes.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. Thanks to everyone. Happy holidays.\n\nRichard Galanti -- Chief Financial Officer\n\nSame to you.\n\nOperator\n\nThank you. We go next now to Chuck Grom at Gordon Haskett.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nHey, how's it going? My question is on the LIFO charge. It looks like if it's a few basis points of a hit, that would back into about $30 million to $40 million. And I'm curious, I know you don't provide guidance, but knowing what you know now and if inflation holds at that, say, 6% level, would that be a good proxy for the charge, at least over the next couple of quarters?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, I think, yeah, LIFO was a slight pickup just because the dollar amount was less than the $14 million last year in the quarter. It's very slight. So, if that continues, that would be good, and that would bode well. And you'd have -- I'm guessing you'd have a lot lower charge than $423 million, recognizing the big pickup was in Q3.\n\nThe big hit was in Q3 and 4 when we saw the beginning of inflation rising. If inflation didn't go down, but it just stayed the same, in theory, you'd have no big charge. You have no additional charge. If it starts to go down from its peaks, that will have -- there'll be some LIFO income.\n\nNow, mind you, some of that will be used for pricing as well. I mean, well, you know us.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nYeah. OK. So, what would you do to have the absolute dollar amount for the LIFO charge in the quarter for us?\n\nRichard Galanti -- Chief Financial Officer\n\nYeah. It was less than $1 million.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nLess than $1 million. OK. Great. And then on the ancillary line, you've had real good success there in back-to-back quarters and you outlined gas profitability, e-comm, food court.\n\nIs there one that's been more outsized over the past couple of quarters and that maybe we could think about over the next few quarters because it's been a nice improvement?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, look, gas is just the sheer size of our gasoline business. It's been the biggest piece of that line for a few years. We have a -- it's a $30-plus billion -- on our $220-whatever billion last year we did in sales, I think a little over $30 billion was gas. So, that's the big kahuna among all that stuff.\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Great. Thanks very much.\n\nOperator\n\nThank you. We go next now to Michael Lasser of UBS.\n\nMichael Lasser -- UBS -- Analyst\n\nGood evening. Thanks for taking my question. Richard, between the 31-basis-point core-on-core gross margin discussion -- decrease for core on core gross margin, the discussion around giving up some shipping capacity to have a better price for your member, is the mindset of Costco right now as the economy enters a more difficult economic period, Costco is going to be stepping up price investments in order to gain market share?\n\nRichard Galanti -- Chief Financial Officer\n\nI mean, I think we continue just to remain competitive. You've known us long enough. When asked who is our toughest competitor, we look in the mirror, and we say it's us. So, I think that as we drive market share, part -- we believe that part of it at least is due to the fact that we've continued to be very competitive.\n\nAnd so, I don't know if there's any change in that. We -- notwithstanding where our numbers come out, we're always trying to push more into lowering the prices or keeping the price increases going not as high as they could have been. I think fresh foods is a good example of that of late, where, again, we've held the price points on certain items despite inflated costs, mostly in the protein area and a little bit in the bakery area.\n\nMichael Lasser -- UBS -- Analyst\n\nAnd, Richard, you've long talked about the Costco model is driven, first and foremost, by sales and the need to drive at least the mid-single-digit comp in order for the other parts of the P&L to work. So, as the economy is entering a softer period where discretionary sales can be a little weaker and Costco's overall sales are going to be a little softer, should we be modeling and prognosticating just a lower overall earnings growth for Costco during this time as when we go to these factors?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, good news is that's your job to model it. Look, at the end of the day, I think that the comment I made about big-ticket discretionary, while we sell big-ticket discretionary includes furniture, which we sell lawn and garden, patio, too, that's not right now at the holiday season necessarily. But that being said, there is a higher proportion of big-ticket discretionary right now. And we're blessed in the sense that a big chunk of our business is fresh foods and food and sundries, which people have to eat.\n\nAnd as I mentioned, that has been strong throughout this. So, I think overall, we'll probably still look at it in a positively relatively aggressive standpoint. Ultimately, when you talk about top-line sales and if they're a little lower, what do we need? I think the question historically has always been asked, what do we need to have SG&A not go up as a percent of sales? And the view is -- and this is pre-inflation. The view is always you need something -- our best guess view is somewhere in the 4% to 5% comp range.\n\nIf it falls below that, that will make SG&A a little bit of a challenge. That being said, we're pretty pragmatic, and we know how to use our margin as well. So, I think overall, we'll continue to work entirely to drive top-line sales and look at it for the long term. And we're not in any big way cutting back orders at this juncture.\n\nWhere we see some challenges with big-ticket discretionary, does it come down a little? I think the keyword there is a little. And we're feeling very good about some of our business now despite what's going on out there. We're blessed that we think, again, I think as evidenced by gas and any food and sundries business, we're blessed by taking market share still. I think that's evidenced in our memberships and --\n\nMichael Lasser -- UBS -- Analyst\n\nYour answer was a lot better than my questions. Thank you very much.\n\nOperator\n\nThank you. We go next now to Rupesh Parikh at Oppenheimer.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGood afternoon, and thanks for taking my question. So, just on the core-on-core decline of 31 basis points, I was hoping you provide more color just in terms of what's driving that decline in nonfoods category. And then just related to the pressure on fresh foods. I know I think you've now lapped some of the last year, I think, fresh foods is also a headwind.\n\nSo, when do we lap some of the -- I guess, some of the efficiencies that you gained during the pandemic? Because I know you've given it back in recent quarters. So, I'm trying to get a sense of when that pressure point could go away.\n\nRichard Galanti -- Chief Financial Officer\n\nYou know, I don't know exactly. I mean, if we're, you know, three quarters of a year into it, I think if I recall, over the last two or three quarters, we've talked about like fresh being that way and probably exacerbated a little right now with the fact that we're trying to hold prices on some things that we think that that's driving our sales. Beyond that -- I forgot the first part of the question now.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nJust on nonfoods, any more color on --\n\nRichard Galanti -- Chief Financial Officer\n\nOh, yeah. I think that -- yeah, fundamentally -- first of all, in terms of overall, it's fundamentally fresh and then some nonfoods. Some of that has to do with some of the big-ticket things. If you've been online and saw some things we did during not just the week of Thanksgiving and Cyber Monday but we did some -- anywhere from $100 to $500 off on, I think, $500 cash card, if you bought $3,000 or more of these items.\n\nAnd so, we're getting rid of some of the reason that 26% year-over-year inventory increase went to 10% was we got rid of some of the stuff that we -- some things that we had deep freeze and some things that we had delayed shipping during the supply chain challenge. So, we did take some more markdowns than normal as you would expect, to help get rid of that. And hopefully, that's not a pressure point going forward. Certainly, I don't think it will be as much.\n\nAnd again, there are so many moving parts to this equation. I wish it was as easy as each basis point we could explain. We try to give you the rounded numbers. But overall, again, I get back to we feel good about how we're doing competitively.\n\nAnd we certainly understand that big-ticket discretionary things have shown a little weakness, in part, because of our strength from a year ago, and in part, it's got to be part of the economy. And the good news is we have big chunks of our business that are fresh foods, food and sundries, health and beauty aids, gas, all those types of things. And even other things like that's small, but travel has come back really strong from a really weak place a couple of years ago.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nGreat. And then maybe just one additional question just on the membership fee hike. If we are in a weaker economic backdrop next year, does that at all impact how you guys are thinking about the timing of the membership fee hike?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, it certainly goes into the thought process. We're still not even to the average of the last three increases in terms of timing between the last one and the next one. What we've said again, and I'll say again, is that our view is all the parameters, as it relates to member loyalty and value proposition that we've improved to our member we have no problem thinking about doing it and doing it ultimately. So, it's a question of when, not if.\n\nBut we feel that we're in a very strong competitive position right now. And if we have to wait a few months or several months, that's fine. And I'll be purposely coy on when that might be.\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nThank you. Happy holidays.\n\nRichard Galanti -- Chief Financial Officer\n\nSame to you.\n\nOperator\n\nThank you. We go next now to Paul Lejuez at Citi.\n\nBrandon Cheatham -- Citi -- Analyst\n\nHey, it's Brandon Cheatham on for Paul. First one, I wanted to dig into the decision on holding the price on fresh. Are you seeing competitors do the same and that's why you reacted there? Or are you kind of trying to lead the charge there? And just curious, like why make that decision since it seems like the consumer has been happy to take increased price, especially in fresh?\n\nRichard Galanti -- Chief Financial Officer\n\nYeah. The last thing you said there is exactly, I think, why we chose to do a little more there. We want to be the most competitive, and we can drive a lot of volume. And again, we're in it for the long term.\n\nAnd it's -- fresh is one of those unique areas where prices on many items do change almost weekly on some of those items. If not sooner, if not more quickly. And so, our buyers are always looking at the, if you will, the supermarket ads, as well as the other warehouse club ads, not literally ads, but what the pricing is, and we react to that. But we're also -- part of it is also consciously keeping the price on the chicken at $4.99 and keeping -- and those types of things, keeping the price on the hotdog.\n\nAll those things go into that equation as well. But we know that that can be a driver of business. Fresh, we got great stuff, and people do notice the price. In our view, people notice those price differences.\n\nBrandon Cheatham -- Citi -- Analyst\n\nAnd just a quick follow-up. You have a large competitor that's been talking about increased members in the $100,000-plus income cohort. Obviously, it's not impacting your membership numbers, but I'm just wondering, do you see any impact on share of wallet or any thoughts there? Do you look at how many of your members might have additional memberships as well?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, we don't -- what's that? No. Somebody in the room is telling me we were also up in terms of the average household incomes. So, I think we're both seeing that. We know a lot of -- particularly of our executive -- our business members, in many cases, probably have both cards.\n\nThey've always had both cards. And so, no, we don't put our head in the sand as it relates to it, but we look at our numbers and how we're doing, and we've seen that the -- our penetration of higher income members has also benefited during this time.\n\nBrandon Cheatham -- Citi -- Analyst\n\nGot it. Appreciate it. Thanks, and good luck.\n\nOperator\n\nThank you. We'll go next now to Oliver Chen at Cowen.\n\nRichard Galanti -- Chief Financial Officer\n\nBefore Oliver answers -- Oliver, before you ask a question, one other comment. One of the things that we have not done and don't plan to do is do a lot of promotional activities with our membership. And so, that -- certainly, that will, in the short term, help drive membership, but we don't do a lot of that. All right.\n\nGo ahead, Oliver.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nRichard, thanks. Thanks. Happy holidays. Regarding e-commerce and going forward, what are your thoughts? You're up against some tough compares, but as we model it on a longer-term basis, how should the growth rates evolve? And then as we think about nonfood, you talked about it a lot, but do you expect the nonfood percentage mix to change from the past? Or it will more normalize? And lastly, on the higher-income consumer and gains there, would love for you to elaborate on what's happening and if you're getting more luxury consumers in terms of higher-income folks joining in the club.\n\nThanks a lot.\n\nRichard Galanti -- Chief Financial Officer\n\nSure. I wrote down nonfood -- in terms of what's the new normal. Look, we don't know what the new normal is. I do know that we figure out how to drive total sales.\n\nI do know that over the last two and a half years through COVID, people buying things for their home, whether it was indoor furniture, outdoor furniture, exercise equipment, electronics, and appliances, and it's even greater because of our acquisition in April of 2020 of the last-mile, big, and bulky delivery and installation arm from Sears. All that stuff has helped us dramatically. Look, a little bit is -- again, we don't know how much of it is just comparing against very strong numbers versus a little weakness. Our guess is a little above.\n\nWe want to drive -- we always want to drive everything, but we want to drive more nonfood things because you've got -- you don't need any extra space. If you're turning fresh foods at 50, 60 times a year or more, you're turning some nonfood categories at eight times a year. It's easy to go from eight to 10 without any extra space in the building. So, that's always been a goal of ours to drive both sides of the business, and we think we're pretty good at doing it.\n\nAnd this will be -- we'll find out what the answer is a year from now. On -- what was the other question? I'm sorry.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nOn e-comm and the e-comm long-term growth rate there. And then also the higher income membership.\n\nRichard Galanti -- Chief Financial Officer\n\nSure. OK. On e-comm, again, that is even more dramatic if you look at what e-comm did. We essentially doubled e-comm over a 12-month period from about worldwide from about 8 billion to 16 billion in that probably three or four months into COVID and then going fast forward a year.\n\nSo, the last half of fiscal '20 and the first half of fiscal '21, we had pretty good numbers over the last year. That, of course, dramatically impacted in a good way from our acquisition of Innovel. And doing, as I mentioned on the last earnings call, pre that acquisition in the U.S., we did about a little over 2 million drops, and a drop is anything from dropping off a sofa to dropping off and installing a washer dryer or a refrigerator freezer and taking the old one away. We've gone from a little over 2 million drops.\n\nIn fiscal '22, we did a little over 4 million drops, 70% of which is on the site and this operation that we acquired. So, we've had outsized growth on that. Helped also not only by the acquisition but COVID itself. So, we're comparing against that now.\n\nWe'll see where that goes. We think that e-commerce still long-term. First of all, as you know, we still want you to get into the warehouse as well. That's what -- so long term, we still think right now, we want to grow the e-commerce.\n\nI would say our goal still is to grow it a little more than in line right now because so much of it has been benefited by big-ticket items, which have shown some weakness that's impacting a little bit right now. But long term, we want to still be even 9% or 10% of $240 billion or $250 billion business here is a big chunk of business. In terms of the last question, I'm sorry, I didn't write it down.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nYeah. I think of Costco as a luxury company, too. So, what are your thoughts on getting the higher-income consumers? And anything you're seeing with your existing consumers in terms of behavior because everybody is under a little bit of pressure as well? Thank you.\n\nRichard Galanti -- Chief Financial Officer\n\nWell, again, someone in the room here showed me that I think the data that somebody had asked me about where Walmart had indicated, we're all looking at that same data. We too saw the metrics of a little bit higher percentage of higher income people coming in, notwithstanding the fact that we start with a higher percentage to start with. That's -- we try to trade you up. And you know the quality of our merchandise, and we'd much rather sell you a bigger ticket item with all the bells and whistles.\n\nSo, I think that -- it's the way we merchandise, and we're not looking to change that at this juncture.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nThank you. Best regards, Richard.\n\nRichard Galanti -- Chief Financial Officer\n\nYeah.\n\nOperator\n\nThank you. We go next now to Greg Melich of Evercore.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nMany thanks. Richard, I'd just like to talk about how -- traffic seems to be growing closer to 2% now in the U.S. Is there anything specific going on there? Or we just need to get used to it as recycling lower gas prices and tough out the slower traffic?\n\nRichard Galanti -- Chief Financial Officer\n\nPerhaps. I mean, we still think anything that's even in the low single digits is great. And we benefited clearly from -- over the course of the last year, we benefited, as I've seen in our membership sign-ups, more people coming in and the gas business driving that a little bit as well. And just during COVID, we had a higher than previously average tick-up and new member sign-ups.\n\nAnd so, that's probably subsiding a little bit at this juncture. But again, we feel good -- very good about where our renewal rates are and then the loyalty that our members have. And we're pretty good at keep trying to figure out ways to get them in. We're doing -- we do online emails that are in-line directed for hot items to come in only available in store.\n\nAnd so, those are the things that we continue to do.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nGot it. Could you update us on any, you know, private label extra gains that you're getting in this environment or trade down perhaps between proteins or anything like that worth calling out?\n\nRichard Galanti -- Chief Financial Officer\n\nWe haven't seen -- last quarter, I mentioned a couple of things on the fresh side and the protein side that we actually saw strength in canned chicken and tuna, which was the comment that the buyers made saying that we're seeing -- to the extent that prices were skyrocketing and some fresh protein, we saw strength in canned protein. We don't see, currently, a lot of trade down on fresh. Prices have started to come down on some of those items as the underlying commodity costs have come down a little bit. KS penetration is up.\n\nOur critical senior is up. I don't have the exact number in front of me. I'm guessing it's about somewhere approaching one percentage point, but -- which is big when it's, I would say, over the last several years, it's probably been a half percentage point. But -- so probably up a little more than normal, but -- and again, we had -- somebody asked us the question recently, are you seeing some trade down to private label? And we, of course, corrected them and said it's a trade-up.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nYou also mentioned it's a housekeeping item, but I want to make sure I got the charge right. So, you're basically running a check to reduce the size of a contract that was at a higher price. So, when -- what's the payback period on that check? Do we see it over four quarters, two quarters, six quarters?\n\nRichard Galanti -- Chief Financial Officer\n\nYes. You know, it's a moving target, honestly. It's based on rates, frankly, and rates right now have come down dramatically. So, that would be a year, it could be a little longer than a year or a little less than a year, depending on what happens tomorrow.\n\nGreg Melich -- Evercore ISI -- Analyst\n\nOK. Great. Good luck, and thanks.\n\nRichard Galanti -- Chief Financial Officer\n\nYep.\n\nOperator\n\nThank you. We go next now to Peter Benedict of Baird.\n\nPeter Benedict -- Baird -- Analyst\n\nHey, Richard. Just on new member sign-ups, you kind of mentioned it a little bit there in response to Greg's question. But just maybe talk about new member sign-up trends. Holistically, what you're seeing, anything U.S.\n\nversus maybe some of these international markets you've been entering. Just interested in your latest thoughts there.\n\nRichard Galanti -- Chief Financial Officer\n\nWell, I think the biggest thing continues to be we're better when study does sign up that they sign up in those countries where we offer executive membership, which is, I'm guessing, 85% of our company, more, maybe 90% of our company. It's just not in some of the smaller unit countries. And overall -- starting with the U.S., but overall, in Canada, we do a better job of getting you to sign up as an executive member to start with. We also do a better job of getting you to sign up to auto-renew with putting in your credit card.\n\nAll those things help -- let's face it, all those things help, too. We know that an executive member buys more and shops more frequently in a year than a nonstore member. We know that one of those members with a credit card, co-brand credit card shops even more frequently and spends more. And they do all three, they're an executive member with a card versus being a regular member, that's the big kahuna here.\n\nAnd so, I think that we've seen those trends go on over the last few years, frankly. And what's helped in the last year is the fact that, again, just our new member sign-ups has been higher than they had been historically over the last few years versus the last year -- last year or two. And I think we believe that's more because of COVID, and we were in a good place to shop.\n\nPeter Benedict -- Baird -- Analyst\n\nSure. That makes sense. And as my last question, just an interest and -- interest income and other, obviously, has a few components to it. I'm curious if you can help us understand what the interest income was in the quarter.\n\nI think it was about $8 million last year. I'm sure that was up a lot this quarter. Just curious if you could give us a sense of what that number was in the first quarter. Thank you.\n\nRichard Galanti -- Chief Financial Officer\n\nIs that in the Q? OK. Yeah, I can give it to you. Hold on a second. I didn't realize it's in the Q, which is not out yet.\n\nBut what it is, is you've got a big increase in interest income and a big increase in FX downside. So, of the 50 -- I think it was 53 is -- $54 million is interest income and the negative $1 million is other, which is a chunk of that's FX. And then this year, the $42 million -- I'm sorry, last year, it was $8 million of interest income and $34 million of other, the biggest piece of other being FX. So, that added up to the $42 million.\n\nThis year, the $53 million is $54 million of interest income and minus one of other.\n\nPeter Benedict -- Baird -- Analyst\n\nYep, That's what I was looking for. Thank you very much.\n\nOperator\n\nAnd we'll go next now to Kelly Bania of BMO.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nHi. Thanks for taking our questions. Richard, I just had one on elasticity and then another follow-up on the big ticket. But in terms of elasticity, any changes -- I'm not sure how you measure it or monitor it, but any changes in your members' response to your actions when you are taking some lower prices here?\n\nRichard Galanti -- Chief Financial Officer\n\nI think if you asked the buyers overall that there's a little less elasticity than there used to be on some of the things. Again, now that answer comes from the fact that my comments about big-ticket discretionary items. We've put more money behind it and that successfully cleaned up our inventory where we were over in some areas like furniture, to some extent. But at the end of the day, I think in a year or two ago, we would have even guessed that could have been a little stronger.\n\nBut then that gets back to the whole question is the economy -- the concerns in the economy impacting big-ticket discretionary items. So, yeah, I mean, there's clearly still elasticity. When we do temporary price discounts or even our MVM mailers, we still get good impact from it. Some things, the bigger the ticket, not as much as we used to get.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nThat's helpful. And then just a follow-up again on the big ticket. What percent of your sales would you say are big-ticket? Maybe it ebbs and flows with the seasons, but just in general. And do you see that members are pretty broad-based in pulling back meaning across income levels, Executive, Gold Star, etc.?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, online, it's a little over 40. But online is only 9% of our sales. In-store, I don't have it in front of me. 10 would be a good guess.\n\nAnd including that 10, furniture as well. So, big -- and jewelry, big-ticket discretionary.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nPerfect. Appreciate it.\n\nOperator\n\nAnd we'll go next now to Chris Horvers at JPMorgan.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks. Good evening. So, following up a little bit there. On the TV side, is it -- how much of it is a units down issue versus deflation? And is there any differentiation that you're seeing between larger and smaller screen size purchases?\n\nRichard Galanti -- Chief Financial Officer\n\nYes. Yeah. Units are actually up. And there's normal deflation in TV electronics anyway.\n\nAnd -- but there is perhaps a little bit of smaller sizes are coming down a little bit. Not everyone wants an 85-inch television but -- which is where we over-index to bigger ticket stuff to start with. But we are seeing actual unit sales up.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nSo, units are up with strength -- relative strength in smaller sizes?\n\nRichard Galanti -- Chief Financial Officer\n\nYes. Yes.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then a couple of sort of other bigger-picture consumer questions. I guess is there -- are you seeing maybe some mid- to low end maybe not buying the 18-pack of Bounty? Like do you think you might be losing some category share as someone's trying to economize the ticket for your -- the lower half of your income perspective? And then can you also -- can you also talk about regionality? Obviously, there's some weakness in certain housing markets in certain cities, and then there's -- you have a big exposure to California. There's been more layoff news in the technology industry, and there's some population migration.\n\nSo, what are you seeing from a regionality perspective where you're seeing more weakness versus strength?\n\nRichard Galanti -- Chief Financial Officer\n\nWell, first of all, we're seeing strength in sundries as part of what we call food and sundries, which is everything. Food and food and sundries is everything from canned beverages to crackers and cereal, and sundries, of course, paper goods and cleaning supplies and the like. And we're seeing strength in those areas. Those are -- those are actually strong, offset by some of the weakness I talked about on the nonfood side.\n\nAs it relates to regional, I don't -- we don't really see any big differences. I mean, every month, you're going to see a region stronger or weaker. It has more to do in our view right now of late with weather than anything else. I can't give you anything definitive on what's -- is the region -- it's pretty -- they're all pretty close.\n\nBob Nelson -- Senior Vice President, Finance and Investor Relations\n\nWithin a point and a half or two points.\n\nRichard Galanti -- Chief Financial Officer\n\nBob is saying here, they're within a couple of points of comp.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then one cleanup question. Just on the inventory, you talked about pockets. It sounded like you cleaned up furniture and electronics, it sounds like.\n\nIs there any -- where are those pockets? How much is maybe holiday, decor or toys, other more at-risk categories in the month of December?\n\nRichard Galanti -- Chief Financial Officer\n\nThe good news is our merchants are sitting here. Holiday decor is fine. One example actually would be we have a small amount of air conditioners and fans, which was -- it was a hot summer, and we were very strong in it. There were delays some of the supply chain challenges, some of that stuff didn't come in until September.\n\nAnd needless to say, we're not going to put it out there and mark it down when nobody really is looking for an air conditioner unit in September. And so, that's the example of a few things now. We still have some furniture. It's way down from where it had been.\n\nSo, very, very manageable. I think beyond that, there's nothing huge. And again, the big question right now would be the fact that from a standpoint of Christmas stuff, both the Christmas stuff, as well as toys, we're in pretty good shape for that. We feel pretty good about that.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThat's great. Thanks so much. Have a great holiday season.\n\nOperator\n\nThank you. We go next now to Scot Ciccarelli at Truist.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nGood evening, guys. I guess I have another gross margin question. And I guess it's -- look, if consumables continue to outpace discretionary goods based on what we're seeing in the economy, should we expect gross margins to compress a bit just from mix? Or do you have enough levers given existing price gaps across most of your categories to match the flattish gross margins? Just how should we think about the mix impact?\n\nRichard Galanti -- Chief Financial Officer\n\nWe'll let you know next quarter. I mean, we have a lot of levers, as you've mentioned, as you suggested, to pull and push. We're also aggressive on pricing when we want to be like in the fresh foods area that I just mentioned. And we're blessed right now with -- in some categories like gas that is a better margin.\n\nSo, all that stuff, again, there's a variety of puts and takes. We feel overall, there's nothing unusual about this quarter. And frankly, if inflation is not rising again, even if it doesn't go down, but it doesn't rise again from its current levels, we're in pretty good stead of greatly improving the component of margin that relates to a LIFO charge, particularly in Q3 and 4 when we had a $100-plus million number and a $200-plus million number. But that's to be seen, and we need to wait and see.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nSo, just as a follow-up on that, Richard, like fair to say that we're going to see lower freight rates starting to flow through the P&L and let's call it, less markdown pressure because the inventories are cleaned up a bit more than the last few quarters?\n\nRichard Galanti -- Chief Financial Officer\n\nThat should help you a little bit. Sure. But as you might expect and one of the reasons we took this charge is we don't want to have to have the buyers worry about inputting higher costs into their -- if rates have come down and we contracted, we want to take some of that out. But that's still being worked through.\n\nThat's not -- we have to continue to do that. Beyond that, as rates come down, you'll see our prices on items come down, too. \n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nAll right. Thanks a lot. Good evening.\n\nRichard Galanti -- Chief Financial Officer\n\nOK. Why don't we take two more questions?\n\nOperator\n\nCertainly, Richard. Thank you. We'll go next now to Karen Short at Credit Suisse.\n\nKaren Short -- Credit Suisse -- Analyst\n\nHi. Thanks for taking my question. Hope you all have happy holidays coming forward -- going forward. But I did want to clarify on two things.\n\nSo, in the past, when you have had slightly weakening traffic trends that has generally been a point to consider to actually push through higher membership rate increase. So, I'm wondering, I know this is a very unusual time, but has that philosophy changed at all? Because obviously, your comps are changing or in -- or slowing? And then I would ask the same thing as it relates to the special dividend. We all know what your cash is and available cash is on the balance sheet. In terms of timing, with respect to announcing something like that, along the lines of the fact that I think your board meeting is mid-January.\n\nRichard Galanti -- Chief Financial Officer\n\nWe have one every quarter. Look, we talked about both of those. In terms of the fee increase, I think over the last many years, we've probably done them at a time when things were particularly strong comp-wise. The good news is during all times, renewal rates were strong and have gotten even stronger.\n\nWe always look at ourselves in the mirror and feel that the value proposition has gotten better. That being said, we have done them -- I remember one time we were asked, it may have been back in '09, '10, during the Great Recession because I guess we did one probably in '11 or '12, which continued the Great Recession. And we'd be asked given the Great Recession, would you hold off on it? And our view was -- and comps were a little weaker back then, too, for at least a couple of quarters. And I think the comment I made was something to the effect, we'd probably do it anyway because we're going to use it to drive greater value in terms of pricing and everything in a big way.\n\nAnd so, that really -- I think we've probably done it in times of lower comps or higher comps or good economy or tougher economy. And I think with the headline in the -- I probably mentioned in the last quarter call or even the quarter before that, with the headline being recession question mark and inflation exclamation point, there's no rush. And first of all, even if we follow the pattern of the last three -- over the last 16 or so years, they averaged five years and seven months. And I know now that five years and seven months from June of '17 is January of '23.\n\nI know on the last call, I said, that doesn't mean it's going to be January '23. It will be -- it's a question of when, not if. But at this juncture, we'll just have to wait and see. And I'm not trying to be cute about it, but there's not a whole lot more I can tell you.\n\nThere's no analytical framework we use other than we feel very good about our member loyalty and our strength. And if we wanted to do it yesterday, we could. If we want to do it six months from now, we can. So, we'll wait and see.\n\nAs it relates to the special dividend, as you know, we've said before, it's certainly an arrow in our quiver that has boded well for us, we believe. We think that's done well. We've done four of them. The last one was a couple of years ago, and we certainly do have cash.\n\nMind you, when you look at our cash, about half of it's U.S. and not cash equivalents. And so, certainly, we have the ability to do it at some point. I think we wanted to wait and see how things are continuing here.\n\nI think that, too, is probably a question of when, not if. But again, you'll be the second to know after us.\n\nKaren Short -- Credit Suisse -- Analyst\n\nOK. Thank you very much. Have a good holiday.\n\nRichard Galanti -- Chief Financial Officer\n\nSame to you.\n\nOperator\n\nThank you. And we'll take our final question this evening from Robbie Ohmes of Bank of America.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nIt will be a real quick one, Richard. Can you just remind us, you're back to 15 net stores in the U.S., but what has to happen to go back to kind of the years where you would open kind of a net 25 a year in the U.S. and maybe relieve some of the pressure on the over-productive clubs in the U.S. right now?\n\nRichard Galanti -- Chief Financial Officer\n\nYeah. I think it's been a few years. I mean, when we opened the net of 27 or 28, maybe low 20s or 22 or 23 were there. But we've been at maybe 16 or 17 out of 23-ish in the last few years.\n\nIf you ask Craig, who's not in the room, but if you ask him, if we're opening a net of 24 this year, I think I said, what's the goal five and 10 years from now, probably to get it closer to 30 net. And probably, by five years from now, it's 50-50 U.S.-elsewhere -- versus elsewhere. That's the same answer I, by the way, said five years ago in terms of the split. But we'd like to see add five to that 24 in the next few years to go up a little bit higher.\n\nCertainly, we have a lot of activity going on.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nExcellent. Thank you, sir.\n\nRichard Galanti -- Chief Financial Officer\n\nOK. With that, everyone, I'll thank you. Have a good holiday, and we're around to answer questions.\n\nOperator\n\nThank you, Richard. Ladies and gentlemen, that will conclude Costco's fiscal Q1 2023 conference call. [Operator signoff]\n\nDuration: 0 minutes\n\nRichard Galanti -- Chief Financial Officer\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nChuck Grom -- Gordon Haskett Research Advisors -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nRupesh Parikh -- Oppenheimer and Company -- Analyst\n\nBrandon Cheatham -- Citi -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nGreg Melich -- Evercore ISI -- Analyst\n\nPeter Benedict -- Baird -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nBob Nelson -- Senior Vice President, Finance and Investor Relations\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nKaren Short -- Credit Suisse -- Analyst\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nMore COST analysis\n\nAll earnings call transcripts"
}