{
  "companyName": "Paysign",
  "companyTicker": "PAYS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/paysign-pays-q2-2022-earnings-call-transcript/",
  "content": "Paysign (PAYS 7.50%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nHello, and welcome to the PaySign second quarter 2022 earnings conference call. As a reminder, this conference is being recorded. This call may include comments that may be deemed to be forward-looking statements under the federal securities laws and the company intends that such forward-looking statements be subject to the safe harbor created thereby. All statements other than statements of fact included on this call are forward-looking statements.\n\nSuch forward-looking statements include, among others, that our unrestricted cash, anticipated revenues and profits will be sufficient to sustain operations for the next 12 months; that the expected total revenue, gross profit margin, operating expenses, depreciation and amortization, stock-based compensation, adjusted EBITDA, plasma revenues, new plasma center additions, pharma revenues and new pharma co-pay customer additions for 2022 meet our expectations; that the company will continue to post year-over-year improvements; that the company's growth prospects in plasma, pharma and other prepaid business materialize; and that the company will continue to be affected by COVID-19-related labor shortages. We caution that these statements are qualified by important risks, uncertainties and other factors that could cause actual results to differ materially from those reflected by such forward-looking statements. Such factors include, among others, the inability to continue our current growth rate in future periods; that a downturn in the economy, including as a result of COVID-19 and variance as well as further government stimulus measures could reduce our customer base and demand our products and services, which could have an adverse effect on our business, financial condition, profitability and cash flows. Operating in a highly regulated environment, failure by us or business partners to comply with applicable ban regulations, changes in laws, regulations, credit card association rules or other industry standards affecting our business; that a data security breach could expose us to a liability and protracted in cost litigation and other risk factors set forth in our Form 10-K for the year ended December 31, 2021.\n\nExcept to the extent required by federal securities laws, the company undertakes no obligation to publicly update or revise any statements made today, whether as a result of new information, future events or otherwise. This conference call also includes comments about adjusted EBITDA, a non-GAAP financial measure that is neither prepared in accordance with nor an alternative to financial measures prepared in accordance based on any standardized methodology prescribed by GAAP and is not necessarily comparable to similarly titled measures presented by other companies. It's now my pleasure to turn the call over to Mr. Mark Newcomer, CEO.\n\nPlease go ahead.\n\nMark Newcomer -- Co-Founder, Vice Chairman, and Chief Executive Officer\n\nGood afternoon, everyone, and welcome to PaySign's second quarter 2022 earnings call. I am Mark Newcomer, chief executive officer; and Jeff Baker, our chief financial officer, is also with me this afternoon. First, I'm delighted to say that we have finished the second quarter with a level of optimism that we haven't experienced since pre-COVID times. Earlier today, we announced our second quarter revenue was $8.6 million, an increase of $1.9 million or 29% over Q2 2021.\n\nFirst and foremost, we added 62 new plasma centers this quarter. The majority of these centers being transition centers, all in various stages of maturity were added very late in the quarter with very little revenue contribution. We ended the quarter with a total of 437 centers utilizing our services. Additionally, we participated in an RFP sponsored by one of the two largest plasma collection companies in the U.S., which we currently do not provide any services.\n\nIn early July, the company informed us that we were selected to be a supplier. We expect to begin onboarding this new client in early 2023. We also continue to see new entrants in the plasma collection space. And during this quarter, we went live with the initial center for three of these new entrants.\n\nAs our plasma clients continue to execute on their aggressive growth strategies, we remain confident in our continued growth prospects for this segment. Looking at the remainder of the year, we expect to onboard an additional three to four centers each month for a total of 90 to 95 new centers in 2022. Throughout the quarter, we continue to see our load and spend trends improve as the number of plasma donations increased as well as seeing an increase in average donor compensation. Funds loaded on cards was up 40.5% over second quarter last year and up 16.1% over last quarter.\n\nThe first quarter spend volume increased 45.7% from last year and was up 26.8% over last quarter. Adding to our plasma growth, we launched one new patient affordability program in the second quarter. Our pharmacy and medical claims benefit volumes continue to increase month-to-month as programs mature and the pharmaceutical products they support increase in market share. We continue to devote selling and business development resources to addressing industry issues, such as co-pay accumulators and spread margin.\n\nWe have been successful in providing data-driven insights and solutions to current and future clients, helping to drive deep conversations that we are confident will lead to new program wins. The second quarter offered additional opportunities to participate in RFPs and submit bids for new business, both through our hub partners and direct to pharmaceutical manufacturers. We are on track to launch additional programs this year and have a strong pipeline for the remainder of the year and into next. We mentioned on a past earnings call that we signed a processing deal with Spentra, an earned wage payroll provider.\n\nI am pleased to say that we are now live with this new client. Not only does this client expand our product offering into the payroll card space, but with this launch, we completed our direct connect with Mastercard. Our Mastercard connection allows us to offer greater choice to our clients by adding an additional payments network to our offerings. Additionally, with this connection, we are now enabled to support not only payroll but gift, general purpose reloadable, corporate incentive and debit on the Mastercard brand.\n\nThe Mastercard connection also enables EMV, contactless and tokenization support for our products. We are very excited by the opportunities that this new connection with Mastercard will bring. Finally, you may have seen the announcement in the 8-K earlier today with the resignation of Board Director Daniel Spence; and the appointment of Board Director Matthew Lanford, PaySign's president and COO. Dan was one of the original founders of the company and previously held the position of CTO.\n\nHe was instrumental in getting us to where we are today, and we can't thank him enough for his leadership and technical direction. We are supportive of his decision to hand the baton to Mr. Lanford and spend more time with his family in Australia. Everyone here at PaySign wishes him the best of luck in his future endeavors.\n\nWe welcome Matt to our board. And if you are not familiar with Matt's bio, I highly encourage you to visit our website at www.paysign.com. Matt has been a driving force within the organization for over three years and has more than 30 years of experience in the payments industry. With that, I'll pass it over to Jeff to give you more insight on our financials for the quarter.\n\nJeff Baker -- Chief Financial Officer\n\nThank you, Mark. Good afternoon, everyone. As Mark pointed out, we are pleased with second quarter operating results and the foundation we have built for the remainder of 2022 and into 2023. Once again, revenue, loss from operations, EBITDA, adjusted EBITDA and transactional trends all improved year over year.\n\nIt is clear the inflationary environment may be negatively impacting our cardholder's wallet, as the number of loads per average donation center increased 14% from the first quarter of 2022 and 16% over the second quarter of 2021. Given the large number of plasma donation centers that were added in the second half of June, our expenses and cash usage during the quarter were higher than expected as we quickly ramped up these centers with very little revenue contribution to offset this investment. As a result, our monthly revenue per plasma center was depressed at $6,625. To get a read-through of the impact these centers will have going forward, in July, our monthly revenue per center was over $7,000, eclipsing the $3 million mark for July plasma revenues.\n\nI am also pleased to announce that we engaged Moss Adams LLP during the quarter as the company's independent registered public accounting firm for the fiscal year ending December 31, 2022. Moss Adams is a well-regarded public accounting firm with a great deal of experience auditing payment companies. With all of the details we provided in the press release and that will be available in our 10-Q tomorrow, I will simply hit the financial highlights for the second quarter of 2022 relative to the second quarter in 2021. Total revenues of $8.6 million increased $1.9 million or 29% versus the year-ago period.\n\nOf that amount, plasma revenue was $7.8 million, an increase of 31%. Pharma revenue was $773,000, an increase of 21%. And other revenue was $19,000, a decrease of 69%. The average revenue per month per plasma center was $6,625 versus $5,633 last year.\n\nWe added 62 centers during the quarter, ending with 437 centers versus 356 centers at the end of Q2 2021. Also of note, we have added an additional 6 centers since the end of June, bringing our total number of donation centers to 443. Gross profit margin for the quarter was 54.6% versus 47.4%, an increase of over seven percentage points. SG&A Increased 22.5% to $4.3 million and total operating expenses were up 21.5% to $5 million.\n\nAdjusted EBITDA, which adds back stock compensation to EBITDA, was $930,000 or $0.02 per diluted share and marks the fifth consecutive quarter of positive adjusted EBITDA. Regarding the health of our company. We exited the quarter with $6.5 million in unrestricted cash and zero debt, which is a decrease of $860,000 from our fourth quarter ending cash balance. The decline was mainly driven by upfront costs required to launch the new donation centers I mentioned and the timing of payables related to our pharma vendors.\n\nOur adjusted current ratio, which excludes restricted cash, was 2.2 times versus 2.1 times at the end of the fourth quarter. Now turning your attention to our adjusted guidance for the remainder of the year. We now expect our total revenue to grow 27.5% over 2021 coming at the high end of our guidance range of $35.25 million to $38.35 million with upside to that range if some of the headwinds around the tight labor market at donation centers and Mexican nationals with tourist visas being allowed to donate plasma abate. Plasma is estimated to make up about 92% of total revenues for 2022.\n\nWe expect Q3 2022 total revenue to be approximately $10.2 million and Q4 2022 total revenue to be approximately $10.5 million despite two pharma prepaid programs ending in mid-November. Full-year gross profit margins are expected to be between 56% and 57%, with operating expenses expected to be approximately $22 million as we continue to invest in people and technology and experience higher costs in insurance, travel and entertainment and other inflationary pressures. Within total operating expenses, depreciation and amortization is expected to be approximately $3 million while stock-based compensation is expected to be approximately $2.3 million. Adjusted EBITDA is expected to be $4.7 million to $5.3 million with Q3 2022 adjusted EBITDA being slightly higher than Q4 2022 due to the end of the pharma prepaid programs mentioned above and the sequential increases in operating expenses.\n\nLastly, with operating losses narrowing and interest income increasing due to higher bank balances and interest rates, we expect our tax provision to be approximately $55,000 for 2022. With that, I would like to turn the call back over to the moderator for questions and answers.\n\nOperator\n\n[Operator Instructions] Our first question today is coming from Gary Prestopino from Barrington Research.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nReally good solid results. I guess the question that I would have to you Don and Jeff, is, I mean you're putting up phenomenal new business awards here. And could you maybe go through what are you doing to drive that? What's going on in the industry that's giving you the ability to get these new plasma centers and what do you bring to the table that's allowing you to do this or enabling you to do this?\n\nMark Newcomer -- Co-Founder, Vice Chairman, and Chief Executive Officer\n\nYes. I'd be happy to address that. Primarily, the difference is we're participating in RFPs. There's a lot of clients that have had the same providers for a long period of time and really with no value-added services that have been brought on.\n\nSo they may be dealing with the same product they've been dealing with since the beginning of the relationship. And one of the things that we're doing that's very different, as we consistently strive to add new value-added services, such as cashback rewards, pharmacy discount cards, we've added a number of features and functionalities to our products. That with our -- that combined with our uptime and really just our service of the product, I think, has gone a long ways to winning us additional business.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nOK. That's positive. I mean, are you at the cusp now of shifting the market share in the business? I believe at one time, it was 33 67 or something like that in favor of the --\n\nMark Newcomer -- Co-Founder, Vice Chairman, and Chief Executive Officer\n\nYes. We believe that with this quarter, we have become the premier provider of plasma services to the marketplace.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nAnd are you still --\n\nJeff Baker -- Chief Financial Officer\n\nAnd Gary, on the --\n\nGary Prestopino -- Barrington Research -- Analyst\n\nI'm sorry, go ahead, Jeff. I'm sorry, I didn't mean to --\n\nJeff Baker -- Chief Financial Officer\n\nNo. I was just going to say on the actual numbers, based on the public information that's out there, we've gone from 33% to over 40% just with this last quarter.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nOK, to 40%. OK.\n\nJeff Baker -- Chief Financial Officer\n\nOver 40%, yes.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nOver 40% to greater than 40%. OK. That's fine. And then if you didn't -- you said most of the expenses on the cost of goods or the increase in cost of goods was really a function of these new centers.\n\nIs that -- are you -- is that kind of alluding to the fact that you would have been able to keep your cost of goods relatively flat with Q2 -- or Q1, if you hadn't had these new centers come on board?\n\nJeff Baker -- Chief Financial Officer\n\nThey wouldn't have been as high as Q1. Remember, we had given guidance, there were some moving pieces in Q1 that caused the numbers to be that high. But they would have probably been higher. What happened, Gary, is that these centers were launched all after the 15th of June.\n\nSo let's say, 15 days less than a quarter. We had to get cards to all the centers. We had a FedEx cost over there. And then -- so that hit the -- that balance sheet.\n\nAnd then the expense side of it, when a card was issued and a donation was placed on that card, that card moves out of inventory, off the balance sheet and the cost of sales. Every one of these centers, 40-plus of those centers, every person that came in to donate how to get a new card. So we had very little revenue and a lot of expense hitting the P&L this quarter. So we've given guidance to those full-year gross profits being between 56%, 57%, around there.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nSo from the time that a center is connected to your system, when does it start reaching the average revenue per center that your more mature sites generate?\n\nJeff Baker -- Chief Financial Officer\n\nThere is a bleed in. So the best thing to get back of the envelope is for de novo centers, and there were de novo centers in our numbers this quarter, you're talking at least six to nine months to get up to what we would call as more of a healthier center. Some of these centers were already pretty active. And so when we brought those on, that's why I gave the guidance a little read through that we actually saw in the month of July average revenue per center up over $7,000 in July.\n\nAnd then if you run through all the numbers with the number of centers over 7,000, our revenue for plasma revenue for July was over $3 million.\n\nOperator\n\nYour next question is coming from Jon Hickman from Ladenburg Thalmann.\n\nJon Hickman -- Ladenburg Thalmann and Company -- Analyst\n\nNice quarter. Looks like things are turning around for you guys. Could you comment, and maybe there's nothing to say, but this new legislation, what reduced inflation legislation has some healthcare provisions in it. And most notably, Medicare can now negotiate with pharma companies for pricing.\n\nIs that going to do anything to your pharma business and co-pays? And do you anticipate anything really changing with this legislation? Or is everything going to stay the same?\n\nMatt Turner -- Vice President, Head of Patient Affordability Services\n\nThis is Matt Turner here with PaySign. So that should not have an impact on our business. Government-funded beneficiaries are excluded from utilizing co-pay assistance. So that shouldn't have any impact on our business model at all.\n\nI think there are some other industry concerns that could have a positive impact on our business and increase the number of services that we're able to provide to pharmaceutical manufacturers such as the AMCAP being removed in '24. But nothing out of this most recent legislation is either a threat to us or necessarily is going to drive any additional business.\n\nJon Hickman -- Ladenburg Thalmann and Company -- Analyst\n\nOK. Is there -- I wanted to go back to the previous questioner. Is there some target revenue per center that you would like to reach that's kind of optimal?\n\nJeff Baker -- Chief Financial Officer\n\nWell, I mean, we've always said pre-COVID, I mean, the average revenue per center was up over $8,000. But as long as we still have the few headwinds that are remaining out there, the two I mentioned in my prepared remarks, one being the Mexican nationals not being able to come across the border with a tourist visa and give plasma. Before COVID, they were able to do that. Now they're not able to do that.\n\nAnd some of those centers were what I would consider supercenters. So they had a lot of activity, obviously driving the average revenue per center up. And then just like every other business we see out there, I mean the plasma centers are still having labor issues where they can't get enough people in there to get the plasma out of people's arms. But the other factor, the force that's pushing on that is inflationary pressures.\n\nI mean, we are definitely seeing where our cardholders look like they are being negatively impacted by the inflationary pressures, and we saw that through just the sequential increase in the plasma donations per center. So I think that, coupled with increased dollar per load that are -- that these plasma centers are being -- are offering individuals because there's really a supply and demand imbalance in the marketplace. So a lot of -- it's not just one factor. There's multiple factors pushing on one another.\n\nBut yes, we would love it to be north of $8,000 per center on a constant basis. Hopefully, we're reaching that plateau with over $7,000. So we'll see how the rest of the year turns out.\n\nOperator\n\nYour next question is a follow-up from Gary Prestopino from Barrington Research.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nJeff, can we -- can you go back? There's a lot of statistics here. I couldn't copy them down, but what was your revenue per plasma center in Q2?\n\nJeff Baker -- Chief Financial Officer\n\nYes. Yes. Yes. The total was 6,000 -- if I can find it in my notes here, $6,625 for Q2 2022.\n\nGary Prestopino -- Barrington Research -- Analyst\n\n$6,625. What was it for Q1?\n\nJeff Baker -- Chief Financial Officer\n\nQ1 was $6,672.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nOK. And then it just jumped up to $7,000 in July?\n\nJeff Baker -- Chief Financial Officer\n\nCorrect. Over $7,000, yes.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nGreater than $7,000. OK.\n\nJeff Baker -- Chief Financial Officer\n\nAgain, you have -- with all those centers coming on literally in the last 15 days of the month, I mean you really had more in the denominator and not enough in the numerator.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nNo. I'm just trying to get an idea of the ebbs and flows and the shifts. I mean it's an interesting comment that -- what you said about the -- what's going on with the economy that's driving people to donate more plasma, which is a thesis that should play out here. So you are definitely seeing something like that coming through the doors.\n\nAs you add these new centers though, and they mature, does your business on the southern border -- it should become a much smaller percentage of the whole, right? What is it? Like about 7% before all these centers came in on a revenue basis?\n\nJeff Baker -- Chief Financial Officer\n\nIt was. It was 7% -- no, no, not on a revenue, on a per center location basis. It was 7% of our locations. It was more in revenues.\n\nIt was closer to 12% to 15% of the revenues.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nOK. All right. So that's where the impact comes in. All right.\n\nSo -- and obviously, your pipeline looks pretty good as far as you're adding sites. So I mean, as you step back, things are really improving overall for the company, safe to say.\n\nJeff Baker -- Chief Financial Officer\n\nWe're optimistic about the future. Like I said, we've laid a pretty good foundation for 2022 and 2023. And Mark mentioned the RFP that we were awarded, and that plasma company should start boarding in 2023. And that's a very good opportunity.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nYes. That's one thing I didn't get a chance to write down. I was trying to write and listen. So what is that? That's an RFP that you've won, and those are going to start boarding in 2023, Mark?\n\nMark Newcomer -- Co-Founder, Vice Chairman, and Chief Executive Officer\n\nThat's correct.\n\nGary Prestopino -- Barrington Research -- Analyst\n\nOK. Are you at liberty to say how many sites that is or --\n\nMark Newcomer -- Co-Founder, Vice Chairman, and Chief Executive Officer\n\nI mean I'm -- obviously, it's one of the two larger companies that we're currently not servicing. So you could probably come up that it's over 100. But I mean, I don't know what that's going to mean to us right now. So we do not know at this point in time how many centers are going to be allocated to us.\n\nSo it would be purely speculation on my part.\n\nJeff Baker -- Chief Financial Officer\n\nIt's very akin to what happened this quarter, Gary. We were hopeful we were going to get some of these sites that we received. We just didn't know the timing. It was -- we built it into our numbers and the initial guidance that we gave.\n\nAnd fortunately, we were awarded a large portion.\n\nOperator\n\nWe reached the end of our question-and-answer session. I'd like to turn the floor back over for any further or closing comments.\n\nMark Newcomer -- Co-Founder, Vice Chairman, and Chief Executive Officer\n\nI want to thank everybody for their participation in today's conference. Again, we feel that we're making great strides toward recovery. And we want to thank you all, and we will see you next quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMark Newcomer -- Co-Founder, Vice Chairman, and Chief Executive Officer\n\nJeff Baker -- Chief Financial Officer\n\nGary Prestopino -- Barrington Research -- Analyst\n\nJon Hickman -- Ladenburg Thalmann and Company -- Analyst\n\nMatt Turner -- Vice President, Head of Patient Affordability Services\n\nMore PAYS analysis\n\nAll earnings call transcripts"
}