{
  "companyName": "Abbott Laboratories",
  "companyTicker": "ABT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/19/abbott-laboratories-abt-q3-2022-earnings-call-tran/",
  "content": "Abbott Laboratories (ABT -0.47%)\nQ3 2022 Earnings Call\nOct 19, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and thank you for standing by. Welcome to Abbott's third quarter 2022 earnings conference call. [Operator instructions] This call is being recorded by Abbott. With the exception of any participant's questions asked during the question-and-answer session, the entire call, including the question-and-answer session, is material copyrighted by Abbott.\n\nIt cannot be recorded or rebroadcast without Abbott's expressed written permission. I would now like to introduce Mr. Scott Leinenweber, vice president, investor relations, licensing, and acquisitions.\n\nScott Leinenweber -- Vice President of Investor Relations, Licensing, and Acquisition\n\nGood morning, and thank you for joining us. With me today are Robert Ford, chairman and chief executive officer; and Bob Funck, executive vice president, finance, and chief financial officer. Robert and Bob will provide opening remarks. Following their comments, we'll take your questions.\n\nBefore we get started, some statements made today may be forward-looking for purposes of the Private Securities Litigation Reform Act of 1995, including the expected financial results for 2022. Abbott cautions that these forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those indicated in the forward-looking statements. Economic, competitive, governmental, technological, and other factors that may affect Abbott's operations are discussed in Item 1A, Risk Factors, to our annual report on Form 10-K for the year ended December 31, 2021. Abbott undertakes no obligation to release publicly any revisions to forward-looking statements as a result of subsequent events or developments, except as required by law.\n\nOn today's conference call, as in the past, non-GAAP financial measures will be used to help investors understand Abbott's ongoing business performance. These non-GAAP financial measures are reconciled with the comparable GAAP financial measures in our earnings news release and regulatory filings from today, which are available on our website at abbott.com. Note that Abbott has not provided the GAAP financial measure for organic sales growth on a forward-looking basis because the company is unable to predict future changes in foreign exchange rates which could impact reported sales growth. Unless otherwise noted, our commentary on sales growth refers to organic sales growth, which excludes the impact of foreign exchange.\n\nWith that, I will now turn the call over to Robert.\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nThanks, Scott. Good morning, everyone, and thank you for joining us. Today, we reported results of another strong quarter, including ongoing earnings per share of $1.15. Based on our performance through the first nine months of the year, we increased our full-year adjusted earnings per share guidance to $5.17 to $5.23, which is more than 10% higher than the initial guidance flow we provided back in January.\n\nAs you know, the macroeconomic conditions remain challenging. Inflation continues to be a stubborn force globally, but we've started to see some moderating impacts in certain areas of our businesses compared to earlier in the year. At the same time, the U.S. dollar has continued to strengthen, including throughout the most recent quarter.\n\nCOVID remains as unpredictable as ever with intermittent surges continuing throughout the world. And lastly, global supply chain dynamics, staffing shortages continued to impact our healthcare markets, though we're seeing steady signs of improvements. Over the last few months, we've made progress in several important areas following the temporary shutdown of our infant formula manufacturing plant in Sturgis, Michigan earlier this year. We restarted production at Sturgis in July with a focus on our EleCare and other specialty infant formulas.\n\nAnd in September, we began production of several Similac products, which we expect will begin to reach retail store shelves over the coming weeks. We also boosted production in our global network to increase infant formula supply to the U.S. In fact, we delivered roughly the same volume of formula to our U.S. customers this past quarter as we did during the three months prior to the recall.\n\nOur No. 1 supply priority was to the WIC, women, infant, and children, federal food assistance program to ensure that underserved participants would have access to infant formula. During the quarter, we also made leadership changes, both at our Sturgis site and in our organization, and we concluded a month-long investigation into the accusations that were made by a former employee. The investigation, which included extensive document reviews and interviews, concluded that the allegations about quality were unfounded.\n\nAnd during the quarter, the same former employee dropped the federal OSHA complaint. And lastly, we conducted an analysis of the U.S. infant former market and concluded that this country would benefit from more manufacturing capacity and redundancy. As such, we're moving forward with plans for a half-billion investment in a new U.S.\n\nnutrition facility for specialty and metabolic infant formulas. We're currently in the final stages of determining the site location and will work with regulators and other experts to ensure this facility is state-of-the-art and sets a new standard for infant formula production. We recognize there's more to do, but feel confident in the progress we're making, and I want to thank all the Abbott employees that have been working around the clock on this matter. I'll now summarize our third quarter results for our remaining businesses in more detail before turning the call over to Bob.\n\nAnd I'll start with Established Pharmaceuticals, or EPD, where sales increased more than 12% in the quarter. Strong performance was led by double-digit growth across several countries, including India, China, Brazil, and Vietnam, along with broad-based strength across several therapeutic areas. EPD has now achieved double-digit organic sales growth since the beginning of last year, fueled by a steady cadence of new product launches and strong commercial execution. And EPD has also expanded its profitability profile over the same time period, which is quite unique given the current macroeconomic headwinds.\n\nMoving to diagnostics, where COVID test sales of $1.7 billion were significantly higher than expectations but lower compared to last year, which resulted in a modest decline in sales growth overall. The decline in COVID test sales compared to last year was driven by lower demand for laboratory-based tests. Whereas demand for our rapid tests, which include BinaxNOW, Panbio, and ID NOW continues to be strong, with sales this past quarter at a similar amount to the third quarter of last year. Rapid tests have proven to be very important and highly practical tools.\n\nThey provide a quick and affordable way to test COVID almost anywhere and at any time, whether you're experiencing symptoms or just want to know your status before attending events or gatherings. Excluding COVID testing revenues, sales of routine diagnostic tests grew 6% in the quarter overall and even faster internationally, fueled by the continued global rollout of our Alinity instrument for immunoassay, clinical chemistry, and molecular testing. Lastly, I'll wrap up with medical devices, where sales grew 6.5% in the quarter globally. In the U.S., sales growth of approximately 11.5% was led by strong double-digit growth in electrophysiology, structural heart, and diabetes care.\n\nDuring the quarter in the U.S., cardiovascular procedure volumes were somewhat soft in July before strengthening in August and September. Internationally, in addition to similar procedure volume trends, sales were negatively impacted by intermittent COVID lockdowns in China as well as supply constraints in certain areas, most notably in electrophysiology. In diabetes care, sales of FreeStyle Libre exceeded $1 billion in the quarter, and our user base expanded to approximately 4.5 million users globally. In the U.S., where sales grew more than 40%, we initiated the full launch of Libre 3, which automatically delivers up-to-the-minute glucose readings with unsurpassed accuracy in the world's smallest and thinnest wearable sensor.\n\nInternationally, organic sales growth was impacted by a couple of transitory items, including supply constraints on Libre 1 in certain emerging markets, which we expect to improve over the next couple of months. And secondly, a strategic choice we made in Germany to rapidly transition our large existing user base to our latest generation Libre 3 system, which temporarily reduced our focus on new user additions during the quarter in that country. We already transitioned well over half of our users with the vast majority of the remaining users expected to move to Libre 3 by year end. This move strategically fortifies our leadership position in the second-largest continuous glucose monitoring market in the world and further enhances our already strong strategic position as we work to bring the benefits of Libre to more and more people, including those with type 2 diabetes that are not reliant on insulin to manage their disease.\n\nSo in summary, despite the challenging environment, we achieved another strong quarter that significantly surpassed expectations which reflects the strength of our diversified business model and execution. And based on our strong performance for the first nine months of the year, we're once again raising our EPS guidance for the year. I'll now turn the call to Bob. Bob?\n\nBob Funck -- Executive Vice President, Finance, and Chief Financial Officer\n\nThanks, Robert. As Scott mentioned earlier, please note that all references to sales growth rates, unless otherwise noted, are on an organic basis, which excludes the impact of foreign exchange. Turning to our results. Sales increased 1.3% on an organic basis in the quarter.\n\nCOVID testing-related sales were $1.7 billion, which while stronger than anticipated, reflect a year-over-year decline versus sales in the third quarter of last year. Additionally, organic sales growth was negatively impacted by a temporary shutdown of manufacturing at our nutrition plant in Sturgis, Michigan earlier this year. Excluding COVID testing-related sales and the U.S. sales impacted by the temporary manufacturing shutdown, total Abbott sales increased 6% on an organic basis in the third quarter.\n\nForeign exchange had an unfavorable year-over-year impact of 6% on third-quarter sales. During the quarter, we saw the U.S. dollar continue to strengthen versus several currencies, which resulted in a slightly more unfavorable impact on sales compared to exchange rates at the time of our earnings call in July. Regarding other aspects of the P&L, the adjusted gross margin ratio was 55.9% of sales, which reflects the impacts of the nutrition manufacturing disruption and inflation we've experienced on certain manufacturing and distribution costs across our businesses.\n\nAdjusted R&D investment was 6.1% of sales, and adjusted SG&A investment was 25.9% of sales in the third quarter. Lastly, our third-quarter adjusted tax rate was 18.1%, which reflects an adjustment to align our year-to-date tax rate with our revised full-year effective tax rate forecast of 15.5%. The revised full-year forecast is modestly higher than the estimate we provided in July due to a shift in the mix of our business and geographic income. Turning to our 2022 outlook.\n\nFor the full year, we now forecast ongoing earnings per share of $5.17 to $5.23, which is comprised of our year-to-date results through September, plus ongoing earnings per share guidance of $0.86 to $0.92 for the fourth quarter. We forecast total company organic sales growth, excluding the impact of COVID testing-related sales, to be in the mid-single digits for the fourth quarter. Excluding U.S. sales impacted by the temporary manufacturing disruption, we forecast fourth-quarter organic sales growth to be in the mid-to-high single digits for the remainder of our combined businesses, which includes medical devices, established pharmaceuticals, diagnostics, excluding COVID testing-related sales, and areas of nutrition, not impacted by the disruption.\n\nWe forecast COVID testing-related sales of approximately $500 million, which does not assume a COVID testing surge in the fourth quarter. And lastly, based on current rates, we expect exchange to have an unfavorable impact of approximately 7% on our fourth quarter reported sales. With that, we'll now open the call for questions.\n\nOperator\n\n[Operator instructions] And our first question comes from Robbie Marcus from J.P. Morgan.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nGreat. Congrats on the quarter. Robert, maybe we could start, we're already toward the end of 2022. And I think people's attention are really shifting to next year just with so many moving pieces, both in revenues and down the P&L with currency and inflation and COVID testing assumptions and so on.\n\nSo I was hoping sometime at this point in the year, you might give us some early thoughts on next year. Anything you can provide to help us narrow the range of outcomes would be great.\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nSure. I mean, with all those topics, we could spend the whole call on it, right? So I'll provide a broad framework that I can give you here. Obviously, the macro conditions are going to remain challenging, right, Robbie? I don't think that anybody right now as we're planning going into next year, is forecasting that this is just going to ease up, right? So specifically, I would say probably inflation, I don't expect to get better. And I'd say the currency headwinds are very much kind of in play here for next year, right? Those are probably two of the big kind of macro kind of impacts for us.\n\nBut I still see a lot of opportunity for growth as I have been talking about our business and our portfolio. There's a clear path in my mind here for top-line growth of high single digits. And you can get there with a variety of looking at across our businesses. So in medical devices, we've got a lot of upcoming launches and products that we have launched.\n\nSo Libre 3, Amulet, Aveir, CardioMEMS, Navitor, we expect to be launching next year here in the U.S. Inside X, our mapping system, launching a new ablation catheter into the market globally next year also. I'm probably sure there's more that I could kind of rattle off here in terms of devices. So I think the device portfolio looks very strong as we go into next year.\n\nI expect the same kind of growth rate that we're seeing in EPD. I expect to see continued share capture that we're seeing in core diagnostics and then obviously, a strong recovery in U.S. infant nutrition. So like I said, you see that high single-digit growth in the clear path just based looking at how those businesses will perform and how they're performing and the launches that we got upcoming.\n\nThen you mentioned COVID, right? And that's the other piece of the business. so high single-digit growth, excluding COVID. COVID is an interesting one, Robbie, where I think over the last couple of years, we've been talking about the sustainability of COVID. Many of you writing that COVID testing will probably go away.\n\nAnd here we are in the third quarter, in the summer months, with a $1.5 billion, $1.6 billion number here in the third quarter. So I think that as we look -- I want to see how the next few months look like. I think Bob made a comment in terms of our forecast for Q4. We haven't really planned for a big win to surge.\n\nIt's more of an endemic-like forecast for Q4. And I think that's the kind of endemic forecast that we'll see going into 2023. But I think it's -- right now, it's looking like COVID test sales are stickier than most have assumed. So those are the components on the top line.\n\nDown the P&L, as I've said, we're going to be taking a close look at our cost structure. We have been. We've increased that over the last couple of years, made the investments. We talked about those investments.\n\nAnd I'm looking to be able to get a lot of leverage out of those investments that we've made historically. And at the top line, the way it's kind of laid out comes through and the leverage falls through, you're going to see that sales growth falling through at, I'd say, pretty healthy margins. Rob is going to invest in the areas that we know we've got good growth and high growth. Those get the investment dollars.\n\nI think in the past, a lot of you have written about the big three of Abbott, where there was Libre, Alinity, and MitraClip and those are still a big contributor of a driver of growth. But we've got a new class of products, I guess, I would call them the Fab 5, looking at TriClip, Aveir, Navitor, CardioMEMS, and LAA. These products combined are an annual run rate of about $0.5 billion, growing 50% and those will also receive the kind of investments to be able to kind of drive their growth since I think they're, again, in the early innings of growth for us. So we'll look at managing the P&L and our investments in our structures and choosing the areas where we're going to continue to invest.\n\nAnd then other areas, we'll see some of the leverage from the investments that we've made in the past. So as we go into 2023, to say that everything is fundamentally nothing has changed. I'd say, true, our markets are still very attractive. We've got leading positions in these very large, high-growth markets.\n\nI like the pipeline, and we've got a lot of ongoing and upcoming launch activity. So that, I'd say, hasn't really changed. We're going to have to be mindful, obviously, of the cost structure of some of the inflation pressures and FX challenges we have. And then on top of that, we have a strong balance sheet.\n\nAnd we've talked about that and that provides us a lot of strategic and financial flexibility as we go into next year. So that's probably my best characterization here in the condensed version of 2023.\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nThat's really helpful. And maybe one for Bob. The fourth quarter implied EPS guide came in a little bit lower than the Street. We also saw a much bigger FX headwind.\n\nSo how should we be thinking about the impact to the bottom line in third quarter? What's implied in fourth quarter? And if we start thinking about our models for next year, Robert gave us the top-line considerations. How do we think about FX at current rates heading into next year?\n\nBob Funck -- Executive Vice President, Finance, and Chief Financial Officer\n\nYes, certainly. So we've seen the dollar significantly strengthened this year, including throughout the third quarter. And the biggest moves have been really in developed market currencies, the euro, the pound, the yen. So this is something that most, if not all, multinationals are dealing with and certainly not unique to us.\n\nAnd I think, Robbie, maybe these headwinds are a little bit underappreciated in terms of the impact here. We always are looking to mitigate as best we can, but there's certainly going to be a limit here in terms of what can be done. We try to match our cost, hedging program, and take price where appropriate. This year at current rates, our full-year headwind is a little bit more than $0.15 in terms of earnings.\n\nAbout $0.10 of that is happening just in the fourth quarter alone. And so while there are certainly other moving parts, that fourth quarter impact should give you a pretty good feel for the magnitude of headwind that's flowing into next year, particularly in the first two to three quarters of the year. We'll provide our earnings guidance in January as we always do, and we'll contemplate currency rates at that time.\n\nOperator\n\nOur next question comes from Larry Biegelsen from Wells Fargo.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nTwo product-related questions for me. First, I wanted to start with Libre. A lot going on there, Robert. Obviously, the exciting news this quarter was the type 2 basal LCD from CMS.\n\nSo I'd love to hear your thoughts on that opportunity. Our back-of-the-envelope math suggests that could be a $1 billion opportunity for Abbott in 5 years. I'd love to hear if you agree. And just lastly, on the vitamin C timing of that resolution and any color -- any additional color you want to provide on Libre.\n\nAnd I did catch in your prepared remarks, you talked about non-insulin patients that was interesting. And I did have one follow-up.\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nSure. That's the catch-all Libre question. Let me take the CMS one. So it is very exciting.\n\nAnd if I think about your model, you're probably more aligned maybe to my team, but I think my team is cutting it short in terms of what we could actually do with this indication, and I'll tell you why in a second. But it is pretty significant. I mean, you got 4 million basal patients in the U.S., about a third of them are covered by CMS. So this is probably going to be in terms of the timing of public comments and amount of time it's going to take for CMS to make the decision and then the implementation date, etc.\n\nSo this is probably more of a second half 2023 item, I would say, but it's pretty significant. It's going to expand CGM coverage by about 1.5 million patients on CMS. And as you probably know, Larry, one CMS makes that determination then there's a natural flow that will then move into the private commercial market. So I'm looking at the opportunity of ultimately 4 million patients that will have potential to get some sort of coverage and benefit from the technology.\n\nListen, I think that we've -- it's not surprising from the perspective of this coming up because we've been leading in the generation of data and evidence to support this proposal. I think if you do a lit search on all the studies that have been done on CGM and then segment them between pump studies and basal studies and type 2 studies and type 2 with non-insulin studies, you're going to see that Libre's at the head of all of those type 2 study. So I think this is part of the investments that we've been making clinically to be able to show the evidence on how this benefits a broader population. And then with the value proposition that Libre has, it provides us -- I think I know what your model is saying.\n\nI just think that we'll have a disproportionate share of that. This is a market where, whether it's in the U.S. or in Europe, it predominantly drives around primary care, primary care call point, primary care scale, specifically in the U.S., DMEs. And this is a segment where we do very well.\n\nIf you do an audit of prescriptions by physician class, Libre has taken about 80% market share of the primary care Rx. So the team has been working on that. So I think it's a great opportunity. And I think this kind of fuels into this notion of this is a much larger market than has historically been contemplated as part of CGM, and that's what our strategy for the moment we enter the market has been thinking about it, right? We're not looking at sprinting quarter to quarter -- we're looking at this over the long term and making the investments to be able to sustain this kind of growth rate.\n\nWe announced manufacturing capacity expansions also in the quarter for diabetes care because we believe this is a $10 billion franchise by 2028. We believe that we've got pathway between 15 million and 20 million users on this product. So we're resourcing our manufacturing, our scale, our commercial infrastructure, our service, our clinical investments to be able to support what I believe is a significant growth opportunity, and we intend to lead that. I think your other question was on Vitamin C.\n\nYes, we have completed the clinical work on the Vitamin C. I'll provide updates at the appropriate time. I do recognize that this is an important, I would call short-term, medium-term kind of growth driver for us. If you think about our franchise, it's going to be about basal, type 2, and pump integration.\n\nSo think of that the next kind of two, three years of key core growth drivers. And then I'd say, more longer term to get to those numbers, I made an announcement beginning of this year regarding looking at this outside of diabetes on our Lingo franchise, and that will then sustain our growth going forward. So we've made the study. We feel good about the results, and I'll be updating once we have something to update there.\n\nWe are working on pump integrations outside the United States and we'll have a pump integration launch by end of this year, beginning of next year into Europe with one of our pump partners. And I think they're going to benefit a lot from our user base that we have in those countries.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nRobert, that was super helpful. Just for my follow-up, I'd love to get your reaction to the Pascal data at TCT and the launch in the U.S. specifically, your thoughts on the greater durability effect they showed with Pascal. I know we haven't seen that in the MitraClip registries.\n\nAnd just any update on the locking issue we heard about this quarter?\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nYes. So it wasn't unexpected. Every time at TCT, there's always an expectation of a landmark study or an approval. So that wasn't unexpected.\n\nThey got approval for FMR. That's one of the smaller indications, about a third of the market. We've competed with Pascal internationally already for a couple of years. I expect to see some trialing in the U.S.\n\nAnd the question is going to be how much it is going to stick. Internationally, MitraClip has done very well, and we've held on to a good portion of our share. I think in Europe, we're kind of at that 80-20 split. So I think I expect some of those dynamics to play out here in the U.S.\n\nAnd I think MitraClip is going to do very well. Regarding the data set, yes, I mean it was -- I think it was 117 or 120 patients. I think it was maybe versus 63 of MitraClip. I mean we've done over 150,000 implants, Larry.\n\nAnd we've got great data on our products. We do have over 1,000 patients in the registry. I think the data set is pretty small right now. So we're working on our side.\n\nWe're doing our investments in our clinical trials, investments in product advancements, in MitraClip. I think right now, I think the biggest opportunity is market expansion, and we're going to be driving a lot of that with the FMR indication. I think I said this in the last call, I think that one of the biggest impacts we have, for me, as I looked at our portfolio was regarding COVID was not being able to benefit the FMR indication and the NCD. So I think that's the biggest opportunity we have is market expansion and working to get those referrals network set up and driving that demand for further expansion.\n\nSo I think the locking mechanism -- yes, I think we took a field action and I think that's so far going OK. I haven't had any kind of issues, supplies back to normal.\n\nOperator\n\nAnd our next question will come from Joanne Wuensch from Citibank.\n\nJoanne Wuensch -- Citi -- Analyst\n\nI'd like to jump off a little bit from the MitraClip conversation and try and peel apart the double-digit growth in Structural Heart this quarter a little bit stronger than we were looking for. How much of that is MitraClip versus demand for Portico versus maybe something else? And how do you think about developing that segment a little bit further?\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nSure. Well, I mean, I think we've talked about how important the structural heart portfolio was for us even when we go all the way back to the acquisition of St. Jude and really building this franchise. So we've been intentional about doing that.\n\nMitraClip had a good quarter. We had a growth of about 6%. That was impacted a little bit in the U.S. but we had double digit -- almost double-digit growth internationally.\n\nSo if you kind of then back into that, you could see that some of the other parts of the portfolio are now starting to kind of -- as they're gaining in scale, Joanne, they're starting to have a stronger impact on the portfolio. So Amulet and Navitor internationally, I know you mentioned Portico, but I'd say it's probably more Navitor in Europe that did very well for us, and it continues to do pretty well. As I say, we acknowledge that we're behind two market leaders here, but we're making the investments and it's done pretty well. In Europe, I'd say we've got about an 8%, 9% market share in Europe, and the accounts that we actually have Navitor in we're close to kind of mid-teens.\n\nSo that product is very competitive, and we're looking forward to bringing that here to the U.S. We filed it with the FDA and we expect to bring this to the market here in the first half of next year. Scott, maybe you can talk about kind of Amulet and what we're seeing there also.\n\nScott Leinenweber -- Vice President of Investor Relations, Licensing, and Acquisition\n\nYes. I'd say, Joanne, as Robert mentioned, it is kind of the remaining basket of that Structural Heart Business that's driving a lot of the growth there, amulet, being a component of that. Launch in the U.S. continues to go very well, nice traction.\n\nIn particular, I would say, in the early adopter accounts as it started late last year. Our share in those accounts is around 40% now at this point. It just shows you kind of once you get in there and get experience and have an opportunity to drive some deeper penetration that you can really achieve a strong share position, and we're doing that in those early adopter accounts. So as we've added accounts over the first portion of this year, we'll look to do the same thing with them as we go forward.\n\nSo a great opportunity to build, seeing nice growth there. And like I said, like Robert said, kind of a handful of the other items along with TriClip, Navitor, and Amulet here that are driving growth in addition to what you're seeing, and now is the long-term opportunity for MitraClip.\n\nJoanne Wuensch -- Citi -- Analyst\n\nAs my follow-up question, in Nutrition, one of the things we talk with investors about is, how do you think about the recovery in that segment once your supply is back up? Do you see yourself just returning to growth of the market rate or taking a good percentage of the share back? Or any guidance you could give us remodel forward would be helpful.\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nSure. I would say we've gone -- we've had a situation like this back in 2010, and we've seen other competitors have situations like this, Joanne, in terms of the share recovery process. I'd say there's a couple of key things in terms of consideration. And when you think about doing those modeling, it's looking at your share of the WIC program, your ability to continue to call on pediatricians and your share in the hospitals.\n\nAnd I would say we've disproportionately focused in this quarter with our global supply network to focus on those channels. And one of the challenges with that is the WIC channel is a lower-priced channel than what we'd call the non-WIC channel. So that's probably where we made a decision to take our -- take the volume that we had. And like I said in my opening comments, we actually supplied to the market this quarter, what we supplied in the three months prior to the recall.\n\nIt's just the mix of that supply was overly gated toward the WIC states and the WIC contracts that we had. We made a commitment to those states that they would not have backward supply shortages. So we focused on that. And I think by focusing on that, we not only live to our commitments and the contracts that we put in place but that's going to obviously be a base for us as we go into this quarter and into next quarter.\n\nSo if you look at the Nielsen data, you do see share recovery, I'd say, we probably lost about 20 share points from the recall. And I think the last read that I saw in September was we got half of it back. And that is a mix -- this will go to the mix piece where on the WIC side, we've recovered all of our share. And now we're going to take our capacity and start moving it into the non-WIC channel with the non-WIC configuration.\n\nSo like I said, we've intentionally made these decisions in terms of how we're supplying the market. And I think by doing that, just naturally with the work that our teams are doing, we'll start to see the share recovery build month-over-month. So that's probably how to think about it.\n\nOperator\n\nAnd our next question comes from Josh Jennings from Cowen.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nRobert, I wanted to ask about the COVID testing franchise and just the strength in 2022 and thinking about the comp for 2023. Is there anything you can share in terms of contracts that are in place for 2023 and what that base could look like where weather contracts in 2022 could roll over into 2023? I know it's impossible to forecast utilization or uptake of COVID testing next year, but if there's any base commentary you can provide, that would be helpful. And I just have one follow-up.\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nYes, I think that's -- looking at the market between government contracts and nongovernment contracts is something that we spent a lot of time this year doing because obviously, those government contracts, they're high-volume and they ultimately skew a little bit of kind of the run rate as we're trying to kind of run rate this. So if you look at our Q4 number, our Q4 number that we're forecasting is really what I would call an endemic state, right? So about $0.5 billion across the world, across all of our platforms, in a winter season without necessarily forecasting the kind of surge that we saw last year. In that number, we do not have any significant government contracts. Now what governments have realized is that they do need to make some investments and they do need to hold some level of testing inventory in their countries.\n\nSo we have active conversations with a lot of governments and they recognize and realize Abbott's ability to scale up and scale up pretty fast. So we've got plenty of capacity, and they know that, they know the value of our product. They work very well with the -- in terms of determining COVID and the new variants, etc. So we don't have any significant number in 2020 -- in Q4 of this year, we think that that's the kind of -- right kind of run rate from an endemic standpoint.\n\nAnd if there is a surge and if governments realize that they do need to procure more testing, we've got the product, we've got the reliability of the product and we've got the reliability of supply, and they know that. So we're in a good position there.\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nExcellent. Just one follow-up on Libre. You mentioned just the path to achieving full ICGM status and understand there's a segment of the CGM that will open up for Libre, but I was wondering if you could just share your thoughts on the potential impact to clinician sentiment toward accuracy of the platform, payer sentiment in terms of whether there could be any formulary prioritization decisions considering the pricing? And then on the other side of that, how are you -- any new thoughts on pricing for Libre 3 for taking this inflationary environment.\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nSure. Well, listen, this is an important segment, right? Obviously, the vast majority of CGM users and the vast majority of future potential users are people that are either injecting insulin with pens or syringes or not even using insulin, right? But we recognize that this is an important segment. So we're doing -- like I said, we completed the work on Libre 2 regarding the Vitamin C. We'll be updating -- will be updated in the market and our partners as we go through that process with the agency.\n\nBut we also believe that -- we also believe that there is potential to innovate even further in that pump integration, right? And we talked about this last call. We announced this at the ADA in June which is the creation of a dual analyze sensor, a glucose ketone sensor. Everybody -- all the capabilities that I've spoken to that you're -- I guess you're referring to believe that this would be the go-to sensor for pump integration because the ketone functionality provides the added safety feature that would be required, right? So if there's some sort of interruption in insulin delivery from the pump, what is understood clinically is that the ketone levels will rise earlier than the glucose levels and to be able to have that ketone level, that continuous ketone level measurement is an added safety feature for that pump environment. And I think it does provide, I guess, a step ahead in terms of innovation, in terms of pump integration.\n\nRegarding the accuracy, I mean, I think it's commonly understood and the data is very clear in terms of Freestyle Libre -- I mean even FreeStyle Libre 2, but FreeStyle Libre 3 being a definitive best-in-class accurate sensor. It's the only CGM sub-8 MARD. So I don't think we have that issue. So it's an important segment, and we're going to be investing in it, and we're going to -- our goal is to actually provide something that's even more advanced and more beneficial.\n\nSorry, did you have another question on -- pricing. Yes, Libre 3 pricing, Libre 2 pricing, Libre 1 pricing, it's practically all the same, Josh. And the more volume we can get on to Libre 3, the more we can kind of lower those COGS. But we have a parity pricing right now.\n\nAnd we think that that pricing strategy -- as I said last year, as the international markets or even in the U.S., people have challenges either with co-pays in the U.S. or with formularies and reimbursement decisions internationally. I think that our value proposition is very strong, and it's going to prove itself out very clearly as single-payer systems start to look at how to fine-tune their budgets and get more done either with less or with the same amount. So I think that our value proposition, consumer-friendly product with best-in-class accuracy, feature set that has no real gaps, and our pricing strategy, I think it's a complete value prop.\n\nOperator\n\nAnd our next question comes from Vijay Kumar from Evercore ISI.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nRobert, maybe my first one for you. The headline organic ExCo within 3Q was 3%-ish low singles. When you back out some of these the supply chain impact, I think you mentioned Germany at Nutrition, what was the underlying organic growth? And when can we get back to an environment where there is no mismatch in the headline organic and underlying rate? It's a clean number. So maybe just talk about that cadence to normality.\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nIt was high single -- mid- to high single once you do all those exclusions. I don't like doing that. I mean I get that it's important to be able to isolate what the challenges are and what the issues are and are they more transitory or are they more kind of sustained issues in the business. I would say the issues that we've had, the challenges we've had in this quarter regarding supply chain, they're fairly, I'd say, from a med device perspective, they're pretty significant, and they kind of had the impact that we saw in our med device business.\n\nI think if you had look at the kind of back orders that we had, whether it was Libre 1 and some of the back orders that we had in EP, we would be high single digits. But if you back out these issues mid to high overall for the company. Yes, your question of when do we get into kind of normal organic? I think part of the challenge here is COVID -- COVID to play. And as that base becomes smaller than what it is this year, I mean, this year, we'll probably do very much close to the same amount of COVID test sales that we did kind of last year.\n\nBut as we move into next year, and that becomes smaller than this year, we'll see a little bit of an impact on that overall growth rate. But as I said, I think in Robbie's question, I see high single-digit growth once you back out of COVID. And so COVID will be just the determining factor there, but base non-COVID, high single digits next year.\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nThat's helpful. And then maybe one on the financial side. I think gross margins were down Q-on-Q. I'm wondering what was the FX incremental inflation impact.\n\nI think Robert Funck mentioned $0.10 of FX impact in Q4. Should we annualize that to about $0.40 of FX impact for next year? I'm not sure how to think about FX and inflationary impact for next year. And we didn't talk about Lingo. Shouldn't that be an incremental driver here and not '23?\n\nBob Funck -- Executive Vice President, Finance, and Chief Financial Officer\n\nLet me -- Vijay, I'll take the exchange first. I mean, I wouldn't necessarily take that $0.10 impact in the fourth quarter and extrapolate that for the full year of next year. But certainly, through the first three quarters, you would expect to see that. But then in the fourth quarter, you're going to kind of be at those rates that we currently are at.\n\nSo but again, it is going to be a significant headwind for us next year. On inflation, definitely, we're seeing the impacts there. Like others, the biggest impacts we've seen it really around commodities, other manufacturing input cost and logistics. We've incorporated about another $100 million impact to gross margin in our current guidance.\n\nSo that's about $1 billion for the year, so call it, maybe 240 -- probably a little more than 240 basis points on the gross margin. As we -- as Robert said, we've seen a little bit of moderation in the rate of increase in the third quarter to where we were earlier in the year, and we're trying to take some price to offset that really more in our consumer-facing businesses. Kind of given the way that inflation has hit us over the course of this year, the inventory that we purchased and manufacture this year at these higher costs will definitely negatively impact us next year when that inventory is sold even if inflationary pressures start to come down kind of as we get into next year.\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nOn your question on Lingo, Vijay, we have factored in a launch into next year. We have not factored that launch here in the U.S. So it is an international launch. It's a different business model, as I talked about it, more of a direct-to-consumer wellness subscription model.\n\nAnd we're on target here to come out of the gates to that in Q1. We are going to be launching into what I would call a little bit of a challenging environment. So we've taken that into consideration here. But I think that the long-term growth opportunity of building this kind of business, a wellness subscription-like model with the platform that we've built and the scale that we have, I think, is a great growth opportunity for us.\n\nWe do have it factored in into next year probably launching in the beginning of the year and then building from there. But we'll be launching, like I said, in a challenging environment, but I still think it's the right thing to do from a long-term perspective.\n\nScott Leinenweber -- Vice President of Investor Relations, Licensing, and Acquisition\n\nOperator, we'll take one more question.\n\nOperator\n\nAnd we'll take our last question from Travis Steed from Bank of America.\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nI did want to ask on China, how do you see the recovery shaping up there? There's going to be another headwind next year and any new EVPs that you see coming up in China?\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nYes. It is going to be a little bit of a headwind. You can think about it as either currency and EVP. We've gone through this in some other parts of our business.\n\nSo we do expect this value-based procurement or pricing here to play out. I think the next the next area that we're looking at. We've gone through it with stents last year or a year and a half ago, and the next area that we're looking at is probably on the electrophysiology side. That's probably the next category that's up.\n\nIt's interesting, as we've been looking at this, there's definitely interesting impacts in terms of ranges of these pricing. We've actually gone through some of it in pharmaceuticals also. It will range from 30% to 80% in terms of pricing. And really, the magnitude here depends on whether it's a national or regional process.\n\nSome of the categories have been more regional. And they tend to be a little bit lower. And it also depends on the number of participants that exist in that category. So as I look at -- on the EP side, we've also seen that when there are more -- like a system-based approach, Travis.\n\nSo think capital, think about the technical support and the infrastructure associated support that, those tend to be a little bit on the lower end of that range versus to be on the higher end of that range. So that's probably what we've got contemplated for VBP next year is more on the EP side.\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nNo. That's helpful. And I did want to ask about the M&A environment, too, since it hasn't come up yet on this call. And also kind of how it relates to your thinking of the device growth longer term, if you're still able to grow at the high end of med tech.\n\nAnd it's the Fab 5, as you called, is enough to do that? Or if you need to augment device growth with M&A over time?\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nNo, I don't feel that I need to do M&A to be able to sustain that high single-digit growth that we've been posting pretty consistently on devices. I did say in the last call that we're interested and we're being prudent about that interest. The interest has increased and we actively assess all the opportunities here. But as I've said, just because we have a strong balance sheet, and we've got a lot of flexibility, we're still going to make sure that we're going about this from a strategic perspective and we're going about it from a financial perspective.\n\nSo obviously, valuations come down somewhat. And that helps on the financial modeling and attractiveness side from it. But I would say they probably need to stabilize a little bit of these valuations so that you can engage what I would call just meaningful discussions here. And I think as those stabilize, I think you'll see the environment pick up here in terms of M&A.\n\nSo we're in a good position. Don't need to do M&A, but there's a lot of opportunities out there for us, and we're going to apply that consistent framework of strategic and financially disciplined in terms of how we look at that. So I'll just sum up here. Q3 was probably a very challenging quarter for us, probably our most challenging.\n\nObviously, the impact of inflation and supply chain and some of the back orders that we encountered was a headwind. Some of the FX as we go forward also will be a headwind. But you saw the portfolio strength and the execution here coming through that, all those challenges and delivery, not only in the quarter but also for the full year, as evidence of our full-year raise here also. So it's also provided us an opportunity to make some strategic choices, to strengthen our business and to strengthen our position and build our momentum, I guess, to Robbie's comment in the beginning about how everybody shifting to 2023 and so are we.\n\nAnd we made some choices and decisions here to be able to prepare us and build our momentum and strengthen our position as we go into 2023. I saw a nice recovery in the institutional businesses. And our pipeline here that we talked a little bit about is going to sustain that growth acceleration. There's a lot of organic growth opportunities that we've got in 2023.\n\nAnd I highlighted here how I see a clear path for high single-digit revenue growth. And then on top of that, we've got a strong balance sheet, and that's going to allow for a very balanced capital deployment to our shareholders and also allow us to fuel future growth. So with that, I'm going to wrap that up. Thanks.\n\nScott Leinenweber -- Vice President of Investor Relations, Licensing, and Acquisition\n\nThank you, operator, and thank you for all of your questions. This now concludes Abbott's conference call. A webcast replay of this call will be available after 11:00 a.m. Central Time today on Abbott's Investor Relations website at abbottinvestor.com.\n\nThank you for joining us today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nScott Leinenweber -- Vice President of Investor Relations, Licensing, and Acquisition\n\nRobert Ford -- Chairman and Chief Executive Officer\n\nBob Funck -- Executive Vice President, Finance, and Chief Financial Officer\n\nRobbie Marcus -- JPMorgan Chase and Company -- Analyst\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nJoanne Wuensch -- Citi -- Analyst\n\nJosh Jennings -- Cowen and Company -- Analyst\n\nVijay Kumar -- Evercore ISI -- Analyst\n\nTravis Steed -- Bank of America Merrill Lynch -- Analyst\n\nMore ABT analysis\n\nAll earnings call transcripts"
}