{
  "companyName": "Enphase Energy, Inc.",
  "companyTicker": "ENPH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/25/enphase-energy-inc-enph-q3-2022-earnings-call-tran/",
  "content": "Enphase Energy, Inc. (ENPH -0.20%)\nQ3 2022 Earnings Call\nOct 25, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Enphase Energy third quarter 2022 financial results conference call. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Karen Sagot. Please go ahead.\n\nKaren Sagot -- Investor Relations\n\nGood afternoon, and thank you for joining us on today's conference call to discuss Enphase Energy's third quarter 2022 results. On today's call are Badri Kothandaraman, our president and chief executive officer; Mandy Yang, our chief financial officer; and Raghu Belur, our chief products officer. After the market closed today, Enphase issued a press release announcing the results for its third quarter ended September 30, 2022. During this conference call, Enphase management will make forward-looking statements, including, but not limited to, statements related to our expected future financial performance, the capabilities of our technology and products, and the benefits to homeowners and installers.\n\nOur operations, including manufacturing, customer service and supply and demand, anticipated growth in existing and new markets, the timing of new product introductions and regulatory matters. These forward-looking statements involve significant risks and uncertainties and our actual results and the timing of events could differ materially from these expectations. For a more complete discussion of the risks and uncertainties, please see our most recent Form 10-K and 10-Qs filed with the SEC. We caution you not to place any undue reliance on forward-looking statements and undertake no duty or obligation to update any forward-looking statements as a result of new information, future events or changes in expectations.\n\nAlso please note that financial measures used on this call are expressed on a non-GAAP basis unless otherwise noted and have been adjusted to exclude certain charges. We have provided a reconciliation of these non-GAAP financial measures to GAAP financial measures in our earnings release furnished with the SEC on Form 8-K and which can also be found in the Investor Relations section of our website. Now I'd like to introduce Badri Kothandaraman, president and chief executive officer of Enphase Energy. Badri?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nGood afternoon, and thank you for joining us today to discuss our third quarter of 2022 financial results. We had a good quarter. We reported record quarterly revenue of $634.7 million, achieved quarterly non-GAAP gross margin of 42.9% and generated free cash flow of $179.1 million. Approximately 47% of our Q3 microinverter shipments were IQ8.\n\nWe exited the third quarter at approximately 43, 12, 31. This means 43% gross margin, 12% operating expenses and 31% operating income, all as a percentage of revenue on a non-GAAP basis. We will go into our financials later in the call. Let's now discuss how we are servicing customers.\n\nOur Q3 NPS worldwide was 70%, compared to 68% in Q2. Our North American NPS score was 71%, the same as Q2. Our average call wait time was 4.8 minutes, compared to 4.7 minutes in Q2. The elevated call wait times over the past few quarters are related to the rapid growth in our business.\n\nWe're not happy with the call wait time and we are targeting to get our call wait times under a minute by more aggressive staffing of our teams in U.S., Europe, and Australia. We remain laser focused on customer service. The emphasis on superior customer experience has further increased due to severe weather events. During the recent storm in Puerto Rico and Florida, our customer service team, field service technicians and engineers were able to help customers with the issues they face.\n\nWhile our systems perform well in general, there is some more room for improvement. Our focus is to ensure seamless installer and homeowner experience through such events. Our teams have shared many stories with us of their efforts to help customers and customers have also expressed their deep gratitude for the help. I'm quite proud of our teams.\n\nLet's talk about microinverter manufacturing. Our situation remains quite stable right now due to diligent supplier management as well as qualification of multiple sources. Our quarterly capacity is around 5 million microinverters today. We are on track to begin manufacturing at Flex Romania starting in Q1 2023, enabling a global capacity of 6 million micros per quarter.\n\nThe Inflation Reduction Act, or IRA, has extended the investment tax credit, ITC, for residential solar to 30% for another 10 years and also implemented a stand-alone storage ITC with the same terms, both are very good for the industry at large. In addition, the IRA has a provision for $0.11 per AC watt production-based tax credit for domestic manufacturing of microinverters. Therefore, we have been actively looking at manufacturing in the U.S. We are working with three contract manufacturing partners, one new and two we have today already.\n\nWe plan to open four to six manufacturing lines in the U.S. by the second half of 2023. Our thought process is that we will need the additional capacity anyway considering our fast-paced growth globally. There are still a lot of questions to be answered regarding the actual implementation of the IRA for domestic manufacturing.\n\nU.S. Department of Treasury is seeking comments from stakeholders in early November for clarification on these questions and we are working with industry partners and stakeholders to provide comments. Once the IRA with details have been finalized and the implementation is clear, the U.S. manufacturing could provide substantial benefits in terms of the production-based tax credit.\n\nLet's talk about IQ batteries. We are on track to add an additional cell pack supplier from China early next year for a third-generation battery. Our lead times for batteries are 10 to 12 weeks, allowing us to respond a little more quickly than before to customers. Let's move on to the regions.\n\nOur U.S. and international revenue mix for Q3 was 71% and 29% respectively. We experienced strong growth in Q3, both in North America as well as in Europe. In U.S., our revenue increased 7% sequentially and 69% year on year.\n\nWe had record quarterly revenue and record sell-through for microinverters in Q3. Our microinverter channel inventory in the U.S. was at a very healthy level at the end of Q3 while our storage channel inventory was a little elevated due to longer installed times. I'll go into more details about our IQ batteries later in the call.\n\nIn Europe, our revenue increased approximately 70% sequentially and 136% year on year led by strong demand for our microinverters in Netherlands, France, Germany, Belgium, Spain, and Portugal, and for our IQ batteries in Germany and Belgium. Microinverter supply continues to be tight and channel inventory continues to be below normal. We continue to invest heavily in Europe. We are expanding engineering, sales, and customer service teams along with opening a manufacturing line in Romania in Q1 2023.\n\nIn addition, we expect to begin shipments of IQ8 microinverters into the Netherlands and France in the fourth quarter and rest of Europe in the first half of 2023. We also plan to introduce IQ batteries into Austria in the fourth quarter. We recently acquired GreenCom Networks, a home energy management software company with headquarters in Germany. The acquisition allows us to add a local engineering team to service the accelerating clean energy transition in Europe, provide installers with a complete home energy management system integrating Enphase microinverters and Enphase batteries with third-party EV chargers and heat pumps and enable homeowner to monitor and control all of these devices from the Enphase App.\n\nIn summary, we are quite pleased with our growth in Europe, look forward to the continued momentum. In Latin America, revenue increased 100% sequentially and 129% year on year. We have steady growth in our solar plus storage business in Puerto Rico during Q3 and expect continued growth in the region as demand for solar and storage has increased since the recent hurricane. The storage attaches nearly 100% in Puerto Rico.\n\nOur IQ8 Microinverters as well as IQ Batteries provide a differentiated solution invaluable to customers during a storm. Now I'll provide some general color on Australia, Brazil, and India. In Australia, the solar market continued to recover in Q3 and we believe the forecasted increase in electricity prices will drive demand. We expect to introduce IQ Batteries in the first half of 2023 in Australia.\n\nYes, for Brazil, we had sequential revenue growth in Q3 due to a steady increase in demand for IQ7A microinverters. In India, we made progress on adding more installers in the Enphase Installer Network. The module power is substantially increasing in these emerging markets. We plan to introduce a 480-watt AC high-power residential microinverter in the first half of 2023 to match the increase in module power.\n\nLet's discuss the company's overall bookings for Q4. Our demand for Q4 is quite robust and easily exceeds the higher end of our guidance range. As for Q1, it's a little bit early to comment, but we see that the bookings are quite healthy right now. On supply, the component availability is getting better.\n\nThere are still some spots of tightness that keep coming up from time to time and our operations team is doing a nice job closely managing the situation. The logistic situation has also improved a little bit with reduced shipping times. Let's talk about batteries. We have now certified approximately 2100 installers worldwide since the introduction of IQ batteries into North America, Germany, and Belgium.\n\nWe shipped 133.6-megawatt hours of IQ batteries in Q3. We are working hard to improve our customer experience as it is not yet up to our standard. We continue to host weekly installer round table to deeply understand their pain points. Our installers in North America experienced a median commissioning time of 118 minutes exiting Q3.\n\nWe have made substantial improvements in our software, which was just released a few days ago to reduce commissioning times further and make grid transitions more robust. With these changes, we expect the median commissioning time to improve to 80 minutes exiting Q4. The third generation of our IQ battery product will have additional features which further addresses the installer pain points. Our installers are extremely busy, given the strong demand.\n\nAny inefficiency in the installation process impacts their profitability. This means the battery installation experience must be as good as the microinverter experience, which is what we are working to improve. With the significant changes we are making in the product, we are confident that storage installations will become as efficient as microinverter installations, and as a result, installer profitability will improve and storage deployment will accelerate. We expect to ship 120 to 135-megawatt hours of IQ batteries in Q4.\n\nAnd we expect steady progress throughout 2023. On the new product front, we expect to generate our third-generation IQ battery starting in North America and Australia in the first half of 2023. We then plan to introduce it into Europe and emerging markets in the second half. The battery will have wired connectivity to the IQ Gateway and System Controller via a CAN bus.\n\nThe modularity of the battery is 5-kilowatt hour. The battery will have double the continuous and peak power compared to the second generation enabling heavier loads such as air conditioners to start more easily. We are targeting commissioning times to be sub 30 minutes with this battery. With every generation of batteries, we expect to make steady improvement in the customer experience just like what we did with microinverters.\n\nWe're already working on our fourth-generation IQ battery to be introduced in 2024, which will result in a substantial energy density improvement compared to the third generation. Let's talk about our product for small commercial solar in the U.S. Based on customer feedback from pilot runs on IQ8D, which was our previous product, we are increasing the power of the microinverter by 50% from 320 watts to 480 watts DC. And we are reverting back to a single-panel architecture.\n\nWe understand this is a few more months of delay, but we think it is a right long-term decision as panel power continues to increase rapidly in the small commercial space. We expect to pilot this product in the first half of 2023. This product is very closely aligned with the 480-watt residential micro inverter for emerging markets, except for the three-phase cabling. We are bullish about penetrating the small commercial solar business shortly with this powerful new product.\n\nLet's discuss EV chargers. We shipped more than 6,370 chargers in Q3 compared to 8,250 in Q2. We are on track to manufacture Enphase branded EV chargers at our contract manufacturing facility in Mexico by the end of this year, helping us to increase capacity and cut down cost. As for new products, we expect to introduce smart EV chargers to U.S.\n\ncustomers in the first half of 2023 followed by Europe. We are excited about this product as it will provide connectivity and control, enabling use cases like green charging and allowing homeowners visibility into operation of their Enphase solar plus storage plus EV system through the Enphase App. We are very bullish about our EV charging business and continue to invest in it significantly. Let me give you a quick update on our Enphase Installer Network or EIN.\n\nWe have now onboarded more than 1200 installers to our EIN worldwide through a highly selective process focused on installation, quality, and an exceptional experience to homeowners across the globe. We have talked about our installer platform on previous calls, from lead management to design and proposals to FinTech connectivity, to automated permitting, to installation and commissioning and operations and maintenance. We recently added battery design and document management features to our solar graph software. We are also making enhancements to our solar graph software to cut down permit plans to creation cycle times significantly.\n\nNext, I'd like to comment on NEM 3.0 in California. As of now, there is still no decision from the California Public Utilities Commission, CPUC. We hope the CPUC eliminates the grid participation charge while providing a glide path for the solar-only market, as well as incentivizing the solar-plus-storage market. In summary, we are happy with our performance and strong demand for our products.\n\nWe are working on several important initiatives to grow our business fully ramping IQ8 Microinverters across the world, fixing customer experience on our IQ Batteries, accelerating our business in Europe further, and introducing high-power IQ8 Microinverter variants for residential and small commercial solar markets. With that, I will turn the call over to Mandy for a review of our finances. Mandy?\n\nMandy Yang -- Chief Financial Officer\n\nThanks, Badri. And good afternoon everyone. I will provide more details related to our third quarter of 2022 financial results as well as our business outlook for the first quarter of 2022. We have provided reconciliations of these non-GAAP to GAAP financial measures in our earnings release posted today, which can also be found in the IR section of our website.\n\nTotal revenue for Q3 was $634.7 million, representing an increase of 20% sequentially and a quarterly record. We shipped approximately 1,709 megawatts DC of microinverters and 133.6-megawatt hours of IQ batteries in the quarter. Non-GAAP gross margin for Q3 was 42.9% compared to 42.2% in Q2. The increase was driven by a favorable IQ8 mix partially offset by the further strengthening of the U.S.\n\nstarted against the Euro. Our Q3 gross margin was negatively effective by 70 basis points from the euro to USD has declined from Q2, here gross margin was 42.2% for Q3. Non-GAAP operating expenses were $78.6 million for Q3 compared to $71.2 million for Q2. The increase was driven by investment in R&D customer service and sales.\n\nGAAP operating expenses were $132.5 million for Q3, compared to $125 million for Q2. GAAP operating expenses for Q3 included $49.1 million of stock-based compensation expenses and $4.8 million of acquisition-related expenses and amortization for acquired intangible assets and restructuring charges for site consolidation. On a non-GAAP basis, income from operations for Q3 was $193.9 million, compared to $152.4 million for Q2. On a GAAP basis, income from operations was $135.4 million for Q3, compared to $94 million for Q2.\n\nOn a non-GAAP basis, net income for Q3 was $175.5 million, compared to $149.9 million for Q2. This resulted in non-GAAP diluted earnings per share of $1.25 for Q3, compared to $1.07 for Q2. GAAP net income for Q3 was $114.8 million, compared to GAAP net income of $77 million for Q2. This resulted in GAAP diluted earnings per share of $0.80 for Q3, compared to $0.54 for Q2.\n\nWe exited Q3 with a total cash, cash equivalents and marketable securities balance of approximately $1.42 billion, compared to approximately $1.25 billion at the end of Q2. In Q3, we generated $188 million in cash flow from operations and $179.1 million in free cash flow. Capital expenditure was $8.9 million for Q3, compared to $8.7 million for Q2. Now let's discuss our outlook for the fourth quarter of 2022.\n\nWe expect our revenue for the fourth quarter of 2022 to be within a range of $680 million to 720 million, which includes shipments of 120 to 135-megawatt hours of IQ batteries. We expect GAAP gross margin to be within a range of 39% to 42% and non-GAAP gross margin to be within a range of 40% to 43%, which excludes stock-based compensation expenses and acquisition-related amortization. We assume a conservative euro FX rate in our Q4 guidance and we don't expect significant impact to our financials from the USD strengthening, given most of our revenue is denominated in US dollars. We expect our GAAP operating expenses to be within a range of $152 million to $156 million, including approximately $65 million estimated for stock-based compensation expenses, restructuring charges for site consolidation, acquisition-related expenses, and amortization.\n\nWe expect our non-GAAP operating expenses to be within a range of $87 million to $91 million. As we discussed last quarter with a year-to-date profit reported. We expect to utilize all of our net operating loss and research tax credit carry forward in 2022 and become a U.S. cash taxpayer.\n\nOur non-GAAP tax expense reflects cash tax expense and reserves, we expect our non-GAAP tax expense for the fourth quarter 2022 to be approximately 15% of our non-GAAP profit before tax. We expect GAAP tax expense to be approximately 22% of profit before income tax for the fourth quarter of 2022. Moving forward to 2023, we expect to have our non-GAAP and GAAP tax rate at 22%, plus or minus 2% before any IRA impact. If IRA is implemented with favorable terms to us for domestic manufacturing, our tax rate may be reduced from 22%.\n\nIn closing, we are pleased with our financial performance at the midpoint of our Q4 guidance plus the first three quarters of 2022 actuals, we estimate 2022 year-over-year revenue growth of 67%, while extending our non-GAAP gross margin to 42% and non-GAAP operating income to 29% of our estimated 2022 revenue. With that, I will now open the line for questions.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] Our first question is from James West with Evercore ISI. Please go ahead.\n\nJames West -- Evercore ISI -- Analyst\n\nHey, good afternoon, Badri.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nHi.\n\nJames West -- Evercore ISI -- Analyst\n\nBadri, curious how you're thinking about potentially increasing your manufacturing expansion, in particular, Europe given the strong growth there. Do you think it's time to maybe go ahead with another? I mean, you're bringing one line on now, I understand that, but bring another line on. And then maybe secondarily with the IRA, how are you thinking about U.S. manufacturing capacity?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nRight. We talked about it earlier in the prepared remarks, so we are opening a line in Flextronics in Romania, and that will start production in Q1 of 2023. That's got a fully automated line. The capacity is around 750,000 units.\n\nWe'll review that and see if we need to add one more line immediately. Now coming to the U.S., we explain the following, because of the production-based tax credit of $0.11 a watt on microinverters manufactured in the U.S. We are planning for domestic manufacturing here. We are working with three contract manufacturing partners, two of which are existing and one of which is new.\n\nWe are planning to add a total of four to six lines in the U.S. At this time, we are planning that by the end of Q4 2023, so four lines, per line would be 750,000 units a quarter. Four lines would be 3 million units a quarter in the U.S., six lines would be 4.5 million units a quarter in the U.S. We are going ahead with those plans because for us, any way we need the auto lines regardless of where they are, so we are already going ahead with the capital because we need those lines no matter what.\n\nBut then we are looking at the finer details of the IRA implementation plan, we are working with the Department of Treasury as well as all the stakeholders there. And basically, there are some key details and clarifications that need to be finalized, regarding domestic content, etc. Once all of those are clear to us, then we can tell you more precisely the financial impact of our actions.\n\nJames West -- Evercore ISI -- Analyst\n\nOK, very helpful. Thanks, Badri. And then one question on the battery side, you talked about the install. It may be issues there that the 118 minutes or so and you're getting that down.\n\nIs that really surely a software and maybe modularity issue on the actual battery itself or is there more to that?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nWell, I mean it's a complex system and it's got it's a mixture of both hardware and software and basically -- yes, first of all, to give you a big picture there, we introduced our batteries in the third quarter of 2020. We introduced batteries at that time. Our premise was it's an AC-coupled battery. It's an air-cooled battery.\n\nThere is no liquid cooling. It's modular 3.3-kilowatt hours added at a time. It is easy to use and we plan to provide 24/7 support, all in one system with solar plus storage. Where I think we needed to do better was in installation experience of installers, the commissioning time.\n\nIt's no secret. We have highlighted that in almost every call. The commissioning time was multiple hours before that. Now, it's a lot better.\n\nIt's a lot more stable. We have learnt a lot. It's incredible. The amount of learning that, that we got in the company.\n\nIn addition to commissioning times, are there issues? Your question, making the battery perform flawlessly through all types of grid transitions is by no means easy. We have learned that in places like Puerto Rico where the grid basically can have a very, very deep slope, which is very high slope, things can change drastically. The voltage and frequency can change. Yet, we need to make sure customer experiences is right.\n\nAnd we have learnt a lot. We made mistakes. We've learned from it from both our installer round tables as well as customer calls. We have gotten better and better and better with every quarter.\n\nI think now we are in a great shape is what I would say. We just released software that'll help in commissioning and a better experience on great transition like what I said. We are incredibly optimistic on storage. Our installers, when we meet with them on a weekly basis, they want to install more of Enphase batteries and we need to help improve their profitability.\n\nSo I think that the improvements that we made will help a lot. In addition, we learn from one generation to an to another generation like how we have eight, we are in our eighth generation of microinverters. We are going to be in a third generation of batteries pretty soon. There we are going to go to a wired architecture.\n\nToday, our battery is based on a ZigBee wireless architecture. We're going to go to a wired architecture. It's very similar to the automotive standard, which is the CAN bus that'll make communications quite robust. In addition, we are going to double the continuous and peak power, which means that it becomes -- they don't need to buy more kilowatt hours for their air conditioner, yes, for example.\n\nSo we'll be able to provide a lot more juice for the same kilowatt hours in terms of discharge power. So the combinations of all the things I said, I think we are in a fantastic shape. Our installers want to use us and we are going to make steady progress throughout 2023.\n\nJames West -- Evercore ISI -- Analyst\n\nOK. Great. Thanks, Badri.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Colin Rusch with Oppenheimer. Please go ahead\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nBadri, thanks so much for the detail on the incremental functionality in the battery. I'm curious about the decision to add those features in. Is that coming from the field? Was that on the roadmap initially? And are those elements real drivers for incremental demand as you bring them forward in your view?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. I mean, they are coming both, some were already planned and some are coming from the field. This is why we meet with our installers and their requirements. They have a long list of requirements, which we carefully review and we put into the features.\n\nWe are already planning, I said about the third generation that will come in the first half of 2023. We are already working on the fourth generation. Our technology team, the CTO team is already working on the fourth generation that's got more feedback from the installers. Our product development cycle times are a little bit long, which is what I'm potentially working on.\n\nAnd so to answer your question, I mean, we are learning all the time from the field. Some things are just good to do that we have already planned prior, but a lot of things we learn from our installers.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nThat's super helpful. And then on the commercial rooftop market, in terms of changing the approach, can you talk a little bit about the margin opportunity with the change in architecture in this approach versus what we had thought about before with the two models per microinverter and how we should think about that relative to corporate margins?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. I mean our thought process when we talked about IQ8D before was, OK, we can generate, we can get a 640-watt microinverter that addresses two panels. That means per panel the microinverter will produce 320-watt AC. And yes, we have been a little bit delayed on that product.\n\nAnd when we did pilot testing a few months ago, our installers basically once again gave us feedback that the module roadmap for small commercial is well beyond 500 watts right now. And if it is 500, you take 500 divided by 320. That's the DC, AC ratio of 1.5. 1.5 is not ideal.\n\nWe want to stay under 1.3. So for us, we thought about it hard. We said in our installer feedback is critical. We need to change.\n\nWe need to get a product with much higher AC power. Earlier, we were not that much advanced on GaN. Now, what we can do is to pack that 480-watt AC power into the same footprint for IQ9. So in IQ9, we plan to have that 480 watt of AC in the same footprint as IQ8D.\n\nAnd how is that possible? It is possible because of innovative technology like GaN. So GaN stands for gallium nitride, gallium nitride output transistors right now we use silicon transistors 600 volts silicon transistors. These GaN transistors can basically, they have the thermal characteristics can withstand high power. And so those will enable us to keep the footprint quite competitive in state of the art.\n\nAnd then the additional benefits are the GaN allows us to operate the feds at a higher frequency. Today, we operate at a 100 kilohertz. GaN allows it to operate a lot more up to 1 megahertz. We are planning to utilize 1 megahertz for IQ 10, but on IQ9, we will probably be around 200 to 300 kilohertz.\n\nAnd then what happens is the transformer scales basically to one over the square root of the increase. So that means that the transformer can come down, the size of the transformer can come down. The transformer is big, you've seen the round thing there in the top left of the microinverter, that's the transformer. So that footprint can come down, the volume can come down, the FX can still be the same.\n\nAnd soon there will be an opportunity, although we are not planning to do in the DC stage yet, implement again in the DC stage, there is opportunity for us to implement again in the DC stage as well. So lots of optimization possible. Name of the game is to keep the footprint the same, not bloated. Size is important for us and I think we can get the cost structure as well under control.\n\nAnd if we are able to pack in 480 watts AC punch into similar number of components, similar cost structure, then we directly get the cost benefit there in terms of cost per watt.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nOK. That's super helpful. Appreciate it.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. Thank you.\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nI'll take it offline. Thanks, guys.\n\nOperator\n\nThe next question is from Mark Strouse with J.P. Morgan. Please go ahead.\n\nMark Strouse -- J.P. Morgan -- Analyst\n\nYes, good afternoon. Thank you very much for taking our questions. I've got two questions. Maybe I'll just kind of roll them into one.\n\nThe IQ8, I believe you mentioned that was 47% of shipments this quarter. I believe in 2Q that number was 37%. Just kind of what drove that, that seems like a relative kind of slowing in what I would've expected kind of the progression over the coming quarters to be. And then the second part of that is kind of despite that relatively slowness in IQ8, gross margins are still coming kind of ahead of expectations.\n\nSo just a bit more color on those two metrics, please.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. If you see, you got to look at it a little bit carefully. It's 37% of 3.3 million microinverters that we shipped in Q2, that's approximately one point something in Q2, while now it is 47% of 4.3 million microinverters. So therefore, I would say, the IQ8 microinverter volume is doubled from Q2 to Q3.\n\nWhat we have seen historically is the transition, is complex. It can take over four to six quarters. That's what -- I mean, around four to six quarters. This is what we told you before.\n\nWe started Q1 was at 20% I think or 19%, Q2 37%, Q3 47%. We expected to further climb in Q4. Our target is to get to 90% conversion in Q2. That's what our target is.\n\nYou asked a question on gross margin. On gross margin, our product mix of IQ8 was higher, like what I told you, 47%. In addition, we do several initiatives on world-class cost. It's not that we are here only working on IQ7 to IQ8 conversion.\n\nWe are constantly looking at what are the opportunities for us to save money. It could be in parting price negotiation. It could be converting our bulkhead from a custom bulkhead to a standard bulkhead. So we can eliminate cabling.\n\nIt could be working on a cost of a heat spreader. It could be working on elimination of a small IC by integrating it into the ASIC. So we have a lot of cost reduction programs that are ongoing at any point in time and we are seeing some other benefits of that coupled with IQ8.\n\nMark Strouse -- J.P. Morgan -- Analyst\n\nVery helpful. I'll take the rest offline. Thanks, Badri.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Brian Lee with Goldman Sachs. Please go ahead.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nHey, guys. Thanks for taking the questions. Maybe first one for you, Badri. Appreciate the color around the U.S.\n\nmanufacturing strategy here heading into 2023. Can you kind of speak to, I know you mentioned four to six lines and number of units per line, but your megawatt capacity on the inverter product, the microinverter product has been going up steadily, 320, 350, 390 is what you printed this quarter, but then you've got the commercial product that's going to be all the way up to 480. So as we kind of think about mix implications for what the actual megawatt capacity or gigawatt capacity is going to be. Can you kind of get a sense of should we be thinking you're doing 130-watt micros on average out of the four to six lines? Are you going to be doing some commercial as well? So it'd be all the way up to 480.\n\nAnd then I guess consistent with on that same topic, the two to three contract manufacturers you're talking to in the U.S. What are the sort of early discussions around the credit? Is this going to be a credit you fully capture? Are you going to share some of the economics? What are some of the discussions you're having with those partners? And then I have a follow-up.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. I mean the answer to your first question is quite simple. We believe the U.S. residential market as well as the Europe residential market will keep -- module requirements will keep going up and we have the right products in the IQ8 family to take care of it.\n\nWe have a product. The highest power family in the IQ8 family is IQ8H and that is 384 watts AC. So we expect slowly our mix to move from IQ8 plus to IQ8H over the years. However, the emerging market, if you see India, if you see Australia, if you see Brazil, even pockets in France, etc., is there the module power is increasing disproportionally and 550 watt panels sometimes are common there.\n\nSo the 480-watt AC micro will be able to address residential emerging markets for solar. Then I talked about small commercial. The same 480-watt micro with minor changes for three-phase cabling, we'll be able to address the small commercial market for quite some time. Because there again the panel power is climbing about 500.\n\nEven if it goes to 600, this product will still have an outstanding DC/AC ratio. So to answer your question, most of the volume will be closer to the 384 watts over time. Portion of it will be at 480. And these lines I'm planning and it's still early days, these lines I'm planning can produce product for everybody, not just the U.S.\n\ncould also produce product for other markets. Second question you asked, how are the financial discussions with the contract manufacturers? We are still in the early stage. We have signed a letter of intent with those. However, I think we still need a lot more clarifications from the U.S.\n\ngovernment on what kind of domestic content they need and other rules, whether it's a direct pay or whether it's a tax credit there are still many fine details that need to be ironed up. However, for us, the logic is we are anyway growing fast as a company we have to build extra lines somewhere. And therefore, these lines that I invest in they're not going to be wasted. They're not going to be extra.\n\nThey will probably be required. You can think about it as I'm accelerating them by a few months. So stay tuned. As we know more, we will share a lot more details with you on the financial benefit.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nOK, fair enough. Super helpful. Just if I could squeeze in a quick modeling one. I know this can be lumpy quarter to quarter, but if I look at the implied ASP per watt this is the first quarter in a while where it was down sequentially and by a decent amount versus the size this quarter.\n\nIs there something in the mix here this quarter? How should we be thinking about that price trend into 4Q especially outpaced 3Q market? Thanks.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. I mean regarding pricing, the pricing remains stable, so it must be mix related. And I will have our team follow up with you after.\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nOK. I'll take it offline. Thank you.\n\nOperator\n\nThe next question is from Eric Stine with Craig-Hallum. Please go ahead.\n\nAaron Spychalla -- Craig-Hallum Capital Group -- Analyst\n\nYeah. Hi, it's Aaron Spychalla on for Eric. Thanks for taking the question.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nThank you.\n\nAaron Spychalla -- Craig-Hallum Capital Group -- Analyst\n\nThanks. On the battery side, you kind of mentioned the China capacity coming on the first quarter. Can you just remind us, what that gets you to and then how you're thinking about capacity as we look forward? And then any thoughts on kind of U.S. as you think about that?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. I mean, the third-generation battery is going to be released in the first half of 2023. And for that battery we are going to add an extra cell pack supplier from China. And in general, you should think about our battery capacity is going to be well north of 250-megawatt hours a quarter.\n\nThat's what we are going to get to. With regarding U.S. manufacturing of batteries, we don't have any concrete plans at this point in time. We are looking at it, but we will share something when we are ready.\n\nAaron Spychalla -- Craig-Hallum Capital Group -- Analyst\n\nUnderstood. Thanks. And maybe just one follow-up. Great growth in the EU.\n\nCan you just kind of talk a little bit about the competitive dynamics there with the growth you're seeing? And then just you touched on it a little bit, but maybe a little more on the investments that you're looking to make in those markets?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. So in Europe, we are very strong in Netherlands. We are continuing to win customers there. We are strong in France as well.\n\nWe are starting to grow a lot significantly in Germany. We have had a healthy business in Belgium. Spain is also ramping for us, Spain and Portugal are ramping for us. We are starting to look at Poland, Austria there will be starting to ramp a lot of our efforts there as well as Italy.\n\nThat's the high-level view. What we realized from Germany is that sector coupling is very popular. So what does that mean and why is it important? The natural gas crisis in Europe is causing people to consider full home electrification. When you want to electrify your home, you need everything to be connected.\n\nYou need your mobility needs to be connected to your energy system. Your heating equipment need to be connected. So a sector coupling is basically the intersection of the renewable energy sector with the mobility sector and the heating sector. Therefore, any energy management solution that we provide needs to talk to these seamlessly.\n\nThis is why we bought a home energy management software company called GreenCom Networks. All they do is to efficiently network third-party EB chargers and heat pumps to our solar, meaning end-phase solar and storage. So that we can address, we can help in the full home electrification trend that is happening in Germany. So that's a big deal.\n\nIt's a big deal and it is accelerated due to the energy crisis that slowly spreading to the other regions as well. And I think eventually, although Europe is ahead, eventually it'll come down, it'll come to the U.S. and other reasons too. So that's big for us and we are excited to have an engineering center in Germany now to cater to customers.\n\nWe are also introducing, as far as IQ8's are concerned, we are introducing IQ8's to all countries in Europe as well as Australia. We are introducing to Netherlands and France in Q4 and we will introduce to more countries in Europe by the first half of 2023. As far as batteries are concerned, today Germany and Belgium are where we sell our batteries to. We are going to add Austria pretty soon, Austria by the way, very interesting market.\n\nI think it is 800 megawatts of solar and with a very healthy attach rate, almost greater than 80%, so very interesting market, will be playing there pretty soon. I talked about Poland already. We are making plans, so lots of things happening there. And because we started off from a small revenue base in Europe, we've been growing quite nicely.\n\nWe doubled Europe revenue from 2020 to 2021. We are going to once again double the revenue from 2021 to 2022 and we expect very healthy high double-digit growth from 2022 to 2023.\n\nAaron Spychalla -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks for all the color and for taking the questions.\n\nOperator\n\nThe next question is from Phil Shen with ROTH Capital Partners. Please go ahead.\n\nPhil Shen -- ROTH Capital Partners -- Analyst\n\nGuys, thanks for taking my questions. First one's on storage. Was wondering if you could talk through what your expectations for battery sales might be for next year. How should we think about the growth trajectory of storage as we get through 2023? I know you haven't given official guidance, but I was wondering if you might be able to just give a little bit of color on what the expectations might be now.\n\nThanks.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. We usually do not guide for more than one quarter. We already told you the number for Q4 $120 million to $135 million. We are doing the right things for the business.\n\nBased on our conversation with the installers, they love using the product. We need to fix a few things like what we talked about. We are going to be introducing our third-generation battery pretty shortly. So we are incredibly optimistic on our storage volumes.\n\nWe expect storage volumes to continuously improve through 2023. Europe is another good story as well on storage. The volumes are low right now, but they're starting to ramp up and be meaningful. So between the fixes that we did, the third-generation coming out, Europe's starting to ramp up heavily on batteries, I'm very, very optimistic on 2023.\n\nPhil Shen -- ROTH Capital Partners -- Analyst\n\nGreat. That's great color. Thanks, Badri. As it relates to 2023 again, but just for the general micro business I know there's not official guidance, but was wondering if you could talk through, how does a potential recession maybe some potential for demand slowing in 2023 for resi solar in the U.S.? How are you thinking about that? Are you seeing any of initial signs of that at all? And I think you saw the 70% year-over-year growth in Europe this quarter, what kind of sequential growth could we see in Europe as we get through next year for the microinverter business? Thanks.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes, I mean the, you asked us, do we see any slowdown? We don't. Our demand is very strong as we see it. It's of course too early to talk about Q1, but even Q1 bookings are right now quite healthy. So that's what we see today.\n\nThere are a few factors that are in favor for us. The utility rates are continuing to climb, so that accelerates our business. The IRA, Inflation Reduction Act and the ITC extensions for both for ITC 30% ITC for solar and storage are fantastic. So those also provide a nice launch.\n\nAnd then for us this is not true in the U.S. but Europe, the energy crisis in Europe is accelerating renewables big time. So these are the three things where we are seeing a lot of tailwinds from these three things and our demand is strong.\n\nPhil Shen -- ROTH Capital Partners -- Analyst\n\nGreat. Thanks, Badri.\n\nOperator\n\nThe next question is from Steve Fleishman with Wolfe Research. Please go ahead.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nYes. Hi, good afternoon. Thanks. Badri, just in thinking about U.S.\n\nmanufacturing, could you give us any color on what the cost difference might be in the U.S. and how much of the $0.11 that could offset in terms of just manufacturing costs here?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes, I mean it's too early to talk about it, Steve. But again the $0.11 per watt is the big number, if you do the economics, you see, let's say I ship a inverter with 384 watts of AC, $0.11 a watt $43, right? And the manufacturing cost that, of course, we have the total manufacturing cost, which is bill of materials plus value-added manufacturing. The bill of materials will roughly stay the same regardless of the, there may be some small changes, but if domestic content is not required, the bill of materials will likely stay the same. So therefore the variable here is value-added manufacturing and how efficient the contract manufacturers can set up the factories? What level of automation they can have? How can we help in them achieving great levels of automation.\n\nThat's the question. Those are the discussions we are having right now. But we see a very clear benefit at the end of the day, which is very meaningful. That's why we are going to go ahead and plan for this.\n\nBut having said that, we do need clarification on a few points that I already said. The domestic content, the forms of credit, the way it'll be given, etc. So, we are going to iron out those details hopefully in the next three months and things will be a lot clearer. But for now, we are investing in it, like what I said many times already, we are already our growth, we are growing sequentially quarter on quarter.\n\nSo therefore we need the additional capacity anyway regardless of the location. So, our investment will not be redundant or will not go waste.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nAnd just in terms of the U.S., the relative competitive position that you see, because I believe the string inverter credit is more like $0.06. Do you see whatever the cost is kind of a relative competitive position improvement in U.S.?\n\nRaghu Belur -- Chief Products Officer\n\nYes, hi. This is Raghu. Really what it is us from a price -- if this year, I mean I assume it's more like a pricing question than when you say competitive, look, we'll always price to value, right? No matter what. And so what that means is that putting the cost issues aside, regardless of where we manufacture or if we manufacture in the U.S.\n\nand whatever obstructs that we get from the production-based tax credit, the pricing, we are always going to do a price added value. And today we are our competitive position is very strong with the current pricing where it is. And we'll never change that strategy of pricing that -- we are not chasing market share by lowering prices. We are chasing market share by adding value.\n\nAnd so that doesn't change. I hope I answered your question. I took a slightly different route.\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nNo, that's helpful. Last very quick question just on, Badri, you mentioned these positive drivers for demand utility rates, IRA, Europe energy crisis. I guess the one negative might be higher financing costs. How much, if at all, are you hearing that as a concern from your installer network?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nLike what I said, I mean, we haven't seen any slowdown in demand. Our backlog remains strong. Our Q1 bookings remain healthy. So yes, I can only react to the data points, I see.\n\nRaghu Belur -- Chief Products Officer\n\nJust to add to what Badri said, bear in mind ITC has also gone up in the U.S. So, what would've been 22% ITC next year is now back up to 30%. So that is an offset as well.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nThat's right.\n\nOperator\n\nThe next question is from Julien Dumoulin-Smith with Bank of America. Please go ahead.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nExcellent. Hey, good afternoon Badri and team. Thank you and congratulations again. So just on the cost side of this equation, right, I mean I just want to make sure I heard you right on the U.S.\n\nmanufacturing, I mean, how much of an incremental cost and/or incremental need from U.S. content is it required? I'm just trying to understand the relative cost under the ledger versus the $0.11 a watt that we're talking about. I guess that you guys hold onto the $0.11. I'm just trying to understand what the offsets would be, especially considering the fact that you still have a pretty good line of set on U.S.\n\ngrowth and therefore being able to just serve U.S. demand from U.S. manufacturing, and avoiding logistics at the same time. So the net, net, net of the two of those, as best you understand it today, obviously considering I guess still pending,\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nRight. So like what I said, maybe you did not hear what I said. Is the production-based tax credit is $0.11 per AC watt. If we take a 384-watt micro-inverter, that is $43 of credit.\n\nNow when we look at our microinverter, you have bill of materials and then you have value-added manufacturing cost, and then you have overhead, which is warranty expenses and all of those. So if you see all of those constitute the cost of the product. Now the bill of materials, assuming there are no restrictions on domestic content, expect the bill of materials to be roughly staying the same. The value-added manufacturing cost is the one that's the variable cost depending on the country.\n\nAnd then the warranty expands in logistics, freight, etc., largely the same because now it is local and while the cost to ship raw materials to the U.S. may increase, but the cost to ship to customers will decrease. So that is a wash. So really if you consider those three components, we need to look at one portion of that, which is value-added manufacturing.\n\nNow our contract, it needs to be economical for our contract manufacturers as well. They also need to make, they also need to be profitable. It's not going to happen if they do not make any money. So, therefore, we are working on finalizing the agreements we do have letters of intent, which we think are reasonable constructs and bottom line is with the constructs we have in mind, provided this AR implementation is approved.\n\nI think the money to be made or the credit that we can get would be significant and it'll create a lot of jobs, which is really what we want.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nRight. I was just making sure I heard you right. It was a pretty bold and impressive statement. So excellent.\n\nAnd then just outside of that, obviously, opex trends heading well here of late. Can you comment at all on that? Just, I mean, again, the sustainability of the trends that you're seeing of late and any comments on perspective as you continue to scale here, opex relative to rest?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nOpex, we are growing so fast that it is impossible for opex. It's impossible for us to spend money, yes, spend a lot of money. But that doesn't mean we are changing the model. Our model is 15% of sales.\n\nSooner or later, it'll settle down to that number. We will not compromise on any investment on microinverters, batteries, EV chargers, home energy management system, installer platform, all of them are very important for us. We will not compromise one bit on that.\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nGot it. All right. Turn off. Thank you, guys.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Gus Richard with Northland. Please go ahead.\n\nGus Richard -- Northland Capital Markets -- Analyst\n\nYes, thanks for taking the question. Just wondering, you guys have been growing at 70%. Can you sustain that level of growth? And I'm not asking for a forecast and if not, where do you see the limits of growth coming in? Is it your installer network? Is it availability components? Could you just discuss that a little bit it'd be helpful?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nRight. When you start from a small base, of course, the growth is going to be high. And then when you build it to some respectable numbers after that, the question is are we going to be able to sustain the growth? We think there are great drivers for sustaining the growth, which is the utility rates even in Europe, for example, in Germany are quite high. The energy crisis is accelerating in our renewables in Europe.\n\nSo all of those are external drivers. They're tailwinds that are in our favor. So we think we can sustain good double-digit growth percentages in general. But we do need to maintain a focus on quality and customer experience.\n\nAnd many of the installers love the quality on microinverters. And our market share gain that we have is based upon our quality plus the customer service that we provide them on microinverters. I talked about some stumbling blocks on storage and we are working on them and we expect storage will be also providing a similar customer experience enabling us to unleash that opportunity as well in Europe. So we are incredibly optimistic like what I said, we doubled from 2020 to 2021.\n\nWe doubled a gain from 2021 or we will double the gain from 2021 to 2022. And 2022 to 2023 it may not be possible for us to double, but we will have very healthy double digit, high double-digit growth percentage.\n\nGus Richard -- Northland Capital Markets -- Analyst\n\nGot it. Thanks so much.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Joseph Osha with Guggenheim. Please go ahead.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nHello. Two questions. First, Badri, you gave some very helpful sort of rates of increase for your different geographies. I'm wondering if you could just do a very high level, give us a sense as to how the U.S.\n\nversus all of Europe versus everything else breaks down?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes, we said in the prepared remarks, 71% of our sales came from North America, 29% came from rest of the world.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nYes, and I'm sorry to give you a hard time, I was kind of after how that 29% might break down?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nOh, yes, the 29% breakdown most of it in Europe right now.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nOK. Thank you.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nI think most of, yes, most of it is in Europe. If you ask, which are the regions that are strong in Europe, they are Netherlands, France, Germany, and followed by Spain, Belgium, Portugal.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nThank you. I was just after the waiting of that 29% and that answers the question. Thank you. And then I'm going to completely shift gears for the second question.\n\nObviously, wide-bandgap materials make great sense for that really high performance, that you use in the switch. But I was interested to hear you say that we might see some wide-bandgap stuff on the DC side as well. Can you give us a little more sense as to what you're thinking about there?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nThe same thing, the DC stages for GaN will also make the form factor very efficient and the thermals pretty efficient. So sometimes, you can -- today, we have four facts on the AC site with GaN, you can do interesting things like make those four facts -- two facts because we can combine two of them. So GaN helps us to do a lot more things than in the same footprint as we have today.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nSure, yes. Just that, that, yes, and typically in these applications you see people using it in that application you just described, which is that high performance fed on the switch, but I'm just curious on the DC side, it's not quite demanding and it's some expensive thing to do. So I'm just wondering if you could talk a little bit about what you meant with that.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes, if you struggle -- if you look at the way the module power is increasing one way is that's happening is you're seeing the format of the cells increase from 156 millimeters to 180 to 210, and then they're moving to half-cut cells and sub-strings within the cell. So what that's driving is that the current part of the module is also going up, which means that we need to handle higher current on the input stage of our microinverters. So you want to make that stage as efficient as possible as well, because you don't want to compromise the efficiency of the input stage. You're already doing a good -- we are going to move to gain feds on the AC side, improve the efficiency on that side but you're at the same time we're going to make sure that we also improve the efficiency on the DC side as the module trend changes toward higher current.\n\nThat's the other driver for driving toward using GaN on the DC side as well. So what that means overall is drive higher efficiency, drive higher efficiency has the benefits of obviously better yield, but more importantly, better reliability, better thermals. Better thermals means you can reduce the size of the part GaN also obviously allows you to drive to higher frequency, which also shrinks all of the components such as transformers, common mode chokes, inductors, etc. So all in all, it's a very positive trend when you move GaN both on the DC side as well as the AC side.\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nOK. No thanks. That point on occurrence is very helpful. Thank you.\n\nOperator\n\nThe next question is from Kashy Harrison with Piper Sandler. Please go ahead.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nGood afternoon. Thanks for taking the questions. So with respect to the line that you're adding in Romania could you share any thoughts on how long you think it may take for that facility to be producing that peak capacity, maybe just using historical line editions as a reference? And then can you remind us if the COGS that you're going to be paying for Flex is going be in USD for that facility or is it going to be in Euros?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes. We are going to start producing in Romania from Q1 2023. Historically, it has taken us very short time, one to two quarters to ramp to full capacity. We'll be able to do 750,000 micro inverters a quarter.\n\nSo by the first half we should be by and large ramped up. And Mandy Yang, the question --\n\nMandy Yang -- Chief Financial Officer\n\nYes. The cost we pay Flex is in USD.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nOK, helpful, thank you. And then just, just one quick clarification from just the general discussion on the small commercial product. Badri, are you implying that the small commercial product is effectively IQ9 given the discussion on GaN, or is it not IQ9?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nWell, the small commercial product will start with what is called as an IQ8P. This IQ8P product is IQ8 high power. That will be 480 watts AC single panel, single micro and we are utilizing all the work we did for the IQ8D basically a larger form factor with silicon junction fits. And then what we will do with IQ9 is to shrink that form factor to be identical to what we have today, yet achieve 480 watts of AC, and that's the power of GaN.\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThe next question is from Pavel Molchanov with Raymond James. Please go ahead.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nThanks for taking the question. Two quick ones on M&A. You've done, I think, five deals in the past 12 months. What would your organic top-line growth rate be if you strip out the M&A?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nIt's hard to answer, but I'll give you some color. We started working on the installer digital platform. Our first acquisition was Solargraf. We did that in Q1, January 26th of 2021.\n\nWe did that. We then followed it actually let me -- let me back up Solargraf basically provides software to installers to provide a proposal to the homeowners. It also has got connectivity to various financial partners -- FinTech partners. So that's the first acquisition we did.\n\nThe second acquisition we did was we bought a company in India called it -- it's a company called DIN and we bought a portion of that company, which made or which created permit plan sets for installers in the U.S. and turned them around in QuickTime. So that's two. And then the third one is basically 365 Pronto.\n\n365 Pronto is a two-sided marketplace that brings service providers with customers and the customer may be an installer wanting to do something like replacing a cellular modem at a homeowner site. So he doesn't have the labor. He contracts the labor from a labor marketplace. That's 365 Pronto.\n\nThe fourth one is ClipperCreek. That's more straightforward. We have already broken it out, and that's EV chargers. And why we bought EV chargers is because of why we made the GreenCom acquisition too.\n\nThis is EVs are going to be ramping up. It takes a lot of power or energy to charge your electric vehicle and EV will accelerate solar and storage even more. And the homeowners really need to be able to manage the EV they want, I mean, the way they want to. They should be able to say, I want to charge the EV through solar.\n\nI want to charge the EV at this particular time. So it needs deep interaction with the solar plus storage system. That's why we bought that company. The last one we bought was SolarLeadFactory, and that is a gain for providing installers leads.\n\nCan we provide installers, leads for an attractive price in the name of the game is leads are so high quality that the probability of them converting to a final installation is a lot higher than competition. So that was the fifth acquisition. And then, yes sorry, the sixth one is the one I did recently, which is GreenCom Networks in Europe where, once again same concept in order for full home electrification, renewable energy must be connected to mobility as well as heating. It's called sector coupling.\n\nHome energy management software is critical. GreenCom provides that software so that homeowners can add, can see what they want through one app, one mobile app not multiple, multiple sources. So all of these together, we expect for example GreenCom to that home energy management system to accelerate the sales of our solar plus storage systems starting in Germany because now the installer has got a credible story, he can go to the homeowner and say that look, I can connect solar, Enphase solar plus storage and I can connect it with your heat pumps. I can connect it with your EV chargers.\n\nI can help you manage it from one app. So he's got a credible story. We expect that to drive demand. And so you can see even Solar Leads Factory where we help our installers with leads is tightly coupled to our business.\n\nSame thing on Solargraf, that again is, we have a large installer base and they know that we do things with high quality. So they start using that as a service. That's their premise. That's why we bought it.\n\nAnd by offering installers a one-stop shop having all of these services, it just becomes easy for them to not even think, just buy from us. Of course, the flip side is we have to make them highest quality. It doesn't come for free. We have to work on it.\n\nWe have to make it the highest quality. But our strong belief, if we do this right, that organic meaning the core business, solar plus storage will ramp even more. So it's hard for me to break things out and we cannot say this installer purchased extra inverters because of this particular software, hard to break out. But that's the rationale.\n\nYes and you're seeing, some of the benefits you will start seeing, especially the Europe ramp, you'll start seeing some.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nThat's very helpful. And as you were -- out each of those deals, it struck me how much more diversified your sales mix is versus two years ago. In that context, will you start breaking out revenue by product line, versus just giving a micro inverter in megawatts?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nWell, I mean, we don't plan to right now, but when things get meaningful and big, Mandy will take a look at it.\n\nPavel Molchanov -- Raymond James -- Analyst\n\nAll right. Thank you.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Christine Cho with Barclays. Please go ahead.\n\nChristine Cho -- Barclays -- Analyst\n\nHi, thank you for squeezing me in. On the battery side, I know you mentioned install times as kind of being impediment to, growth here on the deployment, but it also just looks like attach rates are down across the board in the U.S. not just for you, but for other batteries that are supposedly easy to install. And supply doesn't seem like it's an issue.\n\nSo is it possible that pricing is at a place where it's negatively impacting demand and customers are just waiting for our prices to come down? And kind of with that as a backdrop, how should we think about how battery prices will trend with your third-generation battery?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nYes, I don't think it's a pricing issue. The demand remains strong. We have a particular advantage is, we do work with several thousands of long tail installers, so we get direct feedback from them. They will, they have limited time on their hands.\n\nIf they perceive storage as hard to do and not very profitable, they have to tilt their time toward solar where they know how to do it and they're profitable. So it's our job, the other companies do, but that's where we need to improve. Enphase needs to improve. I'm not talking about others, Enphase needs to improve.\n\nWe need to fix the installer experience. We need to make it easy to install. And we believe that pricing is not an issue. We think the storage ITC provides an enormous benefit.\n\nWe also think that the power outages are becoming more common. Resilience is important for people. So demand is high, the labor is limited. We have to make, we have to do a good job.\n\nEnphase has to do a good job if, in order for us to improve the volume significantly.\n\nChristine Cho -- Barclays -- Analyst\n\nOK. And the 130-megawatt hours that you guys did this quarter, is it possible to get a break of that across the U.S., Germany, and Belgium?\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nWe don't usually break it out. Once again we don't do that, but Mandy will take an action item to see if, we will consider breaking out for the next year.\n\nChristine Cho -- Barclays -- Analyst\n\nOK. And then if quickly, if I could just touch upon your Euro exposure. I think in the prepared remarks, you said 70 bps on the currency deterioration. I'm not sure if I got that right.\n\nAnd I think in the past you've potentially talked about evaluating hedges sometime in the future. What are your thoughts here, and especially as you continue to grow Europe you've also said there's I think, a partial offset on the cost side. I would assume that's mostly labor. But aren't your raw materials mostly denominated in USD? So if we could just get a little color on what your mismatching currency is?\n\nMandy Yang -- Chief Financial Officer\n\nSure. So first of all most of our costs are in USD, right? So our exposure really is on the sales that are denominated in a Euro, right? But as I provided some color earlier, right our FX exposure still very limited, right? Because most of our sales are denominated in USD, right? With that said, we are actually evaluating hedging program, right? We are watching the Central Bank's rate hikes in both regions, right? When it makes sense, we would trigger the hedging against our euro revenue. So yes, that's what I will put by.\n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Badri Kothandaraman for any closing remarks.\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nAll right. Thank you for joining us today and for your continued support of Enphase. We look forward to speaking with you again next quarter. Bye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKaren Sagot -- Investor Relations\n\nBadri Kothandaraman -- President and Chief Executive Officer\n\nMandy Yang -- Chief Financial Officer\n\nJames West -- Evercore ISI -- Analyst\n\nColin Rusch -- Oppenheimer and Company -- Analyst\n\nMark Strouse -- J.P. Morgan -- Analyst\n\nBrian Lee -- Goldman Sachs -- Analyst\n\nAaron Spychalla -- Craig-Hallum Capital Group -- Analyst\n\nPhil Shen -- ROTH Capital Partners -- Analyst\n\nSteve Fleishman -- Wolfe Research -- Analyst\n\nRaghu Belur -- Chief Products Officer\n\nJulien Dumoulin-Smith -- Bank of America Merrill Lynch -- Analyst\n\nGus Richard -- Northland Capital Markets -- Analyst\n\nJoseph Osha -- Guggenheim Partners -- Analyst\n\nKashy Harrison -- Piper Sandler -- Analyst\n\nPavel Molchanov -- Raymond James -- Analyst\n\nChristine Cho -- Barclays -- Analyst\n\nMore ENPH analysis\n\nAll earnings call transcripts"
}