{
  "companyName": "ALTIMMUNE INC",
  "companyTicker": "ALT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/altimmune-inc-alt-q2-2022-earnings-call-transcript/",
  "content": "ALTIMMUNE INC (ALT 2.43%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Altimmune Inc. Q2 financial results conference call. [Operator instructions] As a reminder, this call is being recorded. I would now like to introduce your host for today's conference call, Rich Eisenstadt, chief financial officer of Altimmune.\n\nRich, you may begin.\n\nRich Eisenstadt -- Chief Financial Officer\n\nThank you, Carla, and good morning, everyone. Thank you for participating in Altimmune's second quarter 2022 financial results conference call. Members of the Altimmune team joining me on the call today are Vipin Garg, our chief executive officer; Scot Roberts, our chief scientific officer; and Scott Harris, our chief medical officer. Following the prepared remarks, we will hold a question-and-answer session.\n\nA press release with our second quarter 2022 financial results was issued this morning and can be found on the investor relations section of the company's website. Before we begin, I'd like to remind everyone that remarks about future expectations, plans and prospects constitute forward-looking statements for purposes of safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Altimmune cautions that these forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from those indicated, including those related to the ongoing conflict in Ukraine, COVID-19, and the impact on our business operations, clinical trials and results of operations. For a discussion of some of the risks and factors that could affect the company's future results, please see the risk factors and other cautionary statements contained in the company's filings with the SEC.\n\nI would also direct you to read the forward-looking statement disclaimer in our earnings press release issued this morning and now available on our website. Any statements made on this conference call speak only as of today's date, Thursday, August 11, 2022, and the company does not undertake any obligation to update any of these forward-looking statements to reflect events or circumstances that occur on or after today's date. As a reminder, this conference call is being recorded and will be available for audio replay on Altimmune's website. With that, I will now turn the call over to Dr.\n\nVipin Garg, chief executive officer of Altimmune.\n\nVipin Garg -- Chief Executive Officer\n\nThank you, Rich, and good morning, everyone. We appreciate you joining us today for a discussion of our second quarter 2022 financial results and business update. We continued to advance multiple clinical trials for our lead obesity product candidate, pemvidutide, a GLP-1/glucagon dual receptor agonist, and are excited about the reporting important data from these trials in the coming months. One thing that has become abundantly clear over the last 12 months is that we now have two truly effective drugs to combat the obesity pandemic and with promising additional drugs on the horizon.\n\nGiven the increasingly competitive obesity space, it's important to highlight the potential differentiating features of pemvidutide. First, we believe that we have the potential to achieve weight loss equal to or exceeding 20% after only 48 weeks of treatment, confirming the benefit of adding glucagon agonism to GLP-1 monotherapy. We also believe the robust reduction of serum lipids observed in our Phase I trial could translate into important cardiovascular benefits with long-term use, further increasing the value proposition of our drug candidate. Finally, we believe that the absence of dose titration will be viewed as a major advantage in the minds of prescribers and patients, simplifying management by avoiding the cumbersome use of dose titration over the first four to five months of therapy.\n\nWe are planning to announce the top line data readout on our Phase Ib multicenter trial in subjects with obesity or overweight and non-alcoholic fatty liver disease, or NAFLD, in mid-September. The key readouts will include assessment of liver fat, weight loss, serum lipids and safety at 12 weeks of treatment. Scott Harris will join us shortly to discuss our expectations for that readout. In addition, we are currently executing a 12-week, double-blind, placebo-controlled extension to this trial and expect data readout after 24 weeks of treatment in Q4 2022.\n\nWe believe that the 24-week readout will provide valuable information about the weight loss that could be achieved with pemvidutide at one year of treatment. Our 48-week Phase II MOMENTUM trial of pemvidutide in subjects with obesity and overweight is enrolling rapidly. Approximately 25 obesity study centers are now enrolling in the trial across the United States. As of yesterday, August 10, we had randomized 167 subjects, and we expect to fully enroll the 320-subject trial population by the end of the third quarter.\n\nA 24-week interim analysis, which was initially planned at year end 2022, is now planned for Q1 2023 when we expect that approximately 50% of the subjects have been treated for 24 weeks. We believe the interim readout on 50% of the subjects in our trial would provide a more meaningful and robust data set in our evaluation of pemvidutide. Scott Harris will talk more about the MOMENTUM trial shortly. A 12-week Phase Ib multicenter trial in type 2 diabetics is also ongoing, and we expect this trial to provide important information on parameters of glucose control, such as hemoglobin A1c in subjects with obesity and overweight who have type 2 diabetes.\n\nFinally, we are continuing to enroll in our Phase II multicenter trial of HepTcell in subjects with inactive chronic hepatitis B and expect to have a data readout in the second half of 2023. We are excited about the progress of pemvidutide and HepTcell and the upcoming results of these ongoing trials. With that, I will now turn the call over to our chief medical officer, Dr. Scott Harris, to discuss our data and clinical plans.\n\nScott?\n\nScott Harris -- Chief Medical Officer\n\nThank you, Vipin, and good morning, everyone. First, let me talk about our upcoming readout in our 12-week Phase Ib multicenter trial of subjects with obesity or overweight and NAFLD in mid-September. NAFLD in this trial was defined as a 10% or greater liver fat content as measured by MRI-PDFF. At the conclusion of enrollment, the trail randomized and dosed 94 subjects who were randomized 1:1:1:1 to 1.2 milligrams, 1.8 milligrams, 2.4 milligrams pemvidutide or placebo over 12 weeks of treatment.\n\nApproximately 29% of the subjects participating in the trial have pre-existing type 2 diabetes. The primary endpoint of this trial is the reduction in liver fat by MRI-PDFF, and the key secondary endpoint is weight loss at the end of 12 weeks of treatment. We will report consolidated and stratified data in these and other parameters for subjects with and without diabetes. The readout in September will also include: the effects of pemvidutide on serum lipids; laboratory parameters, including liver function tests and fasting glucose; adverse events, including adverse events leading to treatment discontinuation; hemoglobin A1c; heart rate; and blood pressure.\n\nBased on an analysis of the pooled unblinded data, the average BMI of participants is approximately 36 with median weight approximately of 101 kilograms, and the median age is approximately 49 years with approximately 50% of subjects -- 53% of subjects being female. As you are aware, we are conducting a 12-week extension trial for participants who complete the initial 12 weeks of treatment, resulting in a total of 24 weeks of treatment. The extension trial is now fully enrolled, and we expect to readout on these results in Q4 2022. The principal readouts will be weight loss and the continued safety of pemvidutide administration.\n\nThe 24-week data may allow us to project the amount of weight loss that could be achieved by pemvidutide at one year of treatment. Now, let me talk about the Phase II MOMENTUM trial of pemvidutide in obesity. The trial is enrolling approximately 320 non-diabetic subjects with either obesity, or overweight with at least one obesity-related complication, across approximately 25 obesity study centers in the United States. Subjects are being randomized 1:1:1:1 to receive either 1.2 milligrams, 1.8 milligrams, 2.4 milligrams pemvidutide or placebo administered weekly for 48 weeks as an adjunct to diet and exercise.\n\nThe primary endpoint of the MOMENTUM trial is the relative percent change in body weight at 48 weeks compared to baseline with additional readouts, including metabolic and lipid profiles, cardiovascular measures and glucose homeostasis. Dr. Louis Aronne from Weill Cornell Medical School, a leading authority in obesity in clinical trials, is serving as the principal investigator. As Vipin mentioned, enrollment and randomization are progressing rapidly.\n\nWe now plan to perform an interim analysis to assess changes in body weight after 24 weeks of treatment on approximately 50% of expected study participants in Q1 of 2023. We are currently randomizing 25 subjects per week and expect to complete randomization of the full 320 study participants next month. We are also completing enrollment in our 12-week Phase I multicenter trial, evaluating the effects of pemvidutide on glucose and control in subjects with type 2 diabetes. Approximately 48 subjects are planned with readout expected in Q1 2023.\n\nAcross the trials that I have described, we are rapidly building the safety profile of pemvidutide with unblinded safety data accrued in over 200 subjects receiving one or more doses of pemvidutide in clinical trials expected by year end 2022 and approximately 500 subjects by year end 2023. We are all aware of the recent interim readout on the Wegovy SELECT cardiovascular outcomes trial. And like most of us who are following this study, we believe that a positive effect in cardiovascular outcomes will be demonstrated at the final readout. Following on this thought, however, I'd like to highlight the robust reductions in serum lipids demonstrated in our first-in-human clinical trial of pemvidutide, where we achieved 20% to 30% reductions in total and LDL cholesterol within 12 weeks of pemvidutide treatment.\n\nThese lipid effects are expected to have important implications for cardiovascular disease, such as myocardial infarction, stroke and heart failure. And they compare quite favorably to the limited 3% reduction in total LDL cholesterol -- total cholesterol and LDL levels observed in the Wegovy STEP 1 trial at 68 weeks. We believe the marked effect on lipids that we demonstrated in our first in-human trial speak directly to the superior effects of glucagon and serum lipids, and support our belief that we will achieve more rapid and pronounced outcomes when cardiovascular outcomes trials with pemvidutide are conducted. We are also making continued progress in the enrollment of our Phase II multicenter clinical trial of HepTcell in subjects with inactive chronic hepatitis B and expect the results of this trial in the second half of 2023.\n\nRecall that the virologic effects of HepTcell are being evaluated in chronically infected patients to enable the combination of HepTcell with novel direct-acting antivirals as part of combination therapy for chronic hepatitis B. I will now hand the call over to Rich Eisenstadt to give an update on our first -- second quarter financial results. Rich?\n\nRich Eisenstadt -- Chief Financial Officer\n\nThank you, Scott, and good morning again, everybody. For today's call, I'll be providing a brief update on Altimmune's second quarter 2022 financial results. More comprehensive information will be available in our Form 10-Q to be filed with the SEC later today. Altimmune ended the second quarter of 2022 was approximately $184.8 million of cash, cash equivalents and short-term investments compared to $190.3 million at the end of 2021.\n\nWe drew down approximately $21.3 million in net proceeds off of our ATM during the three months ended June 30, 2022, and had approximately $32.9 million in availability remaining under the ATM at June 30. Turning to the income statement. Revenue was minimal in the second quarter of 2022 compared to $100,000 in the same period in 2021. Our change in revenue for the quarter was primarily due to the discontinuation of development activities for our T-COVID and NasoShield programs.\n\nResearch and development expenses were $16 million in the second quarter of 2022 compared to $13.3 million in the same period in 2021. Approximately $10.1 million of this total for the second quarter of 2022 was direct expenses for the conduct of our clinical programs, including $8.7 million in direct costs related to development activities for pemvidutide and $1.4 million in direct costs related to development activities for HepTcell. Approximately $1.9 million of expense in the second quarter of 2022 was a non-cash expense associated with the achievement of the Phase II development milestone for pemvidutide. General and administrative expenses were $4.4 million in the second quarter of 2022 as compared to $3.7 million in the same period in 2021.\n\nThe increase year over year was primarily attributable to increased labor and labor-related expenses, including stock compensation expense. Net loss for the three months ended June 30, 2022, was $20.1 million, or $0.42 net loss per share, compared to $24.8 million, or $0.60 net loss per share, for the second quarter of 2021. Our existing cash not only fully funds us through all of our ongoing clinical trials, but we currently estimate that our cash is sufficient to allow us to operate into the second half of 2024. I will now turn back over to Vipin for his closing remarks.\n\nVipin?\n\nVipin Garg -- Chief Executive Officer\n\nThank you, Rich. Operator, that concludes our final remarks -- formal remarks, and we would like to open the lines to take questions. Could you please instruct the audience on the Q&A procedure?\n\nOperator\n\n[Operator instructions] Our first question is from the line of Seamus Fernandez of Guggenheim. Your question, please.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nGreat. Guys, can you hear me, OK?\n\nVipin Garg -- Chief Executive Officer\n\nYes.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nOK. Excellent.  So just a couple of things on time lines and expectations heading into the event. Obviously, you guys are making some very strong statements around what you believe pemvidutide has the capability to do. And incorporating that 20% target into the press release I'm sure has people paying attention.\n\nWanted to just get a little bit of incremental color on your conviction around that 20% threshold. It would strike us that even if you were to achieve a high-teens number at 48 weeks, that would still be approaching, if not still a best-in-class result relative to the current two assets. So just wanted to get a better sense of what you guys -- what raised your conviction to kind of put that and really make such a strong statement. And again, we can certainly see that, but I have to imagine that perhaps you're seeing something in the Phase I data to imply that things are going quite well.\n\nSeparately, as we just kind of look at the updates on the timing dynamics where we saw some push out, I guess, can you talk to us and help us understand what the workup of the patients actually is? We actually think it's good that there is a healthy pace, but perhaps not too fast of a pace of patient enrollment. And while folks may be a little bit disappointed by the timing of the 24-week results, I was just hoping you could give us an update on the participation rate from patients going from the 12-week into the 24-week extension in the NAFLD study. And then, just the last question. The diabetes study, can you just remind us what you're hoping to understand in the Phase I, basically safety portion study in the diabetic patient population? Is that purely drug-drug interaction work? Or is it possible that we could see treatment-related effects in that patient population, just to kind of replicate the 29% of patients that are in NAFLD? Apologize for the series of questions, but just wanted to get those three things out there.\n\nVipin Garg -- Chief Executive Officer\n\nYes, absolutely. Good morning, Seamus. All great questions. There's a lot to unpack there.\n\nSo let me just start with in terms of the magnitude of weight loss. As we have said all along, we agree with you that it's not about just achieving a number. It's really looking at the entire package that you're bringing to the table. And we've been emphasizing that it's not just the weight loss.\n\nIt's a lack of dose titration. It's our serum lipid profile that we are seeing. So all of that will go into finally distinguishing or differentiating pemvidutide from the rest of the field. Based on what we have seen from our Phase I study in Australia, as you know, we were able to achieve approaching 8% to 10% weight loss in about 12 weeks.\n\nWhen you compare that to other agents, it makes sense that we should be able to reach a number approaching 20% in 48 weeks because we got all of this runway left for the drug to work. So that's really where that conviction is coming from. We are totally unblinded to the NAFLD Phase I study, so none of this is coming from that. But we continue to believe that pemvidutide has the potential to be a highly differentiated product in this space.\n\nYour second question relates to -- Scott, do you want to take that?\n\nScott Harris -- Chief Medical Officer\n\nYes. Seamus, good morning. So you had several parts to your question, and let me make sure I touch on all of them, and please interrupt me if I haven't. We're very confident about the rate of enrollment.\n\nWe have a really great clinical operations group. We also have, even more important than that, some very, very experienced obesity study centers. They have conducted many trials through the years. More recently, some of them participated in the STEP or the SURMOUNT or the SURPASS trials.\n\nWe have a lot of confidence in them. And based on that, we are really confident about the quality of the data that we're generating in that trial at a very nice rate. We haven't commented yet on the rollovers from the NAFLD 12-week study to the 12-week extension. We'll make that announcement in the fourth quarter.\n\nBut we're very happy at this point at the rate of rollover. And finally, regarding your question of the diabetes study, recognize that there are only a limited number of subjects who are diabetic who are participating in the 12-week NAFLD study. Doing a committed diabetes study allows us to increase those numbers, get more robust readouts and also put some measures into that study that are considered to be more of an industry standard in assessing diabetic patients, such as continuous glucose monitoring, that would be too difficult to incorporate into a NAFLD trial. I wanted to also just clarify on the statement that Vipin made, that Vipin may have used the word that we are unblinded.\n\nI want to make it clear that we are still blinded to the 12-week in NAFLD data. So let me just make sure that clarification is heard.\n\nVipin Garg -- Chief Executive Officer\n\nThanks.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nThanks. Really appreciate that. And just on the diabetes study, can you guys clarify, did you increase the number of patients that are going to be participating in that diabetes study and that's the reason that we're going to see those data in the first quarter of next year, and the reason is to ensure that you have more robust data? Or just has enrollment been a little bit more challenging in that study, and maybe you could just help us understand why that might be. And with that, and then I'll drop back into the queue.\n\nScott Harris -- Chief Medical Officer\n\nYes. I don't want to talk about our final enrollments, Seamus. Let me just say it's a combination of factors that we felt that we were much more comfortable announcing in the first quarter rather than the fourth quarter.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nOK. Got it.\n\nOperator\n\nThank you. Our next question is from the line of Yasmeen Rahimi from Piper Sandler. Go ahead. Your question, please.\n\nYasmeen Rahimi -- Piper Sandler -- Analyst\n\nGood morning, team. And thank you so much for taking my questions. Thank you for the quite additional color presented in your press release this morning and your prepared remarks. A few questions.\n\nI'm going to go one by one. The first question, I would like to understand is, I know in the past you guys have said that in the NAFLD study, the target diabetic population was 50%, and now we're at about 29%. So obviously with less number of insulin resistant patients in the study, it's going to influence the mean weight loss. So just kind of provide us some commentary on what your expectations are in the diabetic and non-diabetic population in this NAFLD study at a week -- 12-week endpoint.\n\nSo we could address that first, and then I have a couple of little follow-ups as well.\n\nScott Harris -- Chief Medical Officer\n\nSure. Very happy to address that, Yasmeen. If you look at the NAFLD population in general, and there are some studies out there, they capture this. The rate of diabetics in the NAFLD population is approximately 25%.\n\nIt gets higher in the actual NASH population. But remember, this was the NAFLD population with some NASH patients and not a committed NASH trial. When we saw our initial enrollment, it did look like 50% of subjects who are coming into the trial were diabetics, and that's what we had informed investors about. But actually, we came down to the expected number around 25%, and in fact, we're 29%.\n\nSo we think that we're right in line with where we should be. Although the initial estimates were higher, we are where we should have landed. Regarding the mean weight loss, I would direct you to focus on the fact that we are reporting out the weight losses in the diabetics and non-diabetics separately, as well as the consolidated figure. I think that's the best way to understand the data because they're separate populations.\n\nSo as I mentioned in my remarks, we'll report the weight loss and other data in three subsets of patients or sets of patients. The first will be those who don't have diabetes, which would be a standard readout. The second would be those with diabetes. And then finally, we'll consolidate, but we'll allow everyone to see exactly what the separate effects are of pemvidutide in non-diabetics and diabetics despite the ratios.\n\nYasmeen Rahimi -- Piper Sandler -- Analyst\n\nAnd then, just with various analysts maybe having different views on what's the expected bar in this upcoming 12-week time point for NAFLD, just can you help us understand what is an acceptable range in weight loss, in your view, that you think you hope to achieve, if you could? And I'm sorry that I keep asking this, but we get this question quite a bit from our investors as we head into middle of September data. So just give us some color on what you're expecting in terms of an acceptable weight loss range.\n\nScott Harris -- Chief Medical Officer\n\nYes. I think that a nice starting point is to look at the tirzepatide or the semaglutide data at 12 weeks, Yasmeen, and realize that those were obesity trials conducted over a baseline of diet and exercise intervention. So that automatically gives you about 2% to work with, even without drug effects. So when you look at the placebo-adjusted semaglutide rate, it's 4%.\n\nIf you look at the tirzepatide rate, the placebo-adjusted is 6%. Clearly, to be interesting, I think we should be in that range. Although, we think that we have properties, as Vipin emphasized, with glucagon that even if we're kind of somewhere in that range and not exceeding it -- again, that's not our expectation. But even if we're just in that ballpark, given the other superior properties of pemvidutide, the amazing lipid effects that we're seeing and also the absence of dose titration, we think that we're extremely competitive.\n\nWe really are looking toward the safety of the compound in this readout. We think that that's as important as anything else to move forward. And then, as you know, investors are looking at 12% because they're interested in what's going to happen at 48 weeks. And I think that that's really -- what we're trying to really understand what's going to happen at that point.\n\nCertainly, the 24-week data that we're going to generate in the fourth quarter with the extension of this trial is going to be extremely informative and certainly as interesting, if not more interesting, than the 12-week readout.\n\nYasmeen Rahimi -- Piper Sandler -- Analyst\n\nAnd then, just a last question. Can you maybe help us understand what type of safety data you were privy to on a blinded basis? As you know, the safety data set is going to be critically important as we head into the September readout. Just in broad strokes, what are the type of things that you see on a blinded basis? And if you could provide some commentary how satisfied you are with those -- with the things you're seeing would be great.\n\nScott Harris -- Chief Medical Officer\n\nYes. Thanks, Yasmeen. Well, it's well known that as a sponsor being responsible for the safety of study subjects, we're always alerted to panic values. That would be ALT elevations, glucose elevations, safety, severe adverse events, serious adverse events and the like.\n\nWe don't see the aggregate data by treatment group at least until the end of the study, the same time you do. But based on what we're getting, the information that we're getting in the trial on those metrics, we've just been very, very happy so far. So I would say that based on that blinded understanding of the data, we're just extremely encouraged.\n\nYasmeen Rahimi -- Piper Sandler -- Analyst\n\nExcellent. Thank you.\n\nOperator\n\nThank you. Our next question is from the line of Roger Song of Jefferies. Go ahead, please.\n\nRoger Song -- Jefferies -- Analyst\n\nGreat. Thank you for taking the question. A couple of questions from us. So the first one maybe just be a little bit more specific, given you will have your Phase II obesity study readout after the Phase I NAFLD, even the 24-week data.\n\nSo maybe just, Scott, you can just contextualize this for us and investors, how should we make read-through from one to the other, from NAFLD study to obesity, given its slightly different population, baseline characteristics, etc.?\n\nScott Harris -- Chief Medical Officer\n\nYes. So clearly, as you get to 24 weeks with the NAFLD, you get an obesity readout. We're going to have to look at that population at 12 and 24 weeks to see if there's any impact on pre-existing liver fat on the weight loss. It's not something that's been well characterized in the literature.\n\nOur initial impression is that there shouldn't be an effect, but we're just going to have to look at the data.\n\nVipin Garg -- Chief Executive Officer\n\nAnd there are differences in trial design. Obviously, you already emphasized that point. But I want to reemphasize that the lack of diet and exercise from one study to the other, that also has to be taken into account. But we'll be able to sort through all of that once we have the data.\n\nThere's no question that there will be some read-through from one study to the other because these are -- these patients are also obese patients. So we're expecting to see significant weight loss in them both at 12 weeks and 24 weeks.\n\nRoger Song -- Jefferies -- Analyst\n\nGreat. OK. Great. And then, so for NAFLD, understanding the primary efficacy endpoint is the liver fat reduction, can you just provide some color around the expectation for the liver fat reduction, given your Phase Ia have like a 90%-plus liver fat reduction even at the six-week endpoint?\n\nScott Harris -- Chief Medical Officer\n\nYes. So we're really impressed. Even though the numbers were small, Roger, in that Phase I first-in-human trial, the effects were so consistent. It gave us a great deal of confidence in the readout.\n\nI think once again, the more liver fat reduction that you get, the greater the effects that we're going to see on NASH resolution and fibrosis improvement, especially the speed with which we're seeing it. Because as you recall, with the semaglutide trial, which did not have a significant effect on fibrosis improvement in their 72-week trial, the amount of liver fat they moved was very small. Only about 34% in 24 weeks. And although they had 50% at the end of the year, the speed was not enough to see within that same time period of one year a movement in fibrosis.\n\nWe're seeing very robust effects in only six weeks. If you place it against other drugs in the class, we saw the FXRs coming in in that 40% range. We saw Madrigal, the resmetirom thyroid agonist, coming in at about 50%. We're seeing the FGF21s coming in about 60% to 70%.\n\nWe like to believe that we're going to be as good, if not better, than those drugs.\n\nRoger Song -- Jefferies -- Analyst\n\nExcellent. Thank you. Yeah, that's it on us. Thank you.\n\nOperator\n\nThank you. Our next question is from the line of Mayank Mamtani of B. Riley. Go ahead, please.\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nGood morning, team. Thanks for taking the question. So first, just a quick follow-up on the NAFLD study. The total enrollment looks higher than I think what you had originally planned.\n\nCan you just maybe comment why is that? And then, the baseline, I think you commented on BMI, age, proportion of female, male. But if you are able to give any color on baseline liver enzyme levels, like should we see -- with these NAFLD studies, we've seen anything ranging from mid-30s to mid-50s to mid-70s IU/L. So anything you could comment on that would be great. And then, I have a follow-up.\n\nScott Harris -- Chief Medical Officer\n\nYes. So Mayank, we obviously see the 94 subjects as being a real plus. The patients who go into the 12-week trial are the same patients who go into the 24-week trial. In other words, who go on to the extension.\n\nAnd you have to understand that when patients came into that first 12-week trial, they came with the understanding that they were going to come in for 12 weeks. They were offered another 24 weeks, but a lot of people didn't have the time or set aside the commitment to go into for a full 24 weeks. So that has to be understood. Nonetheless, we're happy with the rollover rate.\n\nBut the 94 patients really allowed us to move a robust number of patients from the 12-week study to 24 weeks. So we see that as being a real positive on the readout that we're going to have at 24 weeks in the extension trial. So with regards to the liver enzymes, we will have that data. This is not a NASH trial, so the level of liver enzyme elevations are not going to be great, but we are allowing for some liver function elevations at baseline.\n\nAnd we should be able to see a meaningful change in ALT, for example, over the course of treatment of 12 weeks.\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nAnd then, having that less proportion of diabetics in the NAFLD study, I'm just curious; what does that mean to the weight loss contribution? Because I think it would be helpful to put in context what weight loss we saw in the semaglutide studies, type 2 diabetes versus non-diabetes patients. And maybe from your earlier Phase I studies, you had any diabetes versus non-diabetes patients there?\n\nScott Harris -- Chief Medical Officer\n\nYes. So I'll take the second part of the question first. Our first study was conducted entirely with non-diabetics. So we can't really use any information from that study to predict what we would see in type 2 diabetics in the upcoming trial readout.\n\nI would emphasize, however, that 40% of the subjects who participated in the Phase I study were pre-diabetics, and we saw a reduction in insulin resistance in that population. We saw the majority of those patients who are pre-diabetics becoming non-prediabetic. Regarding the lower percentage of patients who have type 2 diabetes in this trial, I would emphasize again the fact that we're going to read out separately in the three populations. The first being the non-diabetics, so that will compare directly to STEP 1, which is the semaglutide first pivotal.\n\nThe second would be in diabetics. That would compare to STEP 2. And then, a combination. Although I don't think that the combination is meaningful, and that's why the change in the percentage of diabetics is really not meaningful as well, because what we're interested in is the separate effects on non-diabetics and diabetics, with your correct understanding that typically in clinical trials, diabetics lose less weight than non-diabetics?\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nGot it. And my final question on the 48-week full readout time line. Just trying to understand that gap between when you have the 24-week interim analysis in first quarter and that 48-week full analysis, which I'm assuming is going to be at the total sample size of 320 subjects. Could you just provide what that gap could look like in terms of time lines? And just maybe some color on what's the screen failure rate.\n\nI think you gave a screening number per week of about 25 subjects. Just curious if you could comment on how that rate is increasing month-over-month, and what's the failure rate look like?\n\nScott Harris -- Chief Medical Officer\n\nYes. So to be clear, Mayank, that 25 subjects per week is not a screening rate. That's an actual randomization and dosing rate, OK? Those are subjects who are actually being dosed and put into the final data set. So based on that, we will have dosed our final patient by the end of September.\n\nThe screening rate is obviously higher than that. We haven't gone public in what the screen failure rate is, but we're very, very happy with that. But it's obviously a lot higher, or somewhat higher than that 25 subjects because of the screen failures. We are confident, obviously, about the readout at 24 weeks in the first quarter.\n\nAnd with the completion of the first -- patients receiving their first dose by the end of September, you can estimate where the 48 readout would approximately occur in 2023.\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nGot it. I'll hop back in the queue. Thanks for taking our questions.\n\nOperator\n\nThank you. Next question is from the line of Jon Wolleben of JMP Securities. Go ahead, please.\n\nJon Wolleben -- JMP Securities -- Analyst\n\nHey, good morning and thanks for taking the questions. A couple on the NAFLD study. I was hoping you could clarify -- I might have missed this -- if diet and exercise instruction is part of this Phase I study that wasn't part of your prior Phase I. And then, you mentioned the average baseline weight is about 101 kilograms, which is substantially higher than you saw in Phase 1.\n\nWondering how you're thinking about how that might affect the weight loss you see here versus the prior study. And Scott, you said the study was fully enrolled, but just looking for clarity on what percentage of patients rolled over into that 12-week extension.\n\nScott Harris -- Chief Medical Officer\n\nThanks, Jonathan. So you're absolutely correct. We did not use diet and exercise in our initial first-in-human study, and we are not using diet and exercise in the current 12-week NAFLD study. So consequently, when we look at this, we're not going to see the 2% benefit of placebo.\n\nBecause remember that the STEP and the SURMOUNT and even the SURPASS trials were conducted over a baseline of diet and exercise, and the reason is is because when a drug is approved for the treatment of obesity in the U.S., it's approved as an adjunct to diet and exercise, so it actually has to be in the study. The NAFLD study was designed without diet and exercise, the same as the initial Phase I study. However, the MOMENTUM Phase II trial, which is committed obesity study, follows FDA guidance. This is designed exactly like STEP 1 and SURMOUNT 1.\n\nAnd with that, we do have an intensive diet and exercise program. With regards to the higher weight, the mean weights, or median weights, I should say, that we saw in the Phase I study were approximately 90 to 95 kilograms, depending on the cohort. So this is somewhat higher, but it's not a lot higher. Our initial evaluations from our Phase I study suggested that we did not see an effect of body weight on either our serum concentrations or the amount of weight that people lost.\n\nBut I'd also caution that that was a small number of subjects, and we'll have to see if that holds true as we go into this readout with a larger number of subjects. The extension study is fully enrolled. We're happy with the rollover rate. We're happy with the additional patients who have gone into the study based -- following the increase of the size of the base study to 94.\n\nWe haven't gone public on the percentage of rollover. We'll obviously have that data when we announce the 24 weeks, but it'll be a very nice data set.\n\nJon Wolleben -- JMP Securities -- Analyst\n\nGot it. Thanks again for taking the questions.\n\nScott Harris -- Chief Medical Officer\n\n[Audio gap] going into this readout with a larger number of subjects. The extension study is fully enrolled. We're happy with the rollover rate. We're happy with the additional patients who have gone into the study based -- following the increase of the size of the base study to 94.\n\nWe haven't gone public on the percentage of rollover. We'll obviously --\n\nOperator\n\n[Audio gap] H.C. Wainwright. Go ahead, please.\n\nPatrick Trucchio -- H.C. Wainwright and Company -- Analyst\n\nThanks. Good morning. I'm wondering in discussing the potential points of differentiation of pemvidutide, if you can talk about the expected advantages specifically in type 2 diabetic patients, particularly in areas of glucose control and lipid counts relative to other mechanisms in the field. And if you could also remind us the proportion of patients with obesity that would also be expected to present with type 2 in the real-world setting.\n\nScott Harris -- Chief Medical Officer\n\nThanks, Patrick. So regarding your first question in type 2 diabetes, the immediate -- and I want to stress the word immediate -- target product profile for pemvidutide is not to have at least like a GLP-1 monotherapy acute glucose lowering effects. We have balance in the compound between GLP-1 and glucagon. And we believe that that, at the base case, is going to be maintaining glucose.\n\nAnd we saw that in our Phase I study where glucose and hemoglobin A1c were maintained. But over the course of time, recognize these patients lose weight. And it was stressed at the recent ADA meeting that the focus in the treatment of patients with type 2 diabetes should focus -- not so much of the focus should change from the treatment or the control of blood sugar to the loss of body weight, because the loss of body weight has a much more meaningful effect on their hemoglobin A1c over the course of time than the anti-diabetic effect. So consequently, we're very confident, given the amount of weight loss that we're seeing, that we're going to achieve drops in hemoglobin A1c over the course of more extended treatment.\n\nWe're fairly confident we'll see that at 48 weeks. We're hoping we're going to see it at 24 weeks, but it's a shorter period of time with less weight loss. We may see it at 12 weeks. That would certainly be only a plus that we saw a drop.\n\nBut at the same time, our base case is that we won't see -- necessarily see a drop. Now, recognize that one of the principal factors in blood sugar elevations in type 2 diabetics is insulin resistance. And the great portion of that comes from the liver, and it's related directly to liver fat. And when you see liver fat being decreased as dramatically as we are with pemvidutide, and that's due to the glucagon effects, we think we're going to see a drop in insulin resistance that's also going to contribute to the blood sugar decreases over time.\n\nSo just to reiterate, we do feel confident that this is an anti-diabetic drug over, say, 48 weeks, perhaps 24. Our base case at week 12 is that we won't see it, but -- because the hemoglobin A1c averages out the blood sugar over 12 weeks, even when you don't initially have weight loss. But an upside would be that we saw a drop in hemoglobin A1c or fasting blood sugar in the diabetic population. Regarding the lipids in diabetics, it should be clear that diabetics do suffer from the effects of blood sugar, and those elevations result in microangiopathies such as diabetic eye disease, diabetic kidney disease.\n\nBut the predominant reason for death in type 2 diabetics is serum lipids. And consequently, drugs that more effectively move serum lipids are going to have better cardiovascular outcomes than those that don't. And I want to, again, contrast the reductions in serum lipids that we saw, particularly total and LDL cholesterol, in our Phase I study at 20%, 30%, and contrast that to the only 3% reductions in total and LDL cholesterol in the STEP 1 clinical trial. And we think that ultimately that's going to have major benefits on cardiovascular outcomes when we conduct those clinical trials.\n\nRegarding your question, Patrick, about the percentage of obese patients who have type 2 diabetes, it's about 20%.\n\nPatrick Trucchio -- H.C. Wainwright and Company -- Analyst\n\nGot it. That's really helpful. And then, just another follow-up question. When you look to the first quarter of next year, you're going to have the interim data for MOMENTUM.\n\nYou'll also have the Phase Ib NAFLD study 12-week and 24-week data, and as well the Phase I study data in diabetic subjects, so additional safety data. I'm just wondering, do you think at that point you would have sufficient data to have a meeting with the FDA, depending on the outcome of all of these studies, to move directly into a Phase III program in obesity? Or would you anticipate needing the full data set from MOMENTUM before you can move ahead to Phase III?\n\nScott Harris -- Chief Medical Officer\n\nYes. Great question, Patrick. The initial advice that we got from FDA, and I want to stress initial, was that they would like to see the full 48-week data before moving ahead to Phase III. But we could certainly look at what we have in the first quarter and see if that discussion should be held again.\n\nAgain, when we approach them, which was at the filing of the IND for obesity, and that was -- we filed that at the end of 2021, we only had Phase I data in a limited subset of patients, and data prevails at those meetings. So when you propose meetings, they want to have as much possible. So their initial impression, and I'm not surprised, is let's see 48-week data. But it's possible with the abundance of data that we're going to be generating in the first quarter that we could have that discussion earlier.\n\nPatrick Trucchio -- H.C. Wainwright and Company -- Analyst\n\nYeah. Great. Thank you very much.\n\nScott Harris -- Chief Medical Officer\n\nYeah.\n\nOperator\n\nThank you. And we have a follow-up question from the line of Seamus Fernandez. Go ahead, please.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nGreat. Thanks, guys. So just two quick follow-ups. The first question, there was a publication from Novo Nordisk highlighting a relatively robust study of their own glucagon agonist in combination with I believe their GLP-1 semaglutide.\n\nJust wondering if you guys could comment, whether it be on that study or at least on the safety of pemvidutide as it relates to heart rate elevations? I think the triple-G agonist at Eli Lilly in their early Phase I data saw substantial heart rate elevations that clearly would require some factors there. But it's also our understanding that that also tends to be associated with GLP-1. So are you guys seeing anything related to heart rate elevations outside of what we would see normally with the GLP-1 in your data sets at all? So just wanted to start there, just because that has been a critique from Novo Nordisk, but we're not sure if it applies here, or perhaps it's even just purely molecule specific. And then, the second question was just as we think about the possibility of entering larger Phase III, it would seem to us the size of the overall obesity efforts likely would have you guys with strong interest from potential partners, especially if you can achieve the profile that you're talking about.\n\nHow are you guys thinking about the timing of when you think it's best to engage with potential partners from a strategic discussion perspective?\n\nScott Harris -- Chief Medical Officer\n\nThanks, Seamus. I'll answer the first question, and then I'll turn to Vipin to answer the second question. So as you know in that triple-G study, the effects on heart rate were striking. They announced that with their multiple dosing, they saw increases of about 10 beats per minute.\n\nBut actually in their single ascending dose study earlier than that, they actually got 30 beats per minute. So why is that? Is that because you simply added glucagon to the molecule? Well, we'd say a couple of things about that. The first is the amount of glucagon in that triple-G, as we understand it -- and I want to emphasize that is small. That molecule appears to be tirzepatide, slightly lower ratio of GIP to GLP-1.\n\nI think in tirzepatide, it's 15:1. It looked like based on the data they presented, that's 8:1. But I want to emphasize that the ratio of GLP-1 to glucagon, that molecule is 10:1. It's only 1/10th the relative amount of activity in that molecule compared to the GLP-1.\n\nSo if there's any effect of that molecule, it's the GLP-1, and we've seen those heart rate increases before. How do we explain it, and why aren't we seeing it with our compound? We believe it's probably the pharmacokinetic effects. If you look at the time to maximal concentration of that compound, as we understand it, as presented in graphs at the meeting, it looks like it's very short, about 12 hours. And again, I want to say it's about because I'm estimating it from slides that they presented without actually seeing the raw data.\n\nWhat that means is that when that drug is given, there's a surge of drug into the bloodstream with higher peak concentrations and immediate effect. Contrast that with pemvidutide, where we see a maximal concentration that's actually several times greater than that -- not 12 hours, but 70 hours -- with a lower Cmax. We've estimated that our Cmax compared to comparative doses of semaglutide is about a third. So what we have is an onset that is slower and perhaps more gentle, using a non-biological term.\n\nBut we think that that accounts for the lack of heart rate increases. Now, we presented that data at the ADA meeting that we're not seeing the heart rate increases of semaglutide. It's probable that as we go further in development, because this is a GLP-1-based compound that we'll see some increase. But the initial data suggests that it's not going to be significant any more than a GLP-1.\n\nBut again, I want to emphasize that we have a small number of patients, and we'll just observe that as we go. But we think that the heart rate increase that we're seeing with the glucagon-containing compound were not due to glucagon. We think it was the nature of the pharmacokinetics. So for the second question, I want to turn that over to Vipin.\n\nVipin Garg -- Chief Executive Officer\n\nYes, Seamus. We agree with you that with this kind of data package that we are putting together, and if we are able to maintain the profile that we've been highlighting that we expect and we do try to have, we expect to have significant interest, strategic interest in this program. So we'll explore that. Right now, we are focused on generating this data.\n\nWe think that's what's going to drive the value proposition here.\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nThanks. Thanks so much, guys.\n\nOperator\n\nAnd we have another follow-up question from Mayank Mamtani. Go ahead, please.\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nThanks for taking my follow up. And maybe just another kind of follow up, a forward-looking kind of question. Like in terms of doing a CV outcome trial, do you expect that to be in parallel to your Phase III, or more sequentially post Phase III? And as you know, the reason I ask you this question is with the recent update with the SELECT study, but also, you're trying to get to weight loss levels comparable to tirzepatide in two thirds of the time. So I'm just curious, as you look forward, would doing an outcome study in parallel to doing your Phase III -- just because longer term, these are important to reimbursement and payer dynamics for the market.\n\nScott Harris -- Chief Medical Officer\n\nYes, Mayank. It's a great question. I want to emphasize that, first, that the conduct of a cardiovascular outcome trials will not be gating to approval that we do it in parallel with Phase III or afterwards. These drugs are approved without having these trials upfront.\n\nSo we saw that recently with Mounjaro, tirzepatide. I think it's intriguing to think that we could do it in parallel. It's not something that we've carefully looked at. We think it's a very nice suggestion, and we'll certainly take a better look at it.\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nThank you.\n\nOperator\n\nThank you. And now I would like to turn the conference back to Vipin for closing remarks.\n\nVipin Garg -- Chief Executive Officer\n\nThank you, everyone, for participating today. We appreciate this opportunity to share our results and outlook with you, and thank you for your continued interest. Have a nice day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRich Eisenstadt -- Chief Financial Officer\n\nVipin Garg -- Chief Executive Officer\n\nScott Harris -- Chief Medical Officer\n\nSeamus Fernandez -- Guggenheim Partners -- Analyst\n\nYasmeen Rahimi -- Piper Sandler -- Analyst\n\nRoger Song -- Jefferies -- Analyst\n\nMayank Mamtani -- B. Riley Financial -- Analyst\n\nJon Wolleben -- JMP Securities -- Analyst\n\nPatrick Trucchio -- H.C. Wainwright and Company -- Analyst\n\nMore ALT analysis\n\nAll earnings call transcripts"
}