{
  "companyName": "InMode Ltd.",
  "companyTicker": "INMD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/inmode-ltd-inmd-q3-2022-earnings-call-transcript/",
  "content": "InMode Ltd. (INMD 0.39%)\nQ3 2022 Earnings Call\nOct 27, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day and welcome to the InMode third quarter 2022 earnings results conference call. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Miri Segal, CEO of MS-IR. Please go ahead.\n\nMiri Segal -- Investor Relations\n\nThank you, operator, and everyone for joining us today. Before we begin, I'd like to remind our listeners that certain information provided on this call may contain forward-looking statements, and that the safe harbor statement outlined in today's earnings release also pertains to this call. If you have not received a copy of the release, please go to the Investor Relations section of the company's website. Changes in business, competitive, technological, regulatory and other factors could cause actual results to differ materially from those expressed by the forward looking statements made today.\n\nOur historical results are not necessarily indicative of future performance. As such, we can give no assurance as to the accuracy of our forward-looking statements and assume no obligation to update them except as required by law. With that, I'd like to pass the call over to Moshe Mizrahy, chairman and CEO. Moshe, please go ahead.\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nThank you, Miri, and to everyone joining us for Q3 2022 earnings calls. With me today are Dr. Michael Kreindel, our co-founder and chief technology officer; Yair Malca our CFO; Shakil Lakhani, our president in North America; Dr. Spero Theodorou, our chief medical officer; and Rafael Lickerman, our VP of finance.\n\nFollowing our prepared remark, we will all be available for Q&A session. We are pleased to report another record quarter with revenue of $121.2 million, an increase of 29% compared to the same period last year. Additionally, we are happy to be back to gross margin of 85%. Despite our expectation that Q3 should represent somewhat slow quarter demand for our innovative platforms remain strong around the world in Q3, and we expect this momentum to continue into next year.\n\nAlthough physician and patient we tend to pre-COVID travel levels, people still visited clinics for treatment with our platform. Our Empower platforms for women health and wellness, was specially successful in the third quarter, and we expect to continue to capture market share in this market going forward. A primary goal for InMode is to expand our presence in women health and in wellness space in general and we are encouraged by our early success in this market. We believe InMode has proven an aesthetic company that relying on strong technological offering can successfully evolve and expand into new and important market such as wellness and quality of life improvement.\n\nWe intend to continue this trend in the area of ophthalmology, ENT, and others. Our revenue continue to grow. The Morpheus8 is becoming the most popular minimally invasive device in the aesthetic category. We're driving this growth through brand awareness strategies and more direct focus on the consumer.\n\nOur highly efficient sales team of more than 200 direct rep and 70 plus distributors worldwide continue their excellent execution, with sales of capital equipment to represent 88% of our total revenue in the third quarter, while sales of consumable and services accounted for the remaining 12%. As our install base grow and we expand our market share, consumable and service will contribute a more significant portion to the revenue mix going forward. Hands-free devices represent 11% of total revenue, while non-invasive RF and laser platforms accounted for 7%. These figures represent normal level in our revenue mix.\n\nMoving to our international operation. Third quarter sales outside the U.S. accounted for $39.8 million or 33% of sales, a 26% increase compared to Q3 last year. InMode now operate in total of 80 countries.\n\nOur recently opened subsidiary in Italy is already very successful and we are planning to establish an additional subsidiary in Europe and one in Asia in 2023. During the third quarter InMode successfully launched EvolveX and Empower in Asia as we continue to see growing demand from Europe, Asia, and Latin America. In addition to our active pipeline of new technology, we're also exploring potential acquisition that could complement our presence in the wellness market. This could be companies with an established track record and an existing customer base in the U.S.\n\nand globally. In summary, we're proud to deliver another record quarter, and we believe this positive momentum will continue. Now I would like to turn the call over to Shakil, our president in North America. Shakil, please.\n\nShakil Lakhani -- President, North America\n\nThanks, Moshe and everyone, for joining us. Once again, we are pleased to report another record quarter with continued momentum bolstered by growing demand as well as more frequent use of our technology. Sales from consumables and services remained at high levels due to the growing use of InMode's platforms. Sales in North America continue to be the main contributor to our total revenue across all platforms.\n\nTotal revenue generated this quarter amounted to $91.9 million. As we look forward, this market is positioned to remain the leading growth driver for InMode. As Moche mentioned, we have seen great success in extensive market acceptance of our Empower RF platform in the third quarter. In fact, we previously projected total sales from this platform to be 30 million for the year.\n\nHowever, we've already surpassed that number. When it comes to the Morpheus8 technology, we are seeing that it is becoming one of the most popular aesthetic procedures in the market. As part of our efforts to invest resources and raising InMode's brand awareness among patients and physicians, we announced that Eva Longoria, the award-winning actress, director, and producer, will be Inmode's global brand ambassador. Our ongoing commitment to investing in brand awareness by engaging with select brand ambassadors and gaining recognition by world renowned celebrities is something we plan to continue to do in the future.\n\nLastly, I'd like to thank our entire North American team for their continued hard work. I will now hand over the call to Yair for a review of our financial results in more detail. Yair?\n\nYair Malca -- Chief Financial Officer\n\nThanks, Shakil, and hello, everyone. Thank you for joining. Starting with total revenue, InMode generated $121.2 million in the third quarter of 2022, a 29% year-over-year increase with a gross margin of 85% on a GAAP basis. Breaking this down, we see sales of the minimally invasive and subdermal ablative technologies in the third quarter grew 43% year over year to 82% of our quarterly revenues.\n\nOf the total sales in Q3, 67% came from the U.S. and 33% came from the rest of the world, compared to 66% and 34%, respectively for the same quarter in 2021. Of our international contributors, Canada, Europe and Latin America were the biggest markets driving our growth rate. Our Q3 non-GAAP gross margin remained strong at 85%.\n\nWe are holding to our long-term gross margin target of 83% to 85%. However, as global supply chain challenges persist, we may see a potential short-term implication for our gross margins. Moving on capital equipment in the third quarter, we presented 88% of total revenue, while consumer business service revenues accounted for the remaining 12%. GAAP operating expenses in the third quarter were $48.7 million, a 38% increase compared to Q3 in 2021.\n\nSales and marketing expenses increased to $43.1 million in the third quarter, compared to $30.8 million in the same period last year. This increase is attributed to hiring more sales representative, increasing our presence in the U.S. and emphasizing our penetration strategy for new products. Next, we look at share based compensation, which increased to $7.9 million in the third quarter of 2022, compared to $3.2 million in the third quarter of 2021.\n\nOn a non-GAAP basis, operating expenses reached $41.4 million in this quarter compared to a total of $32.3 million in the same quarter of 2021, representing a 28.1% increase. GAAP operating margin was 44% in Q3 of 2022. Non-GAAP operating margin for the third quarter of 2022 was 51%, similar to the same period last year. Looking at GAAP diluted earnings per share for the third quarter, we saw an increase to $0.58, compared to $0.52 per diluted share in Q3 of 2021.\n\nNon-GAAP diluted earnings per share for this quarter was $0.66 compared to $0.55 per diluted share in the third quarter of 2021. Once again, we ended the quarter with a strong balance sheet. As of September 30, 2022, the company had cash and cash equivalents, marketable securities, and deposits of $486.4 million. This quarter InMode generated $45.6 million from operating activities.\n\nBefore I turn the call back to Moshe, I'd like to reiterate our guidance for 2022. Revenues between $445 million and $450 million. Non-GAAP gross margin between 83% to 85%. Non-GAAP income from operations between $214 million and $217 million.\n\nNon-GAAP earnings per diluted share between $2.28 and $2.30. I will now turn over the call back to Moshe.\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nThank you, Yair. Thank you, Shakil. Operator, I believe we're ready for Q&A.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] Our first question comes from Kyle Rose with Canaccord Genuity.\n\nKyle Rose -- Canaccord Genuity -- Analyst\n\nGreat. Thank you very much for taking the questions and congrats on another strong quarter. The biggest thing I wanted to start on was just your overall health of the consumer and what you're seeing on a procedural basis. And I think there's a lot of worry out there just with the impacts of inflation and the macroeconomic volatility on just maybe not what's happening right now but what's going to happen over the course of the next six to nine months from a potential recessionary impact? What are you seeing from your customers, both on the capital side as well as you know, underlying demand for procedures?\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nHi, Kyle. This is Moshe. I will answer it and then I'll let Shakil to add. Basically, in the last quarter, we did not feel there was any recession or not even a slowdown, it was a very strong quarter, especially if you take into consideration that this is the summer quarter.\n\nAnd as you know, summer quarter anaesthetic is not the best one. Not just because doctors and patients are taking vacation and they are not available for treatment, but also because people don't want to get aesthetic treatment during the summer time, especially not in Europe and also Latin America. This quarter, we were surprised it was very strong even compared to the third quarter of 2021 also the second quarter of 2022. So far, we don't see any recession and we don't see a slowdown.\n\nWe see the momentum continue. But I'll let Shakil to complement my answer and maybe tell us a little bit about what's going on in North America.\n\nShakil Lakhani -- President, North America\n\nYeah, absolutely. Thanks, Moshe. Yes, same thing, Kyle. So we haven't seen anything on the capital side, affecting the business or being detrimental to us in any which ways.\n\nAs Moshe mentioned, Q3 is typically a little slower than most quarters, at least historically speaking, we definitely did not experience that, which is very encouraging. From the consumer standpoint, I'll actually toss that over to Spero, I think he might be able to shed some color there for you. Spero?\n\nSpero Theodorou -- Chief Medical Officer\n\nSure. Great questions. Obviously, we talked to our offices every day across the country, and we have not seen any dip in customer demand. It's important to point out that what initially was thought as a COVID bump is not really just a COVID bump.\n\nOne third of new patients coming into practices, one third of new patients have actually never had plastic surgery before. So this is a paradigm shift. And we're seeing those types of patients coming into the offices that have finally considered to do what they wanted to do in the past, were not part of that group. So we feel confident for the time being, and as far as the future is concerned, I don't see the demand slowing anytime soon.\n\nKyle Rose -- Canaccord Genuity -- Analyst\n\nGreat. And then, Moshe, I think historically you've always kind of messaged absolute growth year over year as kind of being in the $50 million range. I think that might -- that range might have increased a bit when you recently moved into women's health. So kind of levels that our expectations moving forward, should we still think about this as an absolute floor on a revenue growth perspective is $50 million to $75 million a year or how should we think about that moving forward?\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nWell, in 2021 compared to 2020, I think the growth was above $150 million. We went up from 206 to 258, so it's about -- more than $150 million. This year, with the new target that we gave, with a new target for a full year, which is around $450 million then we hope to do a little bit more, hopefully the growth will be around $100 million. So basically, when we gave a target or a guidance of $50 million growth a year, that was when the company was $150 million or $100 million or maybe $200 million during the COVID time.\n\nRight now, we are now 400 -- this year if we will end up above $450 million, it's not the same company. It's double the size. And we have a better portfolio. We're entering new categories, which very successfully.\n\nIf you recall, we gave a target for Empower for the Women Health at the beginning of the year, we said it will be $20 million and then we raised it to $30 million, and now we're raising it to $40 million. So we are doing our best, and I believe that the success in the women health, which is a totally different category, it's also aesthetic but it's a totally different medical community and we're very encouraged. So I would say that growing with 20% a year from now on is a good target for you to put in your model.\n\nKyle Rose -- Canaccord Genuity -- Analyst\n\nAnd then to the last question, and I'll hop back in queue, is just -- obviously, everyone's seen the impact of Hurricane Ian at the end of the Q3 and at start of the Q4. Obviously, that's concentrated in one region of the country, but I just wanted to think, how should we think about that as an impact to the Q4? I mean, is it a headwind because you're losing days and you've got machines down? Or does it potentially pull forward some capital placements, given you've got new locations that might need to upgrade or replace?\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nShakil, can you answer it?\n\nShakil Lakhani -- President, North America\n\nYeah, sure. No, Kyle, we don't see any effect.\n\nOperator\n\nOur next question comes from Matt Taylor with Jefferies.\n\nMatt Taylor -- Jefferies -- Analyst\n\nCan you hear me OK?\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nYeah.\n\nMatt Taylor -- Jefferies -- Analyst\n\nSo I had a couple. I guess I wanted to ask you Women's Health has really done well this year, in the first year of launch. And I know you're really careful about how you're launching it, I was hoping to get your thoughts on how that franchise could evolve over the next couple years? And I know you probably won't give numeric targets, but if you could or could just frame the size of the opportunity, I think that would be really helpful for investors.\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nMatt, I didn't understand the question, opportunities of what? Of Empower?\n\nMatt Taylor -- Jefferies -- Analyst\n\nOf Empower.\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nSpero, I believe that's question that you should answer regarding who do we sell now and who do we sell in the future?\n\nSpero Theodorou -- Chief Medical Officer\n\nHere's how we look at Empower when we enter these practices, for example, gynecologists, right? They're not used to marketing. They don't know how to do cash based procedures. So going to these practices with a solution that's within their scope of practice, such as stress urinary incontinence and mixed urinary incontinence and so forth is very, very important. Because at that point, we're able to tell oncologists, look, you already have these patients in your office.\n\nThey're already coming in. The solutions out there are not great, so we have a solution for these patients that you don't have to go out there in the market, these are existing patient population. And that alleviates a lot of anxiety for them purchasing capital equipment. However, we're still an aesthetics company, so on the same platform once we go in, we're able to introduce aesthetics to this group and that's a big winner for us, because it increases our TAM in this respect.\n\nAs far as the future is concerned, we have a lot of confidence right now, because we have a lot of data that we're getting back over the year, thousands of patients being treated. And what we're seeing is consistently across the board, we're seeing that the overactive bladder or mixed urinary incontinence segment, we're getting really, really good results surprisingly so because it's a very tough segment, as you know. So the ability to disrupt that segment for the future is a big deal. As you know, it's a large market opportunity and we're investing a lot of time and effort and research into trying to figure out the details and the cost for this.\n\nBut on the clinical level and experiences, the gynecologist and your gynecologist and family practitioners out there are ecstatic. So we're very, very optimistic for the future. We're taking it very seriously. But at the same time, we're not forgetting that we're still an aesthetics company.\n\nSo that's important to balance that aspect. Does that answer your question, Matt?\n\nMatt Taylor -- Jefferies -- Analyst\n\nIt does. I guess I just had one follow-up on that Spero. So, it's interesting to see kind of the pull through strategy there. Can you frame how much pull through you're getting? How much is that resonating with OBGYNs to do more with the attached rate of getting actual aesthetics beyond the women's health?\n\nSpero Theodorou -- Chief Medical Officer\n\nIs surprising, we've engaged with some of the larger institutions for a lot of the research we're doing and your typical gynecologist having experienced so many different types of treatments for stress urinary incontinence and mixed is not necessarily receptive off the bat, right? They'll say, OK, well, let's just see how this works. But interestingly so, because of the market pressures on these groups with the insurance reimbursement, they're dying to see how they can get cash based procedures in their office. So the switch to aesthetics is seamless. And I'm talking about, this is happening at research institutions and academic institutions.\n\nSo you can imagine what happened on non-affiliated groups out there. So the pressure is even higher. So they're demanding that we teach them these things immediately. They're not waiting to see results on the stress urinary incontinence, the medical aspects.\n\nSo yes, we have a long runway, OBGYNs, 40,000 OBGYNs across the country. So we have a long way to go. But we're very encouraged at this point. Does that answer your question, Matt? You understand it correctly?\n\nMatt Taylor -- Jefferies -- Analyst\n\nOne follow-up, I mean, I heard you talking about 20% growth, which is encouraging. I think a lot of investors are a little worried about recession. And so I think maybe you could talk about differences between this recession and the last one and maybe frame are you seeing any impact yet from recession? And how do you think about the impact it could have on your business based on where you are in your life cycle?\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nMatt, as we discussed before, we don't see any recession yet, not even slow down. But I read an analysis made by your bank that the recession probably will start on the third quarter of 2023. So we're not there yet. It's a full year from today.\n\nIt depends how -- what kind of recession it will be. It will be something similar to 2008, I'm sure that we will get help a little bit as well. The fact that we're coming with the new technologies and new market will help us because I believe that if a doctor has five different lasers and he is now in the middle of recession, and he will not buy a new laser but he might buy a new technology like minimally invasive, like Morpheus, like FaceTite or NeckTite because he can come up with a different procedures to his customer base. And that will help us, that will help us overcoming.\n\nAt the same time we have a very strong balance sheet. So we have enough resources to overcome any recession or any slowdown and get even stronger after that. Because during recession when you are strong and you have the ability to invest and you don't have to cut down in order to save and cut expenses in marketing, people etc., you're getting stronger when the recession will end, and eventually the recession will end whether it will start on the third quarter or in the middle of next year. We prepare ourselves but we don't cut down, we are double down, on R&D, we're double down on marketing.\n\nThis year we're spending twice as much direct-to-consumer and twice as much marketing. In the U.S. and in the other world, we continue to establish subsidiaries. Although, when you establish a subsidiary on the first year or the second year, it cost you more than the profit that you're generating.\n\nBut we believe that there is no reason why we should stop, and we will continue to do it. Stop -- therefore, I would say that we don't have a special strategy for the recession time, we will continue business as usual even if our revenue and profits will go down a little bit, it will not help us and we will come stronger after that.\n\nShakil Lakhani -- President, North America\n\nHey, Matt. It's Shak here. Just to add to that real quick. I also think where there's -- a famous saying, right, \"where there's chaos, there's opportunity.\" As we've seen historically in previous recessions, a lot of the other -- as Moshe mentioned, the strength of our balance sheet, a lot of the competition or people that are in this space are playing in this space, they are -- and many of them are not fortunate enough to be in a position that we built ourselves to be in.\n\nSo I do think also that, the staying power for our brand, the staying power for our technology and the staying power for the consumer awareness that we're creating and we will continue to create is a big thing. And I think that'll filter out some other people increasing our TAM overall, and also our penetration into different markets that we're also looking at, and we're currently looking at with R&D.\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nIf you recall, Matt, in the beginning of 2020 when the COVID started, we were the only company who decided not to fire and not to lay people go, because we decided that we don't want talent to leave the company like other company did. And when the market came back in August 2020, July August 2020, we were very strong and we capture market share and 2021 was the -- I would say as far as growth, was more than 70%. And this is only because we kept everything and we continue business as usual. We have the resources and that's the strategy that we will implement.\n\nOperator\n\nOur next question comes from Jeff Johnson with Baird.\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nI wanted to focus maybe, Moshe, if I could on this emerging focus maybe on wellness? And you know, our checks would suggest I think Morpheus8 is really helping to fuel that move into the wellness side and I don't know if that's because an aesthetician can do this procedure, you don't necessarily have to have direct involvement from the physician, if that's it or what else it is. But maybe help us size that market, kind of the wellness market. We focus so much on the surgical derm and the plastics market, but maybe help us size the wellness market, maybe where your penetration is right now in that market, where it could go over time? And then maybe a couple follow-up questions on that.\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nWell, the wellness market is new to us, but when I said wellness market, we do not mean spa market. Although yes, we want to get into the spa market in Europe not in the United States, because Morpheus8 is a doctor business, it's not a nails business and not -- a doctor cannot dedicate that in the U.S. and not in many other countries. The only platforms today that enable us to get into the wellness and improve quality of life is the Empower, because the Empower is not pure aesthetic, it's some aesthetic of course, and aesthetic gynecology, but also treatment which are like treating SUI, vaginal contraction, OBA, OEB, etc.\n\nWhen we said wellness, we mean medical wellness and not spa wellness. And we want to do the same, for example, with ENT, snoring, sleep apnea, improving quality of life in the doctor clinic, but only by doctors not by aesthetician and not by power medical stuff. I think that that's important to understand. Every platforms that we will develop, gynecology; ENT, ophthalmology, will include some hand pieces that will enable them to do aesthetic, medical aesthetic and also to do something special for them.\n\nFor example, in the ophthalmology, we intend to bring to the market the platforms which can treat dry eye in addition to periorbital wrinkles, full face skin rejuvenation, etc. But when we said wellness and when we said improve quality of life, doesn't mean it's not medical, it's a pure medical.\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nAnd then I guess the follow-up on that is when you talk about potential M&A in the wellness space, you would mean the same thing more on the medical side.\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nOf course, absolutely.\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nAnd then the last one, just kind of bringing all that together is just Morpheu8. We're hearing more and more about that, I'm almost hearing more about that even than like AccuTite, BodyTite, FaceTite things like that. I mean, are we going into a part of the market here where patients are getting purely a Morpheus8 procedure and not getting the AccuTite or BodyTite on top of that. I'd say a year ago our checks would suggest you do an AccuTite or a BodyTite and then an overlay of Morpheus8, but it almost sounds like more recently there's been even a move toward even less invasive in just doing Morpheus8.\n\nIs that right? And, and how does that help the company?\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nI mean, Spero, can you answer that? I think you have...\n\nSpero Theodorou -- Chief Medical Officer\n\nSure. Jeff, so it's important that we differentiate a little bit about how our Morpheus8 -- what it entails, right? So most companies did radiofrequency microneedling in the past and we focused on the face. And we were the first ones to introduce Morpheus to the body. Now, the skin is the largest organ in the body, so you can imagine the opportunity that has opened up.\n\nWith thin Morpheus, we have our body contrary Morpheus hand-piece, and that seems to be growing tremendously fast because of the fact that a lot of the plastic surgeons are using it in conjunction with BodyTite and AccuTite to correctly describe. As far as the press is concerned, we're spending a lot of money in consumer advertising as well. Longoria had Morpheus, so all these things contribute to the public awareness of it. And it happens to be a very, very effective tool in armamentarium.\n\nSo as far as procedures are concerned, yes, Morpheus is not just a stand-alone, although it's definitely increasing as a stand-alone, but as an adjunct to everything else. We found in our research and our studies that when you combine Morpheus with BodyTite or AccuTite, it certainly increases tightening. So we have the scientific data to back that up as well. Does that answer your question?\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nIt does. And last one, I'm sorry to belabor this. But how what percentage maybe, Moshe, of your boxes out there in the U.S. or even globally have a Morpheus8 hand-piece and I would assume that a fairly easy upgrade to add to it, if I've got BodyTite, FaceTite, AccuTite kind of already on the box to add a Morpheus 8 hand-piece, is that kind of what's helping drive the revenue here as going back to those installed systems and adding Morpheus8?\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nI believe we gave the breakdown. We said 88% of our platforms are surgical and ablative. And almost each one of those platforms, which combined FaceTite, AccuTite, NeckTite, embrace body BodyTite ad Morpheus, it always come with a Morpheus. Because most doctors today when they do FaceTite or NeckTite, they combine it with Morpheus, almost every doctor.\n\nEvery doctor that I name, and I just been yesterday, in a conference in Tel Aviv, Israel, and they -- and they talked very loudly about it. They do a lot of molecules following NeckTite, FaceTite, AccuTite treatment of the eyelid as a complementary to FaceTite. But more than 85% of our platforms in the surgical contain or include the Morpheus, either body or face.\n\nOperator\n\nNext question comes from Joseph Conway with Needham.\n\nJoseph Conway -- Needham and Company -- Analyst\n\nJust two quick ones, I guess. Looking into 2023, I was wondering if we can get maybe an expectation of new product launches. And then we have Envision on the horizon whether that will be at the end of this year, the beginning of next year. But if you could maybe talk about some of the new products that in those expecting to release in 2023? That'd be great.\n\nThanks.\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nWell, I don't know. I'm sure you noticed, but right now Q4 2022, we have launch what we call, the Morpheus8 Body 3D, which is an upgrade for the Morpheus 8 Body. Next year, it will be Envision and the second generation of Evoke, which is a hand free device for the face.\n\nJoseph Conway -- Needham and Company -- Analyst\n\nAnd then I don't think I heard you guys give it, but if it'd be possible to give an update on the installed base for platforms in the U.S. and then rest of world?\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nWell, we don't give a breakdown of the install base, but currently we have about worldwide, 15,500 systems and in the U.S., 7,300 systems. I would say that you can take the same ratio of our revenue mix and these are the same as far as the mix between surgical and non-surgical.\n\nJoseph Conway -- Needham and Company -- Analyst\n\nAnd then maybe lastly, just looking at Empower. When could we expect maybe published data, Empower being used in one of these overactive bladder conditions?\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nSpero?\n\nSpero Theodorou -- Chief Medical Officer\n\nYeah, sure. We have a couple of publications in press, and we have an ongoing study with overactive bladder. With overactive bladder, we have to be very careful to draw conclusions. As you know, the nature of it is definitely multifactorial in some aspects.\n\nSo, we're going nice and slow and steady. We know, on the ground, its having a huge effect of the urgency frequency symptoms, which are typical of it, are decreasing or going away completely in a lot of these patients, so we're encouraged by that. But figuring out how and when and just happens is our focus. In press, we certainly have what we've done so far and part of that's mixed issue by.\n\nSo hopefully before the end of the year, we'll have something we can send you.\n\nJoseph Conway -- Needham and Company -- Analyst\n\nOK. Great. Thanks very much. Congrats on a great quarter.\n\nSpero Theodorou -- Chief Medical Officer\n\nThanks a lot. \n\nOperator\n\nThis concludes our question-and-answer session. I would like to turn the conference back over to Moshe Mizrahy, InMode's chairman and CEO, for closing remarks.\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nThank you, operator. Again, thank you, everybody, to all of our shareholders. I want to thank all of our employees worldwide, who gave a lot of effort during the third quarter to make it another record. I'm sure we will do the same on the fourth quarter.\n\nWe have 437 people employed by the company worldwide. We added something like 75 people from the beginning of the year. And we continue to hire as we are growing. By the way, and I'm sure it's very important to say, having $450 million revenue with 437 people.\n\nThis is more than $1 million per employee, which is typical to software and not to hardware. But we managed to do it. We managed to go back to 85%. Again, very hard work of our logistics, supply chain manufacturing team.\n\nWe will grow close to $100 million this year. Again, thanks to all of our salespeople, distributors in North America and elsewhere. Again, thank you, everybody, and we'll see you again within three months. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMiri Segal -- Investor Relations\n\nMoshe Mizrahy -- Chairman and Chief Executive Officer\n\nShakil Lakhani -- President, North America\n\nYair Malca -- Chief Financial Officer\n\nKyle Rose -- Canaccord Genuity -- Analyst\n\nSpero Theodorou -- Chief Medical Officer\n\nMatt Taylor -- Jefferies -- Analyst\n\nJeff Johnson -- Robert W. Baird and Company -- Analyst\n\nJoseph Conway -- Needham and Company -- Analyst\n\nMore INMD analysis\n\nAll earnings call transcripts"
}