{
  "companyName": "Oncternal Therapeutics, Inc.",
  "companyTicker": "ONCT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/oncternal-therapeutics-inc-onct-q2-2022-earnings-c/",
  "content": "Oncternal Therapeutics, Inc. (ONCT 5.26%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nOperator\n\nGreetings. Welcome to the Oncternal Therapeutics, Inc. second quarter 2022 financial results call. [Operator instructions] Please note this conference is being recorded.\n\nI will now turn the conference over to your host, Rich Vincent, CFO. You may begin.\n\nRich Vincent -- Chief Financial Officer\n\nThank you, Kyle. Good afternoon, everyone, and thank you for joining us today. Joining me on the call this afternoon are our president and CEO, Dr. James Breitmeyer; and our CMO, Dr.\n\nSalim Yazji. Today's call includes a business update and discussion of our 2022 second quarter financial results, which will be followed by Q&A. Today's press release and a replay of today's call will be available on the Investor Relations section of Oncternal website for at least the next 30 days. Our 10-Q for the second quarter 2022 is also available today.\n\nPlease note that certain information discussed on today's call is covered under the Safe Harbor provisions of the Private Securities Litigation Reform Act. We will be making forward-looking statements during this call about future events, such as our business and product development strategies, the timing of initiation of our preclinical and clinical studies, the potential for our ZILO-301 study to support a BLA submission, the timing of planned interim data updates, and the timing of our regulatory filings and submissions, including our IND submission for ONCT-808. Our actual results could differ materially from those stated or implied by these forward-looking statements due to risks and uncertainties associated with our business. These forward-looking statements should be considered in conjunction with and are qualified by the cautionary statements contained in today's press release and our SEC filings, including our Form 10-K for the full year ended December 31st, 2021.\n\nThis call contains time-sensitive information that is accurate only as of the date of this live broadcast, August 9th, 2022. We undertake no obligation to revise or update any forward-looking statements to reflect the events or circumstances occurring after the date of this call. With that, it is my pleasure to hand the call over to our CEO, Dr. Jim Breitmeyer.\n\nJim Breitmeyer -- Chief Executive Officer\n\nThank you, Rich, and good afternoon, everyone. At Oncternal, we are advancing a focused and robust product pipeline with clinical and preclinical product candidates that target cancers for patients with unmet medical needs. During the second quarter of 2022, we made significant progress across our entire pipeline, including an encouraging data update at ASCO from a Phase 1/2 study of zilovertamab plus ibrutinib in patients with MCL and CLL, which sets -- so I was saying that we were especially encouraged by our interim data from patients with p53 mutated CLL that we presented at ASCO. This is a challenging population to treat with current standard-of-care BTK inhibitor monotherapy and the combination of zilovertamab plus ibrutinib showed very robust progression-free survival.\n\nAlso in support of our upcoming Phase 3 study ZILO-301, we entered into a clinical trial collaboration and supply agreement with Pharmacyclics, an AbbVie company, for their gracious donation of ibrutinib to support our global registrational program. This is an important milestone, which further validates the clinical value testing ibrutinib with zilovertamab. Next, ONCT-808, our autologous CAR-T product candidate targeting ROR1 also continued to advance and is on track for an IND filing this month. We are enjoying strong collaborations with our partners, which include the Dana-Farber Cancer Institute, cell manipulation core facility, along with Lentigen, and Miltenyi Biotec.\n\nOn the allogeneic our off-the-shelf, our research collaborations with Celularity and the Karolinska Institute continued to generate encouraging data for our next-generation ROR1-based cell therapies. Finally, ONCT-534, our lead candidate for the dual-action androgen receptor inhibitor or DAARI program, continued to advance toward an IND filing and we expect to have pre-IND interactions with the FDA in the fourth quarter of this year. We are optimistic that ONCT-534 may be a differentiated and novel treatment alternative for patients with advanced prostate cancer, as we believe it interacts with both the end terminal and the ligand binding domains of the androgen receptor, inhibiting its function and inducing its degradation. Pre-clinical data have shown that ONCT-534 exerts anti-tumor activity in clinically relevant treatment-resistant prostate cancer models, including those with AR amplification, enzalutamide resistance, or expressing androgen receptor splice variants, such as AR-V7, all of which represent significant medical unmet needs for patients with prostate cancer.\n\nThis broad advancement of our pipeline has occurred against the backdrop of a focused execution and vigilant resource cash management approach. Now let me turn the call over to Oncternal's CMO, Salim Yazji to discuss our zilovertamab clinical data and Phase 3 plans in more detail.\n\nSalim Yazji -- Chief Medical Officer\n\nThank you, Jim. Good afternoon. As Jim mentioned, we recently presented very encouraging data from our ongoing Phase 1/2 clinical trial of zilovertamab in combination with ibrutinib at the ASCO meeting in June. And overall response rate of 85% and the CR rate to 41% for patients with MCL treated with zilovertamab plus ibrutinib, which compares favorably to the historical overall response rate of 66% and the CR rate of 20% for ibrutinib monotherapy.\n\nMedian PFS of 35.9 months for MCL patients with a median follow-up of 15.1 months, which is also compares favorably to the historical PFS of 12.8 months for ibrutinib monotherapy. For patients with p53 mutation, the median PFS was 17.3 months, which is compared again favorably to historical ibrutinib median PFS of four months. In patients with p53 mutated CLL the landmark PFS of zilovertamab plus ibrutinib was 100% at 24 months and 100% at 30 months, which compares favorably to the historical ibrutinib monotherapy landmark PFS of around 68% and around 55% at 24 months and 13 months, respectively. As you may know, mutation and/or loss of p53 protein is a well-known negative prognostic factor in many types of cancer, causing genomic instability and loss of tumor suppression.\n\nThe combination of zilovertamab continue to be well tolerated with the safety profile consistent with or slightly improved compared to historical data for ibrutinib monotherapy. For example, in patients with MCL Grade 3 and 4 neutrophil decreased was documented in only 9.1% of the patients with zilovertamab plus ibrutinib, compared to 29% for ibrutinib alone from its registrational study. In terms of upcoming Phase 3 study ZILO-301, we are on track to initiate the study later this quarter, as we are currently completing key ramp-up activities, including site selection and IRB submissions. As a reminder, ZILO-301 will identify patients with relapsed/refractory MCL, who have only had stable disease or reach a partial response after receiving four months of ibrutinib monotherapy and will randomize them to receive either blinded zilovertamab or placebo plus ibrutinib.\n\nThis study may provide two potential approvals. First, an escalated approval based on overall response rate, ORR, plus duration of response, DOR. And second a regular FDA approval based on progression-free survival of PFS, which is the primary endpoint. Additionally, we are planning to conduct ZILO-302, an open-label companion study of zilovertamab plus ibrutinib for patients who have progression -- progressive disease during the ibrutinib monotherapy run-in phase of the study of ZILO-301 and result of the study could potentially support an additional approval and indication expansion.\n\nRegarding ONCT-808, the lead candidates of our autologous ROR1 targeting CAR-T program, we are on track to submit our IND later this month. In our initial Phase 1 study, we plan to enroll patients with relapsed/refractory aggressive lymphomas, including patients who have failed CD19 CAR-T cell therapy. I will turn the call over to our CFO, Rich Vincent to review our financial results and upcoming milestones.\n\nRich Vincent -- Chief Financial Officer\n\nThank you, Salim. Our revenue is derived from a California Institute for Regenerative Medicine or CIRM grant sub-award and two research and development grants from the National Institute of Health or NIH. In October 2017, CIRM awarded an $18.3 million grant to researchers at the UC San Diego School of Medicine to advance our Phase 1/2 study CIRM-0001. We have conducted a study in collaboration with UC San Diego and expect to receive $14.6 million in development milestones under research subawards throughout the award period, which was substantially completed from a revenue perspective in the first quarter of 2022.\n\nIn the third quarter of 2021, the NIH awarded the company two research and development grants for up to $2.2 million to support preclinical activities for the company's ONCT-534 and ONCT-216 programs. Our grant revenue for the second quarter ended June 30th, 2022, was $0.2 million. Our total operating expenses for the second quarter ended June 30th, 2022, was $12 million, including $1.7 million a non-cash stock-based compensation expense. Research and development expenses totaled $8.8 million, and general and administrative expenses totaled $3.2 million.\n\nNet loss for the second quarter was $11.7 million or a loss of $0.23 per share basic and diluted. Cash flows from financing activities include our first use of the aftermarket program of Jefferies LLC as our sales agent. Through June 30th, 2022, the company sold 2.7 million shares of common stock for a net proceeds of $3.9 million. As of June 30th, 2022, we have $78.9 million in cash and cash equivalents and no debt.\n\nWe believe these funds will be sufficient to support our planned operating activities into the first half of 2024. We have and will continue to manage our cash and all other resources deliberately. As of June 30, 2022, we had $52.2 million shares of common stock outstanding. To summarize our upcoming milestones, for our zilovertamab program, we expect to initiate the global registrational Phase 3 study ZILO-301 in September 2022 and provide an interim clinical data update from our Phase 1/2 study of zilovertamab plus ibrutinib in patients with MCL and CLL in the fourth quarter of 2022.\n\nFor ONCT-808, our lead autologous ROR1 CAR-T cell therapy candidate, we plan to submit our first IND in August 2022. For ONCT-534, our lead DAARI product candidate, we expect to have pre-IND interactions with the U.S. FDA in the fourth quarter of 2022. With that, I will turn the call back over to James.\n\nJim Breitmeyer -- Chief Executive Officer\n\nThank you, Rich. Oncternal has performed well in this historically challenging macro environment. We plan to continue to use our capital and resources efficiently, as we advance our focused pipeline toward significant value inflection points that we believe will make a difference for patients suffering from hematologic malignancies and prostate cancer. We look forward to events later this quarter, especially the planned initiation of our global Phase 3 zilovertamab study and also submitting our ROR1 CAR-T IND application, as well as advancing our DAARI program toward the clinic.\n\nThank you for joining us today and we look forward to updating you over the year and at conferences. With that, I will turn things back to Kyle for the Q&A portion of this afternoon's call.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Hartaj Singh with Oppenheimer. Please proceed with your question.\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nGreat. Thanks, everyone for the update and the question. One is, it's great to see all the programs moving ahead. Just when on the interim update, Jim and team, looking at the p53 mutated CLL patients, you saw some pretty, I would maybe even call an eye-opening data with the PFS, 36 months and 100%.\n\nI mean, what are your thoughts on CLL? What are the sort of discussions you could have regulatory authorities on that, is it intriguing enough that you could run a trial just there with p53 mutated patients, are they easy to find in a clinical trial, put on clinical trials, just any thought there? And then secondly, can you just dig a little bit more into what your Phase 1/2 will look like with the ROR1 ONCT-808 CAR-T, is it a basket trial focused on patients, we've got CD19, etc. If you can just kind of dig into that a little bit more. Thank you for the question.\n\nJim Breitmeyer -- Chief Executive Officer\n\nSure, Hartaj, and thank you for the good questions. And so I'll answer the first one. Salim can handle the second one. So we do believe that the very pleasantly surprising strong PFS result of 100% for patients with a p53 mutated CLL is a -- does represent an opportunity for a registration strategy.\n\nWe believe that about 50% of patients with CLL carry one of these abnormalities, which can include both mutated p53 sequences, but also deletion of the p53 gene or portions of the chromosome. And so most patients are already typed for that, it's known to be a challenging characteristic for BTK inhibitor treatment. And so we think that it would be -- we think there is a potential there for an additional registration strategy. We're headed back to the bench to try to figure out what is going on between ROR1 and p53.\n\nWe know there's got to be some interesting science there. So we hope to learn more about that in the near future. And so that's your first question and let Salim talk about the Phase 1 study for ONCT-808 our CAR-T.\n\nSalim Yazji -- Chief Medical Officer\n\nYeah. Thanks, Jim. Yeah, Hartaj. I mean, what we're trying to do here is to have an aggressive lymphoma in our dose escalation phase, which is specifically is going to be diffuse large B-cell lymphoma and MCL.\n\nOnce we reach our recommended Phase 2 dose, we're going to expand in those two indications and we may go into -- possibly into additional hematological indication.\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nGreat. Thanks. And just a quick follow-up. Jim, can you just put any kind of idea on the timing, you go back to bench, understand the science behind what's going on with the p53 abnormalities and then when would you kind of go and talk to regulators? I mean, is this sort of a 2023 event, maybe 2024, just any thoughts there? And Salim, just in terms of just the patients you're talking about, are there any limitations just from your manufacturing, the sites that you choose for this ROR1 CAR-T study? Thanks for all the questions.\n\nJim Breitmeyer -- Chief Executive Officer\n\nSo I think, I can get both of those, Hartaj. And so we're -- first you were asking about the manufacturing side of the CAR-T program. Is that right?\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nYep. Yeah. Yeah. And --\n\nJim Breitmeyer -- Chief Executive Officer\n\nYeah.\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nYeah.\n\nJim Breitmeyer -- Chief Executive Officer\n\nOK. And so we are -- we've got -- we are having a delightful collaboration with the cell processing facility at the Dana-Farber, actually some -- involving some people who I've known for decades. And they've got -- they have a vast amount of experience with the Prodigy cell processing system that we're using that we think is going to be groundbreaking in the cell therapy field with a really different manufacturing model. And so we're working out all the logistics right now, but we think it's going to be pretty straightforward to get the patient's cells to Boston and then their CAR-T product is frozen and can be transported back for infusion within a -- both ends of the supply chain are pretty straightforward.\n\nAnd then I think timing wise, we're -- as you know, we are being very careful with our cash reserves right now. And so the -- we won't be opening a CLL study this year, certainly, or probably not next year. But we're hoping to have some science to talk about, really, as soon as we can generate it. I will say that a new indication and that could be game changing for 50% of CLL patients is something that some strategic pharmaceutical companies are interested in.\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nYeah. Great. Thank you, Jim. Thanks for all the answers and the comments.\n\nJim Breitmeyer -- Chief Executive Officer\n\nThank you, Hartaj.\n\nOperator\n\nOur next question is from Carl Byrnes with Northland Capital Markets. Please proceed with your question.\n\nCarl Byrnes -- Northland Capital Markets -- Analyst\n\nCongratulations on all your progress and thanks for the questions. My question is on the p53 mutation were answered. So I'll move on to a couple of others. I'm wondering if you have any visibility into the timeline of data from the Phase 1b investigator-sponsored trial at UCSD and prostate cancer? And then also considering the IND submission in August for ONCT-808, would you expect the timeline for first dose patient to be in the September-ish area? Thanks.\n\nJim Breitmeyer -- Chief Executive Officer\n\nSo for the -- I'll start on the -- in the investigator-sponsored study, we really don't have any control over the rate of enrollment or availability of data. So I can't -- I -- we know as much as you do, Carl, and you usually know more than we do. But I'll let Salim comment on the second question.\n\nSalim Yazji -- Chief Medical Officer\n\nYeah. Carl, can you please report -- repeat your second question, please?\n\nCarl Byrnes -- Northland Capital Markets -- Analyst\n\nYeah. This is with respect to ONCT-808, considering the IND is going to be filed in August, would it be safe to assume or would your expectation be the first patient dose would be in the September timeframe or whatever timeframe you would expect? Thanks.\n\nSalim Yazji -- Chief Medical Officer\n\nWell, I mean, as you know, we're going to submit the IND end of August and it's will probably be 30 days hold-on period from the FDA. So before we get the green light, there's no questions from the FDA, that's probably going to put us until end of September, beginning of October. And I think with regard to the patients, I mean, once we get the IRB approval and it's may take some time, it's going to be -- we're going to be all ready to go. But we are hoping to have our patients hopefully by before the end of this year.\n\nCarl Byrnes -- Northland Capital Markets -- Analyst\n\nGreat. Thank you.\n\nJim Breitmeyer -- Chief Executive Officer\n\nThank you, Carl.\n\nSalim Yazji -- Chief Medical Officer\n\nThanks.\n\nOperator\n\nOur next question is from Robert Burns with H.C. Wainwright. Please proceed with your question.\n\nRobert Burns -- H.C. Wainwright -- Analyst\n\nHey, guys. Thanks for taking my questions. Just two if I may. So I know that you're going to be pursuing, patients who have received prior CD19 targeted therapy for the hematologic malignancies your ROR1 targeted CAR-T.\n\nI was just curious, whether you're also thinking about solid tumors given the expression of ROR1 and solid tumors express lung and stomach cancer. And then my second question, with -- your financial guidance for your operational runway, does that take into account clinical trials for both ONCT-808 and your lead DAARI assets?\n\nJim Breitmeyer -- Chief Executive Officer\n\nSo I'll answer the first question and then we'll have Rich talk to you about the cash runway. So, yes, we are very interested in extending our cellular immunotherapy program into patients with solid tumors. As you know very well, the current generation of CAR-T, even though they work so very well in liquid tumors have had a hard time overcoming the immunosuppressive microenvironment of solid tumors. And so I think that most people in the field feel like we do that, you're going to need some additional success factor to get somewhere with the solid tumors, like, checkpoint inhibition or TGF beta suppression, something -- those are the sorts of things that people are looking at.\n\nAnd so we're keeping our eyes open for potential add-on therapy to the CAR-T that would open up the solid tumor field. We could treat some solid tumor patients' kind of a basket trial without that technology, but we think that it would be more likely to succeed with additional tech. And Rich, on the runway question.\n\nRich Vincent -- Chief Financial Officer\n\nSure. So, overall, our model or spend forecast does include what we've discussed today as our upcoming milestones and it also includes the initial studies for both ONCT-808 and ONCT-534 and this time price.\n\nRobert Burns -- H.C. Wainwright -- Analyst\n\nAwesome. Thanks, guys.\n\nJim Breitmeyer -- Chief Executive Officer\n\nAnd Rich and I have always been very thrifty and we're going to stay that way.\n\nRobert Burns -- H.C. Wainwright -- Analyst\n\nSound good. Sounds good.\n\nOperator\n\nOur next question is from Kumar Raja with Brookline Capital Markets. Please proceed with your question.\n\nKumar Raja -- Brookline Capital Markets -- Analyst\n\nThanks for taking my questions and also congratulations on the progress. With regard to ONCT-808, what are your expectations in terms of the starting dose and how soon do you think you can get to the recommended Phase 2 dose?\n\nJim Breitmeyer -- Chief Executive Officer\n\nYes. Kumar, thank you for the question. We're going to start at a dose of one-times 10 to the six T cells per kilogram of ideal body weight and that is a starting dose that FDA already agreed we could use in pre-IND discussions and we think then that we can get to a recommended dose with three, maybe four, but just a few dose levels. We think we'll be able to get there pretty quickly.\n\nKumar Raja -- Brookline Capital Markets -- Analyst\n\nOK. And you will have sales from like a single manufacturing run to do all these dose escalations?\n\nJim Breitmeyer -- Chief Executive Officer\n\nYeah. We're getting with healthy donor Leukopaks. We're getting massive have numbers of CAR-T cells with very high expression levels. And so we can make -- we appear to be able to make more CAR-T cells then we're going to need.\n\nKumar Raja -- Brookline Capital Markets -- Analyst\n\nOK. And with regard to the clinical agreement with the Pharmacyclics for supplement of ibrutinib, how much involvement will they have in the clinical trials, and what kind of expectations are there from Oncternal for this?\n\nJim Breitmeyer -- Chief Executive Officer\n\nSo it's -- we're having -- we're enjoying a really good working relationship with the Pharmacyclics and AbbVie clinical team. They have provided some very helpful advice in terms of the study design and some elements, their experience with ibrutinib is very valuable here. And so, they have -- we -- if we make changes in the protocol, we would welcome their assistance with any modifications that we make. And but I think, to be clear, they don't have any commercial rights to the product gained from this relationship.\n\nKumar Raja -- Brookline Capital Markets -- Analyst\n\nOK. Finally, with regard to ONCT-534, following the pre-IND interactions with the FDA, what do you think would be the timing of IND filing for that?\n\nJim Breitmeyer -- Chief Executive Officer\n\nSo, Salim, I'll take this on me, because of the preclinical question. There's an interesting COVID-related thing going on right now and you may have heard this from some of the other companies that you follow. But there is a worldwide shortage of Beagle dogs for preclinical toxicology work. And it's going to take some time for it -- believe it or not, for the dog supply to catch up with the demand and that's the species that everybody uses for tox studies.\n\nAnd so we're in a little bit of a holding pattern right now for the timing of finishing our tox work. We're confident that we'll have an IND next year, but we're not guiding to a date at this point.\n\nKumar Raja -- Brookline Capital Markets -- Analyst\n\nGreat. Thanks so much.\n\nJim Breitmeyer -- Chief Executive Officer\n\nAll right.\n\nOperator\n\nWe have reached the end of the question-and-answer session. And I will now turn the call over to CEO, Jim Breitmeyer for closing remarks.\n\nJim Breitmeyer -- Chief Executive Officer\n\nSo thank you everybody for joining us today. We were pleased to pass along our significant progress and delighted to be able to interact with such good questions with those who are following the company. And so, with that, thank you and good day to everyone.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRich Vincent -- Chief Financial Officer\n\nJim Breitmeyer -- Chief Executive Officer\n\nSalim Yazji -- Chief Medical Officer\n\nHartaj Singh -- Oppenheimer and Company -- Analyst\n\nCarl Byrnes -- Northland Capital Markets -- Analyst\n\nRobert Burns -- H.C. Wainwright -- Analyst\n\nKumar Raja -- Brookline Capital Markets -- Analyst\n\nMore ONCT analysis\n\nAll earnings call transcripts"
}