{
  "companyName": "Marvell Technology Group",
  "companyTicker": "MRVL",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/marvell-technology-group-mrvl-q2-2023-earnings-cal/",
  "content": "Marvell Technology Group (MRVL 0.76%)\nQ2 2023 Earnings Call\nAug 25, 2022, 4:45 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Marvell Technology's fiscal second quarter 2023 earnings conference call. All participants will be in listen-only mode. [Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Mr.\n\nAshish Saran, senior vice president of investor relations. Please go ahead.\n\nAshish Saran -- Vice President, Investor Relations\n\nThank you, and good afternoon, everyone. Welcome to Marvell's second quarter fiscal year 2023 earnings call. Joining me today are Matt Murphy, Marvell's president and CEO; and Jean Hu, our CFO. Let me remind everyone that certain comments made today may include forward-looking statements, which are subject to significant risks and uncertainties that could cause our actual results to differ materially from management's current expectations.\n\nPlease review the cautionary statements and risk factors contained in our earnings press release, which we filed with the SEC today and posted on our website, as well as our most recent 10-K and 10-Q filings. We do not intend to update our forward-looking statements. During our call today, we will refer to certain non-GAAP financial measures. A reconciliation between our GAAP and non-GAAP financial measures is available in the investor relations section of our website.\n\nWith that, I'll turn the call over to Matt for his comments on our performance. Matt?\n\nMatt Murphy -- President and Chief Executive Officer\n\nThanks, Ashish, and good afternoon, everyone. In the second quarter of fiscal 2023, the Marvell team drove another record level of revenue at $1.52 billion, growing 41% year over year and 5% sequentially. Revenue on an annualized run rate exceeded $6 billion, a significant achievement for Marvell. Revenue collectively from our four data infrastructure-focused end markets grew 49% year over year and 7% sequentially, reaching a new high of 89% of our total revenue.\n\nMoving on to the rest of the income statement. Our GAAP gross margin was 51.8%, GAAP operating margin was 2.6%, and GAAP EPS was $0.01. Our non-GAAP gross margin was 65%, and our non-GAAP operating margin hit a new record at 36.5% of revenue. Disciplined opex management helped drive our non-GAAP earnings per share to $0.57, above the midpoint of guidance.\n\nEarnings per share grew 68% year over year, much faster than our revenue growth as we continue to drive operating leverage. Now let me provide a brief update on the outlook for demand and supply. We continue to see healthy demand for our products with the exception of consumer HDD, and our overall demand is outpacing supply. The very successful adoption of our new products and strong end market demand has enabled Marvell to grow revenue significantly above our long-term target model.\n\nAs a reminder, at our last Investor Day in October 2021, we had updated our long-term model for revenue growth to a target range of 15% to 20% from an annualized revenue run rate at that time of $4.3 billion. At the midpoint of the target, it would have taken us two years to achieve $6 billion in annualized revenue run rate. We are very pleased that we were able to cross this milestone this quarter, a full year ahead of our target. As we look forward, we are confident that our long-term growth opportunity is consistent with our target model even off this higher base of revenue.\n\nLet me now turn to supply. Despite a choppy supply environment, the strength of our business model and diversity in end markets enabled us to achieve our overall revenue guidance in the second quarter. We expect our revenue mix by end market will continue to be influenced more by supply than demand in the near term. As we continue to secure capacity to support our long-term growth, we are encouraged to see some pockets of additional supply starting to open up on certain nodes and simple package technologies.\n\nIn contrast, for our high complexity products with long manufacturing cycle times, such as in our data center end market, the supply chain for leading-edge technology and advanced packaging remains very tight. Our operations team continues to execute our strategy to deeply engage with partners to support our long-term growth. Let me now move on to discussing our five end markets, starting with data center. In our data center end market, revenue for the second quarter was $643 million.\n\nOn a year-on-year basis, our data center revenue grew 48%, with our cloud business growing significantly faster. The year-over-year growth was very broad-based with multiple product lines contributing to strong results. On a sequential basis, the continued growth from our cloud business was offset by a decline in our on-premise business flattening our data center revenue. In the on-premise business, the sequential decline was driven primarily from our fiber channel and Ethernet adapters.\n\nWe believe the overall demand picture in cloud data centers remains healthy, and that this market represents the single biggest long-term growth driver for Marvell. We expect growth to continue from a number of exciting areas, including electrooptics, cloud-optimized custom solutions, cloud switching, and our broad data center storage portfolio. At the Flash Memory Summit earlier this month, Marvell showcased many state-of-the-art data center storage solutions, including our Brevera PCIe Gen 5 SSD controller, and Ethernet Bunch of Flash solution for AI and ML, and CXL. As you recall from our discussion last quarter, we see CXL as the next big evolution in cloud data centers that will enable us to increase our reach into the memory ecosystem and presents a multibillion-dollar SAM expansion opportunity for Marvell.\n\nThis includes a host of new products such as CXL expanders, cooling devices, switches, and accelerators and the potential to embed CXL IP and a broad range of our data center products. Events and presentations at FMS strongly validated our excitement around CXL. This is the hottest topic at FMS with standing room-only presentations by many leading industry participants. The Marvell booth, we demonstrated the industry's first CXL memory pooling solution, addressing the challenges related to memory scaling and cloud data centers.\n\nWhile the industry is still in the early stages of CXL adoption, we are working on closing significant opportunities right in front of us at key customers and envision a strong design win pipeline. Turning now to the third quarter of fiscal 2023. In data center, year over year, we are expecting revenue growth of over 20%, driven by our cloud end market. Due to the complex nature of products for this end market, we expect supply challenges in the third quarter to impact our ability to fully meet the demand on a sequential basis.\n\nAs a result, we expect revenue from cloud customers to be flat sequentially and revenue in the on-premise market to decline. Therefore, for our overall data center end market, we project revenue in the third quarter to decline sequentially in the mid-single digits on a percentage basis. However, we expect our data center revenue in the fourth quarter to increase on a sequential basis, anticipating an improvement in supply and new product ramps in cloud. Turning to our carrier infrastructure end market.\n\nRevenue for the second quarter was well above our forecast at $285 million and growing 45% year over year and 13% sequentially. We benefited from a strong performance from both our wireless and wired end markets. Our wireless business continued to advance in the second quarter, benefiting from the growth in 5G adoption. With an annualized revenue run rate crossing $600 million, we are thrilled to have achieved an important milestone.\n\nWe expect to see an extended period of growth for our 5G business with multiple regions such as Europe and India yet to launch 5G in a meaningful fashion. We expect to see further growth in other large geographies such as the U.S., which are only in their first year of mainstream deployment. In addition, we have significant content growth in the next generation of base stations still in front of us. In wired, we saw stronger-than-expected shipments of our coherent DSPs and accompanying TIAs and drivers to wired customers.\n\nWe are seeing strong demand in the metro and long-haul carrier markets driven by a rapid adoption of our 400-gig coherent electro-optics portfolio. We are pleased with the strong launch of these products.Looking ahead to the third quarter of fiscal 2023 for our carrier end market. We are expecting year-over-year revenue growth in the mid-20% range, driven primarily by our wireless end market. On a sequential basis, we expect wireless revenue to continue to grow, driven by 5G deployments.\n\nHowever, after a very strong second quarter, we expect a sequential decline in revenue from wire to more than offset the growth from wireless. As a result, we project revenue from the overall carrier end market to decline in the mid-single digits sequentially on a percentage basis. Moving on to our enterprise networking end market. Revenue for the second quarter was $340 million, growing 53% year over year and 19% sequentially, better than our guidance driven by improvements in supply.\n\nOur strong growth in enterprise networking is primarily a result of our own unique product cycles. Our revenue growth has accelerated as our customers have started shipping their new platforms where we have the dual benefits of share gains and an increase in content, driven by the adoption of higher-value products such as our multigigabit Fis. In the second quarter, we see ongoing growth from our refreshed Ethernet switch and Fi portfolio. We also benefited from a ramp in our custom silicon products for enterprise networking, which is a new growth vector in this end market for Marvell.\n\nIn the third quarter of fiscal 2023, we expect a continuation of strong demand for our products from the enterprise networking end market. As you heard earlier, we are seeing pockets of supply opening up, which should enable us to begin to catch up to demand. As a result, we are projecting revenue from enterprise networking to grow approximately 70% year over year and over 20% sequentially. Turning to our automotive and industrial end market.\n\nRevenue for the second quarter was $84 million, growing 46% year over year. Our auto business continued to grow sequentially, but this was more than offset by a supply impacted industrial business. As a result, overall revenue from the combined end market declined 6% quarter over quarter. Year over year, our auto business, driven by higher adoption of Marvell's Ethernet technology continued its strong growth trajectory with revenue doubling.\n\nLast quarter, I discussed our growing list of Ethernet design wins in our auto business, which expanded to eight of the 10 largest OEMs worldwide and 36 OEMs in total. I would highlight that the lifetime revenue from these new design wins is substantially larger than prior wins. At large auto OEMs, we are winning in their highest volume internal combustion engine segments, along with their higher content in their EVs and hybrids. These wins tend to be multi-platform in nature, covering many models simultaneously.\n\nOverall, content is continuing to grow, driven by an increase in the number of Ethernet-connected endpoints, coupled with the need for more bandwidth. Looking to the third quarter of fiscal 2023. We are projecting revenue growth to remain over 40% year over year and grow in the mid-teens sequentially on a percentage basis for the combined auto and industrial end market. We project all of the sequential growth to be driven by our automotive products where we are experiencing strong demand and continuing improvements in supply.\n\nMoving on to our consumer end market. Revenue for the second quarter was $164 million, declining 1% year over year and 8% sequentially. Results were below guidance as demand from the HDD market weakened. In contrast to Consumer HDD products, revenue in the second quarter from our consumer SSD controllers continue to grow both sequentially and year over year.\n\nLooking ahead to the third quarter of fiscal 2023 for our consumer end market, we are forecasting revenue to be flattish sequentially. On a year-over-year basis, we expect revenue from the consumer end market to decline by approximately 10% due to softness in consumer HDD demand, partially offset by continued growth in our SSD business. In closing, we delivered record results for the second quarter and are guiding for continued growth in the third quarter. Our strategy to focus on a diversified portfolio and data infrastructure is playing out very well as we continue to deliver strong results.\n\nWe have limited exposure to the headwinds that consumer-exposed companies are now facing. In the third quarter, at the midpoint of the range, we are guiding our revenue to grow by 29% year over year, and we expect operating leverage in our business model to drive non-GAAP EPS at the midpoint of guidance to grow by 37% year over year. Looking forward, we are projecting our revenue growth to accelerate on a sequential basis in the fourth quarter on the back of more supply and new product ramps. As we wrap up the first half of fiscal 2023, I'm very pleased with the trajectory for full year revenue, which is well above the target we established last December.\n\nAt that time, we had discussed our target for fiscal 2023 annual revenue growth in the low 30% range. I'm very pleased to note that we are running well ahead of that target with full year revenue growth now tracking toward the high 30% range. Over the last six years, through organic investments and strategic M&A, we have significantly transformed the company pivoting to data infrastructure, accelerating our technology road map, and driving a tremendous increase in design wins. We are now seeing the benefits of these efforts in our revenue growth, operating margin expansion, and increased exposure to the critical cloud, 5G, and auto end markets.\n\nAs we look at next fiscal year, despite economic and semiconductor cycle concerns, we are optimistic about our prospects. We expect to benefit from our favorable end market exposure and significant revenue contributions from a number of Marvell-specific product cycles, which we have discussed in detail over the last several quarters. Before I hand off to Jean, let me provide an update on our Board and ESG. Earlier this week, we announced the addition of Rebecca House to the Marvell Board of Directors.\n\nShe currently serves as senior vice president, chief people, and legal officer and corporate secretary at Rockwell Automation, a global leader in industrial automation with 25,000 employees worldwide. She was selected for her extensive background in the areas of talent management, legal, ethics and compliance, public affairs, security and sustainability. I'm excited to have Becky join our already strong group of directors and I am looking forward to working with her. Finally, I'm pleased to announce the publication of Marvell's inaugural sustainability report.\n\nI encourage you to review the report on our website to learn more about our ESG performance and future goals. And with that, I'll turn the call over to Jean for more detail on our recent results and outlook.\n\nJean Hu -- Chief Financial Officer\n\nThanks, Matt, and good afternoon, everyone. I'll start with a review of our financial results for the second quarter and then provide our current outlook for the third quarter of fiscal 2023. Revenue in the second quarter was $1.517 billion, growing 5% sequentially and 41% year over year. Data center was our largest end market, accounting for 42% of consolidated revenue.\n\nEnterprise networking was next largest with 22% of total revenue, followed by carrier infrastructure at 19%. Consumer at 11%, and auto industrial at 6%. GAAP gross margin was 51.8%. Non-GAAP gross profit was $986 million, increasing 41% year over year.\n\nNon-GAAP gross margin was 65% of revenue, slightly below the middle point due to product mix. GAAP operating expenses were $747 million, and included the cost of share-based compensation expenses of $135 million, amortization of acquired intangible assets of $88 million, and $85 million charge of contractual legal disputes segment, and $7 million in other acquisition and divestiture-related costs. Non-GAAP operating expenses were $432 million, below the midpoint of our guidance. Opex increased by 18% year over year as we added headcount to deliver the marketable new design we have won with key customers.\n\nWe continue to drive strong operating leverage to grow opex to significantly less than top-line revenue growth. GAAP operating income was $39 million. Our non-GAAP operating profit was $554 million, increasing by 67% from a year ago and non-GAAP operating margin was 36.5%, a record for Marvell. For the second quarter, GAAP income per diluted share was $0.01.\n\nNon-GAAP income per diluted share was $0.57, increasing by 68% year over year. Now turning to our balance sheet and cash flow. During the quarter, we generated $332 million in cash from operations, reflecting our strong earnings offset by continued working capital investments to support our top-line revenue growth. We have increased our inventory by $78 million to better address demand from our customers in a very tight supply chain environment and to help ensure a smooth ramp for a number of new design wins that we expect to start shipping in the next few quarters.\n\nThe majority of this increase was in raw materials and with -- looking longer term, as the supply chain start to show improvement, we expect our DOI will start to decline. Consistent with our strategy to secure longer-term supply, we have increased our long-term purchase commitment for capacity to support the number of high-volume source of the design wins. Purchase commitments increased by $447 million in the second quarter to a total of approximately $3.4 billion. Please note, this commitment are over a multiyear time period.\n\nAt the end of the second fiscal quarter, our cash and cash equivalents was $617 million. We intend to maintain a higher cash balance compared to the last few years as our business has significantly increased in scale. Our total debt was $4.6 billion. Our gross debt-to-EBITDA ratio was two times and net debt-to-EBITDA ratio was 1.8 times.\n\nWe returned $101 million to shareholders through $51 million in cash dividends and $50 million of share repurchase. Now turning to our guidance for the third quarter of fiscal 2023. We expect the following: revenue will be in the range of $1.56 billion, plus or minus 3%. GAAP to gross margin will be in the range of 51.1%, plus or minus 1.1%.\n\nNon-GAAP gross margin will be in the range of 65%, plus or minus 0.25%. GAAP operating expenses will be in the range of $667 million to $677 million. Non-GAAP operating expenses will be in the range of $435 million to $440 million. At the middle point of our guidance, we expect to deliver 37% non-GAAP operating margin.\n\nWe continue to make significant progress toward our long-term target of 38% to 40% non-GAAP operating margin. Other income and expense, including interest expense, will be approximately $38 million. For the third quarter, we expect a non-GAAP tax rate of 6%. We expect our basic weighted average shares outstanding will be 854 million.\n\nAnd our diluted weighted shares outstanding will be 862 million. As a result, we expect GAAP earnings per share in the range of $0.05 to $0.13. We expect non-GAAP income per diluted share in the range of $0.56 to $0.62. Operator, please open the line and announce Q&A instructions.\n\nThank you.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] Our first question comes from Toshiya Hari of Goldman Sachs. Please go ahead.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nHi, good afternoon. Thanks so much for taking the question. Matt, I wanted to ask a question on calendar '23 or fiscal '24. You gave some brief comments as it pertains to some of the big growth drivers that you've talked about in the past.\n\nI was hoping you could remind us perhaps the top three drivers that are idiosyncratic to Marvell as you look out into fiscal '24. And how you're thinking about the supply side of the equation. Do you think by fiscal '24, you'll be shipping to demand or you'll still be constrained, whether it be wafers or substrates? And the third part of my question, I think consensus has you growing top line by about 17%. Is that a fair number to start off with? Or is that too high, too low? Any comments on where Street consensus is today would be helpful.\n\nThanks so much.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. Thanks, Toshi. We'll go ahead and do the trifecta of questions here. No problem.\n\nSo on the first one, for next year, as you point out, there are a number of Marvell-specific growth drivers, which we're very excited about. I'll cover three of them. And then, of course, there's other things going on as well. So, the three biggest buckets and then the No.\n\n1 of all three is our cloud-optimized silicon ramp. What we've talked about in the last few quarters and even year is a number of new design wins that we achieved over the last couple of years in this cloud-optimized silicon area. And we sized it, for those of you on the call that haven't been following it, at about $400 million of incremental revenue for next year and then $800 million the year after. And that's still tracking extremely well.\n\nWe have good line of sight on those programs. They're quite diverse in nature, by the way. So there's a number of them that are going to have to ramp, and that's all tracking well. The second is, and you saw even in the most current quarter, again, another strong performance out of our 5G business in wireless, and the adoption of 5G will absolutely continue next year.\n\nAnd really, on top of that, which is more specific to Marvell is we have incremental content gains and SAM expansion coming as well. So that's also in front of us. And then on the third, our automotive business, which in general, has been about doubling on a year-on-year basis, if you go back over the last few quarters. This is automotive Ethernet.\n\nThat also has a very strong outlook as well for next year. And again, this is really based on the breadth of design wins, Toshiya, we have across almost all the major top OEMs, as well as virtually all the emerging next-generation car companies. And by the way, it's proliferating both in the ICE vehicles, as well as electric vehicles. So those three, I think, are good buckets to think about.\n\nOn the follow-up on the constraint side, we are seeing some loosening of supply, as I said in my prepared remarks, which we believe will begin to benefit us, some of which will be in Q4. When you -- as you think about next year, when you look at the broader supply chain and you actually focus in on the bleeding edge technology types of components that are required, whether that's advanced packaging and substrates, some of the advanced node process technology and just some of the complex nature of the products we're dealing with, those we have to manage very carefully. They have long manufacturing cycle times, and we need to plan appropriately. But currently, we feel very good about our line of sight to be able to ramp up these programs in line with what our customers need, and we're having those discussions as we speak.\n\nAnd then the final part is with respect to the outlook next year, I think the biggest thing to take away really is at the highest level, we're ahead of plan on where we thought we were. If I went back to our Analyst Day back at the end of 2021, we're on the $6 billion annualized revenue run rate. Now our current year looks like it's going to be above where we thought it would be back at the end of last year. So that's all positive.\n\nAnd as we look forward, we do see the long-term target model being achievable even off this higher revenue run rate. So that's more of a long-term comment. But certainly, if you add up our growth drivers and you look at where we are today, we feel very good about fiscal '24 or calendar '23 next year. Thanks.\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nThanks so much.\n\nOperator\n\nThe next question comes from C.J. Muse from Evercore. Please go ahead.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nYes, good afternoon. Thank you for taking the question. I guess a question around data center, particularly as it relates to the October quarter guide. I'm surprised that cloud is tracking only flat.\n\nAnd I guess, is that kind of a supply constraint that caught you by surprise? Or otherwise, less than 3% sequential growth seems a little bit light. I would love to hear your thoughts around that.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah, no problem, C.J. Yeah, a couple of things. One is, I said some of this in the prepared remarks. As we've battled through on the supply side, like a lot of other companies this year, it's been quite lumpy in terms of when the supply comes in and by what end market.\n\nAnd so on an average quarter, we're not exactly even over the last few quarters, able to perfectly forecast how much we can deliver. Now that said, in data center just for perspective, we had a huge step up starting in our Q1 of this year. We were constrained last year. We made a lot of great progress.\n\nOur Q1, I believe, was up something like 12% sequentially from our Q4 with -- and then we've sort of held at that level, maybe slightly increased a little bit through that time frame. And on a year-over-year basis, cloud has been absolutely on fire. And the final point would be in the fourth quarter, we see a step up again both on a sequential basis. So, I wouldn't say it necessarily surprised us.\n\nI think we've known these programs, and we're doing our best. But at this -- and we're going to try to do better for this quarter, by the way. But at this point, this is how we see it. The cloud business for us has been extremely strong and overall for Marvell remains healthy.\n\nI would say it's more of a supply timing issue, and our operations team is all over it to try to obviously make sure we meet what our customers need and ramp when they want to ramp.\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nThank you.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah.\n\nOperator\n\nThe next question is from Ross Seymore from Deutsche Bank. Please go ahead.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nHi. Thanks for letting me ask a question. Matt, I want to talk about the cloud optimized side. I know you answered to a previous question that, that should be an idiosyncratic driver for you next year.\n\nBut how do I blend together, frankly, the answers to the first and the second question that was already asked where the cloud side is lumpy, have ups and downs, but the good part is it's idiosyncratic, and you expect it to grow? So, I guess the net of it all is, do you see risk to that $400 million over the next year and then another $400 million the year after there if macro and/or supply stays lumpy? Or do you think the customer-specific very customized aspect of those businesses will allow that to grow and deliver those numbers even in a more choppy environment?\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. Sure, Ross. Great question. Maybe just before I answer it, I'll just give a higher-level view.\n\nAnd your question is cloud-specific, but if I just frame the overall Marvell strategy that we've put together and the business model we've put together, it's been one where diversification and breadth of product offering and technology and obviously, the financial model to go with it has been our North Star, right, since I joined the company and since this management team has driven this transformation. So you can even see it in the short term where like, for example, we've got constraints in cloud this quarter, but enterprise and automotive, when you look out to next quarter are doing extremely well, and that's because of our diversification of our model, all focused around data infrastructure, by the way. So, while there may be lumpy \"parts\" of our business from time to time, that is by design, how we've architected the business model of Marvell. And it's taken a long time to get here.\n\nAnd I think it's actually proving to be very resilient when you look at our Q3 being up and then our Q4 actually accelerating. So that's the bigger picture around how we think about it and managing lumpiness. Now with respect to the cloud, I might want to put a little asterisk by the 400, 800, and that we've actually talked about it being 400-plus and 800-plus in prior calls, which means the 400, 800 was identified last year. And then subsequently, in our communications with investors, including earnings calls, we've said we've actually won more business since then with incremental revenue both in fiscal '24 and fiscal '25.\n\nSo next year and the year after. So think of it as kind of 400-plus, 800-plus diversified across a number of programs. So the bottom line is we feel very good about that ramp. Some of them, I'm sure, will require a lot more than we're planning for at this point.\n\nAnd I'm sure a few of them will require less than we're planning. But in aggregate, when we judge the outlook, and we just did a refresh of this just very recently, not only internally, but even with my key customers in terms of planning for next year, that ramp looks very solid in both of those years.\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Timothy Arcuri with UBS. Please go ahead.\n\nTimothy Arcuri -- UBS -- Analyst\n\nThanks a lot, Matt. I also wanted to ask about data center. And last quarter, I think the expectation was that you were going to see some reacceleration as the supply was going to improve into the back half of the fiscal year. So, I know that the enterprise portion of that business is weak.\n\nBut maybe can you help us understand sort of what's going on there? Maybe tell us how much cloud is as a portion of the total data center business? And then also into fiscal Q4, it sounds like total revenue is going to be close to $1.7 billion for you to be up high 30s, and that's up nearly 10% Q on Q. But I'm wondering how much data center will be up. I mean you said it's going to be up Q on Q, but I would think it should easily be up double digits with more supply, you have the five-nanometer products ramping. So, I wonder if you can help with that.\n\nThanks.\n\nMatt Murphy -- President and Chief Executive Officer\n\nSure. Yeah, a couple of things. So, on the first part on the data center, what we've said is that our -- the larger portion of the total is in cloud. So, the exact number, we haven't quite disclosed it, but call it closer to 60%, 60-plus percent versus 40%.\n\nSo that's been -- and that's why we said even in this prior quarter on the year on year, cloud grew much faster than the total just because of the enterprise of the mix. Now reminder, a little bit on the enterprise side. It's not a great proxy of what I would call enterprise data center from the standpoint that those products we sell into that market are fiber channel and Ethernet adapters, which are somewhat of a legacy type of business for Marvell. So that one we feel we've been pretty upfront about this.\n\nThat doesn't have a lot of growth per se ahead. And so really, it's been all about the cloud. The -- in Q4, as we said, the overall company revenue, we expect to accelerate off of Q3. We haven't pegged the number.\n\nI think the range you're discussing looks a little on the high side. But if you just back into the high 30s comment we made and you take the two quarters we've already produced, we take our Q3 guide, and look at Q4, you'll get to a range that seems to make sense. So, yeah, I guess bottom line is we do -- and I think the acceleration we thought we would get in the second half on cloud is more a Q4 type of story than Q3, and that's how it's playing out primarily on the basis of supply.\n\nTimothy Arcuri -- UBS -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question is from Blayne Curtis with Barclays. Please go ahead.\n\nBlayne Curtis -- Barclays -- Analyst\n\nHey, good afternoon, and thanks for taking my question. I just wanted to go back to the demand part of the equation. I thought you said in the beginning, consumer HDDs were the only thing weak, but you have two segments that are down. So just maybe just revisit that even in the areas like enterprise that are up a bit, it sounds like supply.\n\nSo, I just wondered if you could revisit the demand outlook and I think you said data center is kind of lumpy, but I mean is it all lumping in timing and supply even for the businesses that are down? Or have you seen any broader downticks on that demand side?\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah, Blayne, I think when I look at your question there, the enterprise side and particularly the on-prem, I do think that that has been more lumpy in terms of the supply we've gotten and how we've delivered it. We haven't really seen a lot of demand changes there per se. But we certainly, in our first quarter and a little bit of our second quarter, we're able to produce more supply than we had hoped. So when we talk to customers, the demand signals there don't look anything out of the ordinary versus what we have seen historically.\n\nThis is because it kind of feels like we're going back to a little bit of where we were before this huge upcycle. But it's all within the normal range. I think the comment on Consumer HDD was really -- it's down, it's pronounced. We can quantify it.\n\nBut the other part you mentioned is it's more around the lumpiness of our supply delivery rather than demand being down.\n\nBlayne Curtis -- Barclays -- Analyst\n\nThanks, Matt.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah.\n\nOperator\n\nThe next question is from Matt Ramsay with Cowen. Please go ahead.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nYeah. Thank you very much. Good afternoon. I don't know, just for a change of pace, maybe something not in data center.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYou can go there, Matt, no problem.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nI wanted to ask about the enterprise networking segment. The big upside there and guiding for almost 25% growth or 70% year over year. Is that -- maybe you could talk about the specific product cycles that are going on there? Or is it, in fact, that's where you're able to upside in supply and just sort of disaggregate what's driving that to be the fastest-growing segment right now? Thanks.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. Thanks. Yeah. Actually, it's a combination of both where we have very strong demand for our products.\n\nI'll cover that in a second on why that's a little bit unique to us. But then also, I would say, we're -- we have been -- we called this out a couple of quarters ago. This had been one of our more pronounced areas of delinquency, and we're starting to finally catch up. So it's a combination of both, Matt, which I think is producing a very strong result, obviously, as we guide out not only in the Q3 guide but also the quarter we just finished.\n\nSo on the demand side, I mean, we've -- I think a couple of things, right? In our sort of classic Marvell portfolio, we've had very consistent share gains and new product introductions with a lot of success in the enterprise-class Ethernet switch and Fi area. In some of those cases, we sell the two products together as part of a total solution. And one trend that I think we had talked about for quite a while, and it's actually here, and it's right in front of us, and it's showing up in our numbers is the adoption of multi-gig PHY technology. The large enterprise OEMs, and you can listen to their commentary, they're seeing a big uptick.\n\nA lot of that is driven by Wi-Fi 6, which at some point, the wireless rate, line rate was going faster than the wired rate. So that's driven a pretty big adoption. And the content and the per port has gone up dramatically as you switch to multi-gig. And it's not like 10%, 20%, 30%.\n\nIt's sort of multiples on a per port basis of where it was before. And that's hitting, OK? So, you've got increased PHY content, new products ramping. We've won new customers over the last few years and we've gained share. So that's been a good story, and it's been pretty consistent, by the way, although it's accelerated in the last few quarters.\n\nAnd then on top of that, a lot of the constraints we had, had in this area, we finally started seeing the supply improvements based on our own partnerships that we've struck with our various suppliers. And so that's starting to benefit as well. And we're finally sort of getting more caught up here. So all in all, I think a great performance, obviously, out of enterprise.\n\nIt's at a much higher run rate than I think certainly, people were planning or we were even thinking back at our Investor Day a year ago, but we're pleased that I think the designs we won actually have ramped up, and we still have a bright outlook from here. The final one I would say, Matt, is that we also had some new incremental business on custom-silicon and ASIC in the enterprise, which was not an area where we historically played. And those are also going to production as well, both starting this year, but even reaching full volume or not -- let's call it, run rate volume next year. So I think a lot of new product stuff and good supply improvements.\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nThanks for all the detail, Matt.\n\nOperator\n\nThe next question is from Gary Mobley from Wells Fargo. Please go ahead.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nGood afternoon, everybody. Thanks for taking my question. I had a couple of questions on the -- some of your foundry relationships. Jean, I believe you mentioned that your purchase obligations with your foundry partners ticked up about 15% sequentially.\n\nIt sits in about a half year's worth of revenue. I'm wondering if given that capacity seems to be freeing up a bit, might we see that those purchase obligations level off? And what are the risks thereof maybe not being able to take all that commitment in the future? And then as well, have you -- or do you anticipate any additional price increases from your foundry partners that you may eventually have to pass on to customers?\n\nJean Hu -- Chief Financial Officer\n\nYeah. Hey, Gary, thanks for the question. First, on the long-term purchase commitment. As Matt mentioned, right, we focus on data infrastructure.\n\nOur products tend to have a very long product cycle and most of our products were so soft. So based on the design wins we have and the product ramp and the business planning, we struck strategic relationships with our suppliers to ensure we can secure the capacity in the longer term. So when you look at the purchase commitment, those are very long-term commitments like two, three, five to seven, or even beyond the year. Our team has done a great job to really analyze what we need and what we should strike as a long-term purchase agreement.\n\nTypically, it's only a very small portion of our overall supply needs. So we actually feel very comfortable by analyzing the need, the product ramp or the customer relationship, and what we are committing. If you look at it each year, it's actually very small month, right, it's spread into seven years and beyond. So, we feel pretty good about that.\n\nOn your second question about supply chain input cost. It's still very tight supply chain environment. We continue to believe in the next year we are going to continue to face challenges in complex substrate and some of the component and even older generation wafer side. So for us, we definitely -- if there's input cost increase because of supply/demand imbalance, our strategy and our approach has been really working with our suppliers and the customers to make sure we share the cost to increase overall.\n\nSo that's our current expectation.\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nThanks, Jean.\n\nOperator\n\nThe next question comes from Harlan Sur with J.P. Morgan. Please go ahead.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nGood afternoon. Thanks for taking my question. On the cloud optical connectivity business, this is both inside and between data centers, the upgrade cycles have been this really great multiyear tailwind for the team. And if I look into next year, I believe that there's still at least one of the top four U.S.\n\nhyperscale titans that's going to start the 400-gig PAM4 transition. You still have China CSPs that need to fire. You've got multiple customers on DR that's going to fire as well. Historically, like these transitions, I don't think have been impacted by a slowing macro demand environment.\n\nThey're viewed as, I think, very strategic. But is that how your cloud customers are thinking about these upgrades and your views on continued upgrade momentum in this segment for next year? And just relatedly, is the Innovium team on track to drive $150 million in revenues this year?\n\nMatt Murphy -- President and Chief Executive Officer\n\nHey, thanks, Harlan. Yeah, I think the first part of it, you got pretty well in terms of the transition on 200 and 400 gig PAM4 inside the data center. And then the new ramps we're seeing in 400 gig ZR for DCI between data centers. What I'd add on top of that is -- which has been extremely strong and also, in some ways, a little bit of a constraint we've seen in terms of being able to keep up is the demand on 800 gig, which is happening right now really around, obviously, very advanced AI workloads.\n\nThat is an area where if we could obviously produce more material, we would be shipping it in Q3. So that's also a positive trend. So you've got sort of the transition going on all the way up to 800 gig, and that continues to look pretty good. On the data center switching side, we are on track for the $150 million of data center switching this year.\n\nAnd we see very good traction in the market to -- in the solutions we're talking about now at 51 2 with our PAM4 DSPs as kind of a total solution. So that's also going well. The team has been integrated very well into the company. The road map looks very strong.\n\nIt's pretty exciting. So that was another growth vector that I did not mention upfront, but I guess you could lump -- it's not part of our 400, 800 cloud, the $1 million ramp. But that's also incremental opportunity for us in cloud switching.\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nPerfect. Thanks, Matt.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah.\n\nOperator\n\nThe next question comes from Tore Svanberg with Stifel. Please go ahead.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nYes. Congrats on another record quarter. Just kind of staying a little bit on what's to come, especially in the next few years. You talked quite a bit about CXL.\n\nI was just wondering when will that business start to ramp. I mean we're talking about more than $1 billion SAM here. And when could that business sort of become bigger than the Consumer HDD business? Just to kind of put into perspective, unique growth drivers versus market drivers? Thank you.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. Well, Tore, that would be a great day. We can crack the champagne if we can get CXL up to where the consumer -- or the HDD business used to be. But in all seriousness, this is new.\n\nThis is a new technology transition that's happening. It's actually very exciting for the team to look at now really enabling these solutions to -- in the memory ecosystem. The -- we have a full road map that's well underway in terms of product development but it's still early. So we're still a couple of years out.\n\nAnd by the way, just to be clear on the opportunity, that's the SAM we said was over time. The $1 billion-plus or multibillion. So it's still a ways out. We're not ready to sort of talk about when the timing exactly of that, but we're very encouraged.\n\nIt's an absolute real trend. We intend to be a leader here. We're investing ahead of the curve. Tremendous traction on our road map and the breadth of what we can do in CXL.\n\nSo it's an exciting one, and we just thought it was appropriate to flag that for investors is yet another opportunity to leverage a lot of the great technology we have into the same set of accounts. And in the case of CXL actually helped enable them, right, to architect these solutions for the future. So I think it's going to be a pretty exciting one, but it's a little ways out. And none of that is sort of in the -- like the $400 million next year, as an example.\n\nThat's not part of it. That would all be incremental a few years out.\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe next question is from Srini Pajjuri from SMBC Nikko. Please go ahead.\n\nSrini Pajjuri -- SMBC Nikko Securities -- Analyst\n\nThank you. Hi, Matt. My question is on 5G, in particular. Now that India 5G auctions are behind us, I'm just curious as to how we should think about that opportunity, Matt.\n\nI think you have a pretty strong position there, but could you put that into perspective versus a U.S. opportunity or Europe opportunity? And then the second half strength, is that what's driving it? I think you're guiding 5G to be up even in the third quarter. So I'm just curious if you're seeing any action from India as yet. Thank you.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. And Jean, you can chime in, but I think India for us is still -- I think that's still a next year type of event, although the -- as you mentioned, the tenders have gone through. We're well positioned for that. I think we've historically through our partners, had a strong position there.\n\nBut I would say it's -- the way to think about our 5G business now is more broader, diversified, and kind of a consistent performer. So I don't think you're going to see it take some enormous leap in a given quarter as an example. I mean it's been performing extremely well. If you go all the way back to kind of the initial ramps two-plus years ago, we basically had sequential growth, I think about every quarter, except one, maybe, I don't know, seven quarters ago where we were flat or something, right? So it's -- I think, again, it's a good example maybe at a smaller scale of the diversification strategy we've tried to drive whereas we go into these markets, we do try to find a number of key partners to line up with such that we're -- we try to reduce volatility and perform well in any environment.\n\nSo I think India is just another example. But I think there's also other geographies that are going to be laying in as well. And I think maybe even the bigger tailwind is just sort of increased content as new systems roll out with more and more Marvell silicon per base station. I think that's really where we'll be a bigger impact than a particular geography ramping up in a given quarter.\n\nBut Jean, any thoughts on that to add?\n\nJean Hu -- Chief Financial Officer\n\nYeah. Matt, to just add to what you just said is this year, we have seen significant growth, and the run rate is already over $600 million now. And that's actually largely benefited by North America, right? And the North American adoption of 5G has been really strong this year. Going forward, India definitely maybe next year or beyond.\n\nBut Matt is right, is our 5G business will continue to be a very significant growth driver next year for us. It has a really long product cycle and the visibility actually is pretty good in this market.\n\nSrini Pajjuri -- SMBC Nikko Securities -- Analyst\n\nGot it. Thanks, Jean. Thanks, Matt.\n\nOperator\n\nThe next question comes from Harsh Kumar with Piper Sandler. Please go ahead.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nYeah. Hey, Matt, I had a question for you. So if I layer in your thoughts on the $400 million odd of custom cloud silicon, that's about 15% growth by itself to your cloud business. And then I assume your business will grow at least that much, if not more, organically.\n\nSo is it fair for us to think for January 2024 for that data center business to be somewhere in the 30-something odd percent range or even better than that? Yeah.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah, I think I'd have to probably get out a spreadsheet to go figure that one out, Harsh. But I think directionally, I think you're right in that. You have an estimate of what our cloud revenues are and certainly layering in the $400 million would get you to a certain number. And then you're absolutely right, what I didn't bring up is that the base business, right, which doesn't include the new wins is also ramping up.\n\nSo we haven't sized that piece of it exactly, but clearly, that's going to grow as well next year, the kind of existing run rate portfolio because some of those programs whether it's in cloud switching, whether it's in electro-optics, some of the things we've already talked about today that are already in the run rate are certainly going to grow. So yeah, I think that's -- I think from there, you'll have to kind of -- I think when you say 2024, I got a -- I don't know that exact number off the top of my head, so.\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nNo, very helpful. Thank you, Matt. Appreciate it.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah.\n\nOperator\n\nThe next question comes from Quinn Bolton with Needham. Please go ahead.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nHey, Matt. I wanted to follow up on Matt Ramsay's question on enterprise networking. If I look at the business in the October quarter, it looks like you'll be over $400 million, and that's up probably two and a half times over two years. So phenomenal growth, but clearly well ahead of the market.\n\nI know some of that is content gains, some of its market share. But if you look at inventory in the networking space, OEM inventory levels are probably up 2x over that two-year period. And so, do you guys have any way of knowing whether there's any inventory that's accumulated in that channel? Do you think you can sort of sustain this $400 million quarterly run rate into next year? Or do you think you may see some ebb and flows especially after a very strong October levels looking beyond October?\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. OK, Quinn, it's a great question. And certainly, we're very aware of kind of the broader inventory growth that's gone on in a number of the end markets that we serve. And this one, in particular, I think a couple of things give us a lot of comfort.\n\nThe first is we've still been ramping into some of these new designs. So they're not -- it's not business we had two years ago and it was at x run rate, and now it's at x times two run rate. I mean almost all of this is effectively new programs that have ramped up. I guess the silver lining is on the supply constraint so far is that we haven't been able to get over our skis on over shipping.\n\nAnd so -- and we continue to have escalations by the way, even within enterprise networking today, in terms of trying to meet the demand. And again, as I said, because we're in the new systems and the new programs, those are the ones typically our OEMs are the most short on, and they're trying to sell. So I think it's a very fair question. And certainly, for somebody that's got a lot of market share in a given end market that had a run rate business, that had been going on for a while and it got inflated because of inventory growth over the last few years, one would get concerned.\n\nBut that's not as much of a concern for us overall in enterprise networking today. And so, I think we feel pretty good about the run rate we're on and the fact that we're running a lot farther ahead than we thought, and we still have some growth ahead of us, but we're watching it closely for sure, Quinn. No question.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nGreat. And just as a quick follow-up, can you comment about how much of your cloud business or hyperscale business may be driven by the Chinese hyperscalers? I know some of the -- your peers in the industry have commented that they've seen a recent weakening demand out of the China hyperscalers. Thanks.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. We're -- go ahead, Jean.\n\nJean Hu -- Chief Financial Officer\n\nHi, Quinn. This is Jean. I'll answer. Matt can add.\n\nOur cloud business are primarily U.S. hyperscale data centers. So, we actually have a very limited revenue exposure with the Chinese hyperscale data centers today.\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe next question comes from Joe Moore from Morgan Stanley. Please go ahead.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nThank you. I wonder if you could talk about the supply constraints. I think a quarter or so ago, probably your biggest problem was analog parts. I know substrates have also been an issue, trailing-edge wafers.\n\nAre those priorities shifting? You talked about a little bit at the sort of more complicated parts that are giving you trouble. Can you just talk a little bit about where is supply getting better? What supply chain is getting better and what's getting worse? Thank you.\n\nMatt Murphy -- President and Chief Executive Officer\n\nYeah. Great. Thanks, Joe. No, I think you're right.\n\nI think certainly, I mean, there's -- independent of us, right, there's been broader constraints within the analog peer group that have caused sort of golden screw issues and things like that with -- and remains to be seen when all those sort themselves out. For our purposes -- and again, some of those constraints overlap because we do -- in some of our mixed signal technology, we do have a pretty broad usage of some of the older nodes relative to CMOS or by CMOS technology, which would be 28-nanometer, 40-nanometer, 55/65. Those have been historically over the last two years, very constrained. They continue to be constrained.\n\nWe've -- but it's gotten better for sure. It's gotten better. And some of that -- some of those older nodes have been where the lumpiness of our supply has come in. You can see actually even when you look at our guide for the automotive business, those -- the five portions of that business uses some of this older technology.\n\nAnd you can see we're very strong sequential guide there. So that is starting to work itself out. There's still constraints. Where we're having a little bit more trouble, and I think some of the peers are, too, is just when you get into these larger, more complex packages, Joe, that use flip-chip BGAs and large complex substrates, that's still in very rough shape.\n\nAnd you have to plan way in advance even now for the capacity that's going to be required there. That trend on ABF especially is only going to go up. And so, I think the more complex products is where it continues to be a pain point. And I do think over time, as the cycle plays itself out, probably some of the legacy nodes and the analog stuff probably lighten up.\n\nBut I think for high complexity, there's just such a move in the industry, companies like Marvell and a lot of our large peers who more and more are just producing tremendous amounts of compute power and high-performance computing broadly, whether it's in networking or custom-silicon or CPUs or GPUs, you name it, it's all going to this complex technology, and that's where we have to just continue to be tactical and keep our heads down and match supply and demand and get what we need.\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nVery helpful. Thank you.\n\nOperator\n\nThis concludes our question-and-answer session [Operator signoff]\n\nDuration: 0 minutes\n\nAshish Saran -- Vice President, Investor Relations\n\nMatt Murphy -- President and Chief Executive Officer\n\nJean Hu -- Chief Financial Officer\n\nToshiya Hari -- Goldman Sachs -- Analyst\n\nC.J. Muse -- Evercore ISI -- Analyst\n\nRoss Seymore -- Deutsche Bank -- Analyst\n\nTimothy Arcuri -- UBS -- Analyst\n\nBlayne Curtis -- Barclays -- Analyst\n\nMatt Ramsay -- Cowen and Company -- Analyst\n\nGary Mobley -- Wells Fargo Securities -- Analyst\n\nHarlan Sur -- JPMorgan Chase and Company -- Analyst\n\nTore Svanberg -- Stifel Financial Corp. -- Analyst\n\nSrini Pajjuri -- SMBC Nikko Securities -- Analyst\n\nHarsh Kumar -- Piper Sandler -- Analyst\n\nQuinn Bolton -- Needham and Company -- Analyst\n\nJoe Moore -- Morgan Stanley -- Analyst\n\nMore MRVL analysis\n\nAll earnings call transcripts"
}