{
  "companyName": "Topgolf Callaway Brands Corp.",
  "companyTicker": "MODG",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/topgolf-callaway-brands-corp-modg-q3-2022-earnings/",
  "content": "Topgolf Callaway Brands Corp. (MODG 1.23%)\nQ3 2022 Earnings Call\nNov 03, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day and welcome to the Topgolf Callaway Brands Corp. 2022 third quarter earnings conference call. All participants will be in a listen-only mode. [Operator instructions] After today's presentation, there will be an opportunity to ask questions.\n\n[Operator instructions] Please note this event is being recorded. I would now like to turn the conference over to Ms. Lauren Scott, director of investor relations. Please go ahead.\n\nLauren Scott -- Director of Investor Relations\n\nThank you, Ian, and good afternoon, everyone. Welcome to Topgolf Callaway Brands' third quarter 2022 earnings conference call. I'm Lauren Scott, the company's director of investor relations. Joining me as speakers on today's call are Chip Brewer, our president and chief executive officer; and Brian Lynch, our chief financial officer.\n\nJennifer Thomas, our chief accounting officer; and Patrick Burke, our senior vice president of global finance, are also in the room today for Q&A. Earlier today, the company issued a press release announcing its third quarter 2022 financial results. In addition, there is a presentation that accompanies today's prepared remarks and may make it easier for you to follow the call. This earnings presentation, as well as the earnings release, are both available under the company's investor relations website under the financial results tab.\n\nMost of the financial numbers reported and discussed on today's call are based on U.S. generally accepted accounting principles. In the instances where we report non-GAAP measures, we have reconciled the non-GAAP measures to the corresponding GAAP measures at the back of the presentation in accordance with Regulation G. Please note that this call will include forward-looking statements that involve risks and uncertainties that could cause actual results to differ materially from management's current expectations.\n\nWe encourage you to review the safe harbor statements contained in the presentation and release for a more complete description. And with that, I would now like to turn the call over to Chip.\n\nChip Brewer -- President and Chief Executive Officer\n\nThank you, Lauren. Good afternoon to everyone on our call, and thank you for joining us today. I'm pleased to report another quarter of record results for Topgolf Callaway Brands driven by strength across all of our segments. Total net revenue in the third quarter was $989 million, up 15% year over year or up 21% on a currency-neutral basis, while adjusted EBITDA was $144 million, up 4% year over year or 23% on a currency-neutral basis.\n\nThe strength of our results underscores our leadership position in the Modern Golf ecosystem and the positive trends we're seeing across our business highlighted by increased traffic at our Topgolf venues, market share gains in our golf equipment business, and strong brand momentum in our active lifestyle segment. As we look to the balance of this year and into 2023, we are optimistic about our competitive positioning across each segment, the resiliency of our core consumers, and the embedded growth within our business. Over the long term, we believe we can deliver profitable growth across all of our segments, as well as a competitive advantage via the scale, synergies of our combined enterprise. We remain confident that off-course golf will continue to be a key driver of growth in the Modern Golf ecosystem and as our recent rebrand suggests, Topgolf is expected to be an even larger contributor to both top-line and bottom-line growth.\n\nAs you'll see in the outlook section, given Topgolf's strong embedded growth, we see that business contributing more than half of our EBITDA in the very near future, an impressive transformation that also demonstrates the long-term advantage of our diversified Modern Golf portfolio. Shifting to our segment overview. I'll first start with Topgolf's third quarter results. Topgolf venues delivered an impressive 11% same-venue sales growth in Q3, driven by a roughly even mix of traffic growth and price.\n\nSocial events were a particularly strong contributor this quarter as the venues are increasingly gaining recognition as a preferred place to gather for group events and celebrations. Looking forward, we believe we can deliver 10% or higher same-venue sales for Q4 as well, thus delivering high single-digit same-venue sales for the full year. Our strong results and expectations for the business demonstrate Topgolf's distinct position within the [Audio gap] the market and underscore its ability to thrive in today's environment. They have created a unique guest experience that makes it easier for players to engage with the sport of golf while being entertained and socializing with friends.\n\nWe remain confident in the sustainable growth outlook for this business, and we believe we have multiple levers still available to positively impact future performance. For instance, we are continuing to roll out an enhanced digital platform and been increasing our reservation capabilities and bay utilization. In addition to digital enhancements, Topgolf is also launching an exciting marketing campaign in Q4 of this year. The campaign is intended to further increase both consumer awareness and demand.\n\nYou'll begin to see increased advertisements in select markets as early as this month with a nationwide rollout early next year. New venue development remains on schedule with two new locations opened in Q3 and six new venues scheduled to open in Q4, the most ever in a single quarter. By the end of the year, we'll have 81 total owned venues worldwide, and we're happy to report that our track record for new venues meeting or beating our financial targets remains outstanding. From an enterprise perspective, investing in the Topgolf venues continues to be our [Audio gap] use of capital and one we remain enthusiastic about.\n\nThe business model is proven, with venues delivering an impressive 40% to 50% year 3 cash-on-cash return. And we have a clear road map for the growth ahead of us as we plan to successfully open 11 new venues a year and at the same time, deliver positive same-venue sales growth across existing venues. Toptracer had a good quarter as well, with approximately 1,600 bays installed. For the full year, we now estimate that we will install between 7,000 and 8,000 new bays.\n\nCustomer reaction to the product remains strong, and we continue to view this as a great long-term opportunity and a key source of synergy between Callaway and Topgolf. Lastly, we launched a new mobile game just last week called Shankstars. While we have modest financial expectations for this new offering, we believe there will be attractive synergies across the Topgolf business as we leverage the content and characters from the game to enhance the experience at our venues and Toptracer ranges. Moving to the golf equipment segment.\n\nAccording to Golf Datatech, the U.S. golf equipment market is down only 2.3% through Q3 on a sell-through dollar basis and remains up an impressive 41% compared to [Technical difficulty] This despite relatively poor weather and playable hours in the early part of this year. The market has clearly not declined meaningfully as many expected it to with COVID restrictions abating earlier this year, and we've been pleased with the fact that we gained market share as the year progressed. After a slow start to the year, our U.S.\n\nhard goods market share year to date through Q3 was 23.8%, up 97 basis points year over year. It's clear that interest in golf remains high and that Callaway is outperforming the market, something I believe we have a track record of doing. With all this, the profitability of our golf equipment business remains high as well. To both protect and build on this position, we've made some key investments in this business over the last several years.\n\nFor example, we made key additions to our tour teams such as John Rahm and new women's world No. 1 19-year-old Jeeno Thitikul, as well as investing in our Callaway next pipeline of up-and-coming young players. In R&D, we continue to invest in new capabilities that are establishing a leadership position in artificial intelligence capabilities, an area we believe will be differentiating for the future. In our supply chain, we made significant investments for both clubs and ball, including major upgrades in our Chicopee ball plant.\n\nThese investments, along with our scale advantage, proven business model and iconic brand position put us in a strong position going forward. We continue to see this segment as a consistent performer over the long term, generating good growth and even better cash flows. The timing of this couldn't be better as it supports the Topgolf development and the attractive capital deployment opportunities we see there. Turning to our active lifestyle segment.\n\nThe Callaway Apparel business in Asia turned in another strong quarter as did both TravisMathew and Jack Wolfskin. For Jack Wolfskin in local currency, both China and Europe grew nicely during Q3. We are proud of this result as investors will note that many of our competitors are struggling in those markets. We're also seeing excellent signs of brand health as a recent third-party research study of consumer preferences showed Jack Wolfskin to be the No.\n\n1 brand associated with outdoor activities in Germany. And the brand just earned a prestigious ISPO product award, the gold standard in the outdoor industry for technical and sustainably conscious product design. Shifting to TravisMathew, we continue to see outstanding brand momentum across all channels. The brand is delivering strong double-digit revenue and profit, and they are experiencing another promising pre-book season for spring/summer 2023.\n\nOur active lifestyle segment remains a highly profitable segment with excellent growth prospects. Turning now to our outlook. I'd like to give you some color on the balance of this year and due to the level of uncertainties out there and the difficulty that investors may have in quantifying them, and initial outlook for 2023. For 2022, we're raising our full year profitability guidance for Topgolf and the total company despite further FX pressures relative to our last guide.\n\n2022 is clearly going to be another very strong year for us with positive brand momentum and growth across all segments. Looking further forward, we, like most companies are contemplating the impacts of a potential economic slowdown, further inflationary pressure, and foreign exchange movements. Looking at these in turn, while we're not immune from inflationary pressures or macroeconomic conditions, our consumers are passionate about traditional golf, the Topgolf experience, and our apparel brands. They also generally have the means and desire to continue to enjoy these activities even amid inflationary pressure or mild economic downturns.\n\nWe feel this is a key point of strength for our businesses. Looking at only the FX, if current rates hold, it would be a meaningful headwind for us in 2023. However, we view this as a short- to midterm issue as over longer periods, rates will either moderate or businesses will adjust. Even with all of the above, for 2023, we currently expect approximately 10% revenue growth and approximately $600 million in adjusted EBITDA, with Topgolf contributing a little more than half of this EBITDA.\n\nThis keeps us on track with our long-term goals communicated at our Investor Day earlier this year. On an FX-neutral basis, this would be equivalent to 13% revenue growth and approximately $665 million in adjusted EBITDA. As FX rates and business conditions inevitably continue to change, we will provide an updated forecast, as well as our normal segment information and more specific business projections on our February earnings call. We're only providing this high-level snapshot at this time and only doing so to assist investors in what we believe are unique circumstances.\n\nThank you, and I'll now turn the call to Brian for a review of our financials.\n\nBrian Lynch -- Chief Financial Officer\n\nThank you, and good afternoon, everyone. As Chip mentioned, we are very pleased with our performance in the third quarter as we delivered another period of record results. These results include a 15% increase in revenue while absorbing a $50 million negative impact from changes in foreign currency rates versus 2021. Our adjusted EBITDA also increased 4% despite the currency impact or 23% on a constant-currency basis.\n\nOur liquidity and financial position remain strong. All of this gives us the confidence to increase our full year guidance for 2022 and supports our growth estimates for 2023. With that brief overview, I will now review the quarterly results in more detail. For the third quarter, consolidated net revenue was a record $989 million, an increase of 15%, compared to Q3 2021, or a 21% increase on a constant-currency basis.\n\nThis performance reflects increased revenue in each operating segment and in most major product categories and major regions. Total non-GAAP costs and expenses were $907 million in the third quarter of 2022, compared to $772 million in the third quarter of 2021. The increase was driven by increased variable expenses such as venue operating expenses, as well as increased freight and continued investments to support the business. Third quarter 2022 non-GAAP operating income was $81.1 million, down [Audio gap] year over year.\n\nThis decrease was due to changes in foreign currency rates. On a constant-currency basis, non-GAAP operating income would have increased 27% and operating margins would have increased 40 basis points. Non-GAAP earnings per share was $0.23 on approximately 202 million shares, compared to $0.14 per share on approximately 186 million shares in the third quarter of 2021. The increased share count is primarily related to an accounting rule change that took effect on January 1, which requires that we include 14.7 million shares related to the assumed conversion of the company's convertible notes.\n\nLastly, Q3 adjusted EBITDA was $144 million, up 4% over Q3 2021 or up 23% on a constant-currency basis. Now turning to the segment results. In evaluating the company's operating segment performance, please keep in mind that the operating segments were impacted by the negative changes in foreign currency rates compared to 2021. The offsetting benefits from the company's hedging program, however, are recorded in other income and are therefore not reflected in the operating segment results.\n\nFor example, for the three and nine months ended September 30, 2022, there were $6.8 million and $25.4 million respectively, of foreign currency hedge gains that were not included in the operating segments for those periods. On a constant-currency basis, total segment operating income for the third quarter increased 21.8%. At the segment level, Topgolf contributed $414 million in revenue in the quarter, a 24% increase over 2021, reflecting strong same-venue sales growth and additional new venues. While operating margins decreased slightly during the quarter due to planned increased staffing costs, increased preopening expenses, as well as increased marketing spend, we expect the full year to show improved operating margins over 2021.\n\nGolf equipment had another excellent quarter as well, generating $297 million in revenue, a 2.5% increase or a 9.3% increase on a constant-currency basis, both versus Q3 2021. This was driven by continued high demand, strong market shares, and good supply in golf equipment. As I mentioned in the Q2 earnings call, predicting the timing of shipments and supply between quarters can be challenging. During Q3, we received some supply earlier than expected.\n\nAnd if you have orders and have the product, you might as well ship it. As a result, some of the strength we experienced in the quarter was due to a shift in the timing of sales from Q4 to Q3. Golf equipment operating income decreased 8% despite -- I mean, increased 8% despite the foreign currency headwinds. Lastly, our active lifestyle segment had revenue of $278 million, up 19% and or 31% on a constant-currency basis compared to Q3 2021.\n\nThis increase was led by momentum in the TravisMathew, Jack Wolfskin, and Callaway brands. Active lifestyle operating income decreased $6.5 million in Q3 compared to Q3 2021, but on a constant-currency basis, would have increased. Turning now to certain balance sheet items. We remain in a strong financial position with ample liquidity.\n\nAs of September 30, 2022, available liquidity, which is comprised of cash on hand and availability under our credit facilities, was $659 million, compared to $918 million at September 30, 2021. The decrease from last year was due to continued investment in Topgolf and planned working capital increases in the golf equipment and active lifestyle businesses to support growth. On a year-over-year comparison, we note that last year's working capital was abnormally low due to the disruption in supply chain related to the pandemic. We expect Topgolf will be cash flow positive and self-funding in 2023.\n\nAt quarter end, we had total net debt of $1.75 billion, including convertible debt of approximately $259 million. Our pro forma net debt leverage, which excludes the convertible note, was approximately 2.8 times at September 30, 2022, compared to 1.8 times at September 30, 2021. The increase is due to the new venue development. Consolidated net accounts receivable was $275 million as of September 30, 2022, compared to $255 million at the end of the third quarter of 2021.\n\nThe increase was due to the $132 million increase in revenue compared to the prior period and strong cash collections. Days sales outstanding improved by a day to 52 days in the non-Topgolf business. The quality of the accounts receivable remains strong. Our inventory balance increased to $722 million at the end of the third quarter of 2022, compared to $385 million at the end of September 30, 2021.\n\nWe feel good about the levels of our inventory. Inventory turns and days on hand are roughly consistent with pre-pandemic levels. We also feel good about the quality of our inventory and do not foresee promotional activity based on our current inventory position. Capital expenditures for the third quarter were $66 million net of REIT reimbursements.\n\nThis includes $48 million related to Topgolf. For the full year, we expect total capex of approximately $325 million, again, net of REIT reimbursements, including approximately $250 million for Topgolf and $75 million for the non-Topgolf business. $325 million includes $165 million of growth capex. Now turning to our balance of the year outlook.\n\nWe are raising our full year 2022 revenue expectations to $3.965 billion to $3.985 billion, including approximately $150 million of negative foreign currency impact, which is approximately $21 million more than our last estimate of $129 million. The segment assumptions underlying this guidance are the same as our prior earnings report, with Topgolf segment revenue of approximately $1.56 billion, golf segment revenue growth of 12% or more, and active lifestyle segment revenue reaching approximately $1 billion. The operating segments are covering the increased negative foreign currency impacts. Our full year adjusted EBITDA guidance of $560 million to $570 million is a $5 million increase compared to the midpoint of our previous guidance.\n\nThe golf equipment business is largely expected to cover the incremental foreign exchange risk. Topgolf is now expected to deliver between $240 million to $250 million of adjusted EBITDA. To reiterate Chip's comments for 2023, we expect the business to grow approximately 10% in revenue and to achieve approximately $600 million in adjusted EBITDA using currency spot rates from late October. From a constant-currency perspective, that would represent approximately 13% or more revenue growth and approximately $65 million in adjusted EBITDA.\n\nThese projections include no hedge gains as our hedging program resets at the beginning of the year and also takes into account the lapping of the channel filling in the golf equipment business that we had this year as retail inventory has returned to normal levels. Given it is early to provide these metrics, we are not providing segment-level detail at this time. In closing, we have managed to achieve substantial growth year to date despite the macroeconomic headwinds, thereby demonstrating the resiliency of our core consumers, as well as the benefits of scale and our diversification strategy. We continue to be excited about the growth prospects of our business and are confident that our competitive positioning across each segment and the embedded growth within our business, will keep us on track to deliver on our long-term outlook and to create shareholder value.\n\nThat concludes our prepared remarks today, and we will now open the call for questions. Operator, over to you. \n\nOperator\n\n[Operator instructions] At this time, we will pass momentarily to assemble our roster. Our first question comes from Randy Konik with Jefferies. Please go ahead.\n\nRandy Konik -- Jefferies -- Analyst\n\nYeah. Thanks, guys. Thanks for taking my questions. I guess first question I want to ask you, is on the Topgolf business, the venue revenues keep coming in above kind of our forecast.\n\nWhen you factor in some of the changes that have gone on in the world around work-from-home stickiness, people are leaving cities going to suburbia, mom-and-pop restaurant bars are closing. Do you think that the maturity curve and the maturity volume of the Topgolf venues changes at all going forward for the positive versus what your prior forecast may have been in terms of underwriting these locations? Can you kind of talk to that a little bit? \n\nChip Brewer -- President and Chief Executive Officer\n\nSure, Randy. It's clear that Topgolf is building momentum, and it's driving both price and volume increases. So, it's not just price. We're getting traffic, and you've seen a steady build in momentum of that brand and business.\n\nAnd there's probably a lot of different trends converging that are all somewhat favorable for that business, right? Increased interest around golf in general, the hybrid and remote work environments, the experience-oriented economy, etc., and then just the scale of the business as it builds scale and awareness and momentum across the country, all of these things are positive for us. Starting to see those very clearly in the data. The other thing that is very clear is that the upside of that business is well above what we underwrote when we did the merger. The upside in venue growth, the upside in the profitability of the venues, etc., we're very pleased with the trends and excited about the outlook.\n\nRandy Konik -- Jefferies -- Analyst\n\nGreat. That's helpful. And then moving to the golf equipment side of the business. One thing I asked of your competitor this morning was I asked about his view of the cyclicality or the changes of cyclicality in the golf equipment industry now that we've seen more competitor consolidation.\n\nThere's price for companies that matter now on the golf equipment side, but also the rise of customization. So, I just want to get your thoughts on your view of how the cyclicality or lack thereof of the industry of golf equipment changes going forward with these different changes that are happening or have happened within the industry.\n\nChip Brewer -- President and Chief Executive Officer\n\nYeah, that's an interesting question, Randy. So, I don't really view the golf equipment business as cyclical. If you look at historical results, it has not been particularly sensitive to mild recessions or economic climate. And the last several years, a very consistent business, but like Topgolf, a lot of favorability recently in the interest around the game, the sport, the growth.\n\nClearly, there was concern coming into the year, whether there would be some reversion or pullback in interest and purchases and participation. And the data is very clear on that. There has not been. So, I wouldn't view that business as cyclical or -- and it's certainly structurally changed over the many years prior to the pandemic.\n\nBut since then, there's been some excellent tailwinds that we've been enjoying. And the last thing, and you already know this, Randy, but the growth of off-course, which we are the dominant player of is a significant factor of what's going to be going on in and around golf. I mean, the definition of golf needs to change. It's not just people on a golf course now.\n\nIt's people at venues and other off-course mediums, and that is a bigger market growing exceptionally fast, and we happen to be in a pretty strong position there.\n\nRandy Konik -- Jefferies -- Analyst\n\nLike one more I want to sneak in because you just brought up something that I think is really important it's these other areas that are growing within the ecosystem. When you look at -- or can you maybe extrapolate or expand upon your vision or view of what the ultimate end gain can be for Toptracer and something like TravisMathew because when you look at those businesses, it seems to me that the growth trajectory they have creates an equity kind of value for them that could be above the current market cap of your company today. So, I just want -- I just would like it if you could expand upon those younger businesses that the market probably been focused on at this point how they can -- how big you think they can be for those that may not be familiar, just kind of expand upon that a little bit more because, again, they feel like they have value long term that could be above the current market cap of the entire company, which is perplexing, but I just want to get your view there.\n\nChip Brewer -- President and Chief Executive Officer\n\nOK. I'm not going to pine on the potential valuation of any individual segment of our business, but you are correct in identifying there's some amazing businesses embedded within our overall ecosystem, and two of those are TravisMathew and the Toptracer business. TravisMathew is -- when we bought it, it was $60 million-ish of revenue. We've already stated it's expected to hit $300 million in revenue, growing significant double-digit growth across all channels, just being able to open new stores that pay back very quickly and then drive the overall growth in the various markets where we open those stores.\n\nAnd we're starting just baby steps in international and getting into the women's market. But it's a very exciting business. It fits really well within our business and ecosystem. We will have an advantage in the reach to total golfers.\n\nAnd so, therefore, being able to leverage that. Toptracer's similarly a very small business right now, much smaller in scale than the TravisMathew business, under $100 million in revenue, but really great transformational business when we put it into ranges, their revenues up significantly, and the consumers love it. We capture a ton of data. It integrates with the venue business.\n\nIt's a golf-specific market. We help them open those, etc. So, an exciting business that has got the potential to transform how people hit golf balls at driving ranges going forward. I would dare to guess in five years' time if a range doesn't have digital technology like Toptracer, and Toptracer is the dominant player in that space.\n\nIt's not going to be competitive and it's not going to be a very well-viewed consumer experience.\n\nRandy Konik -- Jefferies -- Analyst\n\nSuper helpful. Thanks, guys.\n\nChip Brewer -- President and Chief Executive Officer\n\nThank you, Randy.\n\nOperator\n\nOur next question comes from Alex Perry of Bank of America. Please go ahead.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking my questions and congrats on a strong quarter. Just first, could you just maybe give us a little more color on the 10% revenue growth for next year? Sort of is golf equipment expected to grow within that, given some of the headwinds you mentioned such as living the channel fill this year? And does the guidance sort of contemplating current trends continuing for the consumer or some slowdown in the end consumer? Thanks.\n\nChip Brewer -- President and Chief Executive Officer\n\nSure, Alex. Good question. Unfortunately, at this point, we're not going to provide segment-specific commentary on 2023. But I will give you some commentary on general expectations that are embedded in that preview.\n\nAnd basically, we are expecting continued macroeconomic pressures and inflation. Some potential consumer pressure, perhaps even a modest recession. So, we're not being pollyannish within that overall. But at this point, we're going to not break out individual segment expectations [Audio gap]\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. That's really helpful. And then just my second question, Topgolf inventory sales accelerated nicely. Is it fair to assume you see no significant drop-off in the customer there? And can you maybe give us some more color on sort of walk-in traffic versus your corporate events business and the key drivers to the sort of 10% same menu sales growth for the fourth quarter that implies a little bit of a deceleration versus 3Q, but maybe there's an ultimate of conservatism in there?\n\nChip Brewer -- President and Chief Executive Officer\n\nWell, we said 10% or higher, and we did 11%. So, Alex, to call that a deceleration, I think you're getting a little fine-tuned there. But the same-venue sales growth in Q4 is really expected to be across all groups as it was in Q3. We saw good walk-in traffic, great social events, and good corporate sales in Q3, and we see a continuation of those trends in Q4.\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nPerfect. That's really helpful. Best luck going forward.\n\nChip Brewer -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nAnd our next question comes from Joe Altobello with Raymond James. Please go ahead.\n\nJoe Altobello -- Raymond James -- Analyst\n\nThanks. Hey, guys. Good afternoon. I guess a couple of questions.\n\nI guess first question on Topgolf. I know we probably don't have a lot of data going back historically. But is there any evidence in terms of how that business performs in an economic downturn or recession? I mean, it's not the cheapest form of eating out.\n\nChip Brewer -- President and Chief Executive Officer\n\nNo, Joe. It's a great question, and we think about it a lot. There's no good data is the long or short answer to that of how it does in a recession. It did -- the last recessions -- well, obviously, the last one was a significant one.\n\nAnd candidly, it did find during that, but it was early concept stages and didn't -- I wouldn't take too much out of that one way or the other. I would tell you that the data that we're seeing is pretty encouraging, though, right? I mean perhaps it's not the rosiest of economic times out there right now. Some businesses that are particularly sensitive to that are already seeing declines or declines in -- at least, in visits. The Topgolf business delivered positive traffic growth, as well as price for pretty -- and is building momentum on the same-venue sales side.\n\nSo not seeing anything right now, but not -- no historical data like we have in the golf equipment business to share with you.\n\nJoe Altobello -- Raymond James -- Analyst\n\nUnderstood. And maybe a second question. I think as Brian said earlier, you guys don't expect any uptick in promotional activity despite the fact that channel inventories have sort of normalized here. So maybe help us understand why we wouldn't see at least some increase in promo.\n\nChip Brewer -- President and Chief Executive Officer\n\nYeah. I think Brian's comment was specific to our inventory levels and whether our inventory levels are causing -- would cause us to be promotional. And the answer to that is no. We have a little comfort there.\n\nThe market probably has more normalized inventory levels right now. And so, the -- there'll probably be more promotional activity than there was in the last couple of years, which is zero, by the way. So more than zero. But probably less than historical.\n\nSo, promotional activity is not one of the areas that we are, per se, concerned about. But to be clear, there may be some level of promotional activity, whereas in many of our businesses, there was such low inventories in the field and at the wholesale side of it that the 2021, and they didn't have any. So, a little more.\n\nJoe Altobello -- Raymond James -- Analyst\n\nGot it. OK. Thanks for clarifying.\n\nChip Brewer -- President and Chief Executive Officer\n\nYep. Thank you.\n\nOperator\n\nOur next question comes from Daniel Imbro of Stephens Inc. Please go ahead.\n\nDaniel Imbro -- Stephens Inc. -- Analyst\n\nYep. Hey, good afternoon, everybody. Thanks for taking our questions. Chip, I wanted to follow up on Topgolf in a little bit different angle.\n\nI mean a common question just around financing costs. I know we haven't operated this business through a downturn. But how your discussion with your REIT partners going? Are you seeing cost of capital increase? Is that changing kind of the return profile that you're getting or that you're looking for, for new locations? Just how are you thinking about capital allocation and growth with the rising cost of capital environment?\n\nChip Brewer -- President and Chief Executive Officer\n\nYeah. So good question, Daniel, but we have not seen any cost pressures on the REIT financing. What's happening is we're becoming a much more safe and secure person to lend money to as well. So -- and there's a good market out there.\n\nSo, we have not had any REIT increases as of yet. And we feel good about that market.\n\nDaniel Imbro -- Stephens Inc. -- Analyst\n\nGood. That's helpful. And then one on the apparel side. You mentioned Jack Wolfskin grew internationally, and you kind of mentioned some TravisMathew preorders.\n\nI guess, on Jack Wolfskin, can you talk about what you think drove that outperformance? Was it better supply chain management? Was it the brand refresh? You talked about at the Analyst Day kind of what drove that growth. And then any color on the preorders for that brand as we look forward to kind of fourth quarter, first quarter since it's more winter focused? Thanks.\n\nChip Brewer -- President and Chief Executive Officer\n\nSure. Yes, it's more -- Jack Wolfskin is really brand strength. So, it's in a good category in the outdoor lifestyle category where there's positive momentum in the category at large, and they have done a great job in their core markets of China and Germany of strengthening the brand and product line. And so that has led to the performance that we've seen.\n\nAnd what was the last question on that?\n\nDaniel Imbro -- Stephens Inc. -- Analyst\n\nJust any color on preorders. You mentioned preorders for TravisMathew so.\n\nChip Brewer -- President and Chief Executive Officer\n\nYeah, preorders, no real color on that. The big season on that will be the fall/winter season, and they're in the early days of getting their prebooks for that now. So -- but we feel good about the momentum of the business.\n\nDaniel Imbro -- Stephens Inc. -- Analyst\n\nAll right. Thanks for the color and best of luck.\n\nChip Brewer -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\n[Operator instructions]. Our next question comes from Kevin Heenan of J.P. Morgan. Please go ahead.\n\nKevin Heenan -- J.P. Morgan -- Analyst\n\nHey, guys. Thanks for taking my question. Another one on Topgolf. I was just hoping, can you elaborate on the productivity opportunity there, the increased bay utilization at peak? Where are you on labor? Is that still a constraint for you? Just any way you can quantify kind of the opportunity there, maybe near term and long term would be great.\n\nThanks.\n\nBrian Lynch -- Chief Financial Officer\n\nWithout going -- giving any specifics, the labor has stabilized at this point. During Q3, they made a lot of great progress with stabilizing the labor. And the venues continue to be profitable, and you'll see it increase during Q4.\n\nChip Brewer -- President and Chief Executive Officer\n\nYeah. The -- we're at or -- we have good momentum in terms of the profitability of those venues. And as I mentioned in my comments, we see more levers to pull that will continue to grow those -- the profitability of the venues. We're not I think at our Investor Day, we talked about 32% or something EBITDA margins, and we're very confident in those and probably believe there's more upside than that.\n\nKevin Heenan -- J.P. Morgan -- Analyst\n\nThanks. Can I just ask a quick follow-up on the golf ball business? The market share has been a pretty linear increase over the past decade. I guess, maybe, what's your view on the path for the next 5 or 10 points a share, where might that come from? Is that more challenging than the last five or 10? And then maybe more broadly, how best to think about what you guys embedded as far as maybe consumables versus bigger ticket purchases like clubs in a more challenging macro backdrop. Thanks.\n\nChip Brewer -- President and Chief Executive Officer\n\nSure. Yeah, and thanks for noticing on the golf ball. We're really proud of the steady progression we have had in that business and its growth of it over many years now. Really -- and we've made during that time, some significant investments in our manufacturing facilities will allow us to make a really unique product, both now and going forward.\n\nAnd we think that is what will help us unlock those next several points of market share gain, which we intend to deliver. But a lot of the playbook is what you've seen us pulling over the last several years, continuing to strengthen distribution, continuing to make big investments back, which we think we're largely through now to be able to build a better product and differentiating that factor. And then we're getting some of the best players in the world, this Jeeno Thitikul used the golf ball this year on her way to No. 1 in the world and John Rahm's performance, the validation of it is not -- is unreputable now.\n\nSo, continuing this playbook, I think, will hopefully deliver the similar results that we've been able to deliver over the last several years.\n\nKevin Heenan -- J.P. Morgan -- Analyst\n\nThanks very much.\n\nOperator\n\nAnd our next question comes from Casey Alexander of Compass Point Research and Trading. Please go ahead.\n\nCasey Alexander -- Compass Point Research-- Analyst\n\nHi. Good afternoon. Forgive me if this is already in there, but I came to the call late and we've had a bunch of companies report this afternoon. My only question was one area where Topgolf still seemed to have some same-store slack that they could pick up was in some of the event-driven business that a lot of it falls in the fourth quarter.\n\nSo, I'm just wondering how your bookings for the event business for Topgolf are looking coming into this holiday season as compared to last year.\n\nChip Brewer -- President and Chief Executive Officer\n\nYeah. Thanks, Casey. Good question. There are two types of events that we track, social events, which have been just killing it and continue to do so.\n\nAnd then corporate events, which were the slowest to come back post-pandemic. They were up last quarter. And we see very good trends going forward. We expect them to be up nicely over last year and also over -- a little bit over 2019 levels.\n\nWe have pretty good visibility on that now, Casey, as you would expect, it's already November, and they booked those out a little bit in advance. So, we feel good on corporate, as well as the rest of that business.\n\nCasey Alexander -- Compass Point Research-- Analyst\n\nAll right, great. Thank you for taking my question. I appreciate it.\n\nChip Brewer -- President and Chief Executive Officer\n\nYeah. Thank you.\n\nBrian Lynch -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from John Kernan of Cowen and Company. Please go ahead.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nExcellent. Thanks for taking my questions. Good afternoon.\n\nChip Brewer -- President and Chief Executive Officer\n\nHey, John.\n\nBrian Lynch -- Chief Financial Officer\n\nHey, John.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nBrian, I think you said ex FX, the business would be at a $660 million EBITDA run rate, which I think is above -- certainly above the plan you laid out when you underwrote the transaction with Topgolf and above the Investor Day targets from April. Just -- when you talk to what's driving the upside versus the plan, there's been pretty consistent upside in your guidance versus since you did the transaction.\n\nBrian Lynch -- Chief Financial Officer\n\nSure, John. Thanks for noticing our outperformance. But it's really across the board. All three segments are performing above what we expected.\n\nAs Chip mentioned earlier, Topgolf has been on a tear and wear, well ahead of where we expected it to be. But the golf equipment business is performing [Audio gap], the TravisMathew, Jack Wolfskin. It's all really doing very well. \n\nJohn Kernan -- Cowen and Company -- Analyst\n\nGot it. And then any thoughts on openings -- for Topgolf venue openings in 2023?\n\nChip Brewer -- President and Chief Executive Officer\n\nYeah. No, we're the same as we've been saying, John, 11 venues, and we feel good about the pipeline.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nAnd then just on international. Any thoughts on to Topgolf international and [Inaudible] performance there?\n\nChip Brewer -- President and Chief Executive Officer\n\nA slow ramp there. So, we are -- we opened several this year -- we have several more in the works. We have one late this quarter, which is an owned venue in Glasgow. But then on the franchise side, several in the works, and we expect that to ramp up, but it will really ramp more in '24, '25 than '23.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nGot it. Thank you.\n\nChip Brewer -- President and Chief Executive Officer\n\nThank you.\n\nBrian Lynch -- Chief Financial Officer\n\nThanks, John.\n\nOperator\n\nAt this time, it appears that there are no further questions. I'd now like to turn the call back to Mr. Chip Brewer for any closing remarks.\n\nChip Brewer -- President and Chief Executive Officer\n\nAll right. Well, I want to thank everybody for joining us. But I'd also like to, at the risk of being redundant, summarize what I hope are a few key takeaways from today's call. First is, I think that it's clear Topgolf Callaway Brands [Audio gap] a phenomenal 2022.\n\nWe're delivering growth in all segments. There's been continued strength in traditional golf markets, which have not gone backwards as some feared might happen, as well as our position in it, and we've gained share. The Topgolf venue business is building momentum as evidenced by same-venue sales trends, as well as new venue openings, and thus transforming our business even faster than we originally projected. We now expect it to be more than half of our EBITDA next year and the venue business is continuing to prove itself as a bigger and better business than all previous expectations.\n\nTo put some numbers behind that, in 2019, Topgolf did just under $60 million in adjusted EBITDA. We're forecasting $240 million to $250 million for 2022 and more than $300 million in 2023. If investors are still thinking of us similar to how they did historically, we believe they're missing the big picture. And we remain excited about the future prospects of this unique and exciting business.\n\nThanks for joining our call today. Best of wishes for the rest of this year and the holidays. We look forward to speaking to you again in February.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nLauren Scott -- Director of Investor Relations\n\nChip Brewer -- President and Chief Executive Officer\n\nBrian Lynch -- Chief Financial Officer\n\nRandy Konik -- Jefferies -- Analyst\n\nAlex Perry -- Bank of America Merrill Lynch -- Analyst\n\nJoe Altobello -- Raymond James -- Analyst\n\nDaniel Imbro -- Stephens Inc. -- Analyst\n\nKevin Heenan -- J.P. Morgan -- Analyst\n\nCasey Alexander -- Compass Point Research-- Analyst\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nMore MODG analysis\n\nAll earnings call transcripts"
}