{
  "companyName": "International Game Technology",
  "companyTicker": "IGT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/international-game-technology-igt-q3-2022-earnings/",
  "content": "International Game Technology (IGT 0.22%)\nQ3 2022 Earnings Call\nNov 08, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Devin, and I will be your conference operator today. At this time, I would like to welcome everyone to the International Game Technology Q3 2022 earnings call. [Operator instructions] Thank you. James Hurley, senior vice president of investor relations, you may begin the conference.\n\nJim Hurley\n\nThank you. And thank you all for joining us on IGT's third-quarter 2022 conference call hosted by Vince Sadusky, chief executive officer, and Max Chiara, our chief financial officer. After some prepared remarks, Vince and Max will be available for your questions. During today's call, we will be making some forward-looking statements within the meaning of the federal securities laws.\n\nForward-looking statements are not guarantees, and our actual results may differ materially from those expressed or implied in the forward-looking statements based on a number of factors and uncertainties, including those related to the effects of the COVID-19 pandemic. The principal risks and uncertainties that could cause our results to differ materially from our current expectations are detailed in our latest earnings release and in our SEC filings. During this call, we will discuss certain non-GAAP financial measures. In our press release, slides accompanying this webcast, and our filings with the SEC, each of which is posted on our investor relations website, you'll find additional disclosures regarding these non-GAAP measures, including reconciliations of these measures with comparable GAAP measures.\n\nAnd now, I'll turn the call over to Vince Sadusky.\n\nVince Sadusky -- Chief Executive Officer\n\nThank you, Jim. And hello to everybody joining us here today. We delivered accelerated revenue and profit growth in the third quarter with nice momentum for each of our business segments. Revenue rose 14% at constant currency, led by over 30% growth for both global gaming and digital and betting.\n\nThe 20% operating income reached the high end of our expectations on strong lottery margins and a substantial increase in gaming profitability. Adjusted EBITDA increased 7% at constant currency even as we continue to invest in several key growth initiatives and contend with higher supply chain costs. Our strategic focus on driving growth through innovation and optimizing our processes and scale is paying off. When the company reorganized around three main business segments with global product responsibility, it enabled our teams to focus on delivering best-in-class products and services more efficiently and profitably.\n\nThis is evidenced in a year-to-date EBITDA margin that is over 350 basis points better than the full-year 2019 level, and there is still more opportunity as our 2025 targets include further profit improvement. Solid cash flows and proceeds from strategic asset sales were used to reduce debt, improving our leverage to 3.1 times, the lowest level in IGT's history. And we continue to return capital to shareholders. Through mid-October, we returned over 220 million via dividends and share repurchases, which marks a record level in a fiscal-year period.\n\nAt the current share price, our annualized dividend implies about a 4% yield, and we've repurchased approximately 6% of our float since last November. It's a compelling returns profile for a company with a clear growth trajectory and where most profits and cash flows come from recurring revenue streams backed by long-term contracts. That's a good segue into global lottery, where same-store sales were up 3% in the quarter, mostly on strong multijurisdictional jackpot activity. Our lottery sales nearly doubled from the prior year on strong eInstant performance in Georgia and Kentucky and new game launches in Belgium.\n\nCleopatra Clusters Jackpot, a new eInstant game based on our popular slot title, became our most successful launch to date. Italy's same-store sales improved greatly as we anniversary significant discrete benefits in the prior year. Instant ticket sales remain strong and draw games are progressively improving, now tracking only modestly below 2019 levels. Taking a longer-term view, the multiyear same-store sales growth accelerated in Q3 across all game types.\n\nThe increase in North America is especially noteworthy with Q3 same-store sales up more than 30% from Q3 of 19. That implies an average annual growth rate of about 10%, which is significantly greater than pre-COVID growth rates. Lottery's strong multiyear sales expansion has fueled about 500 basis points of operating margin improvement from 2019. This highlights the significant profit flow-through of an elevated sales base even as we've increased our investment in the business.\n\nThose investments were on full display at the recent World Lottery Summit. Our theme of future-forward results driven showcased our industry leadership with a compelling suite of land-based and digital solutions. The scope of IGT's capabilities is unique, and it is grounded in our expertise and player insights from operating some of the world's largest and most successful lotteries. There was a lot of excitement around our launch of OMNIA, the industry's first truly player-centric omnichannel lottery system.\n\nIt's a concept our customers are eager for as their portfolios expand into digital. OMNIA provides the capability to manage the whole enterprise from a single point. Lotteries can easily gain insights into their entire portfolio and player base as data is integrated from all sales points in ways that improve a lottery's ability to market, launch, and enhance games to meet player preferences. It also provides unprecedented opportunity to strengthen responsible gaming programs.\n\nWe think it's the future of the lottery industry. Speaking of the future, we've had some important strategic developments, including long-term contract extensions with the New York and Georgia lotteries, as well as a new 10-year instant ticket printing contract with the Texas Lottery. In addition, the sale of our Italian commercial services business not only helped us reduce debt, but it should have about a 200-basis-point beneficial impact on the lottery segment's margin structure. It also reduces our Italy and euro exposure.\n\nGlobal gaming had another terrific quarter with revenue up over 30% and operating profit more than doubling, thanks to broad-based momentum across all main KPIs. The increase in profit is noteworthy since global gaming has had to sustain higher supply chain costs than our other businesses. Our roster of core video and multilevel progressive games on award-winning new hardware drove record unit shipments in the U.S. and Canada for our Q3 and year-to-date period.\n\nThis resulted in the highest U.S. and Canada ASPs ever in the third quarter. We continue to maintain the leading North American ship share, a spot we've held for close to four years. We also marked an important milestone with sequential improvement in the installed base, expanding footprints for new WAP and MLP.\n\nTitles such as Prosperity Link, Money Mania, and Wheel of Fortune High Roller are fueling the installed base growth and also driving higher yields. And our success is being recognized. Prosperity Link won Best Slot Product at the 2022 GGB Gaming & Technology Awards. Most importantly, we believe the strength of current titles and what we have in the pipeline can drive continued improvement in the installed base.\n\nOur confidence is bolstered by excellent feedback from G2E, where our product strategy has resonated with customers. In the premium category, our focus is on three key areas: building on MLP strength, expanding our video WAP presence, and supporting the iconic Wheel of Fortune franchise. We intend to drive gaming machine unit sales with four main initiatives. First, we're expanding the Peak cabinet family with the launch of the PeakDual 27 and the PeakCurve.\n\nSecond, we will leverage player favorite brands, like Cats, to expand our MLP portfolio. Third, we will grow unit sales of the top-performing DiamondRS cabinet. And finally, we will support the DiamondRS with a robust roster of classic and new games. All in all, it is a compelling strategy that we are confident will continue to produce results.\n\nIn systems, cashless continues to attract a lot of attention, and IGT is -- is leading the cashless gaming transformation. Our Resort Wallet and IGTPay solutions are making it easier for players to activate cash -- cashless functionality and are integrating cash flows at more places throughout the casino. Operator adoption is progressing well with an enterprisewide rollout of IGT's cashless solution at Station Casinos and a recent deployment at Indigo Sky Casino. Global gaming's strong top-line and profit momentum is a product of being a leaner, more focused, and more nimble organization.\n\nWe have centralized global product responsibility that enables better decision-making and allows us to leverage our scale across game and hardware development and deployment. It is also helping us manage through supply chain challenges more effectively. Strong operating leverage is evidenced by a Q3 operating profit margin that is 370 basis points higher than 2019. There's still a lot of opportunity for further margin improvement as we work toward our 2025 goals.\n\nTurning to digital and betting. Increased investments are delivering accelerated top-line growth. The integration of iSoftBet during the quarter was an important driver of the more than 30% revenue expansion at constant currency in the period. GGR was up for our existing North American iCasino and sports betting operations, which account for most of the segment's revenue.\n\nWith the addition of  iSoftBet, our iCasino offer is now live in over 25 jurisdictions, and there are a number of new market launches in Europe and Latin America planned for next year. We are also on pace to double the number of new game launches to about 50 per year. Omnichannel games are a key area of focus and competitive advantage as we look to leverage the success of land-based titles, such as Prosperity Link and Money Mania, in the digital arena. The expansion of our game development capabilities, along with our newly acquired aggregation platform, enables us to develop exclusive selections for our customers who are always looking for ways to differentiate themselves in the market.\n\nIGT's proposition becomes even more compelling with world-class data analytics and user engagement tools that can create a real-time personal offering and recommendations for individual players. For sports betting, IGT solutions are powering over 80 sportsbooks, and the portfolio of turnkey customers continues to expand. The new PeakBarTop with sports betting cabinet we just introduced with G2E is getting a lot of attention, including winning the Land-Based Product of the Year award at the 2022 Global Gaming Awards in Las Vegas. The digital and betting segment is already profitable even as we are making outsized investments for future growth.\n\nThe SaaS-like business model means that profit margins should expand as we gain scale. You should see that dynamic unfolding beginning next year as we continue to work on the iSoftBet integration for the rest of 2022. Our year-to-date results highlight good momentum across each business segment. With revenue and profits up in constant currency, we have successfully anniversaried the substantial discrete benefits in the prior year, and we've overcome around 180 million in revenue and 140 million in operating profit headwinds from FX, higher supply chain and project costs, and omicron.\n\nIt is an impressive achievement, and I want to thank the IGT team for their passion and dedication to delivering it. Current customer and player demand trends remain strong. IGT has a diverse and resilient business model. As I noted, most of our profits and cash flows are generated by recurring revenue streams backed by long-term contracts.\n\nThis puts us on a solid path to delivering on our fiscal year 2022 commitments. It also enables us to deliver compelling shareholder value with capital returns at record highs. Now, I'll turn the call over to Max.\n\nMax Chiara -- Chief Financial Officer\n\nThank you, Vince, and thank you all for joining us today. The third-quarter results highlight strong underlying growth and accelerating momentum across the company. Our investment in innovation and focus on optimizing processes and our cost structure is generating strong cash flow. We are deploying that cash flow in a balanced manner to drive future growth, reduce debt, and return capital to shareholders.\n\nOn Slide 14, you will see a summary of key financial highlights. Revenue in the third quarter was 1.1 billion, growing 14% over the prior year at constant currency with contributions from all segments. Global gaming grew 34% at constant currency due to strong player demand for our products and services. The global lottery business grew 4% at constant currency, driven mostly by strong multijurisdictional jackpot performance.\n\nAnd digital and betting revenue, which includes contributions from iSoftBet, was up an impressive 34%. Operating income of 211 million grew 9% over the prior year at constant currency, driven by significant operating leverage in gaming. And the operating income margin of 20% came in at the top of expectations. This included about 150-basis-point impact from project-related cost and step-up amortization associated with the iSoftBet acquisition.\n\nAdjusted EBITDA of -- of 402 million was up 7% while adjusted EBITDA margin was 38%, reflecting significant improvement in global gaming profitability and a robust lottery profit margin. Year to date, revenue of 3.1 billion grew 8% at constant currency. Operating income of 691 million and adjusted EBITDA of 1.2 billion were up 4% and 2% at constant currency, respectively. Operating margin of 22% and adjusted EBITDA margin of 40% reflect structural improvement versus 2019 despite increased investment in growth initiatives and inflationary and supply chain challenges impacting our industry and businesses throughout the year.\n\nYear-to-date results showcase our ability to deliver profit while investing in strategic initiatives and navigating macro headwinds. And with KPI momentum accelerating across each segment, we are on track to achieve our full-year financial objectives. Let's now move to the segments, starting with lottery. Third-quarter lottery revenue total nearly 630 million, up 4% at constant currency.\n\nSame-store sales grew 3.3% versus the third quarter of 2021, fueled by strong, multijurisdictional jackpot activity in the U.S. and for EuroMillions jackpot. Same-store sales growth for all game types improved versus first-half trends. Compared to 2019, global same-store sales growth was up over 20% in the third quarter with strength across geographies and game categories.\n\nNorth America same-store sales growth was up over 30%. And Italy's same-store sales increased low double-digit, with over 20% growth for instant ticket sales, partially mitigated by lower draw game sales. Italy draw game sales are progressively improving and are approaching pre-COVID levels. iLottery continue to be an area of growth and exciting opportunity.\n\niLottery sales nearly doubled year over year on new game launches in Belgium and robust eInstant ticket sales growth in North America. Global lottery operating margin of 34% was strong and already at the midpoint of our 2025 target. This was achieved even with lower Italy representation, especially from draw games. Mobile lottery trends are off to a good start in Q4 on strong sales for the historic Powerball jackpot in the U.S.\n\nand improved draw game sales in Italy. Turning to global gaming, we continue to see remarkable growth and broad-based improvement with revenue up over 30%, supported by increased player activity and customer excitement for IGT products and solutions. Product sales were especially strong, rising about 70%. Total units shipped approached 9,000 in the third quarter, up nearly 60% from the prior-year period, fueled by replacement unit demand, especially in the U.S.\n\nand Canada, where our leadership in the casino and VLT space translated into a record ASP of $15,900. Product sales also benefited from higher intellectual property and multiyear poker site license revenue. The global installed base was up sequentially by over 600 units with growth across geographies and categories. U.S.\n\nand Canada yields rose 7% to almost $44, among the highest in company history, supported by a growing roster of more productive WAP and MLP games. Operating income of 65 million more than doubled on significant operating leverage that drove operating margin up about 600 basis points to 17%, which is comfortably above the full-year '19 level. There is a lot of momentum in the global gaming business on the heels of a successful G2E. We believe the combination of compelling new games and exciting new hardware offer opportunities to improve our global prospects as we focus on growing share in areas where we are currently underrepresented.\n\nDigital and betting revenue of 54 million was up 34% at constant currency. iGaming drove most of the growth in three key areas: the contribution from iSoftBet, new markets such as Connecticut and West Virginia, and organic growth. We are excited about the opportunities arising from iSoftBet alignment with our long-term goals. Operating income of 12 million, which was stable at constant currency, and an operating income margin of 22% were better than we expected in light of iSoftBet integration cost and increased R&D investments.\n\nWe expect to realize the returns on these investments beginning next year as we leverage a growing content portfolio on an expanded and more robust global distribution network. Now turning to cash flow and capital allocation. Year to date, cash from operations totaled 621 million, with free cash flow of almost 400 million. As a reminder, interest payments are concentrated in the first and third quarter, while tax payments are concentrated in the third and fourth quarter.\n\nIn the current quarter, we started to see some of the unwinding of the investment in working capital from the first part of the year. We expect this to continue in Q4. We also realized a sizable net cash inflow from recent asset divestitures and acquisitions. This enabled us to opportunistically reduce debt in the quarter while maintaining our balanced approach to capital allocation.\n\nThrough mid-October, the company has returned 224 million to shareholders, including 103 million in share repurchases at an average price of $21.52. 156 million of share repurchase authorization remains in our program. We exited the third quarter with a greatly enhanced credit profile. The partial tender of certain senior secured notes during the quarter, including 400 million of 6.5% notes due 2025 and euro 200 million of 3.5% notes due 2024, brought our outstanding debt and leverage to the lowest level in company history.\n\nNet debt leverage of 3.1 times is better than our '22 target and is approaching the midpoint of our long-term goal. 2.2 billion in total liquidity includes 1.8 billion in additional borrowing capacity from undrawn credit facilities. This allows us to be operationally and strategically nimble as we pursue our long-term objectives. The vast majority of our debt is fixed, and the debt retirement done so far this year represents another milestone toward our interest expense reduction.\n\nAs shown on Slide 20, we are introducing guidance for the fourth quarter of around $1 billion in revenue and an 18% to 19% operating income margin. This assumes $0 parity and an impact of around 150 to 200 basis points to operating margin from iSoftBet acquisitions, step-up amortization, project-related costs, and restructuring expenses. We are also reaffirming our 2022 full-year guidance, targeting the upper half of the ranges. In summary, IGT is on track to achieve full-year 2022 financial targets.\n\nWe generated very strong financial results in the third quarter, significantly enhanced our credit profile, delivered compelling returns to shareholders through dividends and share repurchases, and reaffirm our full-year '22 outlook. This concludes our prepared remarks. Operator, would you please open the line for questions?\n\nOperator\n\n[Operator instructions] Our first question comes from Carlo Santarelli with Deutsche Bank.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nHi, everybody. Good morning. Vince, Max, obviously, a lot of moving parts, iSoftBet coming in, the Italian B2C business going out with PostePay. You guys have overcome a lot this year.\n\nAs we think about, you know, kind of the bridge to 2023 obviously building -- you know, continuing to build momentum on the gaming side, lottery comps a little bit more reasonable this year than are -- in '23 than they were in '22. When you put it all together, how do you think about kind of the prospects for further growth, both kind of on a revenue line and on the adjusted EBITDA line?\n\nVince Sadusky -- Chief Executive Officer\n\nYeah. So, I'll give you some -- some qualitative thoughts. You know, of course, we're still kind of finalizing our thoughts around 2023, but I think it's pretty clear the -- the underlying KPI trends in lottery and gaming for -- for IGT have been really encouraging through the -- through the third quarter. Just some, you know, kind of high-level data points to think about, lottery same-store sales continue to grow.\n\nItaly, which has been, you know -- which has been down in 2022, given the discrete benefits in 2021, you saw in the third quarter has made significant progress. And the -- the decline from the prior year has been -- the gap has been reduced significantly. And then, when you think about the -- the gaming industry, you know, you all obviously cover the casino operators and I've spent a fair amount of time with the -- with the casino operators, CEOs prior to -- leading up to G2E. And they continue to have, you know, great success, record cash flows and room rates, and -- and most importantly for us for -- as far as slots go, really record returns.\n\nYou know, we have not seen or -- or heard any indication of -- of anticipated slowdown in investment in their -- in their slot floor. If you take a look at the kind of market forecasters at the moment, they expect good growth in -- in unit sales next year, both in North America and internationally. And I think IGT is in really good spot. Our -- our games are -- are better.\n\nI think we've had really good success, really good, encouraging feedback from our customers. And again, our -- our greatest struggles through the third quarter of -- of 2022 and going into the fourth quarter has been keeping up with -- with demand. So, I think, overall, signs, you know, at the moment are -- are good. And then you switch on over to digital and betting.\n\nYou mentioned iSoftBet. I think we've got, you know, good momentum in that in -- that regard with iSoftBet helping us to, I think, provide incremental capabilities, both on the platform basis to be able to be best in class in producing digital-first games, as well as having a best-in-class system that makes it easy for third-party games to -- to connect and integrate with us and take advantage of our significant distribution network. And I think that really helps to increase our -- our capabilities in a period where the -- the opening of iCasinos through legislation in North America is a bit slower than we originally -- we originally anticipated. So, I think, you know, all those things feel -- feel pretty good in terms of our -- our current view on -- on 2023.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nGreat. Thank you, Vince. And then, if I could, just one follow-up. You guys talked a little bit about the record ASPs in the U.S.\n\nand Canada. And obviously, margins within gaming were -- were up 320 basis points or so year over year. But clearly, a lot of moving parts. Clearly, you guys have taken a bunch of costs out of that business in general.\n\nSo, my question was more along the lines of, has the increase in pricing been enough, on an apples-to-apples basis, to kind of cover the supply chain increases in cost?\n\nMax Chiara -- Chief Financial Officer\n\nHi, Carlo. This is Max speaking. I'll take this one. So, the significantly improved ASP in Q3 still comes on the heels of really an improved mix of product, primarily is product with higher content that obviously -- and have enhanced features that drives higher price points.\n\nObviously as we -- as we -- as we have said previously, we have also touched our prices, but the impact -- the true impact on pricing is not expected to come into fruition until later in Q4 and more vividly into 2023. And again, there's been actions that have come up on the heels of the -- and significantly increased supply chain cost. And we have targeted about an up to a mid-single-digit price increase with some product categories of our owns. Again [inaudible] mix.\n\nThank you.\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\n[inaudible] Thank you.\n\nOperator\n\nOur next question comes from Barry Jonas with Truist Securities.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nHey -- hey, guys. Good morning. Last quarter, you talked about 10 million or so of EBITDA upside from the 1.3 billion jackpot. Is -- is that about what was recognized? And then as a follow-up, what kind of upside are you assuming in guidance for the current Powerball?\n\nMax Chiara -- Chief Financial Officer\n\nYeah. So you -- you recollect correctly, we estimated the mega-million 1.3 billion jackpot that hit in July to give us a favorable impact of about 10 million sales flow-through to profit. Obviously, the jackpot running right now is much higher is 1.9 billion, as everyone knows. So, there, the benefit is expected to be higher than that.\n\nIt could get up to 20 million. But we also need to see how much fatigue post Powerball hit the -- jackpot hit will -- will be in the market. So, again, high level is probably up to 20 million right now for the fourth quarter.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nGreat, great. And then, just, you know, relative to the lottery extensions that you announced, how should we think about the economics relative to -- to the prior contracts?\n\nVince Sadusky -- Chief Executive Officer\n\nYeah. I think, you know, we were happy to report that our New York contract got -- got renewed. You know, there's typically some incremental capital expenditures commitment associated with a renewal, so we can help our customers to upgrade their point-of-sales machines, for the most part, and take advantage of some of the -- some of the great new technology that -- that our team has designed and get that out into the -- into the marketplace. On the Georgia front, again, that was a seven-year renewal.\n\nAnd I think, you know, that continues to, you know, have very, very attractive returns, and that includes an upgrade of -- of a bunch of their retail terminals as well. And then, Texas was a printing contract, and, you know, we renewed that for 10 years. And we don't really talk about the financial terms associated with -- with that. But of course, on printing, there is -- there's no -- there's no capital commitment.\n\nBarry Jonas -- Truist Securities -- Analyst\n\nPerfect. All right. Thank you so much, guys.\n\nOperator\n\n[Operator instructions] Next, we have Ben Chaiken with Credit Suisse.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nHey, how's it going? Thanks for taking my questions. Just a quick one first. I'm not sure if you covered it. The 150 to 200 basis points in 4Q, how much of that -- does that hit EBITDA, those operating OI impact you guys called out? And then, the second question, in the presentation, you talked about significant opportunity for margin improvement in gaming.\n\nI know, you know, in response to Carlo's question, when you just talked about some pricing initiatives in -- in '23 that should flow through, should we see those margin enhancements in '23 based on the pricing increases? And then, are there other opportunities as well on the cost side within gaming? Thanks.\n\nMax Chiara -- Chief Financial Officer\n\nHi, this is Max speaking. I'll take this one. So, in terms of the EBITDA-specific impact of the 150 to 200, if you use the 150 as a point of reference, I would say 50 bps EBIDTA, 100 -- 150 bps OI. So, it's one-third hit in EBITDA.\n\nIn terms of the gaming margin progression, we have displayed our target for 2025 to be -- on OI margin to be between 28% and 30%. We closed the quarter at 17, so, there is some way to go, but we think that over the next three years we will be able to get up to that target. So, we expect the margin to sequentially improve year on year.\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nOkay, Thanks.\n\nOperator\n\nOur next question comes from Chad Beynon with Macquarie.\n\nChad Beynon -- Macquarie Group -- Analyst\n\nHi, good morning. Thanks for taking my question. I wanted to start on the gaming side. The installed base growth was pretty strong, particularly outside of the United States.\n\nI believe a lot of this business is probably concentrated in North and further, I guess, South -- in Latin America and in Africa and maybe even Australia, some markets that are a little harder for us to kind of get our finger on the pulse. But can you kind of help us dial into what's been going on in those regions, and if the installed base growth is really a factor of things just kind of reopening up or if you're taking market share, and if that's kind of in your -- in your forecast to continue to grow that installed base in rest of world? Thank you.\n\nVince Sadusky -- Chief Executive Officer\n\nYeah, sure thing. So, you know, we -- we saw sequential growth quarter over quarter in our installed base, and that was really driven by our WAP and our MLP games on our new cabinets. And coming out of G2E, I can just say there is a terrific amount of interest and excitement around our new hardware and, of course, our new -- our newer software games, especially based upon the kind of early success we've had with -- with titles like Prosperity Link, and Money Mania, Cleopatra. I think it's important to, first off, focus on -- on North America and, you know, the -- the significantly improved trends the companies had in installed base in -- in the North American market.\n\nFor example, you know, we all know the MLP space has been the most significant growth category for -- for many years and an area where IGT was not nearly as competitive as it's been in -- in all the other categories. But, you know, from 2020, IGT's MLP installed base has grown over 20%. And we feel like we've got continued opportunity for further growth in that category for sure based upon, you know, achieving, I think, good success in the MLP game space after many years of -- of -- of effort. I'd say, you know, also our our Class II installed base has grown as well as we've focused on producing really good games in that category.\n\nAnd then, on top of that, we're seeing continued improving yields as well. So, when I speak with casino operators, they're -- they're clearly reaffirming the -- the strength of IGT's game performance, which is the kind of the ultimate scorecard in terms of -- of driving continued -- continued gains in -- in North America. Yeah, I think if you look at -- at the rest of the world, yeah, we've had good strength in our installed base in the rest of the world, primarily in Latin America. We've been underrepresented in Latin America.\n\nAnd when we look at our long-term growth plan, EMEA and Latin America are significant drivers of -- of what we think is -- is a great installed base opportunity for us. And Greece as well was also a -- a significant contributor to our international installed base increase in -- in the third quarter.\n\nChad Beynon -- Macquarie Group -- Analyst\n\nThanks, Vince. Appreciate it. And then, Max, with respect to the balance sheet, leverage, you mentioned, is down to 3.1 times. Can you remind us where you want this to be from just kind of an operational standpoint? And as it continues to tick down, how do you think about plans for access capital, whether it's repurchases, dividend increases, or more tuck-in M&A? Thanks.\n\nMax Chiara -- Chief Financial Officer\n\nYes. Chad, as you know, our long-term target is to be in the range of 2.5 to 3.5 leverage. So, we feel right now we are in a good spot. Obviously, we would like to be in the -- in the low end of the buffer to protect ourselves for potential bad times coming.\n\nSo, there is still work to be done. In terms of the capital allocation, we continue to master our approach toward a balanced capital allocation, and you'll see that in full fruition in the year-to date-period as well. There are 156 million remaining under the existing authorization on share buyback. So, in conjunction with those strategic pillars of us, we expect to continue to execute on the program going forward.\n\nBut again, the milestone is to continue to take care of the leverage and bring it down to the -- the lower half of the long-term target.\n\nChad Beynon -- Macquarie Group -- Analyst\n\nThank you very much. Nice results.\n\nOperator\n\nOur next question comes from Domenico Ghilotti.\n\nDomenico Ghilotti -- Equita -- Analyst\n\nYeah. Good morning. I have three questions. The first is on the -- actually, so, the instant ticket business in Italy was quite impressive in terms of performance.\n\nCan you comment on -- on the driver and the sustainability of the current trend? And then, second question is on the gaming business. Usually, seasonality in Q4 is quite -- quite strong, but clearly, you have this supply chain -- or you had the supply chain issue. So, can you give us some more color? This is a -- a seasonality that can be seen also in Q4. And last, on the cash generation, there are several moving parts.\n\nMax, you were mentioning that working capital that is the legal dispute and cash taxes. Or -- if you can provide an -- any indication where you expect to see the net debt by -- by year -- year-end, that would be great.\n\nVince Sadusky -- Chief Executive Officer\n\nYeah. I'll start off and then let Max help out in answering the rest of the questions. So, yeah, what we've seen in Italy is, as we mentioned earlier, stronger-than-expected Scratch and Win sales, which has really helped us to offset a slower-than-expected recovery in -- in draw game sales. I think the opportunity for us going ahead is continued improvement in -- in draw games.\n\nAs we -- as we said, that third-quarter improvement was -- was very significant versus the first two -- two quarters. And we've seen really good -- really good improvement and progression such that draw-based games were only slightly below 2019. I think we saw multiyear growth versus 2019 improved to 10% from mid-single-digit growth in the first half of -- of 2022, and that was really driven by Scratch and Win games. And I think, you know, so much of that has been a direct effort of the team.\n\nYou know, since we, of course, operate the lottery in Italy, we were able to directly impact the -- the quality of the games, the number of game introductions, I think that the interesting titles and concepts that we've come up with. And I think the team's been very, very focused and we're -- you know, we're pleased to see, I think -- I think really good -- really good progress through the third quarter.\n\nMax Chiara -- Chief Financial Officer\n\nSo, Domenico, in terms of the seasonality on gaming, historically, Q4 has been among the strongest quarters in gaming as a result of the kind of the finishing of the year on product sales and deliveries. This year, obviously, is a little bit different because of the supply chain dislocations. It remains a dogfight out there on a daily basis, but it's much better than it was in the first half of the year. We have increased visibility on deliveries of components.\n\nWe have been able to resource some of the components with different suppliers, reengineer some of the product to make them simpler and easier to -- to complete. So, net net, we are confident that we can deliver on an increase production schedule into Q4, although we obviously need to watch it out on a daily basis. And in terms of cash generation, just to keep it simple, when you look at the full-year guidance versus the year to date, that is definitely a big quarter in front of us in terms of cash generation. When you use Q3 as a pivot, you should assume that there is probably about 100 million more -- more cash in Q4 coming from lower interest and tax payments.\n\nAnd then, is all about the working capital delivery, we were able to deliver about 100 million of cash from working capital in Q3. So again, it depends how much efficient we can be at the end of the year. But if everything goes in line with our expectation, you should see another cash inflow from working capital into Q4, and that should drive us home the guidance.\n\nDomenico Ghilotti -- Equita -- Analyst\n\nAnd just to follow up on the -- on the potential payment for the Benson matter, so, when should we assume the cash-out?\n\nMax Chiara -- Chief Financial Officer\n\nYeah, so, the terms of the settlement only takes effect after final court approval of the proposed class settlement. So, the preliminary approval is expected sometime soon, but the final approval would likely take more than six months. So, we're still, again, in -- within this time frame right now.\n\nDomenico Ghilotti -- Equita -- Analyst\n\nOkay, Thanks.\n\nOperator\n\nOur next question comes from Jeff Stantial with Stifel.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks. Good morning, Vince, Max. I was hoping you could talk a bit more about international trends.\n\nWe've heard some anecdotes this earnings season, some softening in the European consumer related to cost of living pressures, at least more so than in the U.S. So, curious if you're seeing anything in your business, whether lottery or game ops or otherwise, that -- that suggests a similar trend.\n\nVince Sadusky -- Chief Executive Officer\n\nYeah, sure thing. So, of course, the most significant market for us is Italy. I think the company over the years, and most recently through the sale of our Italian payments business, has been very focused on reducing our exposure to -- to Italy in particular. So, really, we've got our lottery operation in Italy and -- and certainly the Italian consumer has been impacted by the economic conditions that have been taking place over -- over in Europe.\n\nThey've really had the high inflation driven primarily through higher energy prices for a good part of this year already. And, you know, those improving lottery trends that we've seen and -- and the strong growth over 2019, you know, kind of really runs against the -- the grain of that -- of that -- that inflation. So, we have not seen any -- any significant impact on lottery sales, you know, again, as we've really shown progressive improvement in the lottery business versus -- versus last year. And then, of course, you know, Italy has been susceptible to a lot of market disruptions over the last couple of decades, both politically and economically.\n\nAnd we've -- you know, being the lottery operator -- the longtime lottery operator, you know, we've -- we've got the data, and we've seen that the lottery has been very resilient throughout those -- those difficult periods. And I think, again, it's kind of a high-value, high -- high-reward, low-cost form of -- of entertainment. As far as the rest of Europe goes, part of -- I mentioned earlier part of our long-term opportunity, we believe, is greater market share and -- and gaming presence in Europe now that we're making very good games and they are resonating in -- in Europe. Europe has definitely been slower to recover coming out of -- of the -- out of the COVID recession, which --  you know, the way I view it is actually OK, to be honest, we would struggle to meet demand with the supply chain challenges we've had in -- in 2022.\n\nAnd so, for North America to be the driver of -- of growth is actually just fine. And we feel as if, as Europe and the rest of the world recovers more slowly, we'll be in a good position to -- to grow market share.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nGreat. That's -- that's really helpful. Thank you, Vince. And then if I could follow up with -- with a follow-up on one of Domenico's questions earlier on the Italian contracts, you know, you called out some nice sequential improvement in the lotto contract as some of the consumers over there kind of revert back to, call it, normalized wagering behavior.\n\nJust curious if you're seeing any signs of lotto coming back closer to 2019 levels starting to impact the strength you seen in Scratch and Win, or if you think it should be effectively entirely additive as it -- as that lotto contract ramps back to 2019 levels. Thanks.\n\nVince Sadusky -- Chief Executive Officer\n\nYeah, it's always a challenge to try to determine, you know, if one area like Scratch and Win success is negatively impacting draw-based games. But again, I think the encouraging data point is Scratch and Win has been strong and -- and our draw-based games have been improving, coming back toward 2019 levels. And again, we're -- we're hopeful, through our expertise and -- and -- and terrific tenured team, we can continue to -- continue along that -- that trend and have both continue to be good drivers going forward.\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nGreat. Very helpful. Thank you. I'll pass it on.\n\nOperator\n\n[Operator instructions] Our next question comes from David Katz with Jefferies.\n\nDavid Katz -- Jefferies -- Analyst\n\nHi. Good morning, everyone. Thanks for taking my question. I think you covered a lot of ground, and I don't want to reiterate too much, but, Max, if we could just go back to the balance sheet for a minute, target range of 2.5 to 3.5.\n\nAnd I wanted to know, with the drumbeat for a recession or slowdown, I mean, does that keep you closer to the lower end of that range, to the sub-3 range, potentially? And I wanted to just go back to the prospect of tuck-ins and, you know, how you might characterize the likelihood that there is any out there for IGT in the near term that would sort of coexist with that leverage level. Thanks.\n\nMax Chiara -- Chief Financial Officer\n\nYeah. So, the rationale for the one turn of leverage span in our target range was exactly to kind of help the company offset potential downturns coming in the -- in the -- in the industry along the way. Are we low enough to withstand completely a recession? First of all, we don't know what kind of recessions we're going to face next year potentially. If it is a mild recession, probably we are able to -- to continue to operate within that range.\n\nIf it is a more depressed, long-term recession, who knows, right? But again, the intent was to be able to absorb negative impact for a typical recession that could come at a certain point. I hope that answered your question.\n\nDavid Katz -- Jefferies -- Analyst\n\nAnd just with respect to probability on any tuck-ins, you know, more or less likely, would you say near term?\n\nVince Sadusky -- Chief Executive Officer\n\nYeah, I'll -- I'll jump in. I would say that, you know, we're always on the -- on the lookout for very talented studios, both on the land-based gaming side and on the iCasino side as well, and even technology and content providers on the -- on the iLottery side. There's, you know -- there's -- there's a lot of talented individuals out there that, you know, have created studios. You know, we work with a lot of them.\n\nSo, we get an opportunity to, you know, kind of take -- take the games out for a test ride. We've got an opportunity to -- to have their games on our platform and -- and see how they perform. But, you know, if everything's right, you know, that's -- you know, that's -- that's an area that we continue to be attuned to in terms of potentially adding to our -- our -- our capabilities. But I wouldn't say that any of that outlook has -- has changed.\n\nAnd, you know, there's -- there's nothing imminent.\n\nDavid Katz -- Jefferies -- Analyst\n\nThat's perfect. Thank you very much.\n\nOperator\n\nThere are no further questions at this time. I turn the call back over to CEO Vince Sadusky. \n\nVince Sadusky -- Chief Executive Officer\n\nYeah, thanks for joining us today. Our year-to-date results had a good momentum across each one of our business segments. We take it as a clear indication that our strategic focus on driving growth through innovation and optimizing our processes and scale is paying off. Our net average -- net debt and our leverage are at their lowest levels ever.\n\nAnd we returned a record capital to our shareholders. Current customer and player demands remain strong, and we are in a solid path to delivering our fiscal year 2022 commitments. We appreciate your interest, as always, in IGT, and we look forward to meeting many of you in the coming weeks. Have a great day.\n\nOperator\n\nThank you for attending today's presentation. You may now disconnect.\n\nDuration: 0 minutes\n\nJim Hurley\n\nVince Sadusky -- Chief Executive Officer\n\nMax Chiara -- Chief Financial Officer\n\nCarlo Santarelli -- Deutsche Bank -- Analyst\n\nBarry Jonas -- Truist Securities -- Analyst\n\nBen Chaiken -- Credit Suisse -- Analyst\n\nChad Beynon -- Macquarie Group -- Analyst\n\nDomenico Ghilotti -- Equita -- Analyst\n\nJeff Stantial -- Stifel Financial Corp. -- Analyst\n\nDavid Katz -- Jefferies -- Analyst\n\nMore IGT analysis\n\nAll earnings call transcripts"
}