{
  "companyName": "Ceridian HCM Holding Inc.",
  "companyTicker": "CDAY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/ceridian-hcm-holding-inc-cday-q3-2022-earnings-cal/",
  "content": "Ceridian HCM Holding Inc. (CDAY 1.46%)\nQ3 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nMatt Wells\n\nHello, and welcome to Ceridian's third quarter 2022 earnings conference call. I'm Matt Wells, senior director of investor relations. And on the call today, we have our co-CEOs, David Ossip and Leagh Turner; and our CFO, Noemie Heuland. As a reminder, all participants are in listen-only mode.\n\nAnd a question-and-answer session will follow the opening remarks. Before I hand the call over to David, I want to remind everyone that our commentary may include forward-looking statements. These statements are subject to risks and uncertainties that could cause Ceridian's results to differ materially from historical experience or present expectations. A description of some of these risks and uncertainties can be found in the reports we filed with the Securities and Exchange Commission, such as the cautionary statements in our filings.\n\nAdditionally, over the course of this call, we will reference non-GAAP measures to describe our performance. Please review our earnings press release and filings with the SEC for our rationale behind the use of non-GAAP measures and for a full reconciliation of these GAAP to non-GAAP metrics. Both our earnings press release and SEC filings are available on the Ceridian Investor Relations website. As a final note, A replay of this call will also be available on our Investor Relations website.\n\nAnd with that, I'd like to turn the call over to David.\n\nDavid Ossip -- Co-Chief Executive Officer\n\nHello, everyone, and thank you for joining our Q3 earnings. Today, I'll speak about our very strong performance in the quarter and continued company momentum, as well as some exciting product highlights as we prepare for our global customer conference insights taking place next week. Leagh will elaborate on both our market momentum and our continued ability to scale. And then now Noemie will provide commentary on the Q3 results and full-year guidance before we open the call for questions.\n\nLet me start with our financial performance. We had a very strong third quarter. We exceeded the high end of our guidance across all metrics despite the headwind of a stronger U.S. dollar.\n\nOur PEPM revenue growth remains strong and float income continues to benefit from a return to a more normalized interest rate environment. On a constant-currency basis, Dayforce recurring revenue grew 32% and 27% excluding float. Our business continues to scale very well. I'm pleased to report that adjusted EBITDA was $63.5 million, a 61% improvement year on year, and adjusted EBITDA margin was 20.1% of revenue and expansion versus a year ago when the business was operating at 15.3%.\n\nAdjusted cloud recurring gross margins of 74.8%, expanded 50 basis points year over year. We continue to invest in sales and product innovation to fuel durable revenue growth while also demonstrating our ability to scale operations. Third-quarter operating cash flows were $52.1 million in the third quarter, doubling from last year and driven by operating margin expansion and great benefits. Our brand promise has always been to make work life better.\n\nThe reality of the post-pandemic world is the way people work has permanently changed. And as a result, the demand for Dayforce remains robust. Furthermore, in a difficult market, every organization worldwide is focused on efficient growth and the most significant asset companies have is its people. Dayforce has always promised the delivery of quantifiable value, meaning real money saving and ROI back to our customers.\n\nWe are the engine that helps companies determine the most efficient high-value way of engaging employees across the enterprise while also providing real-time insights and reported. This delivers quantifiable value for the organization. Given the new reality of work and the fact that every organization is striving to operate efficiently in today's market conditions, it's clear why demand for Dayforce is growing. Year-to-date sales are up significantly, and our pipeline remains strong, all of which I will ask Leagh discuss in more detail in a moment.\n\nTurning to technology and product innovation. We are very pleased to report that for the third year in a row. We have been named a leader by Gartner in its Magic Quadrant for Cloud HCM Suites for organizations that have more than 1,000 employees. It's worth noting that we are the only pure-play HCM vendor in a leader quadrant alongside the ERP vendors.\n\nWe have continually said, our ability to innovate at pace and scale were resulting us separating ourselves from our competition. We believe that been clearly validated and at a point in time when demand for what we do remains strong. A consistent pace of innovation allows us to expand our addressable market across all segments and geographies simultaneously, whether it's serving the world's largest global multinational, delivering full-suite capabilities in our native markets, or breaking centuries-old models around how and when people get paid. So far in 2022, we've delivered more than 840 new features to our customers and we're not done.\n\nIn the quarter, we delivered the following technology that makes work life better for our customers. HR knowledge management, which provides HR professionals with the ability to create knowledge bases that empower employees to find answers to their common HR and compliance questions proactively. HR Knowledge Management is delivered seamlessly to employees through our engaging employee experience hub. Mobile Timesheet Management that provides managers with a fast and efficient way to view and edit and manage time information for their teams directly on their mobile devices and Integration Studio which provides self-service enterprise integration capabilities, enabling customers to build, deploy and manage the integration for Dayforce.\n\nIntegration Studio automates many of the traditional manual integration reporting tasks that companies wrestle with and in doing so makes our customers more efficient. Further, it's the strength of our highly differentiated technology a single solution and continuous calculation engine that allows us to deliver innovation like Dayforce Wallet where we continue to see incredible market momentum. Today, more than 1,340 customers have signed for the Dayforce Wallet and over 750 are live. Average registrations continue to trend at 45% of eligible users and the typical wallet user uses the wallet about 25 times per month.\n\nThese trends illustrate what our customers are telling us, which is that Dayforce Wallet is modern payroll. It's increasingly becoming an expectation from employees across organizations of all sizes and industries. Recall, Dayforce Wallet is differentiated in that it allows employees to get paid when they want in real time with no additional cost to the employee or the employer, thereby improving employees' financial wellness by avoiding costly alternatives and while significantly reducing employee turnover and cost for our customers. All of this and more will be on full display at our annual customer conference held live for the first time in three years, starting next week, November 7 to 10 in Las Vegas.\n\nReflective of our market demand, we have a high number of attendees across both customers and prospective customers, and we look forward to introducing you to what I believe will be another paradigm-breaking innovation. Before passing it over to Leagh to give you more details on our results, let me conclude by saying I'm very pleased to see us continuing to execute on all of our growth initiatives and making meaningful progress on our path to 30% adjusted EBITDA and operating cash flow generation. We have a long committed to being the market-leading global HCM company and this quarter is continued proof of that. Leagh, I'll turn it over to you.\n\nLeagh Turner -- Co-Chief Executive Officer\n\nThank you, David. As David noted, we're continuing to execute on our growth levers, while at the same time demonstrating our ability to drive scale. In Q3, we saw continued momentum across all segments of our business from emerging to large enterprise, and in every region in which we operate. Year-to-date sales are up significantly year on year.\n\nThis is driven primarily by net new customer wins and after two years of significant investment in the strength of our sales engine, we continue to see sellers' productivity increase. For the nine-month period or year to date, deals above $1 million are up over 50% year over year, which is indicative of both our move upmarket and also the breadth and relevance of our offering in the mid-market. Global traction continues with a stellar sales performance from our EMEA region in the third quarter, we're in -- we have strong momentum in the mid-market that's becoming consistently augmented by large global transactions with notable large enterprise EMEA-based customers. Our fourth-quarter pipeline is strong, and while our teams are focused on delivering in Q4, they are simultaneously building pipeline on the back of very strong market demand.\n\nI'd also like to note that among our customer base, 38% now take Dayforce suite, and we maintain a healthy back-to-the-base sales motion, which represents approximately 25% of year-to-date sales. The customer wins listed in our earnings release illustrate the strong demand for Dayforce. As we've said all along, our platform scales, and this is evidenced by several very large global customers selecting Dayforce as their platform of choice over the course of the last quarter. As already reported, one of the world's largest shipping and logistics companies chose Ceridian to provide Dayforce Payroll and Dayforce Wallet to modernize its payroll processes and to offer unique recruitment and retention benefits.\n\nAt seasonal peak, we will handle approximately 700,000 employees on our platform for this single customer, and we have shifted to the critical work of getting them live successfully. As well in Q3, a leading U.K. retailer chose Ceridian to provide its full suite of Dayforce capabilities, including managed services to support 50,000 employees across Europe and Asia Pacific. And the largest flat-rolled steel company in North America selected Ceridian to provide its 25,000 employees with payroll and workforce management in a complex and highly regulated environment.\n\nIn line with our growth lever strategy, we've delivered momentum in the global large enterprise while continuing to win in the mid-market and in selling back to the base. A U.S. financial services company with 8,000 employees globally chose to expand its Dayforce use to include payroll with workforce management already in place, the company was focused on streamlining its payroll processes with the help of Dayforce. The key differentiator in this win with Ceridian's modern technology that provides continuous calculation and the ability to increase payroll accuracy and efficiency.\n\nA global leader in packaging machinery manufacturing chose Dayforce as its unified human capital management solution with 5,000 employees in 27 countries, the company was looking for a single system to replace multiple platforms. With pay, time, and HR in the single global Dayforce platform, the company will have better visibility into its data and can strengthen security and compliance. In addition to great sales momentum, we're now operating at 74.8% adjusted cloud recurring gross margin and have a clear path to greater efficiencies ahead as we continue to leverage our global footprint, international shared services centers, and as we scale our platform. All of this operational scale is being driven while we continue to improve the core service metrics, our customers have come to expect from us.\n\nCustomer retention rates remain best-in-class. Customer SAT scores, which we monitor daily continue to exceed expectations. Support tickets, which are a proxy for both customer and product efficiency continue to trend downward despite us supporting a record number of customers. Our SI ecosystem essential to our ability to grow and scale is now comprised of more than 170 partners, many of which are priming our customers' implementations of Dayforce globally.\n\nAnd looking internally, we are so proud of the way that we are growing and developing our people to reflect the customers that we serve and to ensure the long-term health of the business. As examples, more than 50% of our employees globally are female, 50% of our VP level and above our female. As a result of these stats and many more, we were welcomed earlier this year on to the Bloomberg Equality Index, and we have completely eradicated pay disparity inside our four walls. By every measure, this is a very healthy business, prime for continued success.\n\nAnd before I pass it on to Noemie, I'd just simply like to thank our customers and partners who have registered for our Insights conference, starting next week. We deeply appreciate customers like Coca-Cola and Blackstone and Danone North America and Fourteen Foods and so many others, taking the stage to showcase how Dayforce has made their people's work lives better while delivering the value and return on investment that is just so critical during these uncertain times that we are all navigating together. As I do each quarter, I would like to close with a broader thank you to our customers, to our shareholders, and to our people. Thank you.\n\nThank you for the faith that you have put in us while we make it our mission to deliver on that in the day to day and quarter after quarter and year over year. And with that, I'll simply turn it over to Noemie.\n\nNoemie Heuland -- Chief Financial Officer\n\nThank you, Leagh. I'd like to provide additional color on our third-quarter performance and full-year guidance, which is detailed in the press release published on our Investor Relations website. As David highlighted, our third-quarter performance exceeded guidance across all revenue and profitability metrics despite approximately 200 basis points of FX headwinds to growth. Notably, at constant currency, Dayforce recurring revenue, excluding float, grew 27%.\n\nCloud revenue grew 28%, and total revenue grew 25%. Adjusted EBITDA margin of 20.1%, exceeded our guidance range driven by revenue upside in the quarter, as well as operational efficiencies and as illustrated by our adjusted cloud recurring gross margin of 74.8%, an expansion of 50 basis points. Third quarter operating cash flow of $52.1 million doubled versus last year, driven in part by operating margin expansion and float benefits. Turning to updated fiscal year 2022 guidance.\n\nI want to reiterate that our growth is impacted by additional FX headwinds driven by a stronger U.S. dollar compared to what we previously anticipated. However, on a constant-currency basis, we are raising the midpoint and narrowing our full-year guidance range across all revenue metrics. For the full year, we now expect Dayforce recurring revenue ex float growth of 27% to 27.5%, Cloud revenue growth of 26%, and total revenue growth of 23% at constant currency.\n\nIn reviewing Q4, I want to note that FX impact in the quarter is the greatest we've experienced year to date. On average, these FX headwinds impact our growth metrics by 300 to 400 basis points. Now, the last point I want to make is we're raising our fiscal year 2022 adjusted EBITDA guidance to reflect revised float assumptions and flow-through of profitability upside in Q3, partially offset by increased sales and marketing spend in Q4, historically, our largest sales quarter. At the midpoint, full-year adjusted EBITDA guidance margin of 19% represents a significant improvement year over year.\n\nAs said before, we are committed to investing for future growth while continuing to drive scale and efficiencies across the organization. Now, I'd like to turn the call back over to Matt to open it for Q&A.\n\nMatt Wells\n\nOur first question will come from Bryan Bergin of Cowen.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nHi. Thank you. Good afternoon. Wanted to just start at a high-level demand question.\n\nCan you just give us a sense, have you really seen any impact to pipeline or the pace of buyer decision-making? Just given the increasing macro uncertainty. And I'm just curious if you could talk about client segment size and by geography, it would be helpful.\n\nDavid Ossip -- Co-Chief Executive Officer\n\nAlex, we haven't seen any impact. As Leagh pointed out -- Bryan, we haven't seen any impact at all. And as Leagh pointed out, in Q3, we had very, very strong sales. Year to date, our sales are up significantly, the Q4 pipeline looks quite robust.\n\nLeagh, anything you would add?\n\nLeagh Turner -- Co-Chief Executive Officer\n\nNo.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nOK. That's great. And then a follow-up, just on the sales force. You talked a little bit about that.\n\nCan you dig in a little bit more on productivity levels, how you're feeling about sales force staffing here, and just overall retention in the sales force?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nRetention has -- it's quite good. We're fully staffed. Sales productivity is up, as Leagh pointed out significantly over the last two years.\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nThank you.\n\nMatt Wells\n\nOur next question comes from Mark Marcon from Baird.\n\nMark Marcon -- Baird -- Analyst\n\nGood afternoon, and congratulations on the strong sales results. Wondering -- can you talk a little bit about the guidance? You clearly ended up beating here by a fairly material amount in the third quarter. Appreciate the FX. In the commentary, you mentioned Bureau being down 13% to 14%.\n\nCan you talk a little bit about what some of the drivers are there and how we should think about it?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nSure. On the Bureau side, if I look at the Ceridian payroll business, Bureau payroll business, which in Q3 was about $3 million, it drops down to about $2 million in Q4 that's largely just an end-of-life of one of our respected platforms. There was an accounting true-up on the Excelity side of about $1 million that benefited Q3. And so, obviously, there's a drop going down into Q4.\n\nThe other line items are largely consistent quarter over quarter. So, it's mostly those two items. One is the movement of end of life in an old Ceridian platform and a one-time true-up for Excelity. Noemie, maybe if you can add anything?\n\nNoemie Heuland -- Chief Financial Officer\n\nMaybe a couple of other things on the Q4 guidance for revenue specifically. We have -- now we're not expecting to grow 18% to 19% at constant currency. As you noted, there's a bit of FX headwinds on a GAAP basis of about $5.7 million versus our previous guidance. On Dayforce recurring ex-float, we maintained our 23% to 24% guidance range at constant currency.\n\nSo, that hasn't really changed from last time we issued guidance. Remember, in the second half of 2021, we had some employment level recovery from COVID, which gave us a little bit of a boost. So, the good compare on the second half is a difficult one, but we're maintaining our growth rates for Dayforce recurring at slow. We're expecting a bit of float upside as a result of the continued sustained interest rate environment, which we've reflected in our top-line guidance.\n\nAnd the other lines, David touched on them. The other thing I would say is Powerpay is still expected to decline single digit, but primarily due to FX headwinds. The core business on Powerpay is holding very well. We actually had a strong performance in Q3, and we'll continue to maintain that throughout the end of the year.\n\nMark Marcon -- Baird -- Analyst\n\nGreat. And just to be clear, with regards to Ascender and Excelity in terms of new sales and client retention, those continue to go well, correct?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nThey do, and we actually are still selling a Ascender in market quite successfully.\n\nMark Marcon -- Baird -- Analyst\n\nTerrific. Thank you.\n\nMatt Wells\n\nOur next question comes from Siti Panigrahi from Mizuho.\n\nSiti Panigrahi -- Mizuho Securities --Analyst\n\nHey, thanks. Thanks for taking my question. It's very impressive to see these large-sized deals like another 700,000 users deal. And in the last few quarters, you talked about 100,000, 50,000 users kind of deal.\n\nSo, what's really driving such demand lately? Is it something to do? Have you started seeing disruption by a legacy vendor? Or what's really driving such demand? And could you talk about pipeline of such large deals?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nWell, again, Siti, thanks for that. Remember, this has been a journey over the last three, four years, starting with the restructuring of the sales force, building out quite an extensive part in network, and obviously, proving to the market through successful deployments that the technology can scale to very large organizations. Our global footprint has also helped differentiate us relative to the other players inside the actual market. So, I'd say the combination of those four things are coming together, and we're seeing continued traction quarter over quarter into the very large enterprise.\n\nSiti Panigrahi -- Mizuho Securities --Analyst\n\nAnd then typically, December is year one of your big go-live month. How is the pipeline this year? How does it look like? And also, could you comment about some of these large deals you closed recently, when do you expect them to go live?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nSure. Well, we have a -- the large accounting firm that actually will go live in quarter, I believe, which is actually quite successful. So, a very quick deployment of probably it must be about seven or eight months or well over 50,000 people. And as you know, we've had quite a few of those going line about the same time period for that.\n\nWe do expect a strong go-live quarter inside Q4. And from a sales perspective, it's also our largest quarter, and we're expecting another successful sales quarter as well.\n\nSiti Panigrahi -- Mizuho Securities --Analyst\n\nGreat. Thank you.\n\nMatt Wells\n\nOur next question comes from Bhavin Shah of Deutsche Bank. Bhavin may be on mute. We'll take our next question from Matthew Pfau of William Blair.\n\nMatthew Pfau -- William Blair -- Analyst\n\nGreat. Thanks for taking my question, guys. Wanted to ask on the EBITDA margin improvement. Maybe you can just discuss more specifically what operating efficiencies you're seeing? And then, you know, in the future, what operating efficiencies, do you see that are going to get you to the 30% EBITDA target -- EBITDA margin target that you mentioned? Thanks.\n\nDavid Ossip -- Co-Chief Executive Officer\n\nSure. We're quite focused as you've heard us speak about this over the last number of quarters. Firstly, we're committed to taking the cloud recurring gross margin from the 74.8% where it is currently to 80% by 2026. The areas that it's coming from as Leagh pointed out, we've seen efficiencies on the customer support and on the operational side coming from having more robust software and better processes in place.\n\nShe actually mentioned that the number of support calls coming in is actually at a record low. Even though we've had many more customers live, which is one example. We've obviously used a lot of automation and technology to get to that particular type of point. On the actual sales and marketing side, P&T side, the goal of the -- there is to hold them relatively flat as a percentage of revenue as we continue to expand.\n\nAnd a lot of the actual margin comes from two trends of recurring. The first is every year, as you know, the percentage of total revenue that comes from recurring revenue goes up by about 1%. And the second part that happens is the percentage of recurring revenue that come from Cloud versus the Bureau side. Recall that the Cloud has a 74.8% margin, and the Bureau currently has got a 61% margin.\n\nAs that shifts more toward the Cloud recurring side, it lifts up the overall recurring margin of the actual business. By 2026, we expect that movement to be quite significant, and that drives quite a lot of the improvements.\n\nMatthew Pfau -- William Blair -- Analyst\n\nGreat. Thanks, guys. Appreciate it.\n\nMatt Wells\n\nAnd our next question comes from Dan Jester of BMO.\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nHey, good afternoon, everyone. Thanks for taking my question. Maybe just to expand on that margin comment, David. Can you just -- it feels like a lot of that is organic, the natural evolution of the business.\n\nIf we do see a slowdown next year? Are there levers you could pull to sort of accelerate that? Or is that sort of a linear progression as we get to 2026 on the margin opportunity?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nYou know, our businesses are highly plannable business, as you can see by our guidance for the second half of the year as Noemie spoke about that when we expect about the Q2 results, we said we would grow, the Dayforce recurring by about 25% in the second half, and it remains the same. So, we get tremendous visibility, which means we can also control the business quite well. And so, if there is a slowdown, which, again, we don't see that in any of the trends in the market, in the pipeline, the buying decisions to go live, etc. But if it yes, we can obviously improve the profitability quicker.\n\nAnd if you recall, if you go back to Q1, you saw us not being shy about making operational changes to drive efficiencies. And furthermore, if you go back to the acquisitions that we did in APJ in Asia, part of our thesis was that we could leverage the global footprint of those organizations to drive efficiency through our business. And we are doing that, whether it be on the product and technology side, the customer support side, the implementation side, finance, G&A, etc., we're taking advantage of the lower footprint -- cost footprint in those offices.\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nGreat. That's really helpful. Thank you. And then just a follow-up on the Wallet.\n\nI appreciate providing the detail here about the pace of customer go-lives -- it's -- if I look back over the past year, it's been somewhere between 100 to 135 a quarter. Are we now at a pretty stable pace for go-lives? Or is there a possibility that we see Wallet further accelerate on a go-live basis from here? Thank you very much.\n\nDavid Ossip -- Co-Chief Executive Officer\n\nI think it's a constant stream. If I compare it, we've effectively got about 500, 600 accounts in backlog for go-live. And so, it's just a matter of activating those particular accounts. And then once we do that, there's a bit of a time when we go from taking them live until we get the registrations and the active card users for each of the different clients.\n\nWhen I look at it, we do probably around 700 to 800 registrations on an employee basis per day, and that has been somewhat constant over the last little while.\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nGreat. Thank you.\n\nMatt Wells\n\nWe'll take our next question from Mark Murphy of JPMorgan.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nYes. Thank you very much. So, David, in your script, you mentioned this focus on quantifiable value. And I'm interested in whether you think the value proposition of the Wallet it's actually going to resonate stronger if we do get into an economic slowdown, perhaps you'd have the typical business with more employees feeling a little strain and maybe wanting to access their pay sooner, maybe there'd be a little extra catalyst to keep moving that registration percentage higher?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nSo, Mark, a few things. Wallet today has become really the same as modern payroll that I don't think there's any organization out there that's looking for a modern payroll system that doesn't expect to have Wallet embedded in the solution. From a financial wellness perspective, it is definitely a huge benefit to people through the flexibility that the Wallet provides, especially that given that we do not charge the employees any fees to use the Wallet in North America that is paid through the interchange. The benefit that we've seen from a quantifiable value perspective for our customers is that the voluntary attrition rates have improved by more than 20% at those organizations that have rolled out the Wallet which is a tremendous savings to those organizations and cost between $5,000 to $10,000 to replace a person at a typical organization.\n\nSo, a huge savings, if you can say, hundreds of not thousands of people leaving our organization. We're seeing very, very high attachment rates on to new payroll customers and I don't expect that to change.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. And as a quick follow-up, again, I clearly understand you're not seeing -- it sounds like you're seeing health, which is impressive, and you're not seeing macro issues. But just to check on it, if the macro does end up manifesting among some of your customers at some point in this cycle, do you think they're going to be able to find the resources and the bandwidth to keep the Dayforce go-lives, kind of running on time? Because part of the reason I ask is that it sounds like they are.\n\nAnd I believe you have better capabilities than ever to be migrating the data and providing that deployment help and then providing all the support. So, I'm just wondering if you think you're going to be actually in a better place there, for instance, then when the pandemic hit.\n\nDavid Ossip -- Co-Chief Executive Officer\n\nYou know, from the onset of the Dayforce, the goal always has been to make every employee think like a CFO. So, very much a strong, strong focus on return on investment to our customers. In an economy where people may be nervous or more focused on cost and efficiency. Our messaging really resonates nicely.\n\nBecause as you know, we ranked No. 1 for payroll, No. 1 for client compliance by Gartner. We have I believe the fastest return on investment in market, which our customers have spoken about, I think Forrester and others have done case studies on that as well.\n\nSo, our messaging resonates very, very nicely. We've become quite efficient on the implementation side. Earlier today, I mentioned that one of the large accounting firms, probably the leader in the world when it comes to taxes and such, is going live, I believe, with the product in Q4, and that I believe was the Q1 sale. So, you're talking about well under a year in terms of go-live and, obviously, tremendous complexity around that.\n\nSo, I do believe that our customers will continue with the implementations will continue to take in life because of the savings that we're able to get from our system. And in addition, the compliance side does lower their liability, and payroll and workforce compliance and HR compliant today are becoming more and more difficult.\n\nNoemie Heuland -- Chief Financial Officer\n\nThe only other thing I would add is that we aren't constrained either. So, we spent the last couple of years as you well know, building out an SI ecosystem. And so, there are far more hands in the market to be able to bring our customers live.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nExcellent. Thank you.\n\nMatt Wells\n\nOur next question comes from Robert Simmons of D.A. Davidson.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nYes. All right.\n\nMatt Wells\n\nRobert, you're good.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nYeah, yeah. [Inaudible] here on mute. Thanks for taking the question. How much of a catalyst do you think that the inside conference coming back in person is going to be for you guys, not so much this year, obviously, but for next year?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nFirst, we're very excited with the Insights Conference. When we look at a number of prospective customers that are attending, the levels are very, very high. I would think that there's probably close to $100 million of recurring revenue in terms of opportunities across the prospective customers that are attending. And in addition, we expect very healthy attendance from our customers.\n\nThe agenda looks fantastic. The customer speakers, I think, are wonderful as well. And as you know, we've always seen a high conversion rate of prospective customers to live customers. So, it should be a very good conference.\n\nAnd hopefully, we'll see you there. Leagh, anything you want to add on that?\n\nLeagh Turner -- Co-Chief Executive Officer\n\nI mean, I think all I would say is it does two things. It accelerates deals in the current quarter, which is important, and it helps us build pipeline for the future year, which is also important. So, what we accomplished in three or four days is really meaningful to the next year and to the success of closing out this one.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nGot it. That makes sense. And then I guess just kind of the competitive landscape, are you seeing anything you call out from the competition that's different in terms of pricing, marketing, sales approach, product? Anything about that?\n\nLeagh Turner -- Co-Chief Executive Officer\n\nI mean, Dave is looking at me. I would not say that there's a demonstrable difference the competitive landscape. What I would say is we were very pleasantly surprised by the Gartner Magic Quadrant and the fact that we are now alone as the single HR-only vendor in the leadership quadrant, which I think will make a demonstrable difference going forward with respect to the way that we compete.\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nThank you very much.\n\nMatt Wells\n\nAnd our next question comes from Kevin McVeigh of Credit Suisse.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nGreat. Thanks so much. Noemie, I think you'd referenced some incremental sales and marketing in the fourth quarter. Is there any way to quantify what that incremental investment was relative to initial expectations?\n\nNoemie Heuland -- Chief Financial Officer\n\nAs you know, we're having -- we just talked about our Insights Conference that we're hosting next week. So, that's definitely part of the investments we're making in Q4. We're also increasing, obviously, our travel capabilities for our sellers and implementation teams because we want them in the field talking to customers in the fourth quarter, which is our historically largest quarter. So, there's a little bit of incremental travel as well, which was expected and which we're supporting fully.\n\nSo, those are the main items. But the rest in terms of adjusted EBITDA guidance for the full year, we're flowing through the excess profitability from Q3 and the additional float upside, and we're continuing to make investments to fuel our largest sales quarter.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nGreat. And then just a quick follow-up on that would be, what type of rate assumptions are assumed in the Q4?\n\nNoemie Heuland -- Chief Financial Officer\n\nYeah. We're assuming the current rate environment that you're referring specifically to the recent Fed rate hike that's actually embedded. But remember, because our portfolio is laddered and we have half of it invested in core, the effect will be throughout 2023 and beyond. And so, that's -- the float guidance embeds the current rate environment and continued ladder of our portfolio.\n\nDavid Ossip -- Co-Chief Executive Officer\n\nThank you for the question. We ended off Q3 with the float balance of -- sorry, of a rate of 2.19%, and we would expect it to be about 2.7% in the fourth quarter.\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nThank you.\n\nMatt Wells\n\nOur next question comes from Michael Turrin of Wells Fargo. Michael, you might be on mute. Our next question comes from Alex Zukin of Wolfe.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys, can you hear me?\n\nMatt Wells\n\nYeah, we can hear you.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. I guess maybe just two or three for me. First, I wanted -- there was a deal that you mentioned -- that you talked about in the press release, the diversified metal solutions provider that you guys was 11,000 employees, 40 unique operating companies with multiple products. And that was led by an SI partner.\n\nI guess could you talk a little bit more about that deal? What was unique about it? What was interesting, was this a global SI or a strategic partner. And the reason I ask about that is, again, it seems like a highly complex deal, not just a single module for a big company, but really an entire suite. And so, I wanted to just understand a little bit of is that -- do you have more of those in the pipeline? And I've got a quick follow-up.\n\nNoemie Heuland -- Chief Financial Officer\n\nYeah, it's a great question. Why don't I grab it and just say, you're right. First of all, I think it was 12,000 employees. I believe there were 315 locations, 12 countries.\n\nWe replaced 35 separate disparate solutions across to your point, 50 unique operating companies. And yes, it was a full suite, and it was deployed by a partner. And you asked -- I think the subtext is, are our partners capable of doing that? And the answer is, yes, they are. And the partner who did this deployment is actually a long-standing partner.\n\nThey've been with us for some time. They would be on the further end of the learning curve. So, this isn't a brand-new partner to our ecosystem, and they were able to bring that customer live successfully in record time. The question is, is there more of those out there? And the answer is yes, many.\n\nAnd you can imagine that it's our ambition, as you well know, over the course of the next couple of years to shift significantly in that direction. And so, what we're doing in many cases, is we're solving in other partners into our projects in order to be able to learn and develop at rapid speed so that we can do even more of that over time.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. I guess maybe also just a broader question. So, maybe for David, I know we go back and forth on this. I wish we could get bookings from you guys, particularly when it sounds like they are very, very good.\n\nAbsent that, is there a way to kind of qualify what you're now -- what you saw in Q3, the incremental opportunity that you see in Q4? And more specifically, again, you're putting up really strong bookings performance in the backdrop of a very, let's call it, scary macroeconomic environment. You're not seeing demand cycles lengthen or anything yet. I want to understand why? And more specifically, you've been through these types of economic cycles before in various companies. Are you just going to see it later? Is there something that is making this space more resilient given the backdrop of coming out of COVID and these deals getting delayed? How do you see this playing out, not just this quarter but over the course of the next year?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nSo, there are a few things. First, pandemic world is much more global than it was beforehand. The work from here is now quickly becoming work from anywhere. And so, we're finding the requirement for global capabilities to be greater than before.\n\nAnd there isn't anyone else really in market that has a single system where you can handle the construct of a global employee record with native payroll capability native workforce management capability built into the actual product. And so, that's driving a lot of the decisions that we see on the enterprise side where customers are coming to us because I don't think there are other really viable solutions in market. In the majors market, which goes for us up to 3,500 employees, and even the enterprise space, which goes up to 10,000 employees. There is a significant cost savings when you move to a single application because you don't have to pay for the database, the infrastructure, the employee record across each of the different modules that all come together.\n\nSo, there's tremendous efficiencies just from a subscription payment perspective. And then from an operation of the system, it's obviously much more efficient and much more natural for people to use it. And I think that's driving a lot of the decisions inside the market. And then finally, we always have been the strongest in compliance.\n\nAnd in many cases, customers come to us because they've had issues with other vendors in the space about paying people accurately. And we obviously do that very well. In fact, that inside is one of the features that Joe's going to show is now an add-on to the employee hardware there is a compliance dashboard, that provides information by jurisdiction about what the changes are in terms of compliance and payments requirements and such. So, I think that's a very big part of it.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nThank you.\n\nMatt Wells\n\nAnd we'll take our next question from Samad Samana from Jefferies.\n\nJordan Boretz -- Jefferies -- Analyst\n\nSorry about that. This is Jordan Boretz on for Samad. David, Noemie, Leagh, congrats on the strong results. So, I wanted to maybe touch on the bookings mix.\n\nSo, Leagh, you noted that in the prepared remarks. The number of greater than $1 million deals are up 50%, and obviously, that's extremely impressive. So, could you maybe give us some color on how the bookings mix by customer segments or maybe mid-market versus enterprise trended this quarter versus the prior quarter?\n\nLeagh Turner -- Co-Chief Executive Officer\n\nSure. I mean, maybe what I'll say, just to pick up the point that you put down is that it is true that a number of million-dollar deals are up 50% this year. I would just underscore that those are deals in the upmarket, so let's call it, enterprise, and large enterprise. But we're also seeing a significant number of $1 million-plus PEPM deals in the mid-market as customers buy a full suite.\n\nSo, I just put a finer point on that. With respect to momentum, I would say, we are categorically seeing it everywhere. We're seeing it in our emerging market. We're seeing it in our mid-market, that's in North America, EMEA, and APJ.\n\nWe're seeing it in the enterprise, which to David's point, is between 3,500 and 10,000. And we're seeing it in the large enterprise, above 10,000. There is not one segment that we operate in, where we are seeing a slowdown or any degradation in our pipeline momentum.\n\nJordan Boretz -- Jefferies -- Analyst\n\nGreat. That's helpful color there. David, I want to ask you a quick question on M&A. So, the last acquisition that you guys closed was out of HCM in December last year.\n\nAnd broadly tech valuations have come in quite a bit since then. So, has there been any change in how you're thinking about M&A? And maybe for future M&A, are there any specific regions you're targeting more so than others globally?\n\nDavid Ossip -- Co-Chief Executive Officer\n\nThere's been no change. In terms of M&A strategy, obviously, I think there's still a bit of a lag between the expectations of privately held companies versus the public markets. And we don't have any burning buyers we have to jump on. So, we're quite patient to wait and see what comes out.\n\nAreas that we always see or inquisitive would be around the DAC countries into the Nordics, where we have a bit of white space at the moment. We all, by the way, launching German payroll in 2023, and we have a huge backlog of customers for the German payroll, which is actually quite exciting.\n\nJordan Boretz -- Jefferies -- Analyst\n\nAwesome. Well, thanks for taking my question, guys. And again, congrats on the strong quarter.\n\nMatt Wells\n\nOur next question comes from Steve Enders of Citi.\n\nSteve Enders -- Citi -- Analyst\n\nOK, great. Thanks. Thanks for taking the question here. I want to ask some more on the channel initiative.\n\nI think you called out some good opportunities that you were brought in from channel partners. I guess how much is the channel, at this point, bringing you into opportunities versus more in a fulfillment engine for you?\n\nLeagh Turner -- Co-Chief Executive Officer\n\nIt's a great question. I would say plus or minus 50% of our pipeline is influenced through partners, and that's partners all kinds, that's system integrators, that's brokers, but they're touching a lot of our pipeline now. And what we're seeing when they do that is that our win rates in that segment of the pipeline are increasing quite significantly because the pipeline is better qualified.\n\nSteve Enders -- Citi -- Analyst\n\nOK. Gotcha. That's helpful. And then maybe just another quick question on the guide here.\n\nJust in terms of EBITDA and how you're thinking about float income kind of flowing in there. I think you mentioned in the past that we're kind of thinking about 50% of float upside, going to the bottom line. Is there any change in and how you're thinking about utilizing the float upside here? And then how you're kind of thinking about kind of further investments kind of beyond 4Q there as well.\n\nDavid Ossip -- Co-Chief Executive Officer\n\nNo, there's no change. we've been quite focused, as you know, on what -- when we look toward 2026, we see about $2 billion of top line, 80% recurring margins, and about 30% EBITDA. We also believe that operating cash flow will be very close to the EBITDA numbers, adjusted EBITDA number as well. Regarding float, we invest the float in a AAA-rated fund, which means that we are quite limited in the types of securities that we can invest in.\n\nIt's largely government and AAA-rated corps and there are certain rules around the amount of levering that you can do as well. We put about 50% of the balances into a liquidity portfolio. And there, we typically get the overnight. And the other 50% goes into a portfolio that we typically lever out about two and a half years.\n\nAnd so, it gives us -- this is a little bit of time before we get the full impact of the raise of the interest rates. But if they do come down, which I expect they will come down at some point, it takes longer for that to actually kind of wind down as well. The rates that we're in at the moment, I would call that more than normalized rate environment. quite similar to prior to 2008.\n\nAnd it's always been part of the operating model, if you like, of our type of business. In terms of investments, we continually invest heavily in product and technology. If you look at the year-over-year investment growth that we've made in products, you can actually see what we're actually delivering from that investment as well. Sales and marketing, we continue to invest in sellers.\n\nQ4, we have the investment in our Insights Conference, which is probably about a $6 million investment in that particular event alone. But we're very mindful of making sure that we do get return on all the investments.\n\nSteve Enders -- Citi -- Analyst\n\nOK. Perfect. Appreciate the color there.\n\nMatt Wells\n\nOur next question comes from Raimo Lenschow of Barclays.\n\nRaimo Lenschow -- Barclays Capital -- Analyst\n\nThank you. David, I wanted to go back to one of the earlier questions when people were questioning demand and why demand for HR. What are you seeing post pandemic? You mentioned compliance already, etc. But like talking to people in the market, other vendors as well.\n\nIt does seem like HR got elevated as a pain point post the pandemic and hence, it feels like it's more strategic again. I don't know if you could see that as well as you comment on that one.\n\nDavid Ossip -- Co-Chief Executive Officer\n\nSo, coming out of the pandemic, you had the increase in attrition rates across clients. So, it became more important to have things like succession planning, our property outline, and have proper strategies around that. There was more of a movement, as I mentioned, more global workforces. And so, finding an HR system that could manage a global workforce and report on that.\n\nAnalytics became very important. Because all of a sudden, you had to think about did you have enough people to handle the capacity that you were trying to put through your business. And without having metrics around your people, that's obviously very, very difficult to do. So, the movement to architectures lighthouse, where it's all one database that makes that type of analytics much easier.\n\nCompliance has become more difficult. It started during the actual pandemic where tax rules were changing almost weekly. And this continual focus on things like employee privacy, ways that kind of fairness rules for the employees, payment rules for employees, minimum wage rates for the employees. And you need a sophisticated system that can handle those types of requirements.\n\nSo, yes, in a world of today where we are almost at full employment. You have to make sure that you can get as much as possible from your people. You have to make sure that the experience that you have for those people is as best as possible so that they want to stay and continue to build out their careers at your organization. And if you do have vacancies, you do have to have strategic talent acquisition systems that need to leverage AI and ML to make sure that you have the right candidate experience and that you are bringing on the right people.\n\nAnd when there is churn, you have to rely on learning management systems because you need to have embedded learning throughout the experience of the actual people. So, all of that, I think, has become very, very important. And probably the last piece I would add is that, as you know, workforces today are more distributed, there hasn't been a return back to the office. And I think the deal with kind of error is over and people aren't going to go back to cubes.\n\nAnd so, you do need to have HR systems that can really help with collaboration and idea-sharing new ways of doing performance management in this new world of work.\n\nLeagh Turner -- Co-Chief Executive Officer\n\nThe only thing I'd add, if I could, to that very thorough answer, is that we used to manage people shoulder to shoulder inside an office. Given that people aren't returning to the office, organizations are relying on technology to support that work. And as a result, to your question, a direct answer is HR and HR technology has become significantly more strategic post pandemic.\n\nRaimo Lenschow -- Barclays Capital -- Analyst\n\nOK. I'll leave it at that. Congratulations. Thank you.\n\nMatt Wells\n\nAnd that concludes our Q&A session for the evening. Thank you, everyone.\n\nDuration: 0 minutes\n\nMatt Wells\n\nDavid Ossip -- Co-Chief Executive Officer\n\nLeagh Turner -- Co-Chief Executive Officer\n\nNoemie Heuland -- Chief Financial Officer\n\nBryan Bergin -- Cowen and Company -- Analyst\n\nMark Marcon -- Baird -- Analyst\n\nSiti Panigrahi -- Mizuho Securities --Analyst\n\nMatthew Pfau -- William Blair -- Analyst\n\nDan Jester -- BMO Capital Markets -- Analyst\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nRobert Simmons -- D.A. Davidson -- Analyst\n\nKevin McVeigh -- Credit Suisse -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nJordan Boretz -- Jefferies -- Analyst\n\nSteve Enders -- Citi -- Analyst\n\nRaimo Lenschow -- Barclays Capital -- Analyst\n\nMore CDAY analysis\n\nAll earnings call transcripts"
}