{
  "companyName": "HCA Healthcare",
  "companyTicker": "HCA",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/21/hca-healthcare-hca-q3-2022-earnings-call-transcrip/",
  "content": "HCA Healthcare (HCA -0.17%)\nQ3 2022 Earnings Call\nOct 21, 2022, 9:00 a.m. ET\n\nOperator\n\nWelcome to the HCA Healthcare third quarter 2022 earnings conference call. Today's call is being recorded. At this time, for opening remarks and introductions, I would like to turn the call over to vice president of investor relations, Mr. Frank Morgan.\n\nPlease go ahead, sir.\n\nFrank Morgan -- Vice President, Investor Relations\n\nGood morning, and welcome to everyone on today's call. With me this morning is our CEO, Sam Hazen; and CFO, Bill Rutherford. Sam and Bill will provide some prepared remarks, and then we will take questions. Before I turn the call over to Sam, let me remind everyone that should today's call contain any forward-looking statements that are based on management's current expectations, numerous risks, uncertainties and other factors may cause actual results to differ materially from those that might be expressed today.\n\nMore information on forward-looking statements and these factors are listed in today's press release and in our various SEC filings. On this morning's call, we may refer to measures such as adjusted EBITDA, which is a non-GAAP financial measure. A table providing supplemental information on adjusted EBITDA and reconciling net income attributable to HCA Inc. is included in today's release.\n\nThis morning's call is being recorded, and a replay of the call will be available later today. With that, I'll now turn the call over to Sam.\n\nSam Hazen -- Chief Executive Officer\n\nGood morning. Thanks for joining the call. As I've mentioned on past calls, it has been difficult over the pandemic period to judge our business trends because of the ups and downs we have experienced with the various COVID-19 surges. If you recall, the third quarter of 2021 was the most intense surge we saw with the Delta variant, and it significantly influenced our business, making it difficult to compare.\n\nWe believe the second quarter and the third quarter of this year provide us with the most sustained period yet for us to judge our business. Generally, the financial results in the third quarter were in line with our internal expectations. As compared to the second quarter, our revenue production was consistent with overall volumes, payer mix and acuity generally stable. These results were generated with capacity constraints in certain situations caused by ongoing labor market challenges.\n\nIn the quarter, we continued to invest significantly in our workforce including the opening of one more Galen College of Nursing campus. These investments produced improvement in retention, more new hires and reduced contract labor expenses. Overall, operating margins were solid and were a positive reflection on the disciplined execution by our teams. I want to thank them for their enduring commitment to our patients and our facilities.\n\nWe continue to be impressed by the resolve and dedication. These attributes were once again put to the test with Hurricane Ian. Fortunately, no patient or employee was harmed during the storm. And with the help of our partners, all facilities with the exception of one are fully operational.\n\nIn the face of disasters, whether a pandemic or a hurricane, the people of HCA Healthcare continue to shine. Normally, on this call, we attempt to provide you with some early perspectives on the upcoming year. Currently, we have reasonable insights into certain aspects of our business such as demand, which we believe will grow around 1% to 2% next year. We also expect payer mix and acuity to remain stable.\n\nHowever, with respect to inflation, we are less certain. We have responded to these unprecedented inflationary and macroeconomic pressures, and we will continue to respond with our workforce initiatives and our financial resiliency program, but it is too early to judge the effectiveness of our response as these forces and the related governmental responses continue to evolve and impact various categories of our costs. Therefore, we will refrain from providing the typical early outlook for 2023 until we finish our planning process in early January. By then, we will have seen another three months of performance to assess the overall environment as well as our response to it.\n\nI will close with this. We continue our work to position the company for long-term success and sustained stakeholder and shareholder value. Our strategic plan is designed to optimize the networks we have built over the years by resourcing them with better technology and analytics, new and innovative care models and a highly trained workforce. We believe these efforts position us well to grow and effectively leverage our deployed capital.\n\nBut more importantly, they position us better to deliver on our mission and provide higher quality care to our patients in a more efficient manner. Now, let me turn the call over to Bill. Thank you.\n\nBill Rutherford -- Chief Financial Officer\n\nThank you, and good morning, everyone. Let me provide some additional comments on the quarter. As Sam mentioned, our results in the third quarter were in line with our expectations. Adjusted EBITDA was $2.902 billion, adjusted EBITDA margin was 19.4%, and diluted earnings per share was $3.93, excluding losses on sale of facilities of $0.02.\n\nOur same facility volume levels in the third quarter were generally consistent with our second quarter levels. Our volume trends compared to the prior year reflect the COVID-19 surge we experienced in the prior year. For example, our same facility admissions are down 1.5% when compared to the prior year. COVID admissions were down almost 60% this quarter compared to third quarter of last year, and they represented almost 13% of admissions in Q3 of last year versus 5% of admissions in third quarter of this year.\n\nNon-COVID admissions increased 6.9% in the quarter as compared to the prior year and are up 2.7% year-to-date. Acuity and payer mix levels were generally consistent with second quarter levels as well and led to comparable revenue per equivalent admission between the second and third quarter. As mentioned in our release, we recorded approximately $266 million of revenue and $125 million of expenses related to the Florida directed payment program during the quarter. Approval for this program was received in September from CMS for the annual period ending September 30, 2022.\n\nIn addition, we estimate the impact of Hurricane Ian, which made landfall on the West Coast of Florida on September 28th, was approximately $35 million in the quarter. Our labor costs were generally in line with our expectations. We made market-based wage adjustments for our employee workforce and were able to absorb much of this with a 19% reduction in contract labor as compared to the second quarter. Supply cost trends remained stable, both sequentially and when compared to the prior year.\n\nOther operating expenses increased sequentially from the second quarter but this is mostly due to the Florida DPP expenses and some increases in professional fees and utility costs. We remain focused on our resiliency programs that we've spoken to in past calls. And overall, our teams are doing a great job responding to the inflationary market dynamics while also identifying efficiency opportunities. Let me transition to discuss some cash flow and balance sheet metrics, which continue to be a strength for HCA Healthcare.\n\nOur cash flow from operations was $3.02 billion in the quarter, and capital spending was $1.13 billion. We completed approximately $700 million of share repurchase during the quarter and just under $5.5 billion year-to-date. Our debt to adjusted EBITDA ratio was just above the low end of our stated leverage range, and we had approximately $3.9 billion of available liquidity at the end of the quarter. Lastly, I will mention that our full year 2022 guidance remains unchanged.So, with that, let me turn the call back over to Sam for some quick comments before we go to Q&A.\n\nSam Hazen -- Chief Executive Officer\n\nYes. One thing I wanted to share are the themes that we believe are takeaways from our quarter and sort of the normal business trends that we were judging between the second and third quarter. And these themes are as follows: first, again, we think our top line metrics are stable and normal seasonality patterns are beginning to show themselves; number two, we are making progress on our human resource agenda, our engagement levels are up, and so we're encouraged by that; number three, inflation is real. It's a pressure point, but we're working our way through it with our resiliency agenda and other initiatives; and then fourth is that long-term growth prospects, we believe exist across our portfolio.\n\nSo those things, we think, are important to our judgment of the third quarter as compared to the second quarter and as we look to push forward on into next year and the years thereafter. So with that, Frank, I'll turn it over to you for questions.\n\nFrank Morgan -- Vice President, Investor Relations\n\nThank you, Sam. As a reminder, please limit yourself to one question so that we may give as many as possible in the queue an opportunity to ask a question. Dennis, you may now give instructions to those who would like to ask a question.\n\nOperator\n\nThank you. [Operator instructions] And your first question today comes from the line of A.J. Rice with Credit Suisse. Please go ahead.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nHi, everybody. Thanks for the question. One maybe a technical point. Are you just -- commenting on Hurricane Ian and the impact in the early part of the fourth quarter.\n\nAnd then broader question is around your surgery volumes. You clearly showed good trends inpatient versus a year ago outpatient consistent with what you've shown year-to-date. I'm assuming that some of that relates to what was happening last year with the Delta surge. But, can you give us some flavor for where you're at inpatient-outpatient, and are we sort of back to a normal environment there? It sounds like you think you might see a step-up in the fourth quarter just from a normal seasonal pattern, but any comments there?\n\nSam Hazen -- Chief Executive Officer\n\nWell, A.J., this is Sam. I'll let Bill comment on the first question around Hurricane Ian in the fourth quarter. I mean, we had two facilities -- let me back up on Hurricane Ian, just to give everybody some perspective. We did evacuate, I think it was four hospitals in the Tampa, St.\n\nPete area when we believed the storm was going to hit further north. When the storm ultimately moved south on as we were able to move out our most critically ill patients out of two hospitals, and those two hospitals were hit pretty hard in Charlotte County. One of those hospitals suffered a pretty significant damage and we were able to get aspects of it opened already. Our emergency room is back open, one of our med-surg floors is back open, and we think will be fully operational by the end of the year.\n\nOur teams in West Florida division and really North Florida did an incredible job at responding to a really impactful hurricane. So that influenced our results in the third quarter. Our volumes were down obviously in the West Florida division, in the North Florida division, which overseas Orlando. So, we had a lot of preparation in management in advance of the storm.\n\nSo, it had a modest impact on our volumes. With respect to seasonality, we do believe that normal seasonal patterns are starting to exist. And that typically yields more activity in the fourth quarter on outpatient surgery than the third quarter. So, we're anticipating that, yes.\n\nAnd we are seeing normal patterns, we think, on other aspects of our business with respect to surgeries, cardiac procedures and so forth. And so, that gives us some ability to judge where we are and what initiatives are working. I think it's important, A.J., to understand that our capacity constraints in the third quarter were real. And some of that was the typical challenges we've had over the last 2.5 years in managing capacity.\n\nBut, we believe that we can continue to open more capacity as we move through the last part of this year and on into next year. But in the quarter, we declined in many instances because we weren't able to accommodate the patients, approximately 1% to 1.5% of our total admissions simply because of capacity constraints. So, we need to resolve those. Again, the progress that we're making on our HR agenda we believe is going to help us maintain sufficient capacity to take care of the patients who need our services.\n\nSo, we'll continue to push on those agendas and we're encouraged, though, by the progress that we're making.\n\nOperator\n\nYour next question is from the line of Pito Chickering with Deutsche Bank. Please go ahead.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nI understand that you don't want to give sort of 2023 guidance at this point, but can you help us sort of quantify a couple of things? How should we think about top line growth next year? You talked about sort of 1% or 2% demand. Where do you expect the pricing to be, any color on managed care price increases in 2023 versus 2022? Now, on the cost side of the equation, what are you seeing for full-time inflation in the fourth quarter this year? I think that evolves next year. Any color on sort of how new grads coming out of nursing schools, decreases contract labor? And then any sort of thoughts around non-labor inflation next year that you can give some color on? Thanks so much.\n\nBill Rutherford -- Chief Financial Officer\n\nWell, Pito, this is Bill. Let me try. I mean, I think Sam gave your comments on our thinking about top line. And really, the uncertainty remains around inflationary trends.\n\nAnd that's what we're looking at. Take the balance of the year, coupled with our experience so far to get some informed judgment as we go into 2023. So, it's a bit too early to provide too many details. We're pleased with the continuation of labor agenda.\n\nWe're pleased with the continuation of reductions of contract labor. And we're just going to have to judge the overall inflationary environment as we go into 2023. We think our teams and our resiliency efforts are good countermeasures to that. But that's what we're taking a little bit more time to kind of be able to judge that, and we'll give you a full commentary in January.\n\nSam Hazen -- Chief Executive Officer\n\nI think just to add a point to the third quarter as compared to the second quarter, our salary, wages and benefit cost per hour were flat with the second quarter. That was partially due to a 20% reduction in contract expenses. And at the same time, our normal wage timing for adjustments for our employees happens in the third quarter. And so, we were able to absorb that with the management of our contract labor expenses.\n\nSo, that was encouraging. That's the first quarter in a while where we've seen stabilization in our labor cost per hour when you mix all components of our labor costs. So, we'll continue to hopefully make some strides in that area and moderate some of the pressures, Pito, that exist in the labor market as we continue to execute on our recruitment agenda, our retention agenda, our capacity management and so forth.\n\nOperator\n\nYour next question is from the line of Ann Hynes with Mizuho Securities. Please go ahead.\n\nAnn Hynes -- Mizuho Securities -- Analyst\n\nYour volume guidance for next year is 1% to 2%. And I believe that's a little lower than historically, you typically guide 2% to 3%. Can you just talk about that and maybe what procedures aren't coming back or why you feel like it's not going to be a normal year since COVID admissions, while they still exist, aren't at the height they used to be?\n\nSam Hazen -- Chief Executive Officer\n\nI think for -- this is Sam, Ann. I think the 1% to 2% is a little bit lower than maybe historical trends because we will have some COVID admission activity in '22 that we don't think will be as much in '23. So, if you normalize for COVID, it's sort of in the zone of what our historical trends have been. We think outpatient activity would be a little stronger than inpatient activity as it has been historically.\n\nBut we do see, with the strong markets that we have and with the investments that we're making in our network that we should be able to achieve those normal trends when you normalize for some of the COVID activity, which we don't anticipate at the same level next year. So that's part of the explanation. There's still a little bit of the influence there from COVID.\n\nOperator\n\nYour next question is from the line of Justin Lake with Wolfe Research. Please go ahead.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nThanks. I wanted to ask a couple of questions on 2022. So first, in the -- your update -- you didn't update guidance. I assume that means that it remained intact.\n\nJust curious, given we're three quarters through, where you think within that guidance range you might end up? And then in the third quarter, to your point, COVID admissions were fluctuated pretty good. I was hoping you might be able to give us a revenue per admission number ex-COVID, just so we can see what the growth is doing ex that big swing in COVID. Thanks a lot.\n\nBill Rutherford -- Chief Financial Officer\n\nYes. Justin, this is Bill. Let me -- on guidance first. Yes, we're maintaining our previous guidance, which does accommodate a wider range of outcomes than we might typically have at this point in the year.\n\nBut given the uncertainties in the environment that we've talked about, we think it's appropriate at this time, and we'll just continue to manage our way through the balance of the year. Relative to non-COVID revenue for adjusted admission, we saw growth in both, overall as well as managed care. If you bear with me for a minute, I'll get you the exact number. So yes, we were up about two points on revenue per adjusted admission on the non-COVID for the quarter.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nAnd Bill, that would strip out the Florida revenues as well?\n\nBill Rutherford -- Chief Financial Officer\n\nYes, it would be.\n\nOperator\n\nYour next question is from the line of Gary Taylor with Cowen. Please go ahead.\n\nGary Taylor -- Cowen and Company -- Analyst\n\nTwo quick ones. The first is, when we think about some of the headwinds for '23 that you talked about before, the Texas out of period, some of the COVID reimbursement, etc. Does the Florida DPP, does that constitute a headwind for '23, or is that a program if it's you'd expect to continue such that the annual number is the same? And then, my second question is -- I hear your comments on inflation. And obviously, we look at the pretty good labor performance this quarter and supply cost per adjusted patient actually down year-over-year.\n\nSo, are you signaling that there's a new inflection point in inflation that you're concerned about for '23? And is that in the labor, or is that in other operating, so it's utilities and insurance and that sort of thing?\n\nBill Rutherford -- Chief Financial Officer\n\nYes. Hey Gary, this is Bill. Let me address the Florida DPP. We are not anticipating that to be a headwind next year.\n\nThat is an annual program, have received annual approval. So, we are subject to approval. But, as you might recall, we reported some amounts in the fourth quarter of last year. And with this amount, we would, at this point, anticipate that program will continue, and it's material for next year, but we'll continue to evaluate that.\n\nSam Hazen -- Chief Executive Officer\n\nYes. And Gary, this is Sam. On inflation, we're not really signaling anything. We're just suggesting that we want to go three more months and understand the progress that we hope to make with our labor agenda and some of our other efforts.\n\nAnd that will give us, hopefully, 9, 10 months' worth of normal run of business. Again, we haven't had that for three years. And that will help inform where we think the market is, where we think our initiatives are and how that's positioning us for '23, and we'll give you more specificity at that particular point in time on the different cost categories and inflationary pressures that exist within each of those.\n\nOperator\n\nYour next question is from the line of Andrew Mok with UBS. Please go ahead.\n\nAndrew Mok -- UBS -- Analyst\n\nI understand you're not commenting on 2023 at this point, but can you help us understand the level of nonrecurring benefits in 2022, so we can bridge to a proper 2022 baseline? Thanks.\n\nBill Rutherford -- Chief Financial Officer\n\nWell, I mean, we've talked publicly before around the Texas out-of-period amounts that we recorded earlier in the year that related to last year. That was approximately $150 million. And then, we've sized the various COVID support payments we received this year that we don't anticipate to continue around $300 million. And so, those would be the two areas we've talked about before.\n\nAnd there is other pluses and minuses, 340B is out there. But those are the two things that I would highlight at this point.\n\nOperator\n\nYour next question is from the line of Whit Mayo with SVB Securities. Please go ahead.\n\nWhit Mayo -- SVB Securities -- Analyst\n\nThanks. I just want to go back to contract labor for a minute. I appreciate the disclosure that it declined 19%. Can you maybe frame that as a percentage of SWB in the third quarter and also maybe what the exit rate is? And also, Bill, your comment on market-based wage adjustments, is there any way to maybe quantify that on an FTE basis or a per hour basis, just to put into perspective the level of inflation that you're seeing and how different that is maybe from the beginning of the year? Thanks.\n\nBill Rutherford -- Chief Financial Officer\n\nYes. Whit, on the contract labor percent of SWB was about 7.2% for the quarter, and that's pretty much close to our exit rate, as you say, for the quarter. So that's a good improvement. Roughly speaking, half of that was through the continued reduction of the average hourly rate and half though reduction of utilization of contract labor.\n\nSo, we're very pleased with those trends going forward.\n\nSam Hazen -- Chief Executive Officer\n\nYes. Typically -- Whit, this is Sam. We give our wage increases in the third quarter. It varies a little bit market to market.\n\nBut that's when the lion's share of our increases go through. And we've been a little bit active throughout the last year or so with targeted market adjustments here and there throughout the year, but we felt we needed to be a little bit more significant. So, we -- the composite is a little north of 4%. If you look at third quarter to second quarter, as far as average hourly rate increases for our employed forces.\n\nAgain, that's just the third quarter to second quarter, and we were able to absorb that inside of our contract labor expense management and yielded again labor cost as a composite flat with the third quarter compared to the second quarter. We still are running with a lot more nurses in contract labor than we did in 2019. So, we have room to go, we believe. We obviously have to execute on our human resource agenda to make that happen.\n\nAnd we've invested heavily in our recruitment capabilities, and they've done a wonderful job of improving our recruitment processing and really creating a better applicant experience as well as a better management experience for our management teams out there. We have very intentional retention efforts, including compensation and benefits and flexible scheduling and so forth in order to improve retention, and we're seeing progress there. Our engagement results just came in, very positive. So we're really encouraged by our abilities to capitalize on modifying our workforce over time.\n\nThat can change. We understand that, but at this particular juncture, that's where we are.\n\nOperator\n\nYour next question is from the line of Ben Hendrix with RBC Capital Markets. Please go ahead.\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nOne of your -- your competitor noted an increase in clinicians out on quarantine this quarter, and clearly, they had an impact on agency labor, and you seem to have managed obviously agency labor much better. And I'm wondering what you saw in terms of staff quarantine rates and -- this quarter versus prior? And how were you able to manage that? And if you saw any scheduling delays on the outpatient electives as a result of changing quarantine rates? Thanks.\n\nSam Hazen -- Chief Executive Officer\n\nThis is Sam. Thank you for that question. We -- I don't know of any quarantine issues that we experienced in the third quarter this year. Obviously, last year with the Delta variant, we had a number of our staff who were out on quarantine.\n\nBut this year, that has not surfaced as an issue for us across our divisions. I mean, I'm sure there were some people who experienced some COVID in our workforce, but it wasn't a significant piece of issue for us.\n\nOperator\n\nYour next question is from the line of Lance Wilkes with Bernstein. Please go ahead.\n\nLance Wilkes -- AllianceBernstein -- Analyst\n\nYes. So, could you talk a little bit about rate negotiations with managed care? What progress you're seeing on that? And maybe if you can give some context on the market environment, if you're seeing any smaller hospitals that are terming contracts or if you, in fact, termed any contracts? Thanks.\n\nSam Hazen -- Chief Executive Officer\n\nWell, we've mentioned in the past that we felt the inflationary pressures that we're incurring on our cost structure are being received reasonably well by the payer community. And that has, in fact, happened. We closed some additional contracts in the third quarter of this year, and they were generally in the target of where we had indicated previously that we expected our new contracts to land, and that was somewhere in the mid-single-digits. So, we are making progress with respect to our renegotiations.\n\nAs I mentioned, we were already partially negotiated for 2023, and we continue to add to that negotiation in contract completion rate as we move through the third quarter. So, we're encouraged by the renegotiations that have occurred, and we are about 70% contracted for 2023 and about 45% contracted for 2024, and we're seeing elevated escalators by comparison to our historical trends on our commercial contract book. As it relates to our competitors, there's always pockets of negotiations where there's terminations and so forth. We have not had to terminate any contracts in any significant fashion.\n\nWe've been able to reach agreements that work for us and work for the payers, and we'll continue to hopefully be able to make that happen. We are working with the payers with respect to making sure that our accounts receivables are handled timely and appropriately with respect to denials and so forth, and we are incorporating that into our discussions in a way that we think will be productive for us and hopefully productive for the payers.\n\nOperator\n\nOur next question is from the line of Brian Tanquilut with Jefferies. Please go ahead.\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nSam, I appreciate you guys providing some insight into next year's volume expectations. But, as we stare down a recession here, I mean, how are you thinking about the resilience of the business? You guys did fairly well during the last recession, but just some thoughts on that and maybe your thoughts on any differences this time around versus '07 to 2012?\n\nSam Hazen -- Chief Executive Officer\n\nWell, I think the most material difference, and I mentioned this on the last earnings call we had is that the Affordable Care Act and the exchange community provides a potential safety net that heretofore in previous recessionary cycles we didn't have. And that, for us, we believe, is a positive. As it relates to the other aspects of our business, our demand for healthcare services tends to lag the rest of the economy and we tend to see demand in the earlier part of a recessionary cycle sort of hold, and that was when people were under COBRA benefits and so forth and then it would fade over time. But with the Affordable Care Act and the support that the exchanges provide, we're not sure how to gauge that at this particular juncture, because it's a new dynamic, but we believe it to be a favorable dynamic.\n\nSo, that would be where we are at this particular point with judging the future impact of a recessionary cycle. I think, our teams are working to with our resiliency agenda and other efforts to anticipate where they can anticipate and make adjustments where they can to put us in the best position to be successful. We think our balance sheet is strong and that should create opportunities for us to invest in certain situations and hopefully gain market share. You look at our markets as a whole, Florida, Texas, Nashville, Vegas.\n\nThese are fairly strong durable economies, we believe. It may be a little stronger than the nation as a whole. So, that can hopefully add some support as we go into a recessionary cycle potentially in the future.\n\nOperator\n\nYour next question is from the line of Kevin Fischbeck with Bank of America. Please go ahead.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nI guess, there's somewhat of a question about how we should be thinking about volume normalization. You guys are above 2019, but you're probably 4% to 7% below where you would have thought if you were to grow 2% to 3% every year up to 2019. And it looks like you're still talking about that growth rate being below average again next year. I mean, how are you -- it sounds like you're saying you think that demand in your markets is durable, but it still feels like you're getting farther and farther away from that trend line in the near term.\n\nSo, can you just help us frame how we should be thinking about that? Is it labor that is the gating factor to getting back there? Are there other things -- and how long if that trend line is the right way to think about it, I guess you can say that or not? But if it is the right way to think about it, how are you thinking about what has to happen to get us back to that trend line?\n\nSam Hazen -- Chief Executive Officer\n\nLet me make a couple of comments. I do think there is an imbalance between supply of healthcare and demand for healthcare right now, primarily because of some of the labor constraints. And people are being pushed out, they're being held up. Again, transfers are not happening as we had anticipated.\n\nSo, there is some influence to that. Anecdotally, we've heard from some of our physicians that their clinic practices are starting to recover in ways that maybe earlier in the year, they didn't recover. So that's encouraging to us at some level. Obviously, during the comparison of 2019 to today, our total joint business migrated fairly significantly to outpatient activity.\n\nWhen you look at 2019, on the outpatient side against the third quarter of 2022, we think our outpatient activity has grown 5% or 6% over that time period. Our inpatient activity is down a little bit, most of which is explained by the total joint movement. So, we were asking ourselves when you think about it, did that business go away or not. So, I think when you look at our non-COVID admission activity, which year-to-date has grown 3% and grown a little bit more even in the commercial business, it is actually sequentially growing third quarter to second quarter.\n\nThat gives us encouragement that we're moving closer to the historical trend. Again, we have a little bit of COVID influence this year because we had activity in the first quarter and a little bit of activity this quarter. But, when we look at non-COVID by itself, we're encouraged by what we're seeing. ER visits have rebounded and shown a great deal of resiliency.\n\nSo, we think it's migrating closer to the historical trend than not.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nWould you say then that the hip knee move-out is something that's unusual, or I mean there's always a shift to outpatient every --\n\nSam Hazen -- Chief Executive Officer\n\nYes, there are always some elements of it. I think that more pronounced one that we've seen in a long time.\n\nOperator\n\nYour next question is from the line of Scott Fidel with Stephens. Please go ahead.\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nQuestion just around, obviously, another one of the sort of uncertain swing factors for 2023 is just around the public health emergency and whether that gets finally pulled back or not. Can you just remind us for HCA again, just what the key impacts or benefits that you've been seeing from the PHE would be? And how that would factor into your thinking for next year, would you ultimately see the public health emergency go away? Clearly, return of redeterminations in Medicaid is probably the biggest item, but just any others as well would be helpful. Thanks.\n\nBill Rutherford -- Chief Financial Officer\n\nYes. Scott, this is Bill. I think the primary was coded add-on to the DRG payments that we've spoken about. Given the COVID volume has kind of moderated, that hasn't been material for us.\n\nSo, that's the area there. As you said, then the next area and probably more significant is just if it does -- when it does expire, what the Medicaid redetermination process will occur by various states. We've evaluated that. We've got, I think, good planning exercise around this.\n\nSo, those would be the I think consequences or effects of the PHE, not material on the DRG add-on at this point, and then we'll prepare ourselves to go through Medicaid redeterminations.\n\nOperator\n\nYour next question is from the line of Jason Cassorla with Citi. Please go ahead.\n\nJason Cassorla -- Citi -- Analyst\n\nGreat. Thanks, and good morning. Just related to fourth quarter, I guess, COVID has trended higher so far this year than perhaps your previous expectations. But, can you help on how you're thinking about COVID activity for fourth quarter and if you're thinking if it will accelerate versus this quarter? And then, also, just what your expectations are for flu trends, maybe just in guidance and for 4Q? And how we should think about what an elevated flu environment would mean for this year, maybe just in context of the current labor backdrop and versus historical flu seasons? Thanks.\n\nBill Rutherford -- Chief Financial Officer\n\nYes. I'll start with COVID. We don't have specific fourth quarter projections. As I said in my comments, we ran about 5% of our admissions in the third quarter.\n\nWe ran about 3% in the second. So, my intuition says somewhere between those areas might be an area we see in the fourth quarter on there. In terms of flu volumes, again, we haven't made any specific projections for flu, but clearly, we're paying attention to the flu volumes that are out there in the anticipation that it might be a busy flu season. But I don't think that necessarily changes the trajectory of our fourth quarter compared to what we previously thought.\n\nOperator\n\nYour next question is from the line of John Ransom with Raymond James. Please go ahead.\n\nJohn Ransom -- Raymond James -- Analyst\n\nHey. Good morning I'm just thinking about sequential labor trends from 3Q to 4Q. And I heard you say you gave the 5% -- 4% update in 3Q. Does 4Q look flattish if your account for maybe continued reduction in temp labor, or if you hit a plateau in that 7 percentage range that you talked about?\n\nBill Rutherford -- Chief Financial Officer\n\nWell, I think it's something we're going to have to see that -- the contract labor levels, we feel good about, not only the progress we've made this year, as you know, we hovered around 9% in the early part in terms of contract labor percent of SWB down to 7%. We think we can stay in that range for the balance of the year. And so, yes, I think we feel generally positive about the labor environment we're in. Too early to call specifically about is it flat, is there some growth.\n\nBut I think we think can hold the majority of the contract labor trends, some incremental improvement with utilization as we continue to see recruitment and retention improve. So again, I think we'll just have to see how it turns out, but we're feeling positive about the labor agenda at this point.\n\nOperator\n\nYour next question is from the line of Joshua Raskin with Nephron Research. Please go ahead.\n\nJoshua Raskin -- Nephron Research -- Analyst\n\nI was wondering, Bill, if you could give us an update on your returns that you're seeing on your capital expenditures, maybe how you're thinking about spend into 2023. And maybe related to capital, anything we should read into the lower share repurchases in the last quarter here?\n\nBill Rutherford -- Chief Financial Officer\n\nNo. This is -- I don't think there's anything you should read into that. And in terms of capital returns, we continue to see good projects to deploy capital. We continue to believe our total capital spending this year will hover around $4.2 billion.\n\nWe're in the planning stages for next year, but I anticipate it stays materially in that range. And I think that is an indication of the opportunities we continue to see to put capital to work, to meet what will be a growing demand in both, inpatient capacity as well as outpatient and program development. And again, I think with the cash profile of HCA, we've got a pretty balanced allocation of capital. The balance sheet is in a great position.\n\nI think our share repurchase program this year will hover around $7 billion for the full year. So, again, I think it's strong allocation of capital. We're intending to drive reasonable returns going forward.\n\nJoshua Raskin -- Nephron Research -- Analyst\n\nAnd Bill, I think you've said in the past something around north of 15% total, total return on capex, including maintenance and growth. Is that still the right range? Are you guys still generating sort of mid-teens returns on those capex projects?\n\nBill Rutherford -- Chief Financial Officer\n\nYes. I mean, obviously, each project varies. But when I step up and look at our overall return on invested capital, we're in the high teens. So, that we're encouraged by the net effect of all of our investment decisions.\n\nOperator\n\nYour next question is from the line of Jamie Perse with Goldman Sachs. Please go ahead.\n\nJamie Perse -- Goldman Sachs -- Analyst\n\nI wanted to see if you could talk about length of stay. It's still quite elevated versus 2019. What are the key bottlenecks you're facing, both on inpatient throughput as well as discharge? Do you think those will go away over the course of 2023? And what does that mean in terms of your capacity expansion and also managing costs on a per patient day or per admission basis?\n\nSam Hazen -- Chief Executive Officer\n\nI think one thing. This is Sam. That's important to understand. Our length of stay is up over 2019.\n\nBut our case mix is up even more. So, when you look at our length of stay on a case mix adjusted basis, it's actually down. So, that's encouraging. Now, we have opportunities.\n\nWe have significant opportunities, we believe, with better case management protocols, better use of technology, better partnerships with subacute providers and our own providers in that space to really improve the throughput in our facility. Just this past week, actually, we had an update on our case management agenda, and we continue to be encouraged by the progress incrementally that they're making. And we think as we move on into 2023, that will continue. That is a key part of our capacity management and labor management as well.\n\nSo, it's got a lot of efficiencies connected to it. But, we have significantly increased our case mix over 2019, and that's influenced our length of stay somewhat as well. But, I believe our overall program, which is a key ingredient to our resiliency effort is, in fact, adding value and will continue to add value for our patients as well as for the efficiency and the throughput within our facilities.\n\nOperator\n\nYour next question is from the line of Calvin Sternick with J.P. Morgan. Please go ahead.\n\nCalvin Sternick -- JPMorgan Chase and Company -- Analyst\n\nYes. Hi. Thanks for squeezing me in. I think you noted the impact that capacity had on volumes in the quarter.\n\nJust curious, I guess, one, if you think that's going to be relatively consistent going into the fourth quarter? And then, it looks like same-store ER visits picked up a bit sequentially. Just curious, are you starting to see some more episodic care start to bounce back in that setting? And has there been any shift in the payer mix you're seeing there? Thanks.\n\nSam Hazen -- Chief Executive Officer\n\nWell, we will still have some capacity constraints in the fourth quarter. I'm hopeful that we will relieve some of it with our recruitment agenda and the fact that we're adding more headcount and opening beds. I think also, as I just mentioned, our case management efforts will create capacity for us as well. So -- but I do anticipate us having some closures here and there with respect to being able to take new patients at certain times.\n\nIt just unfortunately happened at this at this particular point. And it happened pre-pandemic, but on a much lower level than it is today. As it relates to the ER, we've been impressed by how resilient our emergency room services are. We continue to work on our operations and our throughput within our emergency rooms so we can take care of people as they deserve to be taken care of.\n\nWe've added capacity with our overall platform of emergency room offerings inside of our hospitals as well as some of our freestanding facilities, and that's been important to our outreach in that area. We believe fundamentally that the emergency room is a key ingredient to the healthcare system overall, and it provides a very important 24/7, 365 capability for our communities. And so, we're still investing, as I mentioned, in our emergency rooms in very selective ways in order to make sure that we have the right supply available for what we believe to be growing demand.\n\nOperator\n\nYour next question is from the line of Stephen Baxter with Wells Fargo.\n\nStephen Baxter -- Wells Fargo -- Analyst\n\nI wanted to ask about the mix of outpatient revenue in the quarter. It looks like that stepped down a bit more than you might have expected in a typical year. What should we think about as the key drivers of that? I guess, with some distance, does it look like Q2 might have benefited from some pent-up demand? And it doesn't sound like it based on your comments, but any impact you'd flag from outpatient surgeries moving back to inpatient at least maybe compared to earlier in the year? Thank you.\n\nBill Rutherford -- Chief Financial Officer\n\nNo, I don't think there's anything structurally. I think the outpatient of revenue last year was busy during the Delta COVID -- the Delta surge and inpatient capacity was being managed and constrained and potentially, we saw more activity in outpatient of second quarter last year. But in terms of sequential trends, we don't see anything structurally different going on between Q3 and Q2 on outpatient trends.\n\nOperator\n\nAnd today's final question comes from the line of Sarah James with Barclays. Please go ahead.\n\nSarah James -- Barclays -- Analyst\n\nHi. Thanks for squeezing me in. Has there been a lift to acuity mix in '22 from some of the low acuity falling off related to consumer reactions, either COVID or the economy? And what would that do to revenue per admission as it normalizes? And then, just a quick clarification. Earlier you mentioned the 24 payer contract has labor cost escalators, can you clarify if that's a static or dynamic? Because I think some of the acuities we're talking about dynamic escalators coming in to reflect labor cost fluctuations.\n\nSam Hazen -- Chief Executive Officer\n\nThis is Sam. I'll answer the last question. Most of our inflators are static. We do have some contracts that have corridors, if you want to call that, or dynamic components to it with respect to inflation.\n\nSo, most of our 24 will be more of a static inflator that we negotiate on the front end. And so, that's how most of our contracts are structured.\n\nBill Rutherford -- Chief Financial Officer\n\nYes. In terms of the case mix, I mean, we're seeing some growth in our no-COVID case mix trends. We've been -- case mix has been stable for us. So, we haven't noticed any remarkable decline in that.\n\nIn the COVID business, obviously, COVID ran a higher case mix in our non-COVID, so that's been a factor. But, when we look at basic trends or the acuity levels have been stable, but mostly between Q3 and Q2. So, we're reading that as a fairly positive indicator.\n\nSarah James -- Barclays -- Analyst\n\nOK. So there's not a falloff of low acuity non-COVID just from people either worried about the economy or COVID that's kind of...\n\nBill Rutherford -- Chief Financial Officer\n\nNo, we're not seeing anything of that trend at this stage.\n\nOperator\n\nAnd at this time, there are no further questions. Please continue with any closing remarks.\n\nFrank Morgan -- Vice President, Investor Relations\n\nDennis, thank you so much for your help today. Thanks, everyone, for joining us on the call. Hope you have a wonderful weekend. I'm around this afternoon, if I can answer any additional questions.\n\nThank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nFrank Morgan -- Vice President, Investor Relations\n\nSam Hazen -- Chief Executive Officer\n\nBill Rutherford -- Chief Financial Officer\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nAnn Hynes -- Mizuho Securities -- Analyst\n\nJustin Lake -- Wolfe Research -- Analyst\n\nGary Taylor -- Cowen and Company -- Analyst\n\nAndrew Mok -- UBS -- Analyst\n\nWhit Mayo -- SVB Securities -- Analyst\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nLance Wilkes -- AllianceBernstein -- Analyst\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nJason Cassorla -- Citi -- Analyst\n\nJohn Ransom -- Raymond James -- Analyst\n\nJoshua Raskin -- Nephron Research -- Analyst\n\nJamie Perse -- Goldman Sachs -- Analyst\n\nCalvin Sternick -- JPMorgan Chase and Company -- Analyst\n\nStephen Baxter -- Wells Fargo -- Analyst\n\nSarah James -- Barclays -- Analyst\n\nMore HCA analysis\n\nAll earnings call transcripts"
}