{
  "companyName": "SmileDirectClub, Inc.",
  "companyTicker": "SDC",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/smiledirectclub-inc-sdc-q2-2022-earnings-call-tran/",
  "content": "SmileDirectClub, Inc. (SDC -1.65%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:00 a.m. ET\n\nOperator\n\nGreetings and welcome to the SmileDirectClub second quarter 2022 earnings call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions].\n\nAs a reminder, this conference is being recorded. I would now like to turn the call over to Jonathan Fleetwood, director of Investor Relations. Thank you, you may begin\n\nJonathan Fleetwood -- Director, Investor Relations\n\nThank you, operator. Good morning. Before we begin, let me remind you that this conference call includes forward-looking statements. For additional information on SmileDirectClub, please refer to the company's SEC filings, including the risk factors described therein.\n\nYou should not rely on forward-looking statements as predictions of future events. All forward-looking statements that we make on this call are based on assumptions and beliefs as of today. I refer you to our Q2 2022 earnings presentation or description of certain forward-looking statements. We undertake no obligation to update such information except as required by applicable law.\n\nIn this conference call, we will also have a discussion of certain non-GAAP financial measures, including adjusted EBITDA and free cash flow. Information required by Regulation G of the Exchange Act with respect to such non-GAAP financial measures is included in the presentation slides for this call, which can be obtained on our website. We also refer you to this presentation for reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. I'm joined on the call today by chief executive officer and chairman, David Katzman; and chief financial officer, Troy Crawford.\n\nLet me now turn the call over to David.\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nThanks, Jonathan. And good morning, everyone. Thank you for joining us today. I want to start off by congratulating Troy Crawford on his official appointment as CFO.\n\nTroy has made numerous contributions to SDC over the past couple of years, most recently in driving efforts around focused investments and financial discipline. In addition, I want to take this opportunity to welcome both Linda Williams, and Alex Dimitrief to our board of directors. Both Linda and Alex come to us as accomplished executives in their respective fields and will bring invaluable perspective as we navigate this environment and phase of our business. I'd also like to thank the contact center team for quickly returning our service levels back to their targets by the end of May.\n\nAs we discussed in our Q1 call, transition challenges in our contact center temporarily impacted our ability to deliver our customers with the level of care that they have come to expect from our brand, and this challenges were reflected in our Q1 NPS reading. While our next NPS reading isn't until Q3, internal metrics continue to point to improving trend that we expect will be reflected to our next quarterly NPS update. In addition, our internal branch record indicator have shown improving quarter-over-quarter for the U.S., which further indicates that the work of our context on our team is paying off for our costumers. Our ability quickly resolve those context on our challenges, and substantially complete all other initiative we implemented at the start of Q1, have been able us to achieve more than $120 million in annualized cost saving.\n\nAs we've seen in the past few months, the timing of this transition was critical and later the uncertainty were all facing today's running the state of the consumer and trends the consumer discretionary spending, While we were encouraged coming into the year with our Q1 shipment lift over Q4, challenges our consumer spending were accelerated during Q2. And for our business, this acceleration begin to materialized in the back half of the quarter. We did not like to comment amount in order trends, but we believe it is important for our investors to understand that additional evaluation interest remain relatively stable heading into May. However, aligner order trends begins to slow in mid-May before dropping further in June.\n\nDuring this time, we saw traffic to our insurance based increase over a year-over-year basis as we expect more costumers were actively looking for ways to supplement their purchase, Our take away here is that the demands for our products remain strong, but strains on consumer spending continue to hurt our ability to convert at the level that we need  to drive the revenue growth. Challenges to consumer spending [inaudible] has been anticipated during this quarter, which when combine with reduced stimulus, sustain high inflation, and a shift on discretionary spending toward services, result in a less predictable demand occurs. I'm pleased to report that our cost cutting initials in Q1 were paid off during the last quarter, and we were able to improve both adjusted EBITDA  and free cash flow by $11 million and $41 million respectively. Despite consumer spending decreases result on our top line being down quarter-over-quarter by $26 million.\n\n[Inaudible] can also be seen if you look at our performance year-over-year. While revenue was down $48 million relative to Q2 of 2021, we were able to sustain adjusted EBITDA during Q2 of 2022 with approximately $700 thousand of what we achieved in 21. Troy will go on to the details on how we were able to achieve these results during the quarter, and I do want to thank the team again for their tireless effort during the past 2 quarter to further optimize our business operations. With leverage operating model, these result reflects much [inaudible] organization has better position to achieve profitability with modest top-line growth.\n\nAll this [inaudible] and efforts of a lot estimates meaningful progress in positioning our business toward profitability, we recognized that we engaged in top-line growth through innovation is just as important as long term success of our business. From the beginning, innovation is been occurred to achieve in our vision, and as critical to the next phase of our growth in ability to deliver shareholder value. Our vision and mission are much greater than the manufacturer in marketing clear aligners. The inspirational vision of our organization is to be the world's leading oral health brand, by helping more people realize the life changing potential of confident smile, With that vision, our mission is always been democratize access to smile each in every person loves.\n\nAnd for us to realize our vision through our mission, we must expand our reach within and beyond our existing core costumer-based. This is where we focus on our partner network, aligner product innovation, SDC+, oral care, and shop expansion fits on to what we do. [Inaudible] comes to continuously bringing transformative innovation to the market across the entire portfolio both consumer facing and non-consumer facing innovations. As you see in our investor presentation, our innovation portfolio includes innovation through out the journey and at the product level.\n\nAnd over the last 8 years, continuous investment across the portfolio have a lot of consistently deliver in all categories. Recently, we continue to make progress on making it easier to get started with the overall experience to our partner network and SDC+ efforts. We ended the quarter with 690 locations, and have seen meaningful increase in submissions per practice, driving total submission growth of more than 75% quarter-over-quarter, and nearly 170% versus Q4 of 21. While partner network is still a relatively small contributor to our top-line.\n\nThis foundation is exactly what we need in place for us to further lean into our SDC+ offering, which will be exclusively available either in a SmileShop within a dental practice or through our partner network locations. The SDC+ offering was designed to specifically target the higher household income consumer. In our intense qualitative and quantitative research, we learned that higher income consumers will be far more attracted to our brand at a premium price when paired with greater access to a general practitioner throughout treatment. We believe the offering that we've designed, which includes access to a local GP on an in-office basis, greater access to care through our telehealth platform, retainers for retention after treatment, and other SDC products is perfectly designed with the consumer's needs in mind.\n\nBut these additional services, which are augmented by our proprietary tech platform, we anticipate being able to price this offering at $39 hundred, which improves not only the economics to us and our partner offices, but also enables us to provide this enhanced access to care while remaining price competitive with a premium service. The SDC+ pilot is currently on track to launch in select partner network markets in late June for this year or early Q1 of 23. This is the first time since we launched SDC that we will offer a choice for our customers, depending on the service level that they desire. We're extremely excited about what this offering means for our customers, our partner network GPS, and our business.\n\nWe will continue to keep you updated on the progress of the pilot and the results were seen as we enter those markets in the quarters ahead. While we make it as easy as we can to get customers started with our kit and scan options. The journey to purchase today is not ideal. It is still too difficult and requires too much from our customers before they get to see their new smile and purchase.\n\nWhile using kit and scan has been a viable starting point to get us in the market. It was always a temporary solution until we were able to develop breakthroughs with AI technology that allow customers to use their smartphones to get started and purchase in a matter of minutes. I think it's important to illustrate the magnitude of the drop-off we experienced with the current kits and scans process. When looking at our current website traffic to purchase via, today we have 46 million visitors to our site each month with around 2.5% of them converting to an aligner order after falling out over multiple weeks across several touch-points in the journey.\n\nWe have illustrated this point in our investor deck. Based on today's volumes, which is a small improvement of 25 basis points in our site conversion, we would expect more than $200 million additional line of revenue, up to $160 million in additional adjusted EBITDA on an annualized basis. And when benchmarking other E-commerce businesses, this conversion rate should be closer to 2% to 3% of web visitors converting to aligner order, which is 4 to 6 times where we are today. The demand in here is incredible, and we view closing the GAAP on our site conversion is one of the most significant near-term opportunities ahead of us today.\n\nWhile we've made continued strides to improve the journey and reduce the fallout between site, visit and purchase. The vision all along was to have the AI capabilities to use the power of your smartphone. To get an accurate scan and reduce the friction points for customers to buy their new smile. This is why we're currently in the process of finalizing development of our mobile 3D scanning application, what we call our Smile Maker platform, which is our proprietary patent pending phone based scanning app, that allows customers to see their draft custom treatment plan of how their teeth will move, and how long it will take, and then purchase within minutes of downloading our free app.\n\nThis technology delivers on the original vision of our founders for making it easy to get started with treatment, and no other clear aligner option out there can do what we're developing. It has taken years of modeling and machine learning with dozens of AI engineers and Ph.D. scientists to finally get to this point. This transformative experience takes the gantlet between site visit and purchase of exist today out of the equation.\n\nWe believe the potential lift in conversion here is significant. Our initial Smile Shop rollout in 2016 to new market serves as a good reference point for what the opportunity is here. Prior to shops, customers only had impression kits available to start their journey. With the introduction of smile shops, we gave people an alternative channel with a better experience that provided treatment plans more quickly.\n\nAnd when we initially rolled out our shops, we immediately experienced more than a two times lift in sales, none of the controlled markets with the same marketing spend. Similar to shops but on a much greater scale, we believe the opportunity with our Smile Maker Platform is going to be a significant growth [inaudible] for our business. Again, with no change in web traffic or marketing spend, a 25 basis point increase in our site conversion would generate more than $200 million additional line of revenue, and up to $160 million in additional adjusted EBITDA on an annualized basis. Mobile 3D scanning capabilities were always part of the original vision and have been a considerable part of our R&D efforts for more than three years.\n\nFrom the beginning, we knew that it would take years to capture a critical mass of data for the AI to work. And now, with more than 1.7 million smiles and more than 3 million treatment plans in our database, our AI team has worked tirelessly to bring this to market. This technology is right around the corner, unmatched by any other clear aligner provider today, and has the power to completely change the trajectory of our business and the experience of our customers. Current project plans target to launch later this year in on of our smaller international countries with a fast following in the United States by the end of Q4 or early Q1.\n\nWe are extremely excited about this offering for the world to experience and we'll be keeping you updated on progress in the quarters ahead. As you can see, we've been able to deliver so much in a short period with our amazing team of accomplished executives, fully committed, hardworking team members, PhDs, material scientists, and  AI engineers. When we combine these elements grounded innovation with rigorous financial discipline, we believe we have a winning formula for achieving our full potential and maximizing shareholder value. This is the beginning of transforming SDC from a marketing led company to drive growth to a technology innovation led company, with a steady pipeline of new and innovative products to drive growth We plan on introducing new iterations and releases to our AI work, as well as new materials for aligners and oral care products.\n\nAll of which, we will be discussing in an upcoming Investor Day. We plan to hold in our manufacturing facility in Nashville at the end of the year or first quarter of 2023. I've said it many times before, but I think it's worth repeating. With an annual TAM of 500 million customers worldwide, and only 4% to 5% of them taking advantage of teeth straightening.\n\nThe opportunity here is massive. Despite the limitations of serving those customers today, we've been able to help more than 1.7 million customers get the smile they love while saving them over $5 billion. I'm 100% committed to seeing this business succeed and look forward to sharing more in our progress. With not only our Smile Maker Platform, partner network and SDC+, but also across our innovation portfolio in the quarters ahead.\n\nAnd now I'll turn the call over to Troy, who will provide more detail on our Q2 financial results and full year outlook. Troy.\n\nTroy Crawford -- Chief Financial Officer\n\nThank you, David. I will jump right into our results for the quarter. Please be sure to review our supplemental materials posted to our investor website, which provide additional details on everything I will cover. Revenue for the second quarter was $126 million, which is a decrease of 17% sequentially and 28% on a year-over-year basis.\n\nThis was primarily driven by a worsening of the macroeconomic conditions and increasing inflation, which has been particularly difficult for our core customer. We shipped approximately 63,000 initial miners in the quarter, down 18% sequentially, at an ASP of 1917. ASP increase of $27 over the first quarter was primarily driven by price increase implemented in the U.S. in May, and in the U.K.\n\nin late June. With additional geographies targeted for increases during the second half of 2022. Our year-over-year revenue results are largely reflective of what we have seen play out in the economy over the last 12 months, combined with challenges associated with privacy changes coming from [Iinaudible] 14 rollout that really started to take shape in Q2 of last year. Providing some details on the other revenue items.\n\nImplicit price concessions were 10% of gross revenue, down from 11% in the first quarter. We do expect see as a percentage of gross aligner revenue to trend back toward our historical levels between 9% and 10%. As we have seen no significant deterioration in the quality of the portfolio. The fluctuation in the quarterly IPC percentage is impacted by the overall level of revenue recorded in the period, as well as the rebalancing of reserves.\n\nAs we've mentioned in prior quarters, we maintain separate reserves for IPC and cancellations. We analyze and regularly rebalance those reserves based on current information. While our second quarter revenue was impacted by the continued macro headwinds affecting our customers, our restructuring plan implemented in January is driving meaningful improvements in our cost structure and free cash flow. Despite a $26 million sequential drop in revenue from the first quarter of 2022, we improved it by $11 million and improved free cash flow by $41 million.\n\nCompared to the second quarter of 2021, despite a $48 million reduction in revenue, we saw less than a $1 million decrease in EBITDA and free cash flow with $17 million better. Reserves and other adjustments, which includes impression kit revenue, refunds, and sales tax came in at 8% of gross aligner revenue, compared to 7% in the first quarter. Financing revenue, which is interest associated with our small pay program, came in at approximately $9 million, which is in-line with Q1, but down approximately $3 million year-over-year due to the lower accounts receivable balance. Other revenue adjustments, which includes net revenue related to retainers, whitening, and other ancillary products, came in at $18 million or 14% of second quarter revenue.\n\nOther revenue and adjustments were down sequentially due to the launch of our new whitening strips and strength of initial orders in the first quarter. Now turning to small pay ,in Q2, the share of initial purchases financed through our small pay program came in at approximately 61%, which is in line with historical levels. Our small pay program is an important component to drive affordability with our customer base, And overall, small pay has continued to perform well. With our delinquency rates in Q2 consistent with prior quarters.\n\nWhile admittedly, our core customer has had difficulty with the macro environment, the fact that we keep a card on file, and have a low monthly payment gives us the confidence that small pay will continue to perform well. Despite the macro headlines in the market, we have not seen an increase in our delinquency rates in our small pay portfolio. Turning to results on the cost side of the business. Gross margin for the quarter was 73%, which was 131 basis point increase from the first quarter, despite lower revenues that reduce operating leverage.\n\nThis gross margin increase was driven by improvements in labor efficiency, along with other cost control initiatives. Our team will continue to focus on efficiencies to drive solid margins across the business, and will see further improvements as the top line returns to growth and we get the added benefit from operating leverage. Marketing and selling expenses came in at $71 million or 57% of net revenue in the quarter, compared to 64% of net revenue in the first quarter. The sequential decrease as a percent of revenue is primarily the result of a heightened focus by our teams on driving increased marketing efficiency across platforms coming out of Q1 and Q2.\n\nWhen we see demand typically soften. A key focus for 2022 is seeking to find efficiency in our spend. We have been experimenting more with pulsing spend with targeted dark weeks versus having an always on strategy and our top of funnel channels such as TV, which allows us to take advantage of our 60% aided awareness and optimize our marketing spend. It is important to keep in mind that digital marketing is a highly fluid process that requires daily discipline of spend analysis, assessment, and reallocation.\n\nWe're always testing and analyzing new channels and the impact of channel mix among all segments. With a targeted focus on efficiency and quality leads, we are continuing to calibrate spend across a diversified platform-based in order to optimize continuously through the period to achieve the optimum balance of high funnel leads, and bottom funnel aligner sales. On SmileShop, we had 118 permanent locations as of quarter end, and held 114 pop-up locations over the course of the quarter, for a total of 232 location sites, with a net increase of 8 shop locations from the first quarter. The increase in shop locations was split evenly at 4 each between the U.S.\n\nand international markets. We will continue to strategically expand our shop footprint to locations that support incremental demand without cannibalizing sales from existing channels. We are encouraged by the early results of this deployment strategy, and expect to continue these measured shop expansions for the balance of the year. We now have 690 North American partner network locations that are active or pending training, increasing our footprint from Q1.\n\nPartner network team has been extremely focused on tightening the model to maximize engagement and productivity within active practices, and we've seen positive momentum on productivity throughout the year. As David mentioned, we have seen momentum through increases in submissions per practice, which has driven total submission growth of more than 75% over the first quarter, and almost 170% versus Q4 of 2021. Growing partner network footprint will not only scale our operations for current submission trajectory, but it will also serve as a key channel when we begin scaling our SDC+ premium service offering to the market in 2023. General administrative expenses were $72 million in Q2, compared to $71 million in the first quarter.\n\nG&A expenses decreased $3 million when excluding stock-based compensation. and depreciation. and amortization costs quarter over quarter. Excluding these same items when compared to the prior year, G&A is down approximately $14 million as a result of cost savings initiatives taken back in January this year.\n\nOther expenses include interest expense of $4.5 million of which $2.9 million is related to our new secured debt facility issued in April, and $1.3 million is related to deferred loan costs associated with the convert we issued in 2021. Additionally, one time costs related to leasing abandonment impairment and other store and restructuring costs was $3.2 million, consisting primarily of costs related to our January restructuring actions, including costs associated with severance and retention, as well as store and facility closure costs related to our international operations. We also incurred $5.8 million and other expenses, primarily related to the impact of unrealized foreign currency translation adjustments. All of the above produced adjusted EBITDA of -$23 million in the second quarter, which is an $11 million improvement over the first quarter, despite a $26 million decrease in revenue.\n\nOur second quarter net loss was $65 million compared to a Q1 2022 net loss of $73 million. Breaking out adjusted, even though regionally the U.S. and Canada came in at -$13 million. and rest of world adjusted EBITDA was -$10 million.\n\nMoving to the balance sheet. We ended the second quarter with $158 million in cash and cash equivalents, $222 million in net accounts receivable, and $65 million drawn on our new $255 million debt facility with HPS. Cash from operations for the second quarter was -$18 million. Cash spent on investing for the second quarter was also $18 million.\n\nFree cash flow for the second quarter defined as cash from operations, less cash from investing was -$36 million, which is a $41 million improvement over the first quarter of 2022. This amount represents the strongest free cash flow in any quarter since Q3 of 2020, as the cost saving and efficiency measures we've been discussing have started to show effects. In fact, we delivered better free cash flow than Q1 of 2021. We reported our best revenue quarter ever at over $199 million.\n\nAs we have discussed, we continue to see macroeconomic challenges that are impacting our customers willingness to make a purchase decision. Without any signals of improvement in the near term, our outlook shows a trajectory of lower aligner orders for the remainder of 2022. Based on this view, we are revising our full year 2022 guidance, which assumes no material impact from currency fluctuations and includes all incremental investments for the year associated with partner network, and incremental shop expansion. This guidance also does not include any material impact from the launch of our Smile Maker platform in the back half of the year.\n\nSmile Maker could have a meaningful impact on our conversion rate as the purchase of the aligners is accelerated and the customer journey reducing between 1 to 3 weeks of time, between scan to treatment, plan, review, and purchase. This will help effectively manage funnel drop offs, which should lead to impactful potential sales increases. You can see this funnel conversion highlighted in our earnings deck posted on our investor website. This increase in conversion requires no additional marketing, so any increase will impact EBITDA at a very efficient rate.\n\nFor full year 22, we now expect to deliver revenue between $450 and $500 million gross margin between 69.5% to 71.5% based on reduced operating leverage due to lower top line. Adjusted EBITDA between -$180 million and -$140 million, driven mainly by top line results. Our CapEx outlook remains the same at $60 to $70 million, and our onetime costs from our reorganization action in January remains the same between $20 and $25 million. We have added guidance on our year-end cash balance with a range of $120 to $160 million, which is dictated by our financial results and includes expected borrowings on our existing credit facility.\n\nWhile the second quarter came in at the bottom of our guidance range, we have taken some significant measures to strengthen our balance sheet with a new credit facility that was put in place in early Q2. We also on track with the cost cutting measures we initiated at the beginning of the year to right size the organization, and it put in place additional efficiency initiatives to lower costs to offset the impacts of lower volumes. All of these initiatives have played a role in contributing to what we're experiencing with better adjusted EBITDA trends in the quarter. In this very challenging environment, we are extremely focused on operating efficiency to offset the impact of the macroeconomic environment.\n\nWe are also on the cusp of launching a couple of very important new initiatives in our Smile Maker platform and SDC+, which could have a material impact on the company results. I would like to turn the call back over to David for some closing remarks.\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nThanks, Troy. In spite of the macro business challenges we've been facing, I'm extremely encouraged by what's ahead in the innovation we're bringing to market. From the very beginning, our vision has been to allow people to start the journey to get a smile they love from a device in the palm of their hand. We look forward to sharing more exciting updates regarding our technology innovations, including our SmileMaker platform and SDC+, along with other innovations over the coming months.\n\nThank you for joining today. And with that, I'll turn the call back over to the operator for questions-and-answers.\n\nOperator\n\nThank you. We will now be conducting a question-and-answer session. [Operator instruction] One moment please, while we poll for your questions. Our first question comes from the line of Jon Block with Stifel.\n\nPlease proceed with your question.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nThanks, guys. Good morning, Troy, maybe one for you, several questions to David, then I'll circle back. Troy the $120 $160 cash year end,is that assume the full drawdown on the 255 securitization. facility? I think I've got that number right.\n\nAnd then let me just tack on a couple more. Just any thoughts around 3Q, 4Q, [inaudible] and maybe one more to just tack on that, the 2023 EBITDA positive that I think you guys have previously alluded to. Is that still intact? And then I'll just ask my follow up to David after. Thanks.\n\nTroy Crawford -- Chief Financial Officer\n\nYeah, to start with the the cash balance. So $120 to $160 is what we're targeting at the end of the year. It does include an assumption of some borrowings on our facility, but a lot of things will go in number, including  kind of what the revenue number is for the back half of the year, as well as some of the cost savings initiatives that we're working on as well. Also, we're being opportunistic in the marketplace around what could be available.\n\nSo we've kept kind of our our contacts in place. And to the extent that we can drive more liquidity in the marketplace, we will do that. So there's a lot of factors that go into that, that include some draws, I would say, but I don't think it takes all of that and certainly a lot of other factors involved to get to the full cash balance. From a cadence standpoint, I would say, we don't generally give quarterly guidance, but I would say, you can kind of split it up pretty evenly, I would say.\n\nBut I don't know, depending on how the market overall market goes and what the macroeconomic looks like, it could be a little different between quarters. But I think you can safely kind of split it. And then your final question was on 23 EBITDA, I believe, obviously, we're still sticking to our long term guidance, which includes the mid-teens kegger that goes out to 26. We do feel like that's relatively conservative when we think about getting back to 2019 volumes by 2026, but it's not going to be completely linear.\n\nYou know, we have big initiatives that we're launching toward the back half of this year,  which we believe can be meaningful to the impact of 23 earnings. That I think as we get closer to 23, we'll be able to give more specific guidance about that EBITDA number for 23. But right now, we're sticking with our longer term guidance.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nOK. Very helpful. Maybe, David, just on the follow-up, you talked to the trends throughout the quarter. Your cases were down, I think high teens sequentially.\n\nBiggest player was [inaudible] sequentially, give or take. There was a smaller player up 20% to 30%, Q over. Q. Maybe your average household income is a little bit lower than the others.\n\nBut it just seems very different from some of the figures we've seen from the other major, clear aligner players in the industry. So maybe if you can speak to that, is this all a function of your lower end, you know, household income consumer. Or is there more to it around the NPS, on demand in a couple other things. Thanks, guys.li\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah, Jon. Definitely it's not  results of NPS. We quickly corrected that action. As I mentioned in my prepared remarks with our context center.\n\nAnd we'll report on that new NPS score in Q3. It really is a function of our core demographic is $65 thousand a year, which was hit the hardest by this compounded inflation effect. And we saw it accelerate in Q2, as we stated. When you talk about comparison companies in [inaudible] space, they're targeting a much higher income consumer.\n\nThe $5,000 plus ASP, so there is a difference in part of our new initiative to go after that higher household income will help. We're not abandoning our core customer, we think specially with the new tools that we have in our Smile Maker Platform, we're going to be able to convert at a higher rate, even when demand is down, the conversion will be higher if you don't have to go through that gantlet, as we talked about with kit and scan. So it's finally here, it's very exciting times for us. We've been waiting for this for years.\n\nIt was always the founding vision of how to go to market, using this kind of technology. I'll tell you, Jon, other businesses I've disrupted, we've had the same issues where it takes time to develop the tools that fit your go to market strategy, and in order to grow prior to having these innovative tools, we were more of a marketing led company. And what you're seeing is the beginning shift. This is the first time we're talking about our Smile Maker platform with the leading mobile 3D scanning device.\n\nYou're going to see a shift now from our ability to grow, which has been marketing led to innovation led. There's a pipeline of innovations that will continue to come out in the marketplace on both the scanning side,materials side, new materials for aligners, all kinds of new stuff, which is truly what this company was build for, the innovation. And have you in for our Investor Day, which will be the first one we've had since we went public in 2019, you'll see we're going to open the hood, you're going to see, and I think you'll be really surprised that the innovations, that technology, our manufacturing facility in [inaudible] can be very exciting for our investors and analysts to come in and take a look.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nIt's great. Helpful color. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from the line of Robbi Marcus with J.P. Morgan. Please proceed with your questions.\n\nLilia-Celine Breton Lozada -- J.P. Morgan -- Analyst\n\nHi. This is actually Lilia on for Robbie. Thanks so much for taking the question. I thought you guys implemented a price increase in the quarter, so just given how sensitive your core demographic has been to these inflationary headwinds, have you seen that price increase affect demand? And how should we be thinking about price trending over the rest of the year?\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah, I could take that one. It was a 4% to 5% price increase depending on the country. It's still not fully rolled-out, we slowed to more countries. It is rolled out in the U.S.\n\nand we didn't see any type of conversion detriment at all. On the Smilepay side, which is really about the affordability, we kept the $89 per month and we just extended two months of the term. So instead of 24-months is 26-months. So for that price, kind of just consumer still very affordable.\n\nIt's the least costly option out there if they want to straighten your teeth. Prior to COVID, we have been taking regular price increases and we saw the exact same thing when we took it this time, no fall off and conversion. At the end of the day, demand is down, right? We've adjusted our marketing spend accordingly are. People just aren't spending on discretionary items, especially goods versus services.\n\nAt 65 thousand, all your customer is doing everything they can with almost 10% inflation now to stay on top of their expenses. So, demand down, conversion about same, and so as far as price increase didn't hurt the business at all.\n\nLilia-Celine Breton Lozada -- J.P. Morgan -- Analyst\n\nGot it. That's helpful. And then as a follow-up, moving into the higher income demographic is obviously a big strategic separate eyes and puts you up against some of the bigger competitors more directly. So are there any metrics you can share on the success of the Challenger campaign so far and how well you've been winning in this higher income market? Thanks so much.\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYes, the challenger campaign was something that was really a marketing story to really alert the world and the consumer who is interested in this training that you're paying a three time markup for a similar type of service. Or we did find through, as we stated, some really intense quality quite research. That consumer likes the telehealth platform, but doesn't want to have a pure telehealth play. And to play in that market for the higher income consumers, to be able to have a physical location that they can go to, especially to start their journey.\n\nThey want they want to see a GP [inaudible] in an office, get an exam and then use that telehealth platform in addition to the brick and mortar for convenience, for added services 24 seven coverage. And so that's what our SDC+ does. It's a premium price. It's the first time since we launched we'll have two different price points over $2,000 telehealth, pure telehealth play.\n\nIn SDC, we'll have a $39 hundred price point. And that was tested in our research as well. What is the right price point? consumer felt that there was still a value to the current offerings out there at $5,000 plus. Because what you're getting, you're getting the exact service that you're getting at the brick and mortar, you can have the doctor involvement.\n\nYou can go if you never want to interact with our. Telehealth platform, you don't have to. There's no requirement. But what we saw in the research is that people tend to start their journey at the brick and mortar.\n\nGet introduced to the doctor. Then also you'll have a second. doctor on your case, our telehealth, Ortho or GP, and then a dedicated success team 24/7 access ability to upload and monitor yourself from home. So there is no need to.\n\nGo back into that office if you don't desire to do so. We think the research shows that this is the offering that the consumer wants this this dual access to both a brick and mortar and a telehealth play.\n\nLilia-Celine Breton Lozada -- J.P. Morgan -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Erin Wright with Morgan Stanley. Please proceed with your questions.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Can you speak to the traction with your partner network? It looks like it ticks slightly higher quarter-over-quarter. And the stickiness of those relationships in the feedback and engagement level of the practitioners.\n\nAnd how do you think the practitioners respond to innovation like the Smile Maker platform? And just on that platform, does it you still need a separate skin, I guess. How did the logistics work, and what do you need in terms of regulatory approval, and when will that materialize for you in terms of meaningful financial contributions?\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah. A lot of question there. So let's start with the partner network location. so partner launched ahead of SDC, and the research that we did on that high income consumer as designed to Get the current GP market, get some of their patients into SmileDirectClub.\n\nNow that we have SDC+ plus and that is scheduled to launch in select DMAs, we're launching in four DMAs at the end of the year. Partner Network has really morphed into SmileDirectClub, into SDC+. It's really One initiative now. So every office that we sign up.\n\nWe'll have two offerings. One would be exactly the Telehealth SDC play, which is the current partner network, then they'll also be able to offer the $39 hundred dual approach where that GP in that office will play a bigger role in servicing that patient. The fees are much higher to the office. We also did research on that, both existing GP's that are in that [inaudible] potential GP's and, it came back very, very favorable.\n\nAs far as the added fees, and the ability for us to send new leads into those offices every single SDC+ customer that comes to our site that wants to transact. We'll start their journey in one of those GP offices. So that's a lot of lead flow and higher income lead flow that's going to be when those offices. So that was very appealing to them as well.\n\nAs far as the Smile Maker Platform that you asked about regulatory approval. So what this is? We're. Able to take through your smartphone and video of your smile. It takes about a minute.\n\nThere's about 9 poses, we call it. And we'll demonstrate that to you in the Months ahead. And what it does is it is getting all of your teeth, for the ability for us to take a 2D image into a 3D image. Which then allows us to create that treatment plan that everyone knows in this industry.\n\nNow that treatment plan today is enough fidelity to allow the customer to see how their teeth are. Going to move, It looks identical to what they would get after doing an impression kit, or an [inaudible] scan. At a dentist office.it has the 3D viewer. It shows you your top arch, your bottom arch, and you can see how your teeth will move over time.\n\nIt also tells you the  duration of how long it's going to take to move your teeth. What it doesn't do today is It doesn't give you enough. Detail, to make an aligner microns. You need.\n\nClose to 100 microns of detail so that that aligner fits snugly. In your teeth. So after the consumer scans our teeth takes about a minute. They're easy to do.\n\nThey're going to get their what we call draft treatment plan. But it will be almost identical to what's the final what we. call smile prescription plan will be, which is signed off by the doctor. Which allows us to make those aligners the consumer will be able to buy.\n\nBecause that's what they're after. Have to understand what the new smiles will look like, how long is it going to take? So the ability to buy was way up funnel as we illustrated in our investor deck from 1 to 3 weeks today. Because you got to order a kit, you got to do the kit, you got to do it right, got to upload your photos to get that treatment plan. Today, after scanning with our mobile 3D scanning app.\n\nThey're going to be able to get their custom treatment plan within minutes. And then the next step is buy, buy with PayPal, buy with Apple Pay, and or a credit card. and buy your aligners and they're off to the races. What we do need to do is after they buy, we will then send out an impression kit today to get a more high definition or high fidelity impression in order for us to make the aligners.\n\nbut their orders in place, we commit to a certain date as long as they get that impression kit back in time that we will do that. Our plans are to continue to iterate on this Smile Maker platform. The next 2.0 version will be where we don't need to do that kit. We have another interim step to get a more high fidelity scan.\n\nAnd then, eventually, What we call the Holy Grail will be that we won't have to do anything at all. It's all about just more datasets, more machine learning. Being able to take a fraction of that back molar and recreate it with accuracy enough to to make an aligner. So, this is a good first step.\n\nThis is revolutionary in the industry. Consumers today can't get to see what the new signs will look like unless they complete an impression kit, or go to a local brick and mortar office with an internal scanner to see. And then have to wait. The other part of the the AI that's really compelling is the fact that we automated this treatment planning process.\n\nToday or prior to today, before the Smile Make platform, it takes about 30 minutes for a CAD cam set tech to create a true implant. Most of them are in, Costa Rica, we have a big labor force there. We have automated that and we have to AI been able to create that treatment plan within matter of minutes. If we weren't able to do that, then this whole thing wouldn't work, right? The consumer wouldn't be able to see instantly what their new smile would look like and be able to make that.\n\nbuying decision. So that's another huge element to the success in the Smile Maker platform.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nOK. Thanks. And you mentioned splitting third quarter, fourth quarter evenly from a top line perspective, I believe. But what what gives you visibility on that? Does that assume an incrementally worse macro backdrop for you? And then what more can you do from a cost discipline standpoint if we do see that macro backdrop doesn't improve from here? Thanks.\n\nTroy Crawford -- Chief Financial Officer\n\nYeah, I can take that. I mean, I think what we've proven is that we've been able to be very flexible. We're looking at a lot of cost savings initiatives. We started the year with $120 million savings initiative.\n\nWe're well on track for that. We continue to look at efficiency measures across the organization to find additional savings. Certainly, I kind of I would say general guidance around how to split up Q3 and Q4. But we really didn't give that guidance overall.\n\nBut I'd say if you look at what the overall for the year is related to EBITDA as well as revenue, we don't really expect the end of the year to get any better. We did see some decline obviously between May and June and into July as well. So it's really a little bit of an unknown and that's why we gave the guidance range that we did. But it's hard to predict right now with what's going on with, 40 year highs and inflation and things like that, really seeing the the stress on our consumer to kind of predict exactly where Q3 and Q4 will shake out.\n\nOkay. \n\nErin Wright -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of [inaudible] with William Blair. Please proceed with your questions.\n\nUnknown speaker\n\nYeah. Hi. Thanks a lot. I'm just trying to sort of understand guidance here.\n\nYou get the sales outlook and the gross margin, but there seems to be a pretty heavy lift. And to boil it all down to your EBITDA and sort of between marketing and sort of G&A, how should we think about where to sort of posit some of that cost pressure? Thanks.\n\nTroy Crawford -- Chief Financial Officer\n\nYeah, I can take that. So, coming into the year, we gave the full year guidance. We saw Q1 come in with a lift over Q4. We felt really good about it.\n\nWhat we saw again in early May and started to come into June and July is that consistent decline. But we focused on efficiency throughout, and looking at cost savings through that through the end of the year. I think one of those triggers we can pull based on where we see the sales coming in is certainly marketing. And I think what you saw in Q2 was better EBITDA results, better free cash flow results, and much of that came from efficiency measures inside of marketing as well.\n\nSo we typically don't get the break out between G&A, and marketing from an overall expense standpoint. But rest assured that we're looking at all of those as potential levers depending on how sales come in over the back half of the year as to where we pull those triggers to reduce cost and kind of save EBITDA, which is kind of been the trend we've seen coming into Q2. We really feel good about the cost initiatives that we put in place, and our ability to execute on those. It will continue to be, you know, very cost conscious through the rest of the year to make sure that we lessen the impact on EBITDA of any additional impacts from negative sales trends.\n\nUnknown speaker\n\nOK. But I guess my question is, it seems like just to get to the EBITDA guidance you have to assume almost peak cause for both those line items. Am I thinking about that wrong as a sort of one time items that are embedded in that outlook? \n\nTroy Crawford -- Chief Financial Officer\n\nBut we do have some investments in partner network and SmileShop that we outlined in the investor deck. But overall, we have a very flexible environment. There's some fixed costs there, but we've taken a lot of those out. So you do see a lot of flow through from the negative sales trends all the way to EBITDA.\n\nOn the other side of that is these initiatives are able to provide additional revenue in the back half of the year and certainly into 2023. We'll see the exact opposite of that, which is that those that revenue will flow through at a very efficient EBITDA rate as well. So I think one of the things we talked about was even at a 25 basis point, change in our conversion rate would drive an additional $200 million in sales and about $160 million in EBITDA. You know, it also works the opposite way with some of those cells as we've taken, you know, cost out of the business down to just what is really the variable cost that are left. \n\nUnknown speaker\n\nUnderstood. Thank you.\n\nOperator\n\nThank you. Our next question comes from the line of Michael Ryskin with Bank of America. Please proceed with your questions.\n\nMichael Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks for taking the question. I want to follow-up on [inaudible] couple times with the Smile Maker platform. Could you help us triangulate that 25 basis point lift in conversion? Why is that the right jumping off point? I mean, what would work to be done to show that's the uplift that could be expected.\n\nAnd sort of further upside to that over time is that the the second generation that you talked about it, you know, having be completely cutting out the impression kit is that's what's necessary to achieve that just sort of, you know, the timing and the rationale for that metric.\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah. Michael, I can take that. So first of all, it's on Slide ten of our investor funnel current state versus smile maker state. That 25 basis point was an illustrative example and I wasn't just finger in the air and said, Hey, what if we get a 25% basis point improvement? It was based on current state, our call to action today is, am I Candidate, that's our lead gen workhorse.\n\nThat's what people typically start to see if they're a candidate because it's a very simple assessment or a quiz. And then the other side of it, they hit a lander that says, either you are, you aren't. And then your next step is to buy a kit or book a scan. Today, or with the new Smile Maker, what's going to happen is, the call to action is see your new smile, download our free app and within 60 seconds you'll get, see your new smile will show them the app and in full view you know how cool it is.\n\nAll the AI technologies you can see that one of the slides we took some snapshots from the video. So what we did was we just said, hey, it's X percentage of people today are doing the smile assessment. Let's just assume the same percentage of people take or download the free app and do the mobile 3D scan.OK. It's actually a more compelling thing.\n\nYou're getting more out of it than you are just a green light or red light. You are candid or you're not. So but we just assume, let's just say it's the same. And then we just said, OK, now from there we can convert, they can actually buy their aligners.\n\nThey don't have to book a scan or buy a kit and go through that whole gantlet to get it back or show up at the shop, and then have us make a [inaudible] for them. And, we applied a pretty modest conversion rate to the number of downloads that we're getting. They're now going to buy right there on the site, just like not all of them, when they get to the end of the smile assessment. Or buy a kit o book to scan, a good chunk of them do.\n\nAnd then the rest come through CRM or our contact center. But at the end of the day we said, Hey. They have the ability to buy now. They can see their new smile with their customer treatment plan.\n\nYou know exactly how long it's going to take. We've made it very easy with PayPal options. And if you look at other e-commerce companies, most e-commerce businesses I've been associated with over the years have a 2% to 5% visitor traffic conversion. Depending on the ASP, and the complexity.\n\nBut, you know, we're at 0.5% right now, and it's not because we're at 0.5% of our demand. The demand is pretty good, getting 150 to 20,000 visitors a day is pretty darn good. People are interested in this product. What happens is we've made it very difficult for them, to get to the finish line, to buy their their aligners.\n\nOnce they have the treatment plan in our current model, the conversion is extremely high. It's surprisingly high. And once again, if you get to that 25 basis point Improvement, we didn't apply that same conversion, not even close. We just we just made some assumptions that anything can happen.\n\nIt could be something less than that, it could be something much higher than that. As we said. If you get up into the normal e-commerce conversion. When the person is emotionally charged and they're excited about the product.\n\nWhen they're on the site and they can see what their new smiles will look like. What will that conversion be?, Time will tell, but it's around the corner. This is not something that we dreamt up as a way to fix the current macro environment. This  was something that we looked at doing when we founded the company.\n\nHow difficult was it going to be to use your smartphone to do a scan, to get a treatment plan, to buy your aligners, and it's taken all these years, fortunately for us, When it comes to A.I. machine learning, you don't know when it's going to be available. It's not like a software and a cadence of releases, and you can you can time it. It just hit sometimes after a certain number of models that the teams worked on.\n\nAnd for us, it hit back in March. Very exciting time in the company. And then the company has been hyper focused on getting this out to market. We have to rework all of our websites, all of our marketing to feature Smile Maker Platform and all of our advertising.\n\nAnd like we said, the plan is to. We're gonna launch this in Q4. In a smaller international country where got some of the bugs with a fast follow. On by the end of the year or if not very early in Q1 in the U.S.\n\nAnd we'll see what those numbers are. We'll share those numbers. But they could be meaningfully bigger this time. I'll tell.\n\nMichael Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Appreciate all the color. And then follow-up I had was on just going back to the global macro condition and the situation today. I think you've indicated you expect that to linger for the rest of the year.\n\nCould you talk us through a scenario where it continues to remain under pressure next year, I think, for Bank of America? Our basic assumption now, just among our strategists, is that the economic conditions persist for at least the first half of next year, possibly the entire year. So how would that factor into your plans? You talked about flexibility in your cost base. Sort of walk us through the scenarios if this is around for another year, year and a half the challenges to the consumer. Thanks. \n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah, thanks for Michael. I can chime in and you can add color if you want. But, you know. We have to lower support.\n\nOne is on the cost saving side, which we started those initiatives in Q1. And you can see in Q2 here, even though the top line wasn't there, it did pan out. We were able to preserve cash. We had the least amount of cash that we've had.\n\nEven with a record she won. We can now play with, we found a very efficient way to play with marketing, which is our biggest operating expense line by flighting, not always on. We have 60% of awareness, we don't have to be on. 52-weeks a year, and all the different channels that we have.\n\nSo we've been able to pull back, save some, money and not have it affect top line or help actually with the bottom line in cash. So we'll continue with the cost initiatives. We also have a lot of things that we're working with our vendors, our software suppliers, in getting better cost there. So we have a constant focus proving the operating expense structure within this company.\n\nThe other side of it is the two. In they are the only initiatives in the company, right? There are no other initiatives other than Smile Maker platform and SDC+. And both those counteract, the macroenvironment. So they're both going to launch by the end of the year.\n\nWe're going to start to see results, and hopefully both work the way we think they'll work based on the research that we've done and the conversion funnel improvements that we think we're going to get, which will really help with the help of the macro. Because yes, 60 plus is going after that higher income consumer which is doing better than our 60,000 our consumer in this environment, so that's going to help. But even on the conversion side, even if the lower demand. All of a sudden that demand goes from under 50,000 visitors a day to 100,000.\n\nIf you're still converting at 25% or 25, that's better. That's going to significantly help your cash situation or even a situation. So we're fortunate that we have both these things that we've been working on for quite some time that are going to launch in the market. So whether the economy gets better or not, if either or both those initiatives start to bear fruit, it's really going to help our total revenue EBITDA profile. \n\nTroy Crawford -- Chief Financial Officer\n\nBecause those also come with very little additional marketing spend, if any. So we're really able to leverage those two initiatives for higher sales with very little additional marketing.\n\nMichael Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThank you. Our next question comes from the line of Laura Champine with Loop Capital. Please proceed with your questions.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nThanks for taking my question. The technology to replace the kits. When does that roll out in full? And what kind of marketing spend do you intend to support that with?\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah. So it's going to launch in Q4 in an international country. We're not identifying that country. We'll obviously hear about it when it does.\n\nIt's a smaller country. But we'll get good learnings from it. And we'll see what kind of technical bugs we have. We're trying to understand what percentage of the customer base will be able to scan with their smartphone, whether it's Android or iPhone.\n\nAnd we're not going back to all the early, early versions, but we would like to capture about 95% of the people would be able to get a good accurate scan in the treatment plan and fast follow. So that'll happen in Q4. Our anticipation is 60 days, 45 to 60 days later, we will launch in the U.S. is the next country.\n\nAnd then UK, and Canada will follow on in Q1 and Q2. But we're going to start to see results In Q4 here for this initiative and we're obviously very excited to report on that. And so you'll hear more about that. I forgot the second part of your was there second part of the question, besides the launch timing?\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nWhat level of marketing spend do you intend to use to spread?\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah. So today it's the way we've built the panels and the forecast. It's a C marketing step, right? Because when we market out there with a TV, or Facebook search, the consumer doesn't necessarily know what to expect. When they get to the site.\n\nWhat do I have to do to engage with the brand? Well, they've slowly learned that, oh, I got to order an impression kit or I got to book to scan, go to a SmileShop. What they're going to learn with the same marketing spend is that you can interact with the brand today, use this cool technology, this phone scanning device, and then see what your new smile's going to look like. Play with it. It's got six different views, spins around it, 360 degree fashion.\n\nSo we don't anticipate a higher marketing spend. There is a lot of debate internally that we would actually be able to stretch our marketing further because the same marketing spend showcasing this technology could get more people to interact with the brand, versus today it's all about convenience, price and come the SmileDirectClub get started for free, versus we will now start to showcase the scanning technology in our advertising. Show them what they'll get in a full blown treatment plan, and how long it'll take to get you smile, which could have your marketing dollars stretch further and get more people to the site with the same spend.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nGot it. And then just a housekeeping thing. Where do you expect equity based compensation to be in the back half?\n\nTroy Crawford -- Chief Financial Officer\n\nYeah, we typically don't break it down fully, but I would say we've had some volatility in the first part of the year. A lot of that had to do with the restructuring initiatives that we were operating under. So it was a little lower in this quarter, I'd say are generally run rates probably in the more like in the $10 Million range. But we've seen some volatility just because of the turnover we have related to some of the cost changes that we've made.\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Our final question has come from the line of Dylan Carden with William Blair. Please proceed with your questions.\n\nDylan Carden -- William Blair and Company -- Analyst\n\nHey, I really appreciate the follow up here. I realize that we haven't spoken to and maybe you won't, but the economics on the SDC+, the 3900, how you're booking that on your own from a revenue standpoint, sharing it with your partner. Any color you can give on that?\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nYeah, sure. You can follow-up. We're not giving a lot of detail, but it is significantly more to the partner network GPO office than is our current partner network offering. So a big chunk of that extra $2,000 for the is for the doctor.\n\nThere's also cost that we have for the success team, and also for sets of retainers that are included with us. So there's some additional costs. But the net net margin, there's a lot more margin increase out of that $2,000 on the top line that goes to SDC. I don't know if we're sharing out the exact percentage of that, Troy.\n\nTroy Crawford -- Chief Financial Officer\n\nWe estimate to be about 30%. So we will share with the obviously, the GP will get a bigger chunk of that which will give them incentive to get excited about the program but should flow through to about 30%.\n\nDylan Carden -- William Blair and Company -- Analyst\n\n30% to you of 3900. All right. Understood. Awesome.\n\nReally appreciate it, guys. Thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJonathan Fleetwood -- Director, Investor Relations\n\nDavid Katzman -- Chairman and Chief Executive Officer\n\nTroy Crawford -- Chief Financial Officer\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nLilia-Celine Breton Lozada -- J.P. Morgan -- Analyst\n\nErin Wright -- Morgan Stanley -- Analyst\n\nUnknown speaker\n\nMichael Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nLaura Champine -- Loop Capital Markets -- Analyst\n\nDylan Carden -- William Blair and Company -- Analyst\n\nMore SDC analysis\n\nAll earnings call transcripts"
}