{
  "companyName": "Vuzix",
  "companyTicker": "VUZI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/vuzix-vuzi-q3-2022-earnings-call-transcript/",
  "content": "Vuzix (VUZI 1.11%)\nQ3 2022 Earnings Call\nNov 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Vuzix third quarter ending September 30, 2022, financial results and business update conference call. [Operator instructions] As a reminder, this call is being recorded. It's now my pleasure to turn the call over to Ed McGregor, director of investor relations of Vuzix. Mr.\n\nMcGregor, you may begin.\n\nEd McGregor -- Director, Investor Relations\n\nGood afternoon, everyone, and welcome to the Vuzix third quarter 2022 ending September 30th, financial results and business update conference call. With us today, our Vuzix CEO, Paul Travers and our CFO grant Russell. Before I turn the call over to Paul, I would like to remind you that on this call management's prepared remarks may contain forward-looking statements, which are subject to risks and uncertainties and management may make additional forward-looking statements during the question-and-answer session. Therefore, the company claims the protection of the Safe Harbor for forward-looking statements that are contained in the Private Securities Litigation Reform Act of 1995.\n\nActual results could differ materially from those contemplated by any forward-looking statements as a result of certain factors including, but not limited to general economic and business conditions, competitive factors, changes in business strategy or development plans. The ability to attract and retain qualified personnel, as well as changes in legal and regulatory requirements. In addition, any projections as to the company's future performance represent management's estimates as of today November 9, 2022. These assumes no obligation to update these projections in the future, as market conditions change.\n\nToday's call may include certain non-GAAP financial measures, when required reconciliation to the most directly comparable financial measures calculated and presented in accordance with GAAP can be found in the company's Form 10-Q filing at sec.gov, which is also available at www.vuzix.com. I'll now turn the call over to Vuzix CEO, Paul Travers who will give an overview of the company's operating results and business outlook. Paul will then turn the call over to Grant Russell, Vuzix CFO who will provide an overview of the company's third-quarter financial results. Paul will return to provide some closing remarks after, which we will move on to the Q&A session.\n\nPaul?\n\nPaul Travers -- Chief Executive Officer\n\nThank you, Ed. Hello, everyone, and welcome to the Vuzix Q3 2022 conference call. On this call, we're going to review our operating results and recent developments and then give you some perspective on where we see things headed. During the third quarter, we achieved both sequential and year-over-year double-digit revenue growth.\n\nWe made strong progress in terms of product development, technology advancement, and new business engagements. On the OEM side of our business, we are now engaged with many new potential defense, consumer electronics, and enterprise customers that are interested in our waveguide and display engine solutions. At the same time, larger deployment opportunities for our smart glasses among key enterprise customers continue to expand both in number and visibility within warehousing and logistics, automotive, pharma and healthcare verticals. Let me elaborate.\n\nFrom a customer engagement perspective, the third quarter continued to be very encouraging across our core Smart Glasses business despite numerous headwinds. Most notably at the end of Q3, we expanded our international sales channel with the addition of Hongke Tech to support our business development in China. We also bolster our local sales and support team in Europe with additional personnel that came online during Q3 to support our key accounts and drive additional sales growth in the EMEA region. As always, we continue to work closely with our key independent software vendors to support the needs of our collective customers as they work through their optimizations in support of a growing number of enterprisewide rollouts.\n\nOn the OEM side of the business, there is growing momentum with both existing and new customers, sales of waveguides and display engines as well as engineering services were both at record levels in our third quarter and we expect our OEM business activities will continue to grow. After the third quarter is closed, we announced two notable developments. Vuzix has been working on upgrading and expanding our waveguide manufacturing capabilities. To support this effort in October we entered into a lease for new manufacturing space.\n\nThis facility located across the street from our existing plant includes an option to expand over time. The separate plant will support the advanced capabilities we need for our latest waveguide technology, including the use of higher index materials, advanced glass substrates and unique formulation technologies designed to further address Vuzix and our OEM customers' needs. This new facility is designed to increase our unit capacity and significantly lower the unit cost to manufacture our waveguides as we move into the broader markets. As part of this expansion, we teamed up with leaders from the Empire State Development to receive up to $1 million to support related job creation through the Excelsior Job Tax Credit program.\n\nSecond, we completed the acquisition of Moviynt a revenue-generating SaaS solution provider that support SAP, which broadens our go-to-market strategy for customers and ISPs within the warehousing and logistics market verticals using SAP, along with making our products stickier for the end customer. We have high expectations for this strategic investment and I'll share more a bit later on in the call. Clearly, there is a lot of forward momentum going on at Vuzix. It's great to see that our Smart Glasses core customer base continues to expand both vertically and geographically, and customers continue to move forward with their scaling initiatives.\n\nThat being said during the third quarter, several customers did push their purchasing decisions out, also impacting growth a bit in the quarter with some higher volume discounts and to a lesser degree negative exchange rate with a strong U.S. dollar. In terms of market verticals, the outlook for warehousing and logistics continues to be one of our brightest. One Fortune 100 customer that we've referenced in the July press release has already placed multiple orders for initial rollouts, and is expected to continue to expand their use of our Smart Glasses in their organization.\n\nThe Smart Glasses project that this retailer, as it currently is slated will represent one of the largest deployments of Smart Glasses in the world to date. Visibility in Amazon, another large warehouse and logistics customer remains positive, as we expect their smart glasses users to expand further beginning as early as Q4 2022. As a reminder, Amazon has their own custom M400 Smart Glasses SKU from Vuzix. Outside of these customers Vuzix Smart Glasses have been deployed within the distribution centers of several other large retail customers, and we expect to finally start to see further expansion into additional DCs also beginning as early as this quarter.\n\nIn healthcare, our major ISVs continue to expand the global availability of their Vuzix-powered surgical solutions. Most notably Medacta, Pixee Medical, and Rods & Cones, all of which continue to post new milestones and deployments almost daily on LinkedIn, among other social media. Again, healthcare-related trials and use cases of Vuzix Smart Glasses continued to steadily expand around the world, such as those recently announced with AVR Japan and others for ambulance emergency medical care, Toppan for Order Picking of Homebound Seniors and Xpertinc for the Deaf and Hearing Impaired. Overall, our smart glasses sales pipeline is healthy and growing.\n\nAnd we expect to see sequential revenue growth in Smart Glasses products and solutions in Q4. Vuzix Smart Glasses have made their way into an impressively long and still growing list of blue chip firms around the world as either they're preferred, or in most cases sold Smart Glasses solution. Further solidifying Vuzix position as the market leader in enterprise Smart Glasses. To expand on my earlier comment, Vuzix recently closed the acquisition of Moviynt a SaaS-based SAP solution provider that has now become a Vuzix company.\n\nMoviynt's warehouse workflow solution and architecture is unique in that it does not require an online connection or middleware to operate. The Moviynt solution is designed to be ERP agnostic, and as such we expect over time to support other leading ERP back-end systems such as Oracle, and Microsoft Dynamics. The core Moviynt team brings more than 40 years of experience related to SAP system-level architecture, mobility, project management and implementation of SAP software suites. Their solution was developed in a close collaboration with a very large aerospace and defense customer, and is currently deployed in numerous of their locations across the U.S.\n\nand Europe, and is now being piloted for expansion into Canada. The Moviynt solution is currently supporting handheld scanners and mobile phones, which represent a logical transition to Vuzix Smart Glasses. We see this as a significant market opportunity to support traditional warehouse hardware. And our plan is to introduce Vuzix Smart Glasses as an upgrade for hands-free picking into these environments.\n\nStrategically we believe that Moviynt's underlying technology and architecture can be packaged into API's that could be used by Vuzix ISVs and the likes to enhance their current software offerings and help expand existing markets and open up new markets for Smart Glasses across warehousing and logistics. In terms of Moviynt's revenue generation, we expect a low six-figure contribution in Q4 of 2022, and seven-figure contribution in 2023 with a minimal impact on our net operating costs. As announced in mid-May, Vuzix signed a series of agreements with atomistic, a France-based technologies firm with a novel material science approach related to the development of next-generation, microlight emitting diodes or MicroLEDs. The combination of atomistic displays and Vuzix see-through waveguides will deliver full color, high-resolution HD solutions, a level of form and functionality that represents what we believe to be a critical piece for the broader AR wearable markets.\n\nMarket is expected to ultimately become as large as the current smartphone market itself. We're making steady progress. And if you would like to learn more about Vuzix micro-led efforts and this transaction, please review the conference call that Vuzix hosted on May 18 of this year, you can find it on our website. Our newly established OEM design and manufacturing platform is rapidly gaining momentum.\n\nIn the short six months since its official launch, we are seeing indications of significant need in both the broader markets and in the defense markets. It is clear that waveguides and display engines will be an integral part of the wearable computing platform of the future, from defense all the way to literally replacing the smartphone to help make consumer AR glasses ubiquitous. The platform that was announced early in the second quarter is being proactively offered to select third parties. This new platform offers customers one-stop shopping for their advanced and customized waveguide and display engine solutions needs.\n\nFrom design to high volume cost-effective production capabilities, a mix that we believe is currently almost impossible to find anywhere else in the world. Since announcing the platform, we have been fielding many RFIs, a Request for Inputs and formal RFQs, Request for Quotes for our waveguide-based solutions and in most cases display engines to go with them. Our early success is evidenced by the fact that we achieved as I mentioned earlier, record sales of waveguide display engines and engineering services in Q3. I would like to give you some more color on what's going on in the OEM space.\n\nWe are currently in discussions with well over a dozen firms with multiple projects already underway with many of them. On the defense side, our non-compete agreement that expired in June has been timely for the introduction of our OEM platform. As the only U.S.-based manufacturer of waveguides, we are well positioned to directly grow our defense and military business. Our end goal is qualification and selection of our OEM component offerings into volume programs where production runs can span five years or more, and result in four, five, and even six-figure unit volumes.\n\nModern wars are won and lost with information. And the ideal method to deliver that information to the user requires a wearable display. From new use cases to upgrading older defense solutions and frankly, to alternatives to what should have been the de facto solution IVAS the need is palpable. For a clearly visible example we announced in July and agreement with L3Harris Technologies, a leading defense contractor to develop a new customized waveguide-based head-mounted display engine for use within their existing L3Harris programs and new ones in the works.\n\nAnd it's exciting that our technology can be used on the multiple projects that they are pursuing. And the multi-year unit potential for us could be quite large given the size of L3Harris's existing product lines and the use cases they target. L3Harris is one of the almost dozen defense firms coming to Vuzix at this point, and things are just getting started. On the consumer electronics side, we are well-positioned to be a high-volume cost competitive provider of waveguides, display engines and related reference designs.\n\nSome of the largest West Coast consumer technology companies continue to publicize their intentions to offer smart AR glasses for the masses. And at the same time, most of them are dealing with the realities of just how hard it is to design and build a pair of highly functional, cost-effective consumer AR Smart Glasses. Since announcing our OEM platform, we have had significant inbound request to respond to RFQs from leading consumer electronic firms and their interest in working with Vuzix as a solution provider to their programs. Again, by way of example, in July, we received a purchase order for custom design waveguides from a Fortune 50 software and hardware technology customer.\n\nThe work for this customer, which is consistent with the consumer-related remarks I made previously is well underway, and the waveguides developed and built by Vuzix are being delivered specifically to match this customer's needs and specifications. Led by both consumer OEM customers, and U.S. and Allied Defense and Homeland Security customers, we expect our OEM revenue in Q4 to show continued growth. Slide 8 highlights the new products we have introduced over the past four years, and I think it's safe to say that no other firm in the world has a more comprehensive smart glasses product lineup, and the core technologies behind them than Vuzix.\n\nEach of these products is designed to address the unique needs of different vertical markets and the burgeoning smart glasses market. We feel we have never been in a stronger product position than we are today. And we intend to keep pushing the competitive envelope going forward. Towards the end of the third quarter, we announced the general availability of Blade 2, our third-generation blade product featuring our latest advanced waveguide optics, a new microprocessor and the ability to run Android 11 Out of the box.\n\nCustomer reception to the Blade 2 has been great. We have a number of significant opportunities associated with this product as it answers the call from many of our estimated customers that love the Blade's form factor, but required an upgraded Android OS, the latest security support, broader WiFi capabilities and updated MDM compatibility to support their applications deployments. The Vuzix M400-C, our second-generation USB-C-based Windows PC and phone-compatible smart glasses, that takes full advantage of the robust M400 platform design including IP67 is now shipping and is being actively marketed through select Vuzix channels. The M400-C is designed to work in concert with a smartphone or belt-worn PC and to take advantage of that existing ecosystem.\n\nFinally, the Shield, our first binocular and fashion-forward smart glasses is starting to ship to key customers, system integrators and development partners and is on track for broader availability before the end of the year. The production release of this product has been hampered by earlier supply chain challenges which are now behind us. I'd like to now pass the call over to Grant for his financial review. Grant?\n\nGrant Russell -- Chief Financial Officer\n\nThank you, Paul. As Ed mentioned, the 10-Q we filed this afternoon with the SEC offers a detailed explanation of our quarterly financials. So I'm just going to provide you with a bit of color on some of the numbers now. Our third quarter total revenues for the three months ended September 30, 2022, was $3.4 million, as compared to $3 million for the prior 2021 period and overall increase of 14%.\n\nSales of waveguides and display engines for the quarter rose to approximately $0.25 million, a new quarterly record for us. Revenues from engineering services were also a record at $0.9 million versus none in the prior year's period. Offsetting some of these revenue gains were decreases in sales, class revenues, which as mentioned by Paul was due to higher sales discounts for larger volume orders, and by a smaller extent negative foreign exchange impacts and lower unit sales. There was an overall gross profit of $0.9 million or 25% for the three months ended September 30, 2022, as compared to a gross profit of $0.4 million or 13% for the same period in 2021.\n\nThe improvement in gross profit percentage in the quarter was largely attributable to increased amount of engineering services revenues, which typically earn us a higher gross margin. R&D expense was $3.4 million for the three months ended September 30, 2022, an increase of only 1% against the comparable period in 2021. Selling and marketing expense for the three months ended September 30, 2022, was $2 million as compared to $1.7 million in the 2021 period, an increase of 20% largely due to increases in staff compensation due to headcount increases. General and administrative expense for the three months ended September 30, 2022, was $4.9 million, a decrease of 11% versus $5.5 million in the prior year's period.\n\nThe decline was largely due to decreases in non-cash stock compensation related to our long-term incentive plan and legal expenses. The net loss for the three months ended September 30, 2022, was $9.5 million or $0.15 per share, versus a net loss of $10.5 million or $0.17 per share for the same period in 2021. Now for some balance sheet highlights. Our balance sheet remains strong with cash and cash equivalent position of $90.4 million as of September 30, 2022, and a net working capital position of $100.8 million.\n\nNet cash used in operations was $4.9 million after adding back non-cash operating expenses, mainly stock compensation, depreciation and amortization and net changes in our working capital for the third quarter of 2022 as compared to $5.8 million in 2021. Cash used for investing activities for the third quarter of 2022 was $3.4 million as compared to $3.1 million in the prior year's period. As of September 30, 2022,, the company continues to have no current or long-term debt obligations outstanding other than the outstanding license fee commitment and remaining contract work for backplane with Atomistic. Looking forward, the balance of 2022 and throughout the calendar 2023.\n\nWe're confident we have the resources to execute on our business plan and further invest in our future. With that, I'd like to turn the call back over to Paul.\n\nPaul Travers -- Chief Executive Officer\n\nThanks, Grant. As you can see, it is incredibly busy at Vuzix these days, and in the New Year, Vuzix will be attending the Consumer Electronics Show in Las Vegas as we excite the world with our newest fleet of industry-leading smart glasses. We would like to invite everyone to stop by our booth to see them firsthand. I will say it should be an exciting show this year as we are also planning to unveil the proverbial one more thing.\n\nOur biggest smart glasses leap forward yet and pointed directly at the broader markets. With that, I would like to turn the call back over to the operator for Q&A.\n\nOperator\n\nWe'll now be conducting a question-and-answer session. [Operator instructions] Our first question is coming from Matt VanVliet from BTIG. Your line is now live.\n\nMatt VanVliet -- BTIG -- Analyst\n\nHey. Good afternoon, guys. Thanks for taking the questions. I guess first, just curious on how you're thinking about the distribution and warehousing channel in light of some of the macro headwinds and some of the struggles we're seeing across kind of e-commerce and retail more holistically.\n\nAnd just kind of what's baked into your forward expectations on kind of the overall macro trends?\n\nPaul Travers -- Chief Executive Officer\n\nSure, Matt. This is a really cool bit about what Vuzix does in that space, when you're in a distribution channel, and you can make it more efficient and deal with high turnover rates, because it's so easy to use our products, they pay for themselves so fast, and it helps deal with the fact that, it's hard to even get good employees to do those jobs. And so we see 2023 being a fantastic year for us, as deployments we believe we're going to have it all over the place. And some of these companies that we've been working with for quite some time now.\n\nSo we're a device that helps make workers more efficient. It's that simple. It's going to be deployed in quite a few places because of it.\n\nMatt VanVliet -- BTIG -- Analyst\n\nAll right. Very helpful. And then on the aerospace and defense side, obviously a bunch of engineering services opportunities, but maybe within that mix, and even beyond the consumer electronics side, how should we think about the mix of the OEM business, maybe over the next call four or five years or something that more longer-term versus smart glasses sales and kind of what you're thinking about the ultimate revenue mix between those two might be?\n\nPaul Travers -- Chief Executive Officer\n\nWell, some of these accounts that we're working with are, they're selling devices for like 60 grand a pop, to Vuzix, it could be $5,000 to $7,000 a pop, and it could be as many as 60,000 pieces over a program. So that event side of our business could be pretty significant. And it could represent well, first of all, it is great margin for Vuzix 1, and number two, it should represent some significant top line. On the broader market side, when you're going to multiple programs, knock on wood.\n\nThese are companies that are expecting to shelf millions of these things, and it's part of the reasons why we've done this upgrade to our facility. And we've set it up so we could expand it even further and grow into it. As the demand grows, I mean these guys are going to be talking millions of units. To add that all up, Matt, it could run over the top of the enterprise side of our business.\n\nI mean there's hundreds of 1000s of headsets that can be sold, maybe millions, even in enterprise, no doubt about it, and it's a higher number. But the unit volumes are just going to be impressive in the broader market side of it.\n\nMatt VanVliet -- BTIG -- Analyst\n\nAll right. Great. Thank you.\n\nOperator\n\nNext question today is coming from Tyler Burmeister from Craig-Hallum Capital, your line is now live.\n\nTyler Burmeister -- Craig-Hallum Capital Group -- Analyst\n\nHey, guys. Thanks for letting us ask a couple questions. So first, I guess as a point of clarification, the OEM revenue is the $900,000 in Q3 the engineering services. And when you say you expect OEM to grow in Q4, is that a quarter-over-quarter sequential comment or is that a year-over-year comment, and then, as we look into next year, are these quarterly levels kind of getting close to a million dollars is that the type of run rate we could expect in the next year, is there maybe some one-time project start-up or completion, that that positively kind of impact in the near-term?\n\nPaul Travers -- Chief Executive Officer\n\nThere's no doubt that these things are a bit lumpy, right? Because sometimes you've got two or three guys in the queue maybe more that you're developing for and delivering against, but there's so many of them, Tyler, that look like they're coming to us, like I said, there's upwards of a dozen defense companies now. So it should start to get more consistent next year, but it still will be lumpy as we deliver and programs come in and out until they're going into production. On the defense side for production next year, there should be at least one, and maybe a couple of them that we're producing in production-oriented quantities. The sequential growth again, this is a lumpy kind of business right now.\n\nI mean, we feel pretty good about what's going to happen here in our Q4. It should match it, it's little rough plus or minus. But it should be a reasonably good quarter, the fourth quarter in the next year, these numbers should be significant jumps over what they're doing in this year. There's just so many programs coming on board.\n\nTyler Burmeister -- Craig-Hallum Capital Group -- Analyst\n\nThat sounds great. Thanks for that clarification color. And then as we talk about waveguides and the opportunity to sell those into third parties. How should we think about the timing of the opportunity, obviously pretty excited with some of the long-term opportunities that we are thinking materials step up and revenue next year, is this kind of looking out more three, five years?\n\nPaul Travers -- Chief Executive Officer\n\nIt's not three to five, it's in fact, we'll see some revenue from a product perspective, I believe in 2023. Some of the broader market guys we're talking to, they want products by the end of next year. So it won't be -- it won't be massive next year. It'll really take off into 2024, though.\n\nTyler Burmeister -- Craig-Hallum Capital Group -- Analyst\n\nThat sounds great. Sorry just go ahead.\n\nPaul Travers -- Chief Executive Officer\n\nI was just going to say it takes time to get through the development phase of some of this stuff. I will tell you though, that some of these companies are already well into their product development, they just haven't been able to solve this side of it.\n\nTyler Burmeister -- Craig-Hallum Capital Group -- Analyst\n\nThat sounds good. Thanks.\n\nPaul Travers -- Chief Executive Officer\n\nYou're welcome.\n\nOperator\n\nThe next question today is coming from Jack Vander Aarde from Maxim Group. Your line is now live.\n\nJack Codera -- Maxim Group -- Analyst\n\nHi, guys. This is actually Jack Codera calling in for Jack Vander Aarde. Thanks for taking my questions. I was actually just wondering if you could give possibly any more color on the OEM opportunity.\n\nI was wondering if you could explain it all, the timeline for those opportunities from like early conversations to point-of-sale, can you give any color, how long that whole process takes?\n\nPaul Travers -- Chief Executive Officer\n\nIt really depends a lot, Jack on which programs that we're talking, first of all, some of these programs. A smaller number of them, of course, because this is something that's only been six or seven months that we've really hung our shingle out. But there's a couple of these that we've been working on for the last two or three years. And those projects, programs, we believe are going to be rolling into production in 2023, at least for sure one of them.\n\nA brand new project that's based upon what it is can take 12 to 18 months before it might be in volume production. Some of them are even longer-term, they're taking two to three years out based upon what the program is. So it really does depend. Now, that said the size of the engineering, the longer the ones, the ones that are longer, the engineering services part of it, the part where you do to develop the much bigger numbers in this regard.\n\nAnd of course we make good margin on that side of our business at the same time. So you're going to see in 2023, a reasonably large number of new programs and that baseline of engineering services fees to get these things developed in the multiple millions of dollars.\n\nJack Codera -- Maxim Group -- Analyst\n\nAwesome. That's wonderful color. I'll hop back in the queue. Thank you.\n\nOperator\n\nThank you. We reached the end of our question-and-answer session. I'd like to turn the floor back over for any closing or further comment.\n\nPaul Travers -- Chief Executive Officer\n\nThank you very much, everybody, for joining the call again. And now yes, like I said it would be a lot of fun. We look forward to seeing everybody there and we look forward to reporting in March. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nEd McGregor -- Director, Investor Relations\n\nPaul Travers -- Chief Executive Officer\n\nGrant Russell -- Chief Financial Officer\n\nMatt VanVliet -- BTIG -- Analyst\n\nTyler Burmeister -- Craig-Hallum Capital Group -- Analyst\n\nJack Codera -- Maxim Group -- Analyst\n\nMore VUZI analysis\n\nAll earnings call transcripts"
}