{
  "companyName": "Chemours",
  "companyTicker": "CC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/26/chemours-cc-q3-2022-earnings-call-transcript/",
  "content": "Chemours (CC -0.84%)\nQ3 2022 Earnings Call\nOct 26, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Rob, and I will be your conference operator today. At this time, I would like to welcome everyone to The Chemours Company third quarter 2022 earnings conference call. [Operator instructions] Jonathan Lock, senior vice president and chief development officer, you may begin your conference.\n\nJonathan Lock -- Senior Vice President and Chief Development Officer\n\nThanks, Rob, and good morning, everybody. Welcome to The Chemours Company's third quarter 2022 earnings conference call. I'm joined today by Mark Newman, president and chief executive officer, and Sameer Ralhan, senior vice president and chief financial officer. Before we start, I'd like to remind you that comments made on this call as well as in the supplemental information provided in our presentation and on our website contain forward-looking statements that involve risks and uncertainties as described in Chemours' filings with the SEC.\n\nThese forward-looking statements are not guarantees of future performance and are based on certain assumptions and expectations of future events that may not be realized. Actual results may differ, and Chemours undertakes no duty to update any forward-looking statements as a result of future developments or new information. During the course of this call, management will refer to certain non-GAAP financial measures that we believe are useful to investors evaluating the company's performance. A reconciliation of non-GAAP terms and adjustments are included in our release and at the end of our presentation.\n\nAs a reminder, our prepared remarks, a full transcript, and an audio recording plus our earnings deck have been posted to our website alongside our earnings release. This morning's call will focus purely on Q&A. With that, I'll turn the call over to our CEO, Mark Newman. Mark?\n\nMark Newman -- President and Chief Executive Officer\n\nThank you, Jonathan. I hope everyone is doing well today, and I appreciate you joining us. Despite increasing macroeconomic uncertainty, our quarterly performance showcases the strength of our structural growth strategy. We remain committed to improving the earnings power of TT through the cycle, attaining secular growth in our TSS and APM businesses and managing and resolving legacy liabilities while returning the majority of our free cash flow to shareholders.\n\nIn the long run, we expect these four priorities to generate significant value for our shareholders. So with that, operator, let's open it up for questions.\n\nOperator\n\n[Operator instructions] And your first question comes from the line of Duffy Fischer from Goldman Sachs. Your line is open.\n\nDuffy Fischer -- Goldman Sachs -- Analyst\n\nYes. Good morning, guys. Great. So first question is just when you look at the magnitude of the slowdown you've seen so far, maybe compare that to 2019, the last time you guys had a TiO2 slowdown.\n\nAnd at that point, the portal wasn't fully developed. How would you expect basically the contract business versus the portal business to handle this slowdown vis-a-vis last time when I think your volumes were down kind of double the market? If we go back to 2019, your price held in better than the market price. Can you juxtapose that period kind of with an infancy of your new program versus now that you've kind of matured it and what you think you'll see from at this time?\n\nMark Newman -- President and Chief Executive Officer\n\nYeah. Hey, Duffy. That's a great question. Listen, in 2019, that was more of a story of share loss as we were implementing TVS.\n\nWe've regained that share and then some with the implementation of Ti-Pure Value Stabilization. So really, what we're seeing in Q3 and as we go into Q4, is the combination of a lot slower demand. As we said early in the year, about 80% or so of our business was contracted. And so we expect that ratio to stay roughly in line.\n\nIt varies from quarter to quarter. But our contracted business is good. And obviously, the value proposition with TVS is we respond to the market demand signals of our customers, and we're seeing that across the portfolio. As we said in our guide in September, we're already seeing this more so in Europe and in Asia, specifically in Mainland China.\n\nAnd volumes and demand continue to do well in the Americas, North America, and Latin America. So really, what we're seeing is a response to much lower demand. And the way I kind of think about trying to compare it is, one is, the demand has come off pretty significantly in a very fast way. And I think a number of the coating companies have alluded to that, especially as they look through to Q4.\n\nAnd we're responding to that by idling production. And we're also, at the same time, running through higher cost inputs that we bought early in the year through our P&L. So you have all of these things kind of coming together. I think to compare periods, I would advise folks to look at sort of a rolling 12-month performance on our TiO2 business, which we expect to be much better with TVS even with some of the high-cost inputs that we're running through in the next couple of quarters.\n\nDuffy Fischer -- Goldman Sachs -- Analyst\n\nGreat. And then I think most of us can track unit margins, price, and kind of current raw materials. But can you help us for the next couple of quarters, how much extra above-market COGS are going to run through on a unit basis because of that high-price stuff you bought earlier this year, does that anniversary kind of into Q1? And then the other part that's a little bit tricky is as you ramp down your plants, how should we think about the incremental cost per unit from things like absorbed overhead or just kind of running at less than optimal operating rates?\n\nMark Newman -- President and Chief Executive Officer\n\nSo I'll ask Sameer to comment here in a minute. But clearly, we've been off of our target margin in TT and expect to be off in our second half more so as we adjust production to meet demand. In our view, we would expect volumes to bottom somewhere between the end of Q4 and into Q1. And with that in mind, we'll adjust our production schedules accordingly to better match demand with production.\n\nAnd clearly, as we come into year-end, we're focused on bringing down some of our own finished goods inventory from a cash perspective. So maybe with that, I'll ask Sameer to comment.\n\nSameer Ralhan -- Senior Vice President, Chief Financial Officer\n\nThanks, Mark, and thanks, Duffy, for the question. Look, as you kind of look at the cost side, Mark said, right, we are aligning up production with the demand in TT business, and that means a lot of things, right? First is the cost side just from running the operations should come down. And also, we are working with our suppliers as well to see what makes the most sense ultimately to create value for both of us over the longer term. And we have started seeing some positives.\n\nAnd the smaller portion, but we started seeing some positives on that end. But from a timing perspective, as you kind of look at, look, I think these higher costs sitting in the inventory overall are going to probably run through toward the end of the Q1, and we should start seeing the benefit in the -- as we're going to hit the coating season in Q2.\n\nDuffy Fischer -- Goldman Sachs -- Analyst\n\nGreat. Thank you, guys.\n\nMark Newman -- President and Chief Executive Officer\n\nThanks, Duffy, and congrats on the new role, man.\n\nOperator\n\nYour next question comes from the line of Arun Viswanathan from RBC Capital Markets. Your line is open.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nGreat. Thanks for taking my question. Good morning. Just following up on the guidance, I guess, a little bit.\n\nIt sounds like you were able to reiterate the full year. And so I guess, given your comments just now on TiO2, it sounds like more of that is coming from upside in TSS and APM. Could you just flesh that out for us as well? Thanks.\n\nMark Newman -- President and Chief Executive Officer\n\nYes. So TSS and APM are having a great year. And in fact, if you would snap the line at the end of September, and that would have been our year, we would have had record years already in these two businesses. So clearly, our secular growth platforms are working.\n\nIn TSS, you'll see both price and volume year over year as we continue the rollout of Opteon and we look at better marketing of our products globally. On APM, we have a lot of excitement around our growth story here, both in areas of advanced electronics like semicon with so much work being done on the U.S. supply chain in this area and globally actually with the demand for chips, and you'll have seen our recent announcements on hydrogen. And these business are growing at double-digit rates while we have some fade in our less strategic lines in the company.\n\nSo the way I think about the company today is, clearly TT is going through an adjustment as we deal with lower demand but the team is really focused on the cost side and bringing our inventories into line here in the next couple of quarters. And on TSS and APM we a singularly focused on achieving our growth. And so we've seen record quarters so far this year and we would expect that growth to continue into 2023. So I think we are going through a bit of a transition where clearly our TSS and APM businesses are generating more earning while we structurally adjust our TT business for the demand, and that's reflected in our guide for the full year.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nOK. Thanks for that. And just as a follow up then on APM, given that we have been hearing some slowdown in electronics, especially in China, are you seeing any of that? And it sounds like you expect the strength to continue in '23. What makes Chemours' business a little different maybe to mitigate that weakness?\n\nMark Newman -- President and Chief Executive Officer\n\nSo listen, I'd say, certainly, there's a lot going on, on the semicon infrastructure that's driving demand near term, and we see double-digit demand growth over the next several years in this area. So there might be some moderate slowing in terms of overall chips. But in terms of our book of business, we had another record quarter in Q3. I'll maybe ask Sameer to make some additional comments.\n\nSameer Ralhan -- Senior Vice President, Chief Financial Officer\n\nYes. Arun, you see a lot on the consumer electronics side. So consumer electronics, yes, but that's a smaller portion for us. We are a lot heavier into the infrastructure side.\n\nAnd as Mark said, and that's where you know once the project started, they typically get through. So the demand over that side stays pretty strong.\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nThanks.\n\nOperator\n\nYour next question comes from the line of John McNulty from BMO Capital Markets. Your line is open.\n\nJohn McNulty -- BMO Capital Markets -- Analyst\n\nYeah. Good morning. Thanks for taking my question. Maybe I can start out on the two specialty businesses.\n\nSo the APM segment, I think all year long, you've kind of spoken to your capacity constrained a bit, and yet the volumes seem to kind of get unlocked a bit this quarter. So I guess, can you help us to understand that? And then for the TSS business, I know you've kind of said, hey, don't bake in these margins, they're kind of running pretty hot. We've got some pretty high cost coming through the pipe in terms of raw materials. But other than the seasonal dip that we would normally see from, say, the first half to 3Q, it seems like they're hanging in pretty well.\n\nSo I guess, can you help us to understand what's going on there and if we should be expecting a bit more of a dip as we kind of look into 4Q and into 2023?\n\nMark Newman -- President and Chief Executive Officer\n\nSo John, thanks for acknowledging these two great specialty businesses in our portfolio. Clearly TSS is -- we pointed to a seasonally weaker Q4. So we want folks to make sure we understand that we sell less refrigerants in the middle of the winter. But other than that, this is a multiyear secular growth business.\n\nOn APM, the team has done a really nice job under Denise's leadership of unlocking capacity in our highest value product lines and leveraging scarce inputs to really enhance our customer and product mix throughout the year. So a lot of work happening there. And then obviously, behind that, we've approved some expansion investments that are going in, that will really put these high-growth businesses in overdrive starting in '24 and beyond. So I'd say the team has done a really nice job unlocking capacity on existing assets, biasing the mix, and that's really driven both variable margin and EBITDA margin.\n\nOn TSS, outside of the seasonality, that business continues to perform very well, both from a growth and a pricing perspective. Lots of innovation happening in this business as well. You will have read recently of the award that we received from AHR with respect to our Opteon XP41. So we continue to show that we can really drive earnings here based on the growth in Opteon and our customer centricity in all markets around the world.\n\nSameer, I don't know if you have any additional comments?\n\nSameer Ralhan -- Senior Vice President, Chief Financial Officer\n\nYes, Mark, I think you covered all the points. But I think on the margin side, only other point I would make is as we kind of get into the Q4, we are going to see some of the raw material cost inflation again as some of these things just kind of flow through the pipeline into the inventory. But I think in the Q4, we are going to see some of the impact. And also in Q4, the regional mix changes.\n\nSo I just want to point to that as well because as we exit the Northern Hemisphere and the business moves more toward a little bit heavier on the Southern Hemisphere side, the margins tend to be a little lower on that end, given the product mix. So you're going to see a little bit of that as we kind of move into Q4 as well.\n\nJohn McNulty -- BMO Capital Markets -- Analyst\n\nGot it. OK. No. That's helpful.\n\nAnd then maybe I can just ask a follow-up on the Titanium Technologies platform. So I mean, it looks like just the implied guidance when you kind of triangulate between APM and TSS, it kind of looks like TT is coming in with EBITDA, it's going to be two digits instead of three. So somewhere in the, I don't know, $80 million to $100 million range, maybe even a little bit lighter than that in the fourth quarter. I guess when you get through the heavy cost that you have with the high-cost ores and maybe running lighter for destocking, I guess, how big of a jump up can you get as you get into like the 2Q and 3Q next year? I mean, can we see kind of a -- is it relatively steep or is this something where you gradually grind higher? Because it does seem like TT is coming in at levels that admittedly, we weren't sure we would see again.\n\nMark Newman -- President and Chief Executive Officer\n\nYes. So again, John, I think your observation on the math is not far off. And I would just say our view is, we want to do the right thing long term for the business by adjusting production schedules against demand. And clearly, as Sameer alluded to, we're still working through on the P&L, higher cost inventory that we bought early in the year.\n\nSo the focus of this team is to get this business back to our 25% target margin over time. That will take a little time from where we are today and certainly where we exit the year. But the team is singularly focused on achieving that. And clearly, we are going to have a couple of rough quarters here as we adjust production schedules.\n\nBut if you look at the earnings over sort of a trailing 12-month basis, these are a lot better than prior lows that we've seen without TVS. The other point I would make is when I look at our TT business and the quality of our assets, the fact that we're tied to the U.S. energy supply versus European and our book of business on TVS, I feel like in terms of weathering the turbulence, we're well set up here versus some of our competitors. So I think you should put that in the mix as well.\n\nJohn McNulty -- BMO Capital Markets -- Analyst\n\nGot it. Thanks very much for the call. Appreciate it.\n\nOperator\n\nYour next question comes from the line of Mike Leithead from Barclays. Your line is open.\n\nMike Leithead -- Barclays -- Analyst\n\nGreat. Thanks. Good morning. First question, I just kind of wanted to follow up on the last one, just on the implied 4Q earnings outlook.\n\nCan you maybe just walk through high level how you're thinking about the split between the segments? And then related to, again, the last question, maybe you could help us frame just kind of what might be seasonal or transitory like that high cost COGS that are running through maybe over the next quarter or so versus maybe what we should expect carrying into the early part of next year, just given where the macro is.\n\nMark Newman -- President and Chief Executive Officer\n\nSo Mike, we don't guide by segment or by quarter, really. So what I'd say is our full year guide that we provided in September still stands, and we expect to be within that guidance range. Clearly, I think we're acknowledging as we have in our materials that we're going through a bit of an adjustment on TT. And really, it's trying to align our production schedules with demand in a way that allows us to finish the year with better inventories on our own side.\n\nAnd we would expect this demand decline to bottom in the next couple of quarters, probably as we go into 1Q of next year. So we're going to have a couple of quarters here with TT where we're making these adjustments. By the way, this team was very focused when the market was very tight on meeting customer needs, and we achieved very high delivery to promise. And I have no doubt that this team, being now more focused on the cost side, will make real progress as we go into next year.\n\nMike Leithead -- Barclays -- Analyst\n\nFair enough. And then secondly, the recent $200 million capacity expansion in Nafion. I was just hoping, maybe you could give us a bit more color, just relative size of expansion, how far along that extends your ability to serve the market and if you're willing to give anything in terms of IRR or payback periods?\n\nMark Newman -- President and Chief Executive Officer\n\nYes. I'll start with the last question. These are very high-return projects well in excess of our cost of capital. So these are great expansion projects to do.\n\nWe've said that we expect the electrolyzer and fuel cell membrane market to be somewhere between $2 billion and $3 billion by 2030. And so this announced capacity we would expect to come online late in '24, early '25. And based on a lot of the announced expansions we'll be hitting the market in stride at a very good time. As I said earlier, when you look at the APM results, you're seeing the impact of that team liberating capacity on existing assets on high-value markets like membranes.\n\nSo that will continue through next year, actually through this new capacity coming online, but view this as a very significant increase in our membrane capacity consistent with our goal of continuing to have a very meaningful share and being a market leader in membranes.\n\nMike Leithead -- Barclays -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nYour next question comes from the line of Matthew DeYoe from Bank of America. Your line is open.\n\nMatthew DeYoe -- Bank of America Merrill Lynch -- Analyst\n\nMorning. Is there any risk that you won't be able to debottleneck certain fluoro products kind of given community pushback? I know the Wilmington Cape Fear [Inaudible], at least the press in that region hasn't been too positive as it relates to potential expansion in Fayetteville. So is that kind of the Nafion expansion? Is that happening elsewhere? Is there any reason why you maybe couldn't get that done?\n\nMark Newman -- President and Chief Executive Officer\n\nAs we see things today, Matt, we're quite confident that we will get it done. We continue to have very good engagement with the local DQ and the local community. And so this debottlenecking is sort of within our permitted capacity today. So I wouldn't expect us to have any issues whatsoever.\n\nMatthew DeYoe -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. And I know it's early, but if we think about price next year for TSS or at least kind of the cadence as we move through the year, you'll have Opteon price concessions to auto OEMs. So I usually think about it starting as somewhat negative, but will you have continued roll-through on the legacy HFC side that will keep price up? Or should we think about it as flat? How does that look now, I guess?\n\nMark Newman -- President and Chief Executive Officer\n\nSo clearly, with the adoption of the AIM quotas earlier this year, we've had very good pricing activity consistent with the quota mechanism. We're not expecting that we would have the same kind of year-over-year price change that we saw going into the quota mechanism. Clearly, there's a stepdown as we go into 2024, which will provide a different market dynamic. But we expect this business to continue to have good pricing and good volume growth with the rollout of Opteon.\n\nSameer?\n\nSameer Ralhan -- Senior Vice President, Chief Financial Officer\n\nYes. Thanks, Mark. Matt, there's other couple of things I would add as you kind of think about the pricing and the mixes of the businesses, also the aftermarket side of the business. As the Opteon adoption happens and Opteon is expanding, we should see an expansion on the aftermarket side as well, which is a little better pricing and better margin for us.\n\nSo that should be helpful as well as we're going to move forward.\n\nOperator\n\nYour next question comes from the line of Josh Spector from UBS. Your line is open.\n\nJames Cannon -- UBS -- Analyst\n\nThis is James Cannon on for Josh. Thanks for taking my question. I was just wondering if you could give some color on the volume declines in the Titanium business. How much of that is on the contract of the Flex business? And whether or not you're seeing any pressure or pushback on some of the negotiations there?\n\nMark Newman -- President and Chief Executive Officer\n\nYes. So I'd say, as we have said, the majority or about 80% of our business is contracted. So I'd say with the volume decline, it's really reflecting the decline in demand of our contracted customers. As you saw in our release, prices remain relatively flat sequentially.\n\nAnd the way I kind of think about that is we continue to see good price activity on our contracted book. But clearly, spot prices, which we have on our Flex portal have come off from prior highs. So I would say that's the kind of volume price mix that you're seeing in the quarter.\n\nSameer Ralhan -- Senior Vice President, Chief Financial Officer\n\nYes. The only other point I would make, James, is as you got to think about the volume equation, I would think a little bit more from a regional perspective rather than from our channel perspective. As Mark said in his opening remarks and earlier as well is, it's Europe and Asia is where we have seen the majority of the volume decline. North America is holding up and Latin America has been a pretty good market for us as well.\n\nJames Cannon -- UBS -- Analyst\n\nOK. Great. And then on the APM side, we talked about the capacity expansions there. If we were to assume the growth rates that you're seeing pan out, could you quantify how much additional capacity could be needed by 2030?\n\nMark Newman -- President and Chief Executive Officer\n\nYes. So certainly, as it relates to membranes, this will serve our needs for the foreseeable future. As we look out from here today, I think I've said this before previously, we think a capex envelope for the whole company of somewhere between $400 million and $450 million is a pretty reasonable estimate to support our growth aspirations in all of our businesses, especially APM and TSS. And the significant capital expenditure we're making on best-in-class abatement technologies to achieve our corporate responsibility commitment of reducing fluoro-organic compounds by 99% -- 99.9%.\n\nSo I think there's no worry in my mind that we'll get meaningfully outside this capex envelope across our three businesses as we move forward into.\n\nJames Cannon -- UBS -- Analyst\n\nOK. Great. Thank you, guys.\n\nOperator\n\nYour next question comes from the line of Hassan Ahmed from Alembic Global Advisors. Your line is open.\n\nHassan Ahmed -- Alembic Global -- Analyst\n\nMorning, Mark and Sameer. I just wanted to revisit some of the comments you made about the volumes in TT. Look, 8% sequential declines in volumes. And when I compare and contrast that to what I'm hearing from some of your competitors, arguably with European sort of bias, those volume declines sequentially are as high as 25%.\n\nSo I'm just trying to understand if you could give me some color around what the market looks like right now? Demand-wise, are you doing materially better than the broader market and the like?\n\nMark Newman -- President and Chief Executive Officer\n\nHassan, good morning. It's a great question. So clearly, when we look at our regional mix, we're probably more exposed to North America than some of our competitors who have a bigger exposure to Europe. And so to the earlier comment of seeing a pretty dramatic falloff in volumes in Europe and Asia, especially Mainland China, I think that works into the equation.\n\nAs some of the other analysts have commented, clearly, we would expect more dramatic volume declines going into Q4 to really adjust our production schedules to what we're seeing, again, in Europe and in Asia Pacific. So I kind of look at this over Q3 and Q4 to sort of get more in line with where the market is. But clearly, our regional mix is more biased to North America, one; and two, our production mix is also very biased to North America where I think we can benefit for example, as natural gas prices and other input costs come down.\n\nHassan Ahmed -- Alembic Global -- Analyst\n\nAnd as a follow-up, more on the lines of the overall portfolio. I mean, obviously, you guys continue to show us the growth nature of the APM business, the TSS business. And fortunately or unfortunately, again, the industry, yourselves included, have done a great job in I guess reducing the cyclicality within TT, but it's pretty clear that it remains there. So how are you thinking about the overall portfolio as it sits right now? I mean is there some thought process of maybe a broader split between the grow their side of the business and the more cyclical side?\n\nMark Newman -- President and Chief Executive Officer\n\nYes. So Hassan, I would say I'm very focused and this leadership team is singularly focused on the four strategic priorities. And we think those four focus areas will generate significant shareholders' return over time. This is a bit of a marathon, not a sprint.\n\nAnd clearly, we remain focused despite sort of the near-term headwinds in TT on this longer-term strategy. So I think we've never said that there's any sort of deep commercial tie between our fluorine business and our TT business. So I think we've always been clear. But as it relates to any restructuring, clearly, that's something that we would work on with our Board at the appropriate time, but certainly no intention to move down that path today.\n\nHassan Ahmed -- Alembic Global -- Analyst\n\nVery helpful, Mark. Thank you so much.\n\nOperator\n\nYour next question comes from the line of Vincent Andrews from Morgan Stanley. Your line is open.\n\nWill Tang -- Morgan Stanley -- Analyst\n\nHey, guys. This is Will Tang on for Vincent. Thanks for taking my question. So should we expect, I guess, TiO2 EBITDA margins to kind of remain below that 20% range as long as kind of overall market demand is relatively weak? And then I know you talked about your goal of getting back to kind of 25% EBITDA margins in the TT business.\n\nBut outside of maybe pricing and volume recovery, what are the things that kind of need to happen in order to get there?\n\nSameer Ralhan -- Senior Vice President, Chief Financial Officer\n\nYes. Will, this is Sameer. I'll kick off. Essentially, as you're going to look at the margin, as Mark said, right, in Q4 and as going to get through Q1, we'll get through the high-priced inventory that we have.\n\nSo I think once we get through that, we'll be in a much better position. But overall, from a margin perspective, yes pricing, those things are leveled, at the same time, we are aligning our production along with the demand as well. So that should be helpful in getting the margins in a better position as well. So I think that's the way you should look at it.\n\nOur goal is to get into the low to mid-20s over time. But as said, we're going to give to the '23 guide, we'll be giving you more sort of view around what the margins may look like for '23.\n\nWill Tang -- Morgan Stanley -- Analyst\n\nGotcha. OK. And then I guess given the weaker TiO2 demand that we're seeing, what are you guys seeing kind of upstream in the ore market? Are you seeing a kind of significant amount of kind of further loosening in that to be there?\n\nSameer Ralhan -- Senior Vice President, Chief Financial Officer\n\nYes. Look, I mean, I think as I said earlier, right, Will, we've been having very active dialogue with all of our suppliers, all our strategic suppliers with respect to aligning the production with the demand and what that means in terms of the cost for us as well because, ultimately, we want to drive a long-term kind of win-win situation for everyone. So yes, we have started seeing some movement on that side as well, which is in the positive direction for us.\n\nWill Tang -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Laurence Alexander from Jefferies. Your line is open.\n\nKevin Estok -- Jefferies -- Analyst\n\nHey. Good morning. This is Kevin Estok on for Laurence. My first question is, I was just wondering what your perspective is on inventory levels of your customers heading into winter compared to like normal levels? And my second question is, so if interest rates stay elevated, I guess, wondering if at all, how that affects and how you think about your margins required for expanding -- for margins to expand in TiO2?\n\nMark Newman -- President and Chief Executive Officer\n\nKevin, I wouldn't say inventories are elevated across the board for sure. But if we just focus on TiO2 for a moment, clearly, the slowdown in Europe and China has been quite dramatic. And I think our end customers are adjusting their inventory levels accordingly. In the Americas and especially North America, I'm of the view that inventory levels are in line with where our end customers want them.\n\nAnd in fact, I would say, as we prepare for the coating season, there could be even some inventory builds in anticipation of a robust coating season. I just want to remind everybody that the U.S. consumer remains very strong. So while we're seeing the impacts of, I would say, higher energy pricing on the European consumer and the COVID lockdowns in China, we are seeing very robust North American customer activity and end consumer activity.\n\nSo our expectation is we haven't really seen any meaningful change in our North America book. And in fact, year over year, we're seeing growth still on a revenue basis. So I just want us to make sure we keep that in mind.\n\nOperator\n\nAnd your next question comes from the line of Roger Spitz from Bank of America. Your line is open.\n\nRoger Spitz -- Bank of America Merrill Lynch -- Analyst\n\nThank you and good morning. I wonder if you would consider [Inaudible] for the global TiO2 industry, what you think 2022 growth or decline might be versus 2021? And if you have any preliminary thoughts like 2023 versus 2022 could look like. It's not back or what have you.\n\nMark Newman -- President and Chief Executive Officer\n\nRoger, I read some of the analyst reports in terms of the overall industry. And I suspect based on how weak the second half has been, there is some suggestion that we could be down a couple of percentages as an industry this year on volume. And as it relates to next year, obviously, we'll start the year with a weaker first half, but the projection for next year would really depend on sort of the overall global macro assumptions, which I think are still emerging.\n\nRoger Spitz -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And when you say in your remarks that you've idled TiO2 capacity, can you give any sense of what percent of your total capacity? And just so I understand, when you idle capacity, are you taking down -- idling some lines at plants versus, say, for a time idling an entire plant like [Inaudible], Asia is weak, let's idle all of the Taiwan facility for a time?\n\nMark Newman -- President and Chief Executive Officer\n\nSo Roger, we don't disclose that information. We consider that something that we want to keep close to the vest. But we have the flexibility of taking down individual lines at our plants. As you know, our plants are quite large relative to our competitive set.\n\nSo when we idle a line that could be equivalent to a competitor idling a plant given the size of our facilities. So that should help you sort of dimensionalize when we say we're taking some idling, one of our lines is quite significant.\n\nSameer Ralhan -- Senior Vice President, Chief Financial Officer\n\nAnd Roger, this is Sameer. I'll just add to that is as you kind of think about our plants, right? As you kind of think about the flexibility with respect to the ore mix that we can use, so we can flex our capacity quite a bit and optimize our cost structure based on the market conditions with that strength of the technology as well.\n\nRoger Spitz -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And just one last one on this one is, when you do idle a line at a facility from a physical and cost standpoint, is it onerous or is it relatively easy and not terribly cost when you do that?\n\nMark Newman -- President and Chief Executive Officer\n\nRoger, this is something our team knows how to do very well. So I would say our TT team, it's one thing they're really great at is manufacturing, and they know how to simultaneously bring a line down, take cost out of the system but be ready to bring that line back up very quickly based on market demand. So think of this as a very flexible approach. Clearly, as we design Ti-Pure Value Stabilization, we had in mind our manufacturing flexibility both from an ore and a line-loading perspective.\n\nAnd so we're just following our playbook, which has proved very successful over time.\n\nRoger Spitz -- Bank of America Merrill Lynch -- Analyst\n\nThanks very much. Appreciate it.\n\nOperator\n\nAnd there are no further questions at this time. Mr. Mark Newman, I turn the call back over to you for some final closing remarks.\n\nMark Newman -- President and Chief Executive Officer\n\nThank you, Rob, and thank you all for joining us today. As I thought about the increasing uncertainty in the global macro environment, I'm very thankful for the high-caliber team we have here at Chemours that's staying focused on meeting the needs of our customers and running our business as well. As we've covered today, we are going through some transitionary issues on TT as we adjust production to meet demand. But we're also very focused on capturing the full growth potential of TSS and APM.\n\nAnd we're doing that at a time when we're growing earnings year over year. We're generating a lot of cash. In fact, this will be the third year that we've generated over $0.5 billion in free cash flow. And we sit with relatively low leverage.\n\nSo we're ready for what's coming at us in the next couple of quarters, whatever that may be. But I want you to understand that we all remain focused on our four key strategic priorities to create long-term shareholder value. And so I thank you again for your interest, and we'll be in touch.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJonathan Lock -- Senior Vice President and Chief Development Officer\n\nMark Newman -- President and Chief Executive Officer\n\nDuffy Fischer -- Goldman Sachs -- Analyst\n\nSameer Ralhan -- Senior Vice President, Chief Financial Officer\n\nArun Viswanathan -- RBC Capital Markets -- Analyst\n\nJohn McNulty -- BMO Capital Markets -- Analyst\n\nMike Leithead -- Barclays -- Analyst\n\nMatthew DeYoe -- Bank of America Merrill Lynch -- Analyst\n\nJames Cannon -- UBS -- Analyst\n\nHassan Ahmed -- Alembic Global -- Analyst\n\nWill Tang -- Morgan Stanley -- Analyst\n\nKevin Estok -- Jefferies -- Analyst\n\nRoger Spitz -- Bank of America Merrill Lynch -- Analyst\n\nMore CC analysis\n\nAll earnings call transcripts"
}