{
  "companyName": "Lululemon Athletica",
  "companyTicker": "LULU",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/09/lululemon-athletica-lulu-q3-2022-earnings-call-tra/",
  "content": "Lululemon Athletica (LULU 1.12%)\nQ3 2022 Earnings Call\nDec 08, 2022, 4:30 p.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the lululemon athletica inc. third-quarter 2022 conference call.\n\nAs a reminder, all participants are in listen-only mode and the conference is being recorded. After the presentation, there'll be an opportunity to ask questions. [Operator instructions] I would now like to turn the conference over to Howard Tubin, vice president, investor relations for lululemon. Please go ahead.\n\nHoward Tubin -- Vice President, Investor Relations\n\nThank you and good afternoon. Welcome to lululemon's third-quarter earnings conference call. Joining me today to talk about our results are Calvin McDonald, CEO, and Meghan Frank, CFO. Before we get started, I'd like to take this opportunity to remind you that our remarks today will include forward-looking statements reflecting management's current forecast of certain aspects of lululemon's future.\n\nThese statements are based on current information which we have assessed, but, by which, its nature is dynamic and subject to rapid and even abrupt changes. Actual results may differ materially from those contained in or implied by these forward-looking statements due to risks and uncertainties associated with our business, including those we have disclosed in our most recent filings with the SEC, including our annual report on Form 10-K and our quarterly reports on Form 10-Q. Any forward-looking statements that we make on this call are based on assumptions as of today, and we expressly disclaims any obligation or undertaking to update or revise any of these statements as a result of new information or future events. During this call, we will present both GAAP and non-GAAP financial measures.\n\nA reconciliation of GAAP to non-GAAP measures is included in our quarterly report on Form 10-Q and in today's earnings press release. In addition, the comparable sales metrics given on today's call are on a constant-dollar basis. The press release and accompanying quarterly report on Form 10-Q are available under the Investors section of our website, www.lululemon.com. Before we begin the call, I would like to remind our investors to visit our investor site, where you'll find a summary of our key financial operating statistics for the third quarter, as well as our quarterly infographic.\n\nToday's call is scheduled for one hour. So, please limit yourself to one question at a time to give others the opportunity to have their questions addressed. And now, I'd like to turn the call over to Calvin. \n\nCalvin McDonald -- Chief Executive Officer\n\nThank you, Howard. I'm happy to be here today to discuss our third-quarter results, which, as you've seen from our press release, continue to be strong and resilient while we navigate an external environment that remains challenging. At lululemon, innovation is at our core. We create apparel, footwear, and gear that offers technical solutions to our guests, as well as versatility and comfort with a variety of end users.\n\nBut that's just the starting point for us. Lululemon is a brand that stands for community with connection firmly at our core. We connect with guests through our educators and ambassadors, through our well-being offerings and local events, and now, through our new membership program and lululemon Studio. It is this combination of innovation and connection that differentiates lululemon from our peers and contribute meaningfully to the continued and sustained momentum we see across the business.\n\nOver the next few minutes, I'll highlight for you the trends we've experienced over the recent Thanksgiving weekend and what we're seeing in our business at the start of the holiday season. Then, I'll discuss Quarter 3 and speak to the balance strength we continue to see across our business in terms of geography, channel, and merchandise categories. Next, I'll update you on the supply chain environment and our inventories, and then, I'll speak to our product pipeline. And finally, I'll speak to the benefits of our direct-to-consumer model and several of the unique ways we enabled connection with our community.\n\nSo, let's jump in. I will start with our performance over Thanksgiving, as I'm sure it's top of mind for all of you. I'm pleased with our results and performance over the extended Thanksgiving weekend and as we start the holiday season. Over the past two weeks, I have traveled with several senior leaders across North America to cities including Phenix, Tampa, Orlando, New York, and Toronto.\n\nWe visited several stores in each market and saw a tremendous level of engagement from our team members, our guests, and every store. In fact, Black Friday was the biggest day ever in our history in terms of revenue and traffic driven by our results in both North America and around the world, with guests responding well to the innovation we offer across our product assortment. Our performance across markets and geographies shows that consumers are seeking brands like lululemon that offer innovative, versatile products and a strong community connection that they can't find anywhere else. We also recognize that the external environment remains challenging with several high-volume weeks still in front of us.\n\nThat being said, I'm encouraged with the beginning of our holiday season, and I am confident in how our brand is positioned in the near and long term. Now, I will speak to our performance in Quarter 3. Meghan will go through the details in a few moments, but I'll share with you some of the financial highlights. Our revenue growth remained strong and balanced across several drivers as follows, all on a three-year CAGR basis.\n\nStores increased 16%, while e-commerce grew 46%. By region, North America grew 24%, and international increased 42%. Revenue in mainland China grew nearly 70 %, and we experienced strength across merchandise categories, with men's up 28%, women's up 23%, and accessories growing at 52%. Adjusted earnings per share increased 23% versus last year and 28% on a three-year CAGR basis.\n\nAnd our market share gains continue. While the adult active apparel industry decreased its U.S. revenue by 4% in fiscal Quarter 3 '22 compared to the same period last year. Lululemon gained 1.5 points of market share in the U.S.\n\nover this time, the most of any brand in this market, according to the NPD Group's Consumer Tracking Service. These results are only possible due to the strength and dedication of our people around the world. To our teams in our stores, in our distribution centers, and call centers, and in our store support centers, I would like to express my gratitude on behalf of the entire leadership team. You connect with our guests every day, execute against our growth plans, and continue to support one another, all of which enable the financial results we deliver quarter after quarter.\n\nTurning now to supply chain and our inventories. We continue to see improvements across our supply chain. Our factories have now returned to pre-pandemic levels of production efficiency. In addition, ocean delivery times are continuing to improve from the 70 days we experienced last quarter.\n\nI'm also excited to share that we recently opened our Tilbury distribution center, located near Vancouver, to support demand in western Canada. This DC is a great example of our ongoing investment in strategic foundational infrastructure projects that will help fuel our Power of Three x2 growth plan. In terms of inventory, we ended Quarter 3 with dollar inventory up 85% on a one-year basis and units up 38% on a three-year CAGR basis, both metrics in line with our expectations. As we discussed, our inventory levels were too lean last year, and we made the strategic decision to build inventories this year, which enabled the strong top-line growth we have delivered.\n\nMeghan will share additional details. And we remain comfortable with both the quality and quantity of our inventory. We continue to leverage our core styles, which account for approximately 45% of our total inventory and carry limited seasonal markdown risk. I'd also note that Quarter 3 will represent the high point for our inventory on a one-year dollar basis.\n\nAnd as we enter Quarter 4, we are well positioned to be in stock throughout the holiday season. I will now spend a few minutes speaking about product. As you know, innovation at lululemon is fueled by our science and field development platform. Our teams focus first on identifying the unmet needs of our guests, and then, we view them through the lens of activities to develop new franchises and other hero items that are versatile and innovative.\n\nQuarter 3 had some great examples of how we bring the strategy to life. In footwear, we launched our fourth style, Strongfeel. Like the other technical styles rolled out this year, Strongfeel was designed for women first, which differentiates us from many of our peers who create shoes for men and then adapt them for women. Strongfeel is a technical training shoe designed to keep the foot anchored and secure during workouts, and we're encouraged by the initial guest response.\n\nAs I've mentioned before, footwear is a test-and-learn category for us, and it represents a small portion of the growth we anticipate over the next five years. This allows us to build into the potential at an appropriate pace as we learn and make adjustments. That being said, we're excited about the potential opportunity in this category, and we were pleased to be recognized by Footwear News with the Launch of the Year award presented during their 36th Annual Achievement Awards last week in New York. Turning now to franchises.\n\nIt's great to see how our teams continue to build out our range of Wunder Puff offerings. We started with a single women's jacket and have expanded into 11 styles within this outerwear franchise across women's, men's, and accessories. Our results show that our guests respond extremely well to the breadth of options. While last year we were constrained in terms of inventory, particularly in outerwear, we are well positioned with Wunder Puffs for the holiday season and expect to meet guest demand.\n\nAs we look forward, franchise development represents a unique and distinctive opportunity for lululemon with Align Scuba and Define as a few examples, all of them beginning with a singular style and then expanding into popular multiple style offerings. And this is just the beginning. We will continue to introduce, expand, and grow our franchise business into the future. Let me now shift gears and speak to another one of lululemon's key competitive advantages: our DTC model.\n\nOur ability to connect directly with guests in real time and across both our physical and digital channels gives us a number of ways to engage beyond a purchase transaction. In Quarter 3, we launched our new membership program, began to hold local 10K races for the first time since the pandemic began, and we brought focus to World Mental Health Day around the world with a notable activation in China. Some highlights are, in early October, we successfully launched our new two-tier membership program in North America. The Essential tier is free to everyone and offers unique benefits to members, including early access to product drops, exchange or credit on sale items, and invitations to virtual community events.\n\nThe premium tier of the program, lululemon Studio, represents the evolution of MIRROR into a much more engaging hybrid fitness offering. We've extended our collective by partnering with some of the best fitness studios and instructors to bring even more classes to our members, both digitally and in real life. To join, members purchase a lululemon Studio MIRROR, agree to a $39 monthly subscription, and receive many exciting new benefits. Another way we engage with guests is through our 10K runs.\n\nWe sponsored two races in Atlanta and in Houston, and we're excited by the response. We paused these experiences during the pandemic. So, I'm thrilled that we have been able to hold these large-scale community activations once again, bringing together our guests, local teams, and ambassadors to extend our community connection. And in China, we brought attention to World Mental Health Day in October with a month-long campaign aimed at inspiring people to take positive actions toward improving their physical, mental, and social well-being.\n\nThis included in real-life events focused on wellness, media partnerships, and the launch of a digital well-being hub on WeChat. These examples bring to life the unique ways we connect with our guests and our communities across the globe. This enduring strength of lululemon demonstrates our ability to be globally strong and regionally relevant as we foster a deeper relationship with lululemon for existing and, importantly, new guests. All of this increases brand awareness, drives traffic to our stores and websites, and ultimately results in higher purchase consideration engagement with lululemon.\n\nBefore handing it over to Meghan, I wanted to speak further about our international business. As you know, our plans call for a quadrupling of international revenue over five years, from 2021 to 2026, and I'm very pleased with how our leaders and local teams are executing against that goal. This was reinforced for me during my recent visits to the United Kingdom and Australia. I toured both markets with our local leaders and team members and got to experience firsthand the energy and excitement of our stores and our recently optimized locations in Australia.\n\nIt's also exciting to see how we are elevating the guest experience in these markets with the recent rollout of ship from store and enhanced endless aisle capabilities in both regions. With strong leaders in each of these markets and across our international business, I am energized by our ability to continue to strategically expand lululemon across geographies. The potential is considerable. And building upon the momentum from our recent market entry into Spain, we opened another iconic location in Europe just last week with a store on the Champs-Elysees in Paris.\n\nIn the heart of one of the city's main shopping districts, this store will enable us to grow brand awareness, both in France and across Europe, given this is such a popular tourist destination. While our growth prospects are balanced across geographies, international represents a key piece of our Power of Three x2 growth plan. We're off to a great start, and I look forward to sharing more with you on future earnings calls. With that, I'll now turn it over to Meghan.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, Calvin. I'm pleased that our momentum continued in Q3 and we were able to deliver both top- and bottom-line results, which exceeded our guidance. The holiday season is also off to a good start with strong traffic over the extended Thanksgiving weekend and a positive guest response to our holiday merchandise assortment. In addition, we're in a much better inventory position this year to meet guest demand.\n\nHowever, I also want to acknowledge that we have several large volume weeks ahead of us, and our teams remain focused on connecting and engaging with our guests. Let me now share the details of our Q3 performance. I will also discuss specifics on our balance sheet, including our inventory and cash position. Please note that when comparing the financial metrics for Q3 2022 with Q3 2021, the adjusted operating results for Q3 2021 exclude $0.18 of expense related to the acquisition of MIRROR.\n\nYou can refer to our earnings release for more information and reconciliations to our GAAP metrics. For Q3, total net revenue increased 28% to 1.86 billion, ahead of our guidance. Comparable sales increased 25% with a 17% increase in stores and a 34% increase in digital. On a three-year CAGR basis, total revenue increased 27%.\n\nIn our store channels, sales increased 28% on a one-year basis and 16% on a three-year CAGR basis. Productivity continues to trend above 2019 levels. And although we had 22 stores closed in mainland China in the last week of November, we currently have 99% of our fleet open globally. We ended the quarter with a total of 623 stores across the globe.\n\nSquare footage increased 19% versus last year, driven by the addition of 71 net new stores since Q3 of 2021. During the quarter, we opened 23 net new stores and completed seven co-located optimizations. In our digital channel, revenues increased 46% on a three-year CAGR basis and contributed 767 million of top line, or 41% of total revenue. Within North America, revenue increased 24%, and within international we saw 42% increase, both on a three-year CAGR basis.\n\nAnd by category, men's revenue increased 28% on a three-year CAGR basis, women's increased 23%, and accessories grew 52% on the same basis. I'm also excited that we continue to see strength and traffic across both channels. In stores, traffic increased nearly 25%. And in our digital business, traffic to our e-commerce sites and apps globally increased nearly 50%.\n\nOn a three-year CAGR basis, traffic is up 9% in stores and over 41% in e-commerce. This speaks to the strength of our omni operating model as we engage with our guests in ways most convenient to them. Gross profit for the third quarter was 1.04 billion, or 55.9% of net revenue, compared to 57.2% of net revenue in Q3 2021. Our gross margin decrease of 130 basis points relative to last year was driven primarily by 60 basis points of deleverage from foreign exchange within gross margin, which was somewhat offset by a 20-basis-point FX benefit with SG&A a 40-basis-point decrease in product margin, driven primarily by higher markdowns and inventory provisions relative to low levels last year, partially offset by lower airfreight expense; and 30 basis points of deleverage on fixed costs, driven primarily by investments in our product teams and distribution centers, offset somewhat by leverage on occupancy and depreciation.\n\nWhen looking at markdowns versus 2019, they were relatively flat and in line with our expectations. The decline in gross margin was larger than our guidance of 50 to 70 basis points, driven predominantly by FX and regional revenue mix. From a regional standpoint, while revenue growth in China was strong for the quarter, it was below our expectations due to COVID-19 impacts. Moving to SG&A.\n\nOur approach continues to be grounded and prudently managing our expenses while also continuing to strategically invest in our long-term growth opportunities. SG&A expenses were 684 million, or 36.8% of net revenue, compared to 37.6% of net revenue in Q3 2021. The leverage in the quarter versus Q3 2021 resulted from leverage in our stores and other channels on corporate SG&A and on foreign exchange. This was offset somewhat by an increase in depreciation and amortization.\n\nOperating income for the quarter was 352 million, or 19% of net revenue, compared to adjusted operating margin of 19.4% last year. Tax expense for the quarter was 97 million, or 27.6% of pre-tax earnings, compared to an adjusted effective tax rate of 25.1% a year ago. The increase relative to last year is due primarily to an accrual for withholding taxes on a portion of fiscal 2022's Canadian earnings and a decrease in tax deductions related to stock-based compensation. Net income for the quarter was 255 million, or $2 per diluted share, compared to adjusted earnings per diluted share of $1.62 in Q3 of 2021.\n\nCapital expenditures were 176 million for the quarter, compared to 123 million in the third quarter last year. Q3 spend relates primarily to investments that support business growth, including our multiyear distribution center project; store capital for new locations, relocations, and renovations; and technology investments. Turning to our balance sheet highlights. We ended the quarter with 353 million in cash and cash equivalents and nearly 400 million of available capacity under our revolving credit facility.\n\nInventory at the end of Q3 was 1.7 billion, in line with our expectations. This reflects one-year dollar growth of 85% and a three-year unit CAGR of 38%. In-transit inventory is up relative to 2019 and is contributing approximately three percentage points to the three-year unit growth rate. I'd also note that core seasonless product continues to make up approximately 45% of our inventory.\n\nWe remain pleased with our inventory levels, which positioned us well to fulfill guest demand in Q4. Looking forward, on a one-year dollar basis, we expect the inventory growth rate at the end of Q4 to begin to moderate and increase approximately 60% relative to last year. On a three-year CAGR basis, we expect unit growth to be approximately 39% at the end of Q4. During the quarter, we repurchased approximately 55,000 shares at an average price of approximately $311.\n\nAt the end of Q3, we had approximately 812 million remaining on our recently authorized $1 billion repurchase program. Let me now shift to our guidance outlook. We're pleased with the start of the holiday season. However, the environment remains dynamic, and we still have approximately two-thirds of the quarter ahead of us.\n\nFor Q4, we expect revenue in the range of 2.605 billion to 2.655 billion, representing one-year growth of 22% to 25% and a three-year CAGR of 23% to 24%. We expect to open approximately 30 net new company-operated stores in Q4. We expect gross margin in Q4 to increase 10 to 20 basis points relative to Q4 of 2021. We expect to see an improvement year over year in product margin driven by lower airfreight expense, which will be partially offset by continued FX pressure and the timing of expenses related to our supply chain investments.\n\nWe expect markdowns to be in line with 2019 levels. In Q4, we expect our SG&A rate to leverage 30 to 50 basis points relative to Q4 2021. Turning to EPS. We expect adjusted earnings per share in the fourth quarter to be in the range of $4.20 to $4.30 versus adjusted EPS of $3.37 a year ago.\n\nFor the full-year 2022, we now expect revenue to be in the range of 7.944 billion to 7.994 billion. This range assumes our e-commerce business continues to grow approximately 30% relative to 2021. When looking at total revenue, our guidance implies a three-year CAGR of 26%, which continues to be higher than our three-year revenue CAGR of 19% leading up to 2020, and higher than the target of approximately 15% growth we set forth in our new Power of Three x2 growth plan. We now expect to open 79 net new company-operated stores in 2022, up modestly from our prior guidance of 75.\n\nOur new store openings in 2022 will include 45 to 50 stores in our international markets and represents a square footage increase in the low 20% range in total. For the full year, we forecast gross margin to decrease between 100 and 140 basis points versus 2021. The reduction relative to last year is driven predominantly by foreign exchange, a more normalized level of markdowns relative to the low levels we experienced last year, and increased investment in our DC network. Turning to SG&A for the full year.\n\nWe forecast leverage of 100 to 140 basis points versus 2021, driven predominantly by increased sales. And when looking at adjusted operating margin for the full-year 2022, we expect it to be approximately flat versus last year. For the full-year 2022, we expect our effective tax rate to be 28% to 28.5%. For Q4, we expect our effective tax rate to be approximately 28.5%.\n\nFor the fiscal year 2022, we expect adjusted diluted earnings per share in the range of $9.87 to $9.97 versus adjusted EPS of $7.79 in 2021. Our EPS guidance excludes the impact of any future share repurchases and the gain on the real estate sale we realized in Q2. We now expect capital expenditures to be approximately 630 million to 655 million for 2022. The increase versus 2021 reflects increased investment in our supply chain digital capabilities, new store openings and renovations, as well as other technology and general corporate infrastructure projects, including our multiyear project to increase our distribution capabilities to support our future volume and growth.\n\nAnd we are also ramping up our square footage growth relative to last year and now intend to open 79 stores versus our prior expectation of 75. Our range of 630 million to 655 million is approximately 8% of revenue, in line with our current Power of Three x2 target of 7% and 9%. Thank you. And with that, I'll turn it back over to Calvin for some closing remarks.\n\nCalvin McDonald -- Chief Executive Officer\n\nThank you, Meghan. In closing, I just want to reiterate how pleased we are to see the continued momentum in the business and our strong start to our Power of Three x2 growth strategy. As we look to Quarter 4 and into 2023, I am confident in both our near- and long-term plans that will enable us to deliver on our goals while continuing to successfully navigate whatever comes our way. I look forward to taking your questions now.\n\nOperator.\n\nOperator\n\nThank you. We will now begin the question-and-answer session. [Operator instructions] Our first question is from Adrienne Yih with Barclays. Please go ahead.\n\nAdrienne Yih -- Barclays -- Analyst\n\nThank you very much. And may I say congratulations? Very well done. Calvin, I wanted to focus a little bit on China. You talked about what kind of strong retailer you're opening, the brand throughout the stores, they're committed to it this year and, obviously, I think probably for next year.\n\nSo, what are you seeing there? What is the split right now between stores and e-commerce as a percent of sales [Inaudible] Thank you.\n\nCalvin McDonald -- Chief Executive Officer\n\nHi, Adrienne. Thanks for the question. We're seeing very good growth across both store channel and our dot com channel. We don't -- we don't share the ratio between those two, but both contributed to growth in the quarter.\n\nAnd as -- as you indicated, the market continued to grow very strongly for us even with their ongoing challenges with -- with -- with COVID, where we saw store closures, reduced operating hours comparable to what we saw in Quarter 2. They're improving but just recently, and the team's doing a wonderful job managing through that. But the momentum in the brand across the categories in both genders and both channels remains very strong. And we're very excited about the potential of the brand to be able to continue to drive it through this year as we have and how the guest is responding to it.\n\nSo, remain very, very excited about the potential and the role that will play in quadrupling our international business, with mainland China playing a big part of that outperformance.\n\nAdrienne Yih -- Barclays -- Analyst\n\nOK. Thank you very much. Can we get the percent of sales [Inaudible]?\n\nCalvin McDonald -- Chief Executive Officer\n\nIn terms of growth in the quarter or [Inaudible] no, sorry, we don't share that.\n\nAdrienne Yih -- Barclays -- Analyst\n\nWell, [Inaudible] OK. Thank you very much. Best of luck.\n\nOperator\n\nThe next question is from Alex Straton with Morgan Stanley. Please go ahead. \n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thanks so much for taking my question. And of course, congrats on another great quarter. I wanted to just start with what you mentioned on the early holiday performance.\n\nSounds like you guys have been delivering a really impressive result compared to what we've heard across other specialty retailers this earnings season and even at our conference earlier this week. So, you guys are really kind of bucking the trend here. What would you attribute lulu's quarter-to-date outperformance to so far?\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks for the question. I'll break it into two -- two parts that are, you know, driving the momentum both in Q3, as well as to the start of Q4, where our guest metrics have been consistent, as I've shared, and remain very healthy across traffic, new guest acquisition, dollar spend, and the balance across our regions, our channels, our categories, and activities. But I think one of the primary drivers of our brand and momentum relative to others really sits with the brand positioning and the uniqueness of our brand with product focused on technical solutions, fabrics through our innovative approach of science of feel, and the versatility of how the guest uses our product from not just sweating but through on the move, our DTC model and community. And that connection that we have with the guest in Quarter 3, we were able to turn some of those physical connections back on and connected to the launch of membership.\n\nSo, there are really distinct aspects of the brand that separate us from many others in this space and within the athletic, within retail, hence, I think, the share gains and the overall success. I also think some of the decisions we made as a management team early on, decisions around pricing, decisions around balance of air to have the products, and our decision around inventory has allowed us to continue to deliver on the demand side that we're seeing as we continue to see new guest acquisitions strong and the pricing decisions to really, you know, manage pricing to not move pricing aggressively has allowed us to continue to sell our regular price, not be forced into unnecessary markdowns or course correcting with promotional play like we're seeing happen in the marketplace. So, great products. Regular price is -- is still selling driven off of the uniqueness of the overall brand and position in the market.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nThat's -- that's super great color. Maybe one just final one for me. I wanted to touch on inventory. Similarly, juxtaposing you guys against some of the peers, we've seen many be able to work inventory levels down on a year-over-year basis.\n\nCan you just talk about why lulu's are more similar to the last quarter? And then, also, I think you may have taken the fourth quarter outlook up a little bit on inventory, maybe from 60% to 55% from 55% to 60%. So, I think a little bit higher than last time, correct me if I'm wrong, but you guys, can just talk about that dynamic for us? Thanks so much.\n\nMeghan Frank -- Chief Financial Officer\n\nYep, absolutely. So, end of Q4 inventory was in line with our expectations. We were under-inventoried last year. So, as Calvin mentioned, we strategically positioned inventory to be able to capture guest demand this year.\n\nAnd we've really been focused on that three-year unit CAGR, which is 38% at the end of the quarter, with three points driven by in-transit. And it is -- we are continuing to experience supply chain environment improving and vendor readiness improving. So, the team is adjusting to that new reality. That is reflected in the 60% color that we gave for year-end.\n\nSo, as you said, a little bit higher than the 55% to 60% we gave at the end of last quarter for end-of-year inventory, driven by that improving supply chain environment and vendor readiness.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nThanks so much. Good luck.\n\nMeghan Frank -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThe next -- pardon me. The next question is from Brooke Roach with Goldman Sachs. Please go ahead.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nGood afternoon and thank you so much for taking our question. Calvin, given the innovation pipeline at lululemon has been particularly strong this year, I was wondering if you could talk a little bit more about that into next year and where you think the product resonance can really improve as you think about managing consistent growth across your business and particularly in North America? Maybe within that, you could reflect on the glide path between the very strong one- and three-year CAGRs that you're performing now versus the longer-term target of 15%, and how you think about that growth maybe normalizing over the course of the next few years to that long-term target. Thank you.\n\nCalvin McDonald -- Chief Executive Officer\n\nGreat. Thanks, Brooke. So, in terms of the product pipeline, this year was definitely an exciting year across both our own categories and activities, our play activities, launch of footwear. Q3, like the first half of this year, saw a number of new innovations, both in -- in new fabrics fabrications into our proven franchises like the Align.\n\nAnd Q4, equally, we have some exciting innovation that has hit and will continue to, and the guest is responding very well. That's a proven formula for us. And when I look forward to 2023, we continue to and will continue to drop innovation across the core activities that we've identified, run, train, yoga; of the play, tennis, golf, and hike. And it's both new franchise or hero items, as well as extensions of some of our proven very successful franchises.\n\nGreat example of that is the Align franchise, one of our strongest, with the Nulu fabrication. And there's Nulu ribbed that dropped at the end of Q3, available now in Q4. And the guests are responding incredibly well to that. So, we have a number of innovative opportunities across creating completely new items and category extensions through franchise, as well as building on the ones in.\n\nAnd '23 is another very strong year of innovative launches, which I'm excited about continue to bring to market. And as you mentioned, we are, you know, after the first three quarters of this year ,trending above the guidance of the Power of Three x2 growth plan, which we're excited to see how the brand is responding and the guests are reacting to the newness and our new guest acquisition. We haven't changed our outlook and the commitment on the Power of Three x2 but obviously very pleased with our performance to date and as we look forward into next year.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nThank you. And if I could just squeeze one more in for Meghan. Meghan, can you help us with the approximate sizing of the airfreight FX and supply chain investment that is going into the gross margin in 4Q, and remind us how much of those pressures will be persisting into 2023?\n\nMeghan Frank -- Chief Financial Officer\n\nYeah, so, as we look at Q4, we do expect that, overall, on operating margin, we'll have similar pressure as we did in Q3 in terms of FX. So, we had a net -- net pressure of 40 basis points in Q3. We're expecting something similar for Q4. When we look overall at our operating margin for Q4, we see it expanding year over year in the 40 to 70-basis-point range with our guidance.\n\nVersus last year, in gross margin, we gave color of 10 to 20 basis points. We're seeing a benefit in product margin driven by lower airfreight, which will be partially offset by normalized markdowns in line with our 2019 levels. And then, also, mix of business. We also had that negative impact from FX.\n\nAnd then, we'll also have some pressure in gross margin related to fixed costs, particularly the timing of our DC investments, which are really positioned to enable our scale of the business over the next five years. And then, on the SG&A side, we're expecting 30 to 50 basis points of leverage, which would be driven by higher sales, as well as a little bit of a benefit on the FX side within SG&A.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nThank you very much.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, Brooke. \n\nOperator\n\nThe next question is from Matthew Boss with J.P. Morgan Please go ahead.\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nGreat. Thanks and congrats on another nice quarter. So, Calvin, on the material market share gains that you cited, where do you see the largest share opportunities remaining maybe across categories? And then, just to elaborate on the start of the fourth quarter, could you just provide any color on the cadence of shopping that you're seeing, maybe stores versus digital? And then, just given the comments on the encouraging start to 4Q, is it fair to say you've embedded moderation in the growth CAGR for the remaining two-thirds of the quarter relative to your start?\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks, Matt. So, on the -- on the last piece, in terms of the start of the quarter and what we're seeing, traffic was very -- very strong for us across both our online channel, as well as stores in Q3. And we're pleased with the continuation of strong traffic numbers into -- into this quarter. And there's still a lot of the quarter ahead.\n\nSo, you know, as we shared, we had a very strong Thanksgiving shopping weekend and -- and saw, you know, good results of our regular-price merchandise. And there are some, you know, critical weeks ahead. So, the teams just remain focused and managing accordingly as we, you know, get ready for -- for the holiday season. So, that's -- that's our approach on how we're, you know, monitoring and managing through.\n\nAnd the first part of the question -- oh, right, market share. Got it. Thank you. When I look forward in terms of our continual opportunity to grow market share, it's a combination of both in men's and women's categories, and our key activities that we've identified across run, train, yoga, tennis, golf, and hike.\n\nWe shared on our Analyst Day our opportunity in unaided brand awareness with him. We have seen a improvement in that, but it's, you know, well below what the potential is in other brands in our category space. So, we know, as we continue to drive awareness behind the brand and consideration, it's having an impact on our men's business. Pleased with the growth in the quarter of 28%.\n\nBut really just getting started in terms of the potential of more being aware of and considering lululemon in addition to as we continue to build out some of the assortment and unmet needs that we have around those core activities that we've focused on. And for her, although we have better unaided brand awareness, we are still below again, others in our category space. So, we still have opportunity. And women's OTM for us is an exciting opportunity to expand that relationship, share of wallet, and continue to drive market share.\n\nSo, market share gains, one, through unaided awareness and improving that to continue to drive our new guest acquisition, innovating within our core activities as we have identified. As I mentioned before, we're still early innings on the unmet needs and the potential that we see to continue to bring to market. And then, the option and the opportunity we have around, you know, women's OTM is a really exciting one for us, for her as well. So, a lot of opportunities that we have to continue to drive market share.\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nGreat color. Best of luck.\n\nMeghan Frank -- Chief Financial Officer\n\nThank you. \n\nOperator\n\nThe next question is from Lorraine Hutchinson with Bank of America. Please go ahead.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nGood afternoon. Just wanted to ask a few more follow-ups on gross margin. Do you still expect airfreight to be a 10-basis-point benefit to the full year? And have you changed your view at all on markdowns for the fourth quarter given the more promotional environment?\n\nMeghan Frank -- Chief Financial Officer\n\nHey, Lorraine. So, we are expecting airfreight to be slightly better for the full year. We have said 10 basis points last time, and it's come up to 50, and that is being offset by negative impact from FX, both for Q3 and Q4. And then, in terms of markdowns, we've been expecting markdowns to be in line with 2019 levels.\n\nAnd we did see that in Q3 and that remains our expectation in Q4. And we view that as a more normalized level for us as we compare to 2019. And still, as Calvin mentioned, very healthy, full-priced sell-throughs and no changes in plans for our markdown cadence.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks.\n\nOperator\n\nThe next question is from Rick Patel with Raymond James. Please go ahead.\n\nRick Patel -- Raymond James -- Analyst\n\nThank you. Good afternoon. Can you help us think about profitability by region? I'm just curious how that's tracking, given your strong demand globally versus strategic investments that you're also making. And where you see the most opportunity as you look out to the next year?\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, Rick. So, we are profitable across both our international and North America regions. We were pleased that Europe hit profitability last year. We continue to see opportunity across both North America and international over the longer term.\n\nWe're obviously in earlier stages in our international business, so, we'd expect to see more expansion there as we scale but see opportunities for scale across both regions.\n\nRick Patel -- Raymond James -- Analyst\n\nThanks very much.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks.\n\nOperator\n\n The next question is from Abbie Zvejnieks with Piper Sandler. Please go ahead.\n\nAbbie Zvejnieks -- Piper Sandler -- Analyst\n\nGreat. Thanks for taking my question. I was wondering if you had any category commentary. I know that, last year, you are specifically under-inventoried in some categories like outerwear, but any shift you're seeing there, and then, maybe commentary on belt bag as well.\n\nThank you.\n\nMeghan Frank -- Chief Financial Officer\n\nYeah, I would say in terms of categories, you know, we are seeing pretty balanced growth across our men's, women's, and accessories business, all in the double- digit range. We did have pockets of inventory where we were under last year. And notably, I call it, outerwear where we've seen more positive performance and believe we're in a strong inventory position as we enter Q4. In terms of the Everywhere Belt Bag, it's been a great style for us.\n\nAccessories growth obviously very strong. It's our No. 1 sell. We continue to innovate across all of our assortment as we move into Q4 and then into 2023 as well.\n\nAbbie Zvejnieks -- Piper Sandler -- Analyst\n\nThanks.\n\nOperator\n\nThe next question is from John Kernan with Cowen. Please go ahead.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nHey, good afternoon. Thanks for taking my question and congrats on navigating a tricky environment.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, John.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nMeghan, thanks for all the commentary on gross margin and inventory. I guess, when we look at the level of units but also the cost on the balance sheet, is there anything lingering in the cost of goods sold into next year from some of the higher sourcing costs earlier this year that might be a source of pressure on gross margin? Or do you -- are there offsets to that as we -- from supply chain as we go into next year?\n\nMeghan Frank -- Chief Financial Officer\n\nYeah. Thanks, John. I would say we're pleased with the inventory level as we move into Q4, obviously seeing some improvement in the supply chain environment. In terms of airfreight, we have seen that moderate throughout the year.\n\nWe do have a large portion of our inventory that is core, about 45%. So, that benefits us. We're not putting a fine point on margin for next year but remain committed to modest operating margin expansion over the longer term. And we'll come back and share more details on our outlook on our March call.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nGot it. I guess just a quick follow-up. Would supply chain costs be more of a benefit this year -- or next year, excuse me, as some of the container costs come down? Airfreight, obviously, already coming down, would supply chain costs be more of a benefit next year?\n\nMeghan Frank -- Chief Financial Officer\n\nYeah, so -- yeah, so, I -- there's two pieces to the supply chain costs. So, one is usage and then one is CPU. We are seeing lead times improve. We had called out 70 days on average last quarter.\n\nWe're seeing them improve modestly. I'd say they're still not back to historical levels there, but we're -- we are seeing some positive movements on the CPU front. And so, we continue to view that as an opportunity as we move into next year.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nExcellent. Thank you. Best of luck to the rest of the holiday.\n\nMeghan Frank -- Chief Financial Officer\n\nGreat. Thanks, John.\n\nOperator\n\nThe next question is from Mark Altschwager with Baird. Please go ahead.\n\nMark Altschwager -- Baird -- Analyst\n\nGreat. Thanks for taking my question. I'm curious what the early takeaways have been from the broader rollout of the Like New initiative. What are you seeing in terms of guest spend for those who have turned in used product? And similarly, curious if you can share anything else regarding the lululemon Studio launch and maybe shed some light on your expectations for the Studio MIRROR revenue for for this year and next.\n\nThank you.\n\nCalvin McDonald -- Chief Executive Officer\n\nGreat. Thanks for the question. So, with the Like New, it's currently live in 50 states in an approximately 390 stores. And we're not sharing specific performance details, but we're -- we are pleased with the results we're seeing is really on twofold: one, guest acquisition on the resale side, new to the brand, and the opportunity to enter at a different price point.\n\nAnd then, with our current guests, they're spending based on trade-in, where they come in and get a variety of different trade-in values and gift cards. We are monitoring and seeing a positive response to that. So, it's a new pilot rollout initiative for us, and we're pleased with the early results and we'll continue to monitor. But early, it's been positive.\n\nAnd from -- all right, on the Studio side, I'll break it down into two. From the Essential membership tier, which is our free membership program, if you remember on Analyst Day, we indicated that we aim to have 80% of our guests to sign up for the program. And based on our glide path to that, as guests come in to our channels, be it online or in store, we're running ahead of that. So, we're very happy with the sign-ups at this point.\n\nAnd that's going to allow us to engage with that guest base through a variety of new benefits that we offer in a very -- you know, in exciting, positive way. And with the introduction, the rebranding of MIRROR into Studio as well, very pleased with the the response. Continuing to test and learn, but we're excited how the platform fits within community, fits within our Essential membership program, and allows us to continue to innovate behind community and the connection with our guests. So, it's early, only a few months, but I'm encouraged with the results were seeing.\n\nMark Altschwager -- Baird -- Analyst\n\nGreat. Thank you and congrats on the strong results.\n\nMeghan Frank -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThe next question is from Michael Binetti with Credit Suisse. Please go ahead.\n\nMike Binetti -- Credit Suisse -- Analyst\n\nHey, guys. Thanks for taking my question. Congrats on a great quarter. Meghan, I guess just keeping on, when do you think -- when do you think of FX pressure to the gross margin can start to get better here given where rates are moving lately? And then, I guess I'm just curious if you could help us unpack the gross margin a little bit more for next year, maybe a little bit.\n\nBut, you know, it seems like the industry is looking to get clean on inventory, so, there should be some recapture opportunity there. Obviously, aifreight you spoke about a little bit. And I am curious how long you think that that pressure on the fixed cost line within gross margin that flipped over to a negative this quarter on a nice comp, is that -- does that roll forward with us for a few quarters?\n\nMeghan Frank -- Chief Financial Officer\n\nGreat. Thanks. I would say, in terms of FX, our outlook is that Q4 is more similar than not to Q3. I think hard to put a finer point on next year, but I would view it as an opportunity over the longer-term time horizon.\n\nIn terms of gross margin next year, again, do view airfreight as a benefit, but we're also, you know, committed really to that bottom line. Operating income expansion on a modest basis will continue to balance opportunities and investments in the business. Really focused on driving into our long-term goals, both of revenue growth and being able to scale with the business and support that long-term opportunity that we see. And then, I would say fixed costs, particularly on the DC side, we have some upfront investments in our DC capabilities and footprint in order to support that long-term volume.\n\nSo, we'll see some pressure in the near term and then see that start to leverage over time as we move through our five-year plan. It is a multiyear roadmap, so, we'll continue to offer some color there as we move through that.\n\nMike Binetti -- Credit Suisse -- Analyst\n\n[Inaudible] When you think about it in the comps for fourth quarter particularly between the channel stores and e-comm, considering where traffic is, how much -- based on some of the metrics you gave us and how busy your stores get during, you know, over the next few weeks here, maybe just a little bit on how you're thinking about the two channels.\n\nMeghan Frank -- Chief Financial Officer\n\nNo, we didn't break down the channels for Q4. What we did offer was 23 to 24% sales growth overall. And we did give some color for the year on e-commerce at approximately 30% growth, which would impact both our Q3 results and our expectations for Q4.\n\nMike Binetti -- Credit Suisse -- Analyst\n\nOK. Thanks a lot.\n\nMeghan Frank -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThe next question is from Omar Saad with Evercore Partners. Please go ahead.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThanks. Good evening. Wanted to ask my first question on pricing. Actually, I know you guys have been -- haven't been too aggressive or haven't had really the need to use pricing ever even in this inflationary environment.\n\nBut as you see COGS, inflation, freight, FX impacting the gross margin, maybe talk about your appetite and the brand's strength to the brand's capability to use pricing as a tool as needed. And then, maybe also diving deeper on China. It seems like the performance there was pretty solid despite all the COVID closures going on there. You know, maybe talk about what the outlook will be, you know, once -- you know, what your expectations are for that business once the, you know -- who knows what it'll be but once the kind of market and economy and consumer spending and retail environment opens up there.\n\nThanks.\n\nCalvin McDonald -- Chief Executive Officer\n\nHi, Omar. On pricing, as we've stated, we -- we only increased around 10% of our assortment mix this year as we priced in. And, you know, we continue to evaluate and -- and look for opportunity. And we separate cost of goods and any pressure we're seeing there with short-term cost of supply chain logistics.\n\nAnd what we don't want to do is react too aggressively and -- and create any impact on the demand of our -- of our product. And we're going to continue to take that approach. Comfortable on the inflationary pressures we're seeing on cost of goods and how we're priced in. And as I said, we'll -- we'll -- we'll -- we'll adjust on the other.\n\nAnd I think, as we've seen through the three quarters of this year, the decision so far has -- has been the right decision, where others that priced up are now heavily discounting and giving away any of that perceived gain and more so and having to mark goods down, where we're able to continue to sell our product at regular price, not react. And our markdown performance has been, in our guidance, in line with what we indicated we would be from a 2019 perspective. So, I -- we continue to monitor it, but our pricing decisions, I think, have have helped to fuel our momentum this year. And we'll continue to take a similar approach as we look out to next year.\n\nAnd on China, we remain very excited. You know, our -- our new store openings, we opened nine stores in the -- in the quarter in mainland China. We have 88 now in -- in market. Their performance continues to exceed, beat expectations.\n\nIn markets where we don't have constraints related to COVID, the store performance and online performance is very strong. So, we remain very excited about the market, committed to the market, and know that it will play, you know, a strong role in our growth of quadrupling international through our Power of Three x2 growth strategy.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThank you, Calvin. Just to clarify, in terms of pricing, so, it's not that you don't think the lululemon brand has the pricing power, but you just don't see the need given some of the transitional nature of some of the inflation going on there to chase pricing, given the environment, is that a fair characterization?\n\nCalvin McDonald -- Chief Executive Officer\n\nIt's a fair characteristic. But I'd also indicate, when we mentioned the 10% of assortment that we've moved pricing on throughout this year, we've looked at our new innovation and priced it accordingly relative to where we see opportunity in the marketplace. So, you know, we absolutely know that, you know, this is a premium brand. We have pricing power.\n\nWe're able to launch and introduce exciting new innovation that is priced to support the technology and the innovation that is into the product. And we are being cautious and managing our regular pricing accordingly with the promotional nature of the market so that we're able to continue to, you know, sort of drive the demand at regular price that we're seeing and will manage accordingly. But absolutely, it's not a reflection of what we believe the pricing power of the brand is. In fact, I think the way the brand is performing in a heavily promoted environment actually supports the power of the pricing position that we have at lululemon.\n\nOmar Saad -- Evercore ISI -- Analyst\n\nThank you for clarifying. Have a great holiday.\n\nCalvin McDonald -- Chief Executive Officer\n\nOperator, we'll take one more question.\n\nOperator\n\nCertainly. The next question is from Jay Sole with UBS. Please go ahead.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you so much for taking my question. Calvin, I'm just wondering if you could talk a little bit more about, you know, what you've seen from the footwear business. You know, when you think about the Strongfeel versus Restfeel versus Chargefeel, have you seen the consumer, you know, adopt one style versus the other? I mean, have you seen sort of colors or SKUs do better? And are you looking to expand the assortment as you get into next year? Thank you.\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks, Jay. We're pleased with the -- with the results to date. As you indicated, we have four SKUs within our footwear, and each have performed well. It's a combination.\n\nWe're seeing certain guests purchase multiple styles, and we're seeing new guests enter either into Blissfeel or Chargefeel or into Strongfeel or Restfeel. Restfeel being our -- our -- our first dual-gender offering for both him and her, and the other three being specific for our female guests built off of a last design on her foot. As we look forward, I'm excited about continuing to test and learn. As we indicated, it doesn't play a big role in our Power of Three x2 growth plan that we shared on Analyst Day, and it's an exciting category for us.\n\nAnd we have the ability and will take the ability to -- to pace, to learn. But we started with a very innovative, unique positioning and will build from that. And colors -- from the color wave side, she's been responding very well to the colors. I think that's one of the unique positionings of it, is, you know, our core colors of black and white are strong, but a lot of the unique color waves, she's responded very well too.\n\nSo, it's early for us, excited about the results, and will continue to test and learn and share more.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you so much.\n\nOperator\n\nThat's all the time we have for questions today. Thank you for joining the call and have a great day.\n\nDuration: 0 minutes\n\nHoward Tubin -- Vice President, Investor Relations\n\nCalvin McDonald -- Chief Executive Officer\n\nMeghan Frank -- Chief Financial Officer\n\nAdrienne Yih -- Barclays -- Analyst\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nRick Patel -- Raymond James -- Analyst\n\nAbbie Zvejnieks -- Piper Sandler -- Analyst\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nMark Altschwager -- Baird -- Analyst\n\nMike Binetti -- Credit Suisse -- Analyst\n\nOmar Saad -- Evercore ISI -- Analyst\n\nJay Sole -- UBS -- Analyst\n\nMore LULU analysis\n\nAll earnings call transcripts"
}