{
  "companyName": "GoHealth",
  "companyTicker": "GOCO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/gohealth-goco-q2-2022-earnings-call-transcript/",
  "content": "GoHealth (GOCO 0.38%)\nQ2 2022 Earnings Call\nAug 15, 2022, 5:00 p.m. ET\n\nOperator\n\nWelcome to the GoHealth Q2 2022 earnings conference call. My name is Kevin, and I'll be your operator for today's call. At this time, all participants are in a listen-only mode. [Technical difficulty] remarks, we will conduct a question-and-answer session.\n\n[Operator instructions] As a reminder, this conference is being recorded. Brian Farley. Brian, you may begin.\n\nBrian Farley -- Chief Legal Officer\n\nThank you, and good afternoon, everyone. Thanks for joining GoHealth's second quarter 2022 earnings call. Joining me today are Vijay Kotte, chief executive officer; and Jason Schulz, chief financial officer. This afternoon's conference call contains forward-looking statements based on our current expectations.\n\nNumerous risks and uncertainties may cause actual results to differ materially from those anticipated or projected in these statements. Many of the factors that will determine future results are beyond the company's ability to control or predict. You should not place undue reliance on any forward-looking statements, and the company undertakes no obligation to update or revise any of these statements, whether due to new information, future events, or otherwise. After the market closed today, we issued a press release containing our results for the second quarter of 2022.\n\nWe have posted the release on the GoHealth website under the investor relations tab. In the press release, we have listed a number of risk factors that you should consider in conjunction with our forward-looking statements. We encourage you to consider the other risk factors described in our Form 10-K and Form 10-Q reports filed with the Securities and Exchange Commission for additional information. During this call, we will be discussing certain non-GAAP financial measures.\n\nThese measures are reconciled to the most directly comparable GAAP financial measure and the reconciliations are set forth in the press release. Please refer to today's press release for reconciliations of non-GAAP measures to the most comparable GAAP measures discussed during this earnings call. And with that, I'd like to turn the call over to Vijay.\n\nVijay Kotte -- Chief Executive Officer\n\nThank you, Brian. Thank you all for joining us this afternoon to discuss our second quarter 2022 results. Let me start by saying how proud I am of the team for supporting over 170,000 Medicare beneficiaries this quarter as they navigated a complex and often frustrating process of health plan enrollment. GoHealth's new CFO, Jason Schulz, will review our earnings results in greater detail.\n\nBefore he does, I'd like to introduce myself and share a bit about my plans for GoHealth as CEO. I joined GoHealth in June and have spent time developing a better understanding of the company and evaluating our position within the industry. By all measures, GoHealth is the volume leader in the e-broker space. After joining, I have been pleasantly surprised by the work we are doing with carriers post-enrollment to drive customer experience through the Encompass Platform.\n\nGoHealth plays an essential role in Medicare by establishing an independent marketplace, recruiting beneficiaries, and matching them with the best plans to meet their needs. While considering the role, I felt there was a significant opportunity for this company to extend its differential position. Now that I'm in the seat, a conviction on that point has been solidified. I believe the platform here is second to none, and I see serious potential to drive growth and efficiency.\n\nOur priority is to ensure that beneficiaries are receiving the benefits they expected and are satisfied with their choices, leading to greater retention over time. GoHealth is uniquely able to deliver what I have worked to solve for much of my career in Medicare. In my time with health plans, providers, and technology solutions, I have sought to develop the ability to support beneficiaries as they make a very difficult and stressful decisions around their healthcare. Should they consider an alternative to traditional Medicare? And if so, which health plan options should they choose? I focused my career on supporting beneficiaries to the complex Medicare decision process and doing it at scale, with the goal to drive greater freedom of choice and improve the overall experience.\n\nGoHealth effectively supports beneficiary decision-making at scale and has attained a differentiated position in this space. However, we have reached a natural inflection point as competitive dynamics among our carrier partners change and the needs of our beneficiaries evolve. In my new role, I'm reflecting on what has worked well and what hasn't, in order to best position us for the future as we shift from being enrollment-focused to being more engagement oriented. Just as GoHealth has consistently proven to be the enrollment leader in the industry, I'm confident we will be able to utilize our unique platform inclusive of talent, technology, and data to deliver incremental value to all the beneficiaries and carriers of the extended capabilities and efficiencies to win the engagement race.\n\nAs we journey down this path, it's imperative that we are laser-focused on driving cash flow and maintaining high quality. Since I started, we have spent a significant amount of time identifying the key drivers that continue to challenge the performance of the company. To that end, we recently announced the restructuring of our organization to deliver the greatest efficiency with a lens toward value as opposed to revenue maximization. On the quality front, we have refined the size of our sales force, reducing our headcount by just under 800 agents.\n\nWe will enter AEP with the highest quality and tenured agents ever. In doing so, we gained higher performance metrics around conversion and effectuation that allow us to deploy our cash at a much more efficient level, thus minimizing our dependency on external lead sources. With this focus on quality, we're able to deploy our teams on programs that deliver a higher confidence year 1 cash profile for the business. I'd like to provide a brief update on our new Encompass Connect and Engage modules.\n\nI'm happy to report that the initial positive interest we received has resulted in contracts with each of our major carrier partners. We're ramping up these programs and expect to be fully deployed for AEP. The Encompass Platform provides better predictability, transparency, and unit economics while also driving more cash into the business. I feel it is important that I acknowledge all the efforts GoHealth team has put into making our achievements to date possible.\n\nThis is a dynamic market and expectations evolve, how we serve the industry needs to evolve in parallel. The commitment from all of our current and past team members has been so critical to get us to this point where we can leverage our strong foundation to reposition this company for success within the new standards desired in this market. These monumental shifts in size and focus do come with some level of risk. But given our depth of experience and historical data, we are cautiously optimistic, we will enter into 2023 with a leaner, more efficient operating model that cannot only be scaled but can also support innovation and growth.\n\nWith this restructuring and refocus in mind, we feel it's most prudent at this time to suspend a quantitative guidance for the remainder of 2022 and instead provide you with some qualitative comments. As we sit here today, we believe the restructuring measures will impact our second half 2022 results in a few ways. First, our revenue will be slightly lower. Second, our adjusted EBITDA, while still meaningful and positive, will be significantly lower.\n\nThird, our ability to achieve cash flow breakeven on a run rate basis will be strengthened materially. We expect to provide more color on full-year 2022 when we announce our third-quarter earnings later this fall. I'm excited for the changes to come for GoHealth as we reposition our unique services around differentiated digital tools and technology for not only volume leadership but winning in customer engagement and experience. I look forward to sharing a more fulsome update as we close out 2022.\n\nI thank you all for your continued interest in our story and for joining us this afternoon. I'll now turn the call over to Jason for looking at his numbers. Jason?\n\nJason Schulz -- Chief Financial Officer\n\nThanks, Vijay, and thank you to everyone for joining our call today. Before I get into the financial results, I want to share some perspectives as to why I joined GoHealth and some early reflections. It quickly became clear to me that the company was built with a foundation that truly separates itself from the rest of the market, and I share Vijay's optimism about the future. I personally see the opportunity to make a meaningful contribution with the challenges of today and the exciting prospects of tomorrow.\n\nAs we have deepened our understanding of the business, we determined that it is important to take steps to improve how we communicate financial results. We're still early in the assessment. Our intention is to provide greater clarity around unit economics of the business, margin profiles of our products, key operational drivers, and the associated cash flow impacts. We are also taking a fresh look at our forecasting process to increase the predictability of our projections and linking these to our external communications around forward-looking guidance.\n\nFor these reasons and the other factors Vijay just covered, we are suspending guidance for 2022. Most importantly, we continue to be focused on transforming the business and materially improving cash flow from operations. As such, I am pleased to share our cash flow from operations is $6 million for the first half of 2022, an improvement of $38 million compared to the same period last year. With the transformative actions we are taking and the aggressive cost management discipline, we anticipate achieving the goal of breakeven cash flow from operations by mid-2023.\n\nMoving on to our financial results for the quarter. We recorded $159 million of revenue and posted a $32 million adjusted EBITDA loss for the quarter, a decline of $38 million and $45 million, respectively. Consistent with Q1 of this year, we kept the same blended 7% constraint reserve methodology for new policies sold in the current quarter. To partially explain the year-over-year change, it is important to normalize the impact of the $155 million LTV look-back adjustment we took in Q4 2021 that relates to the policies sold in Q2 of last year.\n\nThis would have lowered revenue by $15 million and decreased our adjusted EBITDA by $10 million in Q2 of 2021. To further drill into the quarter, I'm going to move into our segment reporting. Starting with our External Medicare segment, we posted revenue of $50 million, which is an $18 million improvement from Q2 2021, while profits declined to a loss of $6 million. The improvement in revenue was largely driven by 114% growth in the carrier-approved submissions, which was a result of increasing the number of downline agency partnerships as compared to the same period last year.\n\nThe overall increase in revenue is largely offset by the impacts of our revenue-sharing arrangements with our down-line agency partnerships and the LTV adjustments previously discussed. Moving to our Internal Medicare segment. We recorded $104 million of revenue and a loss of $11 million. This is a $57 million and a $42 million decline versus Q2 2021, respectively.\n\nBeyond the LTV adjustments we already discussed, there were some timing impacts of certain partner marketing and enrollment revenues that were higher in Q2 of last year compared to this quarter. However, the most significant driver of our decline in revenue and profitability was a 24% decline in carrier-approved submissions. Much of the slowdown in our Internal Medicare segment was intentional, as we spent $15 million less in marketing. While conserving cash, also resulted in fewer opportunities for our agents and an overall decrease of our policies sold.\n\nWe are facing economic headwinds such as inflation and rising interest rates, as well as a changing industry landscape. As such, we want to focus on the economic levers we have the most influence over, namely our customer acquisition costs and aligning to our highest margin and cash flow generating activity. We believe the actions taken last week drive stability for the company while ensuring we are deploying our cash thoughtfully and strategically. We plan to invest in the opportunities with the highest return and provide the best probability for near- and long-term success.\n\nAs I wrap up, I want to pre-emptively touch on a couple of items that might be on your mind. First, to avoid any concern about challenges related to our existing debt covenants, we work closely with our lenders to bring them up to speed on our operating plans and expectations. We have agreed to a revised debt covenant that better aligns our trajectory with our mutual goals for long-term sustainability and strength. Second, related to our current stock price and NASDAQ's minimum stock price listing requirements, if necessary, we anticipate holding a special shareholders' meeting later in the fall to request shareholders to authorize a reverse stock split by our board.\n\nWe will provide more information on this topic over the coming months. Before I hand it back to the operator to queue up your questions, I want to reiterate how pleased I am to have joined GoHealth. We're in the early stages here, but we have a good handle on the business, and we know what we need to do next. I'm excited to be a part of this transformation, and I look forward to updating you on our progress in the Q3 call.\n\nThank you for your time today. We'll now open up the call for questions. Operator?\n\nOperator\n\n[Operator instructions] We'll pause for a moment while we compile our Q&A roster. Our first question comes from Elizabeth Anderson with Evercore. Your line is open.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nHi, guys. Thanks so much for the question. I guess my first question, I just would like to hear -- I know you've obviously had a lot on your plate for the last sort of six weeks or so. Just sort of where we are in terms of AEP prep, I noticed you obviously said that you are expecting to go in with a more tenured sales force.\n\nAre there any sort of key capabilities that you're missing or that you're sort of adding to at this point or training or anything given some of the CTMs from last year? Any kind of sort of operational things that you're doing differently as we sort of approach the AEP season? Thanks.\n\nVijay Kotte -- Chief Executive Officer\n\nThanks, Elizabeth. Appreciate you joining the call today. And thanks for the question. Just to be -- to reiterate the question more around where are we with AEP prep and anything that we're doing operational and otherwise to prepare for it, and in short, yes, there's a lot going on.\n\nAs you know, this is a very busy time of year. We've just been out trying to learn about our major carriers' plans regarding benefits and how they're seeing their positioning within the marketplace. We're then also factoring in those dynamics into how we're training our agents even though we have refined our account of agents, we have been working extensively since last AEP to enhance their quality, their conversion rates, effectuation all across the board. And most importantly, as we've alluded to in our prepared comments, is our progress on the Encompass Platform.\n\nAnd right now, we're in the final stages of testing those tools to make sure that we have all of our key agents prepared and ready to deploy against those so that we can have more of that active and ready to go during the AEP, both the Connect modules, as well as the Engage modules at that time. But I think that's -- those are the major parts for us at this point. And we're doing a good job of really focusing through those technical tools and training tools. And the last one is really around marketing.\n\nMarketing is going to be unique in the way we've refined our approach to what we want to do in the AEP period, as Jason alluded to, making sure that we're focusing on those highest quality marketing avenues. And as such, working with those partners to ensure that we are doing all of the quality verification on the front end as possible so that we have the highest return on those investments. So I think that's what I would say to respond to your question, is that responsive to what you were looking for?\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nYeah. No, that makes sense. And I guess my follow-up question is in terms of just pulling the guidance at this point, I mean, what sort of change in terms of how you're thinking about the company that you sort of wanted to take a sort of to pull the prior guidance and take a fresh look at the year?\n\nVijay Kotte -- Chief Executive Officer\n\nYeah. It's obviously a good question probably on the minds of a lot of those listing right now. As we look at it, it's no surprise to anybody that the AEP period is one of the most dynamic periods and most important to look at the full-year performance of anybody in our space. There are a lot of factors in play this year.\n\nAnd we've got the changes in the way the carriers are looking at their benefit structures, some of which we have, some of which we don't understand yet. Most of that won't be fulsomely known until October of this year. Second, we've got competitive dynamics that have changed among our peers as to their staffing, their marketing tactics, the downlines, how they're all behaving is different organization looking at different strategic options. Marketing regulations changed this year versus where we were in the past, and so we're all reacting to those.\n\nAnd then we also have the counterpiece of the inflationary environment and how that may be changing the -- those who are going to be shoppers this year and those who won't be shoppers this year versus prior periods. So, all of that then compounded with the restructuring activities we did this past week, all led us to come to the conclusion that it made sense for a suspend guidance at this point. And obviously, as we indicated in our prerecorded -- our prepared comments that we will consider the color of those and give you more thoughts around it as we get into the fall.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\n OK. And one last quick one. For those of us who haven't time to read the entire debt -- new debt covenants and things in the 8-K that you just released a couple of minutes ago. Would you mind providing us a sort of summary in terms of the salient point there?\n\nVijay Kotte -- Chief Executive Officer\n\nI think there's really just two of the salient points related to what we've negotiated with the debt holders. Jason, do you want to touch on that?\n\nJason Schulz -- Chief Financial Officer\n\nYeah. Thanks, Vijay, and thanks, Elizabeth, for the call. Yes. So number one, we went ahead and updated our covenants associated with our leverage ratio.\n\nAnd then also, we have an update to our rate, which is an increase of 100 basis points.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nOK. Got it. Thanks so much.\n\nVijay Kotte -- Chief Executive Officer\n\nThank you, Elizabeth.\n\nOperator\n\nOne moment for our next question. Our next question comes from Michael Cherny with Bank of America. Your line is open.\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nGood afternoon, and thanks for taking the question. Maybe if I can dive a little bit into the restructuring program. Obviously, it's a big chunk of your workforce, not something that any company ever wants to do. But as you think about how you went through that process, how do you think about the team that's on the field essentially going into what you note is obviously a very dynamic AEP program? And making sure that they have the right levels of motivation, right levels of sentiment to make -- to drive a stronger AEP performance as possible.\n\nVijay Kotte -- Chief Executive Officer\n\nThanks, Mike, for the question. As we think about the AEP period and obviously, going through the restructuring process, really starting at what matter most as we go into this evolutionary period and transformational period for us as an organization. We know that the market is demanding, and we need to deliver higher quality across the board. So as we went through our selection criteria, we focused on that.\n\nWe focused on the agents who had been able to become those top-tier upper echelon quality performers and really refined our workforce to reflect that, those who were there and those who had the potential to get there, augmenting them with training and additional tools to do so. As we think about going into the AEP period, as I said before, we have some of the highest tenured and highest quality agents we've ever had going into AEP. And what that allows us to do, even with a smaller volume, it allows us to be more selective in the marketing sources and tactics we utilize so that we can have the highest quality choices along those lines. So we do feel that it allows us to actually have a very productive quality demonstration of our capabilities to our carriers and serve beneficiaries in a better way.\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. And maybe just thinking ahead as well AEP, obviously, last year, a number of the carriers that you work with, I know I've made public comments about their desire to push and pull in terms of their own internal agent force, sales force versus external, how are you thinking about the continued process that you're going forward with in order to make sure that you're proving yourselves as the best value-added partner, especially considering the potential investment they're making internally for additional resources?\n\nVijay Kotte -- Chief Executive Officer\n\nNo, it's a great question. And as we look at all the discussion, I would say that I've been very pleased. I've interacted with all of our major carrier partners. We've had extensive conversations, what matters most to them, what problems they're trying to solve, and how we can partner with them to do just that is actually the germination of how we've gotten to getting the completed contracts in our Connect and our Engage platforms, their modules under the Encompass overall portfolio of products is really aligning our capabilities with what they seek most and balancing that push and pull tug that you've been describing.\n\nSo it's definitely been not being done in the vacuum these new products were describing. We're doing them a long side of our carriers. And we feel that they are absolutely helping both advances our position as to how we want to evolve, as well as supporting where they're trying to go in their respective goals.\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thanks so much.\n\nVijay Kotte -- Chief Executive Officer\n\nThank you, Mike.\n\nOperator\n\nOne moment for our next question. Our next question comes from Tobey Sommer with Truist. Your line is open.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nHi. What do your workforce cuts mean to your agents? Could you give us a sense for where you were and where you will be on a go-forward basis from an agent perspective and a sales force perspective?\n\nVijay Kotte -- Chief Executive Officer\n\nFirst, Tobey, thanks for joining, and appreciate the question. As hasn't been prior precedent, we haven't really put out numbers as to the number of agents that we've got and those that we have between so many different functions between our Internal Medicare, our down-line partners in the External Medicare channel, not to mention all of the enterprise solutions and other areas within the organization. So not in a position to provide you those metrics at this time. But again, as we did allude to just over 800 -- or just under 800 agents were impacted by the restructuring.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK. I guess -- I know you pulled guidance, but part of this sort of adjustments to the workforce and agent force, you've got to have some sort of plan to keep them busy enough and fueled with enough marketing to yield the kind of living that will give you associated turnover and employee attrition that the business can live with. How do you thread that needle?\n\nVijay Kotte -- Chief Executive Officer\n\nNo, it's a great question. As we thought about where we were going and how we identified some of the key staffing levels for us, there was a strong balance toward what could we actually do exactly what you're describing, how do we get enough leads that are high enough quality and to produce the quality on the back end with the right tenured agents and how do you balance that overall. So as we went through that analysis and looked at who was at what thresholds, we have definitely balanced then that we've looked at our staffing levels and also the compensation models and the way we put incentive structures in place for our agents. And we feel good that we can satisfy and keep them engaged and motivated to drive high quality with a balance on volume and productivity.\n\nSo that is definitely what we've done. And we feel there is opportunity for us to continue to refine that over the course of the coming months as we learn more about what the market made for forward in all those dynamics I described a little while ago.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK. I appreciate the targeting of a cash flow breakeven, not too distant future. But contracting the top line to get there probably doesn't feel that great. At this point, I know you haven't been there a long time, but do you think the business can simultaneously generate cash and positive revenue and volume growth?\n\nVijay Kotte -- Chief Executive Officer\n\nI think it's an interesting question. As I look at it right now, I think we definitely believe we can position ourselves to drive more value, and the value equation is a function of both quantity and quality, and we want to fill that void. And I think that's really the shift that's happened. One would say that quality has always been on the forefront, but quantity has been a strong motivator from a lot of different angles.\n\nAnd at times, we need to refocus on the quality, and that's exactly what we're doing. So when we think about the value going forward, it's really driving some of these new product segments that we've described and finding better ways to be partnering with our carriers to deliver those services. And we think that you can deliver cash through that, as well as drive growth year over year. But time will tell us exactly what those thresholds will be.\n\nAnd as we test some of these going to this upcoming AEP, we'll be able to provide you more color as we get further into the year.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK. And your target of cash flow breakeven around the middle of next year, is that on a sustainable basis? Or is that episodic in sort of away from AEP and after all the cash comes in, in the months to follow?\n\nVijay Kotte -- Chief Executive Officer\n\nKeep in mind, I think the way we've set up the target was on a trailing 12-month basis, so it's not an episodic one quarter that has this cash characteristics you just described. And so the way to think about it is, it's on a run rate basis of the way the business should operate going forward.\n\nTobey Sommer -- Truist Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from Jonathan Yong with Credit Suisse. Your line is open.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nHey, thanks for taking my question. So, as you guys kind of stepped into the roles, you obviously did the restructuring work. But I guess are there any other areas where you think more work can be done? Are there any areas where that kind of jumps out to you where you can further reduce cost, any variable costs, things of that nature?\n\nVijay Kotte -- Chief Executive Officer\n\nThank you, Jon. Let me -- you were fading out a little bit there. I want to repeat the question to make sure I got it right. It sounded like you said that we had done a lot of work on the restructuring and coming with costs, are there other major categories or areas to look at for cost mitigation?\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nCorrect, yes.\n\nVijay Kotte -- Chief Executive Officer\n\nSo I think we've done a good review of the organization, focusing on the areas that seem to drive more on the quality side of the business and ensuring that we're getting the best return on those, maximizing our opportunity for cash, etc. So I'd say at this time, there's no material areas of gap that we need to look at that are known areas to focus on, on the cost side of things, but that are glaring by any means.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nOK. Great. And then you obviously cut about 800 agents. As you think about kind of the go-forward, is the current agent staffing level the right level for you guys? And then as you think about balancing these -- the regular commission side versus the enterprise side, is there one year kind of favoring more than the other? Or is it still too early to kind of comment on that? Thanks.\n\nVijay Kotte -- Chief Executive Officer\n\nThe staffing levels that we have right now, we feel fairly comfortable, are a good baseline for us to operate off of for the long run. We have opportunities to grow, and we have a definite pipeline within the different product sets that we offer to be able to continue to nurture and develop the talent. If you look at the tenure of the agents that were coming into this AEP versus previous tenure, it's nearly three times the amount of tenure that we've had in previous years. And that is something we want to maintain that we have a pipeline of experience to help onboard from the outside and develop through the different channels.\n\nSo, at this point, we think this is the right staffing level to jump off of and we have the right opportunity to develop talent to move toward our diversification of our product set and bring those skills into those other products. To your specific question of the distribution between enterprise and also looking at the traditional model, at this point, I don't have anything directional to provide you other than you should expect to see some more diversification as we go forward, both on the type of products and the payment profiles of those businesses.\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nOK. Great. Thanks.\n\nVijay Kotte -- Chief Executive Officer\n\nThanks, Jon.\n\nOperator\n\nAnd I'm not showing any further questions at this time. I'd like to turn the call back over to our management team.\n\nVijay Kotte -- Chief Executive Officer\n\nJust wanted to close. Thank you all again for your time today and interest in our organization. Obviously, a lot of work to come, and we're looking forward to providing you updates on our progress over the coming quarters, and we hope to talk to you all soon. Thanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBrian Farley -- Chief Legal Officer\n\nVijay Kotte -- Chief Executive Officer\n\nJason Schulz -- Chief Financial Officer\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nMichael Cherny -- Bank of America Merrill Lynch -- Analyst\n\nTobey Sommer -- Truist Securities -- Analyst\n\nJonathan Yong -- Credit Suisse -- Analyst\n\nMore GOCO analysis\n\nAll earnings call transcripts"
}