{
  "companyName": "Intelli-Check",
  "companyTicker": "IDN",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/intelli-check-idn-q2-2022-earnings-call-transcript/",
  "content": "Intelli-Check (IDN)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings. Welcome to Intellicheck's second quarter 2022 earnings call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation.\n\n[Operator instructions]. Please note this conference is being recorded. I will now turn the conference over to Gar Jackson, investor relations. Thank you.\n\nYou may begin.\n\nGar Jackson -- Investor Relations\n\nThank you, operator. Good afternoon, and thank you for joining us today for the Intellicheck second quarter 2022 earnings call. Before we get started, I will take a few minutes to read the forward-looking statement. Certain statements in this conference call will constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 as amended.\n\nWhen used in this conference call, words such as will, believe, expect, anticipate, encourage, and similar expressions as they relate to the company or its management as well as assumptions made by and information currently available to the company's management, identify forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on management's current expectations and beliefs about future events. As with any projection or forecast, they are inherently susceptible to uncertainty and changes in circumstances, and the company undertakes no obligation to and expressly disclaims any obligation to update or alter its forward-looking statements, whether resulting from such changes as new information, subsequent events or otherwise. Additional information concerning forward-looking statements is contained under the headings of Safe Harbor Statement and Risk Factors listed from time to time in the company's filings with the Securities and Exchange Commission.\n\nStatements made on today's call are as of today, August 11, 2022. Management will use the financial term adjusted EBITDA in today's call. Please refer to the company's press release issued this afternoon for further definition, reconciliation, and context for the use of this term. We will begin today's call with Bryan Lewis, Intellicheck's chief executive officer; and then Jeff Ishmael, Intellicheck's chief financial officer, who will discuss the Q2 2022 financial results.\n\nFollowing their prepared remarks, we will take questions from our analysts and institutional investors. Today's call will be limited to one hour, and I will now turn the call over to Bryan.\n\nBryan Lewis -- Chief Executive Officer\n\nThank you, Gar, and thank you to everyone for joining us on our second quarter 2022 earnings call. We showed solid SaaS growth both year-over-year and sequentially, and we believe that we have laid the ground risk on the sales front to generate momentum going forward. Before I review all of that with you, I will highlight a few of our financial results, and then Jeff will go into further details later in the call. Our SaaS revenue grew 21% to $4 million versus last year and was up 17% sequentially over Q1 2022.\n\nGross profit margins remained healthy at 91%. During the quarter, we made some noteworthy progress in furthering our efforts to make essential investments in the company's future, including major changes in our sales organization from the top down. For openers, we promoted Chris Meyer as our new senior vice president of sales. This is an important step forward for us.\n\nChris brings years of experience at Intellicheck as well as sales management experience. Chris has been responsible for signing some of our largest accounts across every vertical we sell into and thoroughly understands the process needed for prospective and selling that closes large deals. Chris is excited to teach that knowledge to the team and lead them to success. We have also made major changes to our core sales team with the addition of four new salespeople and an account manager who will be responsible for maintaining the relationships with our key accounts.\n\nEach of these new salespeople has a proven track record of successfully developing new business at companies that sell identity proofing and cybersecurity products directly into our core market of financial services. They understand our business and our customers and our prospects. Between their knowledge of our industry and clients and Chris's understanding of what it takes to be successful at Intellicheck, coupled with Chris's ability to teach that to both the new and existing team, we believe that we are now on our way to increase sales growth. With this growing team and guidance from Chris, we believe that we are well positioned for significant growth in 2023.\n\nThis also underscores the commitment I made to you when I told you I was going to analyze our sales structure, evaluate individual performance and grow the team with the right people who have the industry experience to not just knock on the right doors but to get them open. I'm also very pleased with the progress we are already realizing with the addition of Jeff Jeffrey Ishmael as CFO, and I am excited by the additional analysis and rigor that he has brought to the finance team. Proper reporting is the key to effectively manage any business, and Jeff's driving that process with extensive analysis around all aspects of the business and bringing to the table perspectives we have not had in the past. This reporting and analysis will allow us to better drive the business and provide better metrics to investors around our growth drivers.\n\nGiven Jeff's extensive strategic and operational expertise with significant experience managing multiple organizational functions and his deep SaaS experience, I'm looking forward to the contributions that are yet to come. He has certainly become a valuable leader on the executive team. Turning now to our clientele pipeline. Looking at our financial services clients, we are seeing continued opportunities.\n\nStarting with financial services company No. 3, they completed the rollout to their bank branches during the quarter, which was a driver of their 13% revenue growth over Q1. I continue to believe we will see the branches generating more than 1 million transactions per year.  Last quarter, I updated you on financial services company No. 4 that has now completed the rollout of the BankMobile platform.\n\nYou may recall that this use case bank employees come to customers in the lobby and process all their banking needs using a tablet. There were several other new use cases in the quarter. They completed the full onboarding of a retailer selling kitchen wares and home furnishings that it took from a competing credit card provider. In addition, they began to bring in-house a sporting goods store, they provided white label credit cards to.\n\nPreviously, this client paid us directly on a per location model. As they bring the locations in-house, they move to the higher revenue per transaction model. All of these things led to a 38% sequential increase in revenue versus Q1. Last quarter, we also spoke about the off-price retailer that uses Intellicheck to parts and pre-fill applications.\n\nThey have renewed for a three-year deal moving to a transaction model with flat pricing in the first year, an 87% increase in year two and a 33% increase in year three. During Q1, they completed the rollout of the new use case of no receive returns. From early transactions, it would look like this would double transaction volume. The fact volumes were up 300% in Q2 versus Q1.\n\nOverall, transaction volumes across our large retailers were up in Q2 versus Q1, a minimum of 13% with most in the 30% range. We are also seeing strong results related to an earlier announcement regarding the agreement with the company that sells in omnichannel, multi-biometric platform to banks, marketplaces, and healthcare systems. They are reselling our ID validation tools as part of their onboarding process and had pre-purchased 500,000 transactions. They began running transactions in January, and volumes have steadily been increasing.\n\nThey are now down to less than 10% remaining in their prepurchase bucket, so they have purchased another bucket of 500,000 transactions. I have said we would be moving toward more resellers. This is an example of that working and is a continued part of our strategy going forward. We also have updates on some of the banks that are going through infosec review or proof of concept.\n\nThe security audit at the top three bank we spoke about in the last call continues. And as I said, it seems the larger the bank, the longer the process. I have no doubt we will pass the audit as they are pretty much the same across all large banks. It's just the process they have to go through.\n\nThe good news is while that is happening, the bank is continuing to work with us to identify additional areas in which our services could be used with mobile banking being high on their priority list. I also wanted to share with you that one of our southern headquartered regional banks with about 2,400 locations, proof of concept is still in process to launch. The business unit thought they could start the pilot without infosec review, but that turned out not to be the case. So we're going through that right now.\n\nThe other Southern based regional bank has completed their proof of concept and also such criteria past the flying colors. They are now in the process of working with their provider of their existing check scanning hardware for the software licenses, the devices need to read a barcode. This is a preferred serve to the full rollout. After a successful proof of concept we signed a provider of financing solutions to over 15,000 retailers as well as direct-to-consumer loans for healthcare needs.\n\nTheir initial use case will be online financing for one of our major home improvement retailers. While it has been my sense that this financing firm alone could grow to be a very decently sized client, there's been an interesting new development. While the proof of concept is underway, they were purchased by a multinational firm that is a leading global investment banking, securities and investment management firm that provides a wide range of financial services. During that process, the loan providers spoke so highly of our services, the investment firm purchaser wanted the MSA to be signed with them, not the loan provider.\n\nThis is because the investment firm saw other internal use cases and did not want to negotiate in another MSA later. While this delayed signing the original loan provider, I believe it leads to other significant opportunities. In closing, the changes we have made are part of a continued larger focus on growth initiatives. I'm excited by where all these developments are taking us.\n\nWe continue to expand our presence as a non-demand global platform that is providing our clients a more adaptable advanced solutions for both physical and digital identity validation use cases. We have enhanced our validation solutions with additional risk signals that give our clients all inclusive freedom of choice, so critical in a global marketplace. We believe this will be equally effective in expecting new clients to a multi-positive platform built on technology that is driven by near perfect certainty. I remain confident that we stand out because our solutions deliver the critical first step in authenticating a government issued ID to defeat identity fraud.\n\nAdditionally, we continue our strides in preventing underage access to age-controlled products and venues, while remaining a leader in increasing law enforcement effectiveness and safety. Early in my tenure, I told you that I was excited by the prospects that I believe the future held. My feelings have not changed. I remain excited and energized by the opportunities I believe lie ahead, and I remain confident that there is a bright future for this innovative company.\n\nI will now turn the call over to Jeff.\n\nJeff Ishmael -- Chief Financial Officer\n\nThank you, Bryan. Turning now to our second quarter results. Revenue for the second quarter of 2022 that had nominal noncore hardware sales versus last year declined 16% to $4,008,000, compared to $4,797,000 in the same period of 2021. Revenue decline is entirely attributed to the first half of last year's exceptionally large noncore equipment sale of approximately $3.2 million to a key customer.\n\nOur SaaS revenue for the second quarter of 2022 grew $694,000 to 21% to $3,928,000 from $3,234,000 for the same period of 2021. On a SaaS-only basis, the company achieved record SaaS revenues and sequentially higher growth versus the prior quarter. Gross profit as a percentage of revenues was 90.9% for the second quarter of 2022, compared to 69.4% for the same period of 2021. The increase in gross profit percentage was primarily driven by lower equipment sales for the current quarter.\n\nExcluding equipment sales, our gross profit as a percentage of revenues was 93% for both quarters ended June 30, 2022 and 2021.  Operating expenses, which consist of selling, general and administrative, marketing, and research and development expenses increased 14% to $4,742,000 for the second quarter of 2022, compared to $4,165,000 for the same period of 2021. The increase was primarily driven by higher personnel expenses, professional fees, and marketing expenses. Included within operating expenses for the second quarters of 2022 and 2021 were $446,000 and $749,000, respectively, of noncash equity compensation expense. The company reported a net loss of $1,098,000 for the second quarter of 2022, compared to the net loss of $836,000 for the same period of 2021.\n\nThe net loss per diluted share for the second quarter of 2022 was $0.06, compared to the net loss per diluted share of $0.04 for the same period of 2021. The weighted average diluted common shares were 18.8 million for the second quarter of 2022, compared to 18.6 million for the same period of 2021. Adjusted EBITDA for the second quarter of 2022 was a loss of $583,000 compared to a loss of $47,000 for the same period of 2021. Turning to the company's liquidity and capital resources.\n\nAs of June 30, 2022, the company had cash of $12 million, working capital, defined as current assets minus current liabilities of $9.1 million, total assets of $24.2 million and stockholders' equity of $18.4 million. The company has a $2 million revolving credit facility with Citibank that is secured by collateral accounts. There are no amounts outstanding under this facility. As of June 30, 2022, the company had net operating loss carryforwards of approximately $18 million.\n\nI'll now turn the call over to the operator to take your questions.\n\nOperator\n\n[Operator instructions]. Our first question is from Rudy Kessinger with D.A. Davidson. Please proceed.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nGreat. Thanks for taking my questions, guys. Really nice SaaS growth, I guess, if you look at it on a quarter-over-quarter basis, 17% sequential. I guess I'm just trying to get a sense of when, like No.\n\n3, you had the branches go live. I'm trying to get a sense of when some of those expansions you called out went live in the quarter and just how we should think about what kind of growth we should see sequentially into Q3?\n\nBryan Lewis -- Chief Executive Officer\n\nRudy, so it varies. And also, the other thing too is, you got to remember, they roll out branches, they're not all equal. And the same thing when you roll out a retail location, they're not all equal. There's certainly high-volume and low-volume stores.\n\nSo it will take us a bit to say with a big like where did the volumes come in and how does that compare to, say, next month and the month after. So given the fact that most of it's block in and you don't know where they're located, it's pretty hard to say without having a historical data. So I know it's not a complete answer. It went through the entire quarter or, say, for example, the off-price retailer, a goodly chunk of the No.\n\n3 in our bank branches was already done, part of what's happening with No. 4, rolling out, say, the outdoor sporting store that's still continuing. So it's a blend of things.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nOK. And then I didn't hear you talk about, last quarter, you talked about you had FinServ 2 and 3 that were going to renew this quarter in Q3. Have you inked those renewals yet? And if so, what kind of price increases did you see on those? And when should we expect those to take effect?\n\nBryan Lewis -- Chief Executive Officer\n\nYes. So FinServ 2 renewed that started late in the quarter. And they're like sort of lower double-digit increases on them, numbers three, their contract allows them where we've got the renewal done, but they can extend the initial contracts. So we probably won't see that increase coming in until the beginning of '23.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nBut that's going well and the same types of increases in it, correct?\n\nBryan Lewis -- Chief Executive Officer\n\nYes.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nOK. Got it. And then on the sales side, I guess, you said last quarter, you were at nine reps with Chris kind of sliding into the SVP rule, I guess that would bring you down to eight and then you said you added four. So are you at 12 currently? Or did you lose any others during the quarter?\n\nBryan Lewis -- Chief Executive Officer\n\nYes, one other is gone. And then interestingly, right, before I got on the call here, another excellent candidate accepted. So there's now five salespeople have accepted. The account manager has accepted.\n\nSome just started, some are starting next week, some are starting the week after. We got a great training program we put in place for them. So if you counted six, so we're at 13 right now including Chris. Chris will be sliding out.\n\nYes.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nOK. And then just lastly, with that level of sales additions, how should we think about opex in Q3 and beyond? And then secondly, are your intentions still near term to run the business near EBA breakeven? Or should we expect you to be slightly EBITDA negative or modestly negative in the near term given that level of sales additions?\n\nBryan Lewis -- Chief Executive Officer\n\nBut sales salaries are not exorbitant. And so I'm not looking at, it's not like we're adding millions of dollars in costs by bringing those people on board. So nothing huge. My goal is to get to a point where we're purposing up and down breakeven because I want to continue to add people.\n\nAs I look at the opportunities that we have, it is apparent that we need to have the salespeople that understand verticals, right? So we're bringing in a lot of people that we know can get us into the financial services. I focus very heavily on that. But we also need people that understand gaming and automotive and can really hit those markets because we're doing fairly well in them, but it's not as well as I think we could do it. We have people who understand the language of gaming and automotive and notary, whatever it is that we're seeing lots of inbound needs and go attack that.\n\nSo we're going to continue to add as long as we see that it makes sense, if there's a vertical with enough TAM in it to hit.\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nAll right. Great. Thanks. I'll jump back in the queue.\n\nThank you.\n\nBryan Lewis -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question is from Jeff Van Rhee with Craig-Hallum Capital Group. Please proceed.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nThanks for taking my questions. A few to follow up on the sales side. So with the departure of Bruce, just in a nutshell, how do you see things changing in terms of what you learned from his time with the firm and what worked, what didn't work? And then in that same vein, on the quota reps, just to be clear, I think of the 13, I guess that includes Chris, how many of those are tenured a year, let's say?\n\nBryan Lewis -- Chief Executive Officer\n\nRight now, tenured a year would be, I got to say the and a half of them because I can't remember the exact start date of one of the guys. But a lot of the tenured are sort of younger. So we're still in a building phase. But what excites me is, even though we're in a building phase, the guys that are less tenured but came from the industry are bringing in a lot of really good leads.\n\nAnd that's one of the things I think that we learned. We were looking to hire just excellent salespeople who have had a good track record, irrespective of the industry. I think we've learned or I've learned that, that is a mistake. So we're hiring people from other companies that are directly selling identity proofing products or cybersecurity because they also know the same people, but they know how to get in.\n\nSo we look for people, cybersecurity, got to be really good, cutthroat and selling cybersecurity at the banks. They can get us where we need to go because those are often the guys who are torturing us on the InfoSec reviews. So I think that's what we learned. Stick to somebody who knows the vertical that you're in.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nHelpful. If I look at billings, and I know it's not a perfect metric, but it's been decelerating here three or four quarters. I guess the two questions there. Does bookings, as you would define the value of bookings in each of the quarters, is it mirroring billings? And if we shouldn't go off of that, what should we use as we try to formulate a model for '23.\n\nI realize you don't want to guide for '23, but just trying to get a sense of what kind of revenue acceleration decel is what you're looking at for that '23 year?\n\nBryan Lewis -- Chief Executive Officer\n\nJeff, do you want to take any part of that question that was the accounting aspects of --\n\nJeff Ishmael -- Chief Financial Officer\n\nYes, I'll jump in on that. And Jeff, so one of the things that we've been focused on, specifically over the last eight weeks has been really dialing in the data that Bryan has been talking about and getting those SaaS metrics in place. Bryan is going to have a wealth of data as we go into that Q4 period. I mean a lot of the metrics that you're talking about are the ones that we thrived on day-to-day, week-to-week, month-to-month at silence.\n\nThat was average contract length, average billings per customer, all of that. So that is a work in process during the Q3 period as we address our systems.\n\nBryan Lewis -- Chief Executive Officer\n\nYes. So one of the things that we want to begin to report on is what is the the ACV by sector and be able to publish that. And because I think that's a very important metric to me as I'm driving the company. But until Jeff got here and started getting NetSuite properly installed, the way that we could report out of it, tying it the right way to sales force and those types of things, it's very difficult.\n\nBut as I said in the prepared remarks, those are the things that we are getting out and ready and should be able to help you guys model things out better.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nOK. I think last data point on digital sales was it was 10% of revenue. Any update there? And then I know later last year, I'm trying to think back, you had emphasized quite a bit about trying to get the partner channels going, any measurable progress there, quantification?\n\nBryan Lewis -- Chief Executive Officer\n\nYes. So the digital continues to be about 10%, but it's only because everything else is growing. We certainly are seeing more clients coming into us who are purely digital. A good example is that lenders that I talked about that we just signed, purely digital.\n\nThey're doing all online, whether it's the consumer loan or the 15,000 retailers that we're at. We signed a couple of other smaller buy now pay later, all digital. So we are succeeding in that space very well. It's just as a percentage of revenue because the on-prem continues to grow, it looks like it's staying flat, but everything, it's the rising tide, all ships kind of analogy.  And then the other question was partners, yes.\n\nSo a good example is the one we talked about in the call, we just bought another 500,000 transaction bucket. We've made some other good partnerships in the automotive space, and we continue to look to other companies that are doing identity proofing that they may be coming at it from first biometrics, they realize they need us. So we've got a lot of things in the works. I think it's a very important channel for me, and we've focused a lot on it.\n\nSo whether it's a technology company selling systems to retailers or a company selling compliance tools to automotive. We're looking at everything because we're simple to link to and we can provide them all the signals that they need.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nGot it. One last, if I could sneak it in. I know last quarter, historically, you've given implementation/integrations, but you wanted us to focus more on just the direct implementations number. Do you have that for the quarter and the comparable for the prior quarter?\n\nBryan Lewis -- Chief Executive Officer\n\nFor this quarter, I don't have it in front of me. I know that we've had multiple of them. And if you count sort of direct implementations also meaning that we're bringing on new retailers and other things like we did with No. 4, I could certainly get the numbers of those.\n\nAnd now kind of what I'm focusing on certainly is, in a way, transaction volumes at existing accounts because land and expand is very easy. And that's one of the reasons why you look at our existing clients, a lot of the growth comes from new use cases with them. But I'm happy to get those numbers and put them out there.\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nYes. That'd be great. Thank you.\n\nBryan Lewis -- Chief Executive Officer\n\nYes.\n\nOperator\n\nOur next question is from Mike Grondahl with Northland Securities. Please proceed.\n\nUnknown speaker -- Northland Securities -- Analyst\n\nThis is Luke on for Mike. I just wanted to touch on the platform 2.0 and how that's going with migrating clients to that platform? And any additional feedback you guys have been hearing on that?\n\nBryan Lewis -- Chief Executive Officer\n\nYes. So again, it was just 2.0 was our internal wording just to make it so that our systems work better, faster and more convenient for clients. So every new client is on 2.0 or the identity platform as we market it. So again, when I say the one thing about it because we made it simpler to link, we're still seeing that it's about 50% faster for our clients to connect versus our old API because really, it's just a simpler API that allows them to take in more risk signals.\n\nSo, so far, the only thing that we've heard is that, wow, that's easy to connect to. And our clients are happy with that. The core engine behind it is still basically the same. So the service that we use to check the ID, that's the same service.\n\nKnock on wood right now, happy to say that for the past, I had to run this for a client today, for the past 6 months, we had 100% uptime. So it's all working very well.\n\nUnknown speaker -- Northland Securities -- Analyst\n\nAwesome. That's great to hear. And then I don't know if I missed this earlier, but just touching on last quarter, you guys had talked about two major banks beginning pilot studies here in Q3. Just wondering if you guys have started those and kind of how long those are slated to take?\n\nBryan Lewis -- Chief Executive Officer\n\nYes. So we touched on it in the remarks. So of those two southern banks, one of them, the business folks thought they could just do the pilot without an infosec review, mostly because we weren't connecting to them. They were going to use our web product, which doesn't require integration.\n\nInfosec team said, \"No, we need to do the review now so that if it does work, we're done, we don't want pilots without knowing that what's going to go in place, can go into place. So that's delayed while we're doing the infosec review. We got the questionnaire to them about three weeks ago, and they're reviewing it now. The other one, the pilot went off, they loved it.\n\nEvery success criteria passed the flying colors. Now what they are looking at is they are speaking with the company that provides the physical devices that scan the checks that they have already on their teller workstations. They just need to upgrade the software to make sure that they can all read a barcode. So they're ready to go once they get all that software that they need installed at the teller work station.\n\nUnknown speaker -- Northland Securities -- Analyst\n\nAwesome. Thanks for taking the question, guys. Congrats on a nice quarter.\n\nBryan Lewis -- Chief Executive Officer\n\nThank you very much. Have a great night.\n\nOperator\n\nWe have reached the end of our question-and-answer session. I would like to turn the conference back over to Bryan for closing comments.\n\nBryan Lewis -- Chief Executive Officer\n\nSo great. I appreciate everyone joining us today. As you heard, this quarter was really defined by change in progress. We continue to shape our organization to focus on opportunities with both new and existing clients and in different market verticals, which I find very exciting.\n\nWe believe the best is yet to come. So thank you all, and have a great rest of your day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nGar Jackson -- Investor Relations\n\nBryan Lewis -- Chief Executive Officer\n\nJeff Ishmael -- Chief Financial Officer\n\nRudy Kessinger -- D.A. Davidson -- Analyst\n\nJeff Van Rhee -- Craig-Hallum Capital Group -- Analyst\n\nUnknown speaker -- Northland Securities -- Analyst\n\nMore IDN analysis\n\nAll earnings call transcripts"
}