{
  "companyName": "Zevia PBC",
  "companyTicker": "ZVIA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/zevia-pbc-zvia-q2-2022-earnings-call-transcript/",
  "content": "Zevia PBC (ZVIA -0.97%)\nQ2 2022 Earnings Call\nAug 11, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning, and welcome to Zevia's second quarter 2022 earnings conference call. [Operator instructions] As a reminder today's conference is being recorded. I would now like to turn the conference over to Reed Anderson, managing director at ICR. Please go ahead.\n\nReed Anderson -- Investor Relations\n\nThank you, and welcome to Zevia's second quarter 2022 earnings conference call and webcast. On today's call are Paddy Spence, board chair; Amy Taylor, president and chief executive officer; and Denise Beckles, chief financial officer. By now, everyone should have access to the company's second quarter 2022 earnings press release and investor presentation filed this morning. This information is available on the investor relations section of Zevia's website at investors.zevia.com.\n\nBefore we begin, please note that all the financial information presented on today's call is unaudited. Certain comments made on this call include forward-looking statements, which are subject to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on management's current expectations and beliefs concerning future events and are subject to a number of risks and uncertainties that could cause actual results to differ materially from those described in these forward-looking statements. Please refer to today's press release and other filings with the SEC for a detailed discussion of the risks that could cause actual results to differ materially from those expressed or implied in any forward-looking statements made today.\n\nDuring the call, we will use some non-GAAP financial measures as we describe business performance. The SEC filings as well as the earnings press release, presentation slides that accompany today's comments and reconciliations of the non-GAAP financial measures to the most directly comparable GAAP financial measures are all available on our website at investors.zevia.com. And now, I'd like to turn the call over to Paddy Spence.\n\nPaddy Spence -- Chairman and Chief Executive Officer\n\nThanks, Reed. Good morning, and welcome to the second quarter 2022 earnings call for Zevia PBC. I'm happy to be here today to introduce my colleagues, Amy Taylor, our president and chief executive officer; and Denise Beckles, our chief financial officer. On August 1, we completed the succession plan we have worked on for the past 12 months, and Amy became Zevia's CEO.\n\nI will remain in my role as board Chair and will focus on leading our board and supporting the operating team. It has been an honor serving as Zevia's CEO for nearly 12 years, and I'm proud of what we've accomplished under my leadership. I'm also excited about the unique expertise and skills that Amy brings as our new CEO and look forward to our continued partnership. With that, I'd like to turn the call over to Amy Taylor, our president and chief executive officer.\n\nAmy Taylor -- President\n\nThanks, Paddy, and good morning, everyone. It's a pleasure to be with you all this morning and an exciting time to be in this new role serving as Zevia's CEO. I want to thank Paddy for his leadership and for the contribution he's made in the world by offering great tasting, accessible zero sugar plant-based beverage platform to move us up the road to improve health on a global scale. Zevia continues to experience strong and accelerating consumer demand and category-leading dollar and unit growth.\n\nIn Q2, we delivered a record net sales of $45.5 million, which represents a 32 and a half percent revenue growth and 30% in volume growth. We are realizing a positive mix shift driven by trade-offs, and we see strong early indicators of consumer acceptance of recent and forthcoming retail price increases. We have a stable supply chain with strong availability through the network, and we do not anticipate any material supply chain risk through the rest of the year. We continue to realize our mission with a focus on global health for people and planet, removing another 3,700 metric tons of sugar from the diets of our communities this quarter and replacing another 56 million plastic bottles in those communities.\n\nWe remain affordable now at the 37th index versus all other nonalcoholic beverages from a price standpoint. In recent months, we've strengthened our leadership team with experienced players and critical CFO, COO and now chief commercial officer role, bringing in new capabilities and signaling the opportunity for accelerated improvement in operational efficiency, cost reduction and sales execution. And we are paving the path to profitability with a strong run rate of improvement on the EBITDA line. Denise, our CFO since May, will speak about this more in a moment.\n\nI'll now provide some detail on the consumer base, drawing from syndicated data, followed by some texture on the business through a portfolio and channel lens. Zevia is growing by winning new consumers and intensifying consumption within the base. Household penetration is now at 6.1%, growing 1.4 million households or 22% in the past 12 months. Consumption intensification increased among total consumers as average household spend increased again this quarter versus prior year by 4% or $1.22 now to an average of $33.18.\n\nFurther, the existing base increased their spend 69% to $55.51 on average. Both of these figures demonstrate we are bringing in new consumers and both existing and new consumers are buying more Zevia than in the past. Zevi's growth doubled that of the broader non-alcoholic beverage category and leads 0 diet CSD by a wide margin, growing 23% in measured channels in Q2, according to IRI scan data, while 0 diet CSDs grew a still healthy 16%. Zevia brings a highly desirable shopper to our retail partners, who is less price sensitive at all income levels.\n\nAs a better-for-you multipack home stocking brand, shoppers are choosing larger pack sizes and spending more than ever across the portfolio, even while overall discretionary spending is under pressure. The Zevia shoppers spent 37% more and made 1.3 times more frequent trips for total beverages to the average U.S. soda category shopper in Q2 according to numerator. In short, Zevia is growing the consumer base at an accelerating rate, and the base is spending more on the Zevia brands than in the past.\n\nBreaking down sources of growth, velocity accounted for 47% of scan sales growth in Q2, while new store or new item distribution accounted for the other 53%. New distribution and new item growth was bolstered by the club channel by expansion of our kids line, where we gained 4,800 new food and mass merch channel store selling versus prior year and by energy drink performance in a natural channel, where new energy drink flavors accounted for 34% of overall brand growth. The summer limited time offer flavors also bolstered performance in the natural channel as Orange Cream and Fruit Punch were the number three and four selling Zevia items, accounting for an additional 20% of growth in that channel. The club channel continues to prove highly strategic and incremental to the brand and to retail partners.\n\nSince our launch in the channel and year-to-date in 2022, almost three-quarters of new to Zevia shoppers in club are also new to the brand, and two-thirds are also purchasing any sodas in the channel for the first time. Zevia club shoppers are highly incremental, but also highly valuable across channels, and they spend 35% more on Zevia in the food channel over the past six months than the average Zevia shopper. Velocity accounted for 47% of growth was heavily driven by trade-ups from six pack to eight pack and from 10 pack to 12 pack. Our new 12 pack business has been incremental, accounting for almost half of the food channel growth.\n\nSales in the e-commerce channel focused on 12 pack and 24 pack assortments have also reached record levels in the second quarter. The shopper is trading up and stocking at home with a trusted brand. Velocity was also supported by a five point increase in promotional lift stemming from more feature and display and thus more effective promotions despite spending levels being flat to prior year and 14 points below that of category level. To be clear, 40% of our volumes sold was on promotion versus 54% of the category.\n\nSo into this healthy environment, we've introduced an additional price increase at a blended 10% across the full soda portfolio in all packs, channels and geographies, which went into effect August 1. And finally, we've added a new chief commercial officer to the team, an industry veteran, Greig DeBow, bolstering our ability to improve presence and execution at retail, including price execution and promotional effectiveness and to accelerate distribution expansion. In summary, we had a strong Q2, reflecting our increasing organizational capability and thus accelerated execution. We have a stable supply chain, a healthy and growing consumer base and a clear indication of pricing power as we execute an August 1 increase across our full soda portfolio.\n\nAll of our key initiatives are showing solid progress, and we are well positioned to drive growth and significantly improved profitability. And with that, I'll hand it over to Denise.\n\nDenise Beckles -- Chief Financial Officer\n\nThank you, Amy, and good morning, everyone. It's great to be here with you. I am so thrilled to have joined Zevia and be a part of this incredible team focusing on growing the business profitably as a key part of our strategic roadmap. Today, I will begin with an overview of our second quarter financial results and then speak to guidance for the year.\n\nWe will then open the call for your questions. As Amy previously mentioned, we are pleased with our second quarter results, especially our top-line performance. In addition, we have made sequential progress on improving profitability compared to the first quarter despite significant inflationary headwinds. Second quarter net sales increased 32.5% to $45.5 million, which was well above the top end of our guidance range of $41 million to $43 million.\n\nVolume growth was the primary driver, up 30% on an equivalized case basis, and we also benefited from higher price realization and optimized promotional investments. Regarding pricing, you may recall that we instituted a price increase of 6% on our six pack soda packages effective starting Q2 and began seeing the impact of this increase later in the quarter. The benefit we derived from optimizing promotional spend was above the net sales line, so not visible to you in our reported financials. However, it's an important factor in our overall performance and an area we believe offers further potential for improvement as we continue to growing scale our business.\n\nGross profit of $17.4 million was up $1.1 million or 7% versus a year ago, reflecting growth of net sales, partially offset by higher cost of goods sold. Gross margin was 38.1%, down from 47.3% a year earlier, primarily due to the impact of inflation and manufacturing costs, partially offset by product mix. On a sequential basis, our gross margin was relatively stable, down 30 basis points as improvement in aluminum were more than offset by higher other manufacturing costs. Selling and marketing expense increased 30% to $13.9 million, reflecting higher freight and warehousing costs related to volume growth as well as inflationary pressure, some stemming from a challenging transportation market.\n\nLower marketing costs provided a partial offset due to a shift in timing and an increased efficiency of certain marketing programs. G&A expense was $9.8 million or 21.6% of net sales in the second quarter of 2022 compared to $6 million or 17.4% of net sales in the second quarter of 2021. The increase was attributable to higher employee headcount to support growth and associated public company costs. Stock-based compensation, a non-cash expense was $8 million in the second quarter of 2022, of which $3.8 million of accelerated restricted stock unit awards were related to the retirement of certain legacy senior management employees.\n\nNet loss was $14.8 million or $0.28 per diluted share of Zevia Class A common stock, a 7% sequential improvement compared to the first quarter of this year. Adjusted EBITDA loss was $6.4 million compared to an adjusted EBITDA loss of $400,000 in the second quarter of 2021. On a sequential basis, adjusted EBITDA improved by 23% compared to the first quarter of this year. Our balance sheet remains strong with $49.6 million in cash and cash equivalents and no outstanding debt as well as an unused credit line of $20 million.\n\nTurning to guidance. Based on our results and strong consumer metrics, we are reaffirming our 2022 annual net sales guidance of $177 million to $182 million, an increase of 28% to 32% over 2021, including $46 million to $48 million in Q3 of this year. We continue to deliver strong volume growth as the primary driver of top-line performance in Q3 and Q4, reflecting accelerated velocity and distribution expansion. In addition, we have implemented another price increase averaging 10% across the soda category effective August 1.\n\nThat concludes our prepared remarks. We are now ready to open up the call to your questions. Operator?\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Bonnie Herzog of Goldman Sachs. Please proceed with your question.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nHi. Thank you. Good morning, everyone. I have a question on your guidance.\n\nYour full year guidance implies around, I guess, mid-40% growth in Q4, which is a pretty big acceleration. So I just wanted to better understand what the key drivers of that will be? And then just how much visibility you have on that?\n\nDenise Beckles -- Chief Financial Officer\n\nGood morning, Bonnie. This is Denise Beckles speaking with you. Regarding your question, we believe that because we continue to see such strong velocity and distribution expansion that our Q4 guidance is more than achievable. We stand by our full year guidance that we provided earlier this year and we provided today.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nOK. And then is it also -- as I think about the mix, is the expectation of pricing, maybe improvements in mix as well as we get toward the back end of this year? Is that part of it?\n\nDenise Beckles -- Chief Financial Officer\n\nYes. That is absolutely correct.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nOK. And then maybe a question on the cost pressures that you're facing. Can you just give us a little bit more color on really where the severe, I guess, impact is? And maybe anything that you're doing to mitigate some of these costs as well as potentially some of the cost-saving initiatives that you've highlighted in the past and how that's potentially to minimize this going forward?\n\nDenise Beckles -- Chief Financial Officer\n\nYes. I'll put that answer in two ways. One, we did face inflation, which contributed about 7 points of pressure in aluminum and other three points of pressure, but got a positive impact from mix. What we are working on today is we continue to work on cost initiatives on the cost line to mitigate some of that by looking at any of our input costs around raw materials that we can affect in the short term.\n\nWe also know we'll get a positive impact from price. And as you know, we've taken back up to 10% on average against the soda category beginning August 1. From a cost perspective, just on the G&A line and our other costs that we believe we have strong controls over. We are doing everything to cut those costs.\n\nAnd some of the initiatives we've already put in place, we expect to see through the end of the year. So on things like our insurance costs and some of our other costs related to consultancy, we have started cutting those costs, and we will see the impact of those for the rest of the year.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nJust wanted to clarify something, remind us, do you hedge at all as we're looking at some of these commodities?\n\nDenise Beckles -- Chief Financial Officer\n\nNo.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nYeah. And then in terms of the cost savings initiatives that you just highlighted, have you quantified those for us or can you?\n\nDenise Beckles -- Chief Financial Officer\n\nNo. We cannot quantify those for you at this time.\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nOK. All right. Thank you so much.\n\nAmy Taylor -- President\n\nAnd Bonnie, if I may, it's Amy just to speak to the outlook and the acceleration. I think one thing worth noting is that we're learning our brand is not subject to the negative impact of the economic downturn that has on those brands that rely on more away-from-home consumption. So we don't see a trade down effect that many other brands are seeing. And we are actually seeing similar positive home stocking and spend level trends that we saw in peak COVID era, along with additional mix benefits given our recent pack and channel evolutions where we see pack trade-ups.\n\nSo that, in combination with our price increase across soda, all packs, all channels and all geographies pay into our outlook in hand with accelerated velocity that we see in the prior month.\n\nOperator\n\nThank you. Our next question comes from the line of Bryan Spillane of Bank of America. Please proceed with your question.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nThanks, operator. Good morning, everyone. I have two questions. And the first one, maybe just to follow along, I think, what Bonnie was getting at in terms of maybe margin recovery.\n\nIf we just think about the price increase that, I guess, is implemented August 1, are you now at a point where you've priced enough to begin to recover margins based on kind of where your cost basket is today? Or will you need to take additional pricing maybe at some point next year in order to recover margins. So I'm just kind of trying to understand basically if pricing is caught up to where you are in terms of inflation?\n\nDenise Beckles -- Chief Financial Officer\n\nGood morning, Bryan. Yes, we believe we've taken a price increase that does exactly that. We expect to realize the price increase through the end of the year. That's the price increase that we put in on 6% on the six pack earlier this year in second quarter and also the 10% on average in the second half of the year.\n\nAnd we believe that that will help us to mitigate inflation.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nOK. That's helpful. Thank you. And then I guess the second question, just around household penetration and -- and thank you for sharing the data.\n\nIt's actually very encouraging to see just the step-up in household penetration. I mean, can you maybe -- do you have any color or could you give us any sense of, as your household penetration is expanding, is it -- are you moving into maybe different types of households than what the original or kind of the existing Zevia base is? And I guess what I'm trying to understand is -- are you beginning to get a sense that it's becoming more mainstream, right? It's not just the health and wellness household or a whole food shopper, you beginning to see more diversity, I guess, in the household base?\n\nAmy Taylor -- President\n\nHey, Bryan. It's Amy. I always love your questions that have a consumer brand. So thank you.\n\nYes, we are seeing diversification. We gained 1.4 million households over the last 12 months, bringing us to $6.1 million. So we'll remember that, that's still a fairly low household penetration on the whole with a lot of upside. But when we see more of our growth coming from channels like mass and club, which is, of course, fueled by the macro environment.\n\nBut for us, those are highly incremental, so bringing in new households and to your point, different types of households. And what's been interesting for us is that we see very limited price sensitivity across all income levels as we bring in households of different income levels through different channels. So that's a yes, with a little bit of backup through a channel lens.\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nAll right. Great. Thank you.\n\nOperator\n\nThank you. And our next question comes from the line of Dana Telsey of Telsey Advisor Group. Please proceed with your question.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nHi. I thought the data point on promotions was interesting how your 40% in the industry is 54%. How are you planning that going forward? And what's the magnitude of promotions? Does this differ at all by channel or by account in terms of how you are planning? And then also, can you give any color on the update regarding aluminum costs and availability in terms of what you're seeing there for the back half of the year? Thank you.\n\nAmy Taylor -- President\n\nHey. Thanks, Dana. Yes, I can just speak generally to our promotional strategy and then turn it over to Denise. So you're right, we saw improved effectiveness of our promo investments in Q2 as our spend was flat and our lift increased by points.\n\nAnd we attribute that to our channel specific approach, focused on the right packs at the right debt levels through the lens of profitable growth as well as driving trial. And yes, that does vary by channel. I won't speak to that maybe channel by channel, but you can imagine that there's different tipping points on price and different packs that are relevant by channel. And that's one of the primary changes that we've made is really thinking about appropriate pack, appropriate price point in the right channel and differentiating across those.\n\nSo we imagine doing more of the same going forward and imagine and build into our plan increased efficiencies on promotions. And what that means is less spend against promo and the same or better lift as a result. And we shift across pack and channel as we see the macroeconomic changes driving foot traffic differently across channel. And then to answer your question around aluminum or manufacturing on the whole, I'll turn that over to Denise.\n\nDenise Beckles -- Chief Financial Officer\n\nOn your question on aluminum, we actually have seen prices come down in aluminum. However, if you think of the way that impacts our business, we will see the positive benefit of that in the second half of the year because it takes -- there's a delay or a lag effect of when prices change in the aluminum market that we actually then see pull through in our actual costs. So this is important to note. We do expect to see a benefit if it continues to be stable, part of it is going to be the stability of aluminum.\n\nAny other question on aluminum?\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nNo, that's it.\n\nDenise Beckles -- Chief Financial Officer\n\nThank you.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question comes from the line of Ben Bienvenu of Stephens. Please proceed with your question.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nHey. Thanks. Good morning. I want to ask about gross margins from a slightly different angle with respect to cost of goods sold per case, recognizing that the pricing increase that you took will help with profitability, how should we think about COGS per case? And I asked because if we were to keep that measure flat from here, it does look like your gross profit margin was sequentially improved from the first half to the back half, but it would be down considerably year over year.\n\nSo I'm just trying to understand the flow-through dynamics of that and then maybe where you expect that trend as aluminum costs come down?\n\nDenise Beckles -- Chief Financial Officer\n\nSo I think your assessment is correct. We believe that our margins will improve from the price increase from certain efficiencies in cost of goods sold, and we expect to see that increase through the second half of the year.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. So margins better from the second half versus the first half or maybe still feeling some pressure as you get through these elevated cost that linger?\n\nDenise Beckles -- Chief Financial Officer\n\nYes, I think that is accurately stated.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nOK. Great. My second question is around marketing spend. You noted that there was some decreased marketing spend.\n\nIt sounded like a timing shift, but you also mentioned efficiency of marketing. So wondering what the right rate of spend might look like as you move forward? And also kind of bearing in mind as consumers get more price sensitive, although that doesn't seem to be as acute of an issue for you all, as you noted, just given the brand loyalty and the repurchase rates, what marketing you expect to lay out for the remainder of this year and then into next year?\n\nAmy Taylor -- President\n\nNo, I would say our selling and marketing costs. I can't comment exactly on whether they're high or lower where they should be. What I can say is they're not necessarily in the right place right now. So we anticipate rightsizing our consumer marketing over time by shifting more dollars into pull as we drive the cost savings initiatives that Denise has outlined.\n\nSpeaking specifically to the second quarter, you're right, we saw a timing variance. But we also are driving efficiency and effectiveness in marketing right now as we speak. And as an example, we improved digital engagement and impressions versus prior year on a digital marketing spend that was literally half that of the first half of 2021. So it's really about organizational learning and then investing in more effective and efficient tactics in the meantime.\n\nAnd I'd be happy to detail that. As we look forward, we will invest more in the consumer, but those investments come from the quite remarkable actually savings initiatives that Denise, our CFO in seat since May has been driving. And the organization has been responding very quickly to those. The other thing noteworthy here is that as we've discussed on prior calls, we'll have a brand refresh rolling into 2023.\n\nAnd with new visual assets and clear positioning and communication strategies around the brand, we see that as an opportunity to put incremental investments on a dollar standpoint, if not percentage into the consumer. So into a healthy environment in 2023, we'll focus on the consumer, and we'll do that through a shift in resources within the P&L, if that makes sense.\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nIt does. That's great. Thank you.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Andrew Strelzik of BMO Capital Markets. Please proceed with your question.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nHey. Good morning. Thanks for taking the questions. First on the cost side, if you could just clarify the marketing timing shift that you talked about, are you able to quantify that? And does that come back in the back half of the year? Or does it maybe stay lower in anticipation of putting some money behind the brand refresh in '23 is the first part of that? And then the second on the cost side would be with some of the, I guess, underlying commodity prices coming down, and I know obviously, you have to work through the inventories.\n\nWhat would be the timing to which you think you might be able to start realizing some of those lower prices?\n\nDenise Beckles -- Chief Financial Officer\n\nOK. So I'll unpack the first part of your question and maybe you can repeat the second for me. So on the first part of your question on marketing, some of it is timing in basically to support the programs that were run in the second half of the year. And some of it is actually from efficiency, so will not come back.\n\nAnd literally, it's from making sure our marketing programs are effective and working, and those dollars are really generating growth for us. That's to explain market. Can you please repeat the second part of your question for me?\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nSure. With aluminum, maybe some transportation costs, at least the spot prices that we look at having come back a little bit, and I know you have some contracting and some inventories to work through. But at what point do you think -- or how long do you think it will take before, if the market cooperates, you'd be able to realize some of those lower costs on the P&L?\n\nDenise Beckles -- Chief Financial Officer\n\nWe actually believe we will start seeing them effective over the whole second half of the year. So the way we've looked at our business is we're looking to do everything to become more efficient in our cost. So we might not be able to fully control inflation, but any cost we are able to control. We are working to manage those for many of the initiatives we've put in place.\n\nSo they will come back with improvements in the second half of the year.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nOK. And then my last question. I guess I'm just thinking about the packs that you offer and the home stocking dynamics and the potential to enter the C-store channel and all of those dynamics. I guess how if at all does what you're seeing from your consumer and how they're interacting with the brand in this environment change? Maybe what packs you might offer, how you think about the different channel opportunities? Does anything kind of longer-term impact your decision making? Thanks.\n\nAmy Taylor -- President\n\nYeah, thanks, Andrew. I can talk about that. And so we brought on a new chief commercial officer and of course, this individual asking similar questions. So meaning that as we look at our pack mix did we make those decisions? Have we been focusing on the right packs and the right channels in light of an anticipated economic downturn? And the answer to that was no, we actually see a really healthy environment.\n\nAnd we believe that, that's really rooted in the nature of our product platform. So a trusted yet premium yet accessible brand with a better-for-you product with strong historical multipack sales and a less price-sensitive consumer, we don't -- we see a lot of opportunity to optimize growth by channel by introducing more multipacks and multipacks oftentimes that are unique to a channel, which then allows for pricing power within that channel. And we route those multipack choices based on usage occasions that we believe are relevant to each of the shopper and there's real traction against that. So we see trade up and pretty strong trade-up among our base.\n\nSo as an example, when we looked at -- I think I mentioned this in the prepared remarks, but when we look at a two-year view, the average spend going up 69% among our base, meaning those that have been with us for two years are spending 69% more on Zevia today than they have in the past. And yes, some of that is brand growth, but we believe some of this is simply pack price architecture by channel. So when we look to the future in a changing economic environment, we actually feel that we're either lucky or smart in thinking about our price pack architecture by channel, and we'll continue to drive that the next opportunity being to expand our immediate consumption business across relevant channels, as we've discussed in the past.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nGreat. Really helpful color. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nReed Anderson -- Investor Relations\n\nPaddy Spence -- Chairman and Chief Executive Officer\n\nAmy Taylor -- President\n\nDenise Beckles -- Chief Financial Officer\n\nBonnie Herzog -- Goldman Sachs -- Analyst\n\nBryan Spillane -- Bank of America Merrill Lynch -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nBen Bienvenu -- Stephens, Inc. -- Analyst\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nMore ZVIA analysis\n\nAll earnings call transcripts"
}