{
  "companyName": "Cabot",
  "companyTicker": "CBT",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/cabot-cbt-q3-2022-earnings-call-transcript/",
  "content": "Cabot (CBT -0.55%)\nQ3 2022 Earnings Call\nAug 09, 2022, 8:00 a.m. ET\n\nOperator\n\nGood day, and welcome to the third quarter 2022 Cabot earnings conference call. [Operator instructions] As a reminder, this call is being recorded. I would now like to turn the call over to Steven Delahunt, vice president relations and treasurer. You may begin.\n\nSteven Delahunt -- Vice President, Investor Relations\n\nThanks, Michel. Good morning. I would like to welcome you to the Cabot Corporation third quarter earnings teleconference. With me today are Sean Keohane, CEO and president; and Erica McLaughlin, senior vice president and CFO.\n\nLast night, we released results for our third quarter of fiscal 2022, copies of which are posted in the Investor Relations section of our website. The slide deck that accompanies this call is also available on the Investor Relations portion of our website and will be available in conjunction with the replay of the call. During this conference call, we will make forward-looking statements about our expected future operational and financial performance. Each forward-looking statement is subject to risks and uncertainties that could cause actual results to differ materially from those projected in such statements.\n\nAdditional information regarding these factors appears in the press release we issued last night and in our 10-K for the fiscal year ended September 30, 2021, in our 10-Q for our fiscal quarter end March 31st, 2022, which are also available on the company's website. In order to provide greater transparency regarding our operating performance, we refer to certain non-GAAP financial measures that involve adjustments to GAAP results. Any non-GAAP financial measures referenced on this call are reconciled to the most directly comparable GAAP financial measure in a table at the end of our earnings release issued last night and available in the Investors section of our website. I will now turn the call over to Sean, who will discuss the third quarter highlights and provide an update on our progress in the areas of battery materials and ESG.\n\nErica will review the company and business segment results, along with some corporate financial details. Following this, Sean will provide some closing comments and open the floor to questions. Sean?\n\nSean Keohane -- President and Chief Executive Officer\n\nThank you, Steve, and good morning, ladies and gentlemen, and welcome to our call today. I'm very pleased with our performance in the quarter as adjusted earnings per share was up 28% to a record of $1.73 compared to the same period in fiscal 2021. This record level of performance reflects the resilience of our businesses and end markets, our focus on execution, and the continued momentum in our high-growth vectors. As a result, our team was able to navigate dynamic market conditions, the impacts of pandemic lockdowns in China, continued logistics constraints, and higher energy and raw material costs.\n\nResults across our businesses were very strong with consecutive quarterly record performance in the reinforcement materials segment, where EBIT was up 33% year over year. In the performance chemicals segment, we delivered 17% year-over-year EBIT growth through effective pricing execution and strategic actions to enrich the product mix. battery materials continues to outperform the market, driven by strong execution and continued customer penetration. And finally, central to our purpose and strategy is a commitment to leadership and sustainability.\n\nAnd during the quarter, we published our 2021 sustainability report, highlighting our continued progress toward achieving our 2025 sustainability goals. Year-to-date results in battery materials have continued to exceed market growth rates. In the third quarter, volumes grew 60% year over year, while EBITDA grew approximately 70% over the same period. We continue to expand our relationships with the world's largest battery manufacturers and are building significant momentum outside the Asia region as our global customers build factories in Europe and the U.S.\n\nFor the full year, we continue to expect EBITDA to be in the range of $30 million to $35 million. The midpoint of this range equates to 100% EBITDA growth year over year driven by rapid market growth for electric vehicles and continued momentum with customer adoption of our products. The growth of battery materials is underpinned by strategic capacity additions which are critical to meet our customers' volume ramp-up requirements. Recently, we completed technical upgrades at our Xuzhou Specialty Carbons plant with the plant becoming operational during the third quarter.\n\nThe facility will optimize our specialty carbons production network to meet customer demand across a wide range of applications while immediately freeing up additional conductive carbon capacity in our global network to support the growth of battery materials. We are also well underway in the first phase of technical upgrades at our new Tianjin, China site, which is specifically targeted to support the growth of battery materials. We expect the first phase of the battery materials capacity expansion to come online in mid-fiscal 2024. And finally, we have completed the first phase of a carbon nanotube dispersion capacity expansion at our Zhuhai, China facility in July.\n\nThese investments will give us a combined capacity position that will enable us to continue growing at above-market growth rates. As we outlined last quarter, over the next three years, we plan to triple our capacity across our battery materials portfolio to ensure we are well-positioned to capitalize on the transformational opportunity of electric vehicles. Now moving to an update on the ESG front. This quarter, we published our annual sustainability report, which further advances our commitment to transparency and progress.\n\nThis year's report includes enhanced disclosures and reaffirms our commitment to the UN Global Compact. Our sustainability report details the achievements and progress we have made toward our 2025 sustainability goals and discusses our focus on achieving our net 0 ambition by 2050. The report outlines the following noteworthy achievements. We realized 91% of our 2025 greenhouse gas intensity goal by the end of 2021 and are evaluating options for establishing interim greenhouse gas reduction targets to support our ambition of achieving net 0 emissions by 2050.\n\nWe also made significant progress against our 2025 energy goal achieving an energy ratio of 157% by effectively operating our fleet of cogeneration units. By capturing and exporting excess energy from our operations, we are helping to provide neighboring businesses and communities with clean energy. We see great potential in the evolution of our transportation fleet to electric and other low-carbon vehicles. And to that end, we collaborated with one of our suppliers to conduct a successful pilot project to test zero-emissions trucking technology.\n\nAnd finally, we're committed to continuing to develop innovative products that improve performance for our customers by imparting properties that provide sustainability benefits. Over the past year, 100% of our new products were evaluated and scored for their sustainability benefits. We have long been dedicated to comprehensive reporting on our sustainability performance and aim to provide transparent disclosures as a tool for engagement with our customers, shareholders, employees, and communities. To this end, we incorporated the climate scenario analysis and climate-related risks and opportunities matrix we completed in accordance with the task force on climate-related financial disclosures, or TCFD, in our sustainability report.\n\nWe are very pleased with our progress this quarter, both on the operational execution front and against our strategic priorities. Our products are helping to enable the transformation to a more sustainable world and our entire global team is excited about the opportunities that were in front of us. I'll now turn the call over to Erica to discuss the financial and performance results in the quarter in more detail. Erica?\n\nErica McLaughlin -- Chief Financial Officer & Senior Vice President\n\nThanks, Sean. I will start with discussing results for the company and then review the segment results. We reported record adjusted EPS of $1.73 in the third quarter, up 28% compared to the third quarter of fiscal 2021, driven by record results in reinforcement materials and strong earnings in performance chemicals. Discretionary free cash flow in the quarter was $135 million, driven by strong EBITDA, and we ended the quarter with $208 million of cash.\n\ncapex in the quarter was $50 million and year to date is $121 million. We expect full year capex to be in the range of $200 million to $225 million. The balance sheet remains strong with total liquidity of $1.1 billion and net debt-to-EBITDA of 1.8 times as of June 30th. In the quarter, we issued a 10-year $400 million bond, the proceeds of which were largely used to repay a maturing $350 million bond.\n\nRising interest rates have impacted both our bond refinancing and our short-term commercial paper. This resulted in a year-over-year interest expense increase of $3 million in the third quarter. In addition, the strengthening in the U.S. dollar was a headwind to business EBIT in the quarter of $8 million as compared to the prior year due to the unfavorable impact of translating foreign earnings into U.S.\n\ndollars. The primary driver of this came from the weakening of the euro and the yen against the U.S. dollar. The year-to-date operating tax rate was 26%, which is now our expected operating rate for fiscal 2022.\n\nOur operating tax rate in the third quarter was 24% which included a benefit from the anticipated operating tax rate reducing from 27% to 26%. Now moving to segment results. During the third quarter, reinforcement materials EBIT increased by $28 million as compared to the same period in the prior year. The increase was principally driven by improved unit margins from higher pricing in our 2022 calendar year customer agreements and higher volumes across all regions.\n\nThis was partially offset by higher fixed costs associated with increased utilities and the unfavorable impact of foreign currency movement. Globally, volumes were up 5% in the third quarter, as compared to the same period of the prior year due to 6% growth in the Americas, 10% in Europe, and 1% in Asia, as the global replacement tire demand remains resilient. Higher volumes in Europe and the Americas are largely due to increased demand for our products, our unique position in Mexico, and supply tightness in the European market. Looking to the fourth quarter of fiscal 2022, we expect reinforcement materials to report significant year-over-year EBIT growth due to the impact from our 2022 customer agreements and strong volumes across all regions.\n\nSequentially, we expect EBIT to decline largely due to the normal seasonal effect on both maintenance activities and European volumes. We expect maintenance expense to increase sequentially by approximately $5 million in the fourth quarter. Now turning to performance chemicals. EBIT increased by $9 million in the third fiscal quarter as compared to the same period in fiscal 2021.\n\nThe increase was driven by higher unit margins as a result of improved pricing and product mix in our specialty carbons and fumed metal oxide product line and higher volumes in battery materials. We delivered impressive volume growth of 60%, as Sean noted, in products sold to battery materials applications as we continue to see growth driven by higher EV demand. These benefits were partially offset by higher fixed costs associated with increased utilities and the unfavorable impact of foreign currency movements. As we look ahead to the fourth quarter, we expect strong year-over-year EBIT growth, driven by higher volumes and strong unit margins.\n\nSequentially, we expect strong volume growth in our battery materials and inkjet product lines to be more than offset by normal seasonal volume declines in our specialty carbons product line and higher levels of maintenance spending. We expect maintenance expense to increase sequentially by approximately $7 million in the fourth quarter. Now moving to our capital allocation priorities going forward. We remain committed to the framework we have shared previously.\n\nWe will prioritize high confidence, high-return investments in our growth businesses, particularly focused on those in battery materials and inkjet packaging. The growth projects we are funding have compelling business cases to grow the company and we expect that we'll be able to fund these with our operating cash flow. As we think about the hurdle rate type of projects, we usually fund projects with an IRR of 20% or greater. We also look to execute attractive bolt-on acquisitions.\n\nThe focus area will be in areas that enhance the performance of our existing businesses and strengthen our growth vectors. Our investment criteria are for growth and margin-enhancing opportunities that are accretive and strengthen our competitive positions in our businesses and where we expect to see an ROIC in excess of WACC in the first three to five years. The recent acquisitions in China that Sean discussed earlier are a good example. We expect to maintain our industry-leading dividend yield, and we plan to continue to opportunistically repurchase shares.\n\nDuring the third quarter, we did both with $21 million of dividends paid to shareholders and $13 million of share repurchases in the quarter. We believe we can do all this while maintaining a healthy balance sheet and our investment-grade credit rating. I'll now turn the call back over to Sean.\n\nSean Keohane -- President and Chief Executive Officer\n\nThanks, Erica. I'm extremely pleased with another quarter of record operating results in what was a challenging environment. Based on that performance and our outlook for the fourth quarter, we are tightening our expected full year outlook of adjusted earnings per share to be in the range of $6.10 to $6.20, which is at the high end of our previous guidance of $5.80 to $6.20 and up $0.15 at the midpoint. This is truly exceptional performance for our company and reflects our strong commercial and operational execution and the value of the strategic choices that we've made in recent years.\n\nIn the fourth quarter, we expect a continuation of our strong performance. Our results will also reflect traditional seasonality and higher maintenance, as Erica outlined, as we shifted turnarounds from the third quarter to the fourth quarter in order to support our customers' volume requirements. Negotiations with our key tire customers have begun earlier than is typical this year, as both global and regional customers are focused on security of supply. This has led us to reach agreements with several of these global and regional customers, some over multiple years, that address the inflationary environment and have pricing that aligns with our expectations.\n\nI continue to be very excited about the momentum across our growth vectors, particularly in battery materials. We remain on track to grow volume at double the market rate and the midpoint of our fiscal year 2022 EBITDA outlook for battery materials represents approximately a 100% year-over-year increase. At the same time, we're making the capacity investments necessary to win as the automotive industry undergoes the transformational change to electric vehicles. Turning to the longer-term.\n\nI'm excited about the positioning of our businesses and the market outlook. Our reinforcement materials business is structurally stronger and is expected to be less cyclical due to the following factors. The tire migration to China that played out over the past 25 years was very disruptive for the entire value chain, but this migration has stabilized, and we believe we are in a new normal in terms of regional tire production. Our business model was built on making and selling in region.\n\nThis is driven by economic fundamentals but even more durable given our customers' growing preference for regional supply chains to ensure supply security. There are no material announced supply side additions coming on in the mature regions and the supply demand dynamic is very balanced. In fact, this is only getting tighter given the Russian invasion of Ukraine. Beyond these structural market dynamics, we've been laser focused on a broad range of commercial and operational excellence initiatives over the last several years that have structurally improved the profitability of the business.\n\nSuch initiatives include changes to the structure of our formulas to eliminate lag and ensure a better matching of our costs, energy recovery and yield investments to improve economics and reduce emissions, a step change in plant operating performance, and strong commercial practices to ensure we remain our customers' reinforcing carbon partner of choice as we deliver value to them and get paid appropriately for that value. Our performance chemicals portfolio benefits from attractive industry structure and is poised for growth driven by new products and underpinned by the compelling macro tailwinds of a changing mobility landscape, an increasing focus on sustainability, and the trend of becoming an ever more connected world through digitalization. As we outlined at our Investor Day in December 2021, we expect strong volume growth across this segment over the next few years. We've nurtured a great set of growth vectors that are inflecting, particularly battery materials, and we're investing behind this transformational trend to win.\n\nWe expect strong discretionary free cash flow to fund compelling growth investments and return capital to shareholders. And finally, we're a leader in ESG and recognized by our customers and shareholders for excellence. Overall, I'm very pleased with our strong execution and the progress against our Creating for Tomorrow strategy. Thank you very much for joining us today, and I will now turn the call over for a question-and-answer session.\n\nOperator\n\n[Operator instructions] Our first question comes from Jeff Zekauskas with J.P. Morgan. Your line is open.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nThanks very much. You said that you negotiated some multiyear contracts with tire manufacturers. Were price increases over a multiyear period also part of that -- those agreements? Or were they simply volume commitments?\n\nSean Keohane -- President and Chief Executive Officer\n\nHi, Jeff. This is Sean. Those were price increases in both years of the agreements where we entered into year agreements.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nWere they higher in the second year than in the first or the same or lower?\n\nSean Keohane -- President and Chief Executive Officer\n\nI think that's competitive information, Jeff. I can't disclose it. But what I can say is that the environment which is really putting an emphasis on supply security remains the case and the structural dynamics that we've talked about remain intact. And again, customers really placing a premium on supply reliability and leadership in ESG and these factors where I think we really stand out.\n\nAnd I think that's reflected in the agreements that we have reached.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nThere's not really very much operating cash flow through the first 9 months. Your inventories have moved up quite a bit. So have your receivables, not really payables so much. Can you talk about cash flow prospects in the fourth quarter?\n\nErica McLaughlin -- Chief Financial Officer & Senior Vice President\n\nSure. Jeff, it's Erica. You're right. We've had a pretty significant increase in the working capital position.\n\nThe biggest driver being the higher raw material costs that flow through both the inventory and the receivables balances. In terms of payables, we have relatively short payment terms with raw material suppliers. So that is not as resident in those balances. So we have seen a pretty significant increase in that.\n\nWe do have the balance sheet to fund that, and this is what we usually do as oil rises, fund it with more short-term borrowings, which we have done here. I would say, as oil now is starting to come down a bit as we've seen in recent weeks, you would see that impact diminish. So if oil stayed flat, you wouldn't have further increases. If it comes down, we'll see more of a benefit from the lower values more immediately in inventory and then usually in the following quarter.\n\nSo as prices reset back down as the flow-through of the inventory happens through the P&L. So we wouldn't expect to see this significant increase continue but unless oil rose a dramatic amount again, but that's not what's happening currently.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nOK. Then lastly, can you talk about volumes and your specialty black business?\n\nSean Keohane -- President and Chief Executive Officer\n\nYeah. I think as we disclosed I think volume trends were solid in the quarter, up about 2%. And so I think given the dynamic environment in China around sort of rolling COVID lockdowns and the like. I think that represents a very solid performance.\n\nOf course, across this portfolio, it's a quite diverse portfolio of applications, and we're very well represented both on the application front and also geographically. And so we've performed, I think, quite well in the current environment on the volume front.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nDoes that 2% include the EV growth?\n\nErica McLaughlin -- Chief Financial Officer & Senior Vice President\n\nJeff, yes, it does 2% was Performance Additives, which includes EV. If we try to isolate specialty carbons, it's up a bit more like 1% in the quarter.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nOK. Great. Thank you so much.\n\nOperator\n\nOur next question comes from Josh Spector with UBS. Your line is open.\n\nJosh Spector -- UBS -- Analyst\n\nYeah. Hi. Thanks for taking my question. I just wanted to drill in on the guidance for the fourth quarter and ask if you can do a bit more of a detailed walk in terms of your sequential bridge from third quarter to fourth quarter.\n\nI mean you clearly called out the maintenance impact in the Performance business. And you also talked about seasonality. I guess, me looking at it maybe three of the past five years EBIT has been up sequentially in the fourth quarter. So it's not readily apparent to me what the seasonality is? Or if there's some exacerbated impact there this year because of some higher selling into Europe.\n\nSo any additional color would be appreciated. Thanks.\n\nSean Keohane -- President and Chief Executive Officer\n\nSure. Hi, Josh. So we continue -- in terms of our outlook, we continue to see strong demand as we progress into Q4, especially in reinforcement materials and battery materials. And so again, we expect this current trend of strength to continue into Q4.\n\nAs Erica called out in her remarks, we are expecting to incur about $12 million of higher maintenance in Q4 as compared to Q3. This is related to annual site turnarounds, maintenance turnarounds. The number is higher than expected and what might be a more typical profile due to a conscious decision to push Q3 maintenance into Q4 to help support our customers' need for volume for demand. So a conscious decision there.\n\nBut that's a fairly material swing in the maintenance expense. And then at the sort of business volume level, our business typically does see a seasonal impact to volumes in Q4. It's most pronounced in Europe because of summer shutdowns. You're probably familiar with, it's pretty typical that you would see a more extended summer shutdowns at manufacturing plants in Europe, and we've seen that over a very, very long period of time, and we're expecting that historical pattern to flow through in Q4.\n\nSo a seasonal adjustment down to volumes. What you typically see from a volume standpoint, Josh, is that our Q1 and Q4 are the lower quarters, and Q2 and 3 are the higher quarters from a volume standpoint. And again, that's the seasonality. The Q1 would be the Christmas seasonality and then Q4 would be the summer seasonality, which is most pronounced in Europe.\n\nSo that historical pattern is what we're expecting to see here in the quarter. I guess the other point that I might call out is that with the tax rate catch-up in Q4 that did increase the Q4 results by about $0.04 on an EPS basis. So when you look at the higher maintenance, the historical expected volume impact from seasonality, particularly in Europe, and the tax rate catch-up, I think that sort of gets you sort of squarely there.\n\nJosh Spector -- UBS -- Analyst\n\nOK. That's really helpful. And I mean, just to follow up, I guess, on Europe specifically, the 10% volume growth, I mean it's been a choppy couple of years. So getting a two-year stack there is maybe a little bit challenging.\n\nBut I guess would you say, did you gain share? Are you supplying more spot volumes? Are you supplying more out of your other regions into Europe? I guess, what drove that volume strength and kind of how sustainable is that into next year if the supply construct stays in place?\n\nSean Keohane -- President and Chief Executive Officer\n\nYep. So Europe is certainly a dynamic environment right now given the challenges inflicted on the region from the Russia invasion of Ukraine. But volumes grew year over year in the Europe region, as you said, 10%. And this is due to higher contractual volumes in our 2022 customer agreements as well as increased spot volumes because supply remains tight in the region given this impact from the Russian Invasion.\n\nAs you know, was structurally a very balanced market prior to that and even more so now. So we have picked up some additional volumes here. And this connects to the maintenance push out into Q4 as well because our customers were looking for volumes. We ran a little harder in the quarter as well.\n\nSo I think our position, we feel very good about in Europe. We think there's a growing preference for regional supply here, even more of a priority being put on that. And so our view is that customers are looking to secure that regional supply. And therefore, that position should be pretty durable as we progress into '23.\n\nJosh Spector -- UBS -- Analyst\n\nOK. Thank you.\n\nOperator\n\nOur next question comes from Chris Kapsch with Loop Capital. Your line is open.\n\nChris Kapsch -- Loop Capital Markets -- Analyst\n\nHey. Good morning. I was hoping to get a little more granular on the battery materials business. I'm wondering if you could further characterize the commercial traction momentum you're seeing there and feeding into the EV supply chain.\n\nJust curious if the traction is sort of balanced across, I guess, conventional conductive carbons and carbon nanotubes or is it skewed toward one or the other? And then just other than your global footprint, your presumable world-class manufacturing and quality control, and all that. I'm just wondering if there's any asks or needs from these customers that aren't currently sort of part of your portfolio or solutions that you -- that they're asking for that may take some innovation or other investment to address those needs?\n\nSean Keohane -- President and Chief Executive Officer\n\nYep. Chris, thanks for the question. So certainly, very pleased with our performance in battery materials, and I think we're executing very, very well against the growth strategy, and we're putting the investment behind this as we called out in our remarks here to win as the auto industry transitions. So we're really pleased with the execution here.\n\nThe results and our expectation for the full year are running ahead of where we sort of called out on Investor Day. So early on here, we're running a little bit ahead as key customer wins continue to build momentum here. I mean our belief is that the use of conductive carbon additive blends. So this would be blends of conductive carbon black and carbon nanotubes is the direction the industry is moving in.\n\nAnd you might recall last quarter, we talked about a top 5 battery manufacturer that has adopted one of our blends. And we think that portfolio is unique among conductive carbon additive producers, and we still see that building momentum here because the optimal battery chemistry really needs both long-range and short-range conductivity. And the blend of conductive carbons and CNTs is the best way to get that. So continued traction on that front, I think, which is great.\n\nThat's sort of core to our strategy. One of the reasons why we bought the CNT business in China, and I think that's playing out well. As we look forward here, of course, market expectations are for a pretty significant CAGR out through the balance of this decade, 25% to 30% compound annual growth rate in demand. We're certainly continuing to expect to outperform that.\n\nAnd so the 50-plus percent number that we talked about at Investor Day remains our target. I think customers right now are very focused on building out regional supply chains. Most of the industry is still very Asia Pacific focus, with China playing a key role there at about 50% of the market. But there are plants that are coming on stream in Europe and under construction and coming on in the U.S., and so that will build over time.\n\nAnd having weak supply, I think, will be a critical part of the value proposition for customers. And I think on this front, we're very well-positioned with our global footprint here. So we'll be investing alongside that requirement to support our customers. So feeling really good about where things are footprint here.\n\nSo we'll be investing alongside that requirement to support our customers. So feeling really good about where things are, Chris. And I think a real transformational opportunity for the automotive industry, but certainly a transformational one for Cabot as well, and we intend to invest to win on this one.\n\nChris Kapsch -- Loop Capital Markets -- Analyst\n\nI appreciate the color. And I have one quick follow-up on the conversation around the supply agreements in the reinforcement materials business. So I understand you don't want to talk about the magnitude of the price increases in the next couple of years. But could you just talk about the magnitude of the price increase for calendar '23 vis-a-vis the increment that you got for calendar '22.\n\nI'm just asking because we're coming into '22, back in middle of '21, there wasn't, obviously, this crisis in the Ukraine and the things -- there wasn't as an acute sort of concern about security of supply. So just wondering if that translated into a bigger increment? And the deals that you have in place already, do those -- I'm assuming those are global tire players, but do they skew toward Europe vis-a-vis North America? Any color there, I appreciate it. Thanks.\n\nSean Keohane -- President and Chief Executive Officer\n\nSure. So in terms of the agreements we have reached so far, they are a mix of global tire customers and regional customers and they are a mix of one-year and two-year agreements. And as I commented earlier on, certainly, the one-year agreements have price increases embedded in them. And in the two-year as well price increases in both years.\n\nAnd I think this reflects the outlook in terms of growth for the tire industry and the supply dynamics and also the preference for regional supply. And that certainly, as you commented on, Chris, is more acute this year, given the dynamic related to Russia. But the market even prior to that was structurally set up for this, and it's only become even more pronounced here given the Russia, Ukraine situation. So the market remains very tight and customers are really putting a premium on supply security and supply reliability.\n\nAnd Cabot has definitely distinguished itself on that front over the last several years. And I think you're seeing that show through here. With respect to commentary on magnitude. Obviously, I can't comment on that as we're still in the middle of negotiations.\n\nBut as we always do in the November call, we try to wrap up and provide some visibility into that as we talk about outlook for 2023. But certainly, we feel very good about the outlook for 2023.\n\nChris Kapsch -- Loop Capital Markets -- Analyst\n\nFair enough. Thank you.\n\nOperator\n\nOur next question comes from Jeff Zekauskas with J.P. Morgan. Your line is open.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nThanks very much. Can you talk about industry capacity expansions in India? Or any major expansions in outside of Europe and the United States in the carbon black?\n\nSean Keohane -- President and Chief Executive Officer\n\nYes. So, Jeff, you're seeing some capacity investments both in China and India. And what you see there in China is typically the bigger players, the more established players, I think their investments are really probably, in my view, part of what will be a longer-term continued restructuring as the number of players shrink in China, the big get bigger and the number of players consolidate. That's not surprising as the growth rates have moderated in China from sort of double digits for a very, very long time down to sort of mid-single digit GDP that you would see a reordering of the competitive landscape.\n\nAnd so I think you see the bigger players investing in smaller players stood a fall off the table. That's how I would sort of characterize what's happening in China. And basically, China is for China because the cost structure to export out of China given the structurally higher coal tar price, the fact that there's a substantial export VAT as well as then transportation costs, let's put supply security aside for a minute, but just looking at the economic, trying to move that into another region certainly is the highest cost landed capacity. So I think generally, these investments in China are for China.\n\nWith respect to India, there have been some investments there as well by announcements, I mean, [Inaudible] in particular. And I would say nothing really new here. India is a fairly large market and [Inaudible] being a leading domestic player there continues to invest some of that product will typically flow into other areas outside of India, mostly into Southeast Asia as what we've historically seen. And so I wouldn't be surprised if that continues to happen.\n\nBut again, the market is pretty tight and pretty balanced there. They did announce an investment in Poland, [Inaudible], and I think that is probably motivated by these -- the Russia situation. And -- but on balance, what you see is, I think, a very constructive picture and pretty balanced picture. And that's our view on it.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nThanks for that. Do you plan to expand carbon black capacity in the United States or Europe over the next several years? And sort of what's your utilization rate roughly in those areas?\n\nSean Keohane -- President and Chief Executive Officer\n\nYeah. Utilization rates are high, Jeff. So they've been kind of running in the high 80s or 90-ish percent, which is pretty tight in this industry. And so we'd expect that situation to continue.\n\nWith respect to growth capacity, we certainly have, from a capital allocation standpoint, priorities around supporting growth in battery materials, and there will definitely be investments in both Europe and the U.S. as we -- to support that business over time here for sure. And then with respect to reinforcement materials, we want to continue to support our customers' growth requirements. And so our first focus area in doing that is to drive up what we call OEE or overall equipment effectiveness.\n\nThis is the -- you can think about this as the uptime and the throughput on the plants. And so we'll continue to push that and there's further runway to do that. And then every plant always has debottleneck opportunities that tend to be pretty capital efficient. And so that would be the next priority area that we would work on to support our customers' growth.\n\nAnd then the question of whether or not there's new units for reinforcement materials in Europe, I think, remains to be seen. I think we have to see, we would certainly work these two other areas first, and we think that provides good growth runway over the next few years. And then we'll see how things settle out from there.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nIn the quarter, your growth in EMEA was 10%. Does that mean that you exported material into Europe, that seems like a very high number to grow from European operations itself?\n\nSean Keohane -- President and Chief Executive Officer\n\nYeah. We did not import from other regions into Europe. We certainly have our plants running at a very good level in terms of OEE. And as I mentioned a little bit earlier, we also moved some maintenance into Q4 to support our customers.\n\nSo the on-stream factor was a little higher in the quarter because of that, because our customers needed products. So it's really a combination of those two factors Jeff, that allowed us to grow by that 10% number.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nAnd then lastly, maybe for Erica. In the Q, there's a discussion of byproduct sales. Is -- are byproduct sales in part sales of power to the grid from cogen in the United States? And maybe you could discuss that. And is that -- are cogen sales all profit?\n\nErica McLaughlin -- Chief Financial Officer & Senior Vice President\n\nSo it is exactly what you're saying, not just the steam sales, but the cogen revenue is what the byproduct revenue is, Jeff. So it is what we call our energy centers, that's what that is. And I think the increase in that comes from the increase in basically the energy prices around the world that have happened over the last year. The sales is just the sales number.\n\nSo there is a cost associated with running those, which would be embedded in our cost profile. But what is disclosed as required from GAAP is the sales.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nIs it high margin or low margin? What's it like relative to carbon black?\n\nErica McLaughlin -- Chief Financial Officer & Senior Vice President\n\nYes. No. I mean, it moves around quite a bit based on the price of energy. It is, I think, a good margin and it's a good profit stream for us.\n\nSo it is -- these are profitable investments and why we have made them. So they are good, but they do move around quite a bit depending on what either the electricity prices in a given country, the steam price that we might sell at as well. And some are also connected to either natural gas or oil type price.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nAnd does that flow through reinforcement materials mostly?\n\nErica McLaughlin -- Chief Financial Officer & Senior Vice President\n\nMostly reinforcement materials, but plants where we have also specialty carbons, there's a piece that goes to specialty carbons as well.\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nOK. Great. Thank you so much.\n\nOperator\n\nOur next question comes from Josh Spector with UBS. Your line is open.\n\nJosh Spector -- UBS -- Analyst\n\nYeah. Hi. Thanks for taking the follow-up. So I was just curious, given all the moving pieces in performance accounts, the battery start-up, the outage you guys had last year at your Belgium site, what are you thinking volumes look like in performance chems in your fourth quarter? And of the start-ups, I guess, how much of that carries forward into higher volumes next year?\n\nSean Keohane -- President and Chief Executive Officer\n\nYeah. So Josh, so we will see higher volumes in Q4 across performance chemicals continuation of growth in batteries, but also broadly speaking. With respect to the new plant. So as we commented, the Xuzhou plant became operational in the quarter.\n\nThey did not really have any material impact on the quarter. It was really commissioning and starting up, which takes usually a month or two to kind of shake it down and get everything working well, which is the case. Now what normally happens in a start-up is they go through a ramp where you're getting customers qualified on the new units. And so that generally then what you see is a ramp over multiple quarters here.\n\nAnd we'd expect that pattern to continue. It will likely be a little bit of a slower ramp this time than our historical experience given the COVID situation in China. We just simply moving product around, getting customers to adopt product off the new line, qualify off the new line is definitely a little more challenging in this dynamic China COVID environment. But we feel really good about that investment.\n\nOf course, it immediately unlocks some capacity in our global network for batteries. But we also feel really good about how that's going to support growth across the specialty carbons application. So you'll see that begin to ramp up in Q4 and in the following quarters, Josh.\n\nJosh Spector -- UBS -- Analyst\n\nOK. Thanks. Maybe I could try a little bit more explicitly, I guess, if I look at the formulated solutions and the headwind you had last year and say that kind of normalizes to a two-year stack, and you get some growth from these new projects. I guess, I can calculate volumes being up something in the range of mid-teens year on year in fourth quarter.\n\nIs that realistic or not?\n\nErica McLaughlin -- Chief Financial Officer & Senior Vice President\n\nYes, Josh. So I think you're thinking about it right. I think on specialty compounds, particularly the year-over-year Q4 number is pretty substantial because we did have the one plant offline for most of that quarter. If you think about it sequentially, Q3 to Q4, I'd say the bigger driver on Formulated Solutions is inkjet because we did have that plant back online this third quarter.\n\nAnd as you saw in the volumes for Formulated Solutions year on-ear, they were roughly flat for Q3. So the -- it's less of a sequential story. But as you're looking year over year, yes, there should be a pretty significant pickup given the plants online.\n\nJosh Spector -- UBS -- Analyst\n\nOK. That's helpful. Thank you.\n\nOperator\n\nThere are no further questions. I'd like to turn the call back over to Sean Keohane for closing remarks.\n\nSean Keohane -- President and Chief Executive Officer\n\nGreat. Well, thank you very much for joining today and for your continued support of Cabot, and we look forward to -- we look forward to -- have a great day. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSteven Delahunt -- Vice President, Investor Relations\n\nSean Keohane -- President and Chief Executive Officer\n\nErica McLaughlin -- Chief Financial Officer & Senior Vice President\n\nJeff Zekauskas -- J.P. Morgan -- Analyst\n\nJosh Spector -- UBS -- Analyst\n\nChris Kapsch -- Loop Capital Markets -- Analyst\n\nMore CBT analysis\n\nAll earnings call transcripts"
}