{
  "companyName": "DLocal Limited",
  "companyTicker": "DLO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/15/dlocal-limited-dlo-q3-2022-earnings-call-transcrip/",
  "content": "DLocal Limited (DLO -0.64%)\nQ3 2022 Earnings Call\nNov 15, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, and thank you for standing by. Welcome to the dLocal third quarter 2022 results conference call. [Operator instructions] I would now like to hand the conference over to your speaker today, Soledad Nager, head of investor relations. Please go ahead.\n\nSoledad Nager -- Head of Investor Relations\n\nThank you very much, operator. Good morning, everyone, and thank you for joining our third quarter 2022 earnings call today. If you have not seen our earnings release, a copy is posted in the financials section of our investor relations website. On the call today, I'm joined by Sebastian Kanovich, our chief executive officer; Jacobo Singer, our president and COO; Diego Cabrera Canay, our chief financial officer; and Maria Oldham, vice president of corporate development and investor relations.\n\nWe are providing a slide presentation to accompany our prepared remarks. This event is being broadcast live via webcast, and both the webcast and presentation may be accessed through dLocal's website at investor.dlocal.com. The recording will be available shortly after the event is concluded. Before proceeding, let me mention that any forward-looking statements included in the presentation or mentioned in this conference call are based on currently available information and dLocal's current assumptions, expectations, and projections about future events.\n\nWhile the company believes that our assumptions, expectations, and projections are reasonable given currently available information, you are cautioned not to place undue reliance on those forward-looking statements. Actual results may differ materially from those included in dLocal's presentation or discussed in the conference call for a variety of reasons, including those described in the forward-looking statements and risk factors section of dLocal's filings within the Securities and Exchange Commission, which are available on dLocal's investor relations website. Now, I will turn the conference over to Seba. Thank you.\n\nSeba Kanovich -- Chief Executive Officer\n\nHello, everyone. Thanks for joining us today. We are very pleased to report another strong quarter with record financial results combining growth, disciplined investment, laser-focused execution, and significant progress toward building the best financial infrastructure in emerging markets. We now operate in 39 markets, enabling our global merchants to reach over 2 billion consumers.\n\nAll this, accessed through our One dLocal model, meaning one contract, one single platform, and one API. In Q3, our total processed volume reached $2.7 billion, and we record $112 million in revenue. Despite the high baseline set in 2021, we saw robust growth in TPV and revenue, increasing by 51% and 63% year over year, respectively. TPV grew by 12% quarter over quarter and revenue by 11% quarter over quarter.\n\nWe continue to retain our clients with a solid NRR of 152% in Q3 2022. Moreover, it is important to highlight that we continue to grow our gross profit and EBITDA dollar amount consistently quarter after quarter. Gross profit increased to 54 million, up 56% year over year. Adjusted EBITDA was up 58% year over year to 42 million, both grew 9% quarter over quarter.\n\nWe continue to operate with the philosophy of delivering disciplined profitable growth. We maintained our adjusted EBITDA margin relatively stable at 37% compared to 38% in the past four quarters. On Slide 6, our geographic expansion efforts outside Latin America continue to yield outstanding results. During the quarter, we saw unparalleled growth from Africa and Asia with revenues increasing by four times year over year and 80% quarter over quarter reaching $25 million.\n\nThis is more than the 21 million revenue we recorded for the 12 months of 2021. We expect to continue to see solid growth as we cross-sell to merchants that originally started the relationships with us in Latin America, going to Africa and Asia, and vice versa. This illustrates a powerful network effect of our financial infrastructure and the quality of our solutions. On Slide 7.\n\nMoving to our Latam business, Revenue in Latam, increased by 39% year over year to 87 million, flat quarter on quarter due to temporary market limitations in the Argentine cross-border operation. If we exclude Argentina's cross-border business, Latam revenue increased by a solid 43% year over year or 7% quarter over quarter. The Argentinian government temporarily changed the conditions to access the foreign exchange market for the imports of certain goods and service, negatively impacting our Argentina cross-border volumes. The situation has improved during the quarter, and we have managed to continue processing most of our TPVs.\n\nOverall, our business continues to benefit from diversification across geographies, with no single country accounting for more than 20% of our total revenues in Q3 2022. I will now hand it over to Jaco to comment on our international expansion.\n\nJacobo Singer -- President\n\nThanks, Seba. Hi, everyone. We continue to execute on our strategy to expand to new markets. I'm happy to announce that this quarter, we have added two more countries to our portfolio, meaning, we now operate in 39 different emerging markets.\n\nDuring the quarter, we added Nicaragua, bringing the total number of markets serving Latin America to 16. We have also added Saudi Arabia to our financial infrastructure network, bringing the total number of markets serving Asia to 10. Our geographic expansion continues to be driven by two main factors: number one, addressing the needs of our merchants; and number two, attractiveness of the market. Our investment into geographic expansion typically have a fast payoff because, first, we normally have a merchant in waiting when we add a new country, providing immediate demand.\n\nThis was the case for both Nicaragua and Saudi Arabia. And second, with our One dLocal platform, any new geography or payment method become immediately available to our entire merchant base. We have been executing not only to our new countries, but also to deepen our presence in the countries in which we already operate, providing a best-in-class local solution for our global merchants. During the last quarter, we continued to enhance our infrastructure and network, adding more than 10 new payment methods in Africa and Asia.\n\nOur growth strategy continues to be fundamentally based on our organic growth. However, we continue to explore selective inorganic opportunities to improve our scale, network, and products across key markets. We power merchants from diverse verticals and from all over the globe. Our business model is not dependent on the performance and outlook of any single vertical as we operate across more than 10 of that.\n\nOver the years, we have seen different verticals go through cycles, but there are always winners and losers. We are constantly looking for new opportunities to further diversify our business and increase our resilience. We are proud to partner and serve some of the largest global merchants and marketplaces, including Microsoft, Shopify, Dropbox, SHEIN, Spotify, Delivery Hero, and Deel, as well as other high-profile global companies that have disclosure restrictions. As you can see on the left-hand side of the slide, we continue to see more merchants joining our platform.\n\nTotal enterprise merchants on our platform have grown to more than 600, and we currently manage around 200 key accounts actively. Our merchants value our tech DNA and merchants-first approach, addressing complex needs with a convenient one-stop solution. The chart on the right shows our continued success, helping our merchants operate in more countries and accept more payment methods. In the first nine months of 2022, our enterprise merchants, on average, processes payment in eight countries, accepting, on average, 78 payment methods.\n\nThis compares with an average of six countries and across 44 payment methods in 2020. As you can see, on top of growing with our existing merchants organically and gaining share of wallet, we had immense opportunity to continue growing through new geographies, new payment methods, and continuous development of our products. I will now pass it to Maria to comment on some relevant KPIs for our top 10 merchants.\n\nMaria Oldham -- Vice President, Corporate Development and Investor Relations\n\nThanks, Jaco. Hi, everyone. My name is Maria Oldham, and I'm very excited to be leading corporate development and investor relations at dLocal. I look forward to meeting many of you going forward.\n\nThe revenue from our top 10 merchants continues to increase quarter after quarter, reaching $59 million in Q3 2022 and accounting for 53% of our total revenue. In the medium term, we see customer concentration decreasing, although, in this quarter, our top 10 merchants outperformed the average. Our top 10 merchants may vary from quarter to quarter as we add new merchants and scale existing ones. In Q3 2022, our top 10 merchants were spread across various verticals, including ride hailing, commerce, streaming, advertising, financial services, and on-demand delivery.\n\nThe successful growth within our larger merchants is driven by a combination of continuous product innovation and a highly customer centric approach. Our account managers have deepened trusting relationships with our merchants, giving us continuous insights into their needs and allowing us to keep developing and cross-selling products to fulfill those demands. We have been successfully expanding our geographic footprint within our top 10 merchants. Our top 10 merchants in Q3 2022 processed payments with us in 10 countries on average versus seven countries last year, with the maximum being 19 countries versus 11 last year.\n\nWe continue to take our existing customers from Latam to Africa and Asia. For instance, nine out of our top 10 merchants are already processing in these regions compared to five out of 10 a year ago. As you can see, we also have several growth levers within our top merchants. On top of going through new geographies, new payment methods, we also maintain our focus on gaining share of wallet in order to further increase monetization in our existing merchants.\n\nNow, we will cover our team growth and distribution. First of all, it is important to remind you about our culture and the way that we operate. Since day one, we have had a lean culture, been highly disciplined with every dollar we spend, and always focused on profitable growth. Additionally, given that we operate in a very fast growing emerging market, staying lean has been essential for us to remain agile and react fast.\n\nThis has been an important competitive advantage that we are proud of and we continue to build on, especially in a challenging macro environment. Within the context of this lean culture, we continue to invest carefully in expanding our global team, responding to the new opportunities we see and driving toward our long-term objectives. At the end of Q3 2022, we had 712 employees, up 34% or by 180 FTEs year over year. Our headcount has significantly expanded outside the Americas, as we focus on hiring locally to leverage on the ground knowledge and develop deep understanding of local marketing idiosyncrasies.\n\nWe reached 146 FTEs in Africa and Asia by the end of September 2022, corresponding to 21% of our workforce and an increase of 103% year over year. Year to date, we have grown in all our areas to support our growth opportunities, including sales and marketing, operations and expansion, and tech and product teams. Tech-related growth continue to represent around 40% of our FTEs, with our sales and marketing and operations and expansion teams each accounting for around 20% of our FTEs. Diego will now review the financial highlights.\n\nDiego Canay -- Chief Financial Officer\n\nThanks, Maria. Hi, everyone. Let's begin with Slide 12. We continue to scale our business supported by a well-diversified segment base.\n\nWe saw strong TPV growth during the quarter, reaching 2.7 billion, up by 51% year over year and 12% compared to the second quarter of 2022. As you can see in the pie chart on the right, we have merchants from more than 10 verticals, and every vertical is well balanced in our portfolio with no single one accounting for more than low 20% of our TPV in Q3 2022. Thus, our business model is not dependent on the performance and outlook of any single industry vertical. The TPV growth is attributable to the performance and continued growth of merchants across most verticals, particularly in commerce, on-demand delivery, travel, software as a service, advertising, and financial services.\n\nI would also like to highlight that we have experienced growth both in pay-ins and pay-outs during the quarter. Specifically in Q3 2022, pay-ins have shown double-digit growth year over year and high single-digit growth quarter over quarter. We continue to see improvement in our payouts volumes with double-digit growth quarter over quarter and also year over year despite the hard comp, as we had higher than average volumes from certain merchants running big marketing campaigns during that period. Regarding our cross-border and local-to-local volumes, both showed solid growth year over year and quarter over quarter.\n\nDuring this quarter, we experienced growth in local-to-local TPV due to strong performance of some of our merchants and as cross-border volumes in Argentina slowed down as previously mentioned. Revenues also reached a new record, having grown 63% year over year and 11% quarter over quarter, to $112 million in Q3 2022. Our revenues of over TPV, or gross take rate, was 4.1% during the quarter compared to 4.2% in the second quarter of 2022 and 3.8% in the third quarter of 2021. Fluctuations from quarter to quarter are driven by changes in business mix.\n\nThe small drop compared to Q2 2022 is driven by a higher share of payouts and local-to-local flows, whereas take rate increase compared to Q3 2021, as pay-ins increased their relative contribution year over year. Zooming in on revenues, we continued delivering strong revenue growth, both from our existing and from our new customers. Revenues from existing merchants are those revenues that are driven by merchants that were already processing with us in the same period of last year. And revenues from new merchants are those revenues that are driven by merchants that started operating with us after the same period of last year.\n\nDuring Q3 2022, of the 63% year-over-year revenue growth, 52%, or $45 million, came from existing merchants. Our revenues from existing merchants continue to grow quarter after quarter, reaching 104 million in Q3 2022, increasing by 83% compared to the 57 million that we achieved in the same period of last year. Our net revenue retention for the third quarter was 152%. This is the result of having almost no churn less than 1%, the organic growth of our merchants in emerging markets and our ability to continue bringing them to new countries, payment methods, and to increase share of wallet.\n\nThis NRR is in line with our yearly guidance of 150 plus for the full year 2022. The remaining 11% year-over-year revenue growth, or $8 million, came from new merchants. This compares to $9 million recorded in the second quarter of 2022 and to $12 million in the same period of 2021. As our merchants typically have a three to six quarter ramp-up period, we believe that the revenues from new merchants are just an initial indication of the potential of our new customers.\n\nMoving to Slide 14, we remain focused on growing gross profit and EBITDA dollars. During the quarter we were able to scale our gross profit to 54 million, up 56% year over year and 9% quarter over quarter. Gross margin came in at 48%, relatively in line with the 49% margin levels seen during the first half of 2022. The slight decrease in gross margin is a reflection of our country and product mix.\n\nOur cost of processing for the quarter represented 2% of our TPV, stable quarter over quarter and compared to 1.8% a year ago. The increase versus Q3 2021 was driven by business mix, particularly an increase in pay-ins, which have higher processing costs than payouts. Moving on to our adjusted EBITDA, it was $42 million for the third quarter of 2022, increasing by 58% year over year and by 9% quarter over quarter. Our adjusted EBITDA margin was 37%, relatively in line with the 38% margin seen in the past four quarters.\n\nThis is in line with our yearly guidance of 35% plus for 2022. If we look at operating expenses for the quarter, we see that they have grown 26% year over year, as we saw an increase in salaries as we continued expanding our team with focus on sales, expansion, and technology. In addition, we increased our travel and marketing expenses. We operate in a hyper growth business and want to keep investing in building the infrastructure and harvesting long-term sustainable growth with a very disciplined and lean approach.\n\nBefore handing the call back to Seba for the closing remarks, I will briefly touch on our net income and liquidity. Net income totaled $113 million in the last 12 months, compared to 78 million in the full year 2021 and 28 million in 2020. Our net income in Q3 2022 reached $32 million, increasing by 64% year over year and by 5% quarter over quarter. Net income for the quarter includes $2.5 million of net financial losses as a result of higher cost of hedges, as we adapted to certain changes in FX regulations and faced higher interest rates.\n\nWe follow a disciplined hedging strategy, covering any relevant balance that we temporarily hold in local currencies. We continue to deliver positive free cash flow, generating $121 million of own funds in the last 12 months, compared to $59 million in the full year 2021, excluding the PrimeiroPay acquisition, and $44 million in 2020, with a strong net income to cash conversion of 107% for the last 12 month period. Besides, we continue to strengthen our cash position. As a result, as of September 30, 2022, we had a robust cash position of $320 million of own funds and $222 million of merchant funds.\n\nOur strong balance sheet and continuous positive free cash flow generation remain a key competitive advantage and gives us flexibility to pursue our long-term growth strategy. Seba, the floor is yours.\n\nSeba Kanovich -- Chief Executive Officer\n\nThanks, Diego. To summarize, our performance in this quarter shows the distinctive strengths of our business that we continue to build focused on long-term profitable growth, combining: number one, from a financial standpoint, robust dollar amount growth on a TPV, revenue, gross profit, and adjusted EBITDA, with solid NRR for the nine months of 2022 at 166%; two, from a strategic standpoint, a proven track record on executing our merchant cross-sell strategy and outstanding geographic expansion capitalizing on the huge opportunity in Africa and Asia, all that underpinned by our tech DNA and merchant-centric approach. Revenue from Africa and Asia accumulated $48 million in the first nine months of the year. Third, last and most importantly our lean and disciplined culture.\n\nWe delivered all that with a team of 712 people continuously striving for excellence. Our culture is a key factor for us to continue delivering our long-term ambitions. We are very proud of what we achieved this past quarter and even more excited with what is ahead of us. We have just started.\n\nWe will continue to remain humble and focused on providing the best and most comprehensive solution for our merchants in emerging markets. Big thank you to our global team, our customers, and our investors for their continued support. I'll now turn it back to the operator to open it up for questions. Thank you all for listening.\n\nIt was a pleasure being here today.\n\nOperator\n\n[Operator instructions] Our first question comes from Jorge Kuri with Morgan Stanley. Your line is now open.\n\nJorge Kuri -- Morgan Stanley -- Analyst\n\nHi, everyone. Good morning. Could I ask you to please explain what exactly happened with those FX limitations that you had in Argentina? What is the temporary nature of them? It just doesn't feel that it's going to get much better with CPI at triple digits, central bank rates probably at triple digits soon, the government running out of FX reserves. What exactly happened? What gives you comfort that this is not going to be a recurring issue at least until things improve in Argentina? And also, if you can tell us what would have been your revenues excluding this effect? Because we did see a significant deceleration of your revenue growth.\n\nYou grew 15% sequentially in the first quarter, 16% sequentially in the second quarter, and then we're down 11% this quarter. And so, I want to understand how much of that deceleration was because of this Argentina issue? Thank you.\n\nSeba Kanovich -- Chief Executive Officer\n\nJorge, good morning, and thanks for the question. So, Diego, I'll start, but feel free, please, to complement. So, Jorge, we've been navigating a complex situation in Argentina from the beginning of this current quarter. If anything, what we've seen is that, typically, in Argentina, things get tougher at first.\n\nAnd then, as months or as weeks go by, there's more clarity around the local framework. If anything, we see everything trending on the right direction. Obviously, Argentina, it's a complex country. It represents no other country of ours.\n\nIt's not a big portion of what we do. But we also, Jorge, know that deal with complex geographies. And part of the value that we bring to the table is continuing to navigate countries and situations like this. We've been in Argentina from 2016.\n\nWe've been through ups and downs in all the creativity that the local government has had. And so far, we've been able to navigate it. If anything, we are very comfortable today because we've seen things trending in all the right directions also coming into Q4. How has it been for the Argentina growth? We probably could have added 4% to 5% more in revenue.\n\nBut, Jorge, I need to emphasize that we are extremely proud with the growth numbers we've shared today. Our Africa and APAC business is booming, and we think that's a key factor going forward. We continue to not have reliance on any particular geography. And situations like this, like the one we face in Argentina, will happen in emerging markets.\n\nIt's expectable. We have 38 -- 39 countries where we operate today. It's only to be expected. But what's really important is our resilience, our understanding -- our deep understanding of the local regulatory framework, and, most importantly, from the moment these things happen, how we navigate it and how do we ensure continuity to our merchants, which is something we are very happy to be able to maintain for the most part.\n\nDiego, feel free to complement, if there's anything you want to add.\n\nDiego Canay -- Chief Financial Officer\n\nOK. From my side of the situation, it's substantially normalized by the end of the quarter. So, you know, we adapted, and the banks adapted, and the central bank adapted to these regulations. There were several changes during the quarter from the beginning of July to the end of September.\n\nIn general, the first one were negative, and then they adapted to more positive. But also, the banks take time to adapt to these regulations, and we faced those challenges as we faced many times. And we start Q4 in a much better position and growing from there.\n\nJorge Kuri -- Morgan Stanley -- Analyst\n\nThanks for that. I mean, I appreciate that the company's resilient and that you adapt to changes. And I just -- sorry, I would really want to know exactly what happened. I'm not sure that the response was clear.\n\nYou know, what exactly happened? How did it limit your ability to grow your revenues? And what exactly is happening now that you feel that the situation has been normalized? If you can just be a bit more clear so we can understand exactly the issue. Thank you.\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. OK. So, typically, when the Argentina government comes up with new regulation around the FX, they come up with a very blanket regulatory framework where they say all of these industries are now restricted. In our experience working with the local central bank, they typically want to preserve the ability for global companies that are key to the population to access dollars.\n\nWe are speaking about our merchant base who you know very well. So, these are key services for the local population. So, typically, what happens is, while the initial regulatory change is very tough≤ you see it flexibilizing over the weeks and months. There's also -- what Diego mentioned, there's also some time, Jorge, it takes for banks to understand the new regulation and therefore navigate it.\n\nSo, our expectation is that things will continue to evolve in Argentina. Obviously, it's a very volatile country. It doesn't represent much of our business. It's part of our business model to be able to navigate this stuff.\n\nAnd the reason why we are more confident because we are speaking from [Inaudible]. The last week of Q3 was 100 times better than the first week of Q3. And therefore, we are seeing the trend. And we're very comfortable going into Q4 and next year that things will continue to be doable for our merchants.\n\nJorge Kuri -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nPlease stand by for our next question. Our next question comes from Tito Labarta with Goldman Sachs. Your line is now open.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thank you for the call and taking my questions. A couple of questions, if I can.\n\nMaybe first, just a quick follow-up on the question on Argentina. Are you able to price for that? So, you know, maybe because of these issues, you increased the take rate. Just trying to see if there's any offset given the issues that you face there? And did this also impact your financial cost? Your financial cost kind of went up a lot in the quarter. Just I think you mentioned related to hedging.\n\nSo, just if you could give some more color on that. And then, I have a second question, but I'll ask after.\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. Tito, thanks. Good morning, and thanks very much for the question. I'll start with the first part, and then I'll let Jaco cover the second.\n\nYes, our price always reflects complexity in countries that are easier to navigate. We typically have lower take rates in countries where there's volatility and where there's regulatory frameworks that are challenging. Typically, you see our take rates being higher. It's just a function of the complexity we are solving for our merchants.\n\nSo, yes, we typically have the ability of having higher takes rate in markets that are more volatile like this case. Jaco, do you want to complement?\n\nJacobo Singer -- President\n\nSure. Tito, thanks for the question. So, regarding financial expenses and related to this particular change in regulation, yes, part of Q3, we have incurred into high cost of hedges because of the change in regulation. We see these being temporary changes, which we need to incur extraordinary in order to cover our position.\n\nAs we have always been saying, we take a very conservative approach toward FX. We have never been in the business of taking corrective risk. So, that's why we hedge nondollar amount. If anything, we expect, in the coming quarters, this cost to get again normalized going forward.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nGreat. Thank you. That's helpful. And my second question, more on the net revenue retention rate.\n\nYou know, you continue to be, you know, above 150-plus that you've guided for. You know, maybe if you don't have these issues in Argentina, it could have been, you know, close to where you were in 2Q. Just to think about, you know, the trajectory from here, you know, you're seeing very strong growth in Asia and Africa, any color you can give on either, you know, 4Q? But even beyond, like into next year, should we expect continued deceleration in the net revenue retention rate? Anything that can, you know, increase it from here, maybe some seasonality in 4Q? And any color on 2023 would be helpful. Thank you.\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. So, Tito, we had a very tough comp, and we are extremely proud the 152 we've just posted. We remain very consistent, and we guided to 150-plus for the year. And we are very, very confident that that's going to be delivered.\n\nWe've never had a better business. All of the growth engines in the company from strategic time point, from a commercial standpoint continue to be at full throttle. So, we are extremely optimistic on what's going to account for Q4 and 2023. We are taking the advice from the Street and trying to give you some more clarity on how we are going to navigate 2023 -- sorry, how we are going to guide for 2023.\n\nBut we are extremely optimistic in terms of what's going to come for Q4 and the future years. We've never been a better company. I know I repeat this again and again, but we never have more products. When you see countries by merchant, when you see geographic diversification, everything points into the right direction.\n\nThose things are long-term building blocks that we are happy to be -- to have in place today. So, very optimistic for Q4, I'm very optimistic for 2023 as well.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nGreat. Thanks, Sebastian. And maybe just one quick follow-up on that in terms of, what gives you that optimism? Is it, you know, the growth you're seeing in Asia and Africa? Is it maybe Argentina coming back to some extent? You know, particularly a lot of the global online merchants having tough time in some of the local markets, but, you know, maybe there's still a lot of growth in developed markets. Just any color on what makes you so optimistic\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. So, Tito, in Latam, we are clear market leaders, and we think that differentiation is going to continue to compound. We have clear modes where the biggest merchants rely on us for the most complex operations in these countries. And we think that's going to continue to evolve.\n\nObviously, Africa and APAC have been a great, great story for ourselves. When we went public, we told you we wanted to do this, that has become a clear reality. We have a run rate of $100 million outside of Latam. So, Latam is going to continue to be our stronghold, our -- part of our growth engine.\n\nBut having that complemented with our strategy across other emerging markets continues to be key. So, overall, we cannot avoid being positive. Our pipeline is healthier than ever, merchants rely on us on more geographies, for more payment methods. And those are the key things that drive value.\n\nWe know we need to solve complex problems for our merchants. We feel we are solving more and more than ever. So, we -- it's impossible for us not to be very bullish. And the other thing, Jorge, that -- sorry, Tito, I know there's -- some of these merchants are going through a very tough microenvironment, but emerging markets have proven to be a growth engine for them.\n\nWe fall right into that strategy. And if anything, you've seen many of them doing layoffs. What we've seen in the past is that when layoffs happen, typically, our services become more muted because they do outsource more of that work for us. So, all of those trends are for us in the right direction, and I want to emphasize that we are optimistic.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nThat's great color. Thanks, Seba.\n\nOperator\n\nPlease standby for our next question. Our next question comes from Tyler DuPont with Bank of America. Your line is now open.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nHi. This is Jason Kupferberg from Bank of America. Can you hear me?\n\nSeba Kanovich -- Chief Executive Officer\n\nHi, Jason. Good morning. We hear you.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nGood morning. Thank you. Now that Q4 is halfway over, I assume you have really good visibility here in the near term. I mean just as a general frame of reference, should we assume that the full year guidance for both NRR and adjusted EBITDA margins is valid for Q4 specifically?\n\nSeba Kanovich -- Chief Executive Officer\n\nSo, Jason, we've never updated our guidance. We haven't done it in Q1. We haven't done it in Q2. We are not going to do it this time.\n\nI think the color that is important to share is that everything is trending in the right direction. We've seen nothing that makes us worry in the short term. We continue to see positive underlying growth in our business. So, there's no reason why we shouldn't be able to continue to deliver on those numbers.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nOK. Understood. And just given the explosive growth you've seen in Asia and Africa, can you talk about any notable differentials in either gross or net take rates in those geographies relative to Latam? And then, anything you're seeing just in terms of your merchant clients setting up local legal entities more frequently to turn cross-border transactions into domestic? Thank you.\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. Jaco, do you want to take it?\n\nJacobo Singer -- President\n\nSure. So, Jason, hi, hello, thank you very much for the question. So, we are super positive with the steps we have been giving toward African and Asia. The two regions have become very relevant to us.\n\nIn terms of net take rates, it's still too early to find it depends on the payment mix on the countries where merchants are going to be penetrating. If anything, we see merchants trusting us more and more in our service in both geographies. And we don't see them going by themselves with local entity quite on the opposite direction penetrating these two complex regions. They prefer to do it in partnership with us.\n\nSo, we remain very, very optimistic on the step we have been giving toward those two new geographies for us. And that has been translated into the revenues were mostly -- you know, for this quarter into the two geographies. Another thing to add is we are agnostic to the payment method and to the type of service for our merchants. We're agnostic, either if they are local-to-local or cross-border, we are able to offer both type of services to our merchants.\n\nAnd that's, if anything, give us the chance to have the merchants more locked with us into more geographies. And that's the reason why most of merchants never [Inaudible] from us.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thank you.\n\nOperator\n\nPlease standby for our next question. Our next question comes from Soomit Datta, New Street Research. Your line is now open.\n\nSoomit Datta -- New Street Research -- Analyst\n\nHello, there. Thanks very much. Couple of quick questions, please. Again, firstly, just returning to Asia and Africa, very good performance.\n\nI mean you kind of almost doubled your revenues in the second -- sorry, in the third quarter. So, again, just not to try and ask the same question again, but just curious, was there anything in particular in this quarter, which was kind of happening, you know, countries coming online, a couple of merchants here or there? Is this the kind of run rate we should expect going forward just such a strong performance? And then, secondly, on a related basis, please. I'm just curious, what kind of card volumes or mix of card versus noncard are you seeing in these newer markets? I would assume that is less card volumes, and just wonder if that was having any impact on the economics of these transactions. Thanks very much.\n\nSeba Kanovich -- Chief Executive Officer\n\nHi. And thanks very much for the question. So, what has happened in both Africa and APAC is what we expected to happen, which is one API, one contract, and us being able to bring our global merchants into the new region. Nine out of our top 10 merchants use us today in Africa and APAC.\n\nThe opportunity ahead is massive. We've been bullish in this region, and we continue to believe that they're going to be a huge growth driver for us. We are not updating any guidance because that's not what we've done as a practice. But we believe that there's plenty of opportunity ahead.\n\nJaco can complement on that, Jaco has been spending his time in South Africa, and I can give you a much better view. And in terms of cards, the expectation -- what we've seen is very similar to what we've seen historically in other markets in Latam. Some countries are card-heavy. Others are not that relevant.\n\nWe -- as Jaco was mentioning before, we are paying method agnostic in the sense that we need to offer whatever payment method users want to pay with, and we intend to continue to do so. Keep in mind, typically, our net take rates reflect our cost of processing. So, we shouldn't expect significant differences between one payment and the other. Jaco, if you want to complement on the growth drivers for Africa and APAC, go ahead.\n\nJacobo Singer -- President\n\nSure. So, I think, overall, echoing what Seba was saying, the fact that we have a single API we call -- and we have -- there are a lot of analogies between the services we have been providing Latin America and opportunities that are in Africa and in Asia. And we have been able to replicate our playbook in Latam in those two continents. And the merchants, they value a lot the fact that that playbook is constant on the same API and on the same agreement, allow them to test our service or in the region faster than doing any other solution before.\n\nSo, being able to understand the complexity in Nigeria and the relevance of Verve as a payment method, or the relevance of M-Pesa in Kenya, or [Inaudible] credit and debit card in South Africa, same as we have done with UPI in India, I think that give us leverage to cross-sell to a merchant and to get the return on our investments for the regions.\n\nSoomit Datta -- New Street Research -- Analyst\n\nOK. Thank you.\n\nOperator\n\nPlease standby for our next question. Our next question comes from Andrew Bauch with SMBC. Your line is now open.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nHey. Good morning, team, and thanks for the taking the question. You spoke to the success within your top 10 merchants being a derivative of new product innovation and adoption of some of your solutions. So, maybe you could provide everybody with some specific examples on things that you're doing now within that base that you may have not been last year or the year before that.\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. Hi, Andrew. Good morning, and thanks for the question. So, I think it's always a matter of product innovation plus scale.\n\nSo, things like credit card acquiring in Nigeria or the acceptance of UPI, as Jaco was mentioning, in India, or some of the wallets we've been able to offer in Indonesia, or being able to pick and do cash collections in Egypt, all those small things compound in payments. Innovation comes in small incremental steps. And having a valued solution means that you are solving multiple problems for your merchants at the same time. So, those are the unsexy things that compound and allow you to differentiate on a daily basis.\n\nThat's what our products and engineering team are constantly evolving. And then, there are things that have more scale and are easier to point out, things like marketplaces where we use the technology we have for pay-ins and pay-outs, and we mix it together to allow marketplaces, which is many sellers and many buyers at the same time. Those complexities, when you add them up to the local regulatory framework, to the local payment methods, are things that allow us to differentiate. We are doing what we've always done at a much bigger scale, and we are able today to provide the building blocks for our merchants to be creative.\n\nSome of them want to be just -- want to do, sorry, just-in-time payouts. And that's something that requires deep infrastructure, connections with every single bank. And that's a hard work that we've been investing on for many years now, and that's how we differentiate. So, there's no bullet.\n\nIt's continuous incremental innovation, and that's what we are determined to do.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nGot it. Helpful. And then --\n\nDiego Canay -- Chief Financial Officer\n\nSorry, just an additional metric. Last year, the top merchants were in five countries. Five of them were in Asia and Africa with us. And this year, this quarter, nine of them are already in Asia and Africa with us.\n\nSo, basically, our merchants are growing and expanding with us to these markets.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nNice to see that geographic expansion. The -- your headcount stepped up pretty considerably over the last couple of quarters. Just trying to get a sense of the pace of hiring that you guys anticipate over the next year even as the world becomes more uncertain. Should we anticipate that level of new heads to come on to the platform in the coming year? Or should you expect to slow down? Any additional insight there would be much appreciated.\n\nSeba Kanovich -- Chief Executive Officer\n\nSure. So, Andrew, we've always operated with a small team, 700 people for the size of our business. It's considerably smaller than what you see other companies at our scale operating with. We intend to continue to do so.\n\nThis is the time for us to invest. The opportunity is massive. Our business has shown to have already operating leverage. So, it's very clear that it's the opportunity for us to invest.\n\nWe don't foresee, and we've never had a hiring targets. We've never set ourselves a number of people we want to hire. We make sure we have the right culture in place. We really care about being profitable, growing fast and being lean.\n\nKeep in mind, we booked some of the local for the first few years of our history, and that DNA has become really deeply ingrained. So, we are always going to be a company that's going to be extremely cautious in terms of how we spend. We believe there's a massive opportunity ahead of us, and we're going to be able to invest against it. But we are also big believers in small teams.\n\nWe believe that small teams with greatly balanced people, aligned with the right culture, can achieve amazing things. And that has always been the formula for us. And if anything, that formula, it's now more impactful and relevant than ever.\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nNo, absolutely.\n\nOperator\n\n[Operator instructions] Our next question comes from Leonardo Lee with UBS. Your line is now open.\n\nKaio Prato -- UBS -- Analyst\n\nHey, everyone. It's Kaio Prato from UBS here. Thank you for the opportunity for asking questions. I have one follow-up in terms of G&A.\n\nIf we take a look on your G&A expenses, we had actually a relevant increase in a quarter-over-quarter basis of more than 25%. So, I understand that you continue to hire more people, but I also see that it also happened like in the last quarter. So, I just would like to have a sense about what can be massive increase during this quarter. And what can we expect going forward, especially for the fourth quarter? And just to complement, if you are now more comfortable to say that you will be able to maintain this level of 37%, 38% EBITDA margin also in the fourth quarter.\n\nand if not, where can we see any type of pressure going forward? Thank you.\n\nSeba Kanovich -- Chief Executive Officer\n\nDiego, do you want to take it?\n\nDiego Canay -- Chief Financial Officer\n\nYeah. Sure, Seba. So, particularly in the third quarter, we have midyear salary increases. We also had some additional professional expenses and one-off technology expenses.\n\nSo, there were specific situations, I would say, in Q3. Going forward, we see a lot of operating leverage. As Seba mentioned, we will continue growing headcount, which is our main line of expenses, particularly in technology, sales and marketing, and expansion. But most of all the other areas, corporate areas like staff, finance, compliance, and so on are in a much more mature and sophisticated stage.\n\nSo, we expect those ones to scale quite a bit going forward.\n\nKaio Prato -- UBS -- Analyst\n\nOK. Thank you. In terms of the EBITDA margin?\n\nDiego Canay -- Chief Financial Officer\n\nWhat is your question, sorry?\n\nKaio Prato -- UBS -- Analyst\n\nSo, just to complement, like now that we are like in the middle of the fourth quarter and having said that you hired like most of the people already for this year, can we maintain the level of 37%, 38% margin for the fourth quarter as well? And if not, what -- where can we see any type of pressure?\n\nDiego Canay -- Chief Financial Officer\n\nSure. So, we give you annual guidance, so we're not giving guidance per quarter. As we mentioned, all the strengths continue in terms of growth. As I mentioned, we have an increase in opex in the third quarter, but we don't expect that type of increase in the coming quarter.\n\nSo, you know, we expect operating leverage going forward. We will guide for a new EBITDA margin level in the next year, but these are the trends that we are seeing right now.\n\nSeba Kanovich -- Chief Executive Officer\n\nSorry, Diego. And, Kaio, just to complement on that, we believe we are already very profitable. We are generating cash. The opportunity ahead of us is massive, and we believe it's important for us to have enough dollars to invest.\n\nWe've clearly shown that when we invest. There's a clear ROI. We've been good guidance of capital, and we intend to continue to be so. We're not going to splurge.\n\nWe want to continue to be very lean. But whenever we see an opportunity for growth, for investment in growth, we want to continue to pursue it because we think that's the long-term path for us. And we are very excited about our prospects. We don't think it's time now to optimize for half a point here or there in the EBITDA.\n\nWe really care about having the right investments in place, making sure that those drive growth. And then, we know, because we've seen it, that our business has significant operating leverage.\n\nKaio Prato -- UBS -- Analyst\n\nOK. Thank you, Seba and Diego.\n\nOperator\n\nAt this time, I show no further questions. I would now like to turn the conference back to Seba Kanovich, CEO, for closing remarks.\n\nSeba Kanovich -- Chief Executive Officer\n\nThank you very much. So, I don't want to be repetitive, but I want to say we are extremely proud with the results we posted this quarter. And we are extremely excited about the opportunities that we see for the company, both in Q4 and for 2023. Our strong performance year to date has shown that the strategic decisions we've made in the last year, together with a very strong execution, are putting us on a great position.\n\nSo, I want to emphasize that we are very bullish for Q4 and for 2023. I really appreciate all of the questions, and thanks very much.\n\nOperator\n\n[Operator instructions]\n\nDuration: 0 minutes\n\nSoledad Nager -- Head of Investor Relations\n\nSeba Kanovich -- Chief Executive Officer\n\nJacobo Singer -- President\n\nMaria Oldham -- Vice President, Corporate Development and Investor Relations\n\nDiego Canay -- Chief Financial Officer\n\nJorge Kuri -- Morgan Stanley -- Analyst\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nSoomit Datta -- New Street Research -- Analyst\n\nAndrew Bauch -- SMBC Nikko Securities -- Analyst\n\nKaio Prato -- UBS -- Analyst\n\nMore DLO analysis\n\nAll earnings call transcripts"
}