{
  "companyName": "Signature Bank",
  "companyTicker": "SBNY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/18/signature-bank-sbny-q3-2022-earnings-call-transcri/",
  "content": "Signature Bank (SBNY -0.78%)\nQ3 2022 Earnings Call\nOct 18, 2022, 9:00 a.m. ET\n\nOperator\n\nWelcome to the Signature Bank's 2022 third quarter results conference call. Hosting the call today from Signature Bank are Joseph J. DePaolo, president and chief executive officer; Eric R. Howell, senior executive vice president and chief operating officer; and Stephen Wyremski, senior vice president and chief financial officer.\n\nToday's call is being recorded. [Operator instructions] It is now my pleasure to turn the floor over to Susan Turkell, corporate communications for Signature Bank. You may begin.\n\nSusan Turkell\n\nGood morning, and thank you for joining us today for the Signature Bank 2022 third quarter results conference call. Before I hand the call over to president and CEO, Joseph DePaolo, please note that comments made on this call by the Signature Bank management team may include forward-looking statements that can differ materially from actual results. For a complete discussion, please review the disclaimer in our earnings presentation dealing with forward-looking information. The presentation accompanying management's remarks can be found on the company's investor relations site at investor.\n\nsignatureny.com. Now, I'd like to turn the call over to Joe.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThank you, Susan. I will provide some overview into the quarterly results, then my colleagues Eric and Steve will review the bank's financial performance in greater detail. Eric, Steve and I will address your questions at the end of our remarks. An important part of the Signature Bank's success over the years has been our focus on what we can control, hiring banking teams and expanding our relationships with our clients.\n\nWhat continues to set us apart from our competitors is our ability to identify and with our experienced teams and national banking practice that exhibit superior talent and proof of this lies with a number of strong relationships that our bank has forged with their clients over time. Although this is the most challenging deposit environment in our careers, because we stay true to our core discipline, Signature Bank often merges as a stronger institution in the wake of challenging macroeconomic backdrop. Since we cannot control external forces, such as those driven by monetary policy, we could further judge our performance by the metrics we can control, such as growth in client relationships and banking teams. This quarter we expanded our franchise with the addition of more than 1,000 new client business relationships across the institution.\n\nWe are excited about the momentum we have in cultivating new relationships today, because we know that they are the ones that will continue to bear fruit tomorrow. As Warren Buffett once said, someone is sitting in the shade today because someone planted a tree a long time ago. This is the basis on which we operate and remain committed to the long term of our clients and our franchise. We will not be distracted by the short term -- this is not the sprint, it is a marathon.\n\nNow, let's take a look at earnings. Pretax pre provision earnings for the 2022 third quarter were a record $492 million, an increase of $161 million or 49% compared with the $331 million for 2021 third quarter, but that's a good quarter. Net income for the 2022 third quarter increased $117 million or 48% -- $358 million or $5.57 diluted per share compared with $241 million or $3.88 diluted earnings per share, and that's a very good quarter, 49% and 48%. I do want to make a note that, in fact we have passed the $1 billion mark in net income in the first three quarters of 2022.\n\nAnd we believe that that's something that should be recognized by those -- that work within our institution. That's a good quarter. The increase in net income was predominantly driven by the strong growth in net interest income, which was fueled by solid asset growth of $7 billion over the last 12 months, as well as the rise in interest rates and the utilization of the excess cash. All of these factors combined, as well as our steadfast execution across all of our businesses led to a record return on common equity of 18.4% and a strong return on average assets of 1.24% and that's a good quarter.\n\nNow, let's take a look at deposits. The frequency and severity of the rate increases, deposit environment remains challenging. Total deposits decreased $1.3 billion or 1% to $103 billion this quarter. This is meaningful as many expected us to have decreases beyond $1.3 billion.\n\nThis decline was predominantly driven by deposit outflows of $3 billion of digital deposits. As expected, the rest of our franchise was positive this quarter with a growth of $1.7 billion. With contributions coming from specialized mortgage banking solutions, the fund banking division, the West Coast and our venture banking group. Remember, it is a sprint, not a marathon -- it's not a sprint, it is a marathon, excuse me.\n\nDuring the quarter non-interest bearing deposits decreased $4 billion to $37 billion. The decline in DDA was mostly driven by the decrease in digital trading, which is non-interest bearing. Just let the clients to take the balances off this net because it was less trading and to put in interest-bearing accounts, that led to the decline. Despite the decline, non-interest bearing deposits remained at a relatively high 36% of total deposits.\n\nSince the end of the 2021 third quarter, deposits increased $7.2 billion or 8% and average deposits increased $24.9 billion. Our loan-to-deposit ratio now stands at 72%, which is up from 61% one year ago. Now, I'd like to turn the call over to Eric.\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nThank you, Joe, and good morning everyone. I'd like to turn our attention to our lending businesses where we had another solid quarter. Loans during the 2011 third quarter increased $1.8 billion or 3% to $74 billion. For the prior 12 months, loans grew $15 billion or 26%.\n\nThis quarter we continued our diversification strategy, where we saw meaningful growth from nearly all our lending businesses. The commercial real estate team led the way with growth of $2.1 billion, Signature Financial increased $406 million, our new healthcare banking and finance team grew by $274 million, the mortgage warehouse lending team increased by $236 million. All other C&I grew by $139 million and venture grew by $48 million. Additionally, this quarter we purposefully and I want to emphasize that, we purposely slowed our capital call lending and we successfully reduced our portfolio by $1.3 billion.\n\nWe're employing this strategy in order to further diversify and to allow for the newer lending businesses to grow. We would like to thank Tom Byrne and his team for successfully deploying this strategy and Steve is going to go into that integrated detail later in the call. Turning to credit quality. Our portfolio continues to perform very well.\n\nNon-accrual loans increased mildly to $285 million or 25 basis points of total loans, compared with $168 million or 23 basis points for 2022 second quarter. Our past due loans were within our normal range with 30 to 89 day past due loans at $69 million or 9 basis points and 90 plus past dues at $33.7 million or 5 basis points of total loans. Net charge-offs for the 2022 third quarter were lower at $10.2 million or 6 basis points of average loans, compared with $19.7 million for the 2022 second quarter. The provision for credit losses for the 2022 third quarter increased to $29 million compared with $4.2 million for the 2022 second quarter.\n\nThe increase was primarily driven by a deteriorating macroeconomic forecast, this brought the bank's allowance for credit losses to 63 basis points and the coverage ratio stands at a healthy 251%. I'd like to point out that excluding very well secured fund banking capital call facilities, the allowance for credit loss ratio would be much higher at 105 basis points. And now onto the expanding team front. As Joe stated earlier, the core metric for us is the number of teams we onboard and we continue to realize success in this area.\n\nThis quarter the bank onboarded two private client banking teams, including one in New York and one on the West Coast and our pipeline for future teams remain strong. For the year, the bank has added a total of 12 teams, including five in New York and seven on the West Coast. Additionally, our newest national banking practice, the healthcare banking finance team was launched in the second quarter of this year. In order to support our team expansion, we continued to hire extensively throughout our operations and support infrastructure so that we can best serve our clients' needs.\n\nAnd at this point, I'll turn the call over to Steve, and he will review the quarter's financial results in greater detail.\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nThank you, Eric, and good morning everyone. I'll start by reviewing net interest income and margin. Net interest income for the third quarter reached $674 million, an increase of $25 million or 4% from the 2022 second quarter and an increase of $193 million or 40% from the 2021 third quarter. Net interest margin increased 15 basis points to 2.38% compared with 2.23% for the 2022 second quarter.\n\nThe increase in asset yields outpaced the rise in our cost of funds, which led to significant margin expansion during the quarter. We expect this trend to continue in the quarters ahead albeit at a slower pace. Let's look at asset yields and funding costs for a moment. Interest earning asset yields for the 2022 third quarter increased 78 basis points from the linked-quarter to 3.45%.\n\nThe increase in overall asset yields was across all of our asset classes and was driven by higher rates, as well as the deployment of cash into higher yielding loans. Yields on the securities portfolio increased 18 basis points linked quarter to 2.08%, given higher replacement rates and slower CPR speeds on our mortgage-backed securities portfolio. Additionally, our portfolio duration increased 4.55 -- increased to 4.55 years due to the higher interest rate environment. Turning to our loan portfolio.\n\nYields on average commercial loans and commercial mortgages increased 61 basis points to 4.13% compared with the 2022 second quarter. The increase in yields was again driven by our portfolio repricing higher. Since approximately 50% of our loans are floating rate, we expect loan yields to continue to increase significantly as short-term rates continue to move higher. Now looking at liabilities.\n\nGiven the 150 basis points of Fed moves this quarter, overall deposit costs increased 71 basis points to 1.11%. The pace of deposit cost repricing is in line with our expectations, given the frequency and magnitude of the rate hikes. During the quarter average borrowing balances decreased by $539 million and the cost of borrowings decreased by 15 basis points to 2.96%. The overall cost of funds for the quarter increased 68 basis points to 114 basis points, driven by the increase in deposit costs.\n\nIn order to prepare for the potential decline in interest rates, the bank has started to slowly decrease its asset sensitivity, with the goal of achieving an asset liability neutral profile. We will accomplish this organically in two ways. First, as Eric mentioned, we are purposefully reducing our Fund Banking exposure, particularly where there are syndicated transactions without deposit opportunities. This will drive our floating rate loan mix lower.\n\nSecond, we will continue to add fixed rate exposure through our many lending businesses, which will help to add duration to our assets. This strategy will lead to a net interest margin that is stable and less sensitive to the movement in interest rates. On to non-interest income and expense. With our plan to grow non-interest income, we achieved growth of $12.4 million or 39% to $43.8 million when compared with the 2021 third quarter.\n\nThe increase was primarily related to FX income and lending fees, driven by our newer businesses and geographic expansion. Non-interest expense for the 2022 third quarter was $225 million versus $181 million for the same period a year ago. The $44 million or 24% increase was principally due to the addition of new private client banking teams, national banking practices and operational personnel, as well as client-related expenses that are activity driven and have increased with the growth of our businesses. Despite the significant hiring, the launch of that healthcare banking and finance team and considerable operational investments, the Bank's efficiency ratio improved to 31.4% for the 2022 third quarter versus 35.4% for the comparable period last year.\n\nLooking at taxes. For this quarter we benefited from additional tax credits associated with sustainable finance lending. This lowered our tax rate to 22.6% for the quarter. While we expect to see continued benefits from these tax credits due to the strategic initiative of the sustainable finance lending these additional benefit -- without these additional benefits, our tax rate would have been 26%.\n\nTurning to capital. Our capital ratios remain well in excess of regulatory requirements and augment the relatively low risk profile of the balance sheet, as evidenced by a common equity Tier 1 risk-based ratio of 10.11% and total risk-based ratio of 11.99% as of the 2022 third quarter. Now, I will turn the call back to Joe. Thank you.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThanks, Steve. Signature Bank's strong performance as reflected by our return on common equity of 18.4% is a result of one of our main objectives, bring on talented banking teams and businesses and support them to our service oriented platform. These banking professionals have a proven track record that illustrates what they do best, bringing on relationships to service clients for long-term. This fundamental concept is more effective today than ever before.\n\nAnd here's why. Team hiring opportunities. Right now, we are in the middle of one of the better environment for team hiring due to the disruption caused by M&A within our marketplace. This is evidenced by a total of 12 teams, as well as two national banking practices on boarded over the last 12 months.\n\nSome examples of the disruption of on the East Coast in M&T Peoples, Sterling and Webster, DNB and going. And then out West, the disruption is coming from Bank of the West, Union Bank and the City National RBC. Now, I know City National RBC was five years ago, but they did a good job keeping it together. The disruption is occurring there later than usual.\n\nNumber two, our record earnings allows us to invest in our service offering. This helps us to expand our existing relationships, while also attracting new sophisticated clients in the future. We are investing more than ever before as evidenced by our increase in non-interest expense. And finally, many of you have already know by now, this is I'm always saying is any chance I get, differentiated model is so highly profitable, but despite the current massive investment in our infrastructure, we consistently operate at an efficiency ratio that is notably lower than the rest of the industry.\n\nAs mentioned earlier, this quarter it was an astonishing 31.4%. Just remember, we have no retail and we don't have the expense related to the retail and we shouldn't just look at margins, we should look at the efficiency ratio. Collectively, all of these factors are driving the growth and the number of clients that choose to bank with us. I'd like to thank all of our teams and businesses that work hard for our clients and our colleagues that help and support them, all of you make Signature Bank well positioned for continued success.\n\nWe're doing all the right things to build a better future for the bank. Now, Steve, Eric and I are happy to answer any questions you might have.\n\nOperator\n\n[Operator instructions] Our first question is coming from Ebrahim Poonawala from Bank of America.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nGood morning.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nI guess, Steve, just first wanted to start in terms of how you're managing or thinking about deposits. One, maybe Eric or Steve talk to us in terms of visibility on deposit outlook, entire industries using deposits, but given the client acquisition, how do you think about deposit growth overall and for digital asset deposits. And secondarily, how low do you think the cash balance? They declined over 10% of earning assets, it used to be about 4% pre-pandemic. Like how low do you think the cash balances get? And do we get there in the next quarter?\n\nJoe DePaolo -- President and Chief Executive Officer\n\nEbrahim, it's Joe. Good morning. One, we have a number of deposit initiatives, which makes us feel very good and positive about the future. We have the fund banking division, which is refocusing growth efforts on deposits for the second half of this year.\n\nAnd they did a good job in the third quarter and it continue in the fourth quarter to drive deposits in and we're going to be lease clients that don't give us deposits, because we want to have a relationship. The specialized Mortgage Banking Solutions Group is continuing to grow in big numbers and we see that continuing on to the next several years. One of the other things that we haven't talked about in a while is EB-5. EB-5 at one point had grown of $2 billion on our balance sheet, now it's about $100 million or so.\n\nAnd we have a new legislation that was passed several months ago that EB-5 is now back in working order and it's not going to be on an annual basis approved by the Congress, it is going to be on a five-year basis. So we are going to have five year business. We right now have a pipeline of nearly $4 billion. With a pipeline of $4 billion in deposits we expect to happen over the next several years.\n\nSo it's not going to be all at once, we may see a little bit of it in the fourth quarter, probably looking at in the next several years. So we have a number of things going on, including the 12 teams we hired. We have both on the West Coast and the East Coast. So we have that going for us.\n\nAnd then you have digital. Since I don't know what the bottom is, but I do know that they've been in winter period of time for a while, and it's only going to go up instead of going down. So those are the things that's happening that are allowing us to feel positive and confident in the future for deposits. \n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nAnd then I guess -- yeah, go ahead.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nRight now, we've been monitoring it as we should on a minute-by-minute basis, and we feel comfortable that we'll be at the amount that we want at any point in time. We haven't had any issues to liquidity at all.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nUnderstood. And I guess maybe just, Steve, I think you mentioned about like neutralizing asset sensitivity. Just give us a sense of like when do you fully get there? Is it based on over the next few quarters that the Fed funds need to get to some point. And in that world, where do you think the Signature ROE and like this 18% to 19% ROE defensible once you get to that point, because the stock is, obviously, not reflecting that at 1.3 times growth.\n\nI would love to hear how you're thinking about neutralizing that and where this ROE lands in the network?\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nSure. So on your NIM question, as far as where we see the asset sensitivity go, and we do see margin expansion continuing to occur into the next quarter. And then once the Fed does ultimately stop hiking, we would expect to continue to see our assets reprice ongoing as our deposit pricing then is locked in at that point. So we continue to expect margin expansion both near and long term as we look over the next year or so.\n\nIn regards to your ROE comments, would we expect 18% ROE going forward. I mean, I don't know that we will achieve this level, but we continue to expect ROE in and around as may be slightly below, just given where we are operating asset sensitivity that we have and we continue the expansion that we expect going forward.\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nYeah, we had a little bit of cash benefit in there affecting the near term, but we should be operating at the high end of our ROE range for quite some time. And we'll see expense growth moderate probably not for several quarters. But as we look out into the second half of next year, the expense growth will start to moderate and we'll continue to have the fee income and margin expansion kicking in. So we feel very good about forward-looking earnings.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nAnd just, Eric, so we have this right, you do expect margins to continue to expand even after the Fed stops, because the lag repricing in assets. So you don't expect margin to actually be negatively hit when the Fed stops, correct?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nAbsolutely. I mean, if you think through, right, we had an increasing margin, right, maybe not as much as people had hoped for, but it was pretty substantial in our minds, right? And that's up against a Fed backdrop and activities that the Fed is taking on it that we've never seen before in our banking careers. We're seeing a rapidly rising interest rate environment, coupled with quantitative tightening, which is something that's never occurred. So that's really difficult to overcome in the near term, but we've been able to do it and we think we'll be able to continue to do that, because our assets will reprice higher.\n\nWe have a lot of floating rate. But once the Fed stops hiking, that's going to lock in our liability costs and then we're going to slowly continue to see the longer-term assets that we have on our books reprice higher as well. So we have margin expansion as we look forward for quite some time. But what we're trying to do is be protective of interest rates if we look three years out going down, right? Because the curve is essentially telling us that we're headed into a recession if we're not there already.\n\nSo we want to get to an asset liability neutral state. We're not looking to do it overnight. We're going to do it over the course of the next year or two, and start to lock in some duration on our assets to be protective when interest rates finally do come back down, which is typical when we hit a recession.\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nGot it. Thank you.\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nThank you.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Manan Gosalia from Morgan Stanley.\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nHi, good morning.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nGood morning.\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nHey. I was wondering -- I appreciate your comments on adding more fixed rate lending exposure to protect against decline in rates and eventually get to neutral. I wanted to ask about the liability side. I mean, are there any plans that you are not funding given Fed QT and all the headwinds that you imagine across the industry.\n\nI didn't see that this quarter, but would you be willing to put on more longer-dated CDs at some stage just a term out funding. And maybe as a follow-up to that, I know you mentioned that the NIM should continue to expand. But can you talk a little bit about how you expect the funding cost on the deposit side to trend once Fed stops raising rates.\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nSo just on your question about turning things out. I mean, we've done it to a very small extent. It's something we look at, but it's not something that's a material driver at this point. I think we're comfortable with our deposit funding.\n\nAnd some of the opportunities that Joe mentioned earlier to fund through that channel, certainly our preference would be to fund our growth through deposits as opposed to long-term borrowing as well.\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nGot it. And would you expect the cost of deposits to continue to rise after the Fed stops raising rates?\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nAfter the fund stops raising rates? I mean, I think mayebe...\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nAfter the Fed stops raising rates.\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nYeah. I think we might feel a little bit, but it will tail off. And as Eric was just talking about, that's one of our assets and a longer duration assets, we will continue to reprice and we'll see a pickup there on an ongoing basis.\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nOK, great. And last quarter I think you updated your earning asset growth to about $1 billion to $3 billion a quarter mainly driven by loans. You heard about the lower end of that range this quarter. Is that still a good way to think about it as we get into 2023, especially given the headwinds on the deposit side for the industry?\n\nJoe DePaolo -- President and Chief Executive Officer\n\nI can tell you that the $1 billion to $3 billion is definitely for the fourth quarter and then we'll see what happens the remainder of the year. Because if we get more deposits and if we accelerate the growth of the deposits at a rapid pace, you may be able to increase the asset side and give different guidance, but right now, $1 billion to $3 billion.\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nOK. Thank you.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Casey Haire from Jefferies.\n\nCasey Haire -- Jefferies -- Analyst\n\nYeah, thanks. Good morning, guys. I guess, following up on the neutral strategy, getting the balance sheet neutral. So you're at 50% floating-rate loans, how -- at what level of floating-rate loans is the balance sheet neutral? Just trying to get a sense of how much downside we have on capital call.\n\nIt sounds like it's going be gradual but just wanted to get a sense.\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nI mean, Casey, I would say, not necessarily all about Fund Banking reduction, but more so our growth being focused on some of the fixed rate component that will drive us than toward being more asset neutral. Do you mean, fund backing were to maintain your book and continue to maintain that if our mix growth is more fixed rate, we're going to continue then to be more neutral. So that's really the strategy.\n\nCasey Haire -- Jefferies -- Analyst\n\nOK. So hold capital call and just grow more fixed rate?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nCorrect.\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nThat's right.\n\nCasey Haire -- Jefferies -- Analyst\n\nGot you. OK. And then cumulative deposit beta, you guys talked about 40% last quarter. And I know you guys have been -- anything else that is going to be higher? Any updated thoughts as to where that might end up and across what forward curve?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nSure. So right now, we're looking at somewhere in the low 50s. I mean, we do continue to see pressure on pricing. But as we've spoken about with the last few remarks, as that pressure does ensue, we certainly expect our assets to continue to reprice and see accretion there as well.\n\nSo we do continue to see some pressure and into the low 50s is what we're currently forecasting.\n\nCasey Haire -- Jefferies -- Analyst\n\nGot you. And then Eric, can I just ask you to put a finer point on the expense cadence. It sounds like it's going to run and it's going to moderate a little bit from that this mid-20s level toward the lower 20s and then moderate even lower in the back half of '23. Is that right? And is that moderating pace in the back half of '23 more in line with that mid-teens that we've -- that we're accustomed to with Signature?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nI think it's going to stay in the mid-20s for the next several quarters and then we'll start to moderate in the back half of next year, probably coming down gradually into the low 20s and then into -- if you look out into 2024, I think we'll get back into the teams then. We've got a lot of expense build, infrastructure spend and product spend to take on. So it's going to be elevated for several -- for couple of quarters and then start to trend down slowly from there.\n\nCasey Haire -- Jefferies -- Analyst\n\nGot you.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nIt won't stop us from hiring any additional teams and businesses.\n\nCasey Haire -- Jefferies -- Analyst\n\nUnderstood. Thank you.\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nAnd as Joe said, we've got a unique opportunity right now given the M&A disruption in the marketplace. And typically recessionary times are good times for Signature Bank as it relates to hiring key personnel, especially on banking teams.\n\nOperator\n\nYour next question comes from Mark Fitzgibbon from Piper Sandler.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nThank you, and good morning.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nGood morning, Mark.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nI wonder if you guys could share with us what the spot cost of deposits today looks like, do you have a sense for that versus what it was -- the average for the quarter? I think it was 111?\n\nJoe DePaolo -- President and Chief Executive Officer\n\nYes, it's about 150 basis points at spot.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nOK. Secondly, could you share with us also the number of digital clients that you have today?\n\nJoe DePaolo -- President and Chief Executive Officer\n\nWe're up to 1,439 digital clients, so we added 116 during the quarter.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nOK. And then lastly, I wonder if you could help us think about the relationship that you just -- the partnership you just entered with Coinbase. How you think that will track over time? How big of an opportunity it is? And maybe how much is flowed in thus far? Thank you.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThe partnership is not really the partnership. It's that they're coming on board to use Signet use us as well. They're an exchange and they wanted to use Signet and Signature Bank for most of their operating businesses and which is the exchange. The activity there will be moving from other banks on to us, and it allows us not only to service them, but he has -- they have to have to be on Signet, their clients who trade with them have to be on Signet as well.\n\nSo it's a win-win for them because that means their clients will go Signet service bank they get -- and they will also benefit us because what we're going to be doing is getting the clients that we didn't have that trade on the exchange. So it's not unusual to send something out like that press release. We've had foreign exchanges join us in the last several months. And this happens to be the biggest by far.\n\nAnd the other exchanges will do the same thing. They'll be bringing their clients on so that they can do the exchange on Signet as opposed to someone else's about banks platform.\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nThank you.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThank you, Mark.\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nThanks, Mark.\n\nOperator\n\nOur next question comes from Matthew Breese from Stephens, Inc.\n\nMatthew Breese -- Stephens, Inc. -- Analyst\n\nGood morning, everybody.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nGood morning, Matthew.\n\nMatthew Breese -- Stephens, Inc. -- Analyst\n\nI wanted to touch on commercial loan yields. So the book is now roughly 50% floating rates and I guess I've been a little bit surprised by the move in commercial loan yields relative to Fed funds of 300 bps, but we've only seen a 73-basis-point move in commercial loan yield. So curious as to why it's been a slower moving -- slower moving on commercial loan yields? What is the expected loan beta over the next 12 months? And then on the fixed rate side, could you just give us some update on what incremental commercial real estate and multi-family loan yields are?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nWell, I'll start from the latter. The incremental yields were at six and a quarter on commercial real estate. Our fund banking were in the low 5% range. Signature Financial in the high 5%, low 6% range.\n\nAnd then to hit on at your loan yield question, I think that -- what's really happening there is just driven by pipeline, right? So we have pipeline that are -- and given how fast the Fed is hiking, is there some catch up that needs to ultimately come through there. So we should see that continue to roll through as the Fed hikes. And once they certainly slow, then we should see that moderate and hit the levels that you're suggesting and expecting. If I look at total interest earning assets over the next quarter.\n\nI mean, I think we've been in the four and a quarter range roughly based upon where things have been repricing when considering pipeline.\n\nMatthew Breese -- Stephens, Inc. -- Analyst\n\nAnd that's for overall interest earning assets?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nThat's correct.\n\nMatthew Breese -- Stephens, Inc. -- Analyst\n\nOK. And then I wanted to talk about the digital assets deposits. So it seems to me that the deposit balances here have proven to be on the higher beta side and it seems that there's pretty good movement from demand to interest bearing categories as rates have gone higher. You're also providing Signet for free.\n\nSo I guess my question is, as time has evolved, you've seen some of the underlying characteristics of the deposits here, are the economics what you'd hoped for when you entered this business and thought about a higher rate environment? And do you have to start thinking about charging for Signet and some of the other offerings you're providing given what we're seeing on the deposit beta front?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nI think the economics are very much in line with what we anticipated here. Fortunately, it's similar to all of our businesses. It's not a high expense business as we look at operating expenses, the size of the team that we have that supports that and the needs there. So it's highly efficient.\n\nSo you combine the efficiency ratio, you bring that into the equation and it makes for it to be a pretty profitable business, Matt. Interest rates are more or less in line with what we anticipated and we've said for a while now that our DDA was at an all-time high and we really didn't anticipate it spinning at that level. We've seen a decline in activity in that space. And with that decline in activity, people need to maintain less on the Signet platform, because quite frankly they're not trading as much.\n\nAnd if we look at the stable comment side of the equation, traders now instead of sitting in stable coin are putting their money in treasuries, right? Because they're trading much frequently. And treasuries have become an alternative to the stable coin just like they've become an alternative to bank balance sheet deposits. So that's where we're seeing some of the declines in that space. Fortunately, declines were a little bit less so this quarter than last.\n\nAnd we're kind of hoping that we're near at or near the bottom of that decline in that space. But there's -- it's still very choppy, and that's hard to predict. But I think it's very much in line with what we thought the economics would be. And we really don't see a need to charge there just as we don't charge in the remainder of our bank, right? Our strategy has never been to nickel and dime, our clients and quite frankly, that's worked out incredibly well for us over the last 22 years of existence and we see no reason to change that now.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThe exchanges are our biggest deposits. And that doesn't include the clients that are coming on board that want to deal with those exchanges. So what happens is, we get a benefit of the exchange joining us and then all the clients following them to Signet. And so, we certainly don't want to charge a fee for the exchanges because they're actually bringing us business by moving on to the platform.\n\nMatthew Breese -- Stephens, Inc. -- Analyst\n\nUnderstood. OK. Last one from me, just understanding non-performing assets, charge offs are still incredibly low. I wanted to get some insight as to how you're thinking about credit provisioning going forward? It just seems like there's plenty of headwinds, particularly as it relates to loan resets and debt service coverage ratios for your commercial real estate properties? And then with higher interest rates, you can kind of pencil out higher cap rates.\n\nI'm curious what you're seeing on these fronts.\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nWell, we're definitely not seeing higher cap rates. That's just not playing it through. Fortunately for us, we're not a consumer backed right. We expect that you're really going to see credit hit the consumer side corner.\n\nAnd at the end of the day, Matt, we're relationship based bank, right? And our two largest asset classes are commercial real estate and fund banking, pretty pristine. I mean, how many crisis do we have to go through in New York? How many times over the last 20 and let me take the history of that team, 20 years prior to that, so the last four years we've been through lots of economic cycles and we haven't had much in charge offs at all, right? So we're just not worried about our commercial real estate portfolio. And we're doing business with the right people and that's shown improved out time in time in time again. And then if we look at Signature Financial, we're a very secured lender there and we've seen a history of strong performance through cycles in that space.\n\nWe're not a meaningful player in the C&I market, although we're increasing that exposure again with very experienced teams and players in that space. So we feel that it's going to be quite contained and controlled credit metrics. We're always -- we've been mindful for quite some time about lease out in the battle office, right? We're not seeing really any issues there at all, right? We don't have a single office loan that's in non-accrual today and -- but we have built our reserves in those two areas specifically to be ready should issues arise. But we feel like we're pretty well protected at this point because of the relationship based banking model that we have.\n\nAs for future reserves, it's going to really be based on the macroeconomic forecasts that we're getting as many. But we know we utilize these forecasting as most banks do in the industry.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nLet me add one other things, with the allowance when banks were taking back reserves over the last several quarters, we were not, we were provisioning. And so that makes us feel even more secure because of the fact that we were provisioning while they were taking reserves back.\n\nMatthew Breese -- Stephens, Inc. -- Analyst\n\nI appreciate it. That's all I had. Thanks for taking my questions.\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Jared Shaw from Wells Fargo Securities.\n\nJared Shaw -- Wells Fargo Securities -- Analyst\n\nHi, guys. Good morning. Just going back to the digital deposit, so it sounds like maybe we're at stable level here given the volume and volatility in broader crypto and that potential growth in the future will come from some of these new initiatives like the four exchanges and the potential for volume and volatility to increase in crypto, is that the way to think through it or there still could be incremental downside to balances right now?\n\nJoe DePaolo -- President and Chief Executive Officer\n\nI think what you said in the beginning of your question, I would agree with that. It seems like it's somewhat stabilizing. They've been in this winter crypto for over a year now. And sooner or later, it's time to get out.\n\nAnd we're probably seeing positive things going on for us. So that when it does dissipate, we'll have -- we'll be ready, just like with all our other businesses. Like Eric said, in commercial real estate, we deal with the best of the best. In digital, we turn down more clients or potential clients than we bring on clients, because of all the due diligence that we do because we want to deal with the best of the best.\n\nAnd what put us in the advantage on the digital side was that we had a team that has been doing it five years before they came to join us one year ago. So we're feeling pretty good about is, we are not making any prediction.\n\nJared Shaw -- Wells Fargo Securities -- Analyst\n\nOK. And then when you look at the growth in deposits, especially with the mortgage business and some of these others, how are you winning that? Is that really just all the price gain right now with the rate environment? Or is it -- you're actually bringing on good DDA with those relationships as well or is it all nesting at this point?\n\nJoe DePaolo -- President and Chief Executive Officer\n\nClearly that will bring on more DDA relationships. I think we internally we talk about the large depositors, $100 million and more, but it's the ones that are at the $5 million level and $4 million level and $3 million level that make up the strength of any institution. And so we have quite a bit of those and that will continue. Not everyone's going to be a digital player at $100 million.\n\nCan we do that? Can we do that because we need to have a mixture? We need to have the small businesses on all businesses. But to be small, you need to have that business coupled with the large depositors.\n\nJared Shaw -- Wells Fargo Securities -- Analyst\n\nGreat. Thank you.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThank you, Jared.\n\nOperator\n\nOur next question comes from David Rochester from Compass Point.\n\nDave Rochester -- Compass Point Research and Trading -- Analyst\n\nHey. Good morning, guys.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nGood morning, David.\n\nDave Rochester -- Compass Point Research and Trading -- Analyst\n\nI just want to go back to your NIM commentary, because that sounded pretty positive if you guys are expecting expansion over the next, call it, several quarters while, moving to that low 50s deposit beta that you talked about. So I was just wondering given your expectations for the curve and hikes and I know nobody has a crystal ball. But how are you thinking about the range that that NIM could settle into over the next year and change. Do you hit a 250 level? Do you hit 260? Can it go higher than that? How are you guys thinking about it?\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nI mean, Dave, it's really tough to say from a timing standpoint, just given how unpredictable the Fed has been, how unpredictable the quantitative tightening has been to impact us that some of the alternatives that Eric spoke about earlier with treasuries against deposits are just -- we run so many different scenarios that it's tough to specifically guide here, but we do expect to be up just at a slower level than we were or a lower level than we were this past quarter.\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nI think single digits.\n\nDave Rochester -- Compass Point Research and Trading -- Analyst\n\nYes. OK. Yes, single digit on a quarterly basis going forward. \n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nFor the quarter, correct. Correct.\n\nDave Rochester -- Compass Point Research and Trading -- Analyst\n\nYeah. OK. All right. That's helpful.\n\nAnd then just on the Fund Banking team's efforts to pull in deposits. I know you did a good job in getting them much more focused on deploying deposits in by sort of shutting off the credit side. I was just curious where they are today in terms of the deposits for that team. And then I know back when you brought these guys on several years ago, they were a self-funded team.\n\nBut I know since then their customers aren't necessarily holding as much cash as they used to. How should we think about the deposit potential from that segment going forward? I mean, you think you're making it halfway funded, third funded, how are you guys thinking about that?\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nWe don't -- we prefer not to give out balances by teams, Dave. So we don't want to break that up. They had a great quarter where they're up $470 million deposit growth. So we're very pleased with what they've done on that front and how they pivoted to deposits.\n\nIt's got to be really hard for them to be even a third funded, right? The nature of that business has just changed over the last three, four years where these private equity funds are just not sitting on cash in any meaningful way like they used to. So let's get them to 10% first, right? I think they're coming in at 5% right now. So let's get them to 10% and then we can kind of tell you where it goes from there.\n\nDave Rochester -- Compass Point Research and Trading -- Analyst\n\nSounds good. And then maybe one last one on the EB-5 program. I know, Joe, you talked about this for a number of quarters now and it sounds like the pipeline continues to grow. I think you said it's almost $4 billion now, but it's a multiyear type of program.\n\nAre you thinking that that's like $1 billion contributor per year to deposit growth? How are you thinking about that?\n\nSusan Turkell\n\nI'll take that a billion a year. We said it is going to be over the years. The pipeline is continuing to grow because one of the things we have going for us is that the team we have is very good and the boost the EB-5 have changed according to the Congress. And it's a little harder to do than it was in the past.\n\nIn fact, we had two banks that's an EB-5, two very small banks that the EB-5 in the past that actually asked us to take over the EB-5 for their clients because of the knowledge base that we were able to garner with the team that we have. So we're looking at probably not in a major effect. It's all likely -- there will be no major effect to 2022 and in the fourth quarter, but we're going to see something in 2023. Right now, we've signed up and we have the projects.\n\nSo we're the bank, but now they have to go out and get the investors.\n\nDave Rochester -- Compass Point Research and Trading -- Analyst\n\nYes. OK. Thanks, guys.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question and comes from Steven Alexopoulos from J.P. Morgan.\n\nSteve Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nHey. Good morning, everyone.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nGood morning, Steve.\n\nSteve Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nI want to start, you gave us the total for the digital asset deposits of $23.5 billion. Could you give us the breakdown?\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nSure. We have, let's say, $3.8 million -- billion, sorry, from stable coin issuers. $4.4 billion OTC desks and institutional traders. We have $12.3 billion from digital asset exchanges and we have $2.8 billion from blockchain technology and digital miners.\n\nThat's a total of $23.5 billion.\n\nSteve Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nThank you. I'm curious, given the comment for NIM expectations and expansion going forward which you outlined, the most difficult job we're having now is figure out how where noninterest-bearing deposits are going, right? Pre-QE, that's [Inaudible] billion, you're 37 now, but you're making some assumption for those, Eric, to say your NIM's going to expand, what are you assuming at least. You have to assume some level, right, if you're commenting on NIM expansion. Just where are you assuming those bottom?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nYes. Well, we're assuming that over the course of the next year and two years out, we're going to see that slowly come down, right? We've traditionally operated in and as low as a 24% PDA, that was probably over a decade ago to as high as where we were last quarter, right? Our normal range, I'd say, has been in a 28% to 34%, really more 28$to 32%. So we're expecting that we're going to slowly see that DDA percentage come down into the low 30% range.\n\nSteve Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nAll right. OK. That's helpful. Eric, from our side.\n\nI want to ask about the conversations you're having with customers behind the scenes. And how much pressure is there on the bank now to raise the rates you're paying on deposits? I imagine it's pretty tough conversations right now.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nIt is very tough. It's a situation that we've come across before, but not as intensive. So what we've done is we split it up between senior management, talking to various clients. You have to understand that our margin, we don't have retail.\n\nSo we're going to have -- they're very sophisticated clients. And then the severity and the frequency of these increases have opened up those that are not as sophisticated, but they have great businesses going on. And that's what's made it tough, the number of basis points being 75 and the frequency up. But we've been handling it OK.\n\nI feel pretty good about it. Maybe we always said we could pay more because we don't have all the expenses associated with retail. So I'm not to get on my solo about this -- but I truly feel that we're not giving enough credit. Everyone is looking at the margin, and we say that the cost to bring on a client is not included in the margin, excluded in expenses, and we have the top efficiency ratio in the country.\n\nSo we will pay a little bit more on the interest-bearing because they keep a lot on the noninterest-bearing, and we can afford to do that because of the efficiency ratio.\n\nSteve Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nMaybe just one final question. We all appreciate the willingness to give us where you think NIM will move next year, right? Most banks are afraid to do that here. What do you assume for the Fed though? Do you assume that we move up 150 and then the Fed pauses, just what's the backdrop that you're assuming to get that expansion. Thank you.\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nYes. We're assuming 450 and then a pause, yes.\n\nSteve Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nOK. Thanks for taking my questions.\n\nJoe DePaolo -- President and Chief Executive Officer\n\nThank you Steve.\n\nOperator\n\nOur next question comes from Chris McGratty from KBW.\n\nChris McGratty -- Keefe, Bruyette and Woods -- Analyst\n\nHey. Good morning. Eric, maybe a question on net interest income away from the margin. This quarter grew by about $25 million.\n\nCould you help just ring fence the cadence of growth in NII for the next couple of quarters?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nI mean it's a bit hard to predict, right, given all the variables there. But I certainly expect that we're going to have NII expansion, but not to the level that we saw this quarter. As you said, we had about 15 basis points of margin expansion. We think that's going to drop down into like mid-single digits.\n\nSo that will moderate our NII growth a bit, Chris.\n\nChris McGratty -- Keefe, Bruyette and Woods -- Analyst\n\nGot it. OK. And then just a couple of modeling questions. Do you have the level of prepay income and also on the tax rate, I think you said 26%.\n\nBut what's putting in for the tax rate?\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nSo tax rate, we're looking at 26% to 27%. We expect to still get a lift from the solar tax credits going forward. And prepayment penalty income came in at $2.3 million. So it was down pretty meaningfully.\n\nSo it is something that we had to overcome this quarter. We probably haven't talked about that in a while. Chris, I'm happy that you raised that question. So we're down $5.4 million from the prior quarter.\n\nAnd we think that that's going to really stay at these lower levels, right? People don't have much of an incentive to prepay right now. So that is something that we had to overcome a little bit, but there's not much more to overcome, right? So we're at a pretty low level at $2.3 million is really -- I'm just looking at my schedule now, the lowest we've been since like 2019.\n\nChris McGratty -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. And then lastly, you called out in the release of the mark-to-market gain in the derivatives. Like what was that in -- I presume that won't recur? How much was it?\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nThat won't recur $2.4 million.\n\nChris McGratty -- Keefe, Bruyette and Woods -- Analyst\n\nOK. Thanks.\n\nOperator\n\nThis concludes our allotted time and today's conference call. If you'd like to listen to a replay of today's conference, please dial 800-723-0520. A webcast archive of this call can be found at www.signatureny.com. [Operator signoff]\n\nDuration: 0 minutes\n\nSusan Turkell\n\nJoe DePaolo -- President and Chief Executive Officer\n\nEric Howell -- Senior Vice President and Chief Operating Officer\n\nSteve Wyremski -- Senior Vice President, Chief Financial Officer\n\nEbrahim Poonawala -- Bank of America Merrill Lynch -- Analyst\n\nManan Gosalia -- Morgan Stanley -- Analyst\n\nCasey Haire -- Jefferies -- Analyst\n\nMark Fitzgibbon -- Piper Sandler -- Analyst\n\nMatthew Breese -- Stephens, Inc. -- Analyst\n\nJared Shaw -- Wells Fargo Securities -- Analyst\n\nDave Rochester -- Compass Point Research and Trading -- Analyst\n\nSteve Alexopoulos -- JPMorgan Chase and Company -- Analyst\n\nChris McGratty -- Keefe, Bruyette and Woods -- Analyst\n\nMore SBNY analysis\n\nAll earnings call transcripts"
}