{
  "companyName": "D-MARKET Elektronik Hizmetler ve Ticaret Anonim Sirketi",
  "companyTicker": "HEPS",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/28/d-market-elektronik-hizmetler-ve-ticaret-anonim-si/",
  "content": "D-MARKET Elektronik Hizmetler ve Ticaret Anonim Sirketi (HEPS 8.20%)\nQ2 2022 Earnings Call\nSep 28, 2022, 9:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. I am Nina, your chorus call operator. Welcome and thank you for joining the Hepsiburada conference call and live webcast to present and discuss the second quarter 2022 financial results. All participants will be in listen-only mode and the conference is being recorded.\n\nThe presentation will be followed by a question-and-answer session. [Operator instructions] At this time, I would like to turn the conference over to Ms. Helin Celikbilek, investor relations director. Ms.\n\nCelikbilek, you may now proceed.\n\nHelin Celikbilek -- Director, Investor Relations\n\nThank you, operator. Thank you for joining us today for Hepsiburada's second quarter 2022 earnings call. I'm pleased to be joined on the call today by our CEO, Murat Emirdag; and our CFO, Korhan Oz. The following discussion, including responses to your questions, reflects management's views as of today's date only.\n\nWe do not undertake any obligation to update or revise this information except as required by law. Certain statements made on today's call are forward-looking statements. Actual results may differ materially from these forward-looking statements. Please refer to today's earnings release, as well as the risk factors described in the Safe Harbor slide of today's supplemental deck, today's press release, the 6-K, our Form 20-F filed with the SEC on May 2, 2022, and other SEC filings for information about factors which could cause our results to differ materially from these forward-looking statements.\n\nAlso, we will reference certain non-IFRS measures during today's call. Please refer to the appendix of our supplemental slide deck, as well as today's earnings release for a presentation of the most directly comparable IFRS measures, as well as the relevant IFRS to non-IFRS reconciliations. To enhance this call, we have posted our supplemental slide deck on the financials page of our company's investor relations website. As a reminder, a replay of this call will be available on the investor relations website.\n\nWith that, I will hand it over to our CEO, Murat.\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nThank you, Helin. Welcome, everyone and thank you for joining us today. Before diving into the dynamics and numbers of the second quarter, let me briefly remind you of the unique ecosystem that is around beyond an e-commerce platform. We have built an ecosystem that includes an established logistics network, fast-growing financial services, cross-border operations, and key strategic assets that serve various purposes.\n\nOur diverse ecosystem has been instrumental in our solid performance in a challenging macroeconomic environment and underlines our future potential. Without further ado, let's take a closer look at the second quarter in more detail. Next slide. To provide a better understanding of the macro picture, let's take a look at some of the key indicators during the second quarter.\n\nConsumer Confidence Index was at an all-time low there with 63% in June, although it is still too early to say. There are some signs of potential recovery, with the consumer index rising to 72% in August. The annual inflation rate reached 7% to 9% by the end of June. The experienced 7%, 3%, and 5% levels in April, May, and June, respectively.\n\nAnd yet the growth rate of inflation slowed down in the second quarter compared to the first quarter. Please note that the community inflation during the past three years in Turkey surpassed 100% by the end of February and triggers the inflation economy requirement as per IFRS. So we will discuss our financial performance as per the relevant standards of IFRS, called IAS 29 in the upcoming slides. Next slide, please.\n\nIt is important to understand the impact of inflation on consumer behavior as well as the basket patterns. One of the key changes in consumer behavior is that customers tend to switch to lower segment brands in their purchase decisions. They also favor budget-friendly choices with reliable customer experience. Another important change in terms of the basket patterns is that the basket size in value does not grow at the rate of inflation.\n\nWe believe that there are several reasons for this. First, the pressure on consumer spending triggers changes in shopping decisions such as substitution for more affordable products, or partial holdback in purchase decisions for certain categories. Second, we observe that the factors including but not limited to inventory carryover and the competitive market dynamics affect the decision of others on and on the platform on to what extent the inflation impact will be reflected. Last but not least, generally speaking, the pass-through effect of inflation is usually more imminent in categories such as grocery, food, and FMCG, which are actually limited GMV within this operating environment.\n\nOur capability is ranging from 1P-3P hybrid business model to affordability solutions, and more have played a significant role in meeting these changing dynamics as we continue our order growth. Now we briefly look at our H1 performance. Next slide, please. Since we have reported on an adjusted for inflation basis, as previously reported, 69% GMV growth and 72% revenue growth, resulting in an 8.3% growth contribution margin in the first half of the year.\n\nWhen adjusted for inflation, our GMV and revenue growth in H1 2022 were 3% and 5% respectively. In the same period, the gross contribution margin was 4.3%. 29 million orders, which corresponds to 31% growth fueled by the continuous momentum in active customers, and order frequency was instrumental in our H1 performance. Now let's have a look at the second quarter's performance in more detail.\n\nIn the second quarter on an unadjusted for inflation basis, we had 57% GMV growth and 63% revenue growth. When adjusted for inflation, our GMV revenue declined by 10% and 6% respectively compared to the second quarter of last year. While we continue to deliver solid order growth at 8% year-on-year basis in Q2, the revenue declined in 1P and 3P operations during this period, but mainly due to the limited pass-through effect of inflation on our average order value. The gross contribution margin was 5% in Q2 with a 2.8 percentage point decline compared to the same quarter of last year.\n\nBut we did a 1.7 percentage point improvement compared to the first quarter of 2022. We believe this quarter-on-quarter improvement underpins the progress in our path to profitability efforts. Our CFO, Korhan will touch upon the underlying reasons in more detail soon. Another key highlight in Q2 2022, is the fact that we had a positive free cash flow of 185 million Turkish Lira.\n\nLet's move on to the next slide to look into our operational metrics. We are glad to see that our four growth drivers continue their healthy rise on a yearly basis. Our active customer base grew by 18%, up to 11.7 million, while frequency grew by 23%, up to 5.2 on a year-on-year basis. This has been achieved with lower marketing spending and higher marketing efficiency.\n\nOur active merchant base increased to nearly 89,000 this quarter. Our comprehensive merchant value proposition and our progress in enhancing merchant experience contributed to the historic increase. This has contributed to strengthening our product offering, where the number of SKUs more than doubled to 130 million as of June 30, 2022. Last but not least, we maintain our leadership in impact in this sector.\n\nThanks to our excellent customer experience on the back of our technology, logistics capabilities, and our wide range of affordability solutions. While we are pleased to see our leadership in NPS, we continue to innovate for customers with breakthrough technology, solutions, and services. Let me now share two recent examples on the next slide. For the second quarter, we achieved two important milestones in line with our customer-centric approach.\n\nIn July, the amount of first in the market by introducing Turkiye's first new generation smart physical store, Hepsiburada SmartStore solidified our leadership in this innovation. In Hepsiburada SmartStore, all shopping-related transactions are carried out using artificial intelligence, image processing, and digital weight sensor technologies for an easy and convenient shopping experience. Second, we launched our paid subscription service Hepsiburada Premium replacing our early Loyalty Club. Hepsiburada Premium subscribers have access to a range of benefits.\n\nWe are glad to see the promising customer interest in this program as the number of members has exceeded 200,000 by mid-September. Now, I would like to switch gears and give an update on our nationwide logistics network, which is an essential enabler for our customer and merchant value propositions. Our last-mile delivery service has to serve through a nationwide logistics footprint and delivered 57% of our orders from the marketplace operations. Regarding the next-day delivery performance, HepsiJet delivered 83% of the orders on the next day in the second quarter.\n\nThis HepsiJet XL, HepsiJet delivery of oversize items continues this fast penetration. HepsiJet XL carried around 75% of oversize items in our 1P operations. We are proud to have registered a new patent for HepsiJet Multi-Vehicle route optimization technology unlocking further efficiencies in our operations. On the fulfillment as a service, HepsiLojistik continues to scale its operations by adding 183 clients to its portfolio during the quarter, providing fulfillment services to 513 clients in total.\n\nOn the next slide, let's take a deeper dive into our progress with respect to other strategic assets serving our customers as well as our merchants. Our advertising solutions under HepsiAd were used by more than 10,000 merchants in Q2 2022. HepsiAd has an expansion of portfolio services to include sponsored ads as of most recently. While the inbound on of HepsiGlobal continues to expand our selection to some 4.4 million, our cross-border outbound operations in Azerbaijan have gone live since the first quarter.\n\nOur primary focus in Azerbaijan has remained on advancing user experience and expanding our assortment during the second quarter. Our online grocery business HepsiExpress, which has been rebranded as the Hepsiburada Market continues to expand its ecosystem throughout the quarter to reach 105 retailers. Hepsiburada Market's perfect order ratio performance was 79% in the second quarter, up by 5 percentage points compared to the first quarter of 2022. Our flight ticket service Hepsiburada Seyahat enables sales of roughly 37,000 tickets in Q2 from 27,000 a quarter ago.\n\nIn short, we will continue to diligently operate our strategic asset to help fuel further monetization and incremental growth for the overall ecosystem by consistently improving cost-effective business models. On the next slide, I would like to give an update on our financial services. Within our long-term strategy of becoming a leading fintech player across online and offline channels in Turkey, we are determined to continue to expand our payments and affordability solutions. Marking its first year of launch HepsiPay Wallet reached 8 million users as of the end of June, around 39% of GMV passed through the wallet.\n\nLaunch in early Q1 2022, our Buy Now Pay Later solution is embedded with HepsiPay Payment Gateway and is currently available for purchases from our direct sale operations. Using Buy Now Pay Later approximately 500,000 customers will issue their shopping limit and over 100,000 of those customers use their limit as of the end of August 2022. Regarding your solutions like Buy Now Pay Later, we continue to diligently manage to create a business while maintaining our focus on growth optimization. Before I leave the floor to Korhan, let me say a few words on our guidance for the full year.\n\nPlease note that as a time of transition to inflation accounting, to provide more context on the comparability, refer to our guidance for GMV growth and EBITDA as a percentage of GMV on an unadjusted for inflation basis. First, based on our half-year performance, we are raising our GMV growth guidance from around 50% to around 60% for the full year, 2022 compared to 2021. Second, while we continue to have the liquidity to fund our operations to help provide additional visibility on this year's performance, we will begin providing guidance for our full year EBITDA in 2022. Accordingly, we expect to deliver EBITDA as a percentage of GMV within the range of negative 2.5% to negative 3%, which was around negative 6.5% last year.\n\nWith this, I now hand it over to our CFO, Korhan, to give more color to our financial performance. Thank you all for listening.\n\nKorhan Oz -- Chief Financial Officer\n\nThank you, Murat, and welcome everyone. As already mentioned inflation accounting, in other words, the implementation of IAS 29 standards has become mandatory for all IFRS reporting companies in Turkey. Starting from this quarter onwards. Murat has mentioned the key financial highlights for both the inflation-adjusted figures as well as the unadjusted months to ease the understanding of restated financials.  On this slide, I would like to give an overview of the inflation accounting required and how its implementation impacts our financials.\n\nIn IAS 29 requires, our comparative financial statements are presented in terms of the measuring units current as of June 30, 2022. For restatement, the monthly Price Index published by the Turkish Statistical Institute is used which is disclosed in our press release. Monetary items are not restated, while non-monetary items are restated from the date of acquisition. In addition, we indexed all our reported non-IFRS measures such as GMV and EBITDA.\n\nAs shown on this slide, the gross contribution margin from the sale of any initiative item could turn from a positive 3% down to a negative 1.5% when restated as per IAS 29. Only if that good is purchased and sold within the same calendar month then this transaction has no impact on the gross contribution margin under the implementation of IAS 29. I will elaborate more on this front in the upcoming slides. In Q2 on an unadjusted for inflation basis, we generated TRY 9.2 billion GMV corresponding to a 57% year-on-year growth.\n\nAdjusted for inflation, the GMV became TRY 9.6 billion with a 10% decline compared to Q2 of last year. Let me briefly address why there is some level of decline on a year-on-year basis this quarter. GMV is a function of the growth in the number of orders and average order value. We recorded continued order growth during the second quarter at 8% compared to a year to a year ago.\n\nThis order growth came through the growth in the number of customers and the continued rise in order frequency. Meanwhile, the growth in average order value, while lower than the level of inflation in the second quarter. Actually, in our business model, for the reasons, Murat has already mentioned average order value and inflation rate are not fully correlated due to the limited part three impact of inflation. On the next slide, I would like to discuss our revenue performance.\n\nOn an adjusted-for-inflation basis, our revenue grew by 63% in Q2 2022 compared to the second quarter of last year. The 6% revenue decline on an adjusted for inflation basis was mainly due to a decline in revenue from 1P and 3P with similar underlying reasons discussed in GMV growth dynamics. Additionally, the decline in delivery service revenue was mainly due to a decrease in the number of parcels delivered as well as the limited pass-through effect of inflation on unit delivery service charges. Meanwhile, other revenue, which mainly consists HepsiJet and HepsiLojistik revenue streams, grew by approximately 54%.\n\nNow I would like to discuss our growth contribution performance in the next slide. Our inflation-adjusted gross contribution margin was 5% in the second quarter of 2022 and 8.3% unadjusted for inflation. This difference was mainly driven by higher inflation adjustments to the cost of goods sold. Securing [Inaudible] became critical in order to ensure product availability, particularly in electronic goods in the inflationary environment.\n\nAs a result, we secured a high level of inventory and had higher immensely turnover days in Q2, where the average order value growth was realized below the inflation rate for the reasons explained previously, resulting in a 3.3 percentage point decline in inflation-adjusted gross contribution margin. Now, I would like to provide insight regarding on year on year comparison. On an inflation-adjusted basis, the gross contribution margin in Q2 declined 2.8 percentage points compared to the second quarter of last year, mainly due to a decline in revenue, a relatively higher monthly inflation rate, and comparatively higher demand to date. On the other hand, compared to the first quarter of 2022, our gross contribution margin improved by 1.3 percentage points in the second quarter.\n\nWithin the context of a slowdown in the monthly inflation rate and with our increased focus on better inventory management, this performance is an indication of our focus on the path to profitability. Next slide, please. Our inflation-adjusted net operating expenses as a percentage of GMV were at 11.1% in this quarter, improved from 11.6% a year ago, and 12% in the first quarter of 2022. A 0.5 percentage point improvement in net operating expenses as a percentage of GMV this quarter was mainly attributable to a 1.3 percentage point decline in advertising expenses and a 1.1 percentage point decrease in shipping and packaging expenses against a 1.9 percentage point rise in G&A expenses.\n\nThe decline in advertising expenses was a result of saving achieved by enhanced marketing efficiency, including a sharpened focus on retention and engagement across the customer lifecycle, as well as enhanced return on marketing investment in relevant channels while remaining competitive. The decrease in shipping and packing expenses was on the back of a decline in the number of parcels delivered and the limited part three effects of inflation on unit delivery service charges. The rise in our SG&A expenses is a result of several factors, including the annual salary rise and incremental talent onboarding, including organizational development for strategic assets. Let's move to the EBITDA margin bridge on the next slide.\n\nOn an adjusted for inflation basis, EBITDA as a percentage of GMV improved by 0.5 percentage points compared to the second quarter of last year and 1 percentage point compared to the first quarter of 2022. In line with our focus on the path to profitability. On an adjusted for inflation basis while the EBITDA as a percentage of GMV declined 2.4 percentage points compared to the second quarter of last year, we observed encouraging quarter-on-quarter progress to a 2.1 percentage point improvement. The 2.1 percentage point improvement from the previous quarter was mainly attributable to the improvement in our gross contribution margin as well as operating expenses.\n\nWhile a 2.4 percentage point decline in the year comparison was driven by the decline in gross contribution margin and higher G&A expenses, which I have already mentioned ago. Next, I would like to say a few words on our cash flow dynamics. We generated a positive free cash flow of TRY 185 million in the second quarter at TRY 2 billion up from a negative TRY 1.8 billion in the first quarter. Thanks to the positive cash generation from our operating activities, the TRY 397 million.\n\nLet me briefly walk you through the reasons behind the free cash flow dynamics from the year-on-year and quarter-on-quarter perspectives from the year-on-year perspective. I would like to shed some light on the operating cash flow in the first place. The key difference between the two periods was the inflationary environment that required access to share for continued product availability. Therefore, we secured higher-level inventory and when necessary, we used either advances or shorter payment terms.\n\nCoupled with TRY 212 million capex, we were able to achieve a positive free cash flow of TRY 187 million in Q2 2022. However, the amount of cash generated was lower than the last year due to the continued inventory purchase to secure product availability in the inflationary environment. From the quarter-on-quarter perspective. I would like to remind you of the reason behind the negative operating cash performance in the first quarter of 2022.\n\nGenerally, we purchased a high level of inventory during Q4 each year due to the peak shopping season in Turkey. Usually the payments all part of such inventory purchases as well as of other service payables fall into the first quarter of the following calendar year. As a result, given that the capex was included, we were able to achieve an improvement of TRY 2 billion in free cash flow from previous quarters. Next slide, please.\n\nOur continued progress toward our active profitability includes both our monetization and efficiency efforts. In terms of monetization, we are focused on gross contribution margin and strengthen our selection in nanoelectronics, where profitability is relatively high. With affordability solutions becoming more relevant for consumers. We continue to expand our affordability solutions and services of monetization of fintech services.\n\nIn order to support the growth of our ecosystem and monetize strategic assets, we expanded our ad services with new capabilities as well as skillful human services consistency. With our new loyalty program, we aim to gain more value from our customers in terms of disciplined cost management and operational excellence. We set some efficiency measures on marketing, spending, and executing consistently with analysis on retention and engagement in the customer lifecycle and segment-based acquisition. We also maintain discipline in G&A ensuring efficiencies in the organization, process, and systems.\n\nOptimization in unit economics, our strategic assets, and percentage route in last-mile delivery also, will help unlock further efficiency. Moreover, we control our cash position with a focus on better inventory management and effective capex prioritization. As we deliver on these additional priorities and focus on our business in cash and cost management approach, we take more tangible steps toward our ad to profitability. Next slide, please.\n\nAs I end my presentation, I would like to leave you with a few highlights on our quarter-on-quarter momentum. Overall, our second quarter results on an inflation-adjusted basis showed improvement on several lines, including growth contribution margin, advertising expenses, and enhanced EBITDA when compared to the first quarter of this year. This progress is achieved in the macroeconomic environment with continued challenges. Looking at acknowledging the challenges and uncertainties, we are confident to increase our GMV growth guidance from 50% to around 60% on an adjusted-for-inflation basis.\n\nTo provide further visibility on our path to profitability, we would like to share an EBITDA guidance for the full year, which we expect to enter the range between negative 2.5% to negative 3% on an adjusted for inflation basis. We believe we are on track with our path to profitability and continue to execute disciplined cash and cost management. With this, I end our presentation. Thank you for listening.\n\nOperator, please, open the floor for questions.\n\nOperator\n\nThank you. [Operator instructions] The first question, he's from the line of Tiron Cesar with Bank of America. Please, go ahead.\n\nTiron Cesar -- Bank of America Merrill Lynch -- Analyst\n\nHi, good afternoon, or good morning, everyone. Thanks for the call and the opportunity to ask questions. I have two questions if that's OK. The first one relates to the free cash flow that you're showing and obviously improving on a sequential basis.\n\nBut if we compare it to this is a business, which has obviously high seasonality in working capital. Also, if we compared free cash flow to Q2 2021, actually there was quite, quite a significant decrease. Can you please talk about it? And also, I think in the past you used to mention in some of your releases that you don't intend to -- or don't need to raise capital in the next 18 months. Does this statement still stand? Thank you so much.\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nSure. Thank you, Cesar, for the question. And please note that in Turkish online retail, we have a strong seasonality with highs and lows, such as legend did in November in the last quarter. Accordingly, the seasonality affects our Q4 historically, and it triggers negative operating cash flow in Q1 for the reasons, as I explained during my presentation.\n\nWe buy during Q4 and some part of those payments fall in Q1 and we generate negative operating cash. Also, we have a 1P-3P hybrid business model that 1P gives us a unique competitive advantage with operational flexibility in the market. And on the other hand, our inventory management is an integral part of our market operations and has a direct impact on our cash performance depending on the amount of inventory purchase, the inventory turnover day, the speed of inventory turnover days, and the payment terms to suppliers, whether those are increasing or decreasing. In light of these factors, we continue to seek ways to improve our cash flow performance so that we eventually turn into a positive operational cash-generating model for the full year.\n\nFor these 18 months questions, let me first clarify that our plan not to raise capital remains relevant. We believe that we have the liquidity to fund our operations. We have previously provided a 10-month window on our liquidity position to provide visibility under a very volatile environment, including foreign exchange fluctuations, raising inflation, as well as challenges in the regulatory framework. But now we have a further understanding of this environment, and those two factors, and we are ready to provide deeper visibility on the profitability by introducing our EBITDA guidance.\n\nSo we expect to improve our EBITDA performance from a negative 6.5% last year to a range of negative 2.5% to 3% this year on an adjusted basis. I hope this is OK on your side, Cesar.\n\nTiron Cesar -- Bank of America Merrill Lynch -- Analyst\n\nYes. Thank you so much. That was very helpful. Thank you.\n\nOperator\n\nThe next question comes from the line of Holbrook Luke with Morgan Stanley. Please, go ahead.\n\nHolbrook Luke -- Morgan Stanley -- Analyst\n\nYeah. Thanks for giving me the opportunity to ask the questions. Just my first. I'm sorry if we're rehashing what you said on record on Slide 22.\n\nYou've got the minus 6.2% EBITDA as a percent of GMV adjusted, and then you've got it 2.7% unadjusted. Can you just kind of go through a bridge a little bit in the downturn between the two? And what would your current EBITDA guidance be on an adjusted basis for the full year? Thanks.\n\nKorhan Oz -- Chief Financial Officer\n\nWell, unfortunately, we were not in a position to give an adjusted basis in EBITDA guidance for the year-end because there are various factors affecting our inflation accounting. Even today we don't know what the inflation is going to be by the year-end and there are so many factors that we have to take into consideration by calculating the inflation-adjusted figures and considering about 6.2% versus 2.7%. This is a kind of technical calculation on our side. Once we buy the inventories, we multiply those inventories with an index until the date of sales.\n\nThis increases the cost of goods sold significantly in line with the inflation versus the sales realized in the respective months. So on an adjusted basis, we are, as Murat mentioned, we were not able to increase our average order values in line with the inflation though. So the sales prices did not increase in line with the cost of goods sold increases that resulted in a decrease in the cost of goods sold and consequently their gross contribution margin. One of the main effects of this is the age of the inventory.\n\nIf you buy and sell the inventories within the same calendar month, there is no impact. However, if you buy a certain amount of inventories and sell in the following month, then the inflation accounting reduces your gross contribution margin. That is the main reason for this difference.\n\nHolbrook Luke -- Morgan Stanley -- Analyst\n\nOK. That's clear. And just a second question is on your GMV guidance for the full year, I guess it would imply in real terms kind of 10% decline year on year at the 60% on the mark and I think you've seen order growth slow to up 8% in the last quarter. So just trying to get a handle on that, are these competitive dynamics? Is this a macro situation, and what are you seeing from your side?\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nLet me take this question. Luke, it's Murat speaking. All right. So I guess the first thing to remember, maybe we are operating in an inflationary environment and we are remaining focused on our execution.\n\nAnd according to our plan, by applying disciplined constant cash management within our path to profitability, it is important to remind everyone. And within that context, when you refer to starting with the orders first. When you look at the order growth, which is resilience against all these challenges in the market. Actually has a couple of drivers behind it.\n\nLet me remind you of some of those which I think you have understood our current order growth platform. One issue is to mention the first and then external factor, which is, of course, the macroeconomic environment. So there is definitely a continuing pressure on consumer spending in the economic environment, and this affects consumer behaviors. So consumers in terms of their behavior, we observe, tend to shift toward more affordable products.\n\nAnd also, we observe, they are implying a potential holdback on certain categories. That is actually, one of and major consumer behavior aspects of it. If you look at our internal drivers, maybe we want to mention, worth mentioning is the fact that within our disciplined constant cash management, we are, and we have been optimizing our service model for Hepsiburada Market, previously known HepsiExpress, as you remember. And in that sense, those optimizations should also result in the impact on the contribution to order numbers from Hepsiburada Market to overall order numbers.\n\nBut again, it was a conscious choice that we've been applying to optimize the business model disciplined cash and cost management, and of course, ensuring a better customer experience, which you also saw in the results, with an improved perfect order ratio. The other one from our internal drivers, worth mentioning actually the fact that we've been also optimizing constantly our marketing execution and our focus on customer lifecycle management, which means you will see, and you are seeing you've already been actually emphasizing our focus on retention and engagement. And also in the meantime, with respect to the acquisition, we go very segment specific such as Women and Youth [Inaudible], the youth segment, etc. So we really try to make sure under this environment where the cost of marketing initiatives is especially high, we should be also very efficient in terms of marketing channels, which eventually, of course, affect those numbers which I describe.\n\nLet me now switch the gears to GMV, because you also referred in your question to GMV growth versus inflation, not as I clarify, they do partially on the other side. Let me take the next side of the GMV and dynamic. The GMV actually, if you look at the numbers in revenue and GMV, with respect, I just digested, I guess one of the key drivers, maybe the major driver is the gap between the AOV average order value and the inflation rate. This is important to underline for everyone because, in our business model, our AOV and the inflation rate are not fully correlated.\n\nThere are some reasons for it, but let me summarize very quick the key of key reasons for that. One issue is definitely as discussed, the consumer spending is pressure on that and they have been changing their behavior, which triggers this shift toward the affordable products as well as partial hold back on certain categories. So that is one, which is much more about consumer behavior. The other issue is much more about the observation we have with respect to sellers.\n\nSellers are also actually getting affected by these dynamics because they cannot be clear about how much they can reflect on their business in terms of the inflation impact. So, therefore, to what extent to imply that impact is actually affected by the inventory carryover, as well as competitive dynamics on the status side? So that is another actual factor we also observed. The final one, last but not least, also, it's I guess, very similar to other markets as well, the pass-through effect of inflation is usually more imminent in categories such as grocery, food, or FMCG. And as these are actually a very limited portion of our GMV.\n\nSo at a high level and that is why we see and we observe the AOV and inflation rate in our business model at least are not fully correlated. But with that said, as a side note maybe, your hypothesis could be, assuming the inflation global slowdown down over the years, over time, the lag between selling prices and inflation might narrow down over time. But again these hypotheses at this point we get to see, observe and monitor. And maybe also I can put some -- shed some light on the current trading as well, and maybe not if they are speaking about these dynamics generating high value.\n\nAs you know, we've been operating in the current period, I mean, we continue to focus on our execution and we continue to surprise and delight our customers and merchants with our experience and innovation. And also based on the initial feedback so far from our customers and merchants, we believe our diligent execution seems to resonate with them at this point. And also we observe the initial positive feedback hopefully will also be reflected on the growth drivers of our business, including active customers frequency, active merchants, and selection expansion, as well as hopefully on the GMV side. That's I think what we can share based on the initial impressions we have as of this quarter.\n\nLet me stop here. Hopefully, I was able to address some of your questions, Luke. Thank you.\n\nHolbrook Luke -- Morgan Stanley -- Analyst\n\nYeah. Perfect. Thank you very much. That was all.\n\nOperator\n\nThe next question comes from the line of Ms. Kilickiran Hanzade with J.P. Morgan. Please go ahead.\n\nKilickiran Hanzade -- JPMorgan Chase and Company -- Analyst\n\nThank you very much. I have two questions. The first question is about free delivery. So what was the share of free delivery in total orders? I mean, so far year to date? And compared to 2021, how has this changed? And you are quite excited about this Hepsiburada Premium and I wonder how much are you charging for the loyalty fee here? And the second question is about the GMV guidance.\n\nWhat is the average inflation have you considered GMV guidance and can you provide a bit more detail on the guidance for the quarter for the third quarter and the fourth quarter? And the final question is about the delivery cost and pass on the cost inflation in the last mile on the 3P. So how quickly are you able to pass the cost inflation in the last mile? And I couldn't really understand this decline in shipping expenses, which was around 35% in real terms, very substantial, but you didn't lose any orders according to your key KPIs. So can you please elaborate a little bit more? Thank you.\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nThank you, Hanzade. Actually, maybe it's because it's very related to the previous question of Luke. But let me start with the question in more detail on guidance or a few forward-looking expectations for Q3 and Q4. And I hand it over to actually to Korhan.\n\nOK. Now, at this point, let me just briefly, I guess I'd really come into what is the current trading momentum at this point. And again, our initial impression looks like our execution and our focus on experience and our disciplined, diligent execution seem to have resonated well with our customers and merchants. But of course, it is still our early observation with respect to our current trading during the trading period.\n\nBut on top, I guess maybe it's also worth mentioning for next quarter because you mentioned that for the last quarter. And I guess as Korhan said, there's always a high seasonality in Turkish retail on the retail and Q4 is basically the peak season for all of us, and that's always good to remember. And historically it is the case at least provided there are no new changes or developments in the consumer or macroeconomic environment. We can expect by this period that the high seasonality will continue for the upcoming quarter.\n\nThere's a lot we can share. And I guess also on top, we can -- at least share this much, we can -- we are looking forward to the next quarter to execute our plans accordingly and because we are also actively learning from year-to-date learnings and key takeaways in this environment and we're going to definitely apply all those learnings and best practices and key takeaways to the upcoming quarters. And of course, maybe one final note before I hand over to Korhan, that kind of discipline, we have, the execution with respect to cost and cash management, and our clarity on purpose in terms of the path to profitability will be always in our minds when we execute next quarter as well. So let me just stop here and hand it over to Korhan to take the other questions.\n\nKorhan Oz -- Chief Financial Officer\n\nHanzade, on the free delivery share in total orders, I can give you this number. The out of the total GMV, around 65% to 67% of GMV pass-through for 3P and for the 3P cargo cost, those are fully covered either by the customer or by the merchant. So our market sales cargo costs are fully covered. The remaining 30% to 35% 1P cargo cost is covered partially by us and the remaining portion, if it's above the total threshold, we covered the cost, if it's below total coverage then the customer pays for it.\n\nKilickiran Hanzade -- JPMorgan Chase and Company -- Analyst\n\nAnd so what is the current charge for the Hepsi Premium membership? So that is the one -- because you still offer free delivery for all your members, right?\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nMaybe with respect to Hepsiburada Premium, let me maybe Korhan share some insights, and please get on it if you see any of that program. Basically, Hepsiburada Premium has very brand new and fresh programs as you know we introduced recently. And we, of course, are very pleased by the promising demand and initial reaction by the customers. And actually, in that Hepsiburada Premium paid subscription model, yeah, that number actually we shared here on the presentation as well almost about 200,000 subscribers.\n\nSo it's still relatively in the early phase for us. With that said, that is actually a program, which we should currently be available at TRY 9.9 per month. This is the current price, and of course, this is the current price we are referring to, which is also publicly visible. And also in that program, we have multiple benefits that we offer to our customers, which are actually not just related to cargo benefits, but also some other benefits as well, and actually, overall, our vision for this program is to become actually a key differentiation for us.\n\nI think we should also be referring to our focus on retention and engagement we believe Hepsiburada Premium will eventually play an integral role to drive further engagement and loyalty in our customer base. And actually, we can see that also by looking at the global examples and best practices as well. So this is our vision for this program. Let me actually Korhan start here.\n\nI hand it over back to you because I have not shared the --\n\nKorhan Oz -- Chief Financial Officer\n\nYeah -- turn on with Murat. On our platform, if the order is above TRY 100 then the cargo is free with the Premium launch, we decreased this TRY 25 for the Premium customers.\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nBut of course --\n\nKorhan Oz -- Chief Financial Officer\n\nThat the gap is very insignificant for the time being. Thank you.\n\nKilickiran Hanzade -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you very much. Can I please ask a final question if possible? And it's about e-commerce --\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nI am sorry please remind us if we forget to address any questions because you have multiple -- if you just put out this reminder to us.\n\nKilickiran Hanzade -- JPMorgan Chase and Company -- Analyst\n\nI am trying to understand the impact -- the positive impact of the new e-commerce law. So when do you expect to see the trans-positive sign from declining ad spending that cost by the new model now? And is it possible for you to share a rough calculation of ad spending at the post in terms of GMV in '23 as a calc? Thank you.\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nI think maybe it's fair to say first. It is way too early to assess the impact at this point as some provisions of the new regulatory framework are to get effective from next year onwards. So it's still an early phase. But I guess our initial impression and our initial review of the law make us anticipate that this build eventually, over time, might create a more favorable operating environment for all players.\n\nThe reason behind actually is the fact that the regulators actually attributed to certain design systems, which also we believe seem to resonate to deliver some standards. And the one we actually understand from the perspective, which is that they try to ensure a more transparent, healthy, and same market environment for all players, which makes sense for us. Of course, obviously, the second actually is they definitely want to prevent any monopolistic practice in the market to secure the long-term benefits of all stakeholders, including customers, SMBs, suppliers, and suppliers in general, which makes sense for us as well. And that, of course, but not least, they also want to establish and invest in a friendly market environment for both domestic and international investors with a much more transparent regulatory framework with defined rules and regulations and I think, again, that is on us makes sense.\n\nSo taking those principles, actually, we believe, in general, we anticipate a much more favorable environment -- operating environment for all the players. But again, the impact is early to assess. I guess that's what we can actually mention at this point. In terms of calculation, I mean, this is maybe early to specify a certain number, but we are actually actively working on this analysis, what those thresholds, which were introduced in the regulatory framework mean to us and moving forward in the New Year.\n\nBut again, let me remind you, this is actually a separate side note. We've been already actively operating with a very cautious improvement in marketing efficiency and spending. So we believe our unique customer experience, which is, as you know, we are the market leader in terms of MPS and also our kind of does change marketing engine, actually will become much more handy in the new rules and we are getting already ready for it.\n\nKilickiran Hanzade -- JPMorgan Chase and Company -- Analyst\n\nOK. Thanks very much.\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nThank you.\n\nOperator\n\n[Operator instructions] Ladies and gentlemen, there are no further questions at this time. I will now turn the conference over to management for any closing comments. Thank you.\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nThank you so much for your -- for all listening and actually, we are looking forward to the next quarter's earnings call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHelin Celikbilek -- Director, Investor Relations\n\nMurat Emirdag -- Chief Executive Officer, Hepsiburada\n\nKorhan Oz -- Chief Financial Officer\n\nTiron Cesar -- Bank of America Merrill Lynch -- Analyst\n\nHolbrook Luke -- Morgan Stanley -- Analyst\n\nKilickiran Hanzade -- JPMorgan Chase and Company -- Analyst\n\nMore HEPS analysis\n\nAll earnings call transcripts"
}