{
  "companyName": "Axon Enterprise",
  "companyTicker": "AXON",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/axon-enterprise-axon-q2-2022-earnings-call-transcr/",
  "content": "Axon Enterprise (AXON 0.21%)\nQ2 2022 Earnings Call\nAug 09, 2022, 5:00 p.m. ET\n\nAndrea James\n\nHello, everyone. Thank you for joining us, and welcome to our Q2 2022 earnings update. I hope you've all had a chance to read our shareholder letter. We posted that to investor.axon.com after the market closed, and the remarks that we make on today's call are meant to build upon the information that is already in that letter.\n\nDuring this call, we will discuss our business outlook and make forward-looking statements. Any forward-looking statements made today are pursuant to and within the meaning of the safe harbor provision of the Private Securities Litigation Reform Act of 1995. These comments are based on our predictions and expectations as of today and are not guarantees of future performance. All forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially.\n\nThese risks are discussed in our SEC filings. And before we go to Rick, we will open with our earnings video.[Commercial break]\n\nRick Smith -- Chief Executive Officer\n\nAwesome. All right. Well, I will launch in. Andrea, and Angel, great job, as always, on the quarterly video, that's fantastic.\n\nGreat way to share all the exciting stuff with our shareholders. OK. We're executing on what is shaping up to be a really excellent year. And our confidence in our growth extends well beyond 2022.\n\nWe emerged from the pandemic and civil unrest of 2020 in our strongest position ever. And now we're fortunate to be able to leverage that position and strength while many parts of the economy are experiencing uncertainty. We're seeing broad-based strength across our product numbers, and we're really energized by the growing number of agencies that are buying nearly everything we offer and signing up for 10-year contracts, sometimes even 12 years. It's exciting to see an agency go all in with Axon.\n\nWe set a vision several years ago that an agency wouldn't just say, well, we have a TASER device or maybe we have body cameras and Evidence.com, but would instead simply describe Axon as their technology partner. And that's starting to happen now. When agencies sign up for all of our software solutions, plus our body camera, dash camera, the TASER 7, the VR training, our drone solution and so on. Customers are increasingly demonstrating their confidence that we are the right technology partner for them for the next decade.\n\nWe made it easy for our customers to bet on us because our team delivers. Now on to some other hours. We expect profitability to improve in the back half of this year. We expect to drive increased leverage coming out of Q2, when we had some expenses that won't repeat.\n\nMore on that coming from Jim in a moment. Also, we recently launched an internal campaign called, spend it like it's yours to climb down on some low-hanging fruits such as travel expenses and swap. In fact, we created a new position of pointing a slag ZAR who must approve all purchases. Being scrappy is not new to Axon.\n\nWe're just taking it to another level of rigor. I was recently quoted in the Wall Street Journal as last week saying it's good to go on a swag detox. Not every event needs a T-shirt, and we need to balance the need to travel against what we can do over Zoom, such as maybe sending one or two key representatives to be in the room and having others join online. We're continuing, though, to hire and invest in this environment, and we're disciplined about it.\n\nOur bar for talent continues to move higher, where we have seen other technology companies slow down their hiring that presents us with opportunity. And you'll see some of that in our increased headcount spending in the second quarter. Thinking back to 2008 in that downturn, we invested in creating the cloud and body camera business, while our competitors were pulling back. The results of that decision are measured in billions of market cap.\n\nI say ages favor the adaptable, and we see times like these when the war for talent pools as an opportunity to advance our mission so will come out of far stronger and more competitive. Our commitment to generating strong cash flow and operational discipline is shared among the entire leadership team. You'll see in our shareholder letter that we've revised our expected capital expenditures this year to reflect slower pacing on our net campus investments. We're adjusting our pacing to reflect a world that is still in flux as we determine the best and highest use of the campus, optimizing for the new world of hybrid work, as well as the best and highest uses for our capital.\n\nIt's more important that we get it right than we get it fast and we are preserving optionality. Finally, I feel great about the trajectory of our C suite. Since our last call, Josh Isner was appointed COO; and Isaiah Fields an 11-year earn Axon was promoted to our chief legal officer. Also, we've made a lot of progress with our CFO search, which Josh will highlight in a little bit more detail.\n\nIn the meantime, interim CFO, Jim Zito, hasn't missed a beat. Before turning over the call to Josh, let me take a moment to share my thoughts about Josh's leadership skills. First, Josh's promotion to COO was really a natural progression for him and for Axon. Josh has been a rock star since the day he got here, and he exudes sheer confidence.\n\nHe built the revenue stream and embodies our core value to own it. For the past seven years, Josh has owned quarterly revenue delivery, where he's helped us establish an excellent track record. Josh is highly focused on delivering results and executing and exhibits excellent discernment. I'm thrilled with our partnership and our working dynamics.\n\nWe have a rigorous and healthy back and forth, and I'm very confident in his leadership during the next phase of rapid growth. And with that, now let me turn it over to Josh Isner.\n\nJosh Isner -- Chief Revenue Officer\n\nThanks a lot, Rick. I appreciate that, and it's good to see everybody. In my new role, I'm humbled by the trust our team, our customers and our shareholders have placed in me. We are working hard every day to deliver on our mission and drive exciting growth in tandem with margin expansion.\n\nHere's what that looks like in terms of where I'm investing my time and focus. First, I'm working on building a world-class team from top to bottom as opposed to focusing on simply filling the needs of today, I'm working with our leadership team to build the team we need for the next five to 10 years. We will focus on a next play mindset, versatility, mental toughness and the capability to deliver outsized outcomes as the core characteristics of our team. That starts with the search for our new CFO.\n\nWe have made a lot of progress in this area, and we are very excited about the candidates that we have attracted. We hope to have someone to announce shortly that I am personally thrilled about. As Rick said, I couldn't be happier about the partnership we've had with Jim. His steady leadership has allowed us to take our time with the search for a permanent CFO.\n\nHe has been the consummate teammate and done whatever the team has asked. I sincerely appreciate Jim's leadership. Second, I'll be driving discipline and prioritization across the business. The one thing each of us truly controls is where we focus our attention.\n\nWe have a lot of exciting opportunities to go after. And as you all know, we will unlock maximal value by focusing our efforts only in the areas where we can have the most impact and deliver the most value for our customers. That is the optimal path for shareholder value creation as well. For every opportunity we say yes to, we will say no to dozens.\n\nAnd when we do say yes, we will win. From there, our job is to block out the noise and execute. Third, I will be ensuring that we are aggressively pursuing our total addressable market opportunity. We value that at $52 billion, and it continues to grow as Axon unveils new products and unlocks new markets.\n\nWe view our channel as one of Axon's core differentiators, and we will continue to invest into new geographies and customer segments such as commercial enterprises, federal and adjacent markets. We will also be scaling our VR, drones, records and dispatch businesses. For every single one of our product lines, our best days are ahead. That includes the TASER business, which is changing the world for the better and it's just getting started internationally.\n\nI think you're going to be very pleased with what you see unfold here over the next couple of years. And finally, the entire management team is looking forward to turning on the free cash flow spigot over the next several quarters, which opens up a lot of options for us as a company. This is totally within our control, and we are implementing a plan to optimize the level of execution in this area. We can do a lot better here.\n\nWith that, I'll hand the call over to Jim.\n\nJim Zito -- Interim Chief Financial Officer\n\nThanks, Rick and Josh. Hello, everyone. It's great to see you again. We had an excellent quarter, as you can see in our shareholder letter.\n\nLet me put some context around the results and how we are thinking about our outlook. Top line momentum continued with growth of over 30%, and gross margin improved sequentially. We delivered second quarter adjusted EBITDA of $50 million, a margin of about 17.5%, largely reflecting some expenses that were unique to this quarter. Let me unpack that for you.\n\nDuring the second quarter, we spent about $1 million on Axon Accelerate our annual user conference, which has become strategically important to our sales pipeline, technology leadership and ecosystem expansion. Additionally, we committed more than $3 million in incremental midyear bonuses to employees at the senior director level and below. This was an intentional decision given the team over delivering on results in an environment where inflation was impacting their lives. We did so precisely because we had line of sight to stronger-than-expected revenue, both in the quarter and in the back half of the year, which is reflected in our updated outlook.\n\nWe are especially pleased that we could issue this bonus without affecting our projected adjusted EBITDA margin percentage for the year. The fundamental strength of our business allowed us to demonstrate our commitment both to our shareholders and to the team members who work so hard for our customers. With that context on the quarter, we are already focusing on moderating expense growth going forward to help drive adjusted EBITDA margin expansion. Our working capital needs were $23 million in the quarter, and we have already started to see some of that reverse in July, which is driving us to maintain our full year adjusted free cash flow outlook.\n\nFinally, I'd really like to highlight our commentary in the shareholder letter about our technology partner ecosystem, which was exciting to see in action this past May at Accelerate. In June, we renewed our strategic technology partnership with Microsoft Azure, who will continue to be the primary host of our software platform and cloud. This is a great partnership for us in many ways. Microsoft is a global leader in cloud technology.\n\nOf course, they need no introduction. Our customers trust Microsoft and thereby feel secure putting their data into our cloud. As part of the renewal, we extended our contract term for another six years, which gives us long-term pricing certainty and cost visibility for our Axon Cloud business. The renewal supports our software gross margin target of more than 80% and also paves the way for faster international cloud expansion without diluting this target.\n\nAnd what's also excellent about this partnership is the ability it affords us to offer pricing predictability to our own customers. So it's just a winning deal all around. We also highlighted several of our ecosystem partners in strategic investments during our Accelerate conference and in today's letter. The investments we make are driven by our long-term product strategy, which is set under the leadership of Rick, chief product officer, Jeff Kunins, and Josh.\n\nOur corporate development team led by Andrea has been a key thought partner in enabling Axon to grow into its role as the definitive technology hub for public safety. We take pride in our approach to identifying emerging market leaders in the high-value sectors that we know well, integrating their solutions with ours and combining them with the power of our direct sales channel and deep customer relationships. Importantly, the structures our corporate development team has negotiated on behalf of Axon, provide us with significant flexibility and optionality on the investments we make. The ability to obtain customer feedback experiment with product integrations and see how our teams work together, allows us to preserve optionality for our business, delight our customers and expand our technology ecosystem in a highly efficient way.\n\nAnd with that, Andrea, let's take questions.\n\nAndrea James\n\nAll right. Thanks. Here we all are in gallery. We will take our first question from Will Power at Baird.\n\nGo ahead, Will. You're up.\n\nWill Power -- Baird -- Analyst\n\nAll right. Great. Thanks, Andrea. I propose the two that maybe the next Analyst Day would be at the racetrack and we can help you test ALPR.\n\nI'd like a couple of quick questions. The cloud growth continues to be strong. Obviously, Evidence.com is a key component of that. But I'd love to unpack any of the other kind of key drivers there.\n\nWhat are you seeing with record management, any of the other kind of key pieces of the software portfolio, what does the traction of trends look like?\n\nJosh Isner -- Chief Revenue Officer\n\nYeah. Thanks for the question, Will, and nice to see you again. I'd say for us, we've talked about this a lot in the video. I mentioned our flywheel for us.\n\nThe biggest thing we can be doing quarter to quarter is driving the number of officer safety plan subscriptions up. That bundles essentially all our products outside of dispatch that we sell -- sorry, dispatch and fleet. And it provides optionality for customers to opt into records, but it provides a nice base for ARR between the license, all the software add-ons, the TASER, the virtual reality. And so for us, that's really the major focus in our state and local business is to drive as many renewals and purchases of that plan as we can.\n\nIn addition to that, I think we are seeing exciting growth in some of our newer segments, one of which is federal, another is international. And then even in newer ones like justice and corrections, we're seeing an uptick. And so I'd say all of those are combining to just provide a lot of wind in our back as we go on here and we certainly still feel like our best days are in front of us.\n\nWill Power -- Baird -- Analyst\n\nThat's great. Josh, maybe just one more for you. As you look at the international opportunity in front of you, any perspective on how the macro climate is or isn't impacting sales cycles, demand trends, etc., that's kind of the broader question. And then number two, tied to international in your prepared remarks, it sounds like you're feeling better and better about the TASER opportunity.\n\nWhat -- maybe just any other color or perspective what's driving that optimism?\n\nJosh Isner -- Chief Revenue Officer\n\nYeah, absolutely. So internationally, in general, to answer your first question, I don't think we're seeing any kind of macro impacts at this point in terms of adoption, interest, buying cycles and so forth. I think we've strongly performed in the TASER segment. We are seeing national police forces by larger order quantities of TASERs than we've seen in the past, which is really exciting.\n\nBecause when we're talking about a national police force, five, six, seven times the size of NYPD and they're starting their purchases and in the thousands, the high four digits into five-digit, thousands of units of orders, like it's very exciting because we know that we're very good at kind of the land and expand type of playbook. And so we look at these as really good indicators for the future of our TASER business, and we do -- we are working with more and more national police forces across the world. And I'd say on top of that, our execution in our Tier 1 markets, the U.K., Canada and Australia has been really strong, where we continue to see more adoption of Evidence.com and body cams, but also kind of our newer features on Evidence.com like real-time streaming and transcription. And so the next step for us internationally is going to repeat -- is going to be to repeat that same level of execution in Tier 2 and Tier 3 markets.\n\nAnd there, we've got to do a really good job of evangelizing the cloud and helping customers understand why the cloud is far, far better as a mechanism for storing and sharing digital evidence. And so we're working through that process. We'll continue to build there. But we're really excited about all the work our International team is doing, and they're really focused right now on driving the results upward.\n\nWill Power -- Baird -- Analyst\n\nThank you.\n\nAndrea James\n\nThank you. [Operator instructions] We'll take our next question from Erik Suppiger from JMP. Go ahead, Erik.\n\nErik Suppiger -- JMP Securities -- Analyst\n\nYeah. Thanks for taking the question. Good quarter here. One, I don't know if you said this, but can we assume that backlog grew from the end of Q1 to the end of Q2? Or how should we think about some of the backlog that you carried in from Q4 into Q1? And did that roll into Q2? And then secondly, any comments about supply constraints? Did that improve or where are we from a supply constrained supply chain constraint perspective?\n\nJim Zito -- Interim Chief Financial Officer\n\nI can still -- I take the first half of that. I guess, yeah, so we can disclose future contracted revenue, Erik, in the letter. So that grew to $3.3 billion. So it was up versus a little bit less than $3 billion as of the end of Q2.\n\nAnd then yeah, there's really no -- nothing -- in Q4, we had some unfulfilled demand that rolled into the first half of the year, but we're sort of back to more normalized levels, obviously quarter-to-quarter order inflows. And I guess, Josh, do you want to take the supply chain, please?\n\nJosh Isner -- Chief Revenue Officer\n\nSure Jim. And I'd just add to that, just traditionally in the back half, revenue performed stronger than the first half. So we're -- we see plenty of demand still and certainly are going to execute against that demand. In terms of supply chain, in general, our supply chain team has been one of our top-performing teams at Axon.\n\nAs you can see in other businesses, companies are getting hit hard by supply chain constraints. Our team has just done a masterful job navigating through some of those challenges. And frankly, this is one of the reasons we do keep some inventory on the shelves to get through periods like we've had over the last few quarters. And so we think at this point, things look better and better each quarter.\n\nLike we do feel that we're through the worst of it, and that will continue to be able to build the supply orders, but also start to build a little buffer there as well on our TASER and core body camera lines.\n\nErik Suppiger -- JMP Securities -- Analyst\n\nWould you care to guess as to timing when supply chain might be relatively normalized. Any thoughts where we'll be as we enter 2023.\n\nJosh Isner -- Chief Revenue Officer\n\nWell, at this point, I don't think we're guessing. We're just executing against our plan. And I think by the end of this year, we'll certainly see some buffer in the TASER 7 and AB3 or Axon Body 3 product lines. And from there, I think it will just be about optimizing the level of inventory we keep on the shelves.\n\nAnd so from an investor results perspective, I wouldn't plan on seeing any kind of abnormal activity in either product shipped or inventory backlogs.\n\nErik Suppiger -- JMP Securities -- Analyst\n\nGreat. Thank you.\n\nAndrea James\n\nThank you. Next question is Sami Badri from Credit Suisse. Go ahead, Sami.\n\nSami Badri -- Credit Suisse -- Analyst\n\nAll right, thank you. You made a reference earlier, maybe it was Rick, regarding profitability being better in the second half of 2022. And I think you just made a reference that second half revenue growth is -- at least second half revenue production is usually better than the first half. So is there a specific segment or a product that's seeing very good profitable dynamics in the second half that's kind of giving you guys that operating leverage? That's the first question.\n\nThe second question is the free cash flow guidance was reiterated and unchanged for the fiscal year '22 but it looks like there were some changes in capex. Could you kind of give us the puts and takes on that?\n\nJosh Isner -- Chief Revenue Officer\n\nSure thing. I'll talk briefly about the free cash flow element there. Remind me of your first question, Sami.\n\nSami Badri -- Credit Suisse -- Analyst\n\nProducts that are enabling better profitability in the second half of 2022.\n\nJosh Isner -- Chief Revenue Officer\n\nYup, I'll take those two, and then I'll kick it over to Rick on the campus piece as well. So in general, I think we see stronger bookings in the back half of each year, and that's really across all products. This is the end of -- sorry, Q3 is the end of the fiscal year for several major markets in the U.S. It's also the federal government's end of their fiscal year.\n\nSo a combination of budgets ending and having some money to spend. And then the new budget starting, if there's a line item for our products, it tends to be a pretty active part of the year. And so I'd say the big driver of profitability is the TASER business, and we expect exciting results there. But really across the board, we do see a lot of upside in the back half of the year.\n\nAnd in terms of free cash flow, I'd just say we've reiterated our guidance because we feel like, frankly, coming from sales, this to me is not all that different than inside sales. We've got to get in touch with customers, have a process we follow, have well-trained people on the phone, get commitments, follow up on those commitments and then just get to the point of real predictability there. And I think Jim and I are partnering together there, and we've just brought in a new AR leader, I'm personally investing time with our accounts receivable team to build a playbook here where we can really measure efficiency and productivity. But this -- again, this one is really within our control.\n\nAnd when we couple that like you mentioned, Sami, with a better EBITDA, both dollars and margins in the back half of the year, there's a lot of opportunity to improve free cash flow in the back half, and we're really focused on it, and that's what we're going to do. And so I'll kick it over to Rick to talk about the new campus.\n\nRick Smith -- Chief Executive Officer\n\nYeah. Thanks, Josh. So earlier this year, we projected an accelerating spend on the new campus. We've -- now we're basically telling you we're going to slow that down.\n\nWe're pacing it out a bit. There have been a number of things. I'd say one of them is just the inflationary environment. What we've seen as we were getting ready to really move forward with more of the significant build-out on the campus, construction costs are just up pretty dramatically.\n\nAnd when we couple that with, we've also seen COVID resurging, I think, even more than people had expected. And we looked at the whole return to work dynamic, we've come to accept that the future is going to be hybrid work. And so we also see opportunity to really look at what is the best use of the overall land, really optimizing for collaborative events, customer-centric events, of course, the land that we need and the space we need for manufacturing and warehousing and all that. But maybe shifting the balance away from the idea of people coming into the office so much and really more the hybrid work environment.\n\nAnd then in this environment as well, like there's a lot going on, and we just wanted to preserve some optionality of our cash. So we basically -- let's slow down a little bit, let's really kind of recalibrate and see what the post-COVID world looks like. And took the building cost cool off a little bit, and now give us a little time to just keep tuning and refining. The world is in a pretty constant state of flux and we'd rather take our time to make sure we get it right.\n\nSami Badri -- Credit Suisse -- Analyst\n\nGot it. Thank you.\n\nAndrea James\n\nAll right. Next up, Keith Housum with Northcoast. Go ahead, Keith.\n\nJosh Isner -- Chief Revenue Officer\n\nHey, Keith, it looks like you're on mute.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nThanks, guys. Appreciate it. Looking at the TASER gross margins and your commentary regarding improvement in the second half of the year, I mean, previously, I think the manufacturing automation was going to happen when you're going to build the campus, but it sounds like things are changing. Perhaps touch on what your plans are for the second half of the year of improving the automation in the manufacturing process.\n\nJim Zito -- Interim Chief Financial Officer\n\nYeah. I would say that's not fully dependent on the campus headquarters. We're already starting to sort of build out that automation. I think part of what we're seeing in the first half was really pressure in terms of growing into our expanded manufacturing footprint.\n\nSo we've been investing to sort of build out the footprint and capacity to build. And I think as we grow into those build plans, I think we'll see better overhead absorption in there. And I think that's not contingent upon the new building.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nGotcha. And then the professional services part that hurt the software and sensor gross margins. Was that in advance of the CAD and the systems you're putting in? Or where was that spending being done?\n\nJim Zito -- Interim Chief Financial Officer\n\nI think it covers CAD, RMS are sort of the software pieces, but there's a heavy fleet portion as well. So fleet -- there was a big uptick in terms of fleet install. So all those things together lead to sort of that PSO revenue becoming a slightly bigger portion of the cloud revenue, but that's sort of enabling sort of that high-margin software cloud revenue growth as well. So it's sort of set the groundwork for future growth.\n\nBut I think PSO is an important part of us controlling that customer experience and really getting sticky customers.\n\nKeith Housum -- Northcoast Research -- Analyst\n\nOK. All right. Thanks, Jim. Apprceciate it.\n\nAndrea James\n\nAll right. Awesome. Thank you so much. Next question from Jonathan Ho at William Blair.\n\nGo ahead, Jonathan.\n\nJonathan Ho -- William Blair -- Analyst\n\nHi, good afternoon. I just wanted to understand, first of all, with your headcount increases, can you talk a little bit about where you're making sort of those incremental hires? And what sort of changed for you to want to make those hires now? I think you referenced a better hiring environment, but just curious in terms of your thinking.\n\nJosh Isner -- Chief Revenue Officer\n\nYeah, absolutely. I think, look, the last couple of years, we've hired very, very aggressively across all segments of the business. And now -- we're starting in a lot of places to grow into that size and not need to hire as aggressively. But the one major exception to that is in product.\n\nI think from our perspective, we have a lot of great ideas, and we limit those -- what we do based on where we think we have the most upside and also the size of our team and what our team can take on. And so for us, as long as there's talented engineers, product managers on the market that can help us deliver product faster and build products that we feel can really change our outcomes in public safety we're going to keep investing there. And so I think going into next year, the mindset is going to be -- get a little leaner in terms of our hiring plans in SG&A and continue to be aggressive where we can in R&D.\n\nJonathan Ho -- William Blair -- Analyst\n\nGot it. And then just as a follow-up, when we think about some of the cost savings initiatives that you referenced, either on the T&E side or other areas. Can you talk a little bit about maybe philosophically, where you're seeing that opportunity, the spend as if it's your own, I know I'm not saying that right, but that campaign -- yeah, I just want to understand, like do you feel like there was maybe lack of oversight there in the past? Or is this a situation where you're just trying to tighten the belt a little bit. Thank you.\n\nJosh Isner -- Chief Revenue Officer\n\nI think it's -- I'm not sure it's a lack of oversight. I think certainly, we've got very good controls and process in place to measure expenses. But I think at times, we've gotten just a little bit bloated in how we think about things from the number of people that attend meetings with customers like Rick mentioned, or Swag is another obvious one where we have -- and maybe the absence of being in the office, we've used Swag as a way to kind of connect with our employees. And so I think there's just opportunities to get a little more efficient in those places.\n\nIt's not necessarily an indictment of anyone or anything we've done in the past. It's just more like the landscape has changed a little bit. We see all this exciting revenue growth well into the future. And it's just a matter of getting leverage out of that growth where we can without impacting our employee sentiment at Axon.\n\nAnd I think we can read that needle very effectively.\n\nRick Smith -- Chief Executive Officer\n\nYeah. Let me jump in and add it as well. Like a business like any community can't sort of have all messages all resonate all at the same time. And so you go through cycles, several years ago, we had a scrappy year where -- that was an opportunity for us to lead and say, OK, this is the year we want people to really like it's very similar what we did we spend it like pictures, like old betray was, hey, we want to focus in on finding ways to more efficiently get things done and where more people are being scrappy and not throwing a body at every problem.\n\nWe've had a fair number of new employees come in. And certainly, we have our standard expense controls and training, but we felt with what's happening, look, the overall market is down, inflation is up other companies are, I'd say, more aggressively cutting back their investment plans. We saw this as an opportunity to communicate with our employees say, hey, spend it like it's ours, right? Like this is a moment, let's take what's going outside, everyone has things in your control where you cut back spending. And by doing that, we'll all be rewarded.\n\nThe market is rewarding companies that have more financial rigor, and we can also reward you by investing and not having to pull back on our investment plans and the exciting things we want to go build. But we can't just be toned up and continue as if the macro environment hasn't shifted. So I think this was a balanced way for us to connect with -- maybe even some of the angst our employees are feeling about the macro environment, like, hey, here's something you can do really buckle down on expenses so we can continue to invest over here because we know these are the times those investments really pay off. Our hiring has accelerated, and I think a big part of that is it's the macro environment.\n\nWe don't have as many competitors. We're having more success recruiting because we're just not competing with as many other tech companies that are as aggressive right now. And so these are the times we want to lean in and accelerate our growth. So I hope that gives a little bit of context as to how we felt we could position us with the company employees to really get them all rolling in the same direction.\n\nJim Zito -- Interim Chief Financial Officer\n\nThe only fact one thing I'd probably add to that too is just like overall travel costs, as like everybody is seeing, also went up sort of at the same time as we sort of dealt with that sort of pent up post pandemic demand. And I think as Rick said, we adjust to sort of how the best way to operate in the most efficient ways from a travel and hybrid perspective going forward. I think we'll thread the needle a little bit better in terms of meeting that. And I think everybody's plays are focused on that.\n\nJonathan Ho -- William Blair -- Analyst\n\nThanks.\n\nAndrea James\n\nAll right. Awesome. Josh Reilly at Needham, you're up next.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nAll right. Thanks, Andrea, for the questions. So TASER revenues, obviously, were very strong in the quarter, quite a bit above what we were modeling. You touched on this a bit, but how much of the back orders you expected at the end of last year to be complete? I think you had mentioned previously by the first half or now through, I think you mentioned it was like $30 million.\n\nAnd then can you remind us if there's any seasonality to TASER shipments and if that could affect Q3 or Q4 TASER revenue just so we have an idea sequentially.\n\nJosh Isner -- Chief Revenue Officer\n\nYeah, absolutely, Josh. Thanks for the question. So I'd say it's fair to say we're caught up on the TASER shipments from Q4 last year, and we've shipped those over Q1 and Q2. And because sequentially, TASER shipments go up in the back half of the year that we still feel like Q3 and Q4 will be the highlights of the year revenue-wise.\n\nAnd so I think that's kind of the story. Q4 tends to be a little more -- a little higher than Q3, but over the years, we've seen the inverters of that as well. But as a back half, we certainly have a lot of confidence that will outpace the first half of this year in revenue.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nGot it. That's super helpful. And then on the Axon Fleet units, those increased nicely as well quarter over quarter. Should we assume that all of those are Fleet 3 at this point? Or are you still shipping any Fleet 2? And then how should we think about the level of supply constraint versus demand from that product?\n\nJosh Isner -- Chief Revenue Officer\n\nYeah. In terms of the mix of fleet, there's still a little bit of Fleet 2, but mainly Fleet 3 and of course, a lot of body camera shipments going out. Supply chain constraints, I'd say, we have plenty of supply to deliver on our guidance in the back half of the year. Product by product, when we get outside of the core TASER and body camera products, there's a little bit of flux month-to-month there.\n\nBut in a macro sense, we are feeling great about where we stand from an inventory perspective.\n\nJosh Reilly -- Needham and Company -- Analyst\n\nAwesome. Thanks, guys.\n\nAndrea James\n\nAll right. Jeremy Hamblin from Craig-Hallum. Go ahead, Jeremy.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nThanks for the questions. Congrats on the strong momentum in the business. So federal contract's clearly a pretty key segment right now, really a big driver of the business, a ton of momentum there. I wanted to get a sense for whereas we've seen executive order mandating federal agencies to use body cams.\n\nI wanted to get a sense for what you're seeing internationally in terms of that type of mandate, that type of adoption typically, there's been a decent lag period between instituting that type of policy. But there have been significant incidents, both in English-speaking world, as well as other places with surprises incidents. Japan comes to mind, where we wanted to get a sense for what the pulse is of other government agencies around the globe.\n\nJosh Isner -- Chief Revenue Officer\n\nYeah. I think it's a good question, Jeremy. And as you'd expect, it varies a little bit. I can say just like the United States, Canada, Australia and the U.K.\n\nwere relatively early adopters of body cams. So even if a mandate were to come down at this point, I think I don't know that it would change the buying behavior all that much in those three markets. I think the market has decidedly already shifted to body cameras there. In other markets, we're starting to see -- I position it like international governments are starting to dip their toe a little bit into the body camera world and start to understand kind of what's going to work for them and what's not.\n\nAnd so I think we do have a lot of opportunity there. First, with kind of small and mid-sized orders and then growth over time. And so that's the -- that's really where we see kind of international going in terms of body cameras. But like I mentioned, we are seeing international governments start to deploy TASERs with a lot more conviction around the globe, and we should expect to see that continue for the years to come.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nAs a follow-up question, domestically, federal contracts, in terms of the value that you're getting in those deals, right? You're talking about a huge buyer, a buyer that's been mindful to look at getting best pricing, etc. So I wanted to understand in terms of length of contracts there and kind of the value you're getting the ASPs. How that compares, obviously, without getting into exact specifics, but just understanding that a little bit in terms of that buyer.\n\nJosh Isner -- Chief Revenue Officer\n\nAnd is that for international, specifically?\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nNo, domestically.\n\nJosh Isner -- Chief Revenue Officer\n\nDomestically. OK. What was that, Rick?\n\nRick Smith -- Chief Executive Officer\n\nI think the question was about our federal buyers.\n\nJosh Isner -- Chief Revenue Officer\n\nFederal. OK. Federally mirrors -- our federal government is generally mirroring what our state and local customers are doing pricing-wise. Certainly, we do have some commitments to make sure that we are recognizing the federal government and the most favored nations clauses in some of those contracts.\n\nBut ultimately, we do feel pretty good that those license types and sizing is similar to what we see. And far, far ahead of where our -- when our state and local customers started to buy in large volumes, like the federal government has kind of skipped that phase of basic licenses and TAP and they're buying a lot more frequently at higher license types, which is exciting.\n\nRick Smith -- Chief Executive Officer\n\nYeah. And I would add, Josh, as well that we're starting to now invest in dedicated federal R&D. So in many cases, we're seeing the Fed customers interested in premium sort of features that might require a little more investment in certain types of hardening of different devices or software to meet certain federal requirements that, in some cases, can -- they can even lead to premium pricing.\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nGreat. Thanks for the color, and best wishes.\n\nRick Smith -- Chief Executive Officer\n\nThanks.\n\nAndrea James\n\n[Operator instructions] So we'll take our last question from Erik Lapinski at Morgan Stanley. Go ahead, Erik.\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nThank you. I just maybe wanted to follow up on the federal market and some of the comments you guys just made there. I'm curious in terms of just the bundling that you're seeing in the federal market. Are you seeing similar uptake of OSP 7+? I know that a number of agencies already have TASERs.\n\nSo are they looking at body camera contracts kind of separately or bundling when you see those deals, I'd be curious on kind of what it looks like.\n\nJosh Isner -- Chief Revenue Officer\n\nYeah, a great question, Erik. I'd say we're seeing kind of department by department, a little bit of everything. I think the agencies, you mentioned that agencies already have TASERs. A lot of those are up for upgrades.\n\nSo it's a great time to buy our body cameras and software and bundle those -- that upgraded version of the TASER in -- with that contract. Other customers are buying software only, our investigator package for certain customers in the federal government. And then some stand-alone activity as well. The one really in -- there's a lot of really encouraging things here, but one of them that stands out is customers are also buying across our suite of products.\n\nThey're seeing use cases for live streaming. They're seeing use cases for records. They're seeing fleet-free interest. And so really across the board, we're seeing a lot of interest and a lot of different products from the federal government.\n\nAnd it's really a credit to the work Richard Coleman, our Head of Federal and his team have done, it's really kind of transformed over the last few years from kind of a steady state market into an exponentially growing one.\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nThank you. That's helpful. And if I could sneak in another one. I know the corrections market is kind of another expansion area for you guys that we didn't talk that much about this quarter.\n\nI'd be curious if just any -- whether it's from funding initiatives you're tracking or kind of just what the states are looking at in terms of the corrections market. If you're seeing more of an uptake there, if it's kind of -- I know there have been a couple of early presents over the past couple of quarters, but just in terms of kind of building on top of that.\n\nJosh Isner -- Chief Revenue Officer\n\nYeah. The team is definitely growing. And for us, I think it's more of a -- it's less about the federal government giving grants or fundings or any kind of overall market effects there. I think it's more just -- historically, we haven't really had a team focused on corrections as its own market.\n\nWe really did a lot of correction sales through the sheriff's office while they were buying products for the rest of their deputies. And now just having a really focused team, we're starting to unlock a lot of that market on a much more predictable basis. And so I think the growth there is just attributable to our team's focus as opposed to any external factors.\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nThank you.\n\nAndrea James\n\nGreat. Looks like we have a follow-up from Jonathan Ho at William Blair. Thanks, Jonathan.\n\nJonathan Ho -- William Blair -- Analyst\n\nYeah. Just a couple for me. I wanted to maybe dig a little bit into your Microsoft opportunity. Can you talk a little bit about the level of benefit or cost savings that you could maybe see from that deal just as a starting point.\n\nRick Smith -- Chief Executive Officer\n\nYeah, I'd start by saying the exact terms of the deal are not something we can go public with. I don't know, Jim, what would you --\n\nJim Zito -- Interim Chief Financial Officer\n\nYeah. I'd say at a high level, it enables us -- it supports our target long term of having 80-plus percent software gross margins. And I think the duration of that contract is really helpful for us for having that confidence and visibility to our pricing when we set our contracts with customers. So I think it helps us over time, sort of maintain/expand our Axon Cloud gross margins.\n\nBut I think the best thing of guys gives us predictability.\n\nJonathan Ho -- William Blair -- Analyst\n\nGot it. And then just in terms of the commercial market, can you talk a little bit about your progress there? And maybe some of the go-to-market opportunities that you see specific to commercial? Thanks.\n\nJosh Isner -- Chief Revenue Officer\n\nYeah. We're thrilled with the opportunity there. Mike Shor and his team have just done a great job building something from -- we don't get those -- the same advantages we sometimes have in the public sector where the referral network and stuff. We have to build those from scratch.\n\nAnd Mike and his team have done a great job of that. The team continues to be on a cadence of kind of doubling every year, and that's happened in terms of their results for the last three years now, and we're still probably about 90% of the way there on product market fit, where we've got some really evangelical early adopters that are excited about how things are going. And now it's just kind of closing that last 10% of some of the product market fit items and really expanding each year. And I think we're really, really well-positioned to do that, and we'll start to see some names that you're very familiar with adopting our products for more commercial purposes.\n\nAndrea James\n\n[Operator instructions] Let's have Rick close this out.\n\nRick Smith -- Chief Executive Officer\n\nAll right. Well, obviously, another great quarter. I'm really proud of what the team was able to deliver. It's -- there's a lot going on in the world, and our team just really digs in and Josh just does a great job of keeping people focused right, lock out the noise.\n\nThere's a lot happening in the world that we can affect, but there's things within our control and the more we focus, the better the results always end up being. So appreciate everybody joining us today, and we look forward to updating you on the back half. Have a great day.\n\nDuration: 0 minutes\n\nAndrea James\n\nRick Smith -- Chief Executive Officer\n\nJosh Isner -- Chief Revenue Officer\n\nJim Zito -- Interim Chief Financial Officer\n\nWill Power -- Baird -- Analyst\n\nErik Suppiger -- JMP Securities -- Analyst\n\nSami Badri -- Credit Suisse -- Analyst\n\nKeith Housum -- Northcoast Research -- Analyst\n\nJonathan Ho -- William Blair -- Analyst\n\nJosh Reilly -- Needham and Company -- Analyst\n\nJeremy Hamblin -- Craig-Hallum Capital Group -- Analyst\n\nErik Lapinski -- Morgan Stanley -- Analyst\n\nMore AXON analysis\n\nAll earnings call transcripts"
}