{
  "companyName": "MicroStrategy",
  "companyTicker": "MSTR",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/01/microstrategy-mstr-q3-2022-earnings-call-transcrip/",
  "content": "MicroStrategy (MSTR 3.62%)\nQ3 2022 Earnings Call\nNov 01, 2022, 5:00 p.m. ET\n\nShirish Jajodia\n\nHello, everyone, and good evening. I am Shirish Jajodia, vice president of investor relations and treasury at MicroStrategy. I'll be your moderator for MicroStrategy's 2022 third quarter earnings webinar. Before we proceed, I will read the Safe Harbor statement.\n\nSome of the information we provide during today's call regarding our future expectations, plans and prospects may constitute forward-looking statements. Actual results may differ materially from these forward-looking statements due to various important factors, including the risk factors discussed in our most recent 10-Q filed with the SEC. We assume no obligation to update these forward-looking statements, which speak only as of today. Also, during today's call, we will refer to certain non-GAAP financial measures.\n\nReconciliations showing GAAP versus non-GAAP results are available in our earnings release and presentation, which were issued today and are available on our website at microstrategy.com. I would like to welcome you all to today's webinar and let you know that we will taking questions using the Q&A feature at the bottom of your screen. You can submit questions throughout the webinar, and Michael, Phong or Andrew will answer questions at the end of the session. Please be sure to provide your name and your company's name when submitting your questions.\n\nNow, I will walk you through the agenda for today's call. First, Phong Le will cover the operational results for the third quarter of 2022. Second, Andrew Kang will cover the financial results for the third quarter of 2022. Then Michael Saylor will provide a strategic review and discuss recent bitcoin market updates.\n\nAnd lastly, we will open up to Q&A. With that, I will turn the call over to Phong Le, president and CEO of MicroStrategy.\n\nPhong Le -- President and Chief Executive Officer\n\nThank you, Shirish. I'd like to welcome all of you to today's webinar regarding our 2022 third quarter financial results. First, I will focus on the 2022 third quarter business results. We had another good quarter overall, achieving constant currency total revenue growth on the strength of our cloud business.\n\nThis, despite a challenging macroeconomic environment in Q3 with continuing high inflation, weakening foreign currencies in the ongoing war in Ukraine. We had strong growth in our subscription revenue and billings driven by both existing customer migrations to the cloud and new customer wins. Our customer revenue renewal rates continue to be among the highest we've ever experienced. To summarize our third quarter software results, revenues increased 4% year over year on a constant currency basis.\n\nTotal software licenses revenue, which consists of product -- total product licenses and subscription services revenues in our consolidated statement of operations increased 11% year over year on a constant currency basis. We benefited from the increased adoption of our cloud platform, partially offset by a decrease in product license revenues. Over time, we expect our revenue profile to continue to shift toward recurring subscription revenue. Subscription revenue increased 59% year over year on a constant currency basis.\n\nCurrent subscription billings grew 79% year over year, our 10th straight quarter of double-digit growth and our best quarter ever. We've also seen further global adoption of our cloud platform among our international customers, including customers in the Asia Pacific region, with several major wins in Q3. We've also seen further growth of our embedded business with multiple new logos. Next, I'd like to provide some observations from my first 90 days of being the CEO of MicroStrategy.\n\nI spent more time in the field in the US and internationally, listening to our customers and employees and learning from them. What I learned first is that our customers continue to love our product offerings. There are people that have built their careers on the MicroStrategy platform and dedicated to our success and see us rising above the fray of basic visualization tools. They're also excited about modernizing, consolidating their BI platforms in an open multi-cloud environment.\n\nAccordingly, we'll continue to focus on three key areas of growth that represent core MicroStrategy differentiators, enterprise analytics, embedded analytics and the cloud. Our customers depend on these differentiating capabilities to build mission-critical applications to run their field forces, store operations, bank branches, risk analysis groups, corporate operations and much more. I'll also focus more on innovation. Our continued investment in research and development has enabled us to modernize our platform and enable our customers to transform how they do business through innovative analytics, tools and techniques.\n\nThese include personalized applications, immersive interactive visualizations, simple no-code and low-code application development with open APIs, flexibility of consumption for mobile interfaces and innovative capabilities like HyperIntelligence. We continue to see growth from customers who build MicroStrategy into the software solutions that they sell to end users, leveraging our open embedded analytics capabilities. Looking forward, we recognize the power of artificial intelligence and machine learning to augment more traditional reporting capabilities and provide contextual and immediate insights. In Q3, we released our first set of products in this area called MicroStrategy Insights.\n\nThis is the basis on which we are combining MicroStrategy Semantic layer, Hyper intelligence and open architecture to provide the data tracking, alerts, forecasting, recommendations and artificial intelligence that will be key for the future of analytics and intelligence. We believe this is something MicroStrategy is uniquely positioned to provide, and we expect to release more functionality in this area every quarter. Another interesting area where we can differentiate our offerings is Bitcoin Lightning software development for the enterprise. We are in the initial stage of exploring innovative lightning applications for cybersecurity use cases to help enterprise customers through networks, monetize websites and deploy wallets in mass using Bitcoin.\n\nWhile our core focus remains on BI innovation, we believe we are uniquely positioned to bring value in this area also. Mike will elaborate further on this topic. As MicroStrategy Cloud continues to be a growing part of our business mix. we seek to accelerate growth through increased cloud adoption by both new and existing customers.\n\nNew customers are increasingly cloud-first and immediately reap the benefits of our managed service offering. Those include business agility, enterprise security, regular updates and upgrades and cost savings. At the same time, more and more existing on-premise customers are migrating to the cloud and expanding their MicroStrategy usage to new departments and user groups. Intentional in our approach to cloud is our belief in cloud agility.\n\nThe power of multi-cloud, hybrid and the portability between private and public clouds resonates with our customers who do not want to be locked into a single technology stack. We take advantage of the best that each major cloud provider has to offer, optimizing our platform to run on and across each. We will continue to invest in this area to support our customers' needs for flexibility, scalability and security. We're eagerly awaiting final authorization to operate for the launch of MicroStrategy Cloud for government, our new cloud offering with FedRAMP authorization.\n\nThis product will be our first generally available release of our cloud platform that relies on a modern cloud native architecture, utilizing containers and microservices. It will open up the possibility of migrating a large part of our business, federal government customers to the cloud. It also serves as proof of our enterprise-grade security, stability and scalability via certifications for large enterprises, previously reluctant to move to the cloud like those in the financial services industry. The combination of FedRAMP authorization, enterprise-grade capabilities and managed service delivery will help us further differentiate our solutions with government customers, our enterprises and embedded analytics customers worldwide.\n\nOur focus on enterprise analytics, embedded analytics and cloud services has resulted in more customers choosing to decommission and consolidate legacy platforms in favor of an enterprisewide adoption of MicroStrategy. This has led to increasing revenue renewal rates every year in the last three years. Another observation for my time meeting customers is their willingness and desire for hybrid interactions that includes meaningful rich in-person connections alongside virtual meetings. Accordingly, I'm thrilled to share that our next MicroStrategy world will be back in person.\n\nFrom May 1 to 4 in Orlando, Florida. World23 will be a working event designed to help modernize analytics for innovative organizations looking to transform with data. We decided to showcase some of the world's best brands use modern experiences to break through and achieve extraordinary results. The conference will also include dedicated networking opportunities, workshops and training, as well as our third annual Bitcoin for Corporations event.\n\nRegistration is opened November 8, and additional details can be found on our Event website at microstrategy.com/world23. Turning to our Bitcoin acquisition strategy. We continue the commitment to our strategy in Q3 and purchased 301 additional Bitcoins for approximately $6 million at an average purchase price of $19,000 – $19,860 per Bitcoin, net of fees and expenses. We have not sold any Bitcoin to date.\n\nTo reiterate our strategy, we seek to acquire and hold Bitcoin for the long-term. And we do not currently plan to engage in sales of Bitcoin. We have a long-term time horizon and the core business is not impacted by the near-term Bitcoin price fluctuations. As a final comment, I would say macro and market volatility are expected to be the new normal.\n\nWe believe change is constant. In this world, businesses need actionable data, enterprise-grade analytics, multi-cloud capabilities and open architecture and customer success focus. MicroStrategy delivers this. Our competition prefers dashboard proliferation, departmental visualizations, single stack vendor lock-in and price increases.\n\nThis market volatility may impact our financial results in the short-term, as we target modest constant currency revenue growth during our cloud transition. This will require us to be financially prudent, investing our platform, while applying a thoughtful approach to costs with the objective of remaining at least margin neutral in the short-term. I'll now turn the call over to Andrew, to discuss our financial results for the quarter in further detail.\n\nAndrew Kang -- Senior Executive Vice President and Chief Financial Officer\n\nThank you, Phong. I'll start by highlighting our third quarter 2022 financial results in more detail. GAAP total revenues for the quarter were $125.4 million, down $2.6 million or 2% year over year. Isolating the impacts on foreign exchange, total revenue was up 4% year over year at constant currency.\n\nTotal software license revenues, which is a total of product license revenues and subscription services revenues were $38.7 million, up 5% year over year, and up double digits or 11% at constant currency. As we continue to migrate our customers to the cloud, we know that product licenses revenues will naturally decline as revenues previously recognized upfront are converted to revenues recognized over a longer period as subscription services revenues. When we look at the two together, year-over-year increases on both a GAAP basis and at constant currency are positive indicators that we are successfully moving our customers to the cloud not only on a stand-alone basis but, as well as contributing to the overall growth of our software platform. In line with what I just described, subscription services revenues were $16.4 million, an increase of 51% year over year and up 59% at constant currency.\n\nProduct licenses revenues were $22.3 million for the quarter, which was $3.5 million lower year over year, while product support revenues were $66 million, down $4.4 million year over year, relatively flat at constant currency. As Phong mentioned earlier, our Q3 renewal rate was again at 95% this past quarter, demonstrating the durability of our platform and the long-standing nature of our customer base. Finally, other services revenue, which primarily reflects our consulting business was $20.7 million, a slight decrease year over year but a 7% increase in constant currency. Our highly skilled and experienced consultants continue to support, innovate and modernize our platform across our customer base.\n\nAnd we have been very successful in delivering consulting services across our global delivery centers in the US, Europe, South America and Asia, while optimizing costs and increasing billable hours year over year. Moving to billings. Our total current software license billings were $36.4 million, an increase of 2% year over year, and in the third quarter, subscription -- current subscription billings were $14.4 million, an increase of 79% year over year. This is in comparison to the increase of 51% year over year in Q2.\n\nThis sequential growth was driven by solid results in both subscription services revenues, as well as current deferred subscription services revenues. It is also worth noting again that we sold our largest cloud billings as multiyear contracts with an average term of over 24 months, of which only 12 months are currently reflected on our balance sheet. We believe our cloud transition is successfully underway, and the demand from our customers to migrate MicroStrategy to the cloud remains very strong with additional pipeline being added from both our domestic and international customers. Shifting to costs.\n\nTotal non-GAAP expenses, which exclude share-based compensation costs were $102 million in the third quarter, compared to $165 million in the third quarter of 2021. Our total non-GAAP costs this quarter were significantly lower year over year, as well as compared to Q2 of this year. This was primarily due to stable Bitcoin prices this quarter, which led to a nominal $700,000 Bitcoin impairment charge in contrast to the $65 million charge in Q3 of 2021. The Bitcoin volatility as measured by the one-month realized volatility fell below that, of the major equity indices such as the S&P 500 and NASDAQ this past quarter.\n\nWe view this recent market shift as a possible signal that Bitcoin's investor base and institutional adoption is continuing to mature, making it more suitable and accepted by traditional market participants. During the quarter, Bitcoin prices remained above our carrying value, low watermark of approximately $17,600 – and as a result, we saw a minimal digital asset impairment charge in Q3. Non-GAAP cost of revenues were $24 million in the third quarter, an increase of $2.6 million or 12% year over year. As a percentage of total revenues, non-GAAP cost of revenues was up 2% year over year attributed to higher cloud hosting fees and investments in technology and talent as we continue to scale up to support our growth in cloud.\n\nNon-GAAP sales and marketing expense was $30 million, which was a decrease of $4.1 million or 12% year over year. As a percentage of total revenues, non-GAAP sales and marketing costs were lower by 3%, and year over year, primarily due to higher net capitalized commissions this quarter compared to the same quarter in the prior year. Non-GAAP R&D expense was $27 million, an increase of $1.4 million or 6% year over year. We continue to prioritize research and development in our core software business as we invest in personnel supporting innovation, cybersecurity and growth in cloud.\n\nNon-GAAP G&A costs were $20 million, which was an increase of $1.4 million or 7% year over year. As we emphasized earlier, the uncertain macroeconomic environment and inflationary trends continue to present headwinds to our bottom line, and we believe these challenges are the new normal. Although, we see strong growth in cloud and high sustained renewal rates, managing rising costs is critical to weathering the current environment. We plan to be extremely disciplined in controlling costs in the near term as we navigate these conditions, and we will continue to cut costs in certain areas, while prioritizing spend that we believe will drive revenue growth.\n\nOn slide 13, total non-GAAP operating income in the third quarter was $23 million, reflecting a non-GAAP margin of 18%. The very small Bitcoin impairment charge this past quarter that I mentioned earlier had a minimal impact on our reported results and was the lowest digital asset impairment charge since we launched our Bitcoin strategy in Q3 of 2020. In a reporting period, where there are minimal impairment charges under the current accounting rules, we believe our non-GAAP operating income better represents the underlying performance of our core software business. As of September 30, 2022, the carrying value of our Bitcoin holdings was approximately $2 billion, which reflects approximately $2 billion in cumulative impairment charges incurred through the end of Q3.\n\nAs you know, GAAP accounting treats our Bitcoin holdings as an indefinite-lived intangible asset, which means that any decrease in the fair value below our carrying value any time after date of acquisition requires us to recognize an impairment. Conversely, when prices increase, the current accounting rules did not allow us to increase the carrying value. On October 12, the Financial Accounting Standards Board unanimously voted to recommend the adoption of fair value accounting for all public and private companies in measuring certain digital assets, including Bitcoin. Under current fair value accounting standards, both decreases and increases in the fair market value of an asset would be recognized in GAAP earnings.\n\nWe understand this is an initial step in the standard-setting process and many of the details and disclosures have yet to be determined, but we are extremely encouraged and supportive of the FASB's decision for the change and the improved investor transparency it should provide. We believe this is an extremely positive step for the future of digital asset accounting, and we remain committed as we have in the past to supporting these efforts. Turning to slide 15. Our debt capital structure consists of a $500 million senior secured note, a $205 million Bitcoin back loan and $1.7 billion of convertible senior notes, all with a blended interest rate of approximately 2%, the earliest maturity, which is not until March 2025.\n\nWe have also issued $1 billion of equity through previously announced At The Market or ATM offering in Q3 and Q4 of 2021. Recently, on September 9, we filed a prospectus supplement for an additional ATM equity offering, which will allow us to sell up to $500 million of Class A common shares from time to time into the market. As of October 31, 2022, we have not sold any shares under this program. We intend to use the ATM under a disciplined approach to sell equity, if and when we believe there is an embedded value premium in our stock, compared to the market value of our Bitcoin holdings and our estimated value of our enterprise analytics software business.\n\nThe use of proceeds will be for general corporate purposes, which include the purchase of Bitcoin. Our focus is in managing capital will continue to be that of accreting shareholder value, optimizing our overall capital structure and ensuring adequate liquidity to run our operations and service our debt. On slide 16, as of September 30, 2022, we held a total of 130,000 Bitcoins, of which 14,890 Bitcoins were held directly by MicroStrategy at the parent. All of which secure our 2028 notes.\n\nThe remaining 115,110 Bitcoins are held at MicroStrategy -- I'm sorry, MacroStrategy, our subsidiary. In Q3, there was no change to the number of Bitcoins pledged at MacroStrategy. Of the Bitcoins held at the sub, approximately 30,000 Bitcoins are pledged as collateral to our Bitcoin back loan and just over 85,000 Bitcoins or 65% of our total holdings, equivalent to approximately $1.7 billion at the current market price of $20,400 remain unpledged and unencumbered. As you can see, we have more than sufficient collateral to meet the ongoing requirements of our Bitcoin back loan today and through any current foreseeable price volatility.\n\nAs Paul mentioned earlier, our Bitcoin strategy remains simple. We have bought and held Bitcoin and will continue to do so. Finally, before I turn the call over to Michael, I would like to reemphasize that MicroStrategy's principal core strategies are to operate and grow our enterprise analytics business and to acquire and hold Bitcoin as a treasury reserve for the long-term. This hybrid strategy represents a paradigm shift where we seek to maximize the performance of both segments of our business, while identifying and capitalizing on the synergies that come from combining a mature and profitable enterprise software business with a large-scale digital asset holding.\n\nThank you for your time today and for your support of MicroStrategy. I'll now turn the call over to Michael for his remarks.\n\nMichael Saylor -- Executive Chairman and Co-Founder\n\nThank you, Andrew, and thank you to all of our shareholders that are with us here today. I would like to provide a performance review of the company's results since we adopted a Bitcoin strategy. And I'm delighted to report to all the shareholders that since MicroStrategy adopted the Bitcoin strategy on August 11, 2020, our stock has outperformed all of the major asset classes that we benchmark ourselves against. It has outperformed all big tech stocks, and we have outperformed all enterprise software stocks that we benchmark ourselves against.\n\nYou can see from this chart, we are up as of 4:00 P.M. yesterday, October 31 we were up 116%, since we embarked on this strategy. And I think the most important benchmark we compare ourselves against is Bitcoin itself. And Bitcoin in that same time period is up 72%, so we have managed by our strategy to capture all of the Bitcoin gains with a boost.\n\nNow, if we compare the Bitcoin performance in that 2.25 years to other assets, the S&P is up 15%. So a diversified portfolio of really high-quality stocks are 15%. the NASDAQ is effectively zero percent. So there is no gain in the NASDAQ.\n\nGold, and many of you have followed us in our journey will recall that -- when we started on this path, our No. 1 was, should we buy Bitcoin or should we buy gold. Gold is down 19%. In that same time period, the Bitcoin is up 116%.\n\nThat makes sense to us. Gold is the hard money solution for the 19th century, and Bitcoin is the hard monetary asset for the 21st century. But I think it's auspicious that we see the market is agreeing with us after these 24 months or so, 26 months. The bond index, and that's really BOND, -- it's still -- it's long bonds, about 20-year duration bonds.\n\nThey have lost 22% of their value in this time frame. So bonds are obviously not holding value in the interest rate environment we're struggling with, and they have limited upside generally. And of course, silver, which is sort of a weaker precious metal than gold is down 33%. So I think, when you look at the story here, Bitcoin is winning, but MicroStrategy is winning even more than the Bitcoin right now because of our levered long Bitcoin strategy we pursued.\n\nWe benchmark ourselves against big tech stocks, and of course, three of the most extraordinary stocks and companies in the modern era are Apple, Google and Microsoft. And of course, Apple is up 36%, about one-fourth of our performance results and our stock. Google was up 27%. Microsoft is only up 11%.\n\nSo MicroStrategy stock is 10x. Microsoft, even though Microsoft, of course, is the most successful software company on the planet. The challenge with equities, as we all know, is that you have not just monetary risk due to macroeconomics, but you also have execution risk. And you have all sorts of other types of risks.\n\nSo Amazon is down 35% because of their challenges, which I won't go into. Netflix is down 40%, and META Group Facebook is down 65%. So you can see, of course, this mix performance is probably what drives the 0% NASDAQ result. And if we look at the mega enterprise software stocks, of course, Oracle is the monster enterprise software copy, they're up 42%.\n\nIt's very well run and very stable, but they don't have the benefits of a Bitcoin balance sheet. IBM stock up 14%, salesforce down 18%, S&P down 40%. So even though I think there's a lot of publicity about the volatility of Bitcoin and some of the non-cash charges we've taken, the real interesting story here is that MicroStrategy's Bitcoin strategy is the winner against all of these other strategies over the last 2.25 years. We generally pick August 10, 2020, as that date to go back to because that was the date before we purchased $250 million worth of Bitcoin, and we announced a $250 million Dutch auction or share buyback.\n\nAnd so, that was a pretty critical point in the history of the company. Before that date, we are operating the software business without any treasury strategy and we had our $500 million in cash invested in short-term treasuries zero to 12-month treasury bills. And our primary strategy was either to buy the stock back or invest in treasuries. And after that date, we had a Bitcoin strategy that was implemented on $250 million.\n\nAnd then, we had to wait until the end of the Dutch auction around September 10th of 2020 before we knew what was going to happen next. And then, we had $175 million, which we invested in Bitcoin, and we have continued with our consistent Bitcoin long strategy since. I'd like to talk a little bit about the macro environment. And so, we'll switch off to the slide for a second.\n\nThe most important thing that's happened in the past 12 months is the risk-free interest rate in the world, and I don't just mean the Western world, the entire world has gone from 12 basis points to 465 basis points. That's the one-year treasury rate on US treasuries. And that's an extraordinary climb. In the middle of 2018, the one-year rate was about 280 basis points.\n\nIt coasted down to about 150 basis points in January of 2020. And then, it nosedived to just a few basis points, five to 10 basis points in March of 2020. The risk-free rate was effectively nothing for the next 18 months. And then, when the Central Bank began to perceive inflation as being the priority more so than economic stimulus, these interest rates start getting increased and they got increased at the most rapid rate in 40 years.\n\nSo we find ourselves in a situation right now where for the last 12 months, the risk-free rates have increased by a factor of 50, financial assets have all suffered, and that means gold, equities, bonds, etc., and crypto assets and Bitcoin, so we're all living that. I don't have to tell you about that. I think you understand that. The important point right now is that we're now at a seriously inverted yield curve.\n\nThe three-month bond rate for treasuries is about 417 basis points and the 30-year treasury bond rate is 410 basis points. So in essence, you make more money buying a three-month bond and a 30-year bond. This is probably not sustainable for the long term. The classic interpretation would be that the yield curve is pointing toward expectation of recession, and the reason the 30-year rate is higher than the three-month rate is an expectation that eventually the Fed will begin to loosen monetary policy and lower rates.\n\nI would say you could almost say that our monetary policy was kind of to devalue the currency, weaken the currency, if not crash the currency for the first year of the pandemic crisis and now the monetary policy is ripping the wings off the economy for the last year. And we see the wings starting to come off. All of the currencies in the world have been crashing against the dollar and created a massive macroeconomic headwind. The pound and the euro are off about 15% against the dollar in the last 12 months.\n\nJapanese yen is down about 23% that manifests itself in a couple of impacts. One is for any company that's primarily US-based or USD based sees that it's struggling against these foreign currency headwinds and its revenues and its earnings. And MicroStrategy suffered from that this quarter. We're selling in yen and euros and pounds and those in euros and pounds are being devalued 15% to 23% in the last 12 months.\n\nSo that's a bit of a headwind. I'm pleased to say that I think our P&L has held up really well against that macroeconomic headwind and we're happy about that. I think the other implication is there's -- this is exporting inflation to the rest of the world. So commodities are priced in dollars like oil and so as the euro and the pound and the yen weakened, the cost to buy oil in those nations explodes and so we're seeing double-digit inflation throughout Europe, throughout the rest of the world.\n\nThis is creating protests, social unrest, there are riots in some – in streets in Eastern Europe. This is also creating a crisis among a number of conventional institutional investors. We just saw this manifest itself in the crisis in the UK, that resulted in the early resignation of the Prime Minister and the Chancellor. That happened when they attempted to lower taxes, it created a crisis of confidence in the markets and a 30 and 40-year British pound bond rates exploded into the 505 handle range the markets aren't really holding 5% to 6% interest rates very well.\n\nWhen that happens, that creates a margin call on anyone that's using those instruments is their primary treasury reserve asset. And – so the result is the markets hiccup and they reached and the entire government collapsed in the UK. I think that, that's a warning sign. We can see that challenge.\n\nWe can see in Japan right now, they've had to intervene to support the yen, which has also been collapsing and there's very explicit intervention. This is being viewed, I think, in the United States, and the rest of the Western world. And the takeaway is we're just to the point where we're either going to rip the wings off the economy, if we keep raising interest rates much more, or if the interest rates get into the 5% to 6% zone, we're going to undermine the balance sheets of pension funds and other major investors. And this is on international global problem that results in a lot of pressure on central bankers to slow down the rate of interest rate increases.\n\nAnd we see that manifested with people coming on CNBC, pointing out that they have to slow this down. We see political pressure to taper. We see international pressure on the US government from all these other nation states that have their currencies crashing on the Federal Reserve to taper this rise. So we're approaching some sort of macroeconomic inflection point.\n\nIt's not clear when we get there, but we know that when 30-year bonds and 40-year bonds or 5.5%, the entire government of the U.K. collapses. And we know that the Japanese yen is now laboring because they're trying to hold a 10-year rate of 25 basis points in Japan, while the US 10-year rates served with a four handle. All of these things are suggesting that the current trend of continuing to raise the risk-free rate can't continue too much longer, the resistance of the tightening is increasing.\n\nAnd that takes me to just a discussion of the Bitcoin strategy right now and fundamentals. I think the summer here is over the last 12 weeks, the Bitcoin fundamentals have improved. As Andrew pointed out, volatility of bitcoin shifted for being more volatile than NASDAQ and highly correlated to being less volatile than NASDAQ and not so much correlated in the past three months. That's really bullish, I think, for the asset class and auspicious.\n\nThe other fundamental developments are auspicious. BNY Mellon officially announced its Bitcoin custody services. That's very auspicious because that's probably the first major bank that stepped up into that business. Block upgraded Cash App and Cash up is a 40 million user type mobile application, and they upgraded it in their support of Lightning.\n\nSo now they can send and receive lightning to Cash App mobile application instances. And they did it with a universal barcode. And so, that means that I can hold the barcode up on my phone, and you can scan it, and it will either send a Bitcoin on the base layer, the Layer 1, if that's what you requested or it will send it on the Lightning layer. We're already seeing this create a massive amount of enthusiasm in the Lightning development community.\n\nIt's launched a lot more lightning wallets. It's launched a lot more vendor interest in taking Bitcoin as lightening payments. And One of the more interesting stories right now is a supermarket chain call Pick-N-Pay, all around South Africa. Pick-N-Pay rolled out Lightning payments to 40 of their stores in production as the second stage of their Bitcoin adoption.\n\nAnd that appears to have been successful. There are a lot of videos circulating around and people going in and paying in a matter of seconds via Lightning transactions off of Android and iPhones, but the more important point is that their stated plan is to deploy Bitcoin Lightning support to 1,628 stores. So the broad-based adoption of Bitcoin as a medium of exchange via Lightning technology is now being taken seriously with the Cash App example, with the Pick-N-Pay example. This is getting a lot of attention in the community.\n\nAnd of course, the benefit to the retailer would be not only is it almost no fee, but it's also instant settlement. And it also appeals to the crypto friendly. And right now, across South America and Africa, people are becoming much, much more interested in the entire crypto area and Bitcoin, in particular, because the currencies are crashing. The Nigerian Niara has an official exchange rate in the 400 range.\n\nBut it's government managed and the actual exchange rate is crashing to 800 to the $1, and they're announcing they're going to swap out the currency for a different currency. So what you see is you see a wholesale currency crashes, devaluations and bank failures and capital controls are spreading like wildfire throughout Asia, South America and Africa. And the solution to the population is a $50 Android phone running a mobile wallet like the Lightning wallet. And of course, this becomes a matter of great passion to them.\n\nAnd of course, it also becomes a matter of passion to the merchants because if the merchants can't get paid in hard currency, and they have to go through multiple layers of credit, then their businesses are also at risk. So that's a great fundamental development to Bitcoin, because traditionally, the view of Bitcoin is it's just a store of value because it runs on a level one transaction network with only seven transactions a second. But now that people are saying that it's infinitely scalable over the Lightning Network, it's not just the store value. It's a game-changing technology that you can build into a mobile app on billions and billions of mobile devices.\n\nAnd so, this is becoming very, very interesting and it's changing the narrative with regard to Bitcoin. Another big development that happened this quarter is FASB made the fair value decision by a vote of seven to zero. It doesn't mean that we have enough guidance to change our accounting. But -- but if we consider what happens next, we know we have unanimous support to adopt fair value accounting for Bitcoin.\n\nThe next thing will have to be some guidance around and decisions around what the disclosure forms will be -- after that, there will have to be guidance about the transition plan, then they'll need some public commentary. And after they've internalized or absorbed all the public comments on the transition plan and the guidance, then I think that we'll see – we will see companies like MicroStrategy and anyone holding Bitcoin on their balance sheet, adopt fair value accounting, and that will be a huge benefit to the asset class. Bitcoin benefited by a few other things this quarter. First of all, noted recognition by the heads of the CFTC and the SEC.\n\nThey both mentioned Bitcoin favorably and noted it to be a commodity. And so, this is -- this was very auspicious and this has been noticed by the entire crypto industry and by the mainstream investment community. I think there's been an increase in DeFi hacks in the crypto industry this quarter. But that actually is just underscored how much more secure Bitcoin is and why Bitcoin is the institutional safe haven investment-grade asset, because in the same quarter where there are lots of DeFi hacks and crypto hacks, people are reminded again that there are no Bitcoin hacks and there have been no Bitcoin hacks.\n\nAnd that's a comforting differentiator. There's been an increase in SEC crypto enforcement actions, and this is serving to educate an entire generation of crypto investors as to the difference between a commodity and security. And I think that as people become educated as to the difference, they realize that there's a great benefit to holding a commodity and Bitcoin is the only crypto asset universally acknowledged to be a commodity. And so, I think that the world is getting educated there.\n\nAnd then, last point I'll make is that the Bitcoin hash rate is hitting an all-time high right now, and there are notes that people suggesting they see a touching 300 exahashes. So throughout the crypto winter and all the volatility, the Bitcoin hash rate has continued to expand. And people often ask, well, what is Bitcoin back by. It's backed by the most powerful crypto computing network in the world, which is also the most powerful computing network on earth, like so powerful that it's orders of magnitude more powerful than the hash rate that could be generated by all of the Microsoft, Amazon, and Google cloud computing hardware, if it were all turned against the network.\n\nSo the fact that the Bitcoin has this wall of crypto energy, 300 exahash of it makes the entire asset censorship resistant, hack resistant. It gives it integrity. It gives a longevity. It makes it neutral.\n\nAnd ultimately, it provides the security that you need if you're going to put large amounts of monetary energy or wealth into Bitcoin. So oftentimes, people are spreading FUD, and their FUD will be something like well, the transaction rates will decrease and that will cause the security budget to go to zero, or if the price goes down, people will stop expanding the network. What we can see right now is that the Bitcoin network is adding additional security and the capital that gets invested in the security has about a six to eight-year delay versus when people made the decision. So the natural frequency of the Bitcoin network is eight years, eight years after a disaster catastrophe, you will start to see some mitigating effect, perhaps the hash rate will slightly slowdown in its growth rate.\n\nBut what we can see here is that people are adding, hashing equipment, Bitcoin mining equipment now that was purchased two years ago to the network. And so, this is a very good thing for a crypto commodity. And what we see is Bitcoin performing just as you would expect it to perform, you know, as the most anti-fragile digital asset in the world. So with that, I'd like to thank everybody for your time and attention.\n\nI guess, Shirish, we're ready for questions\n\nShirish Jajodia\n\nGreat. Thank you, Michael. We are going to jump right into questions. And the first question is for Phong.\n\nHow is demand faring across geographies and industries? You mentioned that you did well in the Asia Pacific region. Are there any particular areas of strength or weaknesses to call out?\n\nPhong Le -- President and Chief Executive Officer\n\nThanks, Shirish. Yeah. When I mentioned we did well in the Asia Pacific region. It was related to cloud, and primarily because cloud adoption started in the US.\n\nI think over the last year, we've seen it start to grow quite a bit in the European region and Latin America. And most recently, we saw it start to grow in APAC. So that was notable just because we're seeing global adoption of cloud. As far as overall, if you look at our results, I still think macroeconomic impacts, geopolitical challenges, Ukraine war has an outsized impact on Europe.\n\nSo we're seeing a little bit of a challenge there compared to the rest of the world. And that's probably the only thing I would note geographically that we're seeing right now.\n\nShirish Jajodia\n\nThanks, Phong. Another one for you. It's good to see the continuation of your strong renewal trend. Are you seeing long-standing customers budget their MSTR spend any differently?\n\nPhong Le -- President and Chief Executive Officer\n\nYeah. You know, as I mentioned earlier, what I am seeing is a consolidation of I spend around the world, especially on to enterprise providers like ourselves. So less experimental tools, more and less departmental tools, more enterprise tools. So I am seeing -- and we are seeing customers reinforce their commitment to MicroStrategy over time, which has been a positive thing, and that manifests itself both in terms of renewal rates, but also in terms of customers migrating to cloud with us.\n\nMigrating to cloud is just another reinforcement and their belief in MicroStrategy and what we have to offer. So that our cloud subs billing was the strongest we ever had. I think part of that is because of the strength of our platform and all the investments we're making into R&D, and what I consider to be the right places that our customers care about.\n\nShirish Jajodia\n\nThank you. Next question. Can you comment on the wage inflation that MicroStrategy is seeing what levers do you have available to attract and keep talent, whether by increasing stock or cash comp or hiring internationally? And also, can you expand on the hiring goals in the short-term? Do you plan to make headcount changes due to the current macro environment? So a question for both Andrew and Phong.\n\nAndrew Kang -- Senior Executive Vice President and Chief Financial Officer\n\nThanks, Shirish. I can start with the first part of that question. I'd say wage inflation for us has been pretty consistent with the overall market. And I'd say that -- it's probably been the most competitive leading up to Q3.\n\nI feel like we're seeing competition for talent slow a with general recession fears and cost cutting in the overall technology sector in more recent months. I think we have used stock-based comp across our departments and geographies, which has definitely been a useful tool in retaining talent. I think the last thing I'd say, too, is just keeping in mind that MicroStrategy's talent base across the entire organization, including a very critical role such as in sales and in tech are extremely tenured and our attrition rates are trending, I'd say, lower than our internal targets in recent months.\n\nPhong Le -- President and Chief Executive Officer\n\nAnd the only thing I'd add is wage inflation is real. Competition for talent is real. It's improved a little bit like Andrew said, we also have folks, especially in our technology teams have been with the company five, tens, fifteen 20 years are years and quite loyal. – and we like to return that loyalty in terms of comp increases, stock-based comps.\n\nSo I think we're doing the right things there. I do think, going forward, given macro factors, given volatility, we need to be pretty smart about how we manage, how many more people we add to the organization. So we'll be pretty smart about managing our costs or trying to keep our costs relatively flat – on headcount. It's just the right thing to do, prudent thing to do with our business right now.\n\nShirish Jajodia\n\nNext question is for Phong again. Have you seen any changes in the competitive environment as vendors particularly on the private side look to bring down the cash burn?\n\nPhong Le -- President and Chief Executive Officer\n\nYeah. It's similar to the renewal question. I do think vendors – do you think customers are reducing the number of vendors. So we're on average before COVID, a large enterprise might have seven to 12 BI vendors.\n\nI think that number is cut in at least half – and again, that's generally a positive for us. So maybe their overall spend goes down, but their allocation toward MicroStrategy should increase over time. And that's the trend we're starting to see and a trend we hope to continue to see in the future. But we don't take for granted any of our customers, and we need to keep providing awesome product, awesome services, awesome support.\n\nShirish Jajodia\n\nNext question is for Michael. The broader crypto market and the underlying technology is constantly evolving. How would you characterize Bitcoin's performance relative to broader crypto space over the last quarter?\n\nMichael Saylor -- Executive Chairman and Co-Founder\n\nI think Bitcoins continue to strengthen for the past quarter against the broader crypto space. I think the market is getting more educated institutional investors are getting more educated. I think there is the momentum on the technology side is lurching away from the other cryptos toward Bitcoin. There's real explosion and enthusiasm in the Lightning community, and there are a lot of Lightning start-ups, Lightening incubators, there's more venture capital starting to look at lightening in particular.\n\nSo I think Bitcoin's technology story is improving. I think it's – and I think the story is an asset is also improving. We've got surveys that just came out from Fidelity and gray scale that, that show remarkable enthusiasm and interest among institutional investors for bitcoin and an expectation that, it will be part of their portfolio going forward, and those numbers have never been higher.\n\nShirish Jajodia\n\nNext question for Michael as well. Looking out two to three years, what are some of the positive catalysts we should look out for around broader Bitcoin adoption?\n\nMichael Saylor -- Executive Chairman and Co-Founder\n\nI think we're going to start to see more companies building it into their 401(k). There's like a 12-month delay there, but I think that integrating Bitcoin into traditional finance and traditional investment products is one. I think in time, we'll see a spot Bitcoin ETF and more ETFs and it will be built into more financial advisor type programs. That's the second.\n\nI think you start to see more large banks similar to BNY Mellon starting to offer crypto custody services. And either Bitcoin trading or Bitcoin custody or Bitcoin-backed loans. So as the traditional banking establishment embraces Bitcoin, I think that's going to be another milestone.I think we can see with the FASB process. They began to look at this in late 2020, mid-2021, and probably it will be late 2023, it will be fiscal year 2024 when the financial or accounting changes take place.\n\nSo there tends to be a two to four year delay in all of the institutional adoption of regulators, but once the momentum gets going, it continues. So the supportive actions of the CFTC and the supportive actions of the SEC and the supportive actions that have taken place at FASB will drive more supportive actions across the other regulatory agencies. I would expect when you start to see concrete guidance from the FDIC that will be another big milestone. And of course, we have a number of bills in Congress right now that would provide regulatory frameworks that would accelerate the institutional adoption of Bitcoin.\n\nI don't know of any legislation that would be viewed as negative for the asset class. So any of this work that's being done should be positive for the asset class. And so, all of those are the fundamental milestones. I think we keep our eye on.\n\nAnd of course, ultimately, the macroeconomic wind has a big impact. So when the wind is to our back, it's beneficial to the asset class when the wind is to your face and blowing at you, it's more of a challenge. But over time, these things go full circle.\n\nShirish Jajodia\n\nNext question is for Andrew, and this is regarding the overall Bitcoin investment decision. So can you please provide color on how you make the decision to invest in Bitcoin, whether from cash flows generated from software business or proceeds raised from capital markets activity. And are there scenarios such as more severe market downturn or other material changes to the business that could lead to you to tactically change your investment plan?\n\nAndrew Kang -- Senior Executive Vice President and Chief Financial Officer\n\nThanks, Shirish. I think the short answer is we consider all of the above. We have demonstrated that when we have excess cash from operations in any given quarter, those excess proceeds can be used to buy Bitcoin. We've done that in the past few quarters, as well as proceeds from larger capital markets activities, I think you can continue to expect the same pretty simple strategy going forward.\n\nIn terms of potential more severe macro downturn, I think we do not have any plans to adjust our Bitcoin strategy. We do, as we always have viewed our investment as a long-term view, importantly, through cycles, including the one we're in now, and we will continue to believe in that core principle.\n\nShirish Jajodia\n\nThanks, Andrew. Next question is for Phong. What is the impact of the macro conditions? Are you seeing new deals slowing within the space, or is it taking longer to get approvals? And has the macro environment -- is it impacted due to -- or has it impacted the cloud migrations?\n\nPhong Le -- President and Chief Executive Officer\n\nI don't think the macro environment, as of now, is causing fewer deals or fewer cloud migrations. But I think it's reasonable to say that our deals are taking a little bit longer. We're seeing some more delays at the end of the quarter, both with the net new deals, incremental deals and cloud migrations. I think companies, buyers are getting more skittish, which is why we just need to be thoughtful about what we expect in terms of growth but also in terms of our cost structure.\n\nAnd the good thing is, we have long-standing, strong customers, a great cloud business now, and so we're built to weather any macroeconomic changes, volatility, etc. But I think it's reasonable to think that there may be impacts over the course of the next year, and we just need to be thoughtful about how we grow our business and grow our cost.\n\nShirish Jajodia\n\nThanks, Phong. Next question is for Michael. Any thoughts on diversifying your Bitcoin strategy given the industry dynamics, for example, a lot of miners are struggling. Could MicroStrategy opportunistically look for returns through getting into mining, or are there any potential ways to exploit current spot price weakness other than just accumulating more Bitcoin?\n\nMichael Saylor -- Executive Chairman and Co-Founder\n\nWhen we started down this path, we are -- in the middle of this summer 2020, we announced we were going to consider all sorts of different treasury assets. We looked at equity. We looked at gold. We looked at any kind of crypto.\n\nWe considered bonds. We considered any kind of property investment. We settled upon Bitcoin as the strongest crypto asset at the time, and we said that we thought it was digital gold. And we've stuck with that strategy throughout the last two and a half years or so.\n\nAnd everything that has happened in the market so far, in my opinion, has strengthened the observation that Bitcoin is the strongest crypto asset. And in theory, the strongest form of property is a crypto gold that's constructed such that you can't make any more than 21 million gold bars and you can move it at the speed of light as many times as you want between all the computers on the planet. So what's happened over the last 24 months is, we're more certain than ever that, in fact, this is a strong $21 million capped asset. We've seen the growth and the maturation of the Lightning Network, which is which is causing us to conclude that, in fact, you are going to see billions of people able to move Bitcoin at the speed of light point-to-point between websites and computers and mobile phones.\n\nWhen we look at all the other investment options, and as people that follow me know, I've recorded hundreds of hours of analysis. I've recorded analysis on Bitcoin versus real estate property. We've analyzed Bitcoin versus gold. We've analyzed Bitcoin versus every other crypto asset.\n\nWe've analyzed bitcoin versus bonds. We've looked at bitcoin versus equity, and we've looked at Bitcoin. We've considered all of those, and our concludes Bitcoin is the Apex property and there's nothing better. Everything else that we could invest in would be dilutive versus bitcoin.\n\nWith regard to strategies, like do we want to be in a bitcoin derivative strategy. Are we going to buy or do Bitcoin mining or buy bitcoin miners or are we going to sell or trade derivatives or do something? We had the ability to pledge our bitcoin to many of these wildcat crypto banks in return for yield. But our view was, the heretical risk of transferring ownership or custody of bitcoin was better than the yield. And so, we didn't do it and of course, what happened is they all failed.\n\nAnd so, that was a good strategy. We also considered other strategies. But at the end of the day, it doesn't make sense to take any inevitable risk with any of those strategies compared to just taking the risk-free return on the bitcoin. So all of those other ideas complicate our strategy and create opacity and you end up just having this risk in your portfolio, you don't understand.\n\nSo we don't wish to take on that risk and we don't wish to convey that risk to our shareholders either. So our conclusion is that the best strategy for us is long bitcoin, only bitcoin as a digital asset and to the degree that we're going to look for returns in excess of the bitcoin return, and we have achieved that, as you could see from our numbers over the last two years on the slide I showed. The way we're going to achieve performance better than Bitcoin is through intelligent leverage when we have the ability to either convert our cash flows into Bitcoin and we do generate cash flow or if we can issue debt or equity under terms that we believe are accretive to the shareholders. And they don't introduce any undue risk or fragility to the balance sheet.\n\nSo I think you'll just see a very thoughtful execution of the levered long Bitcoin strategy. And we don't feel a need to reach for yield or try to juggle any other asset. We view that all these other strategies are dilutive to the Bitcoin strategy.\n\nShirish Jajodia\n\nGreat. Thanks, Michael. This brings us to the end of the time we had for today. So thank you, everyone, for your questions.\n\nThis concludes the Q&A portion of the webinar. I will now turn the call over to Phong for closing remarks.\n\nPhong Le -- President and Chief Executive Officer\n\nThank you, Shirish, Andrew, Michael. I want to thank everyone for being with us today and we appreciate your support. We're as enthusiastic as ever about both of our strategies, our enterprise software strategy and our Bitcoin strategy, and we'll continue to execute on both in the coming quarter. I look forward to seeing you again in 12 weeks.\n\nAnd I wish you all happy holidays and thank you all.\n\nDuration: 0 minutes\n\nShirish Jajodia\n\nPhong Le -- President and Chief Executive Officer\n\nAndrew Kang -- Senior Executive Vice President and Chief Financial Officer\n\nMichael Saylor -- Executive Chairman and Co-Founder\n\nMore MSTR analysis\n\nAll earnings call transcripts"
}