{
  "companyName": "Lowe's",
  "companyTicker": "LOW",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/lowes-low-q2-2022-earnings-call-transcript/",
  "content": "Lowe's (LOW -1.49%)\nQ2 2022 Earnings Call\nAug 17, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, everyone, and welcome to Lowe's Companies second quarter 2022 earnings conference call. My name is Rob, and I'll be your operator for today's call. As a reminder, this conference is being recorded. I will now turn the call over to Kate Pearlman, vice president of investor relations.\n\nPlease go ahead.\n\nKate Pearlman -- Vice President, Investor Relations\n\nThank you, and good morning. Here with me today are Marvin Ellison, chairman and chief executive officer; Bill Boltz, our executive vice president, Merchandising; Joe McFarland, our executive vice president, stores; and Brandon Sink, our executive vice president and chief financial officer. I would like to remind you that our notice regarding forward-looking statements is included in our press release this morning, which can be found on Lowe's Investor Relations website. During this call, we will be making comments that are forward-looking, including our expectations for fiscal 2022.\n\nActual results may differ materially from those expressed or implied as a result of various risks, uncertainties, and important factors, including those discussed in the risk factors, MD&A, and other sections of our annual report on Form 10-K and our other SEC filings. Additionally, we'll be discussing certain non-GAAP financial measures. A reconciliation of these items to U.S. GAAP can be found in the quarterly earnings section of our Investor Relations website.\n\nNow I'll turn the call over to Marvin.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nThank you, Kate, and good morning, everyone. In the second quarter, our total company comparable sales declined 0.3%, while U.S. comps increased 0.2%. For the quarter, Pro sales remained strong.\n\nIn fact, this is the ninth consecutive quarter that we've driven double-digit Pro growth. As a reminder, at Lowe's, 75% of our sales are driven by the DIY customer while 25% of our sales is from the Pro. And while underlying home improvement trends remain strong, our DIY sales were lower than expected in the second quarter and the first half of the year. As I mentioned on our previous call, the timing of spring disproportionately impacts DIY sales as many seasonal categories like lawn and garden are heavily concentrated in DIY.\n\nIn addition to spring arriving late, it also ended early, quickly moving from a cold winter to a hot summer in some regions. This showed in the planting season and pressured lawn and garden sales. Also, while we plan for a modest sector pullback this year as we lap outsized DIY consumer demand, we now believe that certain categories like patio and grills are disproportionately impacted by the unprecedented demand from 2020 and 2021. This unprecedented demand was likely fueled by the combination of three rounds of government stimulus, an increase in consumer savings rate, and a temporary shift away from spending on services toward spending on goods, including home improvement products.\n\nThese factors drove more discretionary purchases over the past two years then it was possible to precisely measure at the time. And some of you have asked whether we're seeing consumers trade down in their purchase activity. At this point, we are not seeing indications of material trade down. If anything, we're seeing the opposite with continued strong demand for our new and innovative products at higher price points.\n\nBill will provide more contexts on our customer spending trends later in the call. To summarize, our DIY trends, despite slower sales in select discretionary categories like patios and grills, the DIY customer remains resilient, which reflects continued strong home improvement demand trends. Now turning to Pro. We continue to outperform the market, delivering growth of 13% and 37% on a two-year basis.\n\nWe're particularly pleased with the momentum we're seeing with our Pro loyalty program, MVP's Pro Rewards, which is designed to make every Pro feel like an MVP regardless of the size of their business. Because time is money for Pros, one of the most valuable ways that we can serve them is by saving them time with enhanced fulfillment. Therefore, we are actively piloting convenient fulfillment options, including a new Pro fulfillment center in Charlotte, and gig network solutions that offer same-day delivery for both Pro and DIY. Joe will provide a further update on our strategic initiatives to improve Pro penetration later on the call.\n\nOn Lowes. com, sales grew 7% this quarter, representing a sales penetration of nearly 10%. We're continuing to invest in omnichannel capabilities because we believe there is still tremendous runway for further growth ahead. In Canada, Q2 performance lagged the U.S.\n\nAnd as a reminder, because our Canadian business is more heavily weighted toward lumber, it disproportionately benefited from record high lumber prices last year. Let me now discuss our operating performance for the second quarter. I'm particularly pleased with the operating discipline that we've developed across our business, which is demonstrated by our ability to improve operating margin once again despite lower sales. During the quarter, operating margin expanded 12 basis points, and we delivered diluted earnings per share of $4.67, which is an increase of nearly 10% versus last year.\n\nThe progress also reflects our team's disciplined focus on our perpetual productivity initiatives or PPI. Not only did PPI support our first half operating margin improvement, it will also help to drive operating leverage for the balance of the year and for the next several years. Joe will discuss the success of our PPI initiatives in more detail later in the call. Now I'd like to address some concerns that I've heard from our shareholders about the home improvement market.\n\nI want to begin by clarifying that the market dynamics that pressure the home builder are not necessarily the same market dynamics that pressure the home improvement retailer. At Lowe's, the three highest correlating factors of home improvement demand are home price appreciation, the age of the housing stock and disposable personal income. While housing turnover is important, it does not index at the same rate as home price appreciation, housing age and disposable personal income. And while we acknowledge that housing turnover has slowed, home prices and home equity remains at record highs, which gives customers confidence that they will get a return on the investment that they make in their homes.\n\nAnd also importantly, those homes keep getting older. More than half of the homes in the U.S. are over 40 years old and millions more built at the peak of the housing boom in the early 2000s are now starting to turn 20 years old, which is a key inflection point for big ticket repairs. In terms of disposable personal income, household wealth is still at an all-time high.\n\nConsumer savings are roughly $2.6 trillion higher than they were pre-pandemic. And 75% of that excess savings is concentrated in middle- and high-income households who are more likely to be homeowners, which highlights another key benefit of our industry. Our core customer is the homeowner. In addition to having significantly more disposable income, most homeowners are benefiting from lower fixed mortgage rates.\n\nAnd as low housing supply and high-interest rates make moving less desirable, homeowners are motivated to invest in their current homes to fit their needs. This is one of the key reasons that home improvement can win in markets when housing turnover is strong and when it slows as we saw in the mid-1990s when home improvement spend grew despite rising interest rates and a slowdown in housing turnover. Now shifting to trends in Pro. We continuously survey our Pros and their confidence in their job prospects is the highest it's been in years.\n\nThe Pro is busier than ever, and the strength of the Pro backlog speaks to the significant pent-up demand for their services. In short, we are fortunate to operate in this retail sector and despite the macro uncertainty and unprecedented seasonal demand in the past two years, our long-term outlook for the home improvement industry and the Pro customer remains positive. As I close, I would like to personally thank our associates for their hard work and dedication. In recognition of some of the cost pressures they are facing due to high inflation, we are providing an incremental $55 million in bonuses to our hourly frontline associates this quarter.\n\nThese associates have the most important jobs in our company, and we deeply appreciate everything they do to serve our customers to deliver a best-in-class experience. And with that, I'll turn the call over to Bill.\n\nBill Boltz -- Executive Vice President, Merchandising\n\nThanks, Marvin, and good morning, everyone. In the second quarter, U.S. comparable sales were up 0.2%. I'd like to walk you through the trends that we are seeing in the business, beginning with our DIY results.\n\nAs Marvin mentioned, we had a short spring moving directly from winter to summer in many areas of the country, impacting demand for outdoor garden products like fertilizer, chemicals, and live nursery. After two years of outsized growth in home-related sales, we plan for sales to slow in certain categories this year. And our disciplined planning process enabled us to mitigate many of the inventory pressures you're seeing across the retail industry. But certain categories were still down more than expected, like patio furniture and outdoor grills, which is consistent with trends across the broader market.\n\nBut even within patio, our newly designed Origin 21 items sold out first in most stores, like our exclusive Benfield ag chair that retailed at $628. Another interesting trend from the quarter is the ongoing demand for innovation, reflecting underlying consumer strength. Rather than seeing trade down, in many cases, we are seeing customers trade up, spending more to purchase the latest technology like battery-powered products available in the EGO, Kobalt, Craftsman, and Skill brands. In fact, one of our top-performing products this quarter was an EGO 56-volt self-propelled mower that retailed for over $700.\n\nThis unit dramatically outperformed our sales forecast despite being one of the most expensive battery mowers in our assortment, proven what we have said before that value doesn't have to be low priced. In refrigeration, we continue to see consumers trade up to higher-priced products in brands like KitchenAid, Samsung, and LG, with features and benefits that serve a busy family's lifestyle. And while client sales were below our expectations, we continue to take incremental share and lead the market as the number one appliance retailer in the U.S. We also continue to source new products that make projects easier for our DIY savvy customers, like our expanded STAINMASTER lineup, including laminate flooring, sheet vinyl, and tile which are getting overwhelmingly positive customer feedback due to how easy they are to install and keep clean.\n\nOr how about our new BUILD and BATTEN product, a Lowe's exclusive. This new pre-sized and miter molding makes it easy and cost-effective for the do-it-yourself or to do highly intricate designs like wanes coating. And for the Pro, it saves them time on these jobs as well. Customers can transform a wall in a day for less than $300.\n\nAnd across the store and within each of our merchandising categories, we offer value at all price points and feature leading products from our all-star brands like Trex, Owens Corning, John Deere, EGO, Honda, KitchenAid, Samsung, LG, Kohler, Moen, Whirlpool, Husqvarna and Aaron's. Shifting gears now to our Pro customer, we delivered broad-based and strong results with positive comps across rough plumbing, building materials, paint, electrical, millwork and hardware. We are pleased with the traction that we are making with this important customer and we continue to optimize our Pro assortments to ensure we offer the products Pros need from the brands that they know and trust. This quarter, we launched EdenCrete, a liquid additive that improves the quality, durability and sustainability of concrete projects.\n\nWe also launched the new stack lithium battery technology in our line of FLEX cordless power tools, making Lowe's now the only destination to have this new battery technology available in both FLEX and Dewalt, which brings more power in a smaller package. And in millwork, we also were the first to market with our own reliable stock exterior black trim vinyl window, an increasingly popular trend to give homes a more premium look, with some Pros even buying pallets of these products before they even hit our shelves. We also added JELD-WEN prefinished interior doors, which come pre-painted from the factory, saving Pros the time and expense required to paint the door. These additions have further strengthened our portfolio of trusted programs like Bosch, Crescent, Dewalt, Eaton, Estwing, FastenMaster, FLEX, GRK, ITW, Lesco, Little Giant, Lufkin, Mansfield, Marshalltown, Metabo, SharkBite, Simpson Strong-Tie, SPAX, Spyder, and Werner.\n\nIn our lumber business, comps declined modestly as we cycled over record high prices in the previous year. However, unit volumes were up significantly year over year, which reflects the strong underlying project demand. Turning now to Lowes.com, sales grew 7%, building on top of the tremendous growth we have seen over the past few years. We continue to invest in the online user experience by expanding and enhancing our assortments, building out and improving our visualizer and configurator tools, and enhancing the delivery experience to make it easier for our customers to track their orders.\n\nAs I close, I'd like to thank my entire merchandising team, along with our finance, inventory, and supply chain teams for their disciplined inventory management and planning process in a complex retail environment. And lastly, I'd also like to thank our vendor partners for their continued partnership and hard work to ensure our customers have the products they need for every home improvement project they tackle. Thank you and I'll now turn the call over to Joe.\n\nJoe McFarland -- Executive Vice President, Stores\n\nThank you, Bill, and good morning, everyone. Let me begin by expressing my appreciation for our associates. They delivered strong customer service and profitability this quarter due to their commitment to our perpetual productivity improvement initiatives or PPI. Over the first half of the year, we have made meaningful strides.\n\nI'd like to spend some time now discussing what we are focused on for the remainder of 2022, including how we continue to simplify our store processes. Earlier this year, we launched what we call Project Simple in our stores, one of our many PPI initiatives with a focus on further reducing daily duplicative tasks that distract from customer service and drive needless expense. In fact, as we continue rolling out Project Simple, we expect that it will eliminate over 80 nonproductive hours per store per week in the second half. In February, I discussed the launch of our game-changing, new store inventory management system, or SIMS.\n\nWhile we are just six months into the implementation, we are already seeing strong results. With the improved inventory visibility, we are reducing nonproductive hours the associates spend searching for product while also improving the customer shopping experience in-store and online. And in the second half, we will leverage SIMS for an exciting new feature, prescriptive pack down. This new process will provide specific down-stocking instructions to our associates based on sell-through rates.\n\nSo, they know whether the product needs to go directly onto the shelf or the end cap bypassing the top stock altogether. This drives a more efficient, proactive replenishment and inventory planning process. As these examples illustrate, PPI is not a static set of initiatives that will expire at a predetermined date. PPI's perpetual process of ongoing initiatives that will continue to deliver productivity, not only in the second half, but for many quarters to come.\n\nNow shifting our focus to the Pro. We continue to deliver incredible results with Pro comps of over 13% in the quarter. In fact, this is the ninth quarter in a row that we have driven double-digit Pro comps. Even in a quarter that is traditionally our most DIY-heavy, we saw Pro penetration of over 23% in the U.S., an increase of over 500 basis points from 2019.\n\nAnd we are further enhancing our Pro offering with our new MVPs Pro Rewards and partnership program. This Pro loyalty program launched in the first quarter, and it continues to outperform our expectations. In July, we launched MVP's bonus points in conjunction with our first-ever Lowe's MVP bonus days event with a focus on the products that Pros use every day. Pros earn extra bonus points on our leading brands such as Dewalt, Valspar, FLEX, Metabo, A.O.\n\nSmith, and Frigidaire. Our Pros can redeem their points for other products or gift cards in the MVP Pro Reward Center. It is their choice, and we made it easy for all Pros to benefit. As our MVP's Pro Rewards program continues to mature in the second half, we are excited to present our Pros with compelling offers that will be tailored just for them.\n\nBefore I close, let me discuss the investments that we are making in our most important asset, our associates, as we strive to become the employer of choice in retail. We recently announced expanded scheduling options for our full-time associates. Most full-time associates can now request a fixed four-day work week, fixed days off or even choose their preferred shift providing them with predictability on their terms. This is a significant improvement in our associates' quality of life, and it is another way that we are differentiating ourselves from other retailers.\n\nAs Marvin mentioned, to help our frontline hourly associates during this period of high inflation, we are awarding an incremental bonus of $55 million. Also for a designated time frame, we are providing our associates with an additional 10% discount on everyday household and cleaning items. Associates can now purchase these products at a 20% discount, which we hope will ease the burden of inflation impacting many of these items. We will continue to look for meaningful ways to improve our associates' work-life balance, while providing them with the tools to build a career at Lowe's.\n\nI would like to thank our associates once again for their commitment to Lowe's and to our customers. Now, I'll turn the call over to Brandon.\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nThank you, Joe. Let me begin with our Q2 results. We delivered diluted earnings per share of $4.67, an increase of 9.9% compared to prior year as we drove productivity in a dynamic operating environment. Q2 sales were $27.5 billion, with comparable sales down 0.3%.\n\nComparable average ticket increased 6.1% as higher Pro sales and product inflation drove higher average ticket. This was offset by comp transactions declining 6.4% as we cycle over two years of outsized growth in DIY sales. Comp transactions improved over 650 basis points sequentially from Q1. U.S.\n\ncomp sales were up 0.2% in the quarter. Our sales were impacted by the shortened spring season, lower demand in certain DIY discretionary categories and lower-than-expected lumber prices. This was partially offset by a 13% increase in Pro customer sales. On Lowes.com, sales increased 7% in the quarter.\n\nOur U.S. monthly comps were down 1.5% in May, up 0.9% in June, and up 1.1% in July. Gross margin was 33.24% of sales in the second quarter, down 54 basis points from last year. This is consistent with the expectations that we discussed in May.\n\nAs expected, product margin rate was down 35 basis points versus the prior year. Lumber prices declined significantly from late April through mid-June. As we sold through our higher-cost inventory layers, product margin rate was pressured. Higher transportation costs, both import and domestic as well as the expansion of our supply chain network, also drove 35 basis points of pressure.\n\nAdditionally, we experienced 10 basis points of shrink pressure largely due to live goods damaged by unseasonable weather. These impacts were partly offset by 30 basis points related to more favorable product mix. Despite the product cost pressures in the quarter, gross margin for the first half was up slightly compared to the first half of 2021. This reflected our ability to effectively navigate a volatile lumber market over the first half of the year as well as product cost inflation.\n\nI'm very pleased with the strong cross-functional collaboration from the teams as well as our diligent planning efforts. SG&A of 16.22% levered 80 basis points relative to Q2 2021. We drove substantial productivity across the enterprise in the quarter against slightly lower sales. Operating profit was $4.2 billion, up slightly versus the prior year.\n\nOperating margin rate of 15.39% of sales levered 12 basis points as SG&A leverage was partly offset by lower gross margin rate. The effective tax rate was 24.5%, in line with prior year. Inventory ended the quarter at $19.3 billion, up $2 billion or 11.6% from Q2 last year driven by product cost inflation of 15%, while units were down low single digits. This morning, we are affirming our full year 2022 financial outlook.\n\nWe now expect that our 2022 sales will be near the bottom of our range of approximately $97 billion to $99 billion for the year, representing comparable sales toward the bottom end of the range of down 1% to up 1% for the year. This reflects our first half results and our second half expectations of continued Pro momentum and improving DIY sales trends. We continue to expect Pro to outperform DIY for the remainder of the year. As a reminder, our 2022 sales outlook includes a 53rd week, which equates to approximately $1 billion to $1.5 billion in sales.\n\nWe continue to expect gross margin rate to be up slightly as compared to the prior year. Given our better-than-expected flow-through in the first half, we now expect operating margin to be at the top end of our range of 12.8% to 13% for the full year. Our ability to lever gross margin and SG&A despite lower-than-expected sales reflects the Company's focus, hard work and effective investments over the last several years. Taking all of this into consideration, we now expect diluted earnings per share for the year to be at the top end of the range of $13.10 to $13.60.\n\nAt Lowe's, we remain committed to our best-in-class capital allocation strategy. For 2022, we continue to expect approximately $2 billion in capital expenditures and $12 billion in share repurchases. Finally, we are affirming our outlook of return on invested capital above 36% for the year. Turning to our shareholder-focused capital allocation strategy.\n\nIn Q2, the company generated $2.7 billion in free cash flow. And through a combination of both dividends and share repurchases, we returned $4.5 billion to our shareholders. During the quarter, we repurchased 21.6 million shares for $4 billion. We also paid $524 million in dividends at $0.80 per share, and we announced a 31% increase to $1.05 per share in support of our 35% target dividend payout ratio.\n\nCapital expenditures totaled $344 million in the quarter as we invest in the business to support our strategic growth initiatives. We continue to make progress toward our target of 2.75 times adjusted debt-to-EBITDAR, ending the quarter at 2.23 times, and we remain committed to maintaining our BBB+ rating. Finally, we delivered return on invested capital of 34.5% in the quarter, up 548 basis points versus last year. As I look ahead, I'm highly confident that we are making the right investments in our people and capabilities to support our business and drive meaningful long-term shareholder value.\n\nAnd with that, we will open it up for questions.\n\nOperator\n\nThank you. [Operator Instructions] Our first question comes from the line of Simeon Gutman with Morgan Stanley. Please proceed with your question.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nSorry. Good morning. My first question is DIY comps are negative and units are down. The units appear to be bottoming or still decelerating.\n\nAnd do you have a view if we rebaseline this year or there's more to go in '23?\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nYes. So, Simeon, this is Brandon. Just as we look at DIY specifically, the business was heavily weighted to DIY seasonal in the first half of the year. I think, underperformed a bit just due to the weather, the pull forward that we mentioned in patio and grills.\n\nSecond half of the year, transitioning more to the core the interior of the store, and in particular, post July 4th, over the last six weeks, we've seen continued momentum building in these categories. We've seen a clear step-change in the business, one- to three-year comps improving, again, in particular, in Pro and core interior. And then, I'll point back to transactions, Q1, Simeon, down 13. We saw improvement in Q2 down six.\n\nSo, we like the momentum we're seeing and optimistic around the step-changes again that we're seeing in the second half.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nSimeon, this is Marvin. I think it's important to note that when you look at the first half of the year, the first half is obviously more seasonal. And so we had weather impacts that drove a lot of our negative units, if you think about outdoor lawn and garden, chemicals, etc. And then if you think about what we talked about the unprecedented demand we saw the last couple of years in some of these DIY discretionary categories, specifically, patio and grills.\n\nWe're not going to experience the seasonality of the business in the second half of the year, and we're not going to experience that unprecedented overlap in those two highly seasonal discretionary categories.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAnd maybe, Marvin, if I can ask you a follow-up. I know we have this Analyst Day later in the year, and you're coming off of a couple of years of historic top-line growth, and you've been able to get to margin goals much faster. Do you sense or do you feel that these gains keep going as long as sales productivity keeps rising? Or do you feel like there's any part of you that says, hey, we could pause, reinvest, and then we can even drive faster growth in the out years?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nSimeon, it's a really good question. I think it depends on the financial category. So I'll remind you that home improvement is a $900 billion marketplace. And I think it's easy to just focus on the two largest players and determine the overall market share gain just based on that, but this is a really fragmented marketplace.\n\nSo on the revenue side, we absolutely believe that we have an incredible wrong way to continue to grow, just focus specifically on the fact that our Pro penetration is hovering around 23% to 25%. And we know we can get that number significantly higher. Now the good news is, as Joe mentioned, is increased 500 basis points since 2019. So, on the sales revenue side, we think we have an incredible opportunity to continue to grow.\n\nOn operating margin, I mean, we said consistently that 12% was not a plateau. It was a baseline. Now we're going to say the same thing about 13%. We think when we hit that plateau, it's just going to be another baseline that we can continue to grow from.\n\nJoe talked about the importance of our PPI initiatives that is not a static list, but this is something that we see benefit in future quarters and candidly future years. So in both those areas, we think that we have room to grow, and we look forward to providing a very detailed outlook at the December conference.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThanks, everyone. Good luck. Thank you.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nNext question comes from the line of Kate McShane with Goldman Sachs. Please proceed with your question.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for taking our question. We wondered if you could talk a little bit more about your inventory composition cost per unit versus units? And then this inventory seemed to be lower than your competitor.\n\nJust what is your view on current in-stocks? And are you chasing any categories?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nSo, Kate, I'll take the first part of that, and I'll let Brandon and Bill jump in. I would say, first and foremost, I am extremely pleased with the disciplined collaboration and planning that's taken place to put us in a really good inventory position vis-a-vis the retail industry. Any time you could have units declining in this environment with supply chain constraints and just incredible difficulties in forecasting, it points to a lot of hard work. So, the headline is we feel really good about our current inventory position, and we feel good about our in-stock position in the second half of the year versus last year.\n\nSo I'm going to let Brandon talk a little bit about the financial expression and I'll let Bill talk about where we are and where we feel like that we're in a much better position versus what we've been in past years and past quarters.\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nHey, Kate. This is Brandon. The only thing I would add in the prepared remarks, we talked about units being down. I think it has allowed us to make the needed investments, in particular, in the Pro space as we've seen momentum there.\n\nTo continue to support demand, we've had improved in-stocks in certain areas that we struggled a bit through the pandemic. So as Marvin said, really pleased where we are from an inventory position. We're managing seasonal just like we would every year and stock levels are better than they've been here over the last two and a half years. And any expected exit of seasonal fully included in the margin expectations that we have for second half.\n\nBill Boltz -- Executive Vice President, Merchandising\n\nAnd Brandon, the only thing I would add is that the quality level of the inventory is good, although there are still categories across the store that we want to see improvements in. And so, we're continuing to work with our vendor partners to do that, working with our supply chain teams in order to expedite that product to the store into the shelf and the teams are working on those. And -- but the quality level of inventory this year versus last year is dramatically better than it's been.\n\nKate McShane -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from the line of Peter Benedict with Baird. Please proceed with your question.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nHey, guys. Good morning. First question, just like the operating agility you guys have shown has been impressive, clearly. How do you ensure you're not sacrificing service levels as you manage these SG&A dollars? Any metrics that you can share that maybe give you confidence that service levels in the stores are still holding up?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nPeter, it's a really good question. Obviously, we pay very close attention to what we describe as service levels versus as task levels. And the thing that Joe and the store operators have done an incredible job is investing in service while taking hour away from tasks. So when you see that SG& A leverage, it's not like the old days where you just kind of rip pay roll out and you risk service.\n\nWhat Joe and his team have done a masterful job of is pulling our hours away from non-customer-facing parts of the store, taking some of those dollars to the bottom line, but then reinvesting dollars on the service side. So I'll let Joe give you some specifics. But the headline is likelihood to recommend up for both DIY and Pro in the quarter with SG&A leverage, and that is not easy to do. So, Joe, you could provide some detail.\n\nJoe McFarland -- Executive Vice President, Stores\n\nThanks, Marvin. And listen, I think it goes back to the focus that we've had on our associates. And again, with the PPI initiatives, we're moving unnecessary daunting tasks replacing them with and just enabling the associates' time on the floor to be more productive. We've done things, the flexible scheduling.\n\nWe've talked many times in the past about our new labor management engine. And so, as we continue moving forward, we measure every single day, every single week, and we're very pleased with the progress we've made both in the operational expense and the customer experience.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nThat's helpful. That's great. Thank you. And then just I guess -- next question would just be around what kind of metrics do you guys watch internally that would maybe signal to you maybe a softening of demand, whether it'd be Pro or DIY relative to trend? Are there any categories? Are there any behaviors? I know you're watching it constantly.\n\nBut just curious kind of what you have your eyes on as you kind of navigate this volatile environment. Thank you.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nLook, as you can imagine, there are quite a few things that we look at. And I think the thing that I'm most pleased with, when I look around the table, of my team is there's a lot of experience, a lot of people who live through quite a few different iterations of macro slowdowns in the home improvement space. So we have some pretty effective playbooks on the merchandising side, on the store operations side, on managing cost and inventory. I think it's one of the reasons why we've demonstrated quite a bit of agility in some of these unique times.\n\nHaving said that, I'll let Brandon give you a little bit of the things that we look at just to make sure that we have our fin on the pause of the health of the business.\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nYeah, Peter. I would just call out just in this dynamic environment, I think really important for us to look at unit trends in particular. So between the merchant teams, the finance teams, week in, week out, we're down at a very detailed category assortment level. We're looking at one-, two- and three-year trends and what -- how much of the business is being driven by inflation, ticket, the offset, how much we're driving in terms of units and demand.\n\nWe've mentioned some of these categories in seasonal where we've seen units get back to pre-pandemic levels. We talked about patio and grills. So starting to understand and get comfortable and the flip side is we're seeing great unit growth in other areas like the Pro business that we want to continue to feed. So looking across the assortment, looking at those impacts, how that impacts inventory replenishment ordering and the drivers of the business teams are really focused on that.\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nOK. Great. Thanks so much, guys. Good luck.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nThanks.\n\nOperator\n\nOur next question comes from the line of Steven Forbes with Guggenheim Securities. Please proceed with your question.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nGood morning. I wanted to start with the Pro. So Marvin or Joe, you mentioned Lowe's MVP loyalty program, and I realize it's new, but curious if you can note what tier the majority of your Pros sit in today and whether you saw any sort of early signs of Pros gearing up during the quarter as we look out to the back half?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nHey, Steve. So let me just -- I'm not going to answer that question specific, let me say that first. So but I'll give you just some thoughts on the Pro loyalty program. We talked about the 30% comp growth in Pro and 37% growth on a two-year basis.\n\nAnd we think that the foundation of what's driving that is really monetizing the investments we've already made from a service staffing and technology. I think the second reason why you're seeing growth is the investment in brand that Bill talked about in his prepared comments, and that's an ongoing process. Fulfillment is improved as a third kind of component of improvement. And we know that we have work to do to continue to make fulfillment easier for our Pro customers.\n\nAnd that's one of the things that, as I mentioned, that we're piloting a fulfillment center gig network, and we're excited about the possibilities. And then the last foundational point is what you asked is loyalty. And we think our new MVP program is incredibly successful in the early stages. And so, how do I define that? Customers that are engaged in Pro loyalty and credit spend three times more than Pros that don't.\n\nI mean, to me, that's the key metric that we look at. Do we understand the level of Pros that's tiering up we do, we don't want to discuss that externally. But what I will tell you is all the events that we've launched this year, leveraging points and Pro loyalty have exceeded our expectations, and we have a lot more to come. And we'll provide some level of granularity in the future, but it's too early to share it externally, but I will tell you that we're pleased with the progress.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nI appreciate the color, Marvin. And then maybe just a quick follow-up for Brandon. Based on the gross margin guidance, it sort of implies a relatively flattish outlook for the back half. Clearly, we got the supply chain build-out and transportation cost pressure.\n\nSo maybe there's any help on the offset if it's from mix or just product margin strength?\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nYeah. We have -- we feel like we have a pretty good handle on the gross margin drivers of the business here over the second half. We expect modest product margin improvement, as you mentioned, offset by higher supply chain costs. That's inclusive of distribution, transportation.\n\nWe mentioned the drag in Q2 and the expanded network. Shrink credit, fairly neutral as we look across the second half as it relates to other contributors to margin. So full-year unchanged as it relates to guiding to slightly up from a gross margin standpoint. We feel really, really good about our ability to deliver that.\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nThank you.\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nOur next question is from the line of Scot Ciccarelli with Truist Securities. Please proceed with your question.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nGood morning, guys. So another DIY question. I know you bounced around this a little bit, but we -- the cycling of little bit, but we -- the cycling of is, what gives you confidence that the softer trends you've seen in DIY over the last few months, isn't the beginning of the slowdown following several years of accelerated demand?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nIt's a fair question. So, Scot, I'll take the first part, and I'll let Brandon provide some context. So when you look at DIY and you look at the first half, I think it's important to understand that a lot of the negative impacts have been relatively isolated in discretionary categories. We talked a lot about patio and grills.\n\nBut candidly, for the last two or three years with the lack of mobility that we've all had and the amount of time we spend at home, once you make an investment for patio furniture and grill is really not an overriding demand to do it again a year or two later, and we understand that. And also, we talked quite a bit about the shortened weather season of spring and how that put a lot of pressure on lawn and garden outside categories, and that's almost exclusively for us, DIY-specific. So when we try to put in characterization, what drove the DIY slowness in the first half, we can be very specific on that. But as we look at the back half, we know that a shift is coming based on our business trends.\n\nAnd I'll let Brandon just provide a little context on the trends we are seeing. And when we look to the interior of the store, what we believe will happen in the back half of the year.\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nYeah. So, Scot, I think confidence just given the first half isolated impacts that Marvin called out around the weather, the DIY discretionary, I mentioned earlier just momentum that we're seeing in the business, in particular post July 4th and again, looking at one-year and three-year comps, clear step-change that we're seeing in the business there. And then I think last, just as we look at the second half and the structural sort of setup of the business, it's less seasonal. It's definitely interior-focused as we get into the core categories.\n\nAnd we think that, just coupled with the momentum, again, that we're seeing with the Pro, we feel like that plays really well when we look at the second half outlook that we have on the business.\n\nJoe McFarland -- Executive Vice President, Stores\n\nYeah, Scot. Just add one thing to that. So in a recessionary environment, as you look at the DIY, that tends to shift more to the repair categories versus the big ticket. So, there's a lot of indicators out there that we watch on a very regular basis.\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nGot it. Thanks a lot, guys.\n\nJoe McFarland -- Executive Vice President, Stores\n\nThanks, Scot.\n\nOperator\n\nNext question comes from the line of Michael Lasser with UBS. Please proceed with your question.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. The lower the comp outlook to the lower end of the range, but articulated the view that your earnings will be at the high end of the range, how low could your comps be in the back half of the year and you still hit the EPS guidance for the full year?\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nYeah. So, Michael, this is Brandon. I would just tell you, we're very focused on delivering what the most likely scenario that we have with the business, which that's updated in our outlook. So, we're looking at top line being down 1%.\n\nWe're really confident given the ability to manage gross margin, the step-up that we're seeing with SG&A leverage, and how that's translating to profit expansion and EPS. Confident in that scenario, confident delivering on what we have in the guide, and that's where we are at this point in time.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nAnd Michael, this is Marvin. The thing that we often talk about internally is that, expense is typically relative to sales. And expense as a percent of sales and percent of revenue. And so, we have proven that we have levers that we can pull so that we can ensure that as revenue goes down, then we can, at the same point, bring our rate of expense down.\n\nAnd that's something that we feel very confident in our ability to deliver upon. And I think Q1 and Q2 of this year should represent that.\n\nMichael Lasser -- UBS -- Analyst\n\nOK. Thank you very much, guys. And my follow-up question is on the nature of where sales stands today versus where they were in 2019. Marvin called out patio furniture and grills as categories that have been well above the trend line in demand.\n\nSeasonal and outdoor is about 20 -- excuse me, 10% of the business, appliance is another 10% to 15% of the business. Is that the right way to think about the risk of those sales being kind of over-earning from the last couple of years? And how much risk is there that this above trend performance in those categories start to leak into other areas of the business, lighting, flooring, other areas that could be more episodic in nature?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nMichael, it's a really good question. I think you can appreciate that this has been one of the most difficult environments to forecast and to build any kind of consistent modeling on. So what I will say to you is we pay close attention to all the trends and we are obviously now looking at what we call pre-pandemic sale rates and understanding where we have reverted back by category to those pre-pandemic levels. And so we know where we are and what categories are in those specific run rates, and we know which categories are not.\n\nAnd our job is to pay really close attention to those merchandising categories to ensure that we're in a good insight position, that we have good presentation, that were priced right. And that's our best attempt to try to manage it. We'll have a much better answer for you as we wrap up the kind of the back end of the year. Because of the uniqueness of these overlaps, it's really tough to answer that question with any precision just coming out of the second quarter.\n\nMichael Lasser -- UBS -- Analyst\n\nUnderstood. Thank you very much and good luck.\n\nOperator\n\nOur next question is from the line of Eric Bosshard with Cleveland Research. Please proceed with your question.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nGood morning. Thank you. Curious for your strategy in regards to promotions and pricing as we move into the back half, considering what you're seeing with units and where you sit with inventory if you're changing relative to the first half?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nHey, Eric. This is Marvin. Short answer is no plans to change any of our philosophical approach to promotions and pricing. Our key is to be competitive.\n\nAnd again, we've invested in some sophisticated tools that give us real-time visibility to our competitors so we can be price right every single day. I'll let Bill talk more about his thoughts on promotion and pricing just to reinforce that we have a consistent philosophy that we plan to stick with.\n\nBill Boltz -- Executive Vice President, Merchandising\n\nYeah. Good morning, Eric, and thanks for the question. Just a couple of things and just a couple of reminders. We've been on this journey for our merchandising strategy, pricing strategy over really the last three-plus years.\n\nAnd that has the playbook that we're working to follow and really trying to unwind from what was a high-low pricing strategy to an everyday competitive price strategy. And so, the work that we've done between the merchants, the finance team to prop up, the resources to manage and monitor price on a daily, weekly basis is really allowing us to do that. And we feel really good about being very competitive, good line of sight on those key SKUs that matter. And then from a promotion perspective, it's all about being there when the customer expects us to be there.\n\nSo obviously, we've got Labor Day event coming up here in the next couple of weeks. You go into the holiday season, Black Friday. And so, we'll continue to supplement those events with key offers and be there with value for the customer and then work really hard to provide that value day in and day out in the store with the changes that we've made through our end cap strategies, flex strategies, etc.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nJust a follow-up within that. What have you seen when you have run events, you ran some July 4th events. And I'm just curious, have you seen different consumer engagement with promotions in this environment? Or now relative to the past, are these resonating? Again, I'm just asking, as you look at negative units and a bit softer sales and a bit more inventory. Historically, you promote more, I understand the new Lowe's is less focused on that, but is the payback from those things similar or different? Is the consumer responding similar, different on those?\n\nBill Boltz -- Executive Vice President, Merchandising\n\nYeah. I think there's a couple of things, there's -- first, there's a time and an opportunity to put stuff on value. And so if you think about first half of the year and you think about mulch and live goods promotions and those types of things that get the customer in the door and drive traffic, they play a certain role for us in the role of the category of certain merchandising businesses. And then you have new and innovation, as I said in my prepared remarks, where the customer is finding value in that.\n\nAnd a good example is that Eagle lawnmower that I talked about in my opening remarks, it's a $700 unit, and it was by far one of our best-selling products, best unit driving products in the assortment. So it's not low priced. It's not on promotion, and it was just out there and the consumer has adopted that battery platform, and they love the product. So, it's really a combination of both, and that's the blend that we're trying to manage.\n\nAnd in the appliance business, as you know, hundreds of thousands of appliances break every day. So, you've got to be out there with an offer in the appliance business day in and day out. So that's how we're playing it.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nEric, this is Marvin. And I really appreciate the question because we're in this unique environment with customer demand, especially coming out of that outsized demand in certain discretionary categories during the pandemic. So, we are closely monitoring any of our -- we call it, Tier 1 holiday promotions just to see our customers respond. The biggest difference at Lowe's today versus when I arrived about four years ago is that there is a rigorous analytical process that we go to coming out of all types of promotions just to look at, did we get the return on investment.\n\nAnd so, what we're not going to do, to Bill's point, is just kind of follow historical trends just because we're going to evaluate whether or not we got a return when the customer responded and we'll adjust accordingly. And we've been doing quite a bit of adjusting because the customers are responding differently because this is such a unique environment. But as I said earlier, we're anxious now look at the back half of the year, we feel good about the trends as Brandon outlined. We feel good about how the customer is shifting on the interior parts of the store because that's where we're really strong and we feel we're well-positioned.\n\nAnd we'll have a much better assessment looking at the full year going into next year relative to some of these customer engagements to some of these events.\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Christopher Horvers with J.P. Morgan. Please proceed with your question.\n\nChristopher Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks. Good morning, everybody. So my first question is also a follow-up on the DIY side. Marvin, there were some headlines that talked about the improvement continuing into August and Brandon's comments certainly echo that.\n\nHave you seen DIY flip to a positive trend? And then as a follow-up, last year, post Labor Day, you talked about that consumer coming back from sort of vacation and reengaging in DIY. So how are you thinking about the ability for that to sustain -- what you're seeing now to sustain against the step-up you saw last year?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nWell, I'll repeat what Brandon said. We've seen a step change post July 4th in our business, and that continues into the month of August. But it's early, but early means that the trends that we anticipated, we're seeing those trends, and we're seeing even better than we anticipated in certain categories. So that's a good news.\n\nBut I'll just let Brandon kind of reiterate why we have confidence in the DIY consumer as we look at the back part of the year.\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nYeah, Chris. I'm not going to get into too much detail just specifically on DIY comps. But I would say just a response, as I mentioned over the last six weeks, especially as we've moved more to the interior of the core, the DIY business within the home decor categories, I think, has been notable, and that's where we're seeing momentum. And then I'd also just call out there's other areas, lumber is going to be a mix between Pro and DIY, but sort of just given where pricing is at that point, too, we're seeing nice response there, and we're seeing activity that we continue to see momentum building as we get into August here.\n\nChristopher Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then some of the commodities of -- some of the input commodities for a lot of your products have come down recently. You've -- Marvin, since you came on board, you've introduced some very sophisticated pricing and cost deconstructing capabilities? How are you thinking about your intent in the near term to go back at the vendors from -- for some price rollbacks?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nWell, before Brandon was elevated to his more prestigious position, he did that work for us in merchandising with Bill. So I'll let him give you some specifics on that.\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nThanks, Marvin. So yes, Chris, I would say, just given rate tightening that we're seeing from the Fed, monitoring the commodity markets, we're definitely expecting some normalization as we move across the second half and into next year. We have built as Marvin has mentioned, the disciplined product cost management process. We feel like we have the insights to the cost drivers across our suppliers.\n\nWe understand where it's coming from in terms of commodities, labor, transportation. And as raw materials down, we're positioned and prepared to renegotiate prices with our suppliers. We're actually very much underway in certain areas with Bill and his team. And then from a pricing perspective, like we always do, we're going to leverage a portfolio approach if and when we call back the dollars, but we're always going to ensure that we're going to be competitive there as we approach pricing.\n\nChristopher Horvers -- JPMorgan Chase and Company -- Analyst\n\nThank you. Best of luck.\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nThank you.\n\nOperator\n\nNext question is coming from the line of Michael Baker with D.A. Davidson. Please proceed with your question.\n\nMichael Baker -- D.A. Davidson -- Analyst\n\nHi. Thanks. Maybe a follow-up. I did want to question the Pro business a little bit and two questions.\n\nOne, Pro business, up double digits for Pro, that's great, but it did slow a little bit from last quarter on a one-year and a two-year basis. So wondering what to make of that. And then these comments on this being a little bit better. I guess DIY, but any comment on how the Pro business is doing in the last six weeks or so? Thank you.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nYeah. Thanks, Mike. This is Marvin. We feel good about the overall sales volume in the Pro business.\n\nAnd as Joe noted, second quarter is typically our highest DIY penetrating quarter of the year. But when we look at the Pro business, we feel incredibly positive on the momentum and just the daily volume we're seeing across all geographies relative to what we were seeing two or three years ago. And we think it's very sustainable and it's proven to be. And we think as we get into the back half of the year with our new Pro loyalty program, with improved job like quantity in stocks with some of the brands that Bill outlined that we're going to see this momentum continue.\n\nAnd as I said, it's not just about Pro loyalty. Pro loyalty is one of the foundational pieces of the strategy in addition to all the investments we've made in the store, the brands, the fulfillment improvement. And also, just as a reminder, our U.S. reset project last year, literally improved all the adjacencies, specifically for the Pro customer, and we think those things are paying dividends.\n\nSo, that business is performing really well and is performing really well vis-à-vis the DIY and the same trends we're seeing post July 4th for DIY. Pro is also taking those we're seeing post July 4th for DIY. Pro is also taking those\n\nMichael Baker -- D.A. Davidson -- Analyst\n\nThank you. That's helpful. I appreciate the color.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nThank you.\n\nKate Pearlman -- Vice President, Investor Relations\n\nThank you all for joining us today. We look forward to speaking with you on our third quarter earnings call in November.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKate Pearlman -- Vice President, Investor Relations\n\nMarvin Ellison -- President and Chief Executive Officer\n\nBill Boltz -- Executive Vice President, Merchandising\n\nJoe McFarland -- Executive Vice President, Stores\n\nBrandon Sink -- Executive Vice President and Chief Financial Officer\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nKate McShane -- Goldman Sachs -- Analyst\n\nPeter Benedict -- Robert W. Baird and Company -- Analyst\n\nSteven Forbes -- Guggenheim Partners -- Analyst\n\nScot Ciccarelli -- Truist Securities -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nEric Bosshard -- Cleveland Research Company -- Analyst\n\nChristopher Horvers -- JPMorgan Chase and Company -- Analyst\n\nMichael Baker -- D.A. Davidson -- Analyst\n\nMore LOW analysis\n\nAll earnings call transcripts"
}