{
  "companyName": "Sumo Logic, Inc.",
  "companyTicker": "SUMO",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/25/sumo-logic-inc-sumo-q2-2023-earnings-call-transcri/",
  "content": "Sumo Logic, Inc. (SUMO 0.87%)\nQ2 2023 Earnings Call\nAug 25, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the Sumo Logic second quarter fiscal 2023 earnings call. [Operator instructions]. As a reminder, this conference is being recorded. I would now like to turn this conference over to the first speaker today, Bryan Liberator, senior director of investor relations.\n\nThank you, sir. You may begin your presentation at this time.\n\nBryan Liberator -- Director, Investor Relations\n\nThank you, and good afternoon, and welcome to Sumo Logic's second quarter fiscal 2023 earnings conference call. Joining me on the call today are Ramin Sayar, president and CEO, and Stewart Grierson, chief financial officer. Our format today will include prepared remarks by Ramin and Stewart, followed by a question-and-answer session. Some of our discussions and responses to your questions will contain forward-looking statements, including statements relating to the expected performance of our business, expectations regarding our platform and solutions, expectations regarding our go-to-market efforts, our future financial results and guidance, our growth, expense and investment strategies, our market opportunities, the potential impact of the macroeconomic environment and our overall future prospects.\n\nThese statements are subject to risks and uncertainties. Actual results may differ materially from our forward-looking statements. A discussion of the risks and uncertainties related to our business is contained in our filings with the Securities and Exchange Commission, including our risk factors filed with our most recent quarterly report on Form 10-Q and the risk factors that will be included in our Form 10-Q that will be filed subsequent to this call. Sumo Logic assumes no obligation and does not intend to update or comment on forward-looking statements made on this call, except as required by law.\n\nOur discussion today will include non-GAAP financial measures. These non-GAAP financial measures should be considered in addition to and not as a substitute for or in isolation from our GAAP results. Information regarding our non-GAAP financial results, including a reconciliation of our historical GAAP to non-GAAP results may be found in our earnings release, which was furnished with our Form 8-K filed today with SEC on our investor relations website at investor.sumologic.com. For certain forward-looking guidance, a reconciliation of the non-GAAP financial guidance to the corresponding GAAP measure is not available as discussed in detailed in our earnings release posted on our investor relations website.\n\nWith that, let me turn the call over to Ramin.\n\nRamin Sayar -- President and Chief Executive Officer\n\nThanks, everyone, for joining us today on our second quarter earnings call. We are pleased with the continued strength in our business as we once again exceeded our revenue guidance, while also delivering more efficient growth. In Q2, we delivered 26% year-over-year revenue growth and 25% year-over-year ARR growth. We complemented this strong top line growth with continued focus on managing our expenses and thereby delivering better-than-expected operating losses as a percentage of revenue in the quarter.\n\nWe will continue to focus on efficient growth as we drive toward cash flow breakeven and profitability in the future. We remain positive on the long-term trends driving our business, which are contributing to the strength we are seeing in our results. We believe we are still in the early innings of a multiyear growth cycle driven by digital transformation, cloud migration and security modernization. Companies are increasingly relying on digital services to help grow and operate their businesses, and we play a critical role in ensuring that these experiences are both reliable and secure.\n\nTurning to financial highlights. Total revenue was $74.1 million for the quarter. We continue to see healthy win rates with our customers continuing to increase their adoption and usage of our platform. We ended the quarter with 489 customers with more than $100,000 in ARR, representing a year-over-year increase of 19%.\n\nBefore I turn to some customer highlights, it's important to restate that our vision is to make the world's digital experiences, both reliable and secure. Our cloud-native platform uniquely helps customers do three things. First, ensure application reliability; second, secure and protect against modern security threats; and third, gain insights into cloud infrastructure. In addition to selecting Sumo for our leading cloud scale log analytics platform, customers are increasingly utilizing Sumo due to the breadth of both our observability and security suites.\n\nMore specifically, our Observability Suite helps customers monitor application and cloud infrastructure, troubleshoot and diagnose issues rapidly and improve the quality of software release and cycle times. In addition, our security suite helps customers with cloud structure and security monitoring, application workload protection, industry and regulatory audit and compliance, threat detection and investigation; and lastly, security automation and orchestration. With that, let me share some examples of how customers are using our platform with a few key wins for the quarter. These wins were fueled by both traditional companies migrating to the cloud and needing to modernize their tools and cloud-native companies expanding their footprint and usage of our platform.\n\nSimilar to prior quarters, I'll highlight various greenfield and legacy vendor displacement opportunities, whereby Sumo's SaaS-based analytics service was selected in order to help them more effectively compete, as well as advance their security and/or reliability capabilities. On the new logo side, we had multiple wins around the globe where we displaced legacy on-prem SIEMs. We continue to believe that this is a large opportunity for us. As customers begin their cloud migration journeys, they must also modernize their security tools because their existing on-premise tools are not capable of handling the complexities of cloud workloads, including the explosion of data and the increasing magnitude and frequency of sophisticated attacks.\n\nThe first win I'll highlight was a multiyear new logo deal with a TCV of seven figures with a multinational manufacturing company based in EMEA, with over 40,000 employees. They're in the midst of a large cloud migration initiative, and we're looking for a next-generation Cloud SIEM. During the proof of concept, our Cloud SIEM identified that they were subject to a cyber-attack, which immediately improved our differentiated platforms capabilities while their on-premise or other solutions failed. This is a great representation of the people, process and technology challenges faced by many organizations as they migrate to the cloud.\n\nNext, we saw good momentum with our emerging Fed business, including a seven-figure new logo. This customer was moving to the cloud and looking to replace its legacy SIEM as it was leading to continued failed audits and compliance issues. Their prior tool had resource constraints when being shared between the security and operations teams. Our SIEM was selected because of out-of-the-box capabilities and integrations for ease of use and quick time to value.\n\nAlso, our ability to automate the correlation and response to incoming threats helps alleviate practitioner fatigue and supplement potential labor gaps. This makes Sumo an easy decision for those moving to the cloud and modernizing their security tools. We're also seeing customers continue to expand their adoption of our platform as they recognize the benefits of using Sumo for additional teams and use cases. For example, our mid-market team had a six-figure cross-sell with a tech-focused telecommunications company.\n\nAs they are shifting more of their workloads to the cloud, their CISO recognize the benefits of having a single platform for both application reliability and security. And therefore, expanded their initial security analytics use case to now include logs, metrics and traces for full stack observability for their mission-critical applications. In addition to the technical benefits, this customer also valued our highly differentiated flexible credit-based licensing model, which allows them to cost effectively manage their use of Sumo across both security and observability. Shifting to our international theaters.\n\nWe had another strong quarter in APAC, including a six-figure cross-sell with a highly sophisticated global bank that has created a new virtual offering in order to improve their user experience to their customers. We initially landed with a monitoring and troubleshooting use case, then expanded to Cloud SIEM and most recently -- and expanded their usage for observability by 10 times. With Sumo, they are now able to gain valuable insights via dashboards, alerts and monitoring for each component customer journey within their new banking app, thereby allowing them to ensure their apps are both reliable, secure and of course, compliant. While this win is a great example of how our uniquely differentiated platform enables a cross-sell opportunity into another use case and organization, we also have a tremendous opportunity with customers to expand their existing use cases as they increase their adoption of our platform.\n\nOne of those upgrades was a seven-figure transaction from a company that is disrupting enterprise data management. They recently put a new customer-facing application into production. They're using Sumo for both Observability and security use cases by monitoring their service levels to ensure both application reliability and user experience in order to protect their revenue-generating apps. They're also using our platform to manage audit and compliance requirements while ensuring their customers' confidential data remains secure.\n\nLastly, we further extended their commitment to using Sumo because their data can vary between three terabytes and 10 terabytes a day, and our flexible credit-based licensing model was a perfect fit for the variability in their business. These wins highlight our large market opportunity, as well as underscore that our differentiated platform provides a unified and fully integrated SaaS solution for full stack Observability and security, resilience and unparalleled scale that can handle data volumes that modern digital applications generate. Patented analytics and proprietary machine learning for all types of data, namely unstructured logs, which is typically the largest data set output by modern applications. Cloud scale economics and value, supported by our tiered data architecture and flexible credit-based licensing model.\n\nAnd lastly, additionally, our service is one of the most audited and certified platforms for industry security and compliance regulations. Now, turning to some of the product highlights from last quarter. We are pleased to be recognized in the Gartner Magic Quadrant for APM and Observability as a challenger. Observability isn't new for us.\n\nIt's been core to our platform since day one based on our best-in-class log management, troubleshooting and analytics foundation. The addition of over the last couple of years of metrics, traces, real user and service level monitoring allows us to provide a full stack observability solution, and we're excited to receive this industry recognition. We continue to believe that logs are foundational to Observability as they are essential to diagnose and troubleshoot issues and ultimately provide a faster time to resolution. We'd like to also recognize that we are one of only a handful of vendors that are now in the Magic Quadrant for both APM and Observability, as well as SIEM or S-I-E-M.\n\nThis further validates our strategy of providing a unified platform for ensuring application reliability and security. Our security solutions received multiple individual awards in the quarter which include achieving AWS security competency for our Cloud SIEM and SOAR and Cyber Defense Magazine best solution for cloud security monitoring and best product security orchestration, automation and response. These accolades further acknowledge our leadership in modern cloud security analytics. Additionally, we've increased the depth of our offerings by announcing Threat Labs, a threat research and security detection unit.\n\nThis new unit was created to help customers modernize security operations and achieve greater cyber resilience by delivering a continuous stream of deep detection content, rapid response guidance and actionable best practices. For Observability, we also announced a new simplified experience to deliver Kubernetes monitoring and troubleshooting in just a few clicks. This enhanced solution streamlines the collection process and ensures faster time to value for Kubernetes observability and is very important as developers are at the heart of getting digital experiences into service. And now we are making it easier for them to ensure the reliability of those services as onboarding Kubernetes data into Sumo Logic has never been faster, smarter or more secure.\n\nWhile there were many other important enhancements we are very proud of, we will have more product updates to share at our annual global user conference, Illuminate, which will be virtual and running from September 13 to 14. And I encourage you all to attend. I'm extremely proud of the differentiated and highly recognized solutions that we have to offer in a single platform, and I feel that our platform has never been stronger. Now, I'd like to quickly give an update on where we are on our go-to-market team.\n\nLynne Doherty, our president at Worldwide Field Options, has now been on board for three quarters. Lynne has reshaped much of her leadership team, recruiting leaders that understand the rigor and discipline required to scale a global sales organization. She implemented the realignment of our sales teams into expansion and pursuit teams at the beginning of this fiscal year to drive more focus and continues to drive the changes needed to enable future scale and growth. Overall, we are pleased with the progress so far while recognizing that change in management takes time and that not all theaters or segments will progress at the same pace.\n\nIn summary, while the broader challenges in the macroeconomic environment create a higher level of uncertainty, we believe the need to deliver reliable and secure digital experiences for mission-critical applications will continue to be a top priority for our customers and the broader market. I'm very proud of our continued progress and results so far this year. Our executive leadership team and product portfolio have never been stronger, and we continue to deliver strong results on both top and bottom line. While we are well capitalized, we remain committed to more efficient growth as we continue to focus on managing our expenses and driving toward eventual cash flow breakeven and profitability.\n\nWith that, I'll turn it over to Stewart Grierson, our chief financial officer, who will provide more details on our financial results in Q2 and our outlook for Q3 and our fiscal year.\n\nStewart Grierson -- Chief Financial Officer\n\nThanks, Ramin, and thanks everyone for joining us on the call. I'd like to start with a brief summary of the financial highlights for the quarter and then go into more detail on each topic. First, as Ramin mentioned, we've continued to deliver strong results with year-over-year revenue growth of 26% and ARR growth of 25% while also delivering a material reduction in our operating losses as a percentage of revenue. Customers that generate more than $100,000 per year in ARR continue to be foundational to our top line growth.\n\nIn Q2, the number of $100,000 ARR customers grew 19% year over year. Second, we have continued our commitment to more efficient growth. Our Q2 operating margin was negative 17%, which was significantly better than the midpoint of our guidance of negative 23.5%. These strong results were driven by revenue outperformance in the quarter and lower expenses.\n\nWe are carefully scrutinizing our hiring and expense plans across all aspects of the business as we focus on driving operational efficiencies. As mentioned on our last call, we believe ARR is the best leading indicator of growth in the SaaS business. We ended the quarter with ARR of $286.2 million, representing 25% year-over-year growth. While we expect to continue to drive meaningful ARR growth this year, I want to remind everyone that the acceleration of our growth in the back half of last year makes for a tougher comparison the further we get into this year.\n\nAs expected, our dollar-based net retention was consistent at 115% for the second quarter in a row. This remains a significant improvement from the prior year as we improved both our expansion and retention rates. We don't expect any meaningful changes to our net retention rate for the remainder of this fiscal year. Turning to billings.\n\nCalculated billings for the trailing 12-month period was $309.4 million, up 24% year over year. Recall that we look at calculated billings over a trailing 12-month period as this metric can fluctuate from quarter-to-quarter due to the timing of our renewals and billings duration for larger customers. Moving to remaining performance obligation or RPO. We are continuing to see our cutters make larger commitments due to our differentiated multiuse case platform and flexible licensing model.\n\nThis quarter's RPO increased 23% year over year to $340.4 million, driven by the size and duration of new and expansion contracts. While RPO was sequentially down from Q1, this is a function of the timing of renewals with the prior quarter being positively impacted by some larger early renewals. This is similar to the dynamic we had last year at this time. Now, I'll review the income statement in more detail.\n\nAs a reminder, and unless otherwise noted, all metrics are non-GAAP. A reconciliation of GAAP to non-GAAP measures is included in our earnings release and posted on our website. As previously stated, total Q2 revenue increased to $74.1 million, up 26% year over year. We saw improved linearity in the quarter, helping deliver some of the upside to our guidance.\n\nQ2 gross margin was 70%, which was flat compared to the prior quarter. Our data consumption has continued to grow more than 50% year over year, which is consistent with our strategy of encouraging customers to ingest more data onto our platform. I want to remind everyone that we do not have a consumption license model. Our customers can take advantage of our flexible data tiers and credit licensing model to meet their business needs.\n\nAs they consume more data, they utilize more credits. However, the benefit to revenue trails the near-term impact on cost of revenue. Looking forward, we expect gross margins to remain in the low 70% range in the near term as we continue to execute on this strategy in order to drive further adoption of our platform. Longer term, we expect gross margins in the mid-70% plus range as we drive efficiencies in our hosting services.\n\nWith regards to operating expenses, we have reduced our original hiring plans and are carefully scrutinizing non-headcount-related spend as we focus on efficient growth and reducing our operating losses as a percent of revenue. This scrutiny is being applied across the company, and the results can be seen in improved operating ratios across sales and marketing, research and development and G&A. As stated previously, our Q2 operating margin was negative 17%, which was significantly better than guidance. Net loss in the quarter was $12 million or negative $0.10 per diluted share based on approximately $116.6 million weighted average diluted shares outstanding.\n\nTurning to our balance sheet and cash flow. We remain well capitalized as we ended the quarter with $350.6 million in cash and marketable securities. Free cash flow in the quarter was negative $12.4 million or negative 17% of revenue. As a reminder, we do not expect improvements in free cash flow to be linear as there can be variability from quarter-to-quarter based on collections and timing of payments.\n\nWe recommend looking at free cash flow and free cash flow margin on an annual basis. We believe that free cash flow is the leading indicator of leverage and profitability, and we expect to continue to deliver improvements in free cash flow margin as we focus on driving more efficient growth. Turning to guidance. As a reminder, we believe that it is more relevant to measure the growth of our business on a full year basis, given potential variability from quarter-to-quarter.\n\nI wanted to describe this quarter's guidance methodology in a bit more detail. While we did not see any meaningful changes in customers' buying behavior in Q2, we are operating in a period of greater uncertainty created by the macroeconomic environment. As a result of this uncertainty, we are taking a more prudent outlook for the back half of this year and in particular, Q4 and are only marginally increasing our annual revenue guidance despite the strong Q2 results. We started the year guiding annual operating margins to negative 26.5%.\n\nWe have delivered better-than-expected operating efficiencies in each of the first two quarters, and we'll continue to identify areas of opportunity for further improvements in the back half of the year. For the full fiscal year 2023, we expect total revenue of $289 million to $293 million, representing 19% to 21% year-over-year growth, non-GAAP operating margin of negative 23% to negative 22% and non-GAAP loss per share of negative $0.56 to negative $0.54, on approximately 117.5 million weighted average shares outstanding. For the third quarter, we expect total revenue of $73.5 million to $74.5 million, representing 19% to 20% year-over-year growth. Non-GAAP operating margin of negative 4% to negative 23% and non-GAAP loss per share of negative $0.15 on approximately 119 million weighted average shares outstanding.\n\nIn summary, we are pleased with our continued strong execution on both our top and bottom line priorities. I would also like to remind everyone that on September 20, we are hosting our first investor day at the NASDAQ market site in New York. We welcome you to join us in person or virtually to hear more details on our go-to-market and product strategies, as well as a more meaningful perspective on our ability to drive operating leverage over time. With that, Ramin and I are happy to take any of your questions.\n\nOperator?\n\nOperator\n\n[Operator instructions]. Our first question comes from the line of Matt Hedberg with RBC Capital Markets. You may proceed with your question.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nHey, great guys. Thanks for taking my questions. Congrats on a really nice quarter. Maybe for Ramin.\n\nIn your prepared remarks, you talked a little bit about Lynne and the changes that you've implemented. But maybe just double click on that a little bit more. I know it's a little bit more of a hunter farmer model today. I just wanted to get maybe a little bit better understanding with some of the changes there because it feels like there's certainly been an increase in consistency and acceleration in the business.\n\nRamin Sayar -- President and Chief Executive Officer\n\nSure, Matt, great to hear your voice. Well, logically, you need to sequence some of these changes as you're looking to scale up and scale out. So trade-off decisions are what new territories in existing theaters, how do we double down the new ones, how do we start to get the right profile reps for expansion versus pursuit while also bringing in new leaders that can hit the ground running. So we want to be cognizant of those changes and be cognizant of the spend associated with that as we're still trying to drive the execution of the coverage model, as well as naturally better efficiencies for the two sales teams.\n\nSo we're proud so far, and we have some more work ahead of us, but indicators are good.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nThat's great. Yes. Now, it seems like that in some of the wins that you highlighted. And then, Stewart, you mentioned when you were talking about guidance, you're taking a little bit more prudent view more so Q4.\n\nI just wanted to see -- to ask about August, I guess. I mean, are you seeing anything now? Or is it more just precautionary because of the headlines that we're all reading. Just wanted to get a sense for that -- for what drove that level of conservatism?\n\nStewart Grierson -- Chief Financial Officer\n\nYes, sure, Matt. So as we said in the prepared remarks, we actually didn't see any meaningful changes in our customers' buying behavior as we wrapped up the quarter. But at the same time, there's a lot going on from a macro perspective. And so, we did want to take a more prudent view just given the further out you look, the less visibility have in an environment like this.\n\nAnd so, that was the approach we took. But I'll reiterate, we didn't see any meaningful change as we closed out the quarter.\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nGot it. Thanks a guys.\n\nStewart Grierson -- Chief Financial Officer\n\nThanks, Matt.\n\nOperator\n\nOur next question comes from the line of Kamil Mielczarek with William Blair. You may proceed with your question.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThank you. Congrats on the strong quarter. So it's past earnings season. Several of your competitors have held out cost of weakness, whether across specific products or verticals.\n\nRamin, what do you think is unique about Sumo Logic that has made the business more resilient in recent months? And how sustainable do you think that is over the next year or so?\n\nRamin Sayar -- President and Chief Executive Officer\n\nWell, I can't comment on them, but what I can tell you is that what we provide is pretty simple. It's a necessity for any company trying to digitally transform, move to the cloud, get more efficient with how they actually build and run what we call reliable and secure digital assets. And so, it's a must-have versus a nice-to-have. Second thing I'll say is we saw a good contribution from, I would say, obviously, tech-savvy, leaning in digitally transforming companies, as well as those that are still embarking on that earlier part of the journey of moving to the cloud.\n\nSo we have not seen any slowdown in cloud migration. That complexity and disaster that they have on-prem is a great opportunity for us to go and help them get efficient as they move to the cloud.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThat's helpful. And just a follow-up. You've announced several acquisitions over the past year, DFLabs, Sensu and others. Stepping back a bit, can you tell us how you think about the decision to build versus buy? And given the decline in market valuations today and your large cash balance, how do you think about potentially making a more transformative acquisition? Or do you think you're more likely to make a regular cadence of tuck-ins?\n\nRamin Sayar -- President and Chief Executive Officer\n\nWell, I don't know if the valuations have adjusted enough in some of the private market, to be blunt. However, our strategy has been pretty consistent. We're looking at first and foremost, talent and people that we've brought in to expand and extend what we've been organically building out; second, we will look to continue to evaluate those as it pertains to our core markets, and that is obviously really around reliability and security. I can't comment on the future and what that holds.\n\nBut we have a lot in our product portfolio to go take advantage of into our installed base, as well as net new customers. So we're focusing on really integrating, driving more usability enhancements and simplifying the complexity for a lot of customers, other than legacy tools.\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nThat's helpful. Thanks again.\n\nOperator\n\nOur next question comes from the line of Pinjalim Bora with J.P. Morgan.  You may proceed with your question.\n\nRachit Agrawal -- JPMorgan Chase and Company -- Analyst\n\nHi. This is Rachit on for Pinjalim. So it looks like the net new ARR addition has declined for the quarter. Can you help us understand what's driving that decline?\n\nStewart Grierson -- Chief Financial Officer\n\nSure. This is Stewart. So I think Ramin touched on this in his -- in the opening response, right? So we've made a number of changes to go-to-the-market team, starting with the realignment among pursuit and expansion teams at the beginning of the year. And then, we have been up-leveling both leadership, so sequencing the up-leveling of leadership and then the account teams over time.\n\nAnd so, while we've continued to add capacity to the sales team, there has been a near-term impact on ramped capacity that we're working through as we make these changes.\n\nRachit Agrawal -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then, can you help us understand what traction are you seeing in the international market? And what is your investment strategy there?\n\nStewart Grierson -- Chief Financial Officer\n\nYes. So we continue to be happy with the traction we're having in international. We actually have revenue -- went above 20% internationally for, I think, the first time this quarter, and so we continue to see good growth in all those international theaters and are continuing to invest there.\n\nRachit Agrawal -- JPMorgan Chase and Company -- Analyst\n\nThanks.\n\nOperator\n\nOur next question comes from the line of Derrick Wood with Cowen.You may proceed with your question.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGreat. Thanks. Nice job on the quarter. Maybe I'll follow up on that line of questioning for Ramin.\n\nJust wanted to get a sense of what is working better, where you're feeling and seeing more strength when you look across enterprise versus mid-market or across security versus durability or maybe just geos? Anything you'd highlight that's really seen good growth durability and strength from you guys?\n\nRamin Sayar -- President and Chief Executive Officer\n\nDerrick, good to hear your voice, and thank you for joining us. Honestly, I think we had a strong contribution from both observability and security as I look at either new business or cross-sell and upsell. I would comment that there is quite a bit of pent-up demand with customers on their security challenges. And as they're moving to the cloud and how they could more efficiently deliver on the needs of the business, not just in security.\n\nAnd so, we saw a good example of that as one of the highlights of the customer wins where we landed in security and expanded into Observability and vice versa. So I think the platform approach that we've been talking about for a while, building out both these suites has put us in a very strong position. As we look at more of the international versus domestic, and Stewart commented on percentage contribution this past quarter, the EMEA theater and APAC theater was pretty good for us. And in both cases, some strong contribution for securities, so not just domestically.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGreat. Nice to hear. Stewart, real quick for you. Last quarter, you had said you thought ARR growth would exit the year a few points below the 27% in Q1.\n\nAre you updating that? Any new guidepost to give us for expectations on ARR?\n\nStewart Grierson -- Chief Financial Officer\n\nYes. Actually, Derrick, I'm not updating that. I mean I think it goes back to the approach we took on revenue guidance and taking a little more prudent stance given the uncertainty created by the macro. So decide not to update that commentary.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGot it. OK. All right. Thanks, guys.\n\nOperator\n\nOur next question comes from the line of Gray Powell with BTIG. You may proceed with the question.\n\nGray Powell -- BTIG -- Analyst\n\nOK. Great. Thanks for taking my question. Congratulations on the solid results.\n\nSo yes, a couple on my side. Maybe it's high level. And given your -- how much growth is coming from new versus existing customers? And then within your business, which of those two categories do you feel like would be more resilient in a recession?\n\nStewart Grierson -- Chief Financial Officer\n\nYes. So the easy way to think about that, Gray, is -- and I'll focus on ARR, right, because that was one of the things we did in the beginning of this year in terms of aligning the way we talk about ARR and our net retention rates. And so, both of those, obviously, we always look at it on a trailing 12-month basis. And so, the net retention rate was 115%.\n\nAnd if you look at the overall ARR growth of 25%, that kind of shows you that 15% is coming from the installed base and 10% is coming from new customers.\n\nGray Powell -- BTIG -- Analyst\n\nAll right. That's pretty easy. OK. So then yes, maybe it's another question.\n\nStewart, in one of our conversations a couple of months ago, you mentioned that you run smaller businesses or businesses that are smaller than Sumo Logic at higher margins. So can you just maybe kind of talk about what you see as some of the levers that you can pull to drive improved operating efficiencies? And is there any like low-hanging fruit that you see ahead of you?\n\nStewart Grierson -- Chief Financial Officer\n\nYes. I think, listen, I've been on board eight months now, right? And so we continue to look across the business for efficiencies. There's also the dynamic that I just want to remind you and everyone else on the call around where we were reaccelerating growth last year but had to reaccelerate the spend ahead of that and still had a strong run rate of expenses coming into this fiscal year. But as I said on the call, we are actually looking across all areas of the business.\n\nI can't say there's any sort of thing that I would point out that it is low-hanging fruit. But as we continue to scale, we'll look at candidly, all functions and focus on those areas where we're getting the better return for investment. As an example, on the sales side, while I talk about adding capacity, we're constantly looking at how is the sales team coming online? How is productivity improving and then shifting investments around where it's working more strongly than other areas which perhaps need some more work. So it will be an ongoing effort.\n\nIt'll be a multiple-year effort of continuing to drive efficiencies over time. But no low-hanging fruit that I would call out.\n\nGray Powell -- BTIG -- Analyst\n\nUnderstood. OK. Thank you very much.\n\nOperator\n\nOur next question comes from the line of Sanjit Singh with Morgan Stanley. You may proceed with your question.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThanks for taking my question. Congrats on not just this quarter's results, but kind of a strength of very consistent execution. So congrats to the team. My question was around the security opportunity.\n\nI was wondering if you could talk about historically how has the company's relationship been with the SOC team in terms of that being a key-buying persona. How is that -- what does that look like a year ago, you obviously made a lot of investments to bolster the security portfolio. You're sort of standing with the SOC team as they look to modernize, where would you assess you are today with that? And what do you think you can go with that buying persona?\n\nRamin Sayar -- President and Chief Executive Officer\n\nVery intuitive question, Sanjit, and good to hear your voice. Unfortunately, the SOC team is struggling probably and arguably more than other security professionals. I could say because there's a few short -- obviously, the labor shortage and they're being inundated with so many false alarms or false positives. And so, we've been focused for quite some time on reducing that burden and time to identify and more importantly, resolve and automate issues.\n\nSo we've been selling to SOC effectively for quite some time. The acquisitions that we made over the last couple of years have just made that job easier for them as we've integrated those technologies into our SIEM and our log analytics product and then took it even one step further to drive it toward orchestration, automation and response with the SOAR acquisition. So I think we're well positioned, but it doesn't mean that you only sell to the SOC. The CISO is heavily involved.\n\nThe analysts and threat hunters are also involved because they collectively need to do the job better together and then can go uniformly back into IT or the DevOps team, cyber reliability folks to partner with them to make the upstream challenges more effective for them downstream.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nYes, very interesting. It's going to be interesting how that continues to evolve as we go into calendar '23. Stewart, I really appreciate all the context you gave on the guide. As I look at -- as I sort of assess all the signals that we've gotten from earnings season thus far, it seemed to be that the companies that have really large deal sizes or big ticket items, maybe have really, really large renewal, seven-figure renewals.\n\nThose are the ones that seem to have been struggling more than others. And taking that into consideration, as you think about trying to maintain deal momentum and deal velocity, how do you guys sort of manage trying to get the large deal over the line versus continuing to have a blocking and tackling transactional business quarter after quarter?\n\nStewart Grierson -- Chief Financial Officer\n\nYes. Listen, I think you've got to start with customer value, right, and really focusing on delivering customer value. And that just makes the job that much easier, right? And so obviously, we have, through our platform, good insights to how customers are leveraging our capabilities, how they're getting value. And so, we leverage that knowledge significantly to make sure that we are in touch at the right time, working with them, making sure they are optimizing value.\n\nWe've talked about things like our data tiers, right? How do they get the most economic value out of the data to drive business value for them. How do they think about leveraging our flexible licensing model? So these are all things we've talked about in the past. I think these all help our customers. But I think if you take that mindset -- and listen, I think it also helps, going back to Ramin's point, our customers use us for their mission-critical cloud apps.\n\nAnd I think it's -- they're getting value from that. And I think that's -- I'll end with that as well. I think that's where what you got to focus on as a company as you think about servicing your customers.\n\nRamin Sayar -- President and Chief Executive Officer\n\nThe last thing I'll add maybe Sanjit to that. That's exactly why we bifurcated our sales force so we can get efficient there, right? So that you can put enough attention to your top -- by ARR, by criticality and not just from an account executive, but a support in PS and TAM and then you also have folks focusing on new pursuits. So you're not splitting, dividing and conquering, right? So that will take a few quarters to play out, but that's how we're intentionally going after your question around how do you drive big deals, customer value and growth.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nMakes total sense. Congrats.\n\nRamin Sayar -- President and Chief Executive Officer\n\nThank you. Good to hear your voice.\n\nOperator\n\nOur last question comes from line of Blair Abernethy with Rosenblatt. You may proceed with your question.\n\nBlair Abernethy -- Rosenblatt Securities -- Analyst\n\nThank you. Nice quarter, guys. Two questions. One for you, Stewart.\n\nCould you just give us a sense of as you enter the second half here, what your book of renewals is looking -- like size of the renewals versus, say, second half of last year? And what's sort of trending in terms of the term length that you're seeing for most of the contracts that are coming up?\n\nStewart Grierson -- Chief Financial Officer\n\nYes. So we don't typically -- Blair, thanks for the question, but share sort of the size of renewals. I mean, I think that's -- it's an ever-growing book of business, but you have to be careful from quarter-to-quarter. As we've talked about, as you look at some of our metrics, right? The timing of renewals can fluctuate from quarter-to-quarter, so you could have early renewals that impact the size in the following quarter.\n\nSo we don't really talk about it on a sort of quarter-to-quarter or even year to sort of half year to half year basis. As respect to contract duration, whether we look at new business expansions renewals, it's been really relatively consistent over the last several quarters. So we haven't really seen any change there.\n\nBlair Abernethy -- Rosenblatt Securities -- Analyst\n\nOK. Great. And Ramin, just Lynne has done a great job in the last year with stabilizing and driving the business on the sale of the go-to-market side. What are you thinking -- what is she looking at in terms of what's next for -- to not only sort of take us from where we are today, but maybe see some acceleration of growth?\n\nRamin Sayar -- President and Chief Executive Officer\n\nWell, so she completed her third quarter. And I think the plan is pretty clear. Where can we put resources to make sure that we're delivering the most value. So that allows us to go broader and deeper in our existing accounts, as well as obviously add new opportunities to the customer base.\n\nSecond thing is how do we drive more effect relationships in the field with partners and doubling down with them. And those are both on the ISV side, SI, VAR side and obviously MSSPs. And then, the third is, how do you continue to top-grade, bring more talent and drive execution and rigor. And so, those three are constant things of focus for us in conversations we have.\n\nBlair Abernethy -- Rosenblatt Securities -- Analyst\n\nThat's great. Thank you.\n\nOperator\n\nLadies and gentlemen, we have reached end of today's question-and-answer session. I would like to turn this call back over to Mr. Ramin Sayar for closing remarks.\n\nRamin Sayar -- President and Chief Executive Officer\n\nThank you, operator. So just kind of summarizing on the prepared remarks and some of the questions and some of the other notes we've seen during the last few days and weeks. I think we'll first start off by acknowledging while there may be some uncertainty in this macroeconomic environment and conditions, we believe that we're in a strong position as we provide a mission-critical service that we believe all customers of all sizes and maturities need for both reliability and security. On a personal note, I'm pretty proud of the strong execution with even more focus on efficient growth as we've demonstrated throughout this year and committed to the rest of the fiscal year.\n\nAnd lastly, I'm super excited about the fact that our executive leadership team and our product portfolio has never been stronger. So with that, I want to thank all of our employees for their hard work and dedication as well thank you for joining us today on our second quarter earnings call. We hope to see you all at our investor day on September 20, either in person or virtually. Thank you and have a great day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBryan Liberator -- Director, Investor Relations\n\nRamin Sayar -- President and Chief Executive Officer\n\nStewart Grierson -- Chief Financial Officer\n\nMatt Hedberg -- RBC Capital Markets -- Analyst\n\nKamil Mielczarek -- William Blair and Company -- Analyst\n\nRachit Agrawal -- JPMorgan Chase and Company -- Analyst\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGray Powell -- BTIG -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nBlair Abernethy -- Rosenblatt Securities -- Analyst\n\nMore SUMO analysis\n\nAll earnings call transcripts"
}