{
  "companyName": "AdaptHealth Corp.",
  "companyTicker": "AHCO",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/adapthealth-corp-ahco-q2-2022-earnings-call-transc/",
  "content": "AdaptHealth Corp. (AHCO -1.03%)\nQ2 2022 Earnings Call\nAug 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGreetings, and welcome to the AdaptHealth second quarter 2022 financial results conference call. [Operator instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce your host, Chris Joyce. Thank you, Chris.\n\nYou may begin.\n\nChris Joyce -- General Counsel\n\nThank you, operator. I'd like to welcome everyone to today's AdaptHealth Corp. conference call for the second quarter ended June 30th, 2022. Everyone should have received a copy of our earnings release earlier this morning.\n\nIf not, I'd like to highlight that the earnings release as well as a supplemental slide presentation regarding Q2 2022 results is posted on the Investor Relations section of our website. In a moment, we'll have some prepared comments from Steve Griggs, chief executive officer of AdaptHealth; Josh Parnes, president of AdaptHealth; and Jason Clemens, chief financial officer of AdaptHealth. We'll then open the call for questions. Before we begin, I'd like to remind everyone that statements included in this conference call and in our press release may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act.\n\nThese statements include, but are not limited to, comments regarding our financial results for 2022 and beyond. Actual results could differ materially from those projected in forward-looking statements because of a number of risk factors and uncertainties which are discussed at length in our annual and quarterly SEC filings. AdaptHealth Corp. shall have no obligation to update the information provided on this call to reflect such subsequent events.\n\nAdditionally, on this morning's call, we'll reference certain financial measures, such as EBITDA, adjusted EBITDA, and free cash flow, all of which are non-GAAP financial measures. This morning's call is being recorded, and a replay of the call will be available later today. I'm now pleased to introduce our chief executive officer, Steve Griggs.\n\nSteve Griggs -- Chief Executive Officer\n\nThank you, Chris. Good morning, everyone, and thank you for joining us as we review our results for the quarter ended June 30th, 2022. As always, we are indebted to our 11,109 employees for the contributions they make every day to AdaptHealth's success. As we move into our second year together, we are very pleased on how well AdaptHealth and AeroCare have integrated operations and continue to take advantage of our scale as a full-service nationwide HME and supplies provider.\n\nResults for the second quarter were consistent with our expectations and were characterized by many of the same themes that we've experienced in recent quarters. Our record revenues of $727.6 million, the sequential growth in our second quarter sleep business and the improvement in our EBITDA margin gives us confidence that we are entering the second half of 2022 on a strong trajectory to achieve our guidance for the year despite inflationary pressures and supply chain issues that have affected us. Turning to the sleep business. We are pleased to report at quarter end our census is up 16% from February 2022, when it hit its lowest level since the Philips recall began in June of 2021.\n\n13 months into the recall, we have worked with our manufacturers to gain greater capacity and accelerate delivery of machines, thus enabling us to get more patients on to therapy in Q2. While we do not expect Philips to be back in the market anytime before early 2023, the increased production we are starting to see from other suppliers has become more reliable and we have substantially increased our capacity to schedule and set up patients. We have -- we are, of course, incurring additional shipping costs and other incremental expenses, but we expect those costs to decline as normal supply returns to the market. We continue to drive double-digit growth in our diabetes business, consistent with the market.\n\nFor the year to date, non-acquired growth is 17%, and we continue to expect solid growth for the remainder of the year. Even though growth in our non-acquired business was flat for the quarter, we feel comfortable with our guidance for overall, non-acquired growth of 4% for the full year, largely driven by increased census in our sleep business and our continued growth in our diabetes business. Like most companies, our company is challenged by inflationary pressures and other supply chain issues. While these issues, especially shipping costs, including the price of fuel for our 2,400 vehicles, have impacted our results.\n\nI'm pleased that we've been able to mitigate the impact of these pressures through our purchasing scale and use of technology to drive efficiencies. Further, the labor synergies we achieved with the AeroCare merger have minimized the effect of broad labor inflation as is demonstrated by our labor holding steady as a percentage of revenue. As a result of these factors, our gross margin has stayed relatively stable over the past few quarters. Finally, we are largely insulated from higher interest rates since more than 75% of our debt is fixed, so our cost of capital has remained favorable.\n\nI will now turn the call over to our president, Josh Parnes, for further details and an update on our strategic developments.\n\nJoshua Parnes -- President and Director\n\nThank you, Steve. On the strategy front, we continue to look for ways that we can leverage our infrastructure to address the broader needs of the 3.9 million patients that we serve. We're able to do that by deploying technology that optimizes efficiencies and developing capabilities to identify gaps in care and make sure patients are getting what they need, when they need it as well as offering a comprehensive range of products and services to help patients wherever they are on their home health journey. In addition to driving better outcomes by keeping patients at home and out of the hospital, we are able to add value as an extension of the referring physician offices.\n\nWe believe these investments position us well to advance our strategy beyond the traditional HME business model and into more risk and value-based payment arrangements. For example, during the second quarter, we signed two new agreements with value-based managed care payers. With one on the East Coast and one on the West Coast, we are leveraging our complete product offering, our geographic footprint, and our patient-centric technology to simplify and improve the experience for both payers and patients. This will add to our existing value-based portfolio, and we will continue to pursue similar creative arrangements.\n\nWe remain committed to investments in technology that transform the HME experience for our patients, payers, and referring physicians. For example, our e-prescribed platform continues to make home health easier for our referring providers by allowing them to eliminate the hassle and paperwork of outdated and error prone ordering methods such as fax. We continue to see greater than 50% adoption in the regions where this technology is rolled out as well as quarter-over-quarter growth of 7.5%. Our new e-ordering capabilities are improving patient experience by providing channel of choice communication.\n\nApproximately 50% of all path and diabetes resupply orders in Q2 were processed electronically via our digital patient portal. Our e-delivery platform greatly increases transparency for order delivery, enabling every customer to rate interactions in real time and by providing real-time order tracking. 84% of deliveries in Q2 leverage this technology. This system also facilitates real-time patient satisfaction survey results, allowing our branches to address any patient concerns more timely.\n\nIn addition to improving the experience for users, our combined digital platform for prescribing, ordering and delivery help control operating expenses, which we believe is particularly important given the current inflationary environment. We continue to believe that these technologies will allow us to keep our costs in line even as we scale and continue to grow. By making home health easier and more accessible for payers, patients and providers, we can continue to gain share and volume within the broader home health industry. As we look down the road, these proprietary tools are the foundations for both improving our patient satisfaction, as well as operating efficiencies and will help open the door to greater collaboration with our payers on alternative payment arrangements.\n\nWith that, I'll pass the call over to our CFO, Jason Clemens, to review our financial results.\n\nJason Clemens -- Chief Financial Officer\n\nThanks, Josh. Good morning, and thank you for joining our call. I'll discuss the second quarter operating results, our cash flow performance, and capital allocation and conclude with a discussion of our 2022 outlook. We were pleased to again deliver revenue and adjusted EBITDA, consistent with internal expectations despite the ongoing impact of the Philips recall, ongoing inflation, and supply chain challenges.\n\nFor the second quarter ending June 30th, 2022, AdaptHealth reported net revenue of $727.6 million, representing year-over-year growth of 17.9%. Total company non-acquired growth was a decline of 30 basis points for the quarter. We were particularly pleased with the growth in sleep by far our largest product category. PAP rental census is growing faster than we forecasted in the first quarter outperformance in our PAP resupply business continued in the second quarter.\n\nOur respiratory and diabetes categories, slightly missed top line targets, but we continue to believe that non-acquired revenue for the entire company will achieve our 4% guidance for the full year. We have not been immune to affiliate inflation and ongoing supply chain challenges but we are very proud that our efforts to become more efficient and the scale and synergies resulting from the AeroCare merger have offset these pressures to a great degree. Specifically, cost of goods, which includes freight and fuel, held steady as a percent of revenue against the first quarter. Additionally, despite a tough labor market, salaries, wages, and benefits were also flat as a percent of revenue against the first quarter.\n\nWe believe our operating results for the second quarter demonstrate that we are accelerating operating leverage by driving cost and inefficiencies out of our business model. We remain confident that we will achieve our full year guidance that implies 21.9% adjusted EBITDA margin at the midpoint, which already reflects the impact from temporary mix shift toward sales revenue away from higher-margin rental revenue. Free cash flow, defined as cash flow from operations less capital expenditures, was $26.3 million for the quarter, surpassing our expectations. Capital expenditures of $77.2 million remained in line with our guidance, representing 10.6% of revenues.\n\nWe converted more inventory into sales. We compressed DSOs by three days and as planned, we decreased accounts payable, so we are very pleased with cash performance. At the end of the quarter, we had cash of $119 million and an undrawn revolver with net leverage as defined under our bank covenants of 3.4 times and trailing 12 months leverage essentially unchanged at 3.5 times. As previously announced, our board of directors authorized a share repurchase program.\n\nDuring the second quarter, we repurchased 199,000 shares for $3.4 million pursuant to this program. Turning to guidance. As noted in the press release, we are maintaining the outlook we provided last quarter for revenue of $2.840 billion to $3.040 billion and adjusted EBITDA of $615 million to $675 million. Consistent with previous periods, our guidance does not include contribution from acquisitions that have not yet closed.\n\nI'll now pass the call back over to Steve for some final thoughts before we open it up for Q&A.\n\nSteve Griggs -- Chief Executive Officer\n\nThanks, Jason. Over the past year, our employees from the legacy operations of AdaptHealth, AeroCare, and many of our acquisitions have come together as one AdaptHealth. I would encourage you to visit our website and click on the We Are AdaptHealth video, which highlights the many accomplishments of our fully integrated organization. So again, I would like to thank our 11,109 employees for the united commitment to our mission of empowering our patients to live their best lives.\n\nWe are pleased to announce our Capital Markets Day on September 16th, when our team will demonstrate how this commitment leads to superior results and create significant opportunities for our company and our shareholders. We will present specific achievable targets for the next few years and demonstrate how we are preparing for the unique opportunities beyond the current time horizon. With that, operator, please open the line for questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Brian Tanquilut with Jefferies. Please proceed with your question.\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nHey. Good morning. I guess my first question for Josh. You called out sort of the weakness or relative shortfall in diabetes.\n\nAnd I know that's always been a strong spot for you guys. So maybe just any color or thoughts you can share on what is driving that? And how you're thinking about the recovery in that segment line?\n\nJoshua Parnes -- President and Director\n\nYeah. Thanks, Brian. So I think in general, like we look at this kind of quarter to quarter and generally from the year to date, we're pretty happy where things are and kind of in line with our forecast. We do see some movement quarter to quarter as well as depending on where we were at last year.\n\nLast year, we had a lot of acquisitions that came on ramping up the resupply. Obviously, first six months this year, not having much in the way of acquisitions is going to affect the growth rate there. But in general, we're not seeing anything structurally there that's concerning overall kind of performing where the market is right now.\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nGot it. And then I guess, appreciate, I know you said in your prepared remarks that the expense lines and your overhead basically came in line with your expectations. But any thoughts on the ability to maybe bring down G&A a little bit going forward? Or is that just operating leverage that we should wait for as the top line comes back with sleep and diabetes recovering?\n\nJason Clemens -- Chief Financial Officer\n\nSure, Brian. So you might recall, I guess, two quarters ago, we spoke about planned investments within G&A, specifically technology. We've referenced Oracle, also upgrades to the infrastructure for our OTL, our e-delivery technology as well as the e-ordering platform, that Josh referenced in his remarks. So at that time, we also had planned for about 5% of revenue to be spent in G&A.\n\nAnd when you account for kind of add-backs like related to transaction costs, we're spot on that number. So I wouldn't expect any operating leverage out of G&A until the end of next year. But again, these are planned investments. We're very confident these investments are going to get operating leverage out of the core part of the business.\n\nAnd so we think they're smart ones.\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nAwesome. Thank you.\n\nOperator\n\nThank you. Our next question is from Kevin Caliendo with UBS. Please proceed with your question.\n\nKevin Caliendo -- UBS -- Analyst\n\nThanks and thanks for taking my question. I just wanted to ask a little bit about the backlog. It sounds to me like your commentary suggests that maybe things are loosening up a little bit more than maybe you had expected a quarter or so ago in the second half. You're getting more supply.\n\nHow does that compare to where you were before in terms of how much of the backlog you might be able to work through this year? And how big do you think that backlog of patients sits now versus where it was last time you gave us an update on that?\n\nSteve Griggs -- Chief Executive Officer\n\nYeah. Thanks. This is Steve. Great question.\n\nThe backlog that generally maintained its level. But in this past quarter and in the first month of this quarter, we have at least been able to set up what we've been able to get as new referrals. So the backlog state, we look at have a pretty successful third quarter as more product is available. So it's definitely ahead of expectations, both on ResMed and other suppliers.\n\nResMed with their card to cloud certainly has helped considerably with that and then other suppliers coming on the market also. Then if that can continue, then what you'll see is the compounding effect of those increased CPAP setups continue to grow our revenue, rental revenue, and our resupply revenue, just as you've seen the compounding effect negatively for the first nine months of the recall.\n\nKevin Caliendo -- UBS -- Analyst\n\nI know you've, I think, done six acquisitions year to date. If you're getting more comfortable about supply coming back to the market, does that make it easier to do further M&A going forward? Because I know that had been somewhat hamstringing you in terms of getting deals done.\n\nSteve Griggs -- Chief Executive Officer\n\nWell, yes, that certainly was a big factor in there. So I think we will be looking for more acquisitions and considering those more. I think we're past the Oracle conversion. That was part of it, too.\n\nGetting caught up on all the activities we did in 2021. So we're in pretty good shape. And so if we see something that's attractive, I think we'll be much more attentive to it than we were in the first half of the year.\n\nKevin Caliendo -- UBS -- Analyst\n\nSounds good. Thank you very much.\n\nOperator\n\nThank you. Our next question is from Joanna Gajuk with Bank of America. Please proceed with your question.\n\nJoanna Gajuk -- Bank of America Merrill Lynch -- Analyst\n\nHi. Good morning. Thank you so much. So a couple of questions, I guess.\n\nSo first, the follow-up on the 4% growth for the full year organic growth that you still continue to expect. So can you talk about how the sleep business has been tracking organically because it sounds like things may be a little bit better than expected. So any change there in terms of your expectations before you talk about I guess, 5% to 6% decline for the year. So kind of where you stand versus that foresee specifically inside your guidance?\n\nJason Clemens -- Chief Financial Officer\n\nJoanna, it's Jason. I'll be glad to take that. So first, I'd call out that we had expected the second quarter to be roughly flat in terms of non-acquired growth year over year. I mean a big part of that is that we're comping against a period that you can't really comp.\n\nI mean it was a pre Philips recall, full supply of PAPs on the market. So it is technically a comparable period from a financial aspect. But operationally, they're just very different periods. So we had expected roughly flat for Q2.\n\nSo bigger picture, when we through the product lines, we are highlighting a bit of a top line miss against our internal expectations within respiratory and within diabetes. Respiratory really related to the impact of COVID census continuing to roll off. So a slight miss internally on respiratory. And then on diabetes, I mean, we had a tremendous Q1, Q2 was a bit lighter.\n\nBut overall, I mean, 17% growth, I mean we're pleased with that. So on the other hand, with sleep, to your question, I mean, we absolutely outperformed our internal expectations. We talked about the setups. Steve had referenced that.\n\nWe are feeling through even the month of July, we're feeling good about it. And so the reason we feel so strongly about delivering the 4% for the full year is that we have a few ins and outs. We don't know if respiratory and diabetes will continue to slightly underperformed, but if they do, we're gaining confidence that sleep will outperform and make up the difference.\n\nJoanna Gajuk -- Bank of America Merrill Lynch -- Analyst\n\nGreat. That's good to hear. And I guess on the guidance, the PHE expansion, does that add a couple of million?\n\nJason Clemens -- Chief Financial Officer\n\nYes. Yes, the way to think about that is $3 million to $4 million a quarter. We had referenced that in previous calls. Frankly, $3 million to $4 million on a $3 billion business.\n\nThat alone, there was no M&A that we had done since the last call. So in the aggregate, it just didn't hit a threshold that we felt it was important to raise the guidance. But that is a tailwind that we will have for Q3.\n\nJoanna Gajuk -- Bank of America Merrill Lynch -- Analyst\n\nGreat. And my, I guess, bigger question, it sounds like you're really pushing hard on the value base purchasing and adding additional contracts, so that's good to hear. Can you give us a little bit more flavor in terms of the magnitude of things here? I don't know if you're willing to maybe just in the aggregate with other contracts in terms of like how big really this business is in terms of, I don't know, volumes and revenues and also give us a flavor for maybe margin expectations and for that part of the business. Thank you.\n\nJason Clemens -- Chief Financial Officer\n\nJoanna, I'll start on the kind of the math side, and then I'll pass it to Josh on the framework, which we think is important for folks to understand of those contracts. And so in terms of the percent of the business, value-based arrangements or kind of nontraditional fee-for-service arrangements account for about 3% of our total revenue. We are pleased with that part of the portfolio. The margin profile to your question, is very consistent with the overall margin profile for the rest of the company.\n\nBut the stickiness of these contracts is very, very good because of the benefits and the value that we offer to payers and patients. I'll pass to Josh to explain a little more.\n\nJoshua Parnes -- President and Director\n\nYes. So just touching a little bit more on that. So from a macro perspective in terms of opportunity, as you know, kind of a lot of these contracts, the sales cycle is generally pretty long. So a lot of these discussions and others have [Inaudible] for a while and will continue to happen, and we continue to build that pipeline out.\n\nAnd what I think is unique here is that our ability to leverage some of the new technology that's come online internally with matching it up directly with the payer to be able to offer cost savings and kind of a value-based arrangement that allows us to take some risk on these patients. A lot of these contracts are kind of ramped. So initially, you'll take them on with kind of pilot period, not necessarily pilot but a Phase 1, where you get one product line and the fact that we have multiple product lines allows us to feed more product lines into that value-based arrangement as we go further along. So again, initially exciting, but we'll continue to look for these to ramp over time as well as, like you said, look for other opportunities and continue to push on that front.\n\nJoanna Gajuk -- Bank of America Merrill Lynch -- Analyst\n\nThank you so much.\n\nOperator\n\n[Operator instructions] Our next question is from Pito Chickering with Deutsche Bank. Please proceed with your question.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nHey. Good morning, guys. Thank for taking my question and apologies if I missed this, and you mentioned the diabetes organic growth rate is 17%. But can you walk us through the organic growth for each product division during 2Q and what you assume in the back half of the year to get to the 4% organic growth?\n\nJason Clemens -- Chief Financial Officer\n\nYeah. Sure, Peter. So diabetes running a touch light against the 18% that we've got included in guidance. As we stand here today, do we think Q3 and Q4 will be above 18%, I don't know that we're confident enough to say that.\n\nI mean staring down a potential recession and those are high-priced products. So we have a very insulated portfolio, we believe, from overall, recession. But if there's a potential drag, it's likely in that diabetes product. So don't misinterpret that as we don't think we're going to get close to the 18%, but I don't know that we're going to beat it.\n\nIn terms of respiratory, we're running a bit light. We talked about 5% within respiratory. Again, that's COVID census rolling off. They are rolling a little faster.\n\nWe will lap that probably mid-to-late Q3. And so we expect Q4 to be back in line. So we feel pretty comfortable there. The HME and other product lines, we forecast that at 3% to 4%.\n\nIt's running about in line, maybe a very touch light. I mean I know everything we've seen on electives a minor slowdown. I don't think it's anything that we're losing sleep over in terms of the overall delivery. But the big news, I think, for the quarter is sleep.\n\nI mean, we had projected a negative 5% to negative 6% non-acquired growth rate for sleep back when we produced guidance. We think we're going to beat that maybe handily. I mean we were a touch positive for Q2, which again is a very difficult comparable comp period that we talked about. I mean, we were thrilled with that.\n\nSo if the themes continue, we're very comfortable with 4% for the full year.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nSo just to make sure that, I mean, with 3.7% in 1Q and 30 basis points in 2Q, it's implying organic growth rate of 6% in the back half of the year, that's the right range we should be thinking about, right?\n\nJason Clemens -- Chief Financial Officer\n\nCorrect.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nOK. Fair enough. And then can you actually remind me so what's the other revenue line is sort of now your third largest divisions. What is in the line sort of and how is that growing?\n\nJason Clemens -- Chief Financial Officer\n\nYes, sure. So I'll pass off to the guys for a little operational detail. But in terms of what's in it, the value-based arrangements that we just discussed is included in there, as is our customer rehab, products are in that line item. It's a very steady and stable business for us.\n\nWe've got orthotics which is a very, very rapidly growing business. We've done, I think, an admirable job signing up new business with very well-known hospital systems that they've been very happy with that product line, and it's been continuing to grow. We've also got infusion within that product line. I mean, that we've built up a nice little portfolio there of essentially a collection of infusion businesses from companies that we've acquired over the last 18 months.\n\nAnd we're starting to run them together. Hospitals are interested in more of those services. And so that -- those are some of the reasons you're seeing that other growing quite a bit. I mean I think it gets much bigger.\n\nWe won't be discussing do we break out the next category to give some visibility to that.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nOK. And then a last question here. The guidance for the back half of the year implies three to four basis points of margin expansion. Can you sort of walk us through what are the key drivers of the margin expansion? Thanks so much.\n\nJason Clemens -- Chief Financial Officer\n\nYeah. Sure. So some of that is the sleep rental. I mean, I think we have discussed this previously.\n\nI mean, that's coming in at essentially 100% adjusted EBITDA margin because the true variable cost there is just the acquired equipment, which hits the capex lines. Next, we've got just the scale factor of as you get into the later parts of the year, particularly Q4. The resupply businesses are huge. Q4, I mean a lot of that has to do with patient deductibles set to reset at the beginning of the year and/or just cut over to new insurance carriers on account of change in employers or the employers making changes.\n\nAnd so what you see is the patient behavior of essentially ensuring that they're spending every dollar of the healthcare wallet wisely, and it's just a huge quarter. In the meantime, and we've got extra variable cost to deliver, but the fixed cost structure isn't changing. So we always have a natural progression of margin enhancement over the course of the year, driven primarily by those dynamics.\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nThanks so much, guys.\n\nOperator\n\nThank you. Our next question is from Whit Mayo with SVB Securities. Please proceed with your question.\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nHey. Thanks. Might ask a follow-up on that last question just maybe a different way. I mean Jason is saying where we are halfway through the year, you've got a pretty wide range out there.\n\nAnd I mean, do you feel like you're tracking to be closer to the low end, the midpoint, the high end? Just trying to maybe take your temperature on where you feel you're tracking within the range, I mean, the low end, it looks like you could be flat year over year in the high end, up over 20%. So I don't know, any help or color around just how you feel about where you're tracking within the guidance range?\n\nJason Clemens -- Chief Financial Officer\n\nYeah. Sure thing, Whit. I mean, so I'll probably give you an expected answer. I mean we straight down the middle is where we're tracking.\n\nNow kind of the gives and takes that could change that throughout the balance of the year. Of course, we were thrilled with the sleep performance in Q2. So if supply remains steady and/or increases, which, as we stand here today, we believe it will, that's going to be a tailwind, both top line and then certainly bottom line. I would say next factor is arguably diabetes.\n\nIf all things remain equal, and we are kind of steady as she goes, we think we're right at that mid. Now, do we accelerate in the second half as some of the manufacturers has indicated they believe will happen? Well, that's obviously to the good. And if recession is more than expected and that's a drag on the business, that's more to the downside. But as we stand here today, I'd say mid is where we feel comfortable with diabetes.\n\nSo I don't know, Steve, Josh, if you got anything to add on that?\n\nSteve Griggs -- Chief Executive Officer\n\nNo. I think the big swing could be the continued of the PAPs. As we sit right here, July was a great month. August should be a great month.\n\nAnd -- but we don't know our allocations for September, October, November, December. Last year, if you remember, we're expecting this boom December and our allocations were pitiful. So we feel like a lot of that's been corrected and suppliers have a lot more confidence, but they're not willing to guarantee anything to us. So we still have to live on that apprehension at least for the next few months.\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nOK. Makes sense. Jason, AR days, as you mentioned in your prepared remarks, definitely came down, what, three days or so. Maybe talk a little bit more about, yes, some of the internal initiatives there? Perhaps at some of the M&A integration? Just any color on sort of what's happening around the cash flow?\n\nJason Clemens -- Chief Financial Officer\n\nYeah, for sure. And then I think there's a few folks jumping at the bit on this question because we were thrilled with the performance. Integration is a component, as you referenced. You might recall DSO spiked to 50, even 51 in Q3 of last year.\n\nThat was a lot of changeover to single tax IDs for the AeroCare and the AdaptHealth merger activity. But then following July 1st, I mean, we had, what, 15 or so acquisitions that we also brought in. And so you've just got that dynamic of onboarding a whole lot of business from a whole lot of operating systems. So big picture, that's what you're seeing as we move into Q3, and we've integrated the rev cycle operations, and we're delivering the performance that we're seeing.\n\nI mean, do you want to talk a little dynamic patient pay, other factors, guys?\n\nSteve Griggs -- Chief Executive Officer\n\nYeah. I mean -- well, first of all, we like to brag on our RCM team. They're fantastic. They've done an incredible job.\n\nBut in the process is something that we look forward to continue to improve and continue to do it but the process is much better. But it is -- was a new process for a significant part of the company, certainly for the AeroCare folks and certainly for any kind of new acquisitions that come in there. And just take a while to get used to how that works. And it's a flow of paperwork and getting paperwork in the system quicker, faster, better, getting into the payer quick, faster and better, and getting resolutions to a quicker, faster, better.\n\nAnd so that team, we're very proud of them again, and they're doing a great job. And so we expect continued great results for them throughout this year and certainly beyond.\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nGreat. Thanks, guys.\n\nOperator\n\nThank you. Our next question is from Ben Hendrix with RBC Capital Markets. Please proceed with your question.\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nHey. Thanks, guys. Quick question on your investments in technology. You had mentioned that your e-prescribe platform had 50% adoption in regions where it's rolled out and that 50% of your PAP and diabetes resupply were electronic.\n\nCan you discuss maybe the gating items that govern adoption going forward and increased penetration of your technology platforms, kind of how you see timing unfolding, and what that could mean for margins? Thanks.\n\nJoshua Parnes -- President and Director\n\nSure. Thanks. So this is Josh. From an e-prescribe, a lot of that is our sales team has shifted from kind of sales reps that go in and introduce themselves to the doctor to really working on the technology side with the physicians' offices and driving change management there.\n\nAs you know, e-prescribe in the HME space is really serving to document the entire medical necessity life cycle of that order. And therefore, there's a fair amount of training and change management that needs to go into that. So the fact that we have 50% plus adoption in areas where this is rolled out, it's pretty monumental. If you think about the amount of work and change that needs to happen both at the physician practices and at the hospital case management level.\n\nSo we're very proud of the team really to be able to take that initiative and drive that change. On the e-order front, on the resupply and the diabetes, a lot of that evolution is driven by two things: number one, the technology development, and as that gets more intuitive, I know I referenced channel of choice, communication with the patient. So a lot of that is really identifying where the patient likes and is more comfortable getting communicated with and being able to drive resupply and general communication to that channel where that patient or customer is more comfortable ordering product. And then secondly, really, there's a change management aspect from a patient perspective, where they're used to getting calls or emails or even postcards back in the day to ordering digitally.\n\nAnd when you're dealing with a little bit of some of the senior population on some of these product categories being able to drive adoption there is somewhat of a gating item. But number one, as the baby boomer population ages, as well as our technology, gets more intuitive, we're going to see more adoption in those categories as well.\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nThank you very much.\n\nOperator\n\nThank you. Our next question is from Mathew Blackman with Stifel. Please proceed with your question.\n\nUnknown speaker\n\nI just wanted to -- this is Colin on for Matt, by the way. I just wanted to have a quick follow-up on M&A. I was wondering if there's been any change since last quarter regarding your M&A appetite. You guys acquired several during the quarter, but they were really announced on the 1Q call.\n\nShould we think about you hitting the historical $100 million, $150 million in acquired revenue being inclusive of the Community Surgical acquisition you guys did at the end of last year?\n\nJason Clemens -- Chief Financial Officer\n\nThat's the right way to think about it, Colin. I mean it was, frankly, if and upward kind of tax purposes and other factors, I mean, you can think of that as a '22 deal. I mean it's done the last day of last year, but all the integration work and all the heavy lifting is what we've been focused on for 2022.\n\nUnknown speaker\n\nAll right. And then a quick one on the other segment. You talked about hospice, orthotics and home infusion really being drivers here. How should we think about that business -- those businesses really ramping up? And what's a sustainable growth rate you guys think is realistic? Or that could be more of an Analyst Day question?\n\nSteve Griggs -- Chief Executive Officer\n\nYes. It's more of an Analyst Day. But that business we like it. It's -- the orthotic side of it is very strategic to get into health systems and lead to other business.\n\nSo we like that. I think that business will grow significantly in the probably low double digits. The infusion business is we're still getting our feet wet in that. The growth right now is just going to be on the operations that we have that we've been -- it's part of an acquisition.\n\nSo we haven't really expanded that business. So I wouldn't look for any significant growth there. And then the other stuff all kind of plays into what Josh alluded to as we get these contracts and as we get the better relationships with these health systems, we can bring all these products to that health system at a pretty low sales cost for us. And so that's what we're probably excited more about anything else.\n\nSo that has some growth potential for us, too.\n\nUnknown speaker\n\nGot it. Thank you very much for taking the questions. I'll have back in the queue.\n\nOperator\n\nThank you. There are no further questions at this time. I would like to turn the floor back over to Steve Griggs for any closing comments.\n\nSteve Griggs -- Chief Executive Officer\n\nWell, once again, we'd just like to thank our fantastic employees have done a great job over these past few years in particular, now with not just the pandemic, but also the Philips recall and having the deal with taking care of our patients and sticking to our mission, which is to empower our patients to live their best lives. And we appreciate the support of all of our shareholders and appreciate the support of the people on the call, and thanks again.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nChris Joyce -- General Counsel\n\nSteve Griggs -- Chief Executive Officer\n\nJoshua Parnes -- President and Director\n\nJason Clemens -- Chief Financial Officer\n\nBrian Tanquilut -- Jefferies -- Analyst\n\nKevin Caliendo -- UBS -- Analyst\n\nJoanna Gajuk -- Bank of America Merrill Lynch -- Analyst\n\nPito Chickering -- Deutsche Bank -- Analyst\n\nWhit Mayo -- SVB Leerink Partners -- Analyst\n\nBen Hendrix -- RBC Capital Markets -- Analyst\n\nUnknown speaker\n\nMore AHCO analysis\n\nAll earnings call transcripts"
}