{
  "companyName": "Singular Genomics Systems, Inc.",
  "companyTicker": "OMIC",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/singular-genomics-systems-inc-omic-q2-2022-earning/",
  "content": "Singular Genomics Systems, Inc. (OMIC -0.49%)\nQ2 2022 Earnings Call\nAug 09, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Singular Genomics Systems, Inc. second quarter 2022 earnings conference call. [Operator instructions]. It is now my pleasure to turn the floor over to your host, Philip Taylor with the Gilmartin Group.\n\nSir, the floor is yours.\n\nPhilip Taylor -- Investor Relations\n\nThank you, operator. Presenting today are Singular Genomics founder and chief executive officer, Drew Spaventa; and head of finance, Dalen Meeter. Earlier today, Singular Genomics released financial results for the three months ended June 30, 2022. A copy of the press release is available on the company's website.\n\nBefore we begin, I would like to inform you that comments and responses to your questions during today's call reflect management's views as of today, August 9, 2022, only and will include forward-looking statements and opinion statements, including predictions, estimates, plans, expectations and other information related to our financial and operating results, plans and strategies. Actual results may differ materially from those expressed or implied from these statements as a result of certain risks and uncertainties. These risks and uncertainties are more fully described in our press release issued earlier today and in our filings with the Securities and Exchange Commission, including our most recent Form 10-K or 10-Q and the Form 8-K filed with today's press release. Our SEC filings can be found on our website or on the SEC's website.\n\nInvestors are cautioned not to place undue reliance on forward-looking statements. We disclaim any obligation to update or revise these forward-looking statements. Please note that this conference call will be available for audio replay on our website at singulargenomics.com on the Events page of the news and events section on our investors page. With that, I will turn the call over to CEO, Drew Spaventa.\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nHello, and thank you for joining Singular Genomics second quarter 2022 conference call. My prepared remarks today will focus on the G4 commercial launch progress, including some detail on our target customer segments, capabilities and application expansion for the G4, our product road map and some color on our near-term outlook and priorities. Then Dalen will detail the financial results and provide some commentary on expectations going forward before I conclude. Before I cover specific recent business highlights and updates, I'm going to share my perspective on Singular's positioning within the overall market relative to early commercial activity and long-term value creation.\n\nMy goal is to be as direct and clear as possible. On the one hand, the second quarter was an extremely productive one for Singular, culminating in the shipment of our first production G4 system in June and continued excitement from customers around the value proposition, all of which I will get into. However, as I suspect is evident to most listeners, the market and macroeconomic conditions continue to evolve, impacting how we and others think about operating our businesses. We find ourselves in a very different world today compared to the first half of 2021, and we are focused on adapting to the realities of the current market.\n\nSome challenges that manifest themselves in the supply side, which continued and in some cases, exacerbated vendor and supply chain bottlenecks affecting our ability to obtain certain parts. This has had some impact on our ability to scale manufacturing on schedule. In addition, considerations around cash burn and runway have led us in many of our peer group companies to rethink the pace of investments and road map priorities to ensure financial flexibility in the event of an extended market downturn. While we remain confident in our technology, the G4 product profile, our product road map and long-term success, this change in mindset and ships in organizational priorities has downstream impacts on how aggressively we higher in spend.\n\nThis may also have similar effects on the customer side, which could translate to altered demand dynamics. These changes in the reality of the current environment have implications in the context of how we think about building our business. Since inception, Singular has demonstrated a steadfast disciplined capital efficiency, focused spend, lean execution, agility, phase appropriate investment and frankly, scrappiness. These core cultural tenants have served Singular well to date.\n\nWe believe this continued disciplined approach to spend and investment will serve us well going forward. I will go into more detail on market dynamics and what we are doing to adapt to this changing landscape. Before I talk further on this topic, let's cover a very productive and exciting list of Q2 update. In line with our previous commentary, Singular shipped our first commercial G4 unit in June.\n\nWe were at the start of the next chapter of growth for our company as our vision to advance sequencing materializes. The G4 offers unmatched power, speed and flexibility in the benchtop instruments, including market-leading key performance indicators or KPIs, such as data output rates, runtime, flow cell and lane to lane flexibility and number of reads per run. Based on the initial orders, robust activity with prospects and a growing sales funnel comprised of inbound and outbound leads, we remain confident in our potential to drive meaningful penetration of the sequencing market across our target customer segments. F2 flow cell kits are now available, and we are on track to ship the F3 sell later this year.\n\nAt AGBT, we introduced our Max Read or M-Series flow cell kits. Feedback has been overwhelmingly positive. We believe the M-Series kits will offer a highly unique solution, ultra-short read sub-100 base kits that provide NovaSeq level read count at more attractive pricing. We plan to launch initially with the M2 kit, which will feature up to 1 billion reads per flow cell or up to 4 billion reads per run for short-read applications.\n\nIn addition, we are pleased to announce that we have hired Sam Ropp, as our chief commercial officer. Sam is an accomplished commercial leader in the life sciences space. He brings nearly 20 years of experience building and scaling commercial teams, including sales, marketing and customer support. He joined Singular from 10x Genomics, most recently serving as senior vice president of global sales.\n\nSam spent the last five years at 10x, building and leading all aspects of regional sales, marketing, support and global sales operations. His proven track record of building successful commercial organizations and driving sales will help propel Singular as we grow our commercial offering with the G4 and plan for future commercialization of the PX system. Sam has hit the ground running and is in the field speaking with customers to gain experience that will inform strategy and process development. We look forward to seeing the impact of his commercial and executive leadership.\n\nTurning to target customer profiles. We grew customers into three segments: Academic Labs, Clinical and Research Commercial Labs and Emerging Growth Labs. I will provide more detail on the opportunity within each of these three target customer segments, how the G4 value proposition has resonated and how we are addressing each segment's prospective customer needs. Number one, academic labs.\n\nThese labs are often providing sequencing services for multiple principal investigators or PIs and researchers and are running a wide range of applications with diverse sequencing requirements, such as RNA-Seq, single-cell targeted panels, exomes, whole genome and other multi-omic experiments. The flexibility of 16 individually addressable lanes across four flow cells in a single run coupled with a 19-hour less run time, is an appealing value proposition for these customers. In our discussions, lab directors have indicated that the G4's ability to allocate individual lanes to PIs without the risk of sample contamination from pooling or the ability to sell individual lanes at a lower price point provides a compelling and unique value proposition. Our early sales focus within this segment has been to identify labs and KOLs that will help generate data and publications.\n\nThese efforts are necessary in the early stages of commercialization to provide further third-party validation of the technology, given we are a new entrant in the NGS space. Number two, clinical and research commercial labs. These commercial organizations often run a wide range of both research and clinical sequencing applications, such as RNA-Seq, targeted panels, exomes and rapid whole genomes. Clinical sequencing is often done in the form of LDTs in a CLIA lab environment.\n\nThe G4's power and speed or gigabase throughput per hour are attractive selling points for these labs that want to run more samples with shorter turnaround times. When combined this power and speed with the flexibility of the G4, these customers can run their samples quickly and cost effectively versus having to wait in vast like-sized samples or runs. Our initial focus within this segment is then to target early innovators and technology adopters that will help prove out the robustness of the G4 system in the field. We are actively leveraging our internal customer care lab to assist in the sales cycle with these customers.\n\nThis currently presale service is proving an effective way to validate prospective customer applications on the G4 via sample optimization and testing in advance of purchases. Number three, emerging growth labs. These labs typically span across both research and clinical LDT-based applications such as RNA-Seq, single cell, target panels, spatial and proteomics. This profile of customer is cost conscious and looking for a solution that can scale up with their sequencing needs over time, providing varying throughput options.\n\nWe believe the combination of power, speed and flexibility of G4 is perfectly suited for this customer profile. It offers the customer attractive pricing for both smaller scale down experiments and higher throughput runs as they scale. The flexibility enables more frequent runs and facilitates more rapid R&D iteration. A single G4 system and its capital cost is much cheaper than scaling with other benchtop offerings, which would require three to four similarly priced instruments to match a single G4's capabilities.\n\nOur sales team has been heavily engaged with this segment in a high-touch sales process. Interaction with customers in this segment typically require customized cost modeling support to highlight the overall ROI and lower cost of ownership versus other competitive systems. Some of these customers are sensitive to the upfront capital purchase model for the instrument. For these customers, we are working with them to provide flexible financing and sales options.\n\nOur aim is to establish long-lasting relationships and grow with these customers over time as their businesses scale. Overall, we are pleased with the robustness of the sales funnel and the feedback received from customer discussions in the field. We have received orders from customers within each of our target customer segments and continue to believe the value proposition of G4 is resonating. Q2 was also an active quarter for partnerships.\n\nWe announced a planned partnership with TwinStrand Biosciences to collaborate and develop ultra-high accuracy NGS solutions for the G4 platform. This partnership is intended to combine TwinStrand's proven duplex sequencing solution with Singular's HD-Seq technology on the G4 to maximize mutation detection sensitivities for applications requiring rare variant detection such as monitoring minimum residual disease, or MRD. The combination of these technologies should offer unmatched 250-plus accuracy at high efficiency for rare variant applications in oncology. We also announced a collaboration with Olink to enable the use of Olink Explore high-throughput proteomics platform with the Max Read kits on the G4.\n\nWe believe that Singular's Max Read kits are perfectly suited for the sub-100 base readout requirement of Olink Explore solution. The M-Series kits can provide read out scale at the NovaSeq level at more attractive price points for both the system and reagents. On the library prep front, we are excited to announce three new partnerships with solution providers, Integrated DNA Technologies, Takara Bio and Parse Biosciences. Through Integrated DNA Technologies, we are validating its high-quality xGen NGS Library Preparation Kits for both DNA and RNA sample prep.\n\nWith Takara, we are validating its ever code kit for single-cell RNA-Seq. With Parse, we are validating a single cell RNA-Seq kit based on its SMART-Seq and other NGS technologies. We were pleased to attend and participate in the AGBT conference in Orlando in June where we met with industry leaders and prospective customers. We had a G4 instrument on-site and provided dozens of system demos for meeting attendees.\n\nFeedback was very positive with demo attendees highlighting G4's intuitive interface, user-friendly sequencing workflow setup and efficient flow cell or reagent cartridge loading. Coming out of the conference, we experienced increasing customer and KOL interest, validation of our value proposition and strong lead generation. While at AGBT, we released several exciting application notes and third-party collaborator posters. Starting with the single cell RNA-Seq application note, this study leveraged the G4 platform to characterize single cells derived from peripheral blood mononuclear cells or PBMCs.\n\nResults were highly comforted to those generated on a NovaSeq 6000, demonstrating that the G4 can be a plug-and-play solution for single cell RNA-Seq workflows compatible with existing lab ecosystems. Moving on to whole-exome sequencing application notes. Libraries were sequenced on a 2/150 F2 flow cell. High coverage uniformity was seen across the exome target regions, resulting in strong variant detection performance.\n\nThis reflects the compatibility of the G4 platform with common exome library preparation kit. In addition to these application notes, we presented numerous closures from third-party collaborators, Resolution Biosciences, Joint Genome Institute, or JGI, and TGen. I will provide a brief overview of some of the exciting takeaways. Resolution Biosciences evaluated the G4 with their Resolution ctDx assay on cell-free DNA.\n\nThe G4 was compared against Illumina NextSeq 550 and provided consistently high read quality, concorded read depth and unique read count and comparable sensitivity and variant detection. The Joint Genome Institute or JGI, successfully used G4 to assemble bacterial genomes with comparable performance and air profile to that of short-read sequencing platforms. TGen tested the performance of the G4 focusing on data quality and access of bearing point for whole exome sequencing. The TGen team knows that the system was easy to use, exhibited a high degree of flow cell reproducibility and met their expectations for variant calling performance.\n\nIn summary, we had a strong quarter on many fronts, especially in areas of data generation and publications. We shipped our first commercial system, announced several important workflow and collaborator partnerships and filled a key leadership role with Sam Ropp as our new chief commercial officer. Now I'd like to revisit some of my earlier comments and provide a summary of where things are going well, where there are challenges and how we are addressing those challenges. First and foremost, the G4 technology in terms of specs and product road map has delighted us internally on the upside.\n\nThe specs are resonating strongly with customers, power, speed, flexibility and the system profiling KPIs are highly differentiated within the benchtop segment. In addition, the specialized application kits and our product road map, most notably Max Read has really put wind in our sales. We believe that the demand for a benchtop instrument that can do high throughput short reads at low cost will be significant. We expect these kids will address some of the most widely run and highest volume applications today, including single cell readout, proteomics library readout, kits for library readout, accounting applications and NIPT.\n\nSince we announced M-Series, the demand has shifted our internal prioritization toward getting the M-Series kits robust and launched as soon as possible. This is an area where the G4 and the M-Series are highly differentiated in the marketplace. No other benchtop offering comes close to providing 4 billion reads per run, and that's just the first kit in our M-Series road map. Additional internal positives on the G4 technology include progressing the F3 kits, which are on schedule to launch later this year and advancing HD-Seq to achieve 250 accuracy at over 100 million reads on our current F2 flow cells.\n\nWe believe the commercial uptake for HD-Seq will be more gradual as it will be application and content specific. However, the unique activity profile in translational and clinical applicability support our conclusion that this will become a sticky and highly differentiated offering on the G4 platform. Long term, differentiation of applications and capabilities and unique content will be important areas of continued focus for Singular. Other activities that are progressing nicely include expanded third-party validations through additional application notes, workflow partnerships and collaborations with innovative companies in the NGS and multi-omic space.\n\nWe have now signed 13 library prep partners to show broad G4 application compatibility with leading library prep kit, and we have published seven papers, three of which were pure authored from early G4 early access partners. Lastly, onboarding commercial leadership in the form of chief commercial officer, as well as the head of U.S. sales were important and exciting steps for Singular this quarter. Now I'll shift gears to discuss some of the challenges that have surfaced and what we are doing to address them.\n\nI will cover three areas. First, manufacturing challenges manifested themselves in Q2 in a variety of escalating in some unexpected ways. Supply of parts to build and scale commercial G4 units has been a growing pain point. Despite ordering long lead time parts and key components very early on and in large production quantities, some vendors have been unable to deliver on time or meet their commitments.\n\nThis has translated to a slower build and scale up of the G4 production units. We are working tirelessly to address these issues in real time. For parts and supplies, we have engaged and qualified secondary vendors across many components. We are pushing our current vendors to meet their obligations.\n\nRight now in terms of ability to scale G4 instruments, we estimate that we are running about three months behind where we would like to be and anticipate some limitations on how quickly we can scale production units in the near term. These supply and vendor-related delays are manageable. We are revisiting our instrument delivery schedules and looking ahead to minimize additional scale up delays in future quarters. Our priority is to ensure that every customer has a positive experience as we ship, install and bring up instruments in the field.\n\nSecond, the macroeconomic environment has changed and many growth-orientated companies have shifted to leaner operating budgets and a focus on extension of cash runway or near-term profitability. We, too, are adapting, taking a leaner approach to building our business with less aggressive near-term hiring and spend. This will likely have some impact on how fast we can scale our teams to support growth. However, this is a trade-off that we believe must be made in the current environment to maintain flexibility.\n\nWe have the right team in place to understand manufacturing scale-up, system installation, field support and sales. We intend to stay lean until we better understand the scale-up of production units and ultimately, the ramp in revenue. Lastly, the macroeconomic environment will likely influence customer buying behavior and demand dynamics. We are working to anticipate the impact, adapt and implement sales tactics to address down cycle sales dynamics where the pace of investment in new technologies may be less aggressive or more driven by near-term cost savings.\n\nOne of the positives of our G4 value proposition is that for a wide range of users switching to G4 or purchasing it over other instruments is a cost savings investment. We believe the G4 will offer consumable savings between 20% to 50% across most kits when compared to a NextSeq. Max Read kits deliver even higher savings. Our approach is to focus on value, cost savings and provide the right simple analysis so customers can view the G4 as a cost savings decision.\n\nAdditionally, we have added more purchasing models to our sales team's toolkit, offering leases, reagent rental and subscription to best align with our customers' needs. In summation, Q2 has been a busy quarter with a lot of positive progress. This is also a quarter where some real challenges have emerged. We are addressing these challenges and are confident they are both manageable and of a transient nature.\n\nTranslating progress and these learnings to instrument placements and revenues will require a growing understanding of four primary operational and commercial factors. The ability to manufacture and scale unit availability, the time frame and resources to install systems, bring up customers and understand consumable pull-through, the level of ongoing field support for existing placements. And finally, how demand continues to grow and translate into purchase orders as macro conditions unfold. I look forward to revisiting these topics on our quarterly calls going forward.\n\nWith that, I will now turn the call over to Dalen to go over the details of our second quarter financial results and some commentary on expectations going forward.\n\nDalen Meeter -- Head of Finance\n\nThank you, Drew. I will start by covering the Q2 2022 financials. Then I'll provide brief directional remarks on our anticipated spend through the rest of 2022 cash runway, as well as our expected production run rate in the coming quarters. Operating expenses for the second quarter of 2022 totaled $24.2 million, compared to $13.9 million for the second quarter of 2021.\n\nThese totals included noncash stock-based compensation expense of $3.6 million in Q2 2022 and $2.3 million in Q2 2021. The year-over-year increase in total operating expenses was driven primarily by our product pipeline and R&D road map and scaling headcount and infrastructure to support our growth and prepare for commercialization of the G4. Net loss for the second quarter of 2022 was $24 million or $0.34 per share, compared to $37.5 million or $1.18 per share in the second quarter of 2021. The year-over-year decrease in net loss and net loss per share was driven primarily by the change in fair value of convertible notes and warrants in Q2 2021, which were converted to common stock with the IPO and are no longer outstanding in Q2 2022.\n\nThis is partially offset by higher operating expenses, as previously noted. In addition, the year-over-year decrease in net loss per share was driven by the increase in weighted average share count used to calculate net loss per share because of the common stock issued in connection with the IPO. Our weighted average share count for the quarter used to calculate net loss per share was approximately $70.8 million. Ending cash, cash equivalents and short-term investments, excluding restricted cash, totaled $287.5 million.\n\nLooking ahead through the rest of 2022, we still expect investment to increase across commercial, manufacturing, operations and R&D, albeit at a more modest pace given the broader market challenges that Drew just outlined. We expect our Q3 weighted average share count used to calculate net loss per share to be approximately $71 million. We are acutely aware of the current macro environment and intend to focus our investments in the highest priority areas. We have historically been capital-efficient.\n\nTo date, we have raised approximately $450 million and have cumulative cash burn of approximately $163 million. We anticipate our existing capital to be sufficient to support our activities into the first half of 2025 or roughly three years. We will continue to manage our prioritization of activities, the pace of investment and phasing of hiring accordingly. Lastly, while we are not providing formal guidance at this stage, we do want to provide some directional commentary to support Drew's earlier comments about some of the challenges we are navigating.\n\nSince shipping our first unit in late June, we are phasing our commercial activity in line with our ability to manufacture, sell, ship and support new customers coming up. As we look out into the second half of 2022 and early 2023, we are anticipating a moderate pace of getting G4 units into the field and generating revenues. As Drew mentioned, we are running about three months behind in terms of our ability to scale G4 instruments. In addition to this later start, we anticipate a gradual ramp.\n\nAs we look toward the rest of 2022, moving into Q4, we expect to deploy one to two systems per month with the goal of understanding each of the four operational and commercial factors outlined, manufacturing scale-up, installation and customer bring up, ongoing support and extended sales dynamics. We expect to enter 2023 with the demand and capacity to ship approximately two to four systems per month, gradually growing that number as we better understand the internal and external factors that will allow us to scale faster. We will be updating you on these factors and expectations as we move forward and implement the learnings gained from initial system shipments, installations, validation, acceptance testing and early customer utilization. This may take several quarters, but we remain committed to providing more formal guidance at the point we feel it can be reasonably predicted and estimated.\n\nThank you, and back to Drew for closing remarks.\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nThank you, Dalen. We are excited to advance our business and transition to the commercial stage with products in the field serving and pleasing our customers. We believe it's vitally important to be patient and disciplined during this stage to make sure we understand our business, to lay the right foundation for scalable success and to ensure a positive customer experience for every system placed. Many of the valuing attributes that have enabled Singular to advance quickly and effectively as an organization in its precommercial and development stages will be equally important moving forward, just as we have taken a stage-based, substance-driven and financially disciplined approach to develop our science and technology, we plan to extend these principles forward as we turn to manufacturing and commercial scale-up.\n\nOver the next few quarters, we will be laser-focused on addressing manufacturing scaling on understanding customer installation and system bring up and instrument field service and support parameters. We will also learn more about the sales cycle and translating demand to orders. As we look toward the end of this year and begin to think about 2023, Singular Genomics is well-positioned and our long-term thesis is robust. Near-term challenges, while real, are both manageable, transient and not related to the fundamental value proposition of our business.\n\nOur technology is powerful and unique. Our initial product and product road map are highly differentiated. We are entering high-growth markets, and we have the right team in place with a strong balance sheet that will allow us to build a highly successful business. Joining me for Q&A, we have Eli Glezer, founder and CSO; and Dalen Meeter, head of finance.\n\nNow let's open it up to questions. Operator?\n\nOperator\n\n[Operator instructions] Your first question for today is coming from Dan Brennan. Please announce your affiliation, then pose your question.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nIt's Cowen. Congrats, guys. Maybe just kind of digging into a bit of the manufacturing countries. Can you maybe elaborate a little bit on specifically what the constraints are and maybe what the visibility is toward alleviating these constraints as we look ahead?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nYes. Sure, Dan. This is Drew. There's really a couple of parts to it.\n\nThe first part is very simply put, some of the more complex aspects of the systems have just been hard to come by in terms of getting the parts in on time. And when we think about manufacturing and scaling up, it's really the type of activity where it comes in phases. Initially, you have all your parts coming and you're building your first instruments, not until you have a number of instruments built and up to scale. So you go into the next part, which is really integration of the instrument validation and testing.\n\nIn each of those phases, they take time. We had hoped that we could kind of compress that second phase. But the reality of not getting all the parts in and having to work through the normal bring up challenges and then moving into that second phase has kind of put us where we are right now. We really need to understand the fundamentals of each one of those phases, getting in all the parts, being able to scale up a high number of instruments and then working through all the validation and bring up this typical of a highly complex instrument.\n\nSo there's not really anything specific other than we need that time for each one of those phases and some of the complex parts have really just been hard to come by, not delivered on time, and we've had issues with vendors kind of getting things here on time to get those builds going which has had a cascading effect.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nAnd maybe just related, Drew, so I guess, as we progressed over the last few quarters, it sounds like this is kind of new, you guys hand explicitly guided to manufacturing, but we hadn't heard like something specific that was a bottleneck. And obviously, we're dealing with hyperinflationary environment, global supply chain issues, but net-net, is this something that you guys foresaw three to six to nine months ago? Is this something like over the last month that kind of manifests itself. Maybe you can give us a little bit more color. And then, again, as we think ahead, it sounds like you're talking about somewhere in the zip code of six to 12 increments per quarter is what you can make right now, and that's what the demand is.\n\nI'm just trying to get a sense of how do we get confidence that the bottlenecks will be alleviated, whether by Q4 or Q1 or Q2 of next year?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nYeah, I mean, to your first part of your question, we have mentioned a few times earlier this year that there were challenges to the supply chain. I think, repeatedly, we said we're not immune to it. I think, the extent of those challenges as you kind of candidly kind of articulated kind of really came to a head over the last three months or so. And I think, the other realization we had is there's two ways to go.\n\nOne way is to try and rush things out as quickly as you can and other ways to kind of stay disciplined on the fundamentals of understanding each of those phases. And I think, we've always been careful not to get out of our skis. We are not hand saying that we couldn't be shipping instruments sooner, but in order to take the right type of stage-based approach and really understand what scale it looks like and really understand what the machines look like running at scale across many, many instruments. I mean, we want that visibility to understanding that reproducibility, that robustness to be crystal clear before we start putting high numbers of units out there in customer hands.\n\nSo it's really just kind of that supply chain issue coming to a point. And then also, us looking at ourselves in the mirror and saying, hey, we had planned x amount of months to do integration testing, internal scale-up of our R&D units or application lab. Do we think we can go faster on that part. And I think, we would be making a long-term mistake if we compress that really important time to have the learnings internally for ourselves.\n\nAs we move forward, again, we don't see anything here that's not transient. I mean, the biggest issue has been getting the parts here on time and being able to work through all the typical challenges that come with assembling highly complex instruments. Nothing fundamental about the design of the instrument. We are working with suppliers.\n\nWe think we do have a clear line of sight to making sure we have the parts we need as we calculate out this phase into the next phase, which is getting our first six, 10, 15 units out there, I think the caution in units is really just us trying to make sure that we understand how those units behave in the field before we start predicting anything more aggressive. So the attempt is to provide transparency in how we're seeing the business, and that's on the supply and the demand side, we've had really strong robust demand. In fact, given our capacity right now, we likely have demand that essentially takes up our ability to fly it to the rest of this year. Moving into the next year, I think we have to understand those four pillars that we outlined in the call with manufacturing scale capability, its time frame to bring up a customer in the field and what that bring up looks like in terms of instrument pull-through and resources to support it.\n\nIt's ongoing support. And then, the last part is the demand side on the commercial side. What is extended execution commercially looks like on the boards of initial interest in adopting a new platform, scaling it past 20, 30, 40, 50 orders, it's going to take a lot of understanding of really how to feel the business and we're still kind of getting that under our feet.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGot it. And maybe one final one, I'll get back in the queue. So I guess, you guys didn't provide any official guidance, right? But I mean, we've got 26 boxes this year and 85 next year. Sounds like it's kind of on an as go-ahead basis, but just -- I mean, what could you comment how should we be thinking about the potential for placements? Because it sounds like from your comments, obviously, you're seeing demand is kind of at capacity right now.\n\nSo it sounds like the funnel is there. How should we be thinking about where we stand today? What's realistic?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nYeah, I think, we really -- we put the first unit out there. We are working with the customers that have already put orders in. At this point, we really need to get the next few units coming off the line internally and get those into our applications lab, our customer care lab. So for this quarter, I think we're probably putting those units internally.\n\nAs we move into Q4 from a supply and manufacturing capacity, we think we can do one to two per month. And we have demand that will absorb that through POs through the rest of this year. As we look into next year, again, we're trying to provide the right type of goal post. So moving into next year, we think given all those factors, it's two to four units per month entering next year beyond that first month or two or three, I think we're going to have to learn more before we can tell you exactly what that ramp looks like.\n\nSo that's just us trying to -- given the information we have right now, provides you kind of what the next six to nine months look like.\n\nDan Brennan -- Cowen and Company -- Analyst\n\nGreat. OK. I'll get back in the queue.\n\nOperator\n\nYour next question for today is coming from John Sourbeer. Please announce your affiliation, then pose your question.\n\nUnknown speaker\n\nHello. This is actually Christian on for John with UBS. My question is more just high-level revolving around the funnel that you guys have, not quantifying it. However, I'm just curious if it skews any direction regarding like the end market or use case for evolving around like the academic labs, clinical research or emerging? Thank you. \n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nYeah. I think, we've actually been pretty purposely addressing each one of those market segments. What I would say in general is the application specifically where we're seeing a ton of interest are largely around applications that require the short reads in the M-Series that's been something that really has a lot of uptake. Core Labs also are an area where there's been a lot of interest due to the flexibility of the sequencer for flow cells individually addressable lane.\n\nWe are solving or offering a very unique solution there since lot of these Core Lab sell individual lanes or have multiple PIs that they're servicing. So alleviating those batching or sample compatibility issues that typically those lab space is something that's really positive. On the industrial side of things, I think there's going to be a lot of interest in the high-volume NextSeq shops, but a lot of those are clinical companies. And for those types of companies or labs, I think it will just take a little bit more time.\n\nWe are going to have to get instruments out there, kind of understand robustness, reliability of the instrument. But over time, there's a high interest level of kind of the high-volume NextSeq shops just since this is such a compelling alternative versus a NextSeq. I mean, it's in a very simple way to think about the single box knocked out four or five NextSeq 550 to two or three NextSeq 2000. So it's cheaper capex and cheaper operating expenses with faster turnaround time and more flexibility.\n\nSo that's a huge focus for us longer term. There's a lot of very good initial customer prospects there. We are taking orders from those types of customers. But what the real goal there is not to put a single box or two to find those labs have 20, 30, 40 NextSeq and figure out how you convert a large number of those instruments.\n\nAnd then, the last area that we mentioned are the kind of growth companies and emerging growth, I think, is what we call them. And I think, there is also a lot of interest. However, I think, we just need to get more instruments in the field and get some data out there. If you're buying your first sequencer or you're covering every dollar, I think you really want to make sure that you're buying something that's going to come with robustness and it's going to work the way it needs to.\n\nSo I think, we're addressing all of those issues. Holistically, there's been strong interest on all of those types of customer profiles.\n\nUnknown speaker\n\nThank you.\n\nOperator\n\nYour next question for today is coming from Julia Quinn. Please announce your affiliation, then pose your question.\n\nUnknown speaker\n\nHi. This is Amy on for Julia. Thank you for taking my question. My first question is about the consumables.\n\nDid you guys see like the manufacturing issue is having an impact on the consumables? And also for the change in customer demand or customer behavior, is this also affecting the consumables or the kits and the flow cells?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nNo, the manufacturing challenges at this point are really on the instrument. We haven't seen any real showstoppers or delays in the consumables. So those are on track. The instruments are really where there's been a little bit of a struggle to get some of the parts here in time and that quantity.\n\nOn the customer side of things, I don't think in the academic side, we have seen much of a change in terms of buying behavior or at least interest. And I think, a lot of that probably has to do with budgets being put in place in advance of the actual purchase decision in the buying cycle. I would definitely say emerging growth companies that raised money, they have to advance their R&D. So there's not anything there that's changing, although I would say there's definitely a general feeling of people trying to be leaner and more cost conscious.\n\nBut I think that's an area that plays to a strength of ours. On the larger company side, I think that's probably where we see the most difference in mindset. If you have larger companies that are running large labs and many, many sequencers adopting new technology or willingness to invest upfront for longer-term savings. It's something that I don't think people are thinking about now the same way they were a couple of years ago.\n\nSo I think that's probably the segment that's most affected by the current market. It's larger companies or growth companies that are either profitable or near profitable that are more worried about getting to profitability or increasing their operating profits who are less likely right now to take any risk or put capital out for new technologies. So in summation, I guess, I'd say two of the markets are probably -- we haven't seen much of a change. And one we have seen a little bit different of a sentiment in terms of adoption of new technology.\n\nDalen Meeter -- Head of Finance\n\nAmy, just one thing to add. This is Dalen. In terms of the customers that may have a challenge affording a box upfront with a large capital outlay, we have implemented some alternative sales models that we're putting in the sales team's toolkit. The whole idea there just being make sure that we give them the tools they need to sell into customers that may have a challenge with that upfront investment through some type of a reagent rental lease, subscription, some alternative model that could make it a little bit more appealing for them.\n\nUnknown speaker\n\nOK. Thank you. That's very helpful. My next question is regarding like the PX system.\n\nSo did you guys see the manufacturing issue affecting the shipment of the PX system?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nWe haven't, I guess, gotten far enough along the PX system, where manufacturing at scale would be an issue. We are currently bringing up a handful of internal data units. To my knowledge, I don't think we've had any issues there, getting those small number of instruments up and running. So I guess, the short answer is we haven't had manufacturing or parts for the PX.\n\nBut again, it's in a much different stage. We are bringing up a small number of internal betas, which is different than bringing up in ordering high numbers of parts for commercial launch.\n\nUnknown speaker\n\nOK. Thank you. That's very helpful. So my last question and then I'll back in the line.\n\nSo since you guys mentioned that G4 is three months behind. So for now, when do you guys expect to see revenue recognition for G4 systems?\n\nDalen Meeter -- Head of Finance\n\nAmy, I think, a safe assumption from a modeling standpoint would be Q4 kind of the later part of the year.\n\nUnknown speaker\n\nOK. That's very helpful. Thank you so much.\n\nOperator\n\nYour next question for today is coming from Matt Sykes. Please announce your affiliation, then pose your question.\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nIt's Matt Sykes from Goldman Sachs. Hey, Drew and Dale, and thanks for taking my questions. Maybe just my first question, just given the sort of shipment schedule you guys laid out due to some of supply constraints, assuming demand is outstripping the supply constraints in your shipment schedule presumably, you'll be building a backlog of orders over the course of the next six to nine months. How do you keep -- if that is the case, how do you keep those customers -- potential customers engaged in terms of communication on potential delivery so that you don't necessarily lose those orders, your building backlog.\n\nOr are you just simply only fulfilling and taking orders for instruments you can actually ship?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nIt's a really good question, Matt, and candidly, one that we debate live currently. I think, it's one of those things we're kind of like lack of hole where is solved one thing and all of a sudden it shifts to the other. Right now, it's really a discussion with prospective customers and us being transparent on when we can get them an instrument. There are some customers that I think just want to get in the queue and are willing to wait.\n\nThere are other customers that want to know if they put in the field, they're going to get an instrument a certain amount of time. And in that case, it's either shuffling priorities. If we can internally on who gets the next instrument or it's gone, and let's reengage later. We can't commit to that.\n\nI think, there's probably a healthy amount of lead time between taking an order and shipping it, and that's what we're debating right now. But I think that range is somewhere in the three to six months, and that's kind of what we think we need visibility to. If we can't tell you you're going to get an order ideally within three months, probably we want to keep the customer warm and make sure we continue to develop that relationship. But I think, it becomes a little tenuous if you're trying to take orders for instruments, you're not able to commit to you with 100% certainty that you can ship within less than six months, just feels uncomfortable.\n\nSo as we move into next year, that's really what we want to understand. The supply side in terms of being able to scale up the instruments, we'll have a much better understanding. And I believe we will be past this current kind of supply and instrument bring that issue. But we'll also understand the demand side much better, and I think we'll have a better idea of figuring out how we can communicate to customers, keep them warm and make sure that we can meet their expectations on getting an instrument if they put an PO.\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nGot it. Thanks to you. That's really helpful. My second question is just you mentioned you're taking on some secondary suppliers to deal with some of the constraints that you have on some of the parts.\n\nIf you utilize some of the secondary suppliers, how do you ensure that you're not necessarily compromising the performance of the instrument, meaning, obviously, these first couple of instruments that go on to the market are really important from a validation standpoint in terms of performance. But if you're having to utilize secondary suppliers because of just constraints that are lasting longer than you think, like how are you ensuring that are you validating these new parts does that take time? Just want to understand the thought process there.\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nMatt, it's a really good question. Eli is here. I think, he's probably the right one to answer that. So I'll let him kind of address that, but you hit on some key points.\n\nEli Glezer -- Founder and Chief Scientific Officer\n\nYeah, Matt. I think, for a lot of the really performance critical components, we already have existing relationships and are far along in those. There are some other parts that we are looking at second source in general, wherever possible, we're trying to build up second source options. It's just -- it's a good general practice and safety precaution.\n\nSo in terms of your question around improving those parts out, certainly that's part of the ongoing process is if we're going to switch to a different vendor for a part, we would validate those some things rise to higher level of validation than others. So yes, definitely paying attention to that.\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nGot it. Thanks. And just one more question. Just as you look across your customer segments, academic, commercial, emerging.\n\nOn the commercial side, I mean, this is a potentially very large market. But even some of the larger labs are probably having some funding issues and are raining in costs. Is there a certain constraint around the time and resources, maybe not necessarily dollars, but timing of resources around the validation that they need to do? And is there some reluctance on the part of them to go through that validation because of the commitment of those resources? Or is your presale service that you mentioned trying to alleviate that potential bottleneck or reluctance on the base of customers?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nMatt, another good question. I'll be candid. I think, over the last few months, there's been a lot of people that are completely focused on one thing and that figuring out how to create a leaner business and that's taken the majority of their mind share. I think that will start to shift once people get their houses in order and make the necessary changes, and that will provide more of an opportunity to engage.\n\nSo I would say there's probably a few months where there were a lot of businesses where management team were frankly just really concerned about that. I think, it's starting to turn. We are starting to turn the corner on that. I would say the other part to your question is, yes, getting broader adoption or transitioning fleet of instruments when you have a business built upon that technology that you know works with predictability, it's a pretty high bar.\n\nAnd I think that's why when we spoke about that customer profile, getting those guys to buy one or two systems and starting to work on a validation of their assays on our systems, that's just the first step. And the customer care lab helps, but really, it is a big decision and it's one that doesn't happen very quickly. So it's really a staged approach. First, we have to make sure they have confidence in the system in terms of robustness and being able to meet their needs and providing a cost advantage or some type of a value differentiator for them.\n\nAnd then, when we think about moving through those different stages, it will take time to get them comfortable with the system to get comfortable with multiple systems. So it's really not something that I think happens all at once. First, you need to get mind share and willingness, then you need to work with them kind of in a very stage-based approach. And over time, I think, as you generate trust and confidence, that's how you could potentially get these larger labs to ship.\n\nAnd that's absolutely our goal.\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nAll right. Thanks for the call. Appreciate it.\n\nOperator\n\nYour next question is coming from Michael Ryskin. Please announce your affiliation then pose your question.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. This is Mike Ryskin, Bank of America. I got a couple of smaller questions.\n\nI want to follow up from earlier comments and one big picture one at the end. First, on the supply chain challenges, any specifics you can give us on exactly what it is that you're running into? Is it semiconductors? Is it something in the microfluidic imaging. If you could just give us some color on some of the specific components that might help us sort of get a sense for what's going on?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nYeah, I think, in general, you can kind of put in the electronics category. I don't think we want to go into specific components, but there's been some more complex electronic related components that, again, have just been in short supply. Our vendors have not been able to meet their commitments, and that's kind of created a cascading delay. That's probably the most general and accurate way to think about the supply, the nature of the supply chain issues.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGot it. And so, the cadence you kind of laid out one or two systems per month the rest of the year and then two to four as you enter 2023. The supply chain issues you're talking about, they're continuing to persist and they're not really -- in some cases, they're abating, in some cases, they are not. So I guess, my question is, is there any chance that accelerates? Is there any chance that end up being slower, where we were chatting again in three months, and it's taking longer to process this.\n\nI guess, there's still risk. So how much confidence do you have in that time line and that cadence you're watching out?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nYeah. I think, we're pretty confident that we'll be able to and are working through kind of the current issues, and we should be able to meet that much more modest schedule. And again, I think, beyond Q4 moving into next year, I think the more time we have, the more visibility we'll have on our ability to scale up. So I don't know, Eli, if you have anything to comment? I mean, Eli has been working this very closely.\n\nEli Glezer -- Founder and Chief Scientific Officer\n\nYeah, I mean, it hasn't been sort of just a single thing. It's an accumulation of things over time in the development. And so, for us to get through all of the testing integration has required a period of time, and that was sort of pushed back by some of those delays. Going forward, we want to be realistic in getting a modest number of instruments out in the field, making sure everything goes smoothly, making sure there's no issues observed when the instruments are out in the field.\n\nSo that's also part of our thinking going forward. And then, we expect to have parts on hand to be able to scale up beyond that.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nOK. One more quick one and then -- and the big picture one. So you also kind of talked about investing only in the highest priority areas, more disciplined spend in the business. As we think about the P&L for the rest of the year for the next couple of years, where are we making the biggest adjustments? I mean, I think, it kind of makes sense on the commercial organization given you're being more careful in your rollout.\n\nBut are there any cuts to R&D? Are there any cuts to capex? Sort of walk us through the model a little bit on the changes for the spend?\n\nDalen Meeter -- Head of Finance\n\nYeah, hey, Mike, this is Dalen. I think, it's less about cuts and more about just a slower pace of growth, more measured based on how we see things scaling and then ultimately trying to scale our expenses in line as we have better line of sight to the ramp in revenue. So you can expect to see expenses increase in both R&D and SG&A here through the second half of the year. I think, we -- from a modeling standpoint, we previously said 2022 expense is expected to roughly double 2021.\n\nI think, you can expect that that's going to be slightly lower for the year based on kind of the slower ramp in the delays. And just looking here in the second half, you can expect that expenses will increase over the first half across all functions.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nOK. All right. And then, last one. I realize you haven't really had a guide or any commentary on pacing previously or quarterly cadence.\n\nBut still, I mean, we -- you met with investors, you met with analysts as recently at AGBT, a little over two months ago. And at the time, you sounded quite bullish on the ramp and on the operations. So I'm just wondering, is this something that really didn't have that much visibility until June and July? Sort of how much does the situation really deteriorated in the last month or two versus what might have been evident earlier in the year? Thanks. \n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nYeah, I think, we're still incredibly bullish. And I think that the demand and the engagement is still very positive. And so, there really hasn't much changed on that side. I think, there's been really a couple of things.\n\nThe first one is it really did come to a head in what the delays of parts were going to result in over the last month or two, meaning we thought and had hoped that there was a best case scenario where given the delays in parts and given some of the challenges with getting vendors to meet their commitments, we could still potentially compress that phase that we spoke about, which is really bringing up the instruments, doing the testing, the validation and getting the reps done. And I think, it was partly fully realizing the supply and vendor issues, but also taking a step back and saying, is it most important for us to be rushing instruments out? We have willing customers. We have orders in, we could be putting instruments out right now? Or do we need to make sure we take our time to understand what this instrument looks like on an extended bring-up basis? And what does reliability look like in robustness? And are there any ways that we need to really understand fundamentally what customer bring up looks like. So I think, it was really both.\n\nAnd I think, if we take a step back, when we think about long-term success, the last thing we want to do is get out over our skis and how customers have negative experience with instruments. And we need that time to bring the instruments up to scale and to service our internal needs first. We need to get units into our applications lab into our customer care lab into R&D hands. And it's just a matter of building the right foundation to have bigger success longer term, and we just need the extra time right now.\n\nSo I think, it's -- we remain as bullish as we've ever been on the opportunity on the customer side. We have people waiting for instruments, but we need to take the time to get it right before we start putting instruments out there and having people actually rely on them to generate their data for them.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nYou have a follow-up question coming from Dan Brennan. Dan, your line is live.\n\nUnknown speaker\n\nThis is Tom on for Dan. Just a quick follow up. One more on the PX and kind of your outlook for cost control. So I was kind of wondering that slowing of hiring happening in the R&D side? Or is that kind of more concentrated on your sales and marketing effort? And then, the kind of follow-up is how you expect commodity your kind of sequencing as approach with PX with your proteomic kits coming out in the Q4 earning.\n\nThanks.\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nI'm not sure we caught the first part of the question. Could you repeat the first part?\n\nUnknown speaker\n\nSure. Yes. It was more on the cost control side. So is that affecting research and development in any meaningful way for the PX?\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nNo, it's not going to affect any room to the PX. We've had kind of an insulated and dedicated team on the PX. That being said, there have been a few people that have been pulled over to the G4 that is a priority. We've got to get the G4 out.\n\nThere's probably been a few decisions we've made around additional longer-term road map activities or products where we've deprioritized or shifted resources. And I think, in general, the mindset a year ago was essentially build it and they will come, build manufacturing, build commercial for Max scale and make sure you have those people there ready for it. And now, I think, it's more of a hire people when we have a clear need for them and make sure that we scale each part of the business appropriately based on the need. So I would say R&D is the least affected by it.\n\nPX is still moving forward. G4 is the focus right now and leaner spend across the rest of the organization in a more kind of base based approach as we see revenue ramp.\n\nUnknown speaker\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPhilip Taylor -- Investor Relations\n\nDrew Spaventa -- Founder and Chief Executive Officer\n\nDalen Meeter -- Head of Finance\n\nDan Brennan -- Cowen and Company -- Analyst\n\nUnknown speaker\n\nMatt Sykes -- Goldman Sachs -- Analyst\n\nEli Glezer -- Founder and Chief Scientific Officer\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nMore OMIC analysis\n\nAll earnings call transcripts"
}