{
  "companyName": "Sight Sciences, Inc.",
  "companyTicker": "SGHT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/12/sight-sciences-inc-sght-q2-2022-earnings-call-tran/",
  "content": "Sight Sciences, Inc. (SGHT 1.75%)\nQ2 2022 Earnings Call\nAug 11, 2022, 4:30 p.m. ET\n\nOperator\n\nHello, and welcome to the Sight Sciences second quarter 2022 earnings results conference call. [Operator instructions] I will now turn the call over to Mr. Philip Taylor, investor relations. Please go ahead, sir.\n\nPhilip Taylor -- Investor Relations\n\nThank you for participating in today's call. Presenting today are Sight Sciences co-founder and chief executive officer, Paul Badawi; and chief financial officer, Jesse Selnick. Earlier today, Sight Sciences released financial results for the three months ended June 30, 2022. A copy of the press release is available on the company's website at investors.sightsciences.com.\n\nI'd like to remind everyone that comments made by management today and answers to questions will include forward-looking statements within the meaning of the federal securities laws. Those include statements related to Sight Sciences' anticipated financial performance and operating results, market opportunity, the future impact of COVID-19 on operations, business strategy and plans for developing and marketing new products. Forward-looking statements are based on estimates and assumptions as of today and are neither promises nor guarantees and are subject to risks and uncertainties that may cause actual results to differ materially from those expressed or implied by these statements. A description of some of the risks and uncertainties that could cause actual results to differ materially from those indicated by the forward-looking statements on this call can be found in the Risk Factors section of the annual report on Form 10-K filed March 24, 2022, and other filings with the Securities and Exchange Commission.\n\nThe company undertakes no obligation to publicly update or revise any forward-looking statements, except as required by law. For more information, please refer to the forward-looking statement notices and risk factors in the recent SEC filings. I will now turn the call over to Paul.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nThank you, Tripp, and thank you, all, for joining us. Our second quarter 2022 performance was strong across the organization. Revenue increased to $17.2 million, representing 37% growth year over year and 16% sequentially. Our total gross margin increased to 84% in the second quarter, up from 82% in the prior-year period.\n\nSurgical glaucoma revenue grew 33% year over year and 15% sequentially to $15.9 million, while dry eye revenues grew to $1.3 million, up 143% year over year and 32% sequentially. We are pleased with our execution across both businesses and are encouraged by the leading indicators to support further market penetration and expansion. A year out from our IPO, it is readily apparent that we have steadily emerged as the market leader in MIGS. Our analysis indicates that OMNI's growth continues to outpace that of other MIGS products.\n\nWe intend to extend our lead over the coming quarters and years, both with continued share growth and market expansion. We remain in a favorable position with over $200 million of cash on our balance sheet to fund our strategic initiatives and growth plans. Since our IPO, external factors across the MIGS market and the global economy have changed the operating environment significantly. In response, we have fine-tuned our strategic and operational plans to help us thrive in today's evolved market and ensure our long-term success.\n\nMy remarks today will focus on these topics. Jesse will then discuss how we believe our growth trajectory and disciplined expense management will facilitate our path to profitability over the medium term, while maintaining a very comfortable liquidity position. I'll now move on to our two strategic growth initiatives in surgical glaucoma: one, increasing adoption and utilization of OMNI in the established combo cataract MIGS segment; and two, pioneering the $5 billion U.S. market for stand-alone MIGS.\n\nOMNI continues to win share in the combo cataract segment and expand the stand-alone MIGS segment because of its duration of efficacy and safely lowering and maintaining target IOP; broad indication for use; precision engineered usability; and Category 1 CPT code recognition. Our ever-increasing confidence in OMNI's ability to continue to both gain market share and expand the market in MIGS is predicated on its mastery of these four critical concepts. Years of research and development have culminated in an intuitive and elegant device that allows surgeons to consistently achieve clinically meaningful outcomes, along with the safety benefits of a minimally invasive approach. Our growth came from continued new physician training, increasing active ordering accounts, repeat orders, strong utilization and extremely minimal account churn among a MIGS market that includes multiple new product.\n\nWe continue to win because of our strong fundamentals and our unshakeable bedrock of placing our patients at the center of everything we do. We have discussed previously the headwinds from the trialing of new entrants and the resulting confusion in the marketplace. As we expected, the surgical community has quickly learned what these products can and cannot do. We have seen medical societies and payers make strong statements clarifying and limiting the coding and reimbursement pathways for some of these new entrants, based on whether the procedures meet the clinical or medical requirements necessary to be reported with existing procedure codes.\n\nSome of these products have, at best, very limited indications because quite simply, they are not supported by sufficient clinical evidence that they can improve patient outcomes. We anticipate trialing of these products will continue in the second half. These trials can impact the adoption cycle for new OMNI users and result in pockets of account ordering softness in certain subsets of customers. At the same time, we have seen many accounts cycle through these trialing programs and subsequently return to OMNI.\n\nOverall, we believe trialing impact will be transitory. Regarding reimbursement. CMS issued proposed payment rules for 2023 last month. As a reminder, OMNI is billed under Category 1 CPT code 66174.\n\nThe professional fee for 66174 was revalued by the ROC in 2021 and scheduled to be reduced in value. The Medicare payment was reduced from $950 in 2021 to $750 in 2022 and is proposed to continue this phased and final reduction to approximately $600 in 2023. Revaluation for professional fees for Category 1 CPT codes typically last for five years. So we would not expect any further adjustments to the 66174 pro fee for several years.\n\nOn the facility fee side, CMS did not propose to designate CPT code 66174 as a device-intensive procedure for ASCs in 2023. We continue to believe device-intensive status would represent a fair, appropriate and deserved adjustment, if and when it happens. Nonetheless, in the interim, our competitive position, underpinned by superior efficacy and patient outcomes remains very strong, as evidenced by our continued share growth and market expansion. We do not foresee any meaningful hindrance to our ability to continue to penetrate the combination cataract segment and grow stand-alone usage of OMNI over the long term.\n\nThe outstanding real-world outcomes and the robust clinical data published in reputable peer-reviewed journals support our belief that OMNI's adoption by the ophthalmic community will continue to grow. Turning now to our second strategic initiative, accelerating adoption of OMNI as the leading stand-alone intervention. For POAG patients who do not require cataract surgery, the current standard of care relies on the increasing use of topical eye drop medications to limit progression of the disease with the objective of deferring conventional, more invasive surgical procedures for as long as possible. We believe that OMNI, given its indication for use, safety profile and reliable duration of efficacy, offers the perfect product market fit for stand-alone interventions earlier in the treatment continuum for mild to moderate POAG patients.\n\nClinical trials have demonstrated that OMNI can safely and consistently lower IOP and reduce dependence on medication, independent of cataract surgery. Our market research indicates that 85% of glaucoma patients would likely choose a stand-alone intervention using OMNI if recommended by their doctor. To drive adoption of OMNI as a stand-alone procedure, our efforts concentrate on raising awareness and educating the glaucoma community. We strategically placed our glaucoma clinical consultants in territories with numerous qualified OMNI-trained surgeons.\n\nGCCs communicate the potential benefits of stand-alone OMNI procedures to office-based primary care eye doctors who serve at the front line of POAG diagnosis and treatment. They also certify that their assigned surgeons are ready for stand-alone cases. Although the GCC program just launched earlier this year, we are already beginning to see results. In the second quarter, GCC accounts demonstrated meaningfully higher sequential growth than non-GCC accounts.\n\nThese initial results are by their nature inconclusive, but directionally very encouraging. Also, preliminary projected claims data from a well-respected advanced analytics provider indicate accelerating stand-alone usage of 66174. Projected claims using 66174 alone for the first five months of 2022 have already exceeded those for the first six months of 2021 by almost 30%. We believe both of these data points regarding stand-alone adoption are informative and look forward to sharing additional measures of progress as our initiatives mature.\n\nOur success with OMNI has provided us with a unique perspective on the MIGS market. While OMNI has the indication, safety profile and efficacy to meet the needs of the vast majority of surgeons and patients across the POAG spectrum, we've identified three distinct smaller, yet important customer segments who prefer MIGS solutions that can be performed more efficiently, more easily or more cost effectively than OMNI. First, the more efficient MIGS segment consists of ultra-high volume cataract surgeons with very mild POAG patients. For these accounts, where every minute matters in a full OR schedule, efficiency can be as important as significant IOP reduction.\n\nSecond, the easier MIGS segment consists of academic institutions and training facilities where residents and fellows learn MIGS for the first time. We expect these surgeons who first learn MIGS on easier-to-use devices and procedures such as goniotomy will eventually transition to OMNI for broader use cases as they gain surgical experience. And finally, third, the more cost effective MIGS segment consists of facilities who may emphasize procedural profitability. To meet the specific needs of these subsegments, we engaged our internal innovation engine to design our new breakthrough SION bladeless goniotomy device.\n\nWe believe that just like OMNI and TearCare, our best-in-category canaloplasty and MGD devices, SION will be the best-in-category goniotomy device. SION is the world's first and only bladeless goniotomy device. It's designed to allow surgeons to smoothly, efficiently and reliably excise and remove several clock hours of disease trabecular meshwork tissue, the ab interno approach. Unlike bladed devices that cut tissue, SION's bladeless design, micro-engineered and precision manufactured using specialized lasers, excises tissue without cutting.\n\nInstead, SION grasps and removes diseased tissue as the surgeon sweeps the instrument around Schlemm's canal with a single smooth motion. We believe the SION procedure fully satisfies the American Academy of Ophthalmology's definition of goniotomy and aligns perfectly with CPT code 65820, goniotomy. We do not foresee any ambiguity from payers or the medical community regarding SION's ability to perform a true goniotomy. We believe experienced surgeons, and perhaps even more so, MIGS surgeons, residents and fellows in training at academic institutions will absolutely love the gentle and less stressful bladeless design.\n\nWe are soft launching SION among select surgeons this month with plans for a more comprehensive launch in the fourth quarter. A handful of cases have already been performed, and initial feedback has exceeded the lofty expectations we have for all of our products. We believe there will be minimal use case overlap between SION and OMNI. SION will enable broader penetration of the market through our existing surgical glaucoma sales force and allow us to develop strong early relationships with surgeons learning MIGS through goniotomy.\n\nIn situations that require more robust IOP lowering, such as late mild to moderate or severe, combination cataract patients and all stand-alone patients, or in other words, the vast majority of the POAG addressable market, we believe OMNI will remain the procedure of choice as it is today. Our third strategic growth initiative is developing fair market access and reimbursement for dry eye treatment procedures. As demonstrated by our results, TearCare continues to make significant progress in the current cash pay environment. Supported by data from our OlympiA RCT, TearCare was cleared by the FDA in 2021 for evaporative dry eye disease due to meibomian gland dysfunction.\n\nWith this expanded indication in hand, our commercial team has the freedom to articulate the full benefits of TearCare, consistent with the compelling clinical evidence from OlympiA. We expect our currently enrolling SAHARA RCT to provide the clinical foundation for our market access and reimbursement strategy. A key objective of SAHARA is to illustrate the superior clinical outcomes of TearCare treatments relative to daily use of the market-leading dry eye prescription eye drop, Restasis, at six months. We are on pace to complete patient enrollment in SAHARA in the fourth quarter and aim to provide an update on the superiority endpoint by the second half of 2023.\n\nIn other clinical updates, we had three clinical studies accepted for peer-reviewed publication. First, we're excited to share that long-term, three-year safety and efficacy outcomes for canaloplasty alone, performed with OMNI and its predicate device, were accepted for publication in the leading Journal of Cataract & Refractive Surgery. In this study, preoperative mean IOP of 21.1 mmHg on an average of 2.0 hypertensive medication dropped to a mean postoperative IOP of 15.3 mmHg, plus or minus 3 mmHg, on less than one medication at 36 months, plus or minus six months. Next, the results of our U.S.\n\nprospective multicenter GEMINI study were published in Clinical Ophthalmology. GEMINI measured the effectiveness and safety of OMNI using combination with cataract surgery in patients with mild to moderate open-angle glaucoma. The results of the study demonstrated that canaloplasty and trabeculotomy performed using OMNI, in conjunction with cataract surgery, significantly reduced unmedicated mean diurnal IOP and medication use in patients with OAG. Moving beyond OMNI.\n\nOur third study accepted for peer-reviewed publication this quarter is related to TearCare and will be published in Clinical Ophthalmology. This article analyzed the symptoms data from our OlympiA RCT and showed that TearCare performed significantly better than LipiFlow in improving quality of vision and overall dry eye disease symptom frequency determined by OSDI and SANDI in subjects with more severe gland dysfunction. We are very happy with the findings of all three studies and articles, and we are excited to leverage our mounting library of clinical evidence to drive continued adoption. We have kept a close eye on market development and have adjusted our clinical program to better suit our needs going forward.\n\nWhen we conceived our twin 459-patient TRIDENT and PRECISION RCTs several years ago, we believed OMNI would require large RCTs demonstrating superiority versus the then market-leading growing trabecular microbypass implants to gain traction. The rapid penetration of OMNI, especially following its expanded clearance last year, coupled with the declining use of trabecular bypass implant, has allowed us to rethink our clinical strategy. It is clear to us that the market requires no further proof that OMNI is the most effective trabecular canalicular MIGS procedure for POAG, and that we can redirect our clinical investment to more focused and streamlined clinical trials that will allow for faster enrollment completion and clinical data generation without sacrificing clinical impact on the market. To that end, we are simplifying the protocol for our PRECISION RCT to focus on the pivotal canaloplasty-alone IDE arm, which will significantly speed completion while delivering the most important clinical data needed from the trial; prospective multicenter data on canaloplasty alone.\n\nWe will also be redeploying resources dedicated to our large, multinational TRIDENT RCT in Europe, which we are in the process of terminating, to focus instead on smaller, yet fully effective clinical studies in select European markets. We are excited to continue advancing our goals in Europe more cost effectively, efficiently and systematically going forward. Our updated clinical strategy is part of a broader effort to reposition our resources proactively. We recently completed a thorough review of our operating structure and key strategic needs in light of the current operating environment, economic conditions and financial market.\n\nLast month, we streamlined our organization and reduced non-headcount expenses that do not align with our current needs. These changes will greatly improve operational execution, focus and efficiency, provide significant operating expense savings and noticeably shorten our runway to breakeven, as Jesse will discuss in greater detail. We made these decisions from a position of strength. We have a strong balance sheet with over $200 million of cash, commercial momentum and attractive growth prospects.\n\nImportantly, we do not expect them to have any direct impact on our near- and long-term growth profile. These moves will allow us to take advantage of the superb opportunities in front of us, while preserving flexibility to continue investing in high ROI growth initiatives. In addition, we have implemented changes to optimize and align our commercial organization according to the stage, objectives and strategy for each of our growing businesses. We have eliminated the role of CCO and are operating surgical glaucoma and dry eye as distinct business units.\n\nConsidering all of the company-specific and macroeconomic factors discussed today, we feel that our growth this quarter is a clear reflection of our attractive ongoing prospects over the medium term. We are not providing out-year guidance but expect that our continued effective execution through current competitive market dynamics, coupled with our ongoing market expansion into the greenfield stand-alone market can support an annual revenue CAGR of approximately 30% over the medium term. We remain confident in our market leadership position in MIGS, as evidenced by growing surgeon adoption and sustained positive patient outcomes. We believe we will continue to win in the MIGS market and have a long runway to increase adoption and utilization to extend our lead.\n\nWe also have utmost confidence in our dry eye reimbursement strategy and the significant investment we have made in our pivotal RCT, SAHARA. Every patient chronically suffering from evaporative dry eye due to MGD deserves fair access to treatment. In conclusion, all our strategic goals, which we are advancing nicely, are anchored around our steadfast commitment to improving the lives of patients with glaucoma and dry eye disease. Jesse will now discuss our second quarter financial results and our outlook for 2022.\n\nJesse?\n\nJesse Selnick -- Chief Financial Officer\n\nThank you, Paul. I will start by reviewing our second quarter results and then move on to our 2022 guidance. Our total revenue for the three months ended June 30, 2022, was $17.2 million, a 37% increase from $12.5 million in the same period of 2021 and up 16% sequentially. Our surgical glaucoma revenues for the second quarter were $15.9 million, up 33% from $12 million in the second quarter of 2021 and sequentially up 15%.\n\nUnderlying fundamental growth drivers in utilization, retention and ordering facilities all remain strong. Two important key leading indicators for our growth funnel are trained surgeons and new ordering facilities. In the second quarter of 2022, we trained over 190 new surgeons. This compares to approximately 120 in the first quarter of 2022 and is well over our quarterly average in prior years.\n\nWe believe growth in trained surgeons will continue to be robust as product awareness of OMNI and our library of differentiated clinical data grows. While we are making great progress, we still have a long runway. At the end of the second quarter, we have trained approximately 2,000 surgeons on OMNI, while Market Scope estimates that over 5,600 U.S. surgeons perform MIGS procedures.\n\nAnd our ultimate goal is to extend the addressable surgeon pool to include all of the estimated 10,000 U.S. ophthalmic surgeons. With a sizable pool of recently trained surgeons and a world-class training experience, we continue to post strong customer wins. 96 new facilities ordered OMNI in the second quarter of 2022, compared to 105 in the first quarter of 2022.\n\nThis is on par with our average of 99 in 2021, which included a spike of 131 in the second quarter of 2021 after OMNI's label expansion in March. The commercial success can also be measured by our consistently growing and extraordinarily sticky ordering base. In the second quarter of 2022, 875 facilities ordered OMNI, an increase of 64 from the first quarter of 2022. We continue to feel great about the continuing growth of our base.\n\nCustomer retention is obviously another key metric for us. We calculate developed customer retention for customers that have placed their first OMNI order over nine months prior. And this is the net ratio of accounts that go inactive during the period to the number of active customers at the beginning of the period. Throughout 2021 and thus far in 2022, approximately two-thirds of our active customer base consisted of these developed customers with over nine months of experience.\n\nIn the second quarter, our developed customer retention rate was 100%, which means that we had exactly as many developed customers return as went inactive during the quarter. While we believe this is extraordinary, it also happens to be very much in line with our historical retention. Our dry eye segment revenues for the second quarter were $1.3 million, which is up 143% from $547,000 in the second quarter of 2021 and a sequential increase of 32%. Our small, focused sales effort in dry eye has delivered an installed base of approximately 750 facilities at June 30, 2022.\n\nOur combined gross margin for the second quarter was 84%, compared to 82% in the corresponding prior-year period and 80% in the first quarter of 2022. Gross margin in surgical glaucoma was 88% in the second quarter, compared to 85% in the prior-year period and 89% in the first quarter of 2022. We remain very pleased with the performance of our operations group, even as global supply chains persist -- supply chain issues persist. Gross margin in dry eye was 41% in the quarter versus 3% in the prior-year period and negative 53% in the first quarter of 2022.\n\nAs a reminder, our first quarter of 2022 included one-time charges related to a voluntary recall program. And absent those charges, gross margins would have been positive 32%. So what we're beginning to see is the margin uplift as we cover our fixed costs that are allocated to dry eye with our growing revenue base. Operating expenses for the second quarter of 2022 were $37.4 million, a 75% increase from $21.3 million in the second quarter of 2021.\n\nOperating expenses included non-cash stock-based compensation of $3.5 million, compared to approximately $900,000 in the prior-year period. SG&A for the quarter was $31.4 million, compared to $17.8 million in the second quarter of 2021. The increase in SG&A was primarily due to our continued investment in headcount to support our growth. As of June 30, 2022, we had 284 full-time employees versus 264 at the end of the first quarter and 218 at the end of 2021.\n\nR&D expenses for the quarter were $5.9 million, compared to $3.5 million in the second quarter of 2021 and $5.6 million in the first quarter of 2022. All increases were associated with the ongoing execution of our clinical road map and development pipeline. Our loss from operations for the three months ended June 30, 2022, was $22.9 million, compared to a loss of $11.1 million for the same period in 2021. We had a net loss of $23.8 million, or $0.50 per share in the quarter, based on a weighted average post-IPO share count of 47.7 million shares compared to a net loss of $17.6 million, or $1.83 per share, for the second quarter of 2021 based on a weighted average pre-IPO share count of 9.6 million shares.\n\nWe ended the quarter with $220.1 million of cash and cash equivalents and $33 million of long-term debt, which includes $2 million of debt discounts. As Paul discussed, we have been very proactive in our liquidity management, despite our greater than $200 million cash balance. We recently completed a comprehensive review that aimed to align our operating structure and growth investment with our key strategic needs. Our heritage is one of differentiated capital efficiency and high returns on investment.\n\nWe went public with two internally developed disruptive commercial products with an accumulated deficit at the IPO of only $102 million and just $105 million of invested capital. Our implied multiples of invested capital as of the IPO were in the top few of all medtech IPOs since 2015. The internal development of SION and the powerful early surgeon feedback from our very first surgical cases this month is yet another demonstration of our capital efficient heritage and disruptive ophthalmic innovation. We have high confidence that SION will be our third groundbreaking product.\n\nOur strategic and financial plans support continuing investment in all of our current growth initiatives and are designed to provide a highly achievable path to free cash flow breakeven with substantial liquidity cushion. We made limited adjustments to both labor and non-labor spend that together reduced our cash burn and put us on a faster path to profitability. Importantly, we are not reducing investment or headcount in the field, in product development or in foundational clinical work, the cornerstones of our plan that will drive continued growth in the near and long term. We expect to exit the year with less than 270 employees versus an original plan that had us approaching 300 full-time employees by year end.\n\nFurther, we anticipate non-labor spend, which constituted approximately half of our second quarter operating expenses to decrease by an even higher percentage as we both narrow and prioritize our project pipeline and execute more efficiently. We anticipate that the impact of these efficiencies will be apparent in our fourth quarter results since we are implementing a number of these non-headcount changes this quarter. We believe our strong balance sheet, leading gross margins and disciplined spend can support positive free cash flow in 2025. Assuming approximately 30% top-line growth in the medium term, we would have a cash drop of well over $100 million.\n\nThis includes over $30 million of discretionary growth investment that's earmarked for specific development projects that are discrete and financially flexible. We believe we have more than enough capital to execute our plan and can retain the flexibility to make decisions based on maximizing long-term value. Finally, turning to our outlook for 2022. We are tightening our full year revenue guidance range to $68 million to $72 million, with more sequential uplift in the fourth quarter than third to match typical eye care procedure seasonality and modest contribution from SION in the fourth quarter.\n\nFor the year, the range implies annual growth rates of approximately 39% to 47% over 2021. It's been a very productive first half of the year for Sight Sciences, and we are excited to continue our efforts as the leading glaucoma and dry eye technology provider that's transforming care and improving patients' lives. This concludes our prepared comments. Operator, please open up the call for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Cecilia Furlong with Morgan Stanley.\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nGood afternoon, and thanks for taking the questions. Congrats on a strong quarter. I wanted to start with the guidance and just the revised guidance raise -- range. Just following the 2Q upside, just curious if you'd talk to, one, what you're contemplating now either from staffing challenges, what you're seeing from a competitive trialing standpoint that you factored into the back half, as well as just the benefit from the GCCs, the education side that you talked about as well.\n\nJesse Selnick -- Chief Financial Officer\n\nYeah. I'll -- Paul, I'll tackle much of it, but please add on. So Cecilia, we are -- embedded in even the low end of the tightened guidance is an acceleration of year-over-year growth in the second half versus the first half. I think what we are being conservative, ultimately, not because of lack of confidence; just being conservative about the contribution from the GCCs embedded in that guidance.\n\nAnd also, only a very modest contribution from SION, which, just given sort of it's early days and we're in the surgeon feedback days, which is very encouraging. The timing of these contributions is just one that is reflected and is one that we're ultimately being conservative on. As Paul said in his comments, competitive -- we don't anticipate that the presence of sort of the new entrants is going to go away in the second half. And so that's definitely factored into our perspective on full year guidance.\n\nI'd again point to the fact that for the OMNI user base, our retention rates are really extraordinary. And it's ultimately just -- it's a slope impactor to push people sort of along the adoption curve and to expand utilization at the pace we want to more than anything that is impacting our base of business. We are not -- and I think I'm hitting all of these. We are -- there are selective examples that we are seeing of staffing shortages impacting hospitals and the ASCs.\n\nBut it's not material in terms of what we're seeing out there. It's, I call it more anecdotal. And so really that as a specific factor in our guidance, it was not a specific factor in terms of our tightened guidance.\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nOK. Got it. That's very helpful. And if I could follow up just on opex.\n\nBut with all of the changes, the restructuring initiatives that you've talked about today or business optimization, just how we should think about the 3Q to 4Q just trajectory overall. And then I did want to ask if you could provide a bit more color. Just the decision to terminate TRIDENT realizing what's going on in the market, but just the definitive evidence that could have provided, and your outlook for additional trials maybe to supersede that.\n\nJesse Selnick -- Chief Financial Officer\n\nPaul, I'll hit the opex and then turn to you for the TRIDENT color.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nSure.\n\nJesse Selnick -- Chief Financial Officer\n\nObviously, looking at our opex, well, call it the four quarters post-IPO, there's been an increase sort of quarter to quarter. I wouldn't expect -- I think what you're going to see Cecilia -- and we'll provide more clarity like in terms of more specific opex guidance on the next quarter call because we're still sort of finalizing some of the project work and non-labor work to be able to do that definitively. But you won't see that growth obviously in the back half of the year. And in terms of the order of magnitude of the savings, I think we'll provide more clarity in Q3.\n\nGave a flavor for it in my comments in terms of sort of how it impacted sort of our headcount plan and the view that the non-labor savings from just, frankly, project focus should be in excess of that.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nCecilia, this is Paul. In terms of TRIDENT, that was a large multinational five countries, 25 center RCT. And while it would provide valuable data, the reality is we're getting -- since we started that trial some time ago, we have very significant clinical evidence that's been generated and published and we're continuing to. And that trial itself was enrolling slowly and would take many years to be able to generate any meaningful data and publish it.\n\nAnd what we found with -- in Europe, we want to pursue a more focused strategy on those markets, those select markets that -- where we know we can perform in the nearer term. So we're currently commercial in the U.K. and Germany. We're generating lots of data there.\n\nI mentioned one of the publications, three-year canaloplasty data that just got published. We have another paper, a three-year paper, a second one out of Germany. Long-term data, durable safety and efficacy with OMNI, and that one's canaloplasty and trabeculotomy. Beyond U.K.\n\nand Germany, other countries, we'll want to select markets that are attractive in size and figure out exactly what clinical data those select markets will require. And we can easily do more focused studies and frankly enroll them more quickly and get into those markets faster with more focused trials. So that's the rationale there. Obviously, we're continuing to run studies, large multicenter studies in the U.S.\n\nas well, and that'll also help our efforts in Europe. We remain committed. Just want to focus more on select markets versus going -- go broad right upfront.\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nGreat. Understood, and thank you for taking the questions.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nSure.\n\nOperator\n\nYour next question comes from Andrew Brackmann with William Blair.\n\nAndrew Brackmann -- William Blair -- Analyst\n\nHi, guys. Good afternoon, and thanks for taking the question. Maybe to start on the goniotomy device and a few questions there. Obviously, as you noted, this has become a bit of a crowded market for other players bringing forth tools, but sort of bill under that goniotomy pathway.\n\nSo I guess three questions here. One, can you sort of give us a little bit more color around the bladeless component there? I heard your comments, but maybe just be a little bit more specific on what's differentiated in terms of the mechanics of the device. Two, can you just share some of the plans for clinical data generation for that device? And then third, how should we be thinking, if at all, of cannibalization here of OMNI with this new device?\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nSure. Good questions, Andrew. On the bladeless design, the first and only bladeless goniotomy instrument, think of it as something that was designed to allow surgeons to more smoothly, gently, reliably excise and remove several clock hours of disease TM. Currently available options, the majority of them, they cut tissue.\n\nAnd if you think about a surgeon in training, as an example, they're going to be a lot more comfortable getting into the angle with a bladeless gentle design. Other features on it that are differentiated, and I think early use from a handful of our surgeons have validated this. We've got some dimensions on the device that allow the surgeon, again, not to cut upon advancement, but instead to grab the tissue. So very, very small dimensions micro-engineered onto the device, using very specialized lasers to get those dimensions, reproduce consistently.\n\nAnd these micro dimensions allow the surgeon, as they sweep the angle, the device grabs the disease TM. And as the surgeon continues to sweep, it's grabbing TM and it's accumulating in the trap of the device and it's pulling the tissue away. So it allows this grabbing of tissue and the sweeping motion, a gentle sweeping motion around the angle, allows the surgeon in a single motion to sweep and remove tissue. So it's gentle, it's smooth, it's efficient, and I think it provides the surgeon with a little more comfort and confidence in the angle.\n\nI think the early feedback we've heard, Andrew, from -- again, this is a handful of surgeons, but they're very experienced in MIGS. They -- it was just a very wow; I didn't know goniotomy could really be improved this much, but you guys nailed it. In terms of clinical data, obviously, clinical data is near and dear to everything we do because we try to deliver products that are best-in-class clinically. It's in our interest to invest heavily in clinical data.\n\nI think we would start generating that data ASAP on SION. So think 2023. We obviously don't have any protocols generated yet, but we would -- right now we're focused on getting it out to a handful of surgeons and ensuring that we've delivered yet again a best-in-category product. And once we're through this early controlled release, we'll be shifting our gears to, one, commercialization, manufacturing scale-up, and lastly, clinical data generation.\n\nAs it relates to your third question on cannibalization, obviously, that's the right thing to ask and the right thing to think about, and we've obviously thought about it long and hard before we pursue any portfolio project. And we really see distinct subsets of the MIGS market. These -- the primary players in the MIGS market, I'll say they're goniotomy, canaloplasty and trabecular microbypass stenting. Most of these procedures coexist within the same accounts today.\n\nSo we have many, many high-volume, happy OMNI surgeons who are doing some goniotomy for certain use cases or some bypass stenting for other use cases. So for us, we view that this exists already today. We have -- we know that we could deliver a best-in-category goniotomy device. We know that we can satisfy a broader patient subset by offering our existing OMNI surgeons this device.\n\nAnd so we're happy that it allows us to provide a broader offering and enhance the relationship, the great relationships that our sales force has today with their surgeon customers.\n\nAndrew Brackmann -- William Blair -- Analyst\n\nThat's great. Appreciate -- very much appreciate all that color on the device and look forward to seeing it. Maybe if I could just follow up with one more really around some of the longer -- nearer-term goals -- medium-term goals that you laid out here for revenue and profitability. Can you just sort of talk a little bit about some of the underlying assumptions in those? How are you breaking that out between glaucoma and dry eye and sort of some of the spend there over that medium term?\n\nJesse Selnick -- Chief Financial Officer\n\nYeah. I'll take a stab at it. We're not -- obviously, it was a directional perspective. And we'll, as we get to later in the year, we'll obviously update that with more definitive guidance for 2023.\n\nThe reality is, Andrew, that the TearCare growth reflects the new -- the expanded label we got at the end of last year. But we don't have plans to necessarily scale that sales force in advance of a patient access breakthrough. So it's not -- I think it's -- the growth expectations are fairly similar between the two segments, like embedded in that. The other thing I would say, again, is that I think it's conservative with respect to timing and order of magnitude around contributions for our big market development rocks that we're moving in terms of stand-alone and dry eye.\n\nAnd it also is fairly conservative, like in terms of our perspective on the incremental impact of SION. As you know, we don't have conservative views on the potential. But just in the here and now, current operating environment and sort of growth trends that we're seeing here now is reflective of that.\n\nAndrew Brackmann -- William Blair -- Analyst\n\nGreat. I'll leave it there. Thanks, guys.\n\nOperator\n\nYour next question comes from the line of Matthew O'Brien with Piper Sandler.\n\nMatthew O'Brien -- Piper Sandler -- Analyst\n\nAfternoon. Thanks for taking my question. Just maybe to put a finer point on a couple of things, Paul or Jesse. The guidance for the year, the high end was taken down by $3 million.\n\nThe midpoint was taken down by $1 million. I know you had a wider range. But you just beat by about $1 million, so you're taking the midpoint down by a couple of million bucks. What is it specifically that is making you take that midpoint down by a couple million or just take off the high end of guidance? Is it something competitively you worried about? The proposed reimbursement changes, something specific there that you want to focus folks on --\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nI can take a crack, Jesse, and if you can -- you want to add. Yes. I think, Matt, I think you've seen -- you're close to the market. I think you've seen a flurry of new entrants.\n\nWhile clinically unproven, I think there's a lot of questions. We've all seen them from societies, from payers what these devices are, what they're not. What procedures they perform, what procedures they don't perform. How they could be coded or not.\n\nThat's real. That's been real in the first half. It's continuing into the summer. Now we feel extremely confident in how we fare, but the reality -- again, the reality is you've got pretty established companies with established commercial infrastructure pushing these products into the operating room.\n\nAnd there's a natural process for surgeons to understand what they are, understand what they're not. And I think what we've done very, very well to compete by focusing on designing the best clinical innovation for surgeons, products they love to use. Think about an iPhone and some examples where your friends have ventured away from an iPhone only to find major frustration and come back. And I think that's what we're seeing here.\n\nI think people love OMNI. It's super sticky. It's reliable. But when a company introduces a new shiny object, surgeons are going to try it.\n\nAnd what we're seeing now with increasing frequency every day are these surgeons are coming back. Is it over? No, it's not over yet. Has it affected the slope of our trialing and advancing our surgeons to an adopted state? It does affect that. Until these surgeons learn what these products are and what they're not, and until they come back to OMNI as they always seem to do because they love it, there's a little bit of an effect.\n\nAnd so that to me is the primary driver. Jesse, I don't know what else you'd like to add.\n\nJesse Selnick -- Chief Financial Officer\n\nMatt, I would just reiterate, the implied growth second half is higher than the growth in the first half. So that should show you some of our confidence in the business. And I think we -- when you're talking about the like growth rates as high as our, sort of, it's really critical to be able to push people through the trial cycle and get them to be adopting. And it's -- so we just thought it's prudent in terms of what we're seeing, what we can measure.\n\nAnd again, we don't -- we know that we didn't squeeze it proportionately, but hopefully you appreciate our confidence in also squeezing sort of the bottom end of the range as well.\n\nMatthew O'Brien -- Piper Sandler -- Analyst\n\nYeah. OK. And then just on the 30% medium-term growth rate, I don't really know what medium term means or even interim or long term. I have no clue.\n\nBut you've got a proposed rate cut that's out there right now that historically has affected the number of cases that are done, even if it's the best outcome. So how can you offset potentially that impact with your existing product, and then layering on goniotomy next year and SION to get to that 30% number that I'm sure everybody's going to go to in surgical glaucoma in the U.S., both probably next year and then 2024 as well.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nMatt, when you say the proposed rate, are you talking about the pro fee?\n\nMatthew O'Brien -- Piper Sandler -- Analyst\n\nYes.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nThe pro fee for canaloplasty?\n\nMatthew O'Brien -- Piper Sandler -- Analyst\n\nThat's right. Yes.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nYeah. So with that, obviously reductions are never a positive for manufacturers or surgeons. But the way we think about it, I think the way everyone should think about it is relativity. So the pro fee for canaloplasty has always been historically very attractive.\n\nIt got reduced to $750. Still attractive. The proposed rule, and let's see how it ends up in the final rule this year, but it's proposed to go down to $600. So let's say worst case scenario, the final rule looks like the proposed rule at $600, and that's it.\n\nThat'll be the end of any revaluation or based on historical trends and how often the ROC revalues these codes. Usually it's five years until they revisit it. So worst case scenario, Matt, if it's $600 for the pro fee, the way we think about it is, has that reduction created a relatively different economic profile for canaloplasty, and the answer is no. It's still -- it was below goniotomy until goniotomy gets ROC-ed.\n\nThe canaloplasty fee was already below goniotomy and it remains below goniotomy. The $600 canaloplasty fee is above cataract surgery. It's above trabecular bypass stenting. It was at $750, and it remains above $600.\n\nSo relatively speaking, it doesn't put us in a different position competitively. And in terms of just general absolute attractiveness to the surgeon, I think as they become very familiar with OMNI, I think $600 is plenty sufficient for us to deliver on our growth expectations.\n\nMatthew O'Brien -- Piper Sandler -- Analyst\n\nGot it. Thanks so much.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nSure.\n\nOperator\n\nYour next question comes from the line of Joanne Wuensch with Citibank.\n\nJoanne Wuensch -- Citi -- Analyst\n\nThank you, and good evening. So I'm going to try this at a slightly different angle. How do you define medium term?\n\nJesse Selnick -- Chief Financial Officer\n\nJoanne, I think it's the next couple of years. And it's a number that we will revisit. We'll revisit specifically as to next year. It's a number that I think is fairly conservative on what we think are the mega upsides that we're pursuing that for no other reason than we wanted to give what we think sort of our organic growth expectation is, sort of without heavy reliance on that, given that it's still in the early stages of development there.\n\nJoanne Wuensch -- Citi -- Analyst\n\nOK. The other thing I want to just spend a moment on was you talked about looking at how you're spending money to accelerate the path to breakeven. Can you clarify what the path is to breakeven?\n\nJesse Selnick -- Chief Financial Officer\n\nYeah. Our view, again, is that entering 2025, if you just apply those medium-term growth assumptions, which again sort of marries with the two-year perspective, that when you layer on our -- what we view is what our normalized spend will be, that we will be free cash flow positive. And our view is that leaves us fairly comfortably above $100 million cash burn.\n\nJoanne Wuensch -- Citi -- Analyst\n\nAbove $100 million cash burn.\n\nJesse Selnick -- Chief Financial Officer\n\nYeah. That would be the trough balance.\n\nJoanne Wuensch -- Citi -- Analyst\n\nGot it. OK. Just big picture. You've been public a year now.\n\nCongratulations -- or happy anniversary.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nThank you.\n\nJoanne Wuensch -- Citi -- Analyst\n\nWhat has changed? How is -- I mean, a lot of models have been updated and changed in the last 12 months, but I'd like your view on what's different.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nI'll comment, Jesse, and then if you want to take it, I'll just take it from the market perspective. I think on OMNI, we've continued to grow in combo cataract. There's been this year different than last year. I think if you think about it, we went from maybe three primary product competitors to six overnight.\n\nSo a doubling of the competitive set. And we're growing right through that. Our team is executing right through that. OMNI is winning.\n\nIt's been a noisy disturbance, but we're seeing, again, accelerating every day. We're seeing doctors figure out what's what and getting right back to their favorite product, which is OMNI. So that's been the biggest difference, I think, in terms of our market presence and what we've seen at the market compared to 2021. And again, we believe and we're seeing it now that this is transient.\n\nOMNI is winning. Now on the dry eye side, we've continued to sell nicely into more and more early adopting dry eye accounts. And I think the most important thing there is we are getting very close to the completion of enrollment in SAHARA. That's a really big study.\n\nIt's payer designed. We spoke to eight different insurance companies, eight different medical directors to help educate them on dry eye and get their perspectives on what it would take in terms of clinical data to successfully cover and pay at the fair rate for a dry eye procedure with TearCare. So this study, again, payer designed. It's been enrolling very nicely.\n\nWe're on track. And by the end of this year, it should be completely enrolled, and we're looking forward to turning the card on that superiority endpoint next year. Other than that, we're continuing to execute very nicely across the board. Our team's doing a great job.\n\nAnd I think our growth is an illustration of that.\n\nJesse Selnick -- Chief Financial Officer\n\nThe only thing I'd just add that the economic uncertainty is different today than it was. It doesn't impact -- we're not seeing a real impact in terms of our commercial activity, but it's an important data point as you're thinking about level of investment and approach. Paul articulated it a bit like in terms of OUS activity. It's a great opportunity for us, but you can burn a lot of capital if you go try to do everything at once.\n\nAnd we're just going to be pretty smart about incremental investment and where it goes to. Not that we lost that lens, but it's top of mind for a company with our current cash flow profile.\n\nJoanne Wuensch -- Citi -- Analyst\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Tom Stephan with Stifel.\n\nTom Stephan -- Stifel Financial Corp. -- Analyst\n\nGreat. Hey, guys. Thanks for squeezing me in. If I can start on stand-alone, the GCCs, it sounds like there are some encouraging signs out there kind of already of early traction.\n\nMaybe how should we be thinking about when these reps sort of hit full productivity and are, let's call it, at max capacity? And then kind of along the same lines, the stand-alone mix I think has seemingly remained around 20%. I assume your internal models forecast maybe an inflection at some point. Can you just maybe give us a sense for what that acceleration might look like maybe over the next, call it, two to three years?\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nSure, Tom. In terms of the GCCs and the results, we're pleased. They're each assigned to a number of OMNI accounts and are looking at the referring community, the primary eye care providers, ophthalmologists or optometrists that refer patients, glaucoma patients to those OMNI surgeons. We've looked at the OMNI utilization pre-GCC and post-GCC.\n\nIn those accounts, the uplift is very interesting. We're looking -- it's early days. We hired them in the first quarter. They were trained in the second quarter.\n\nAnd so they really just spent a couple of months out in the field educating the referral community. But early signs are very encouraging. We'd like to be able to report specifically on it soon. And then the other thing to mention is the claims data.\n\nWe look at stand-alone claims, 66174 reported alone, and there's a clear trend there that that code, that claim reporting is growing as well. In terms of capacity, I think a lot of this we're going to better understand. We're going to see real results from the GCCs. I think September onwards, we're going to be assessing it closely.\n\nI think we're going to be able to reach some conclusions. We're going to understand the model. I don't think they're going to run out of capacity anytime soon. Think about it; once a referring community is established on OMNI stand-alone, they can move to the next group of surgeons.\n\nSo we would love to grow that team and do it soon. That means it's -- the stand-alone market is growing very quickly. We expect to grow the team in due course, but I don't think any time soon we're going to reach capacity, if that helps. But in the end, what does it look like? We could one day have as many GCCs as surgical sales rep.\n\nWe'll see what that capacity looks like as we go. But the market, $4 billion to $5 billion stand-alone market in the early innings I think would support lots of these resources making it go.\n\nTom Stephan -- Stifel Financial Corp. -- Analyst\n\nGreat. That's helpful. And if I can just finish on the outlook. It sounds like you guys expect the trialing headwinds to persist into 2H 2022.\n\nBut what are your thoughts on these headwinds potentially slipping into 2023, just I guess given at this stage, there are competing products still rolling out today. Any color there would be helpful.\n\nJesse Selnick -- Chief Financial Officer\n\nI think it's embedded in the outlook that we're -- we have a view that we believe that the impact is transient. And we're seeing it as customers sort of restore their level of utilization for OMNI that they historically have. But we're like, kind of as it pertains to linking it to outlook, we're kind of -- we're making the assumption for that purpose that it persists sort of like an environment like it is today, like ultimately. Even though I think that's a very conservative way to look at it.\n\nTom Stephan -- Stifel Financial Corp. -- Analyst\n\nGot it.\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nI would just -- with the first half of this year was pretty acute. Again, to go from three product competitors to six, that's pretty acute. Now a lot of those things are being resolved. Some of them have been resolved and others are -- seem to be resolving in terms of their impact.\n\nBut do we need a total resolution to continue to dominate? No. Are we counting on total resolution? No. A lot of this is in our control. We continue to deliver best-in-class technology.\n\nOur sales force continues to deliver best-in-class customer service, develop best-in-class relationships. We control a lot of what we do, despite these new entrants. And I think I would just summarize this as the acute phase that happened, and we're winning. It's very clear that we are, and customers are going back to full OMNI utilization.\n\nAnd there can be competitive voice. That's OK. We welcome it.\n\nJesse Selnick -- Chief Financial Officer\n\nHello? Operator, I think we've lost Tom. So are there any additional questions?\n\nOperator\n\nAt this time, there are no further questions. Are there any closing remarks?\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nYes. I want to thank everybody for their time. Thank you, all, for your interest in Sight Sciences. Appreciate it and look forward to speaking with all of you again soon.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nPhilip Taylor -- Investor Relations\n\nPaul Badawi -- Co-Founder and Chief Executive Officer\n\nJesse Selnick -- Chief Financial Officer\n\nCecilia Furlong -- Morgan Stanley -- Analyst\n\nAndrew Brackmann -- William Blair -- Analyst\n\nMatthew O'Brien -- Piper Sandler -- Analyst\n\nJoanne Wuensch -- Citi -- Analyst\n\nTom Stephan -- Stifel Financial Corp. -- Analyst\n\nMore SGHT analysis\n\nAll earnings call transcripts"
}