{
  "companyName": "Aspen Technology, Inc.",
  "companyTicker": "AZPN",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/08/aspen-technology-inc-azpn-q4-2022-earnings-call-tr/",
  "content": "Aspen Technology, Inc. (AZPN -0.11%)\nQ4 2022 Earnings Call\nAug 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Rex, and I will be your conference operator today. At this time, I would like to welcome everyone to the fourth quarter 2022 AspenTech earnings call. [Operator instructions] At this time, I would like to introduce Brian Denyeau of ICR.\n\nBrian Denyeau -- Investor Relations\n\nThank you. Good afternoon, everyone, and thank you for joining us to discuss our financial results for the fourth quarter of fiscal 2022 ending June 30, 2022. With me on the call today are Antonio Pietri, AspenTech's president and CEO, and Chantelle Breithaupt, AspenTech's CFO. Before we begin, I will make the safe harbor statement that during the course of this call, we may make projections or other forward-looking statements by the financial performance of the company that involve risks and uncertainties.\n\nThe company's actual results may differ materially from such projections or statements. Factors that might cause such results include, but are not limited to, those discussed in today's call, as well as those contained in our most recently solid Form 10-Q, and an amendment No. 4 to the registration statement on Form S-4 was filed on April 14, 2022, by EmerSubCX Inc. with the SEC.\n\nAlso, please note that the following information relates to our current business conditions and our outlook as of today, August 8, 2022. Consistent with our prior practice, we expressly disclaim any obligation to update this information. Please note that we have posted a fourth quarter earnings presentation, as well as the presentation to provide more detail on the introduction of ACV as our primary growth metric on the investor relations portions of our website. The structure of today's call will be as follows: Antonio will discuss business highlights in the fourth quarter and fiscal year, including the completion of our transaction with Emerson and our pending acquisition of Micromine.\n\nAnd then Chantelle will review our financial results and discuss our guidance for fiscal year 2023. With that, let me turn the call over to Antonio. Antonio?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nThanks, Brian, and thanks to all of you for joining us today. I'm excited to welcome you to our first earnings call as the new AspenTech. We are thrilled to have successfully completed our transaction with Emerson during the fourth quarter and to have welcomed the talented teams of OSI and their digital grid management portfolio of products or DGM and the Subsurface Science and Engineering team and their portfolio of products or SSE into AspenTech. This transformative transaction generated significant value for our shareholders and created a leading industrial software company with multiple paths to future long-term value creation for our customers and shareholders.\n\nI would like to start by providing an overview of the breadth and scale of our business today before reviewing our fourth quarter and fiscal year 2022 performance and our outlook for fiscal year 2023. Today, the new AspenTech is one of the world's leading industrial software companies and well positioned to generate double-digit top and bottom line growth at scale. We now generate more than $1 billion in annual revenue and nearly $800 million in annual contract value, or ACV. The new business growth metric we're introducing this quarter and for which Chantelle will provide more details later in the call.\n\nThe two businesses contributed by Emerson had leading software solutions that significantly diversified AspenTech's operations and increase our opportunities for growth in new industries and from sustainability investment trends. The DGM portfolio of software solutions and services for the power transmission and distribution or T&D market provides AspenTech a market-leading position in a fourth vertical. DGM will benefit from three macro drivers in the T&D market. First, the ongoing upgrading and expansion of the grid as part of global electrification to achieve Net Zero carbon emissions.\n\nSecond, the growing complexity of the grid resulting from the introduction of renewable power. And third, the need for improved cybersecurity as they greet its critical infrastructure. These three drivers are catalysts for greater digitalization of the grid to manage larger systems of greater complexity. SSE, formerly known as GSS, is a leading portfolio of software solutions that are highly complementary to our existing upstream business.\n\nAspenTech can now provide a set of solutions that add value to the entire life cycle of an upstream customers operation by integrating subsurface and above surface modeling and simulation capabilities to unlock additional value in operations. SSE also expands our reach into sustainability areas of the market like carbon capture and sequestration or CCS and geothermal energy. The employees from each company are a strong cultural fit with our heritage business with the same passion for innovation and desire to solve the most complex operational challenges facing our customers. The executive leadership team and I have spent significant time with many of the employees of both businesses in recent months and have become even more impressed that we have gotten to know them better.\n\nFrom an integration and transformation perspective, we are tracking well against our plan. We have detailed integration plans for each functional area and for each of the synergy streams including the cross-selling initiatives between each of the businesses and those associated with the Emerson commercial agreements. We're also making progress tokenizing the DGM and SSE product portfolios and converting the DGM portfolio to a term license structure. As we know from our own experience, the token term licensing model will unlock value for our customers and lead to broader and faster adoption of the products in the suite over time.\n\nWe are pleased with the progress to date and feel very good that we will deliver on our target of $110 million of adjusted EBITDA synergies by fiscal year 2026 driven through a combination of ACV growth and cost synergies over time. The benefits of the Emerson transaction extend beyond the DGM and SSE product portfolios. We also formalized our new commercial agreement with Emerson that will make AspenTech solutions available to sell into markets where we have limited presence today, such as pharmaceuticals and pulp and paper. Emerson has created a dedicated sales team focused on accelerating adoption of AspenTech products and solutions across a range of these targeted industries.\n\nAnd we have established a corresponding team within AspenTech to support and enable Emerson to ensure we capitalize on the significant opportunities. Over time, we will realize additional benefits as more of our products and solutions are integrated into Emerson's industrial systems and as the two organizations identify opportunities for joint innovation that will begin to transform our solutions are delivered to and adopted by customers. In addition, our increased scale and the support of Emerson have expanded our capacity and ability to pursue M&A opportunities. The recent announcement of our definitive agreement to acquire Micromine mine is a great example.\n\nMicromine has developed a great set of software solutions that help metal and mining companies improve their safety, sustainability, reliability and efficiency of their operations. The metals and mining industry will play a critical role in the energy transition and is at the very early stages of investing in the digitalization initiative that will enable them to meet that need. We look forward to completing this transaction in our fiscal second quarter, subject to regulatory approval. Finally, the scale of the new AspenTech and its critical role in the capital-intensive industries is attracting talent of quality, expertise and diversity to the company as proven by the members of our new  of directors.\n\nThis injection of new talent will materially benefit the trajectory of this company over many years to come. In addition, as the company scaled toward enhancing a specific organizational capabilities and systems. For example, in our go-to-market area, we have created an organization focused on the newly expanded set of key industries to sharpen our strategy, messaging and go-to-market execution in each of these industries. We have also expanded our partners organization with the intent to increase our market relationships as a leverage point for market penetration and adoption of our products and solutions.\n\nI could not be more excited of what we have built at AspenTech and the opportunity ahead of us. We have assembled one of the most comprehensive set of solutions in the industrial software market and are well positioned to help our customers address the dual challenge of meeting the increasing global demand for resources in a sustainable manner. The dual challenge is central to the continuation of global prosperity, and that is why we have made it our mission as the global population grows by another 2 billion people by 2050, as more and more people expect a better standard of living, and as society expects companies in capital-intensive industries to sustainably produce their resources to meet the future needs of the global population and investment over the next 20 to 30 years of a magnitude that hasn't been seen before in the history of humanity will be required to achieve the complete transformation of the global economy to meet the dual challenge. This investment will focus not only on climate change but also on circularity, eliminating plastic waste in the environment, and will drive the innovation and deployment of technologies and digital capabilities to achieve these environmental imperatives.\n\nWe believe that new AspenTech is uniquely positioned to help companies in capital-intensive industries meet the dual challenge. With that backdrop, I would like to turn to our fourth quarter and fiscal year results. Since the Emerson transaction closed in mid-May and June 30 is our fiscal year-end, I will focus my commentary primarily on the heritage AspenTech business. Annual spend for the full year for the heritage AspenTech business was $674 million, up 2.8% in the quarter and 8.5% year over year, which was above the high end of our guidance range.\n\nAnd free cash flow for the full year for the heritage AspenTech business was approximately $286 million. Please note that this excludes a discrete tax payment associated with the Emerson transaction that Chantelle will discuss in more detail later. We're pleased with our performance in the fourth quarter, which was strong across each of our key verticals and regions. Importantly, we did not see any impact from the worsening economic environment in Q4.\n\nThe spending environment in our core markets continue to improve as the business and financial performance of our customers has strengthened. After a couple of years of muted investment in their operational excellence and sustainability initiatives, it is clear from transactions closed in the fourth quarter and fiscal year that customers are pursuing more strategic engagements with us and continue the process of standardizing across their operations, on our products and solutions to drive greater efficiencies and sustainability gains. Overall, fiscal year 2022 played out much as we hoped it would, which provides us confidence as we enter fiscal year 2023. An important trend that saw acceleration across our business in fiscal year 2022 is how the sustainability imperative is influencing sales activity.\n\nCustomers across all of our end markets are recognizing the need to step up their focus on sustainability and are putting in place initiatives around emissions reduction, decarbonization and circularity that will fundamentally change the design, operation and reliability of their assets in order to meet their sustainability ambitions. Our newly expanded set of solutions will support our customers' drive to meet these targets or those set by government agencies as a result of the growing regulatory push toward greater environmental disclosure and compliance. As a point of note, a recent webinar held by AspenTech on carbon capture and sequestration garnered a record amount of interest with over 1,900 registrants, a clear indication of the growing focus of our customers on decarbonization and sustainability. Looking at our performance by vertical in the year.\n\nRefining had another strong quarter that was the best of the fiscal year. Crack spreads during the fourth quarter were at all-time highs. And while they have pulled off in recent weeks, they remain in the upper quartile of their historical range. We're optimistic about the profitability and demand environment for the refining industry and the growth that it will support for us.\n\nEnergy security is also leading to a rethink of the medium- to long-term need for refining capacity in certain parts of the world. Chemicals continues to be a source of strength for our business. Chemical customers recognize that driving greater efficiencies in their operations and mitigating their environmental impact through digitalization is critical to their future business performance. We're also confident about the long-term growth of the industry as global chemicals demand is expected to increase 300% by 2050, according to the World Energy Forum placing the industry at the center of meeting the Dual Challenge, as I have previously discussed.\n\nThe E&C vertical continues on its transformation path as more customers focus on sustainability investments, such as renewable power, hydrogen, carbon capture and sequestration and other technologies. This, along with improved medium-term outlook for oil capex spend and an expected increase in LNG facilities investments to drive backlog growth for the E&C industry. We're optimistic this vertical will show improvement going forward as it reopened -- as it repositions itself toward sustainability and the associated capex trends. I would now like to say a few words about the industries in which OSI and SSE operates.\n\nDigitalizing the transmission and distribution industry is critical to transforming how this industry operates to support global sustainability with the DGM portfolio of products perfectly positioned in this regard. It is estimated that energy demand will grow by 50% by 2050 as the global population increases and achieves a better standard of living, which means that to reach Net Zero carbon emissions in that time frame, 75% of the increase in energy demand will need to be supplied by electricity and 90% of it will need to come from renewable sources. This means the electrical grid will need to expand significantly and will become more complex, which will require greater and more sophisticated digital capabilities to manage and optimize their operations. This is where OSI and DGM products play a central role.\n\nThe DGM product portfolio was developed to meet the increasing complexity of the grid including advanced capabilities such as advanced distribution management systems, ADMS, for electricity distribution and distributed energy resource management systems, DERMS, which address the complexity introduced by intermittent sources of electricity into the grid from renewable sources. OSI has also developed capabilities to manage micro grids found in industrial facilities, commercial buildings and other assets or systems that cannot afford the loss of power from public utilities. We also see this application as an important cross-sell opportunity into the heritage AspenTech industrial customer base and furthermore into Micromine's customer base once the transaction closes. Looking ahead, we expect that significant capex spend will be dedicated to upgrading and expanding the grid, increasing the demand for DGM solutions for many years to come through all phases of the business cycle.\n\nIt is important to note that OSI's business is levered to capex budgets in the highly regulated utility industry and not tied to the traditional capex investment drivers in oil and gas and chemicals behaving more like opex investments. We're also very excited about the SSE product portfolio in the oil and gas exploration and production area. The integration of the SSE subsurface capabilities with our engineering suite above surface capabilities will create a unique offering in the market. We're already seeing a strong customer interest in this combined offering and its ability to drive innovation in the space.\n\nWe believe that capex budget in the upstream sector will grow over the next three to five years in order to maintain an increased supply of oil and gas. This is a trend that we already see. Over time, we will create a new path for growth for this portfolio of products focused on decarbonization capabilities and renewable sources of energy, such as CCS and geothermal energy, respectively. In addition, existing SSE product capabilities will complement the Micromine suite of products to further differentiate the performance of that future product suite.\n\nFinally, we're now the only company able to provide a comprehensive solution to model the entire petroleum value chain from the rock in the reservoir to the distribution of fuel to the corner gas station and into the chemical supply chain. As we typically do on our year-end earnings call, I would now like to provide you with some additional details about our performance for the full year 2022, all of which are on an annual spend basis. I will start from a product perspective and focus specifically on the performance of the heritage AspenTech businesses. The Engineering business grew annual spend 5.5% for the year generating 38% of our overall annual spend growth.\n\nThis was stronger than we initially expected and driven in large part by better performance by owner-operators, which resulted in lower attrition and higher gross growth. Our manufacturing and supply chain, or MSC business, delivered annual spend growth of 12.1%, representing 55% of our total annual spend growth. We saw a significant improvement in MSC performance throughout the year as our owner-operator customers, particularly refiners, so business conditions improve as COVID-related disruptions abated. The Asset Performance Management or APM business generated total annual spend growth of 14% or 7% of our total annual spend growth for the year, contributing 0.6 points of annual spend growth.\n\nThe performance of the APM suite was impacted by headwinds from attrition, mainly in two areas. One, we had several E&Cs that purchased APM entitlement in the last couple of years as part of their business initiatives to generate revenue growth from operations and maintenance activities in brownfield sites. The expected revenue growth from this activity did not materialize as a result of depressed demand due to COVID, so these agreements were not renewed. And two, select customers in Asia and other regions that lacked the on-site support during COVID lockdowns required for the successful deployment of the product.\n\nThe APM gross growth in the fourth quarter was one of the strongest in the history of the suite. Total gross growth for the suite in fiscal year 2022 equated to 1.1 points of growth. The outlook for APM attrition in fiscal year '23 is much improved as a result of most E&C contract renewals having already occurred and more mature customer success process including remote support and the expectation of improved demand for this suite going forward. Customer interest remains very high, and we continue to have a sizable and growing pipeline of opportunities.\n\nShifting to our verticals. The energy, chemicals and engineering construction verticals contributed 54%, 32%, and 7% of our growth in annual spend during the year, respectively. Global economy industries or GEIs contributed 7% of our annual spend growth for the year and grew 9% in the year. For the full year, the attrition rate for heritage AspenTech was 5%.\n\nThe acceleration in annual spend growth this year was split between lower attrition and higher gross growth. We generated 13.4% gross growth in fiscal year '22, which was approximately a 200 basis point improvement from last year. We're pleased with the growth performance during the year and believe it sets a stage for further improvement in the years to come. As you can see, we had a strong fiscal year 2022 and enter fiscal year 2023 with a great deal of momentum.\n\nThe trends in each of our end markets are positive and the addition of the DGM and SSE product portfolios provide exposure to new markets that are also trend favored. At the same time, we are mindful of the evolving macro environment and its potential to weigh on economic activity in the coming quarters while also remaining vigilant about future COVID developments and geopolitical considerations. So while we're optimistic about our performance in fiscal year '23, we think it's prudent to assume a wider range of potential outcomes. Similar to recent years, we expect fiscal year '23 to be a tale of two halves.\n\nWe currently have greater visibility and confidence into the first half of the year, given the ongoing strength in our end markets and as customers look to utilize their calendar 2022 budget commitment. Conversely, we see several potential scenarios for customers' calendar 2023 budgets depending on how the macro environment evolves in the next two quarters. Putting all this together, our current expectation is for ACV growth in fiscal year '23 to be 10.5% to 13.5% for new AspenTech. There are several assumptions underpinning our guidance.\n\nFirst, DGM and SSE are expected to contribute approximately four points of growth in total this year. The DGM product portfolio has had a good start in the fiscal year, especially considering the sale, acquire, divest processes involving the OSI business for the better part of the last two years. We're also seeing notable market strength from the SSE product portfolio, supported by improved capex spend, a better position business after the completion of its restructuring under Emerson ownership and the potential value creation from the integration of their capabilities with their engineering suite of heritage AspenTech. We are bullish about the outlook for these two product portfolios going forward.\n\nSecond, we currently expect growth in the first half of fiscal '23 to build upon the momentum in recent quarters. The current operating outlook for our customers in calendar '22 is very healthy and supports the budget and current spend rates in place. Based on today's macro outlook for oil demand and supply and market dynamics we expect calendar '23 budgets to support a continuation of the spend experienced this year but we prefer to take a prudent approach to our ACV growth range. To put a finer point in the range, the high end of our range assumes that the DGM and SSE product portfolios will perform as projected in our guidance given the respective market dynamics and the heritage AspenTech product suite will see a continuation of improvement in the spend experience so far in calendar '22 into calendar '23.\n\nThis outcome assumes little or no impact from any economic deceleration. And the low end of the range assumes the macro outlook gets materially worse due to economic conditions, COVID development and/or geopolitical considerations resulting in reduced customer spend for the heritage AspenTech suites with owner-operators. Supporting a growth outcome for those suites similar to fiscal year '22, while the DGM and SSE product portfolios deliver our performance as projected in our guidance. It's important to note that in any of these scenarios, we're confident that we will deliver a year of double-digit growth in ACV.\n\nThird, from a suite perspective, we expect the engineering and SSE suites will contribute six to eight points of growth, DGM will contribute three points, SSE, one point, and APM is expected to contribute approximately half to one and a half points of growth. Lastly, attrition is expected to be approximately 7% to 8% for the year. The heritage AspenTech attrition is expected to show continued improvement to 3% to 4% for the year. The SSE suite attrition is expected to be approximately 4% for the year, which we would expect to improve in the coming years.\n\nDGM is not expected to have any material attrition. While the economic outlook is unclear at the moment, what is clear is that AspenTech is performing at a high level and well positioned for the future. We meaningfully accelerated growth over the course of fiscal year '22 and have laid the foundation for durable double-digit growth in the future. The OSI and SSE businesses and the pending acquisition of Micromine provide exciting new growth opportunities and meaningfully diversify our end market exposure.\n\nFiscal year '22 was the most transformative year in the history of the company. We delivered excellent operational and financial results while signing and executing our transaction with Emerson. This is the most exciting time in the 40-plus year history of AspenTech, and we're well positioned to deliver greater value than ever before for our customers and shareholders. I want to conclude by recognizing the extraordinary work done by the heritage AspenTech team to deliver the exceptional operational and financial results achieved in fiscal year 2022.\n\nAnd also thank the new AspenTech team for their outstanding effort to continue to make our transformation possible. I strongly believe the best is yet to come and that your efforts will result in significant value creation for all stakeholders of the company. With that, let me turn the call over to Chantelle. Chantelle?\n\nChantelle Breithaupt -- Chief Financial Officer\n\nThank you, Antonio. I have several different topics to cover today, so let's jump right in. Let me start with our reported GAAP financial results for the fourth quarter and the full year fiscal 2022, which are not comparable to the guidance heritage AspenTech provided on its fiscal third quarter earnings call in April due to the completion of the Emerson transaction and the associated accounting. As previously reported, Emerson acquired a 55% stake in the new AspenTech on May 16, 2022.\n\nAs such, the subsidiary, Emerson set up as part of the transaction, EmerSubCX, which included the DGM and SSE businesses, became the surviving entity once the transaction was completed. Therefore, under accounting rules, the GAAP results you see in our press release today reflect the full quarter's results for DGM and SSE and 45 days of results from heritage AspenTech reflecting the period from May 16 to June 30. In addition, as part of Emerson, EmerSubCX was on a September 30 fiscal year-end, which changed to June 30 to align with the heritage AspenTech's fiscal year-end. As a result, you will see that the year-end results shown in our financial tables are for the nine-month period of October 1, 2021, to June 30, 2022 and includes the nine-month fiscal period of DGM and SSE financials and 45 days of heritage AspenTech.\n\nAs a result of these adjustments, our income statement and statement of cash flows this quarter and for the full period are not indicative of the financial performance of either heritage AspenTech or new AspenTech. However, since the balance sheet is a snapshot in time as of June 30, it provides a useful view for investors of our underlying financial strength. One item I would like to provide further context for is free cash flow in the quarter. The Emerson transaction, the resulting change in control required a short period U.S.\n\nfederal consolidated tax return for the period May 17, 2022, through June 30, 2022. This period was considered a separate tax year and resulted in the recognition of taxable income associated with our contract asset balance. This resulted in a pull forward of approximately $65 million of cash tax payments into the month of June. Adjusting for this discrete tax payment and additional transaction-related items, free cash flow for the heritage AspenTech business was approximately $286 million, in line with our prior outlook.\n\nDue to these unusual circumstances, which will only apply to the fourth quarter of FY '22 since that is when the transaction closed, as well as the dynamics of our revenue recognition in our model, which I will discuss next, we believe it is more helpful for investors to focus on the key metrics we provide. Now, on to revenue recognition. Our term license financial results are reported under Topic 606, which has a material impact on both the timing and method of revenue recognition for our term license contracts. License revenue is heavily impacted by the timing of bookings, and more specifically, renewal bookings.\n\nWe define bookings as the total value of customer term license and perpetual SMS contracts delivered in the current period. The timing of renewals is not linear between quarters or fiscal years and this nonlinearity will have a significant impact on the timing of our revenue. A decrease or increase in bookings between fiscal periods resulting from a change in the amount of term license contracts up for renewal is not an indicator of the health or growth of our business. As is common in the software industry, our bookings are typically back-end weighted toward the end of the quarter and the fourth quarter is typically, but not always, our largest bookings quarter.\n\nAs a result, it is not unusual to see resulting revenue decline sequentially in the first fiscal quarter. PSI specifically, license and professional services revenue when sold together in a customer arrangement is generally recognized over time as one performance obligation using percentage of completion accounting. Revenue recognition ends related to license and professional services revenue when implementation is complete. Maintenance revenue is recognized ratably for OSI arrangements over the underlying maintenance term and commencing once implementation is complete.\n\nAs those who have followed us in the past know, we provide supplemental metrics to help investors get a clearer sense of the underlying growth of the business. Starting this quarter, we will be transitioning from annual spend to ACV, annual contract value, as our primary growth metric. We have posted a slide deck and video presentation on the investor relations section of our website to provide greater detail on this change. Historical ACV results going back to the first quarter of fiscal 2020 can be found in our earnings presentation.\n\nI encourage all of you to take a look at both. I will not review all the information in that deck on this call, but here are a few key takeaways. We define ACV as an estimate of the annual value of our portfolio of term license and term and perpetual software maintenance and support for SMS agreements. ACV provides insight into the annual growth and retention of our recurring revenue base, which is the large majority of our overall revenue, as well as recurring cash flow.\n\nACV is how we manage the business internally on a day-to-day basis and is the primary corporate performance goal we used to incentivize and compensate our management and sales teams. ACV is functionally very similar to heritage AspenTech's annual spend metric. The only difference between the two metrics is the inclusion of perpetual SMS into ACV. In the near term, perpetual SMS will continue to increase due to the completion of existing OSI projects underway and the fact OSI will continue to sell some ERP licenses.\n\nAs we transition OSI and SSE's businesses to our term license token model, we would expect perpetual SMS ACV to decline. In addition, the small residual amount of perpetual SMS and the heritage AspenTech business will continue to decline. The projected ACV growth in guidance is inclusive of these dynamics. For DGM products, ACV currently only captures a fraction of their overall business related to term licenses and perpetual SMS due to the revenue accounting associated with the selling of bundled license and services, as previously discussed.\n\nIt does not capture DGMs perpetual licenses, professional services or hardware revenue. The proportion of DGM revenue that will be represented in the ACV is expected to continue to grow over time as we execute on our strategy. The transition to ACV serves a few purposes. The inclusion of perpetual SMS provides greater visibility into DGM and SSE's current recurring revenue streams.\n\nIt will also provide insight into the ongoing transformation of DGM and SSE's respective business models to AspenTech's tokenized term license model. And ACV is a commonly used metric across the software industry, and this transition may provide greater comparability for AspenTech with other companies. With that as a background, I would like to spend a moment reviewing ACV in more detail. All growth rates referenced are on year-over-year basis.\n\nACV, which is a snapshot in time and unaffected by the timing of the Emerson transaction was $791 million at the end of the fourth quarter, up 7.8% year over year. Breaking that down further. Engineering ACV was $373 million, up 5.5%. MSC ACV was $275 million, up 11.5%.\n\nAPM ACV was $30 million, up 14%. SSE ACV was $70 million, down 1%. And DGM ACV was $43 million, up 19%. Taken together, heritage AspenTech ACV, which includes engineering, MSC and APM was $6 million $678 million, up 8.2%.\n\nThe difference between this growth rate and the percent annual spend growth rate is the inclusion of approximately $4 million of remaining perpetual SMS and ACV that is slowly declining at the long tail as customers move away from the variable perpetual licenses. Overall, DGM and SSE demonstrated solid performance despite working through sizable integration activities and the distraction of the pending transaction with AspenTech. They have both entered fiscal year '23 having passed these challenges. Overall, we are pleased with the performance of the business and the significant improvement in growth generated in fiscal year 2023.\n\nAs Antonio noted, the underlying trends in our core markets are favorable, and we are well positioned to deliver faster growth over time as we execute on our strategic objectives. I would now like to provide some more detail on the progress we have made on the integration of DGM and SSE and how we are tracking against our synergy targets. To build on Antonio's earlier discussion, I'm pleased with our integration and synergy planning process for fiscal year 2023. We have delivered on the critical success criteria for our day one readiness plan.\n\nOur fiscal year 2023 plans incorporate the specific contribution from synergy initiatives from both top line growth and expense productivity. We do not plan on providing quarterly updates on our synergy progress but we do plan on reporting underperformance at the end of the fiscal year. Before I turn to guidance, I would like to discuss our balance sheet and the pending acquisition of Micromine. We ended the quarter with USD 449.7 million of cash and cash equivalents and $273.6 million of total debt.\n\nOur strong balance sheet is a strategic asset for the company and is underpinned by our highly profitable business model with multiyear contracts that are paid annually in advance, which yields predictable and sustained cash flow generation. As we highlighted as part of the Emerson transaction, the increased scale and capabilities of the new AspenTech provides a great opportunity to pursue additional acquisitions that broaden our capabilities and market reach. Our recent announcement of our proposed acquisition of Micromine is a great example. Micromine has developed a set of world-class software solutions for the metals and mining industry.\n\nIt's end-to-end solutions enable miners to digitalize their operations and significantly improved safety, sustainability, reliability and efficiency. Micromine is a great strategic fit for AspenTech and is well aligned with our focus on the Dual Challenge. The metals and mining industry will be a key strategic enabler of electrification, which will require substantial investments. We are paying AUD 900 million or approximately USD 623 million for Micromine, which we expect to close in the second fiscal quarter subject to regulatory approval.\n\nWe are intending to finance the acquisition through a combination of cash on hand and a new $475 million bridge term loan at the time of closing. We are very comfortable operating with that level of debt on our balance sheet and we will still have available capacity to pursue additional M&A opportunities. I would now like to close with guidance for fiscal year 2023. As Antonio mentioned, our outlook reflects both the strong underlying demand trends we see across the business, as well as a wider range of potential outcomes to reflect the growing uncertainty in the economy.\n\nTo that end, we are targeting 10.5% to 13.5% ACV growth for fiscal 2023. From a suite perspective, we expect the engineering MSC suite will contribute six to eight points of growth. DGM will contribute three points, SSE one point, and APM is expected to contribute approximately half to one and a half points of growth. Attrition is expected to be between 7% and 8% for the year.\n\nNote that we do continue expected improvement in heritage -- we do expect continued improvement in heritage AspenTech attrition trends in fiscal year '23 and estimate approximately three to four points of attrition. We expect an additional four points of attrition from SSE during the fiscal year. We expect minimal attrition from DGM to fiscal '23. We expect total bookings in the range of $1.07 billion to $1.17 billion, which includes $547 million of contracts that are up for renewal in fiscal 2023.\n\nWe expect revenue in the range of $1.14 billion to $1.2 billion. From an expense perspective, we expect total GAAP expenses of $1.186 billion to $1.196 billion. Taken together, we expect GAAP operating income in a range of loss of $46 million to positive $6 million with GAAP net income over a range of negative $8 million to positive $24 million. We expect GAAP net income per share to be in the range of a loss of $0.12 to positive $0.36.\n\nFrom a non-GAAP perspective, we expect total non-GAAP expenses of $637 million to $647 million, non-GAAP operating income of $503 million to $555 million, and non-GAAP income per share in the range of $6.40 to $6.89. As a reminder, our non-GAAP results exclude the impact of stock-based compensation expense, amortization of intangibles associated with acquisitions and acquisition and integration planning-related fees. Note that as a result of the Emerson transaction and the estimated purchase price allocation to intangible assets, fiscal year 2023 results will include a significant increase in the expense related to the amortization of intangibles. This will impact our GAAP profitability.\n\nFrom a free cash flow perspective, we expect free cash flow of $347 million to $362 million. Our fiscal 2023 free cash flow guidance assumes cash tax payments in the range of $94 million to $104 million. To wrap up, our business is performing at a high level and is well positioned for the future. We are incredibly excited about the new AspenTech and our ability to deliver even more value for our customers as we help them solve the Dual Challenge.\n\nOperator, we are now ready to take questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Matthew Pfau. Your line is open.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nHi, Matt.\n\nMatt Pfau -- William Blair and Company -- Analyst\n\nGreat. Thanks for taking my questions. Appreciate it, guys. Wanted to ask on the guidance for the ACV growth related to the heritage Aspen business.\n\nIt seems like under the bull case assumption there, there would only be a slight acceleration from what you saw in fiscal '22. So maybe just help us understand why under that bull case where the momentum continues into fiscal '23, we wouldn't see more of an acceleration in the ACV growth in the heritage Aspen business?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nYeah, Matt, if you break down the guidance that we gave, which is basically at the top of the range is eight points for heritage AspenTech, our engineering and MSC is three points, for DGM one point, for SSE half to point and a half for APM the growth of heritage AspenTech on an annual spend basis is about 11%. So the thing is that dominate -- you're looking at a different denominator as well. ACV, we ended the year at $672 million of annual spend. The ACV base is now $791 million.\n\nSo the numbers are shifting, so it makes it a little harder to estimate. But if you use the same basis, for heritage AspenTech, we're projecting our heritage AspenTech business to grow about 11% in fiscal '23.\n\nMatt Pfau -- William Blair and Company -- Analyst\n\nGot it. Really helpful. And then just one follow-up on the Micromine acquisition. Maybe you can just talk about your ability to integrate that acquisition, while it still at the same time, still working through the Emerson integration.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nYeah. Look, I'd like to think that one of our core expertise in AspenTech, old heritage Aspen and new Aspen is execution. We have a very detailed plan around integration and transformation activities, including capturing the synergies. We're well into that execution Micromine is an ongoing business, a full-blown business with its own organization structure and so on.\n\nOnce that transaction closes, that that business will be able to run on its own with its current management structure is our expectation, and it will take time to fully integrate it into AspenTech is a business that is accelerating their term licensing business and growth into mining on a global basis. So while we will work on integrating some of the administrative functions and systems, we'll leave it to run on its own for a period of time.\n\nMatt Pfau -- William Blair and Company -- Analyst\n\nGreat. Thanks, guys.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Andrew Obin. Your line is open.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nHi, Andrew. Andrew, you might be on mute.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nI am on mute. Can you hear me now?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nYes.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nYeah, apologies. Can you just give us more color on Micromine. What was the timeline of the acquisition? What was Emerson team's involvement? And how does Micromine, if it all integrates with Emerson's control offering?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nWell, let me look. So this is an asset that we've known about for a while. Of course, it's owned by private equity at the moment. And it was at that point that the potential, the private equity firm that decided to kick off a process to determine the interest on the asset that we got engaged.\n\nIt was a fast moving process. Certainly, Emerson's capabilities and expertise contributed to our ability to execute fast and successfully in this. Emerson was fully involved in determining the adequate value and also consent into the funding for the transaction. And then look, as far as -- this is pure software technology.\n\nSo it eventually, how it integrates into Emerson systems, we'll have to take a look at that like we are, and we will about some of our solutions today in the MSC suite. But Emerson has an existing business in a couple of regions for mining. And we believe that it will be -- certainly, there will be synergies both to AspenTech and eventually Emerson as a channel for that software as well.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nThanks a lot. And since closing the deal, could you just give us color on how the commercial agreement with Emerson is working in real life. And for heritage AspenTech, what kind of impact are you seeing from this commercial agreement?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nChantelle, would you like to tackle that first?\n\nChantelle Breithaupt -- Chief Financial Officer\n\nYeah. Yeah, I can definitely give some color to it, Andrew, and then Antonio can come with anything to. So I would say we're off to a fantastic start. We have the organization in place.\n\nWe're clear on rules and engagement. We've had some in meetings. We have geographical trips planned. We have account planning underway.\n\nSo I think it's off to an amazing start. And I think we're clear with quotas and targets on both sides of the relationship. So quite excited personally by the speed that we've been moving at. I think that -- so now we have all that, Andrew, I think the results will be more of a Q1 conversation as we're just getting started.\n\nThe thing I can tell you is that the joint account teams are knowing each other. They're very interested in how they can help each other. And that relationship, I think, is off to a great start in Q1.\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nThanks a lot.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nGreat. Thank you.\n\nOperator\n\nYour next question comes from the line of Jason Celino. Your line is open.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nHi, Jason. You're probably on mute as well, Jason.\n\nDevin Au -- KeyBanc Capital Markets -- Analyst\n\nHey, sorry. This is actually Devin Au for Jason. First one I have is on the APM. Just curious to hear from some of your recent customer wins and maybe any sort of updates you can provide on the number of pilots you've implemented during the quarter.\n\nI just want to -- and any sort of color you can provide on what's giving you the confidence on that growth range in fiscal '23?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nYeah. I mean, look, so as we stated in the call in the prepared remarks, we saw a strong demand for APM in fiscal '22, about 1.1 points of gross growth. Unfortunately, we did have the set of customers that did not realize the benefit from the use of that software to deliver on projects and then other customers that were under very strict lockdowns over the last 12, 18 months that ended up not successfully deploying the solution. But having said that, we believe that most of that is beyond us.\n\nWe have a strong pipeline in fiscal '22 -- '23 for APM. And in addition, Emerson will be taking to market our APM suite. They're already -- they have already identified a pipeline of opportunities for APM in different markets. And some of them, we hope will close this quarter as well.\n\nSo overall, we feel good about that suite. Certainly, COVID created different dynamics, but now that we're moving beyond COVID into a more normal environment we believe that range that we gave for guidance is a comfortable one for that suite.\n\nDevin Au -- KeyBanc Capital Markets -- Analyst\n\nGreat. And maybe just one more on Micromine. Seems like a great fit to new AspenTech. Could you maybe provide some color on the competitive landscape there? Who is their main competitors in that business?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nYeah. Yeah. Look, as we move into new areas, we're taking on a new sets of competitors, while with OSI has been more of the traditional industrials in the transmission and distribution business, GE and ABB and Siemens and so on. For Micromine is more pure software players, companies like Bentley, Aviva, Dassault and a couple of other ones.\n\nSo we're looking forward to engaging in competitive situations with the software companies. Jason -- or, sorry, you might be on mute again.\n\nDevin Au -- KeyBanc Capital Markets -- Analyst\n\nThank you for the color.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nYeah. No problem. Thank you.\n\nOperator\n\nYour next question comes from the line of Mark Schappel. Your line is open.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nHi, Mark.\n\nMark Schappel -- Loop Capital Markets -- Analyst\n\nHey, thanks for taking my question. Antonio, I was wondering if you could just provide some additional color around Micromine. Just building off some of the questions. And this would be around things such as how much revenue do they generate annually? What's the revenue growth rate? What does the profitability profile look like?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nYeah. Look, Mark, we will come up once the transaction closes with basically a new set of projections for the combined new AspenTech with Micromine but the revenue will certainly be material. We've always said that anything that we acquire needs to support or be accretive to our double-digit growth ambitions and best-in-class profitability. You can assume that that is the case in this instance that in both metrics, they are accretive to our profitability and double-digit growth ambitions.\n\nMark Schappel -- Loop Capital Markets -- Analyst\n\nOK. Great. And then a question around your customers' sustainability initiatives. I know in the past, I believe, a few, if not a few more customers have set up separate sustainability budgets that I know you're hoping or intended to sell into.\n\nI was wondering if you could just comment on what you're seeing with respect to that trend, whether you're seeing more companies or customers set up separate sustainability budgets?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nWell, look, at the end of the day and by the way, we have an initiative internally to be able to identify opportunities were driven specifically for sustainability reasons, for profitability reasons or both because on time, most times, it's one and the same. We can make our customers profitable and sustainable at the same time with the same products. But look, what it is absolutely true is that almost every conversation with our customers now involves sustainability areas whether it is how do we reduce emissions, how do track emissions, whether it is chemical's recycling and circularity, hydrogen, carbon capture and sequestration, as I mentioned in the call. I mean, we held a seminar two weeks ago.\n\nI've been in this company for 26 and a half years, and I was blown away to hear that we had 1,900 people register for that webinar, which is unbelievable. So look, there's no doubt that the sustainability imperative is real. We now saw how the U.S. Senate approved a big sustainability investment, and we believe that this will continue to be a trend.\n\nMore and more companies involved in decarbonization, air carbon capture, electrical batteries. Today, Google, and Facebook are customers of AspenTech, new customers, but they are. They're using our engineering suites to model energy consumption in some of their data farms or server farms. So there's a lot going on in the space.\n\nAnd what we're seeing is a new category of customers that are driven mainly by their technology innovation around sustainability.\n\nChantelle Breithaupt -- Chief Financial Officer\n\nYeah. I think the other thing I would add too is I think there's going to be a convergence between the markets and our customers. So very true, Antonio said, from a customer perspective. But the other thing I would add is the markets and how their vernacular is changing.\n\nIf you read some of the recent articles from some of the banks on being capex, now we're starting to talk about capex as green capex, we're categorizing into sustainability things such as electrification, emission, CCS. So I think those things will start to converge as our customers decide their inner workings in the sense of who owns those and how they configure it for the Q. So I would just offer that additional context.\n\nMark Schappel -- Loop Capital Markets -- Analyst\n\nGreat. Thank you.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nThank you, Mark.\n\nOperator\n\nComes from the line of Patrick Scholes. Your line is open.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nHey, Patrick.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nCongrats on the quarter, and thanks for taking my question. Could you talk a little more about the early receptivity you are getting from Emerson customers as they move on to the S and token model? And then can you also remind us on what the contract durations look like? And how long do you think it will take to get the new customers move over to the token model?\n\nAntonio Pietri -- President and Chief Executive Officer\n\nWell, so I assume you're referring to the SSE and OSI businesses. So there's also the commercial agreement and Emerson going to market on their own, reselling our products and solutions. Eventually, Emerson will find new customers through that commercial agreement that where they'll sign up to the suites of heritage AspenTech, and those will be talking licensing entitlements. And well, that should happen even this quarter or over the next few quarters and years.\n\nLook, it takes a few months to set up tokenized products, meaning set of the license management systems and adapt the product so that they can tap into the license management system. That's ongoing work for both SSE and OSI. So our expectation is that the real impact from tokenization will be felt is in fiscal '24 and beyond. But in the meantime, we were taking those products to market as term products, meaning we're trying to sell them on a term basis product by product.\n\nAnd eventually, we'll also convert those customers to full token customers. But our focus right now is on getting everything ready so that late this year, fiscal year and into fiscal '24, we're in full mode of selling token licenses and really having a business where we've already debundled services and license with OSI and we're now already with a lot of momentum in the transformation of these two businesses.\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nGreat. Thank you.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThere are no further questions at this time. Mr. Pietri, I turn the call back over to you.\n\nAntonio Pietri -- President and Chief Executive Officer\n\nWell, I want to thank everyone again. This is our -- this is my 40th earnings call as CEO of AspenTech, but it is my first call as CEO of the new AspenTech. Very glad to have had this call. We're incredibly excited about the future and what lies ahead for new AspenTech and look forward to engaging you all and with Chantelle as well in future investor conferences and roadshows.\n\nSo thank you, everyone.\n\nChantelle Breithaupt -- Chief Financial Officer\n\nThank you.\n\nDuration: 0 minutes\n\nBrian Denyeau -- Investor Relations\n\nAntonio Pietri -- President and Chief Executive Officer\n\nChantelle Breithaupt -- Chief Financial Officer\n\nMatt Pfau -- William Blair and Company -- Analyst\n\nAndrew Obin -- Bank of America Merrill Lynch -- Analyst\n\nDevin Au -- KeyBanc Capital Markets -- Analyst\n\nMark Schappel -- Loop Capital Markets -- Analyst\n\nPatrick Scholes -- Truist Securities -- Analyst\n\nMore AZPN analysis\n\nAll earnings call transcripts"
}