{
  "companyName": "Cisco Systems",
  "companyTicker": "CSCO",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/cisco-systems-csco-q4-2022-earnings-call-transcrip/",
  "content": "Cisco Systems (CSCO 0.29%)\nQ4 2022 Earnings Call\nAug 17, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to Cisco's fourth quarter and fiscal year 2022 financial results conference call. At the request of Cisco, today's conference is being recorded. If you have any objections, you may disconnect. Now, I would like to introduce Marilyn Mora, head of investor relations.\n\nMa'am, you may begin.\n\nMarilyn Mora -- Head of Investor Relations\n\nWelcome, everyone, to Cisco's fourth quarter fiscal 2022 quarterly earnings conference call. This is Marilyn Mora, head of investor relations, and I'm joined by Chuck Robbins, our chair and CEO; and Scott Herren, our CFO. By now, you should have seen our earnings press release. A corresponding webcast with slides, including supplemental information, will be made available on our website in the Investor Relations section following the call.\n\nIncome statements, full GAAP to non-GAAP reconciliation information, balance sheets, cash flow statements, and other financial information can also be found in the Financial Information section of our Investor Relations website. Throughout this conference call, we will be referencing both GAAP and non-GAAP financial results, and we'll discuss product results in terms of revenue and geographic and customer results in terms of product orders unless stated otherwise. All comparisons made throughout this call will be done on a year-over-year basis. The matters we will be discussing today include forward-looking statements, including the guidance we will be providing for the first quarter and full year of fiscal 2023.\n\nThey are subject to the risks and uncertainties that we discuss in detail in our documents filed with the SEC, specifically the most recent reports on Forms 10-K and 10-Q, which identify important risk factors that could cause actual results to differ materially from those contained in the forward-looking statements. With respect to guidance, please also see the slides and press release that accompany this call for further details. Cisco will not comment on its financial guidance during the quarter unless it is done through an explicit public disclosure. I will now turn it over to Chuck.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nThank you, Marilyn, and thanks to all of you for joining us today. I'm very proud to share that we had a strong end to our fiscal year in the midst of an incredibly dynamic environment. In fact, we set several records with our performance this year. Let me first touch on those.\n\nFor the full year of fiscal '22, we delivered record non-GAAP EPS of $3.36. Record product orders, which fueled our backlog to the highest level ever recorded, as well as our second strongest year of revenue in the history of the company at $51.6 billion. We continue to see strong customer adoption of our software and subscriptions, driven by the targeted investments we've been making. We also had record net income, which reflects our operating discipline despite external challenges, including supply chain and inflation.\n\nOur ongoing business transformation continues to show progress across our KPIs with annualized recurring revenue or ARR, and remaining performance obligations, or RPO, both setting record highs. These important metrics illustrate the increasing recurring nature of our revenue streams. This, combined with our record backlog provides us with enhanced visibility into our business looking forward. While this was certainly a complex year, we executed well.\n\nI want to thank our teams for their perseverance, determination, and unwavering commitment to our customers and our partners. Our team's commitment to accelerated innovation has put us in a unique position of strength for fiscal '23 and over the long term. Now, I want to be clear on our outlook for fiscal '23. We expect strong performance across our portfolio, driven by our continued focus on innovation and easing of supply constraints to drive solid top-line growth and profitability.\n\nWhile we anticipated some moderation from the unprecedented product order growth of last year, demand signals remain solid. We do expect to continue to experience higher costs in the short term, driven primarily by higher component, freight, and logistics costs, which is reflected in our Q1 guide. However, as you'll see in our annual guidance, we expect this margin pressure to begin to ease as the year progresses. Long term, there are many multiyear growth opportunities ahead of us that gives me confidence in our future.\n\nThere are currently more technology transitions occurring concurrently than I've seen in 20 years. Long-term megatrends like hybrid cloud, hybrid work, security, IoT, 400-gig and beyond, 5G, and WiFi 6, as well as the move toward application observability, will likely provide tailwinds to our growth. With our portfolio in such a strong position to help our customers, I'm quite optimistic about what's ahead. Before we discuss the quarter in detail, I want to provide some additional color on the supply situation and how we continue to build greater resiliency.\n\nAfter a challenging April due to the COVID-related shutdowns in Shanghai, and the impact on semiconductor and power supplies, overall supply constraints began to ease slightly at the back half of the fourth quarter and continuing into the start of Q1. While the component supply headwinds remain, they have begun to show early signs of easing. The decisions we made and the multiple actions we have taken over the past two years are helping to improve our resiliency and will help offset cost inflation. These include adding new suppliers, leveraging alternative suppliers, redesigning hundreds of products to use alternative components with similar capability, and targeted price increases, all of which position us for the future.\n\nThese actions, along with the tremendous efforts by our supply chain team and the investments we've made in building capacity to meet growth have the potential to drive momentum into fiscal '23. Moving to performance highlights in the quarter. We delivered revenue above the high end of our guidance range, and non-GAAP EPS came in at the high end of our guidance range. We achieved healthy operating margins and generated solid cash flow and returned nearly $4 billion to Cisco stockholders through cash dividends and share repurchases.\n\nWith annual product order growth of 14% for the fiscal year, we exited the year with record product backlog. In addition, our RPO totaled more than $31 billion, and when combined with low cancellation rates, which remain below pre-pandemic levels, this sets the stage for increased visibility and strong revenue growth as we head into fiscal '23. In terms of our product orders this quarter, we delivered the second highest orders in absolute dollars in the history of the company. It was second only to our performance in Q4 of fiscal '21, and on a sequential basis, it was up greater than 15% with strong growth in enterprise, commercial and public sector.\n\nFrom an annual growth rate perspective, we clearly faced some very tough comparisons from the record orders we saw in Q4 last year, where we had over 30% growth. Based on that, the year-over-year decline was not a surprise nor is it concerning. It's important to keep in mind that in the near term, the rate and pace of our revenue growth is much more a function of component availability than on our quarterly product order growth. With RPO of over $31 billion, almost $17 billion of which will be recognized as revenue over the next 12 months, and a record backlog, we have great top-line visibility.\n\nThanks to the relentless effort of our entire organization, the business remains stronger than before the pandemic. From a demand perspective, we continue to experience solid customer activity beyond our ability to deliver as is reflected in the growth of our backlog that we saw throughout the quarter. While our business is not immune to macro trends, we will remain disciplined in our operations while benefiting from robust multiyear investment trends and the technology transitions I mentioned earlier. Our innovation is helping our customers and partners navigate an increasing amount of complexity, and there is a greater sense of urgency to leverage leading-edge technologies to deliver on their strategic objectives.\n\nThis is leading them to consistently look to Cisco and our unique and differentiated innovation to help them advance their most pressing business priorities. We recently held our Cisco Live customer event in person for the first time in three years and had over 15,000 in attendance, including thousands of our largest customers and many more participating virtually. Our discussions with them focused on strategic projects, supply assurance, and the critical role Cisco can play to support their long-term technology road maps. They did not indicate any fundamental shift in their commitment to technology investments.\n\nRegardless of what the coming quarters may bring, we have a proven track record of being able to adjust in difficult environments. Our value proposition to our customers remains as strong as ever. In our web-scale business, we continue to see momentum even as the business becomes larger, as product orders were up more than 50% on a trailing four-quarter basis. We see significant opportunity ahead as these customers build out massively scalable cloud networks and increasingly turn to Cisco to help them meet accelerating demand for cloud services.\n\nOur leadership in silicon, optics, software, and systems enables us to win as hyperscalers value industry-leading performance and innovation. We are expanding our footprint, driven by data center buildouts with our Silicon One-based Cisco 8000 routers, the fastest-growing platforms in Cisco's history. Together with optics from Acacia, we have a strong foundation for 400-gig and beyond to rearchitect the Internet with routed optical networking. In addition, we recently booked and shipped our first 800-gig systems to one of our web-scale customers.\n\nOn the IoT front, we also now have more than 200 million connected things on our cloud platform with growth driven by connected car. We finished fiscal '22 with product orders in excess of $1 billion and growing double digits. We continue to make progress on our transformation to more software and subscription-based recurring revenue. ARR of approximately $23 billion was up 8% with product ARR increasing by 13%.\n\nWe had strong subscription revenue this quarter, driven by our growing portfolio of recurring offers. While our software revenue was down slightly, once supply constraints improve and we begin to increase product shipments, we expect to see an improvement in software, subscription, and services that are attached to hardware products in our backlog. The investments we've made in innovation are paying off as our competitive position is very strong. In Q4, we introduced several new cloud-delivered innovations across our portfolio to help organizations drive productivity and resiliency.\n\nWe launched Nexus Cloud, a platform to help our customers deploy, manage, and operate their data center networks from the cloud. In addition, we introduced Calisti and Panoptica, two new cloud-native API-first tools for faster and better application development. We also announced AppDynamics Cloud, a next-generation version of our observability platform for cloud-native applications. In addition, we shared our strategy to help our customers connect their entire security architecture with our new platform, Cisco Security Cloud, which will be a game changer for them as they look to secure their multi-cloud environments with a single cloud-delivered security platform.\n\nThis is just one part of our broader security innovation cycle. Building on the double-digit growth we saw in security this quarter, we are investing across our security business, focusing on cloud-based offerings, best-in-class AI-driven threat detection, and end-to-end security architectures. These innovations position us well for leadership in the security market. In summary, we executed well on our strategy and transformation during what remains a very dynamic time.\n\nThis led to a strong close to our fiscal year, setting several records across our business, thanks to the solid execution from our teams, our market-leading innovation, and our continued growth of recurring revenue. We also took decisive actions to help offset inflation and build resiliency in our supply chain, while investing in our business to position us well for long-term growth. The power of our technology continues to be a critical driver of economic growth and productivity. Our results and outlook demonstrate the critical role that Cisco plays as a leader in bringing innovative technology solutions to customers today and into the future.\n\nAs we move into fiscal '23, we remain guided by our purpose-led culture and deeply committed to delivering value for our customers, partners, and investors, as well as continuing to be an amazing place to work for our employees. I will now turn it over to Scott.\n\nScott Herren -- Chief Financial Officer\n\nThanks, Chuck. I'll first provide some detail on our financial results for the quarter then cover the full fiscal year, followed by our guidance. Our overall Q4 results reflect strong execution in an environment with continuing supply constraints, and as Chuck mentioned, increased costs reflected in our gross margins. We're very pleased that our shipment levels were above our expectations and that total revenue of $13.1 billion exceeded the high end of our guidance range as we saw improvement in supply as a direct result of the numerous actions we've taken over multiple quarters.\n\nOur non-GAAP operating margin was 32.4%, down 110 basis points and in line with our guidance. Non-GAAP net income was $3.4 billion, down 3%, and non-GAAP earnings per share was $0.83, coming in at the high end of our guidance range. Looking at our Q4 revenue in more detail. Total product revenue was $9.7 billion, and service revenue was $3.4 billion, both flat year over year.\n\nWithin product revenue, secure Agile Networks was down 1%. Switching declined in both data center and campus driven by supply constraints. We saw growth in our Catalyst 9000, Nexus 9000, and Meraki switching offerings. Enterprise routing decline primarily driven by Edge and SD-WAN, offset by strength in access.\n\nWireless had strong growth, driven primarily by our Meraki wireless offerings. We also had double-digit growth in servers. Internet for the future was down 10% with strength in web-scale revenue, offset by declines in cable, edge, and optical. Collaboration was up 2%, driven by growth in collaboration devices, partially offset by declines in our meetings and calling offerings.\n\nEnd-to-end security had record revenue with strong growth of 20%, driven by strength across the entire portfolio. Our Zero Trust portfolio continues to perform well, driven by strong performance in our dual offering. Optimized application experiences had solid growth of 8%, driven by double-digit growth in our SaaS-based offering, ThousandEyes. We continue to make progress on our transformation metrics as we shift our business to more software and subscriptions.\n\nWe saw strong performance in our ARR of $22.9 billion, an increase of 8% with product ARR growth of 13% driven by several large software transactions closing during the quarter. Total software revenue was $3.9 billion, a decrease of 2% with software subscription revenue up 1%. Bear in mind, we continue to have well over $2 billion of software orders in our product backlog. 83% of the software revenue was subscription based, which is up two percentage points year over year.\n\nTotal subscription revenue was $5.8 billion, an increase of 2%. Total subscription revenue represented 44% of Cisco's total revenue. And RPO was $31.5 billion, up 2%, product RPO increased 6%. Service RPO decreased 1%, and our total short-term RPO grew 4% to $16.9 billion.\n\nTotal product orders in Q4 were the second highest in our history. While product orders were down 6% for the quarter, it's important to keep in mind the compare against 31% growth a year ago, which was the highest product orders in our history. On a sequential basis, product order growth was up over 15% with double-digit growth in enterprise, commercial, and public sector. Looking at our geographic segments year over year.\n\nThe Americas was down 9%, EMEA down 4%, and APJC up 1%. In our customer markets, enterprise was down 15%, public sector was down 3%, service provider was down 7% and commercial was up 1%. From a non-GAAP perspective, total gross margin came in at 63.3%, down 230 basis points year on year; product gross margin was 61.3%, down 370 basis points; and service gross margin was 69%, up 160 basis points. In our product gross margin, higher component and commodity costs, as well as higher freight and logistics related to supply constraints, were the predominant drivers of lower-than-expected margins.\n\nWe saw increased benefits from the pricing actions we have taken, as well as for mix. Once again, we had a significant increase in our backlog levels for both hardware and software, well beyond our normal historical levels. As Chuck said, our ending product backlog was a record for the year. And just a reminder, backlog is not included as part of the $31.5 billion in remaining performance obligations.\n\nIt's important to note that the combined total of our backlog and RPO gives us great visibility into our fiscal '23 top-line growth. We ended Q4 with total cash, cash equivalents, and investments of $19.3 billion. Operating cash flow for the quarter was $3.7 billion, down 18% year over year, primarily driven by advanced payments and inventory purchases to secure future supply. In capital allocation, we returned $4 billion to shareholders during the quarter, was comprised of $2.4 billion of share repurchases and $1.6 billion for our quarterly cash dividend.\n\nTurning to the full fiscal year results. Overall, our financial results were solid in a year where we faced significant supply constraints, rising component, and related costs, and the war in Ukraine. Our financial performance was highlighted by strong demand with product order growth of 14%, including two quarters of truly impressive 33% growth, though our performance was clearly impacted by the supply constraints. Revenue was $51.6 billion, up 3%, while non-GAAP earnings per share were up 4% at $3.36.\n\nIn terms of our software metrics, total software revenue was flat at $15.1 billion, with the product portion up 2%, 81% of software revenue was subscription-based, which is up two percentage points year on year. Total subscription revenue was $22.4 billion, an increase of 2%, and total subscription revenue represented 43% of Cisco's total revenue. Total non-GAAP gross margin was 64.6%, down 150 basis points, and our non-GAAP operating margin was 33.6%, up 10 basis points. On the bottom line, non-GAAP net income was $14.1 billion, up 3%.\n\nWe delivered operating cash flow of $13.2 billion, down 14% compared to fiscal '21, driven primarily by advanced payments for inventory purchases to secure component supply. While these payments had a negative impact on full-year operating cash flow, these and our other related actions helped to improve the supply situation in Q4 and future quarters. From a capital allocation perspective, we returned approximately $14 billion in value to our shareholders via cash dividends and stock repurchases, representing 109% of our free cash flow. This was comprised of $7.7 billion of share repurchases and $6.2 billion in quarterly cash dividends.\n\nWe also increased our dividend for the 11th consecutive year in fiscal '22, reinforcing our commitment to returning excess capital to our shareholders and our confidence in the strength and stability of our ongoing cash flows. Our strong balance sheet and overall financial position is clearly a competitive advantage in tough environments. To summarize, we executed well in Q4 and had a solid fiscal year in a highly complex environment while continuing to make progress on our business model shift and making strategic investments in innovation to capitalize on our significant growth opportunities and expanding addressable markets. The demand for our products and services is strong as we drive innovation through continued investment and the shift to more recurring revenue, delivering growth, and driving shareholder value.\n\nTurning to our financial guidance for Q1. We expect revenue growth to be in the range of 2% to 4%. We anticipate non-GAAP gross margin to be in the range of 63% to 64%. Our non-GAAP operating margin is expected to be in the range of 31.5% to 32.5%.\n\nand non-GAAP earnings per share is expected to range from $0.82 to $0.84. For fiscal '23, our guidance is as follows: We expect revenue growth to be in the range of 4% to 6% year on year; non-GAAP earnings per share guidance is expected to range from $3.49 to $3.56, also up 4% to 6% year on year. In both our Q1 and full-year guidance, we're assuming a non-GAAP effective tax rate of 19%. I'll now turn it back to Marilyn so we can move into the Q&A.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Scott. Michelle, let's go ahead and queue up the list of Q&A.\n\nOperator\n\nThank you. Sami Badri with Credit Suisse. You may go ahead.\n\nSami Badri -- Credit Suisse -- Analyst\n\nHi. Thank you. I actually had two questions. First thing is for fiscal year '23 your revenue growth expectations came in a bit stronger than most Street expectations.\n\nAnd maybe you could just walk us through the composition of the segment and what's driving the strength and maybe which segments may potentially lag some of the stronger segments. And then my other question is -- maybe you could just give us some color on the composition of gross margin regarding pricing and productivity in fiscal 4Q of '22, that would be helpful.\n\nScott Herren -- Chief Financial Officer\n\nYeah. Thanks, Sami. As we look at the forecast that we've given you for fiscal '23, balance growth again, 4% to 6% growth on the top line, 4% to 6% growth on the bottom line. when you start to peel that back, of course, we don't guide at that level.\n\nWhat we have seen, as you'd expect, is, again, nice demand, as Chuck talked about on the call, through the end of the fourth quarter, but a little bit different by industry vertical. Retail, not surprisingly, under a little bit of pressure. Financial services under a little bit of pressure. Pretty much strength across most of the rest of the sector, a little bit of pressure in healthcare as well.\n\nSo, that's -- as we roll into fiscal '23, that's what we're seeing kind of vertical by vertical. We saw good double-digit growth sequentially, again, Q3 to Q4 because the year-on-year compares are quite difficult with that 31% growth we had a year ago, but good sequential growth, if you look at it by customer market in both enterprise, public sector and commercial. So, again, seeing pretty balanced growth across the board. And that's our expectation as we roll into fiscal '23.\n\nOn the gross margin question, we are getting a benefit from price. One of the things that we've talked about, though, is there's a lag between the price increases that we put in place and what we see actually showing up in reported revenues. And I know you know this from prior quarters, Sami, we saw some of that benefit in Q4, and you'll see this in our filings in our 10-Q -- our 10-K filing for the end of the quarter. It's about 1% up year-on-year gross margin driven by price and then, of course, the offset coming from higher cost, both component costs and freight and logistics.\n\nSami Badri -- Credit Suisse -- Analyst\n\nGot it. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nNext question, please.\n\nOperator\n\nTim Long with Barclays. You may go ahead.\n\nTim Long -- Barclays -- Analyst\n\nThank you. Just wanted to ask on maybe two quick ones. One on the software business. Chuck, you talked about kind of flattish performance, but still have carrying a lot of backlog there.\n\nThat's been a case for a few quarters here. So, maybe you could just talk a little bit about what you think it's going to get taken to get this business moving a little bit more aggressively toward that software model. And then I did want to follow up on the cloud vertical, still running really strong orders there. Can you talk a little bit about – is the breadth of portfolio shipping into that growing? I know the 8-K is strong, but any other highlights of strength there, that would be great.\n\nThank you.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nThanks, Tim. So, let's start with the software. And you're right, the software is flattish. There's two things that I would point out.\n\nWe have -- we obviously have been transitioning from perpetual software model, which is in decline, and that's by design. We want to decline our perpetual software and increase our subscription software. And the way I think about it is our perpetual was down roughly 14% during the quarter. And we also, as Scott said, have over $2 billion, and it's actually a higher number exiting Q4 than it was in Q3 of software in backlog, as you said, connected to hardware.\n\nSo, those are two contributing factors, which is why we really should be thinking about the ARR situation because that's reflective of the ACV that we basically had exiting the quarter, and it's -- so that's an indicator of future software revenue. So, we're comfortable with it. And I think once we get through some of the supply chain stuff, that we'll start to see that be a little more reflective of what we've been planning on. On the cloud vertical, we continue to win new insertions.\n\nThat business is approaching billion annually now. After just two or three short years ago, it was pretty close to nothing. And so, the teams have done a fantastic job. It is -- obviously, over the last four quarters, it's grown 50%.\n\nFrom a revenue perspective, it's very supply chain-dependent. So, I wouldn't get too wrapped up about the revenue versus the orders right now. I think we'll work our way through that over the next four to five quarters. But overall, really pleased with where we are.\n\nTim Long -- Barclays -- Analyst\n\nOK. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Tim. Next question, please.\n\nOperator\n\nRod Hall with Goldman Sachs. You may go ahead, sir.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nYeah. Hey, guys, thanks for the question. I guess I wanted to dig into this order growth a little bit. Obviously, very strong numbers there, but somewhat inconsistent with the way that we would have expected them to come out.\n\nAnd I just wanted -- and the thing that's inconsistent is you guys are saying up over 15% in the quarter, but then down 6% on a year-over-year basis. We would have calculated closer to flat, like minus $1 million. So, we're just curious whether there was any restatement of the July quarter last year. You guys had called out 31% order growth there or anything else going on with the dynamics of these orders that might help us to understand that got discrepancy at least in our numbers.\n\nAnd then I've got a follow-up.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYes, Rod, I saw some folks who thought we would be down 15%. So, I think it's just different ways of modeling. When we were thinking about this question, and we obviously know that 31% and then in Q1, we're comparing is 33%. We were trying to find other ways to look at the business to indicate the reality of the demand signal.\n\nSo, let me just give you a few of those characteristics. First of all, from a product order perspective, as I said, it was the second highest in history, which would be only eclipsed by Q4 a year ago. And it grew 15%. And on a sequential basis, that's actually in range with our historicals.\n\nIf you go back to -- if you take out last year, which was an abnormal sequential then it's very much in line. It's in the range of what we've seen for the last 10 years, the 15%. You had enterprise, public sector, and commercial all growing in solid double digits on a sequential basis, and again, growing sequentially off our largest third-quarter product bookings ever. We also have continued growth in the pipeline.\n\nAs we exited Q4, we saw very good growth in pipeline, which is a good indicator of going forward. And the final thing I would tell you is that if you -- the way our sales teams forecasted the quarter at the beginning of Month 3, they revised their forecast for the quarter, and they finished stronger than they thought they would, and we had strength as we exited the quarter. And so, linearity was solid. And so, we just haven't seen anything that would indicate a significant shift in the demand signal from our customers.\n\nScott Herren -- Chief Financial Officer\n\nYes, Rod. So, there was no -- to be clear on your question, there was no change in the way we report year on year. It's exactly the same. The only other thing that I would add, too, to the comments that Chuck just made, linearity in the quarter was quite strong.\n\nIn fact, the last week of the quarter was actually the same size as it had been in the prior year and the month-to-month linearity was exactly in line with last year and with prior year's expectations. So, we saw strength right through the end of Q4.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nGotcha. OK. And just as a follow-up, can I ask you guys on inventory? I know inventories moved up quite a bit again. Do you think inventory starts to come down next quarter? Or just curious kind of where we are in that ebb and flow of inventory given the supply shortages and so on.\n\nScott Herren -- Chief Financial Officer\n\nYes. What's sitting in inventory, Rod, is the rest of the parts that aren't under constraint so that as the ones that are constrained free up, of course, we can square the set and get the product shipped out the door to our customers. So, it is growing. It's up about $1 billion year on year, sitting at $2.5 billion.\n\nOur advanced payments are up as well. Both of those are a bit of a headwind to cash flows, as you saw. But yes, it's much more a statement of making sure we've got everything we need so that as those constrained parts clear up, which we saw a little bit of that toward the end of Q4, we can square the sets and get it out the door and in the hands of our customers.\n\nRod Hall -- Goldman Sachs -- Analyst\n\nOK. Great. Appreciate it, guys. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nAll right. Next question, please.\n\nOperator\n\nThank you. Amit Daryanani from Evercore. You may go ahead.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nYes. Thanks for taking my question. I have two as well. The question I have is just on gross margins or maybe when I think about the EPS guide of 4% to 6% for fiscal '23.\n\nHow are you thinking about gross margins in that backdrop? And then are buybacks embedded in that guide as well?\n\nScott Herren -- Chief Financial Officer\n\nYes. So, there's no added buyback in there. We've talked about our cap allocation policy. Our share buybacks have both a systemic component to it that's just offsetting the shares that we issued through our equity plans and an opportunistic component.\n\nOn the -- what's our expectation on gross margin through the year? Of course, we don't guide that for the full year, Amit. But what I'd say is my expectation is as we go through the year and we can work through the backlog, we'll begin to ship out of that backlog more and more orders that actually reflect the price increases that we put in place last year. And as we do, of course, that will be a tailwind to margins throughout the year. So, I would see margins going up as much as 50 basis points between our first quarter guide and where we end the year.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nAnd then if I can just follow up, there's been a fair amount of fear that higher interest rates look like to impact enterprise spending across the board. Your trend, your guide doesn't seem to suggest you see any signs of that. But I'd love to get your perspective, what are you hearing from your customers as the macro environment is changing? And really related to that, are you seeing any shift in how they procure or what they want to buy from you as the macro environment changes?\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYes, it's a good question. And we -- what I would say is that we are not immune to any significant change in the macro that would result in enterprise spending shifting up. My comments are just that we haven't seen a material demand signal change as we've entered into Q1. So, that's where we are.\n\nI think on last call, I believe I talked a lot about how I believe that post pandemic, the view of technology by our customers is much different than it would have been seven, eight, nine years ago there. I think if you ask our customers if they would pause spending during a crisis, they would probably respond, when is there not going to be a crisis given what we've dealt with the last three years? And so, in general, we don't hear a lot of difference relative to your question around have we seen any different buying behavior or what are they trying to buy from us. In some cases, customers are looking for a little shorter ROI, so that affects how they think about what products they're buying in these kinds of times. In some cases, customers are looking ahead to lead times to fiscal '23 budgets and trying to better understand what their budgets are going to look like because the shipments and the payments would be in the '23 time frame.\n\nBut other than that, we're not seeing anything significantly different.\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nPerfect. Thank you. Congrats on a nice print.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nThanks, Amit.\n\nScott Herren -- Chief Financial Officer\n\nThanks, Amit.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Amit. Next question.\n\nOperator\n\nThank you. Meta Marshall with Morgan Stanley Investment Research. You may go ahead.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nGreat. Thanks. A couple of questions for me. Maybe just on kind of increasing supply availability, I just wanted to get a sense of how much of that do you feel like is just some of these lagging edge components are starting to become more available? And how much of that is a result of kind of redesigns that you've done over the course of the year that have just kind of given you more optionality? And then maybe just a second question for you, Chuck.\n\nJust as we've seen an evaluation correction on a lot of kind of the software space. Like how does that change your view of strategic activity? Thanks.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nThanks, Meta. So, on the first one, I'd say that it's a combination of both of those. As we said earlier, we saw increased volumes in the broker network during the quarter, which candidly was an opportunity we took advantage of, which is why you saw the higher top line, we were able to get more products shipped to our customers, which we obviously were very happy about, but we had to pay more for those components, and we think that will continue probably over the next 60 to 90 days. And then we think some of those purchases will begin to become available from the same suppliers that have put the excess inventory into the marketplace.\n\nAt the same time, we have -- and I think I said this on our last call, we've had hundreds of product design -- redesigns going on. And two of our high-volume products that also have good margins will begin to ship in the redesigned space sort of toward the latter into Q1 into the balance of the year, which we think will be helpful as well. So, it's a combination of both of those things. And that's what gives us a little bit of optimism that things will continue to improve during the year.\n\nOn the second question, on the valuations, I've had this one a few times and I've been asked if our M&A strategy has changed because of the valuations. And I've said that our strategy hasn't changed, but the openness to talk to us from some of the companies that thought they had different strategic exits might have changed. And so, we haven't changed our strategy. We just think that it potentially creates more opportunity for us with companies that might not have been willing because they thought there was a high-flying IPO ahead of them that they may not believe is the case right now.\n\nAnd the market is obviously taking a much different view on profitability versus just growth.\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nPerfect. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Chuck. Next question, please.\n\nOperator\n\nThank you. Tal Liani with Bank of America Securities. You may go ahead.\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nHi, guys. I'm trying to distinguish between the growth next year, which is probably a function of better supplies and backlog, very high backlog in between the spending environment, and you started touching on it when we asked about the enterprise. So, let me maybe expand the question about the environment. When you go through your various, what you call, use of coal theaters, and you go through cloud and service providers and enterprise, etc., can you take us through your expectations for the spending environment and maybe how long it takes to close deals versus before when you look into the next few quarters? I'm trying to understand if the environment as you see it today, whether it deteriorates or not at all.\n\nOr which are the areas where we see a slowdown or not? And I have a second question, just if you can touch on security. Security was good again. It was good, actually much better, and there is improvement throughout the quarter. If you can touch on your position in security.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nGreat. Thanks, Tal. So, we -- I think Scott has touched on it that the revenue for fiscal year '23 is much more a byproduct of component availability than it necessarily is connected to demand. But I will tell you that our current models would have us exiting fiscal '23 with roughly the same backlog as we're entering FY '23.\n\nAnd so -- and then as you look at the different segments that you've described, we had small business growth in Q4. I think it was double digits on a global basis, which is a good sign that that's continuing to grow. And then when we dissect it, commercial grew 39% a year ago, so sequentially in double digits. Enterprise was up in the mid-20s last year, so sequentially growing in high double digits.\n\nThose are good signs for us. And then the pipeline growth that we've seen as we exited the quarter just says that there's still a lot out there. And so, right now, we're modeling for just the things to continue as we see them and taking into consideration as you ask me to go around the regions, I think Asia and Europe, we had conversations with our team this week and they seem to -- they continue to be reasonably optimistic as we are in the Americas. And so, it was a pretty consistent story.\n\nScott?\n\nScott Herren -- Chief Financial Officer\n\nYeah. Probably the only thing I'd add is as you look at that 4% to 6% growth that we've forecasted now for fiscal '23, it is absolutely supply constrained. So, while the supply situation we saw late in our fourth quarter that we just closed, there were some easing. Easing doesn't mean it's over.\n\nWe're going to have supply constraints throughout fiscal '23 and just a few areas. Were it not for those, we would be growing much more quickly. It's not a case of demand. We're not demand-constrained.\n\nWe were supply constrained in fiscal '23.\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nAnd when it comes to your answer about service providers and cloud, same as the answer for the enterprise, meaning you don't expect much of a change as of now in the environment?\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nNo, we don't see anything. What I would tell you about the service provider business is that because of the long lead times, we started a process of doing long-term planning with them that I've talked about before. And so, we actually have deferred bookings that don't show up anywhere right now, approaching $0.5 billion, that because they're outside of our standard shipment window when they would like to get those. So, we've got orders out quarters from now from them that are all noncancelable because of the contracts that we've done.\n\nSo, we feel good about that momentum. We think that those customers will continue to spend in all of the trends that we've talked about. And given that we just shipped our first 800-gig system to one of the web-scale players, we can continue to see them take advantage of these higher-speed platforms.\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nNow, Tal, you also asked about security.\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nYes, I did.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nSo, we saw -- I think Scott mentioned this in his -- we had some really good growth and some backlog movement, to be honest, on the firewall side. So, we had a really solid quarter on shipments from a firewall perspective. But we also had strength in our endpoint business. We had strengthened our Zero Trust business.\n\nAnd we're continuing to -- that is the No. 1 investment area for the company this year, and it is -- we're continuing to drive, I think, greater innovation there and evolve that portfolio as we've described strategically. So, I think we'll just continue to see improvement. But this quarter did get a boost from us clearing some backlog in the firewall space.\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nThanks.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Tal. Next question.\n\nOperator\n\nSamik Chatterjee with J.P. Morgan. You may go ahead.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for taking my questions, and congrats on the good execution this quarter. I guess I wanted to dive into the order numbers a bit here. And historically, you've talked about sort of SMB or commercial being a bit more of a leading indicator into enterprise trends.\n\nBut when you look at the order trends right now, it does seem like you're seeing sort of a bit more of a sort of volatility around the enterprise orders related to the commercial segment. And so, I wanted to see if there's anything that you can help us in terms of thinking about sort of the trends we're seeing there. And just a second one there is sort of collaboration, and it seems like a very tough backdrop to turn around collaboration results in. So, how should we think about sustainability of the growth here for collaboration?\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah, Samik, thank you. I'll comment on the -- the small business was again strong, as I spoke about just a moment ago. I think it's really important when you have these abnormal year-over-year comparisons for us to find other ways to assess the strength, which is why we looked at the sequential growth. And sequentially, they're both up in double digits, both commercial and enterprise, which against a very large quarter a quarter ago.\n\nAnd so, we're comfortable right now that they're moving as they should be. Candidly, for commercial to grow at all after the extreme growth that we had a year ago was actually quite positive. So, I actually view that favorably given the strength that they showed a year ago, it was probably the highest growth rate we've had in forever in that space or at least in the last 10 years. So, overall, I think we don't see any sort of significant demand shift, as I said earlier.\n\nOn the collab front, it's a little bit like the security message that I gave a few minutes ago. We had a -- we did clear a lot of device business in the backlog. So, the growth, as Scott said in his opening comments, was driven largely by the device business and offset by some declines we had in meetings and calling. But I will say that the teams are working really hard on the meetings and calling side.\n\nThose have been strong. The calling side has been strong for us in the past few quarters. The product portfolio is in really good shape. The Net Promoter Score for our meetings platform is now 64 and that was 1 million customer responses.\n\nSo, it's a huge -- it's a hugely improved experience. And this year, the teams are really focused on trying to get that back to growth. But we've got a lot of work to do.\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nYes. Thank you. Thanks for taking my questions.\n\nMarilyn Mora -- Head of Investor Relations\n\nNext question, please.\n\nOperator\n\nIttai Kidron from Oppenheimer. You may go ahead.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nThanks. A couple from me. Maybe first on the supply chain. I just want to make sure I understand your expectations for component availability.\n\nAnd maybe you could talk about price changes of components. It doesn't sound like you're assuming any changes in pricing. Is that correct? And if there will be a change in pricing, what are the odds that you actually take down the prices of your products?\n\nScott Herren -- Chief Financial Officer\n\nYes. This -- I'll start, Chuck, and if you want to jump in, let's do that. From a component availability standpoint, Ittai, that's been the most fluid area of our forecast over the last several quarters. And as we look ahead, we did see signs of stability during Q4.\n\nAnd as I said, in the late in Q4 that we just closed, we actually saw some improvement. The way that improvement showed up was availability of some of the constrained parts that we have been chasing in the broker network. And obviously, when you buy from the broker network, you pay a premium for those. And you see that reflected in the gross margins.\n\nI think there'll still be some of that in Q1. You see that reflected in our gross margin guide in Q1. And then it gets better as the year goes on, not because -- I'm not assuming any price declines or any cost declines coming from our suppliers. I think the -- I don't see them lining up to come back and say, \"Hey, good news, Scott and Chuck.\n\nWe're going to charge you less for the component parts.\" There may be some benefit in freight and logistics. We'll see as commercial airlift comes back online. I think the benefits we'll get will be much more from shipping more out of our backlog that are orders that were received after we did the price increases last year.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nSo, as I think about your fiscal year fiscal '23 guidance, what is the underlying assumption regarding volume component availability exiting fiscal '23? How much better are you expecting it to be in your guidance? What's embedded there?\n\nScott Herren -- Chief Financial Officer\n\nYes. Again, our guidance assumes that we continue to be supply constrained through the year. As I said, if we could get more supply, we would be growing more quickly in fiscal '23. So, we'll continue to be supply constrained.\n\nOur modeling shows that our backlog as we exit fiscal '23, Chuck touched on this earlier, that we think the dollar value, obviously, it's not the same orders, but the dollar value is roughly unchanged from the dollar value we roll into fiscal '23 with. So, I think we'll continue to face component availability headwinds throughout the year.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nWould you expect your order growth in fiscal '23 to exceed your 4% to 6% top-line guidance?\n\nScott Herren -- Chief Financial Officer\n\nYes. We don't forecast order growth, as you know, Ittai. So, that's not one that I want to jump into at this point. I think probably the key takeaway would be we're not demand constrained.\n\nWe're supply constrained as you look at '23.\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nOK. Thank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Ittai.\n\nScott Herren -- Chief Financial Officer\n\nThanks, Ittai.\n\nMarilyn Mora -- Head of Investor Relations\n\nNext question.\n\nOperator\n\nPaul Silverstein with Cowen. You may go ahead.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nThank you. I know my questions have been touched on previous comments and responses, Chuck. But I want to ask you anyway the big picture questions, one on revenue, one on margins. The first one, from your comments and the comments of your peers about networking, it looks like networking demand is in the best shape it's been in since the bubble of the late '90s.\n\nAnd that, of course, was a bubble. But it's -- the supply constraints, it's making it hard to discern what's going on from a competitive landscape standpoint. And I'm sure you guys are aware, I know it's come up in previous calls, but there's a sense, I think, created by your competitors, rightly or wrongly, but I want to let you respond that in campus enterprise in particular, which is still core to what you all do, that you've got competitive pressures. Any thoughts you can share on what you're seeing in your campus enterprise business, both on the wireline switching and on the wireless LAN side? You clearly talked about strength from an order perspective, but I want to let you respond.\n\nAnd then I've got a question on margins.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nOK. First of all, I think market share is a very difficult thing to assess right now, to your point, because of everything sitting in the backlog. I do believe that Q4 was the second largest Cat 9K shipment quarter in the history of the product, so that would indicate that it's strong. And I think as we continue to clear our backlog or work through it, not clear it, but as we work through our backlog, you'll see some share come out.\n\nBut I would encourage you to look at market share over a trending quarter time frame as opposed to a point in time because you just never know. We've got some products that we've been redesigning that we have backlog that we'll begin to ship in mass that will actually flip market share numbers pretty significantly. And my competitor is going to be telling you exactly what I'm telling you right now. So, it's something you just got to watch over time.\n\nAnd so, I'm not -- I mean, clearly, we have competition in the campus. We have very strong competition. We always have. But given the volume of the products that we're shipping right now, I don't feel like we're losing significant share.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nOK. And also from a good picture perspective, once upon a time, networking in general, and Cisco, in particular, was the canary in the coal mine. When there was a macro downturn, you guys were the first to see it networking was the easiest thing to push off, everyone let their networks run hotter, where the enterprise carriers, etc., that seems to flip where networking is actually not seeing weakness that other technology product markets are seeing. I just want to make sure that I've got that concept right.\n\nAnd the real question though on the margin side, you all were at record or near record gross and operating margin levels going into the pandemic before input costs, ICE, semis freight, logistics, etc., spikes. Any thoughts on where you can get -- where the long-term model can get back to once supply chain normalizes? I assume that freight and logistics mix and pricing will go back to pre-pandemic levels. It will help you and others out. But I also assume that the increase in semi ICE input costs are not going back to where they were, you'll be able to offset some but probably not all of that with your price increases.\n\nLet me let you respond.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah. So, let me take the networking -- the resilience of the networking market first. And then, Scott, you take the margin question. So, Paul, the -- I think you're right.\n\nAnd I've said this repeatedly. I think what's driven this is there are two things. Number one, the pandemic revealed the impact of not keeping your core infrastructure technology up to speed. Customers struggled, and I think it made them realize that they had a lot of tech debt that needed to be dealt with.\n\nAnd they don't want to get in that position again. So, that's the first thing. But the second thing is all of these mega trends that I mentioned in my opening comments, I mean, these customers are rearchitecting their entire infrastructure for the first time in years to deal with hybrid cloud and to deal with all of the mobile workers. We see IoT exploding.\n\nYou see all of the climate activity is going to be a tailwind to our business because you have to connect all these industrial systems to be able to control them. You've got to shift to 400-gig. I mean, let me just give -- I'll give you a data point. 400-gig ports were up almost 700% year over year for us.\n\nWe've got over 1,000 customers now that have bought 400-gig, and we shipped our first 800-gig. So, it's just all these trends continue, you got 5G, you've got WiFi 6. You've got this application observability, the rearchitecture of applications. So, I think it's a combination of the realization the pandemic brought on around technology debt and never letting them get to that point, and then these mega trends that are going on.\n\nAnd Scott, do you want to take the gross margin question?\n\nScott Herren -- Chief Financial Officer\n\nYeah. I think, Paul, on the gross margin question, I think you nailed the trends. I don't expect input costs, particularly around semis, to come down. I look forward to the day that I come to the office and there's a message from our semiconductor suppliers saying, \"Hey, good news.\n\nYour price is going down.\" I just don't see that happening. Price will offset part of it. I think you got that part right, too. I think the other -- the only thing I would add that probably in your thinking, but you didn't say it, so I will.\n\nOver the longer term, as we mix more software in, that will be a tailwind at the gross margin line. So, just add that to your thinking, and I think you've got it nailed.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nScott, can you go back to that record level?\n\nScott Herren -- Chief Financial Officer\n\nI don't want to get into forecasting the longer term at that level of granularity right now, Paul.\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nI appreciate it. Thanks, guys.\n\nScott Herren -- Chief Financial Officer\n\nOK.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Paul. Next question.\n\nOperator\n\nBen Bollin with Cleveland Research. You may go ahead.\n\nBen Bollin -- Cleveland Research Company -- Analyst\n\nGood afternoon, everyone. Thanks for taking the question. The first one, you talked about backlog expected to sustain at current levels exiting fiscal '23. I think you said software backlog was north of $2 billion again in the quarter, but what was the product backlog? Where did that finish the quarter?\n\nScott Herren -- Chief Financial Officer\n\nYeah. We didn't give that stat and that's not one that I want to start giving every quarter. Ben, what we did say qualitatively is it grew again. And what I'll tell you is it was up actually up triple digits again on a year-on-year basis.\n\nThe overall backlog. Software backlog is a pretty significant headwind to our software growth it's well north of the $2 billion that we talked about.\n\nBen Bollin -- Cleveland Research Company -- Analyst\n\nOK. And then one other item. I'm not asking for a forecast on RPO. I guess that's a precursor to sort of asking for one.\n\nBut when you think about RPO in the concept of the broader 4% to 6% rev guide for the year, is the assumption as you shift more to software that RPO should consistently outperform your top-line growth? How do you think about the relationship for those two metrics longer term?\n\nScott Herren -- Chief Financial Officer\n\nYeah. There's a couple of dynamics going on in RPO. So, I'd say, in general, you're right, obviously, duration has an effect on RPO as well, but it varies a bit by product line. So, for the quarter, we just announced the 6% product RPO growth.\n\nWe had double-digit product RPO growth in secure Agile Networks, in optimized app experiences, and in security, I almost forgot. And we had high single-digit growth in Internet for the future. I'd say that the headwind there, of course, is collab from an RPO standpoint. So, longer term, I think you'd expect those dynamics to continue.\n\nAnd as we turn around the go-to-market and the sales side of collab, that will flip from being a headwind to more of a tailwind on product RPO growth.\n\nBen Bollin -- Cleveland Research Company -- Analyst\n\nThanks, Scott.\n\nMarilyn Mora -- Head of Investor Relations\n\nOK. We have time for one more question.\n\nOperator\n\nSimon Leopold from Raymond James. You may go ahead, sir.\n\nSimon Leopold -- Raymond James -- Analyst\n\nThanks for taking the question. I've got one sort of short-term and one longer-term. On the short-term side, we heard some anecdotes that some multi-product projects have been split up because of the supply chain constraints. And I want to get a sense of whether or not that's something that's happening as a way for you to work around some of the bottlenecks and to get some projects out the door that might not have and how that might factor into the numbers.\n\nAnd in terms of the longer term, Todd Nightingale had made a comment in a meeting about Cisco no longer managing to the org chart. And I wanted to see if maybe, Chuck, you can elaborate on what the implications are by that particular statement. Thank you.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nWell, Simon, if I could ask you to clarify for me is on the short-term question, I didn't quite understand. You're saying that we are breaking up orders or we're asking customers -- or customers are making that decision? What exactly was the question?\n\nSimon Leopold -- Raymond James -- Analyst\n\nYeah. So, I'm not 100% sure, but I think it's customers asking to break apart some larger projects where they're buying a multitude of components from Cisco and essentially saying, \"Let's not wait for the components you can't get. Ship me what you can. I'll get the other stuff elsewhere.\" I've heard these as anecdotes, and I'm trying to understand how substantive it is.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nYeah. I have not heard any discussion on that particular topic, but it wouldn't surprise me. I mean, if I was a customer and if I had a project that I could actually drive some constructive ROI by doing part of it, then I would split it up to try to get the part that I could get, for sure. I'll tell you what we are seeing, we are -- we have customers are being really good with us about telling us what they desperately need and what they're OK waiting for.\n\nThey've been really great about saying, look, I'm not going to come tell you this guy is falling, and tell you, I need everything in backlog tomorrow. But here's what I really need, here's what I need this time, here's what I need this time. And so, we've been working through that a lot with customers, and that may be a variation of what you've heard. So, that's the only thing that I can think of.\n\nOn the Todd comment on the org chart, I think the comment is we don't want to ship our org chart. And we talked at Cisco Live about a huge number of cross-business unit technology combinations that we were delivering. I'll give you a couple of examples, but this is what he's talking about. Like our Secure Connect+ that we started shipping includes SD-WAN technology from the enterprise networking team and cloud security from the security team, brought together in a managed-as-a-service offer for customers.\n\nThere's integration going on between AppDynamics and Thousand Eyes that actually will be bidirectional intelligence. It will flow between those two. You've got AppDynamics doing the same thing with Talos and other aspects of the security portfolio for that exact reason. You've got -- before Jonathan took on all of the portfolio that Todd had and his own, there was a lot of work Todd was doing with Jonathan's team around private 5G and how do we build private 5G services through a combination of those.\n\nSo, that's what Todd is talking about, and I think the teams have done a good job of really leading with what the customer needs and not building from the way the org chart is built. And that's what he's talking about.\n\nSimon Leopold -- Raymond James -- Analyst\n\nGreat. Thanks for that clarification.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nOK.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Simon.\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nGood. All right. Well, thank you all. Before we wrap, I want to make a few closing comments.\n\nI just first want to say, I'm really proud of what our teams have achieved. It's obviously a very dynamic environment, and the teams have really shown great execution and great focus. We did have tough compares, and so we worked really hard to try to give you a different way of looking at the demand, and we'll just -- we'll let you know if we see anything change when we come back together in the next call. But right now, demand remains solid.\n\nI think customers really do understand the value that technology brings to their strategy. I also appreciate what our supply chain teams have achieved, and we're encouraged by what we're seeing and how that supply hopefully will continue to ease throughout the year. The business model transition is really helping us give you more visibility and predictability. And I'm also proud of how our team has rallied around our purpose.\n\nJust a couple of comments. This year, we set another a record high number of employees who were given back into their communities. Our Net Zero by '24 target and near-term targets were just approved by the science-based targets initiative under its Net Zero standard. So, we're not only committed to our own goals but also building technology that helps our customers meet their own goals.\n\nLastly, we've been named the No. 1 Great Place to Work in 20 countries around the world. And on any day, I will be proud of that, but this is super important right now given the competition for talent around the world, and it really does make a difference when we're trying to hire new talent into the organization. It really makes us more resilient than ever, and I think we're well positioned for long-term growth, and I want to thank all of you for spending time with us today.\n\nThank you.\n\nMarilyn Mora -- Head of Investor Relations\n\nThanks, Chuck. So, I'll go ahead and close out the call. Cisco's next quarterly earnings call, which will reflect our fiscal year 2023 first quarter results, will be on Wednesday, November 16, 2022, at 1:30 p.m. Pacific Time, 4:30 p.m.\n\nEastern Time. This concludes today's call. If you have any further questions, feel free to contact the Cisco Investor Relations group, and we thank you very much for joining today's call.\n\nOperator\n\nThank you for participating on today's conference call. If you would like to listen to the call in its entirety, you may call 866-517-3736. For participants dialing from outside the U.S., please dial 203-369 2047. [Operator signoff]\n\nDuration: 0 minutes\n\nMarilyn Mora -- Head of Investor Relations\n\nChuck Robbins -- Chairman and Chief Executive Officer\n\nScott Herren -- Chief Financial Officer\n\nSami Badri -- Credit Suisse -- Analyst\n\nTim Long -- Barclays -- Analyst\n\nRod Hall -- Goldman Sachs -- Analyst\n\nAmit Daryanani -- Evercore ISI -- Analyst\n\nMeta Marshall -- Morgan Stanley -- Analyst\n\nTal Liani -- Bank of America Merrill Lynch -- Analyst\n\nSamik Chatterjee -- JPMorgan Chase and Company -- Analyst\n\nIttai Kidron -- Oppenheimer and Company -- Analyst\n\nPaul Silverstein -- Cowen and Company -- Analyst\n\nBen Bollin -- Cleveland Research Company -- Analyst\n\nSimon Leopold -- Raymond James -- Analyst\n\nMore CSCO analysis\n\nAll earnings call transcripts"
}