{
  "companyName": "Itaú Unibanco Holding",
  "companyTicker": "ITUB",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/itau-unibanco-holding-itub-q2-2022-earnings-call-t/",
  "content": "Itaú Unibanco Holding (ITUB -0.14%)\nQ2 2022 Earnings Call\nAug 09, 2022, 9:00 a.m. ET\n\nRenato Jacob\n\nGood morning, everyone. I'm Renato Lulia, the IR Officer for Itau Unibanco. Thank you for taking part in our video conference to talk about the earnings for 2Q '22. This event is being held here from our studio headquarters in Faria Lima Avenue.\n\nSo I'd like to give you some instructions so you can join the event. For those who are on the website, you have three options to hear. All content in Portuguese, all content in English, or in original audience. For the first option, two options, we have simultaneous translation.\n\nSo click on the flag on the top left-hand corner of your screen, you can also submit your questions by WhatsApp. Just click on the icon on your screen if you're watching on the website, or send a message to the phone number 5511-9452-9674. So the information is also available for download on the hot side screen and on IR website. So now I'm going to hand over to Milton, who will give his presentation and I'll be back to moderate the Q&A session, Milton over to you.\n\nMilton Maluhy Filho -- President\n\nGood morning, everyone. Welcome once again to our video conference for the earnings of 2Q '22. I'll give you information during some slides and then we'll go into our traditional chat during the Q&A with our investors. Thank you.\n\nSo to begin, we have disclosed the results of BRL 7.7 billion. That's the recurring managerial result increase of 4.3% quarter over quarter. We have consolidated ROE 28.8 but in Brazil, we're considering 21.6 which is strong return. In the credit portfolio, I'd like to highlight BRL 1,084 billion, a growth of 5% and consolidated 5.5% in Brazil, I'll give you more flavor to that briefly.\n\nThe annualized average margin achieved 8.4%, a growth of 0.5 percentage points in the quarter and 9.2% in Brazil growth of 0.3 percentage points. Our NPL considering over 90 days, 2.7 consolidated a growth of 0.1 percentage points and in Brazil 3% as well with a growth of 0.1 percentage points. And important figures, our efficiency index in the consolidated was 40.8%. In Brazil another quarter where we've achieved the best index of the series 38.7%.\n\nThese are just some of the highlights, I'll give you more flavor about that in the next slides. About the credit portfolio for individuals, we have a growth of 7.2% mainly driven by credit cards that has an effect of consumption, actual increase in demand. And that's really driven the revenues for credit cards, which naturally impacts the portfolio. Personal credit growing 6.8%.\n\nThe highlight in this case, in personal credit portfolio, we have consumer credit, overdraft and the composition but as it grows, the overdraft 8% growth and consumer credit 7.3%. So the main element that I'd like to highlight is that 80% of this growth in the quarter came from the Personnalite Uniclass segments. I'd like to remind you that we went through a trough in those portfolios and we've been recovering. Payroll loans had an increase of five percentage points in the quarter, a strong effect in that quarter, and it should continue to grow in the next quarters, but at a different rate.\n\nI'd like to call your attention to large companies, a growth of 4.1%. In Brazil, the portfolio grew 5.5% in the quarter, 25% year over year. When we consider Latin America it's a portfolio that grew 3.2%. But if we take away the exchange rate variation, we grew 4.5% here and payroll loans we were strong in for public agencies.\n\nYou might remember that I've been saying that in that business in payroll on where we have the smallest share, we repositioned ourselves. We've been giving more emphasis on that. And that's why we've been going into more payroll loans with the public agency, a growth of 12% in the quarter and 90% year over year. The growth of very small, small and medium-sized companies we have 9.4% in the quarter, 72% of the origination in the quarter were companies with higher revenues.\n\nSo the profile where we've been growing the portfolio are the companies that have higher revenues in that segment, very small and SMEs. We announced an objective to the market to achieve 2025 with BRL 400 billion structuring the capitals market originating credit for industries that have a positive impact in ESG. We've already achieved 76% of our targets, so over 224 billion operations that were structured and we will comply or meet our objective by 2025. We had a strong quarter in financial margin with customers as you can see.\n\nSo in the top line, BRL 1.9 billion, 9.7%, quarter over quarter, that's very strong. But in the core business where we have volume spreads, Latin American operations and others and funding we grew BRL 1.6 billion, a growth of 8.8%. That's mainly driven by the average volume as you can see, but impacting all lines of the product lines, or product mix more consecutive days in the quarter and spreads with the liabilities lines, with the increase of interest rates and Latin American and others has other items that are in that line. Our working capital which is allocated into financial margin with customers because it's the capital used with for the credit portfolios with customers.\n\nYou can see that it grew BRL 400 million therefore solid growth. As I mentioned before medium annualized margin achieved 4.8% and the consolidated in Brazil, we achieved 9.2% with the growth that I already mentioned. Margin with the market. The news is good given the scenario.\n\nSince the beginning of the year when we gave you our guidance, we said it would be one of the hardest years in this case because of the volatility. The scenario oversees, the interest rates but still we have good results as you can see BRL 600 million and overall, we have the cost of hedging of the capital ratio that spin approximately BRL 500 million per quarter, the guidance that would be approximately BRL 2 billion. So that means that the marginal loan was BRL 1.1 billion in the quarter and that's a good result given the challenges, obviously at lower levels, but still closer to what we were seeing in the series. Last year, we had some exceptional quarters in the market margin.\n\nServices and insurance, I'd like to call your attention to credit and debit card growing 6.6% very strong. Here we can see an effect in issuing more revenues but also in the acquirers not only more volume, but also more share in financial products. Here in managing [Inaudible] or funds, we had an exceptional quarter, not only in regular use but also the performance of our funds. We've found a great opportunity in the [technical difficulty] like to call your attention on this slide is insurance.\n\nAnd its results we achieved 1.8 billion margin. But I'd like to call your attention to that. On these lines we have some entries, we have core insurance operations. We also have the actuarial result that we have of a mismatch between assets and liability and inflation aspects.\n\nWe also have the results adding on the results of Porto Seguro. So we've grown expressively insurance and we have consecutive quarters with great growth. As we can see here, gain premium increased 23.6% in the quarter, and when we see the managerial recurring result, you have an increase of 88.7% different rate, different level, great expectations for the insurance operations. Credit cards as I mentioned before growth of 33.1% when you see the flow year over year, and in acquiring 22.1%.\n\nHere, I'd like to highlight the acquisition of avenues. Still not full control, but structured to acquire control as time goes by. And that will increase our investment ecosystem offering a new value proposition for our customers who want to invest in the international market. Credit quality.\n\nHere we have some good news. So 15.90 are stable as you can see, in Brazil, Latin America, and the consolidated view in Brazil. Here individuals less than corporates, they're very well behaved. And that's good news given the scenarios and challenges that we've been facing.\n\nAnd the longer tail we have a slight growth of 0.1, not only in Brazil, but also in Latin America. And when we look at portfolios, you can see a small growth in individuals, as I've been talking about since 3Q '21. And on the other hand, when you look at SMEs, you see a small drop of 0.1 and 0.4 in small, very small companies. So they're well behaved in this case, we have some challenges moving forward, but we've been able to perform well, despite the challenges.\n\nWhen I look at the relative indicators, there's two information that's very important. So everything that we've seen in the previous slide aren't affected by portfolio sales, we haven't sold any in the quarter. And that's very important information. Because obviously, when you sell an active portfolio that impacts those indicators.\n\nIn credit, we didn't have a relevant increment in negotiations, and that's another lever that makes the delayed indicators at lower levels. So here we have a small growth 3.2% of the portfolio, as we call it, a renegotiated portfolio. And that's great news growth of just 2%. But solid coverage 195% of coverage on the past -- 90 day past.\n\nCost of credit was 2.8% on the portfolio, still lower than what we saw before the pandemic achieving BRL 7.5 billion. And I'm not sure grow with much more portfolio so in the relative indicators, it's very important to have that relative measure. When we go to a flexible-sized portfolio good news, we achieved BRL 24.1 billion that's portfolio been dropping across time. We were amortizing BRL 4 billion BRL 5 billion per quarter.\n\nSpeed is still good, we'll continue to dispose that portfolio. And the good news is that 65% of that portfolio has an actual guarantee and that's great. And we have coverage of 267% of the past year over 90 and this portfolio is performing well without any renegotiation. So it's the normal flow and how it's been behaving.\n\nThe coverage ratio, we had a small drop in Brazil and retail but I'd like to remind you that from 2015 to 2019 the coverage was 167% in retail portfolio, we're at 195 even higher than what we have done before and we provision the 70% of the NPL creation. So the balance sheets well protected and provision for. Non-interest expenses. So in the quarter 6% growth in the quarter, 5.6% and when we see the inflationary pressure measured by salary increases, IPCA and IGPM, we see a solid delivery in terms of costs and efficiency bringing the bank costs to an adequate level solid efficiency levels.\n\nAs I mentioned before, we've reached the lowest level 38.7% in Brazil, 40.8% consolidated with a declining path, and that's great news, but still investing in the bank's core business. So our cost agenda is about tactic strategy in long term. So when you look at the core loan, we're growing 0.9% in the quarter, if you consider 1Q '21 compared to 1Q '22. But we've had one over 1 billion going through the expenses line, and all the expenses are in this line, we don't have any others.\n\nSo they're all in these lines in the balance sheet. That's how we've been able to perform. That shows our discipline, our focus and how we are concerned about the future. Capital, good news as well.\n\nWe have stable capital index here. We started from 11.1% to 12.1%. So we have achieved 12.6%. And net income 0.5% adjustment, and the risk-weighted items, 0.3%.\n\nHere we have the purchase of a share, our share in XP and the exchange rate has an significant change deviation from the first quarter to the second and our hedging has been very efficient. There's the cost that already mentioned in the market margin. But when you take a look at this, we are not sensitive to the exchange rate, which was not what happened in the past. So we've been hedging that index.\n\nLastly, I'd like to call your attention to our guidance. So what's the story that we're telling, it's the best expectations that management has about what we see in terms of challenges, and the earnings we expect during the year. So whenever we have new information, we always want to be proactive and adjust the guidance. We deemed it was important to adjust to four lines of the guidance.\n\nAnd I'll explain them now. We changed the guidance for the credit portfolio. We expect to grow from 9% to 12%. And we're reviewing that to 15.5% to 17.5%.\n\nIn Brazil, we expected growth of 11.5% to 14.5% and now we're considering 19% to 21%. The financial margin with customers from 20.5% to 23.5% now with 25% to 27%. In Brazil in consolidated 22% to 25%. We're viewing that to 26.5% to 28.5%.\n\nIn cost of credit. Portfolio growing, top line growing therefore, we need to adjust the cost of credit. And the relative performance of the net financial margin has been very positive. So when we go from 20% to 29%, we go from 20% to 31% in consolidated, Brazil, 23% to 27%, to 26% to 29%.\n\nAnd lastly, grow portfolio, two more business and being closer to our customers that leads to more cross-selling. So we deemed it was important to review the line of revenues from services and insurance, the performance was better than we imagined from 3.5% to 6.5% in the consolidated to 7% and 9% and in Brazil from 4% to 7% to 7.5% to 9.5%. In the other lines, not all only the financial margin with the market and the non-interest expenses and the tax rates are maintained. That's what I wanted to share with you.\n\nSo I'd like to invite you and say that on September 1, we'll have our Itau Day. We started this last year and the theme as should be every year it's all about our customers. So we want to give you more elements about what we've been doing, our strategy, telling you about the results. So for us, these events can show what we have built.\n\nWe want to show what we talked about last year, what we've been doing, how we've been delivering what we said, what we think about the future and how we imagined to execute the future. It's not just about telling the story, but you also have to execute and we've been very good at doing that. 67% of our clients are engaged and they are engaged with our portfolio, 2.1 million new engaged clients customers. The growth of engaged customers has been more than our already customers.\n\nEngaged clients are much more satisfied and faithful -- so thank you very much. I hope too, that you guys can help me with this. I want you to be there on Itau Day and we'll have all sorts of interesting information for you then. So that's the invitation for you.\n\nQuestions and answers, popping over to Renato, and I'll be back shortly. Thank you so much, and see you soon.\n\nRenato Jacob\n\nNow we're going to start the question-and-answer session. You can send your question via WhatsApp at? There are some questions coming in already. Thiago from UBS.\n\nThiago Batista -- Director, Investor Relations\n\nGood morning, and congratulations on these results they were wonderful. The question about the portfolio quality you told is performing better when we look at the quality indicators. And we see that its portfolio is growing strongly, especially this quarter. Can you talk a little about expectations about NPLs or the cycle you expect? And if future growth and guidance is going to continue with Personnalite or what type of customer are you focusing on?\n\nMilton Maluhy Filho -- President\n\nThank you so much. Thanks for this question, Thiago. Just to give you a bit of background on credit quality or loan qualities, you could see that our overdue indicators are quite consistent. There's always -- we didn't sell any active portfolios.\n\nWe've been very disciplined in managing and renegotiation. You can see actually the numbers for these renegotiated portfolios that was just BRL 600 million. And the index, the ratio has dropped from 3.3% to 3.2%. So you can see the numbers aren't quite strong.\n\nLooking at portfolios, we have to make a few comments, it's quite important to look at this. First, we have made some significant adjustments in production. We've been doing this since the third or fourth quarter last year, when we noticed that were some variations. And we acted quickly.\n\nIn response, I think actually two portfolios required some adjustments. The first was credit cards. So we saw that there were some necessary adjustments made. We cut production by 50% just to give you an idea.\n\nAnd there were also some cuts in vehicle production. We found that there were some variations there especially with ratings. So that was important to and we've been very active proactive, and we made some very important adjustments. We talked about GDP, but for credit, we have to look at nominal.\n\nWe started the year off with higher inflation rates. So GDP nominal were much higher this has affected our portfolio growth in general. When we look at retail a few things, the first credit card that was most affected by inflation and consumption increase. So consumption, consumption was obviously a high impact and inflation obviously important.\n\nSo BRL 120 million, and this BRL 1 billion is credit cards without interest rates. So that's a very significant amount. The rest is can be paid in installments, paid installments without investments. And so there was a lot of growth in that area over the quarter.\n\nWhen we see payroll loans that also grew, we had new client new customers in that area it was a much more active portfolio. And also the public sector grew. That was actually a gap that we had before we recognize before. So we are now working with the miniaturized state payroll.\n\nSo we have a much larger segment working with the public sector now. So this has been very exciting, very positive numbers. We feel very comfortable and we've had a lot of growth focused on higher income Uniclass Personnalite, specifically because of their ability to pay the inflationary effect is quite high. But because of the Central Bank, we're getting a message that we need to be cautious.\n\nWe have been very active but very cautious. We're looking every time we're any other delays, any overdue payments, we act very quickly. We use all of our leverages. And when we look at everything, I think we need to be cautious.\n\nThere are macro risks not just in Brazil, but in the world. There are intrinsic risks, higher inflation, higher interest rates and some portfolios. We've seen lower demand, including real estate, and there been some adjustments in production as well to avoid problems. So some that are credit cards are doing well others are orange.\n\nBut when we look from 2021, we see a slight drop, there was high amortization of clean, including in personal loans checks, overdraft, but we made some adjustments, we've been able to recover that we've been able to recover our market share with -- the annual FX year on year these are very important. So we have to look at and normalize quarter compared to a more depressed quarter. Moving forward, we've got an active management, we're going to be very cautious we're well positioned. And we're that's going to be our approach moving forward.\n\nThiago Batista -- Director, Investor Relations\n\nThank you so much.\n\nRenato Jacob\n\nNext question from Flavio Yoshida from Merrill Lynch.\n\nFlavio Yoshida -- Member of the Executive Committee\n\nGood morning, congratulations on the results very strong results good job. That's my question actually it's a follow-up question. Your individual portfolio with Personnalite and Uniclass has been growing significantly. So this is individual customers and these are the lower-risk customers, right? So that's OK.\n\nBut if a high-income customer is taking out a loan, the situation in terms of default is not as good or in terms of delinquency is not as good. So I'd like to actually know how you feel about this dynamic.\n\nMilton Maluhy Filho -- President\n\nThank you so much for this question, Flavio. Our outlook is one of caution. And we have to look at portfolio performance overall. If we break it down by segment, not just individuals, but Personnalite versus Uniclass, things have gone quite well.\n\nBut in 2020, 2021, there was a very drastic shift. And these customers amortized our debt, they stopped spending as much they ended up amortizing. And we also lost a bit of our fair share in that time. Now we're recovering our fair share.\n\nWe're starting to penetrate and customers have been with the bank for over two years now. So they're well-known customers as well as customers who had lower debt rates because of the amortization. And they're now recovering and returning to some of the lines. So Uniclass is a segment our customers who make more than BRL 4000 per month.\n\nSo they're a little more upscale. So this, again, we're talking about individuals who make more than BRL 4000 per month. So this is no, this is no way to say, oh, the situation is worsening. We're monitoring it.\n\nWe actually don't see any severe alterations in terms of customer behavior with very similar to what we saw prior to the pandemic. But overdraft and credit cards are something we have to pay attention. Now if you look at the volumes were quite online with where we were pre-pandemic.\n\nRenato Jacob\n\nNext question Raphael [Inaudible] from Citibank. Good morning, you're on mute.\n\nUnknown speaker\n\nThank you very much, and good morning. Milton, you said that last year it was a lot more critical in this journey. Now we're coming back to normal. So this is very clear in your NIM, I think was 10 prior to 2020.\n\nWe're now at 8.4-ish percent. So we're expecting you expected to do around 10% or do you see some sort of mix with income? The other question is default or delinquency, even though NPL I don't know was much more significant in the past. And as the mix changes, this may increase. So the first question is, is that 10% is credible or not and for NPL creation, we do expect us to follow the same trends?\n\nMilton Maluhy Filho -- President\n\nGreat. Thank you for the question. When we look at NIM in the past, we have to look at how the mix was in the past, they were a lot cleaner than they were in terms of -- we had a higher retail than we had wholesale and the mix. Now, it's more guaranteed than it is before, which clearly affects our NIM.\n\nAnd wholesale has grown significantly. So there's more wholesale to retail in this period. So this naturally is going to impact us. The second big thing you mentioned is that there was a cap of overdraft for retail I think it was 8% before.\n\nSo this is very important in terms of our returns and our numbers. Interest rate has helped us with the liabilities margin, and this affects the entire portfolio. So this is a much more negative impact and on the NIM. Other portfolios, including payroll loans, you've got more caps, so the interest rate has increased funding has increased in these caps.\n\nSo this is also affected pushed against the margin. I don't expect this to go back down to the 10% NIM because of what I just mentioned. We do expect this to expand slightly, but just because I said there is the working capital effect which has been positive again, those BRL 400 million with the effect that I mentioned earlier. When I look at this performance, I think our levels are quite good, quite stable for at least the next two quarters.\n\nWhen we look at the portfolio mix, the overdue rates are OK. But again, we work with expected losses and not actual losses. So there's a certain effect from 2021 from 2022. But since we're working with expected loss, we look at the lifetime loss or lifetime overdue loans for that client.\n\nSo we look at growth of our portfolio like we've seen. This naturally affects our balance sheet, so we've really seen this dynamic play out. When we look at coverage or losses are covered in this quarter, specifically this quarter. We have a complimentary inclusion, which means is that we really haven't significantly touched upon this.\n\nAnd this was established to be consumed over time. So our coverage rates are adequate. With retail we've got about 18% coverage that's just retail. Last year we were at 167 when we're looking at 15% to 19%.\n\nSo I think it's very good. With NPL creation, you talked about NPL creation. We include 100% so it's already provided for vis-a-vis credit costs. And we expect it to be around 105% moving forward.\n\nSo we do expect to normalize these overdue loans over time. We expect this to happen over the third and fourth quarter. Our best expectations, is that they will start to reach those pre-pandemic levels. That's what we do expect in the next few quarters again, that's another positive effect.\n\nAgain, we have to be very, very cautious. We know that we've got solid growth ahead. And we were very proactive. And I do expect to cover this coverage over time and I expect that we'll reach levels that we saw pre-pandemic so we'll be able to reach those levels will normalize those levels shortly.\n\nUnknown speaker\n\nThank you so much.\n\nMilton Maluhy Filho -- President\n\nThank you, Raphael.\n\nRenato Jacob\n\nWe'll start [Inaudible] of Gustavo from [Inaudible].\n\nUnknown speaker\n\nThank you so much for this opportunity. I want to talk about credit cards. You talked about transactions we know that credit cards have been used increasingly more for payments, bills. So the credit card has been growing in Brazil, but we look at loans actual loans or payments in installments, we see changes in turnover went from 6% to about 10% now.\n\nSo one-time payment upfront payments, has jumped to 80%, 81% their EBITDA dropped 31%. When we look at credit cards and we look at all sorts of indicators? We see that Brazilians have been using their credit cards more, but when you look at the breakdown of how they use those credit cards I think there's higher amortization. What do we expect in terms of turnover and for NPL for individuals when you break it down? I know we have break it down, we break down by individuals versus company. But if you could perhaps break down even a little bit more, you talk about the use of credit, the use of loans, the use of installment payments for credit cards, you could talk a little bit about that.\n\nI'd appreciate it.\n\nMilton Maluhy Filho -- President\n\nThank you so much, Gustavo, I thank you for that question. When we look further down the road, transactional credit card portfolios were quite high in 2020, 2021, there was a lower revenue because spending, because spending was lower and amortization was higher. This meant a very significant decrease in the portfolio. When we look at the profitability for retail, you see a very significant drop in the ability to take out loans, get credits or use credit cards.\n\nWe don't think that this was sustainable over the long term. So what we've seen now is an, increase in prevention much higher than what we saw prior to the pandemic consumption is increasing, expenses are up there is the inflationary effect. So again, higher bills, higher payment, higher bills, lower payments. When we look at the entire portfolio BRL 126 billion 80% is non-interest, 20% interest, 10% is rotational and the rest is in installments.\n\nRegulatory has changed -- you can no longer have it paid. You have to -- payments are to incur interest after 30 days. So this is a dynamic that we started to see last year, this is nothing atypical. And again, our levels were quite low before.\n\nSo what we're trying to do is bring this up to normal levels. But this portfolio is a very important very big portfolio, you can see retail, it's about a third of our credit card portfolio. And this is a port, multichannel distribution portfolio. We've got bank, this is a very strong channel performance has been wonderful.\n\nAnd we have a great relationship with the individuals and retail store owners. This has been a little more difficult channel because loans are higher. But you also have the advantage of working with the agencies of these stores and they're helping to charge and get the payments back. So they've been working with the proposal.\n\nThey've been able to react to this portfolio. So we've been able to and obviously we've seen volatility in the larger portfolios. So we had a significant worsening in those portfolios. So what we see in delinquency individuals basically comes from credit cards or from cards so the other lines are well behaved the other credit the other products are well behaved so to speak.\n\nBut when you have like open in water and less of a connection to the bank and more than one product, that's where we see deviations that were we saw that in cards. And we saw that in auto, as well, the two portfolios that suffered a little more, but they pretty much explain that in individuals, we don't break that down per product. But just to give you an idea. So looking forward, we've seen the change in the portfolio in production we're still managing actively managing the portfolio.\n\nAnd it's a scenario that does require caution. And we have good models of provisioning. When we see worsening, and delinquency or macro scenario, we have provisions balance sheet as well protected. But without a doubt that portfolio does suffer a little more in the mid and long term.\n\nIt should become more stable, and the yield of the business should get better.\n\nUnknown speaker\n\nThank you, Milton.\n\nMilton Maluhy Filho -- President\n\nThank you, Gustavo.\n\nRenato Jacob\n\nWe have with us Tito Labarta from Goldman Sachs.\n\nMilton Maluhy Filho -- President\n\nHello, Tito, thanks for joining us today.\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nHi. Good morning, Renato and Milton. Thanks for the call and taking my questions. If I could follow up a little bit more on the financial margin you know both -- first and the financial margin with client's right that you I think benefited from two aspects with higher interest rates.\n\nAnd the shift in loan mix rates potentially close to peaking maybe another small increase, but probably close to the peak maybe started to come down next year fell posting a little bit. How that could potentially impact their financial margin with clients can that still go up because of mix or and how dependent is on the movement in rates? And then the other part of that is on the market NII right that's been fairly weak, I think because of the higher rates if rates begin to stabilize how do you see that market NII can evolve from here? Thank you.\n\nMilton Maluhy Filho -- President\n\nYes. Sure. Tito, thank you very much for the question. While talking about the financial margin with clients I was saying in a previous question that we believe that we should stabilize this 8.4 around these in the next two quarters, we may see 10, 15 basis points in the coming quarter.\n\nSo we believe of course, we do have the impact of the interest rate as we can see in the chart above. But in the other hand, as you can see, the most relevant impact comes from the core business of the bank. So you can see the volumes very strong, you have impact in the spreads, but much more on the interest rate on the liability side on investment from our clients. And we don't see in the short-term movement in the interest rates, you're right, we believe we are very close to the peak 13.75% we may have 25 basis points is not our base case.\n\nBut we believe and will depend in many issues, especially the fiscal discussions that we should have by the coming year. So to understand where should, the interest rate start to reduce whenever it happens, of course, we may see an impact the same way around, as we are seeing here. And the same way when we saw that huge reduction, massive reduction on the interest rate in the previous quarter. So it's difficult to say now when, should it be stabilized by this year, I still believe that around 8.4%, 8.5% on a consolidated basis sounds reasonable.\n\nLet's see for next year, what level of interest rate won't be our mix, our capability of growing in some specific portfolio so this is the way we are approaching that. Talking on the financial margin with the market, the most important thing is that our guidance had embedded an estimation of not very relevant profitability and financial margin with the market for a few reasons. First of all, as you know, we still have the overhead strategy for the coming years the past years. They were very relevant just to give you a number.\n\nLast year, we had around BRL 800 million, especially on this strategy. We don't have this anymore. We didn't have the cost of the hedge, the capital index. We implemented the hedge policy by the year end.\n\nSo we've been investing or expanding around BRL 500 million per quarter, as you can see in the chart. But we had, of course with the opening and the interest rates, widening the way we are seeing and all the macroeconomic challenges that we see Fed raising interest rates, Europe and all the impacts that this has been having in Brazil. We expected to have lower financial margin with the market as the guidance was posted. I think we did decent quarter, as you see, excluding the BRL 500 million that we had for the cost of the capital index.\n\nWe posted BRL 1.1 billion in financial market margin with the market, which is relevant. If you go back to other quarters, you will see that it's not so very below that. But I think we posted a decent quarter. My view is that we're going to have challenges for the next two, especially due to the interest rate effect.\n\nBut we have a lot of results coming from trading, trading this quarter was not so good as it was in the first quarter. We have the market, financial market margin in the treasuries abroad in Latin America they are doing a good job as well. In Chile, we had a very good profitability in treasury. So it's difficult to project, but I think we are doing fine due to the scenario we are facing now.\n\nRenato Jacob\n\nThanks, Tito. Thanks, Milton. Next question came from WhatsApp from Natalia Corfield from J.P. Morgan.\n\nI'll read it to you. It's about Itau Unibanco bonds. And considering the close to 6.6 to 81, the perpetual if executed would not be economic considering the market scenario. So how do you see the possibility of calling if it's not feasible?\n\nMilton Maluhy Filho -- President\n\nNatalia, that's a really important question. We've been talking a lot about that we've had a lot of market demand. So the vision is, in fact, that call comes through at the end of the year, and another one at the beginning of next year, two very relevant operations almost USD 3 million in the total issuance. We believe that when we do a simple update of the reset for the coupon of those bonds with the new issuance, we're talking about a difference of over 250 bps.\n\nAnd that's very material. So first of all, there's a fiduciary duty and economic duties. So calling paying over 250 basis points and the new call doesn't seem reasonable. When the time comes, we'll make the decision and will disclose that to the market.\n\nBut in fact, the takeaway is, if it was, if it were a small award that made sense, even though the liability management would be a bit more expensive, we would consider it but under these conditions. When the time comes, we will look at the exclusively economic perspective, if the premium is that big, if it's higher than that, we'll consider the macro scenario. But looking at the market today, it's difficult to say that we would call under those conditions. And it's not about capital at a second time, but the Brazilian Central Bank also has to approve and one of the requirements for Brazilian Central Bank approval is in addition to show that you have sufficient capital.\n\nAnd we do you have to prove that a new issuance is more economically feasible than the current operation. Obviously, the Central Bank will work with ranges reasonability. That's valid, but the differences are very significant. So even before submitting that to the regulator, we would probably not call if the conditions were similar to what we see right now.\n\nRenato Jacob\n\nThank you, Milton. Let's go back to the screen now we have a question from Michelle [Inaudible].\n\nUnknown speaker\n\nGood morning. Good morning, everyone. Milton, Renato, thank you for taking my question. I have a question about your ROE sustainability.\n\nGiven that you said it's not hard to get an ROE of 20%, but maintain it at 20%. And if it's higher, you can run at a higher profitability. So looking at 2023 do you see a small increase or even an improvement to your ROE, for the upcoming years given that this like rate will be higher?\n\nMilton Maluhy Filho -- President\n\nHi, Michelle. Thank you for your question. First part of the answer is when we look at the data even the guidance that we just review there's an ROE of approximately 20%. So we still believe.\n\nAnd we've been able to run at that level of profitability, we had a recovery across last year. So it would be reasonable to believe, for the next quarters, even though we don't give guidance of ROE, it's implicit. And that's how we did it, showing what the ROE would be close to. In the interest rates, we have good results.\n\nWell, actually, there were three major effects from interest rates, the banks working capital, the liabilities and this overhead strategy given the arbitration of the local coupon with the external coupon. So overhead, we don't have that anymore, and the liabilities we're capturing now. And when you look at the compensation of working capital vis-a-vis the interest rates, you see that the effective rate of the working capital to the select rate is there. Because we hedged working capital and the liabilities and we do that in points across the curve, when you have a sudden increase of the rate, you can't capture that at once it comes in quarter by quarter.\n\nAnd we went through a very important reduction in the interest rate where the working capital rate goes down slower, not so sudden. So the effective rate of working capital should go up in the upcoming quarters as you roll over the hedging and you capture the increase in the interest rates the bad side of interest rates. And we don't advocate for a high-interest rate scenario. We want something stable because you're driving delinquency.\n\nWe talk a lot about individuals in a world where the spreads to the margin aren't repriced, because as a general rule, the individual portfolio is prefixed. So for SMEs and larger companies, that interest rate has a large pressure to service their debt. So that also leads to pressure in default. So on one side, you have growing revenues, but that also gives you a pressure in growing credit.\n\nSo on one side interest rate, higher interest rates help you on one side, but effects affect you on the other. So we prefer lower and credit, which is one of the most important levers in our P&L should be relevant and remain sustainable in the long-term. It's not good to have too much volatility in the cost of credit you have to look at the whole and not each aspect of them. So moving forward, we don't see anything that would make us believe that the bank's profitability would be material effects, materially affected.\n\nBut then again, forecasting 2023 and 2024 is a reasonable exercise in futurology given the scenario of all the information available. So I'm not going to give you guidance of profitability, we have been able to advocate that for the bank, the results of the quarter speak for themselves. The guidance that was given also include a reasonable rate of profitability. 2023 has challenges competition in the credit scenario, and the more mature economies, what's going to happen with the slowdown in the U.S.\n\nand in Europe, and China may even perform better than it will in 2022, the Fed increasing the interest rate to 4% opening up the rate. So there are many variables, we're going to have to monitor that and look at that. And all the migration of the portfolio's where we have revenues from services, were going to a more longer-term sustainable relationship, lowering the churn. So there's pressure from the competition, pressure coming from all sides.\n\nI'm not going to give you guidance in the long term for ROE. But we've been able to deliver good profitability in the short term, we will continue to perform well, in my opinion.\n\nRenato Jacob\n\nThank you, Milton. Thank you, Michelle. Jorge, good to see you. Welcome.\n\nThank you.\n\nUnknown speaker\n\nHi. Thank you. Thanks, everyone. Congrats on the quarter results.\n\nI wanted to ask Milton, you've said along your presentation that you feel that it is prudent to be cautious and you talked about cautious environment. And I'm just trying to understand what that means in the context of the balance sheet growth that you're seeing and the guidance that you have, right. I mean, you're guiding for growth that could be up to close to 18% year on year? Your consumer book grew 7% quarter on quarter that annualizes as you know, high double-digit rates, particularly riskier products, like credit cards are growing at almost 40% annualized rate this quarter. And so I'm trying to understand that cautious commentary versus the velocity at which you plan to continue to grow the business.\n\nAnd, and I'm just wondering if, you know, evidently, there's risks out there, and the world is not a great place today? And then those races have to be calibrated, but it just doesn't feel that you're particularly cautious with the level of growth that you're seeing. And so, again, just want to understand, what does that mean? I mean, does that mean that we're going to see a big deceleration going forward, and sort of like we've seen the best or you may think, hey, there are some risks out there, but we feel comfortable and the environment is supportive for us to continue to grow at this space.\n\nMilton Maluhy Filho -- President\n\nOK. Thank you, Jorge. Good to see you again. Well, first of all of course, whatever we produced and all the growth we had in the portfolio that we posted in this quarter of course, we are comfortable with that otherwise we wouldn't be growing the portfolio the way we did.\n\nAnd I was, as I was saying before, we are doing that in the most affluent segments. So they are performing very well, in terms of credit and we have to have good perspective looking ahead. When I say cautious is because we are always cautious. We are always looking understanding the scenario understanding what, are the challenges we may see ahead.\n\nAnd when we look two quarters ahead and 12 months ahead, we don't have all the answers no one has. So we are cautious because in the short term we've been seeing as we are posting here, the delinquency measured by the NPL over 90 days, has been growing every single quarter since the third quarter of last year. This is completely the way we expect it to be. You might remember in the third quarter of last year, and I was saying to the market, when we hit it, hit the low, I will say that we would see gradual normalization of our delinquency ratios.\n\nAnd it's exactly what's happening. So when I say cautious is because we are seeing the delinquency going up. And we have been acting our portfolio the way we should. So we've been reducing strongly the production in the credit card portfolio, we are reducing strongly the production in the auto loans.\n\nSo we've been very effective and very fast moving, fast to make the adjustments that we need. So my point is, whenever you see a gradual normalization of the delinquency ratios, we still believe that we should stabilize very close to what we saw in the pre-pandemic scenario we have to follow through. And we have to guarantee that we will execute this the way we would like to so this is our base case scenario. The other thing I was saying before we lost in 2020, our fair market share in many credit lines.\n\nWe've been recovering that so there is a base level comparison that should be taking and understand that we are comparing to a base level of 2021. I know the quarter on quarter, but we have to look to the nominal GDP to understand why the portfolios are growing. And especially on those portfolios like credit card, as you said, we've been seeing a behavior coming from our clients, but we've been reducing credit limits for many clients that we believe that have an important deterioration or that when we look forward, we understand that might have some issues in terms of the capability of repayment of paying the bank so we are comfortable with the growth we had. On a margin basis, we are decelerating but understand that the portfolio is not only retail we have wholesale here that's been growing a lot and as you can see here with a very healthy portfolio.\n\nAnd we created a lot of productions as I said so there is the event of putting together many productions on the retail. You see that the impact in the portfolio growth is coming in those quarters. But we are confident with what we did but we are cautious with the future. So this is the way we are approaching it.\n\nUnknown speaker\n\nThank you. That's very clear. If you don't mind I think one of the points in your results that have been under-appreciated and no one has asked this on the expense side, you've done a great job at managing expenses well below inflation well overall revenue growth. And I'm just wondering, how much of -- and this is not this year, you've won this for the last few years? How much more is there for you to continue to maximize, minimize expenses maximize efficiency over the next few years? Have we seen the past years, you could potentially start to see an uptick in growth or three years out, we should continue to see you improving on a year-on-year basis.\n\nThank you.\n\nMilton Maluhy Filho -- President\n\nNo. Thank you very much. In fact, we are very focused on that. Of course, when we see 38.7 efficiency ratio for Brazil, it's the best quarter ever, the best the best index that we had, if you look to a long series.\n\nWhatever you look at, but we have the two effects, here, we are having a very strong top-line growth that benefits the ratio. And we are also having a very strong efficiency program. As you can see, showing that we grew only 0.9% year on year, looking this semester, it's irrelevant when you compare to the level of inflation we are facing in the market. So we are confident, I'm sure many of our guys of the bank are watching here, our conversation now.\n\nSo I can tell you that we still have a lot of room to reduce costs is to be very disciplined. And to keep on this agenda, there is a lot of opportunities here. We are not there yet. We will depend on the dynamic on the top line, of course, to see where we can stabilize the ratio, but I can tell you from the cost perspective, we still have a room to improve.\n\nThis is the message for everyone. And also on the investment side, we are investing a lot in technology and investing in new business. So all the growth we had in terms of costs has to do with investing in the future of the bank. So this is very relevant.\n\nWe are not doing a short-term agenda, guaranteeing the profitability of the bank for the coming quarters. And I'm not looking for the whole period. We are looking for a long-term agenda. This is the way we manage the bank.\n\nWe have a very strong shareholder view. This is the way we are doing our investments here. Thank you.\n\nUnknown speaker\n\nThank you.\n\nRenato Jacob\n\nThanks, Jorge. Thanks, Milton. This investor is Portuguese. We've got Daniel Vaz from Credit Suisse.\n\nDaniel Vaz -- Credit Suisse -- Analyst\n\nThank you very much and congratulations for the results. How are the liabilities last half of the year we've seen a little bit of growth on top of liabilities when we look at the ratio. You said that this drops a little bit? So I wanted to understand is how you've grown fundings for bonds and other instruments and what about in strategic investment for funding? Thank you.\n\nMilton Maluhy Filho -- President\n\nFirst, we have gained market share in investments, both in terms of private and in terms of retail. And we've been working in our ecosystems, significant investments in Aeon 110 offices working. We hope to hit 120 branches by the end of the year, nearly BRL 500 billion under custody management, which is dedicated consulting. So we've been operating very strongly in investments we are no longer working with net resources.\n\nWe're working net-net, net-net banking has been really expanding quarter on quarter. Our strategy is very clear. And I think your question is very significant. When we say we have been working in consultancy, that's the best thing for many years now that's the best thing.\n\nWe can take them out of a multimarket account with its add higher administrative rates and bring them over to bonds or other instruments. It's much better its better but instruments for them. It's better for their suitability we understand what their risk profile is. So with this high-interest rates, there was a migration from higher risk to lower risk products.\n\nSo there were some funds that were multimarket and they have moved over to fixed markets. So we've got a great we've got LCLI, IEG, we've got all sorts of different instruments and products available they're very consistent, consistent returns just specifically for retail. For financial instruments, we also use this institutionally for funding. Sometimes we're the first asset.\n\nAnd we have a great liquidity management, LCs is quite high because of flight to call during the crisis, and there's high demand for credit loans. So the request for loans and credit has increased. So we've been using cash. But again, we're working within margins above regulations, and we're very comfortable, our investment strategy and our model has been stable.\n\nSo early, it's heavy investment. Because you can't just do this, you can't just have a ton of people working, if you don't have the model, the products, the offers, the digital side, if you don't have all of the elements that you need, and if you don't have human capital, quality human capital to be able to make this work. So we've been strengthening and investing this model for some time now, we've seen that results have stabilized as a result of this very significant investment. So we're heading in the right direction, the model is very functional.\n\nAnd we've had very good results. So we've got some. When we look at our breakdown, and we see the coverage, we're doing fine. We've got different products, we got new products, every channel, private bank, we all have different products.\n\nWe've also been working strongly to overcome some of the investment product gaps. So in addition to Treasury traditional products that we had, but how can we meet some of the other demands, contracts, many contracts, limits, home brokers, and we've been growing, and we've been doing this, we've been focusing on this. But we've also seen in the market is that we've got great strategy in terms of the market, we understand that this is what our spreads are fully compatible with the operations. So it's important to have this overview.\n\nWe're looking at the sustainability of our customer relations over the long term. Sometimes we need to accept a lower margin in order to offer better products to the customers. But these are all consistent with our strategy with the moment that we're facing right now. And the spreads are absolutely adequate for what we're offering.\n\nThere's another element to that I have to mention as well, which is the secondary market, which is purchase and sale of assets. And we have been doing more of this to offer more liquidity for our customers. These are either lower liquidity instruments, but it's important if you can, when you look at this analysis, look at the spread and transparency with our customers and how we have been consistent and sustainable when doing this. I think there's a great opportunity and we've been growing.\n\nOur investments have been growing. I'm very optimistic about what we should expect moving forward.\n\nDaniel Vaz -- Credit Suisse -- Analyst\n\nThank you.\n\nRenato Jacob\n\nThe next question comes from Jason Mollin. I'm never sure if you are going to ask your questions in Portuguese, in English, in Spanish, or we have a mix of the three. So I'll let you decide which one you want to take, but thanks for joining us today, Jason.\n\nJason Mollin -- Scotiabank -- Analyst\n\nHi. Thank you for the opportunity to ask questions. Congrats on the strong results. In particular in Brazil's current economic context economists, as per consensus for the Central Bank focus or expect real GDP to grow 0.4% now and 2023 down from I don't know 0.5% just a few weeks ago, interest rates are expected to remain high now with the weak staying in about the 11% range at the end of 2023 And we have a presidential election? I mean, you've addressed a lot of my issues, but I thought maybe you could give us your views on where it's only been go ways in the current economic and banking sector cycle.\n\nYou've talked a bit about where you see loan growth going and caution etc. Maybe you could share where you see similarities and differences versus historical cycles with high rates and low economic growth and Brazil's fiscal challenges that might be helpful? And as a secondary part of that question in the current cycle it is interesting, and I appreciate the disclosure of it those hedging strategy on the capital index. You showed that you spent BRL 500 million for the second quarter after BRL 400 million in the first maybe if you can give us your views on how you see that working currently and going forward? Thank you.\n\nMilton Maluhy Filho -- President\n\nOK, Jason. Nice to see you again. Thank you for your question. So talking about this scenario, I think it's difficult to compare when we look back, I think we still have a few challenges looking forward.\n\nFirst of all is, you're right when you see the focus, you are seeing this growth coming from 0.4% our macroeconomics has 0.2% figure for 2023. So it's not that different. It's even though it's half of the focus it's still on a very low ratio so that's a challenge for 2023. And especially due to the level of interest rates, we don't believe that we've been facing all the effects of the interest rate hike that we've been observing in the past month.\n\nSo looking forward, we believe that it's going to have a slowdown, the impact on the economy side we might see commodities coming to a lower level due to the war, Russia/Ukrainian war. But also we expect that the GDP in us coming from 2% this year, maybe 1% next year. In Europe, coming from 2.5% coming to 0.7% next year so Mario has this mathematics that says that when the global GDP falls around 1% we feel about 1% in our GDP as well. The good side of that is that on China, we might see a recovery coming from this year to next year.\n\nSo you won't see on the economic map -- the World Index, you won't see that made major impact, but you are seeing this in U.S. in Europe and in South America. You still have huge challenges in many of the countries we are going through inflationary process worldwide, this is not a phenomenon of Brazil. So our view is that the interest rate depending on the fiscal policy, that we will understand, and everybody will know that in the coming years, we are going to an election process.\n\nSo no one will be discussing here. What will be the new or same fiscal policy depending on who wins. But we will understand that by the beginning of next year, and this will be a very relevant pillar to define where the interest rate may accommodate. So it may stay at 13.75% for a longest period, it may go down our base case scenario, that it will go down to 9.75% by the year end.\n\nBut it can happen different we might see even a hike in interest rate depending on the fiscal side. We have benefits of this year the inflation helps the level of indebtedness of the country. We have the GDP growing. We have a few impacts that are positive.\n\nSo we might have the year end 80% of gross debt through GDP, but for next year, our base case is going to 84%. So the question is where it will stabilize, we are doing a few investments now some more for our fiscal stimulus, are there going to be permanent? Are there going to be only for this period or next year it won't happen. So there is a lot of questions that we don't have the answer. So this is what we are seeing in terms of macroeconomic challenge, I think will be our challenge here.\n\nThere are risks here. Interest rates going up in U.S. as you know, it might go more than 4%. So you have the ECB in Europe will increase interest rate as well.\n\nSo we're we are seeing these phenomena worldwide. So that's why I'm saying that we have risks, we have to be cautious. We have to understand where we are. And I think when we go back for many crisis in Brazil, we have almost 100 years old.\n\nSo we have capabilities, we've been learning from our mistakes. And we've been learning from the macroeconomic environment. So we have the capability and we have a very relevant risk appetite to manage this scenario. So we are doing the measures that we need to do.\n\nAnd link into your second question it has to do with the hedge on the capital index, when we decided to do that it's because we have volatility in our capital that we didn't control. And this has nothing to do with the overhead strategy. It has more to do with the banks we have abroad. So when you look to Chile, Colombia, Argentina, Uruguay, Paraguay, they have their capital in the local currencies.\n\nSo when you do the hedge, you have the benefit of the arbitrage. You don't have this BRL 500 million cost. But in the other hand, you have your capital very volatile. And this is not good to manage our bank the way we do.\n\nWe want to understand, what's our risk appetite, what are the levers that we can leverage that we can work to keep the level of capital that we have, but the effects we don't control. So the only way of doing that was hedging it. This is something that other banks doing or international basis when they have subsidiaries abroad, we think it's relevant. But we are going through a phenomenon in Brazil of hiking interest rate, it will happen in the U.S.\n\nand in the other countries as well. So what's really costs to us is this spread over our local interest rate with this local interest rate of those countries. In a more, I would say, sustainable scenario, this spread should be much lower than what we are observing now, this cost might be lower than what we are seeing. But we are confident you can see from our capital basis, the effects came from 4.70% to 5.25%.\n\nAnd we had at the end of the day, a stable capital, if you take out the credit. And if you take out some traditional effects and the consumption by the XP acquisition, you will see that the hedge was very effective. So we are happy with the strategy help, help with the hedge. And we have a much more controlled scenario when we can predict and we can estimate our capital.\n\nSo our view is that by the year end, our best guess now. We're going to recover to our risk appetite capital index. I'm talking about 11.5% core capital common equity.\n\nRenato Jacob\n\nThanks, Milton. Thanks, Jason.\n\nJason Mollin -- Scotiabank -- Analyst\n\nThank you.\n\nRenato Jacob\n\nWe will go next in Portuguese. We got Domingos from J.P. Morgan.\n\nDomingos Falavina -- J.P. Morgan -- Analyst\n\nGood morning. Hello, Milton. I'm looking at Bloomberg, saying the CEO is a little more cautious with inflationary increase. But we're looking at the portfolio it grew 8% quarter on quarter for credit cards.\n\nFor revolving credit, that grew at 86% year on year. And so the revolving part one over 120% year on year now 20% this past quarter so I've got lots of questions ways to ask this. For these interest-earning assets or perhaps if you could talk about these a little bit more? Makes sense to be so cautious with the 8% growth quarter on quarter and these are customers who didn't pay on bill date they didn't pay when it was due. So they're already overdue.\n\nThey're already paying in installments. So I decided to tie this in growth what makes sense, what makes sense in terms of caution. And then in terms of wholesale, I don't remember the number 30-plus percent, but wholesale did out retail right in your portfolio?\n\nMilton Maluhy Filho -- President\n\nThank you so much for that question. So we'll go back to Portuguese now. Very good questions. Our credit card portfolio is highly related to consumption and transactions.\n\nSo quarter on quarter, this grew 11% that was a growth of 11%. This shows that consumption is now up. And we've got different types of consumption according to our different customer bases. What's our basic consumption what's excessive consumption.\n\nSo we basically any sort of low income, middle income, high-income customers look like? So all everyone across the board has been spending more. We've been working with low pension. If you look back at 2020, 2021, there was high amortization especially in 2021 for revolving credit, so there was high amortization because of the dynamics of lower expending higher liquidity in the system, all of the support all of the help because of COVID. So there was a real important decrease in prevention, but its risk to return when we talk about credit cards.\n\nSo again the rates are higher. So we can work with risk a little bit higher risk for this type of product there is no cap. There's margin, there's manipulation but we also have a certain point where we don't want to accept risk, because if you hit it too high or risk, obviously, it doesn't matter what percentage you get, because we're going to have to cut the customer off, right, they're going to be completely overdue or default. If you look at the portfolio volume, over BRL 120 million and we're talking about 6%, 7% of the funding for revolving.\n\nWe would expect this pretension to increase. Now, but the levels are still very adequate. They're just right they are very similar to what we saw in previous quarters. But it is a more volatile portfolio, and it is going to be affected by what we see.\n\nSo credit costs and overdue rates are also accounting for this are already accounting for this effect, this is something we've already felt. That's why we made the cuts that we made, they're very important. We in some areas, we reduced production and 50%. And we expect to make more cuts.\n\nBut the brokerage credit is much better engagement, which we call corporate is stronger. And for the retail cards, you've got higher risk. But you can, you can collect much easier. And also we have with a nucleus or the chorus where we're able to provide customer service those are a little bit stronger, too.\n\nSo we're able to collect better from our customers. We've also had very similar market shares. Because we're seeing market access, we're not going after it, we see if there's too many card cards on the market, there's a flood of cards on the market, there's very little costs for experimenting. So very easily any customer could pick up four or five, six cards.\n\nSo we have seen higher leverage than what we've seen in the past. We don't want to defend market share, at whatever cost. We want to do something that makes sense according to our risk appetite. But it is focused on transactions and we have to look at inflation consumption, we're going to see portfolio growth and this is going to -- how you effect on the portfolio -- operate with the portfolio is on the limit.\n\nSo we've been very active, we've been actively working on the limits for those patients that would improve or worsen. So we've got the installed portfolio, you've got a higher ability to charge or collect from the customer, focus on customer service. But we also have significant limits in certain sectors, specifically in groups, low income groups where we've seen a lot of overdue or complete delinquency, overdue payments and see differences. So there is a balance and risk and a risk and return and the portfolio effect.\n\nSince we've got a lot of unit class and personality customers, where it's very healthy, so we're able to offset. But if we look at profitability of retail and undergrad, we're talking about this retail wholesale, this is the same thing we're seeing there's the portfolio effect, but there's also the gradual normalization of overdue payments or complete delinquency. And the portfolio of individuals brings profitability down. So you can work on that with products that may or may not create value, you look at the relationship with of the customer overall.\n\nAnd you can't look at individually. So you consider that in the portfolio. That's what I talked about caution. And in our practices from the third quarter until now has been all about that adjusting production where we have to, and we have growth because we have comfort, but caution looking forward and the cost that we have in marginal production about the return of the wholesale bank, it's not actually a wholesale bank.\n\nIt's the entire wholesale business. So it's not only Itau BBA, but we have WMS here, so asset and all the result that comes from our wealth business has returned. So we're in the best years of the wholesale bank. So Itau BBA has very strong revenues out of all the business lines coming from credit, coming from investment banks, fixed income, variable income is a little bit slower this year, weaker as you know, M&A, OK, good results and commercial portfolio as well.\n\nAll the niches where we operate and are performing well cross selling in if FX liabilities funding. So we've seen in the wholesale world, lower levels of bad debt, so they're at the lowest levels for the wholesale division. And in our opinion, at some point, things will get back to normal. I don't think it's going to going to be what we've seen in previous crisis.\n\nWe don't expect that but we are at a very low level. And that's what that's valid for everyone that operates in that market, in our case specific case, in the corporates business, we changed the mix going into the better ratings, very active portfolio management that started off with BBA in the beginning of 2015, 2016, we changed how we managed the portfolio and now we're reaping the results of very healthy portfolio, great ratings, very strong results in all the lines that you can generate from your customers and at the same rate, low cost of credit and low bad debt. So timing is perfect for the profitability snapshot, but I don't think it's going to be 30 some for too long, but wholesale with WMS will have very strong profitability rates. OK, thank you.\n\nDomingos Falavina -- J.P. Morgan -- Analyst\n\nThank you, Milton. Thank you.\n\nRenato Jacob\n\nWe have Henrique Navarro from Santander. Good morning.\n\nHenrique Navarro -- Santander -- Analyst\n\nGood morning. Thank you for giving me this opportunity to ask questions and congratulations on your results. About the acquirers, it read they have very strong results. I remember that three years ago, even inside Itau that in the future acquirers would be a call center, a very profitable call center.\n\nThe results are very good. So my question is, did you change the dynamics with the acquirers? So we saw CLO as well with good results. Is that linked to scenario where acquirers connected two big banks have a competitive edge or because of new entrants? Could you give us some more flavor of the quality of the results of that, how should we look at that going forward?\n\nMilton Maluhy Filho -- President\n\nGreat, Henrique. Thank you once again for your question. It's great to see you here. So the ready business and for people sat in this chair for a while in the past, when you look at long series, I was actually looking at this a couple of days ago, in the past, we had BRL 3 billion in profit with Ready, that was the order of magnitude.\n\nWhen you look at what happened from then until now the market changed, there's a lot of competitors out there, the prices have dropped materially, the MDRs as well, and the take rates as well. So there was a huge change in the competitive environment, things really changed in the world of acquirers. So the market in the past, the external channel was highly relevant, not the bank channel. And now, customers want an integrated offer.\n\nThey want to talk about receivables and payments, they don't want to talk just about MDR. Just about the terminal, even though they still discuss that, they want quality service, they want price. We know that MDR has a significant impact to retailers costs and the companies that take credit cards, so the market really changed. So what we did was, first of all to focus on the more profitable segments.\n\nAnd I remember this in the past, there was a huge fight about market share that that was synonymous to results. But it's not because two-thirds of the market share in the acquirers market comes from the big customers where prices are tight and negative contribution margin sometimes. So we gave up on that negative contribution margin, unless that relationship with that customer makes sense. So we look at the customer with an integrated view different than we looked at them in the past and not an acquirer and the bank separate, the customers are same.\n\nYou have to look at both. When we make a decision at date, one of the bank managers are involved to be it in the wholesale segment or in the corporate segment. So it's fully integrated. The second element is that when you compare the results already, when you look at the top line you won't see that much but on the bottom line internally in the managerial model we take working capital out of the company and we allocate that to the corporation.\n\nAcquirers are independent. So they have the working capital in favor of them. That's the equity of the company, and it costs zero at the end of the day in the P&L, and you have the benefit of the increase of the interest rate. So your funding cost is also lower as that capital does not pay interest rates to shareholders, they pay dividends, they pay, they have different types of profitability measures.\n\nSo at Ready, we isolate that effects, so the marginal cost of that is the funding opportunity. They don't benefit from a lower funding cost for that financial products. We've been focused by focusing on more profitable segments, we've gained market share, but we also lose from design in the series, even though in the quarter, we can defend that market share in some, we did not have market share, we lowered the market share because of the negative contribution margin. And we've been leveraging the financial services be it advances or even the fives.\n\nAnd that's in the MDR. When you look at the revenues from services and insurance, that's the result of MDR. And that, where we advance, that's the financial margin for the customer, because it's pretty much a credit product. The funding cost is also in the financial margin for customers, it's not here.\n\nSo the interest rates really affected all acquirers because of the mismatch. They're very active in advancing and prefix and postfix funding and that affected many acquirers, there is normalization as you change the pricing of the assets, of the liabilities and assets be at the advanced payments, or the sales, the payment methods. So if you don't, you don't increase the net MDR but you clearly improve the spread of the financial products that were highly pressured from the increase in interest rates. That's what's being done.\n\nWe're still very satisfied with the evolution that we've seen the bank. It's a cost center based on the point of view of the business, it's not when we were saying that is that because we didn't look at an acquirer as a business as it was in the past. It's just another branch of servicing customers. So now it's a complete view.\n\nThat's how we've been operating.\n\nHenrique Navarro -- Santander -- Analyst\n\nPerfect, Milton. Thank you.\n\nRenato Jacob\n\nNext question we have with us Nicolas Riva from Bank of America. Hello, Nicolas. Good to see you.\n\nNicolas Riva -- Bank of America Merrill Lynch -- Analyst\n\nHi, Renato and Milton. Thanks for the chance to ask questions. I have a follow-up on the prior question about the perpetual bonds. So you said clearly, under current market conditions, it doesn't make sense for you to issue a new perpetual bond in international market.\n\nMy question is, if you would consider calling the perpetual bond in December, losing temporarily that capital the BRL 1.25 million, and waiting for market conditions to improve to issue a new perp or also potentially if you consider issuing a new perp in the domestic market and refinancing some of that international perp into the domestic market? Thanks very much.\n\nMilton Maluhy Filho -- President\n\nThank you. Thank you, Nicolas, for your question. Good to see you. Thank you very much.\n\nTo be very clear here, we don't have a capital constraint. So the decision has nothing, it's not relevant the discussion on capital here. So we still have room, we have the additional Tier 1 of the bank consuming 1.5. So we are on the regulatory cap.\n\nSo we don't imagine to take this risk and mismatch because at the end of the day, if I exercise the call, not being effective, economic wise to the bank, and then waiting for a new window of opportunity. We're taking a market risk if we do that. So and it doesn't make sense on the economic perspective again to exercise a call, if the reset will give you a premium, a new issuing will give you 250 basis point is spread over all of what we have nowadays. So the answer is no.\n\nWe will make the decision whenever is possible, but taking in consideration that if in economic view, we should exercise the call. This is our fiduciary obligation. We will exercise the call if we don't have to exercise the call due to economic perspective, we won't exercise the call. So due to the current market level that we are seeing now.\n\nAnd we if we had to make this decision today, we wouldn't exercise the call. I think this is the best way to give you this answer. Talking about the local market, we've been active, we have an important amount of local debt in the local market. And we are always analyzing.\n\nSo when I say there is a huge spread, I'm not looking only on the international market because we may be able to access local pockets at decent conditions. But we do the same calculation. If this new liability doing locally if it's better than the perpetual, of course, we would exercise the call and issue a local, so we don't have a preference if it's other offshore or onshore. Our preference is to make the most relevant economic decision.\n\nWe take other things in consideration, but this is the core element on the decision we make. So we will look to the local market as we always learn, but it's not so deep as we see the offer market for this type of instrument but we are looking to the local market as well.\n\nRenato Jacob\n\nThanks, Milton. Thanks, Nicolas.\n\nLast question, Milton. We have Marcelo Telles from Credit Suisse. Good morning, Marcelo.\n\nMarcelo Telles -- Credit Suisse -- Analyst\n\nHi. Good morning. Thank you, Milton and Renato, for taking my question. This is the last question.\n\nSo thank you for your patience. Actually, I have two questions. They're pretty much related to each other. It's not actually about the bottom line.\n\nWe talked a lot about that. But I'd like to hear your opinion, Milton, about the Brazilian Central Bank initiative of the digital BRL . Is there a concern in the bank that where that would increase the risk of financial intermediation. So upfront deposits, I'd like to hear your opinion on that.\n\nAnd the second point at Itau Digital, and the tokenization area. Could you talk about that objective there, there are some opportunity in cost reduction there. How are you getting ready for 3.0 DeFi? I would like to hear about that.\n\nMilton Maluhy Filho -- President\n\nOK. Great, Marcelo. Great question to end this day. Two different questions than what we've heard so far.\n\nSo first about the CBDC. Obviously, we've been following that closely. The Brazilian Central Bank has been talking to the market and talking about their objectives, I think it's still early to say. But in our opinion, we don't believe that the regulator would like to generate a systemic risk, I don't think that they want to capture the deposits and take the banks out of it.\n\nThat's a huge systemic risk. That's not their agenda. Their agenda is about trying out new technologies and understanding what kind of movement that would lead to even actual money, even the system that has decreased money in circulation, actual money. So it's about understanding what they're talking about, and the solution for that type of thing.\n\nIt's still in the initial stages and pilot program. But I don't ever, I don't believe that was the regulators idea to take the banks out of the equation. So that's not a concern, but we do have to monitor understand how that will be done, how it would be operated. What bank, what role will the banks play is that collateral? Will we have each one of us, each of the banks have their own coin, will it be stable or not or currency, excuse me.\n\nSo but I'd like to say again, that we don't see a systemic risk in that, at least as far as everything that we've heard from the regulator. That's not what they want, what the Brazilian Central Bank wants, they don't want to generate a systemic risk. So we're very comfortable in that, the size of the opportunity to be determined and how we're going to operate TBD, so it's hard to say right now, we created an area of digital assets. In fact, that was something that we were already doing step by step basis, and we decided to centralize that under one single department with a person that's fully dedicated to that.\n\nWe're open, we're not closing our eyes to the revolution, be it in the currencies market, be it in the stable coins market, be it in tokenization market, and the Blockchain technology has a lot of applications besides crypto and other things. So we're looking at how the bank will position itself in the Metaverse. We've already had some initiatives in that, we went we joined the gamers world strongly and that's good to understand the banks opportunity in Web 3.0, Metaverse and so on. So we're very open.\n\nWe do spend time talking about that, and understanding that. So we're already moving. We already have pilot projects of digital tokens here at the bank, I myself was part of that, I bought a credit token to see how it works, and the type of experience that the customers will have. So it's something we've embraced, we believe that there will be a cost reduction agenda that's very significant more digital processes and efficient processes where you can have digital authentication, authentication and certification.\n\nAnd you can break down the products and create secondary liquidity and individuals, you can democratize and allow people to buy a part of credit where they don't have access to that today, because through the tokens, we can do that. So there are a number of opportunities. That was a great question, but the main takeaway is that we are looking at that, and we're also moving on those funds.\n\nRenato Jacob\n\nThank you, Milton. Thank you, Telles. Milton, we have a number of questions from WhatsApp asking about delinquency costs and the avenues acquisition since we have no further time, the IR team will answer everyone directly. So this is the end of the Q&A session.\n\nBefore you leave, once again, we'd like to invite you to Itau Day 2022 that will be held on September 1st, nine to noon BRT time, we'll have the co-chairs of the board of directors, and also all the members of the executive committee. As Milton mentioned, this year, we will talk about customer centricity, and looking at that at many different angles. So we hope you can join us on September 1. See you then.\n\nThank you, Milton. Thank you, everyone. Thank you.\n\nMilton Maluhy Filho -- President\n\nI'd like to thank everyone for participating. Once again, it's always a pleasure to talk to you all and share this information about all the different themes and consistency. Always with transparency in our disclosures and the quality that we offer the market, we always answer the questions. You might not like the answer, but we always answer whenever you ask us your questions.\n\nSo once again, I'd like to invite you once again to be with us on Itau Day to talk about the bank, it's half, it would not be what it is today without all its shareholders and the trust that we receive from all of you. So we'd really like to share with you our agenda. And it's also a way to give the visibility of the rest of us, of our executive committee because nobody does anything alone. We always work toward our customers' interests.\n\nAnd you'll see a lot of that on Itau Day. Thank you once again for participating. We'll see you in specific meetings and the next call. Thank you.\n\nDuration: 0 minutes\n\nRenato Jacob\n\nMilton Maluhy Filho -- President\n\nThiago Batista -- Director, Investor Relations\n\nFlavio Yoshida -- Member of the Executive Committee\n\nUnknown speaker\n\nTito Labarta -- Goldman Sachs -- Analyst\n\nDaniel Vaz -- Credit Suisse -- Analyst\n\nJason Mollin -- Scotiabank -- Analyst\n\nDomingos Falavina -- J.P. Morgan -- Analyst\n\nHenrique Navarro -- Santander -- Analyst\n\nNicolas Riva -- Bank of America Merrill Lynch -- Analyst\n\nMarcelo Telles -- Credit Suisse -- Analyst\n\nMore ITUB analysis\n\nAll earnings call transcripts"
}