{
  "companyName": "Marsh & McLennan",
  "companyTicker": "MMC",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/20/marsh-mclennan-mmc-q3-2022-earnings-call-transcrip/",
  "content": "Marsh & McLennan (MMC -0.78%)\nQ3 2022 Earnings Call\nOct 20, 2022, 8:30 a.m. ET\n\nOperator\n\nWelcome to Marsh McLennan's earnings conference call. Today's call is being recorded. Fourth quarter 2022 financial results and supplemental information were issued earlier this morning. They are available on the company's website at marshmclennan.com.\n\nPlease note that remarks made today may include forward-looking statements. Forward-looking statements are subject to risks and uncertainties, and a variety of factors may cause actual results to differ materially from those contemplated by such statements. For a more detailed discussion of those factors, please refer to our earnings release for this quarter into our most recent SEC filings, including our most recent Form 10-K, all of which are available on the Marsh McLennan website. During the call today, we may also discuss certain non-GAAP financial measures for a reconciliation of these measures to the most closely comparable GAAP measures, please refer to the schedule in today's earnings release.\n\n[Operator instructions] I'll now turn this over to Dan Glaser, president, and CEO of Marsh McLennan.\n\nDan Glaser -- President and Chief Executive Officer\n\nThank you, Andrew. Good morning. And thank you for joining us to discuss our third quarter results reported earlier today. I'm Dan Glaser, president, and CEO of Marsh McLennan.\n\nJoining me on the call today are John Doyle, our group president, and COO; Mark McGivney, our CFO; and the CEOs of our businesses, Martin South of Marsh; Dean Klisura of Guy Carpenter; Martine Ferland of Mercer; and Nick Studer of Oliver Wyman. Also with us this morning is Sarah DeWitt, head of investor relations. Today is my 60th earnings call at Marsh McLennan and my 40th as CEO. After 10 years as president and CEO, I will be retiring from Marsh McLennan at the end of the year.\n\nLeading this firm over the past decade has been the honor of a lifetime. Before I jump into our results, I'd like to say how pleased I am about the leadership succession we announced. The appointment of John Doyle as president and chief executive officer effective January 1st continues to underscore Marsh McLennan's deep trove of industry-leading talent. During John's tenure as president and CEO of Marsh, he drove exceptional revenue and earnings growth.\n\nAnd as group president and COO, John is finding new ways to harness the capabilities of Marsh McLennan across our business, accelerating impact for clients, colleagues, and communities. John has been an indispensable partner to me and the other members of our executive committee in shaping and executing our strategy. He knows our business well and is focused on delivering outstanding performance for clients and shareholders. I am confident that our extraordinary success will continue under John's leadership.\n\nMarsh McLennan's third quarter results demonstrated strength-on-strength. Top-line momentum continued across our business, extending the best run of quarterly underlying growth in over two decades. We generated strong top and bottom-line results despite difficult year-over-year comparisons. The underlying growth of 8% in the quarter reflects considerable strength across our organization.\n\nIt represents the sixth consecutive quarter of 8% or higher top-line growth. Building on 13% growth a year ago, adjusted operating income of $851 million was a third quarter record and grew 12% on top of 19% in the third quarter of 2021. Adjusted EPS growth of 9% is excellent, especially given the costs related to our strategic talent investments, the rebound of TNA, and 32% growth in the third quarter of 2021. We completed 500 million share repurchases in the third quarter, bringing the year-to-date repurchases to 1.6 billion, which is higher than any full year level of repurchases in our history.\n\nWhile the economic and geopolitical backdrop is uncertain, we have a proven track record of being resilient through cycles and are well-positioned. Overall, our third quarter performance highlights the strength of Marsh McLennan. The critical nature of what we do for our clients and the unmatched expertise of our colleagues. With that, let me turn it over to John.\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nThanks, Dan, and good morning, everyone. I am honored to become Marsh McLennan's next president and CEO. And grateful for the trust and confidence Dan and the board have placed in me to lead this exceptional company. I'm eager to work with our colleagues in realizing new possibilities to serve our clients, create value for our shareholders, and support our communities.\n\nI'm pleased with our third quarter results, we delivered strong growth despite a macro backdrop that is becoming more uncertain. We are delivering solutions to help clients navigate volatile economic, geopolitical, and risk landscapes. As we discussed last quarter, there are aspects of the current environment that remain supportive of our group. Higher inflation offsets slower GDP growth, rising interest rates, breaches of fiduciary income, and the challenging insurance market drives a flight to quality.\n\nWe also have a track record of success and being resilience through cycles, and I believe Marsh McLennan is well-positioned [Inaudible]. I would like to take a moment to discuss Hurricane Ian, which just had a devastating impact on the people and communities of Florida. Ian has the potential to be the costliest insured event in Florida's history and the second most damaging insured loss of all time. We are working with insurers to help our clients receive much-needed support.\n\nInsurance has a critical role to play in building homes and restoring shuttered businesses. Our work reinforces Marsh McLennan's purpose to be there in the moments that matter for our clients and communities. Ian's category-four strength, incredible size, its slow pace resulted in tremendous damage. The cost of which is exacerbated by the effects of coastal development, the escalation of property values, general inflation, and persistent supply chain challenges.\n\nWhile the ultimate insured loss won't be known for some time, the impact on an already stressed property market will be significant. At mid-year reinsurance renewals, the property market is already exhibiting strains following the Ian, the property cat market is likely to tighten even further and perhaps see a significant supply demand imbalance. We are harnessing our collective expertise, scale, and capabilities to bring solutions to help our clients navigate this complex risk in part. Turning to our third quarter financial performance, we generated strong results.\n\nAdjusted EPS of $1.18 is up 9% versus a year ago, which is impressive on top of 32% growth in the third quarter of 2021. Total revenue increased 4% versus a year ago and rose 8% on an underlying basis with 9% in RIS, and 8% in consulting. This is a terrific result, especially considering the prior year's third quarter underlying growth of 13%. Marsh had an excellent quarter, growth was 8% collecting new business and stronger Wealth growth, Guy Carpenter grew 7% this quarter, continuing its strength of terrific results, Mercer grew 5% in the quarter, despite the capital market headwinds, and Oliver Wyman's grew 13% for 7 consecutive quarters of double-digit growth.\n\nThe third quarter saw adjusted operating income growth of 12%, and our adjusted operating margin expanded 110 basis points year over year. Overall, I am proud of our third quarter performance, which demonstrates the strength and resilience of our business. Given our strong third quarter and year-to-date performance, we are on track for an outstanding year. We expect to generate high single-digit growth, underlying revenue, solid growth adjusted EPS, and to report margin expansion 15th consecutive years.\n\nWe are focused, and aligned to succeeding together, as our results demonstrate. Before I turn it over to Mark, I'd like to say a few words about Dan. During Dan's tenure at the helm of Marsh, McLennan company has been transformed. Our revenue has nearly doubled, our adjusted EPS has more than tripled, and our market cap has quadrupled.\n\nOur scale and capabilities have been enhanced and our talent is unmatched. Dan let our expansion into new client segments and launch the Marsh McLennan agency, which has grown to $2.5 billion dollars in annual revenue and closed 100 acquisitions in just over a decade. Dan also successfully led the company's $5.6 billion acquisition, JLT in 2019, the largest in our history. Most importantly Dan has led our firm with vision, courage, and integrity.\n\nFaced with the consequences of the pandemic, his values first leadership ensured that the tough choices were made to safeguard our colleagues, protect jobs and incomes, deliver for clients, bolster liquidity, and still produce significant growth. His decision was an inspiration to our colleagues and an example to the broader business community. Our financial performance speaks for itself with Marsh McLennan's total shareholder return more than doubling the S&P 500, during Dan's stewardship through the year. Less visible, but even more significant is the sense of pride and the culture that Dan has instilled in the firm.\n\nUnder his leadership, you're not only a great stock but a great company. We owe him our gratitude. So on behalf of our 86,000 colleagues, I thanked Dan for his leadership. And with that, I'll turn the call over to Mark for further detail on our financial results and the discussion of our outlook for the rest of 2022.\n\nMark McGivney -- Chief Financial Officer\n\nThank you, John. And good morning. As Dan, and John mentioned, our performance in the third quarter reflects continued momentum across our business. So another quarter of strong underlying revenue growth, and meaningful earnings growth despite revenue, and expense comparisons.\n\nConsolidated revenue increased by 4% to $4.8 billion, and reflected underlying growth of 8%. Operating income of $791 billion. Adjusted operating income was $851. Our adjusted operating margin of 19.6%, 110 basis points last year.\n\nThe increase was driven by modest operating leverage and benefits from foreign exchange. We generated GAAP EPS of $1.08 in the quarter, and adjusted EPS of $1.80 up 9% per year. For the first nine months of 2022, underlying revenue growth, was 9% for adjusted operating income, 11% to $3.7 billion. Our adjusted operating margin is 60 basis points to 25.6%.\n\nOur adjusted EPS is 12%, $5.38. Looking at risk in insurance services. Third quarter revenue was $2.8 billion, up 6% compared with a year ago or 9% on an underlying basis. Operating income increased by 32% to $529 million.\n\nAdjusted operating income increased by 20% to $552 million. Our adjusted operating margin expanded by 200 basis points to 22.4%. For the first nine months of the year, revenue was $5.7 billion, with underlying growth of 10%. Adjusted operating income for the first nine months increased 13% to $2.8 billion, with a margin of 31.1%, up 80 basis points from the same period in 2021.\n\nAt Marsh, the revenue quarter was $2.5 billion 5% a year ago. Revenue growth was 8% of the underlying basis supported by strong retention and [Inaudible]. US and Canada had 5% underlying growth, a solid result considering the 16% growth in the third quarter of 2021 that included the benefit of significant M&A and SPAC-related activity. International underlying growth was 11%, Latin America grew by 15%, Asia-Pacific was up 14%, and EMEA was up 9%.\n\nFirst nine months of the year, Marsh's revenue is $7.8 billion underlying growth of 9%, US and Canada were up 8%, and the International grew by 10%. Guy Carpenter's third quarter revenue grew $328 million up 7% on an underlying basis of solid production and retention. Guy Carpenter has now achieved underlying revenue growth of 7% or higher in six of the last seven quarters. For the first nine months of the year, Guy Carpenter generated $1.8 billion in revenue and a 10% underlying basis.\n\nIn the consulting segment, the revenue of $2 billion was up 1% from a year ago, or 8% on an underlying basis building on 12% in the third quarter of 2021. Operating income decreased 14% to $350 million, reflecting a one-time noteworthy benefit a year ago. Adjusted operating income increased [Inaudible] to $362 million, which solid earnings were passed by a drag from foreign exchange. The adjusted operating margin expanded 20 basis points to 19.1%.\n\nConsulting generated revenue of $6 billion for the first nine months of 2022 and underlying growth of 9%. Adjusted operating income for the first nine months of the year is 5% to $1.1 billion. The adjusted operating margin was 19.6% flat versus the third quarter of 2021. Mercer's revenue was 1.3 billion in the third quarter, up 5% on an underlying basis, which is impressive given the impact of market declines on our investments.\n\nCareer grew 15% on an underlying basis, the sixth consecutive quarter of mid to high-teens growth. We continue to see strong demand for solutions with workforce transformation, as well as compensation and reward. Health underlying growth was also excellent at 10% this quarter, reflecting strength across all geography. Wealth decreased by 1% on an underlying basis due to declines in both equity and fixed-income markets.\n\nThis market impact represented a 2% head to Mercer's overall growth this quarter. However, solid demand for defined benefits helps mitigate definitive best. Our assets under management were 318 billion at the end of the third quarter, down 8% sequentially 20% of last year, due entirely to market finds and foreign exchange. For the first nine months of the year, revenue at Mercer was $4 billion, 6%, and underlying basis.\n\nOliver Wyman's strong momentum continues, revenue in the third quarter was a $667 million increase of 13% on an underlying basis. This comes on top of 25% of the third quarter last year [Inaudible] strong demand across most geographies and solutions. In the first nine months of the year revenue with Oliver Wyman with a $2 billion increase of 15% of underlying. Adjusted corporate expense was $73 million in the third quarter.\n\nBased on our current outlook, we expect approximately 80 million for the fourth quarter. Foreign exchange had an immaterial effect on an adjusted EPS in the third quarter, although year to date and a step ahead headwind of 7%. Assuming exchange rates remain at current levels, we expect FX to be a headwind of $0.07 in the fourth quarter. Our other net benefit credit was 57 million for the full year 2022 [Inaudible] our other net benefit credit of around 230.\n\nWe reported an investment loss of $1 million in the third quarter on a GAAP basis. On an adjusted basis, we had an investment income of [Inaudible]. Interest expense in the third quarter was $118 million compared to $107 million in the third quarter of 2021. Based on our current forecast, expect interest expense of $121 million in the fourth quarter.\n\nOur adjusted effective tax rate in the third quarter was 24.6%, compared with 24.4% in the third quarter of last year. Included a modest net benefit discrete. Excluding discrete items or adjusted effective tax rate was 25% [Inaudible]. When we forward guidance around our tax rate, our project discrete item, positive or negative, based on the current environment, is reasonable to assume an adjusted tax rate to be 5% for the full year 2022.\n\nTurning to capital management and our balance sheet, we ended the quarter with total debt of $11.4 billion. Our next scheduled debt maturity is March of 2023 with 350 million senior notes mature. Our cash position at the end of the third quarter was $802 million. Uses of cash in the quarter totaled 931 million, including 293 million in dividends, 138 million for acquisitions, and 500 million in share repurchases.\n\nFor the first nine months, uses of cash totaled 2.9 billion including 840 billion in dividends 411 billion for acquisitions, and 1.6 billion for share repurchases. We continue to expect to deploy approximately 4 billion [Inaudible] in 2022, plus dividends, acquisitions, and share repurchases. Overall, we remain on track for a terrific 2022. For the full year, we expect to generate high single-digit growth and underlying revenue, solid growth in adjusted EPS, and report margin expansion for the 15th consecutive year.\n\nWith that, I'm happy to turn it back.\n\nDan Glaser -- President and Chief Executive Officer\n\nThank you, Mark. Before we open up the call for Q&A, I just want to say it has been a great privilege to lead this firm and work side by side with smart, creative, and dedicated people. I am immensely proud of our colleagues and what we have accomplished together, we've grown, innovated, and persevered. We launched and built MMA, expanded our capabilities in combination with JLT, and demonstrated resilience in the face of a financial crisis and global pandemic.\n\nWe emerged as a better and stronger firm by relying on each other, living our values, supporting our communities, and staying focused on clients. I have always believed the greatness of our companies is in how we deliver in the big moments and the small. Under John's leadership, I know Marsh McLennan will continue to thrive and prosper, making a difference in the moments that matter. There is no one I trust more with the company we have built together with the important work ahead.\n\nI'd like to thank our clients for choosing to do business with us, our shareholders for their continued confidence, and most importantly, our colleagues. All that we have achieved is due to their efforts. With that operator, we are ready to begin Q&A.\n\nOperator\n\nThank you. [Operator instructions] And our first question comes from the line of Elyse Greenspan with Wells Fargo.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nHi. Thanks. Good morning. First, on Dan, my congrats to you on your upcoming retirement.\n\nIt's been great working with you through the years. My first question is on US and Canada within RIS in the quarter, the growth did slow from where you guys have been trending. I know, we've had some good and bad quarters as we've gone through the pandemic and come out. Was there anything specific going on in the third quarter that you want to point out within that business?\n\nDan Glaser -- President and Chief Executive Officer\n\nThanks, Elyse, and I appreciate your comments so thank you very much. And I hope to keep in touch with you. So let me just start out. I'll hand it off to Martin in a second.\n\nObviously, Marsh's has been doing fantastically well in the US and Canada has done well as well. So I would just start by saying that the comparison was pretty tough at 16% growth in US and Canada last year. But, Martin, you want to dig in and give a little bit more color.\n\nMartin South -- President and Chief Executive Officer of Marsh\n\nThank you, Dan. Yes. Just to say that we are very pleased with the strong organic growth of 8% in the quarter, which is on top of 13% in the prior quarter of '21. Our Growth is strong across all the geographies and there was up 9%.\n\nAsia-Pac was 14%, LAC was up 15%, and 5% as you noted in the US. Overall good year-to-date growth of 9%. And while the 5% is a slowdown, it was 16% in Q3 of '21. When we look at the US over a longer period, the US and Canada are 8% year to date and 13% in the full year of '21.\n\nCanada is doing extremely well and the US growth last year in the back half of the year was an exceptional performance in M&A, SPAC, and capital markets activity. We don't see that repeating in the volatility of the markets going forward. We made fantastic investments last year in producers that are focused on recurring business. So we feel that we're very well positioned in the US going forward.\n\nDan Glaser -- President and Chief Executive Officer\n\nSo basically a lot of activity last year in M&A, particularly in the back half of last year, which is not repeating. And so that's a bit of a headwind, but overall, nothing concerning. Do you have a follow-up, Elyse?\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nYeah, thanks. My follow-up question is on the outlook for Guy Carpenter. You guys mentioned the loss that we saw from Hurricane Ian from what we've been hearing, it really has the potential to turn on the catastrophe reinsurance market significantly next year. So, what are you guys seeing there? And can you just, talk about how Guy Carpenter could benefit from, a pretty hard reinsurance market in 2023?\n\nDan Glaser -- President and Chief Executive Officer\n\nYeah. So why don't we start with John, just to talk a little bit about the overall market, primary, and reinsurance? And then, we'll go to Dean, but John.\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nSure. Thanks, Dan. So, Elyse, the insurance markets remain challenging in the third quarter for our clients. Prices continued to rise in the quarter, although moderating slightly overall from where we were in the second quarter.\n\nReinsurance markets, though, are a different, really different matter. The property cat market in particular was tightening in advance of the end. And then, as I noted in my prepared remarks, we're likely headed to a much more challenging January 1st reinsurance renewal. So with that, maybe I'll ask Dean to jump in on some of the details of what we're seeing in the market today.\n\nDean Klisura -- President and Chief Executive Officer of Guy Carpenter\n\nThanks, John. As we look forward, demand for our advice and solutions remains very strong. And we feel we're very well positioned to continue to create value for clients and grow our business moving forward. Demand for reinsurance, including cat properties, is expected to remain very strong as our clients manage volatility and continue to address systemic risk, including cyber in the impacts of climate change in the emerging perils we're seeing around the flood, wildfire, and convective storms around the world continue to accelerate and concern our clients.\n\nThe impact of Ian will certainly create challenging market conditions on January 1 in the property cat space. But as John noted, a tightening cat market could be a tailwind for Guy Carpenter. But we have a track record of strong growth in any market conditions.\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nTerrific, Dean, thanks. Martin, maybe you could talk a little bit about what we're starting to see in terms of the impact of Ian on the property markets Marsh operates in, and that is just broadly what's happening in pricing in the marketplace.\n\nMartin South -- President and Chief Executive Officer of Marsh\n\nYeah. Thanks, John. And we're in the -- into the 20th consecutive quarter of rate increases across the board and we'll be announcing a rate survey at the end in a couple of weeks' time. It'll show 6% year to date in quarterly results in the property area.\n\nNo question there's going to be a strain on the property market, particularly for clients that have high-cat exposures. We would have thought by now at this point in the cycle, after such consistent growth in property that we'd have started to see some easing off service is going to be true sadly for our clients going to the back end of the year. Across the Board, though, rates, so I'll just -- I'll give you some color on those, John. The composite rate is 6%, which is down a little bit from the last quarter.\n\nCasualty is up 4%. Still, as I mentioned, the property is 6%, and Finpro lines are down 1%. They were heavily weighted in the prior year and in the prior quarter from the SPACs and cyber. And we've broken out -- we will be breaking out cyber, especially this year, which is showing rate increases of 53%.\n\nAnd that's down a little bit from rate increases in the prior quarter, but still very strong rate increases. And some of the activity we've seen there is slowing down a little bit, but it's a healthy market. But of course, we're worried about our clients and as we said, we're going to be looking for solutions to find them. And we see that as a potential demand driver as well.\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nPerfect.\n\nDan Glaser -- President and Chief Executive Officer\n\nNext question, please.\n\nOperator\n\nThank you. Your next question comes from the line of Jimmy Bhullar with J.P. Morgan.\n\nJimmy Bhullar -- JPMorgan Chase and Company -- Analyst\n\nHey, good morning. I just had a question first on Oliver Wyman. I think there are concerns that if the economy slows down that a business that might be vulnerable, the slower organic growth. But you've obviously had very strong results for the last several quarters.\n\nIf you could talk about what you're seeing in terms of pipeline and just what your expectations are for the business?\n\nDan Glaser -- President and Chief Executive Officer\n\nSure. As we've mentioned before, Oliver Wyman and Mercer's career business are probably the most sensitive to the economic cycle, and it represents about 17% of our business. And both have been performing remarkably well over a long stretch of time. I mean, Mercer, as we mentioned earlier, Mercer's career is up 15%, and it's their sixth quarter of double-digit growth in a row.\n\nAnd Oliver Wyman has had seven quarters of double-digit growth in a row. So if there are clouds somewhere in the future, we're not seeing them right today. But Nick, you want to give us more on Oliver Wyman.\n\nNick Studer -- President and Chief Executive Officer of Oliver Wyman\n\nThank you, Jimmy. Yes, it is true that our market tends to prosper when the economy is healthy, but at the same time, when all the questions change, our clients need new answers. And I will say we're not seeing any reversal in our business. And our pipeline continues to be robust.\n\nAs Dean and Martin both mentioned, in the M&A and SPAC cycle, we have seen a slower pace in the businesses that thrive on M&A activity, and I suspect we won't be immune to some of the tough elements in the cycle. But our client offerings are less pro-cyclical than they were perhaps five years ago. We have a strong capability in risk management, a lot of work, and performance improvement, both top line and bottom line. We've established a restructuring practice so that it's actually been an incredibly tough environment for quite a few years now in several of the sectors we serve with the effects of the pandemic.\n\nSo for now, the pipeline remains strong.\n\nDan Glaser -- President and Chief Executive Officer\n\nYeah. And the other thing about it is that even though, the career business and Oliver Wyman are more sensitive, they actually bounce back a lot quicker post a downcycle. So, they're great businesses. We're glad we're in them.\n\nAnd overall, they provide us with leading growth over long stretches of time. And we're not overly concerned with short bursts. Do you have a follow-up, Jimmy?\n\nJimmy Bhullar -- JPMorgan Chase and Company -- Analyst\n\nYeah. Just on fiduciary investment income. It's up, I think around 10 times what it was a year ago and almost three times the sequential quarter. So obviously there's a benefit there from higher interest rates, but wondering if that's all it is? And should we assume that it goes up further as rates have gone even higher since the end of the quarter? Or was there any sort of discrete item that benefited the 3Q results?\n\nDan Glaser -- President and Chief Executive Officer\n\nWhile it's nice to say it was up 10 times. It started from a very -- but Mark, you want to talk about fiduciary income.\n\nMark McGivney -- Chief Financial Officer\n\nSure. Jimmy, there was nothing unusual one time in the results where, as you noted, we had $4 million a year ago in the third quarter it was 40 in this third quarter. And it just reflects the rise in global rates. There's definitely a source of upside for us.\n\nObviously, we have balanced all over the world and so we're dependent on rates moving in different jurisdictions, but there's just generally a trend up. And just remember, we've got over 10 billion of fiduciary balances on any given day. So 100 basis points equals $100 million in income.\n\nJimmy Bhullar -- JPMorgan Chase and Company -- Analyst\n\nNoted. And good luck, and congratulations.\n\nDan Glaser -- President and Chief Executive Officer\n\nThank you very much, Jimmy. Next question, please.\n\nOperator\n\nThank you. And our next question comes from the line of David Motemaden with Evercore ISI.\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nHi. Thanks. Good morning. And Dan, congrats on the retirement.\n\nIt's been quite a ride.\n\nDan Glaser -- President and Chief Executive Officer\n\nThank you.\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nSo congrats.\n\nDan Glaser -- President and Chief Executive Officer\n\nThanks, David.\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nJust had a question on the hiring activity that's been picking up. Obviously, the tough comp in the US just on the M&A side in Marsh makes it a little tough to see any impact. But I was just wondering if you could just comment on how much this quarter benefited from some of the strategic hires that you've made over the last year and a half, two years? And maybe give us a sense of how much that should ramp as we head into 2023.\n\nDan Glaser -- President and Chief Executive Officer\n\nSo why don't we start with John and maybe we'll go deeper? But, John, why don't you take that?\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nSure. Dan. David, we're very, very pleased. We continue to be just absolutely pleased with the start hiring that we did last year.\n\nNot only are they producing, but, we did a lot of work, as we were hiring these folks to make sure that they're the right cultural fit. And that's proven to be the case as well, so that. We started with world-class talent. We think the best talent in the markets that we serve.\n\nI mean, these folks have made us better. We serve our clients in teams and they fit in very, very nicely, have both Marsh and Guy Carpenter where we did most of the -- we did some of the hirings in Mercer as well. But Martin, maybe you could just talk about the productivity to be, of the hires.\n\nMartin South -- President and Chief Executive Officer of Marsh\n\nJohn, thank you. As you said, very, very happy with the investments that we made last year. The cultural accretion to us has been significant. They've brought new skills, and new insights to the firm and they've spread like wildfire.\n\nWe focus very heavily on investments in areas where we thought there was high recurring revenue growth. To the point, the question was, yes, we see these ramping up. Everything is penciling out exactly as we thought it would. In some areas, we actually had a plan.\n\nSo we continue to see this as a continuing add to our revenue, our growth, and our capabilities couldn't be happier. So, David, it's two to three years before they're, fully productive. But we couldn't be more pleased with the progress to date.\n\nDan Glaser -- President and Chief Executive Officer\n\nI don't want to sound like a Hollywood agent, but it is about talent. We're a people business. It's the smart, dedicated, dedicated creative people who attract other smart dedicated, and creative people. And so we've got a mountain of talent within the company, and we would continue to build upon that.\n\nDo you have a follow-up, David?\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nI do, yes. And just on the property cat market, on the reinsurance side, it sounds like that's spilling over a bit into cat-exposed primary. I'm wondering if you're seeing that at all starting to spill over into non-property lines at all or if you expect that to happen.\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nDavid, not at this point. And I would say I wouldn't expect that to happen. Of course, things haven't even yet begun to settle. So, is a lot for us to learn.\n\nBut, as I noted in my prepared comments, this is a major, major loss. And so, it will impact both the insurance and reinsurance markets, but principally in the property.\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nUnderstood. Thank you.\n\nDan Glaser -- President and Chief Executive Officer\n\nNext question, please.\n\nOperator\n\nThank you. And our next question comes from the line of Yaron Kinar with Jefferies.\n\nYaron Kinar -- Jefferies -- Analyst\n\nThank you very much. Good morning, everybody. And I also want to congratulate Dan on a phenomenal career and good luck in retirement. And good luck to John has a tough act to follow.\n\nI guess the first question, going back to the reinsurance market and the dislocation we're seeing in Florida and more broadly in property cat. So I think I understand the rate environment, but at the same time, we're also hearing about a dearth of capital, private reinsurance pulling out of the market, and maybe public markets looking to take on some of that bucket if you will. I guess how are you envisioning the supply issue and how much of an impact could that have on overall growth in the next year? And related to that, I would think that a lot of your colleagues have actually never experienced a real hard market, and certainly Guy Carpenter. So how are you preparing them to address this new environment?\n\nDan Glaser -- President and Chief Executive Officer\n\nYeah. That's a good series of questions and it's certainly something that's been at the executive team table as we think through how to serve clients in this kind of environment. We've been in tough markets before. But your basic point about supply and demand.\n\nYeah, demand will outstrip supply. It's already outstripping supply. So it's just an extent of how quickly the market can adapt to that. Dean, do you want to give us more?\n\nDean Klisura -- President and Chief Executive Officer of Guy Carpenter\n\nSure, maybe I'll give you a little more color. Thanks, Dan. As John noted earlier, Ian's impact on the already stretch property market could be significant. Prior to Ian, right, there seemed like there was increased demand from clients to absorb inflation and recent losses in the market.\n\nSo we're already starting to feel that one-one stress. And as John noted, following Ian, we're really starting to see the property cat market tighten, particularly in the US with potential supply imbalances in the marketplace. As you note, it's the third year in a row of $100 billion of cat losses in the market. And I would say it's going to be more.\n\nPotentially more than just rate increases for US cat-exposed clients, right? Increased retentions, changes in coverage in terms, reduced capacity from individual players, and also the impact from the retrocession market, which could be significantly impacted as well. Some are discussing 25% of the retrocession capital being trapped by Ian in the market and not replenished for January 1. So certainly, we've got some stresses there. However, I would say we're very working very closely with our clients, leveraging our deep expertise in the market to work closely with clients to deliver successful incomes.\n\nAnd we're getting new capacity in the marketplace. We've been working for several months with players around the world to bring more capital, and more interest into the cat market on behalf of our clients.\n\nDan Glaser -- President and Chief Executive Officer\n\nYeah, absolutely. And so, it's one of those things very tough markets. Really, in some ways, it's the period where Marsh McLennan shines the most, and so Guy Carpenter will do well. But in any time where there are supply and demand imbalances, you could have short-term pressures of something that's not being able to be placed because there are not enough capital providers willing to write a particular line of business.\n\nBut solutions will be found where we're actively working for our clients in that area. Any follow-up Yaron, although you asked about four questions. Give me another one, if you have one ready.\n\nYaron Kinar -- Jefferies -- Analyst\n\nYeah. I have one more, hopefully, shorter. Cyber, you mentioned very strong rate increases. I think that's also a continuation of a couple of years of strong rate improvement.\n\nThat said, my understanding is that in '22 is starting the loss experience is starting to moderate. How are you envisioning '23 as far as rate increases and maybe increased demand if the rate increases or is slower?\n\nDan Glaser -- President and Chief Executive Officer\n\nJohn?\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nYeah. Yaron, make it a forecast. The pricing environment for cyber price increases is moderating. I think you use the word improving, but I'm not sure our clients would at Marsh would consider it an improving rate environment with that rate on the rate.\n\nIt's been a difficult market. What I would also note about cyber, well, ransomware, it's to some extent, I think, reflective of the reduction in ransomware in recent quarters. Underwriters have also responded to ransomware through higher retentions, and lower limits, for example. Longer term, though, the cyber market is not near maturity.\n\nAnd so, we're still working to bring more capital to the market, and better solutions to the marketplace. But the cyber insurance market should be an area of growth for us for some time as we help our clients navigate the risks of a digital economy.\n\nDan Glaser -- President and Chief Executive Officer\n\nAbsolutely. Next question, please.\n\nOperator\n\nThank you. And our next question comes from the line of Meyer Shields with KBW.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. Good morning. And I want to add my congratulations to Dan. I remember where Marsh was when you first came on board.\n\nYou've done an absolutely phenomenal job.\n\nDan Glaser -- President and Chief Executive Officer\n\nI had your headline from November of 2007. What else could go wrong? A statement, not a question. That was on my bulletin board for about five years there.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nYeah. Anyhow, quick question. It's like I'm trying to decipher how much politics is real. There's a fair amount of opposition brewing in some parts of the country to ESG, and I'm wondering how that's impacting demand for ESG related consulting.\n\nDan Glaser -- President and Chief Executive Officer\n\nSure. Yeah, it's a great question. We're reading the same reports. Why don't we go first to Martine to talk a little bit about the Mercer investment side of the business and other areas of Mercer that are impacted or that make markets in ESG? And then we'll hand it over to Nick Studer as well.\n\nMartine?\n\nMartine Ferland -- President and Chief Executive Officer of Mercer\n\nYes, for. Sure. And thanks, Meyer, for the question. For us at the Mercer environmental and social and governance, actually, we can work with clients on all three fronts.\n\nLow carbon economy, the transition, sustainable investment. We help clients wherever they are, in their philosophy of investment, and their objectives, to look at the market and the best risk and reward. So our clients invest for the long run and they look at the risk element of their investment. And it's in with that lens that we're looking at the ESG factors with them.\n\nWe don't see that kind of demand and necessity to look at risk. I mean, all through the Q&A today, we have talked about climate risk, for example. So we need to figure out the factors in these risks. And when we look at investment and help our clients get the returns that they're looking for.\n\nOther elements, of course, CNI, those skills, minimum standards of benefit across the world, so we pay equity. We have a lot of work there where our clients are focused very much on building diverse workforces and the whole governance elements around it. We have the results from executive compensation to the way that they manage and govern their investment actually coming back to investment. It's been quite a rocky year on the capital markets this year, but we've been working with clients, and actually, we've been very busy on the maybe consulting side of the house, in particular, to help clients navigate that very intense headwind and volatility of capital markets.\n\nDan Glaser -- President and Chief Executive Officer\n\nThanks. Nick?\n\nNick Studer -- President and Chief Executive Officer of Oliver Wyman\n\nYes, I mean -- and Meyer, in Oliver Wyman, the main focus of the three would be around the climate transition. And I think that a backlash that you're seeing in some places is something we've expected for quite some time. There's a delicate balance to strike in the carbon transition between security, and affordability, and the transition itself. Ultimately, when many sectors are trying to reverse engineer 200 years since the industrial revolution in 20 years, they'll be actions which overshoot.\n\nThey'll be actions which take on greater resistance. But as it affects our business, climate sustainability practice is one of the fastest growing areas of Oliver Wyman. That's what we've made over the last three or four years, and it continues to grow in the very high double-digit. We're not seeing any reduction in demand.\n\nWe are seeing that the question is getting more [Inaudible].\n\nDan Glaser -- President and Chief Executive Officer\n\nYeah. Thank you. Any follow-up?\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nYeah, just a brief one. Maybe this is for Mark. I was hoping you could talk us through capital deployment plans as the cost of capital is reflected in the risk-free rate rise.\n\nMark McGivney -- Chief Financial Officer\n\nYeah. Meyer, I don't -- even though interest rates have come up and obviously the weighted average cost of capital for the firm has come up, as a result, we tend to value balance and consistency in our approaches and they've served as well over a long period of time. So even though things have got a little more expensive in economic terms, it isn't enough to make us change our fundamental views on capital allocation, capital structure, and things like that. When it comes to M&A, we've held our size -- ourselves to much higher return standards than our weighted average cost of capital consistently and will continue to do that.\n\nBut, I don't think there's anything about the current environment that makes us change our basic strategy.\n\nDan Glaser -- President and Chief Executive Officer\n\nOK. Next question, please.\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. OK. Thank you so much.\n\nDan Glaser -- President and Chief Executive Officer\n\nThanks. Take care.\n\nOperator\n\nThank you. Our next question comes from the line of Robert Cox with Goldman Sachs.\n\nRobert Cox -- Goldman Sachs -- Analyst\n\nHey, thanks for taking my question. So Latin America and Asia-Pacific have been particularly strong. I was wondering if we could get a little more color on what's driving that relative to the US. Is it higher inflation, higher pricing, market share gains, or anything? Any color on that would be great.\n\nDan Glaser -- President and Chief Executive Officer\n\nSure. Well, we'll dig in with Martin in a second. I mean, in general, what we've seen over really the last couple of decades is that you not only have regular higher levels of growth and a bit more inflation, sometimes over long stretches of time in places like Asia and Latin America. But you also have increased insurance penetration.\n\nAs the economy develops, insurance becomes the underpinning for development. And so that has always been a benefit to us as well. Martin, do you want to give us more?\n\nMartin South -- President and Chief Executive Officer of Marsh\n\nYes, thank you. And like I said, the last few years as well, and you've seen international has been slightly weaker than the US, that's rebounding and that's the balance thing that's so strong in our portfolio. So we're really pleased with the overall balance in our business. As Dan said, for the Asia Pacific, very strong growth of 14%.\n\nWe have a terrific franchise in Asia and the Pacific pretty well and unrivaled positions in almost all the markets there. So you could not buy what we have in that market. It's a mixture of -- in Japan's maturity in us having been there for such a long period of time and building trust with the local community and the carriers and doing more indigenous business and it's the protection gap that you see across Southeast Asia that's giving us share its strength in our benefits business across Asia. And the same for Latin America.\n\nWe have an unbelievable franchise. They're very strong businesses in all the big geographies and all the big markets in Latin America. There's some great strength there, but it's been relatively modest for a while. It's really a question of who is getting market share and strength and a terrific leadership team.\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nAnd Dan, I would add that JLT made us stronger in both regions as well, absolutely.\n\nDan Glaser -- President and Chief Executive Officer\n\nAny follow-up, Robert?\n\nRobert Cox -- Goldman Sachs -- Analyst\n\nYeah, I think that that's very helpful. And I just had a follow-up on Career. So, there's been some favorable trends in a Career driven by, some of the changing dynamics in the labor market. How sustainable are those trends if unemployment rises a couple of points, could you still see strong growth given those underlying changes or is that too optimistic?\n\nDan Glaser -- President and Chief Executive Officer\n\nMartine?\n\nMartine Ferland -- President and Chief Executive Officer of Mercer\n\nYes. Thank you for the question, Robert. No, it's a good question. There's no doubt that coming out of the pandemic, the world of work is completely changed and that has driven demand.\n\nBut you look at all that's currently playing out, where there is high inflation, it's a labor shortage, it's emerging new skills that we have to help clients gravitate to reorganizing the way that we work. We have talked before about the impact that recessions have had in the past on a Career Services business. There's also the Career Product business, about half and half of the revenue in that space. Career Product is actually more resilient through recessions.\n\nAnd career Services, given the fundamentals that we see in the market today. We currently don't see any slowdown. Clients are really needing help to navigate all of these changes. We're not immune to a change in economic pace, but we rebound quickly and we've carried through.\n\nSo, so far, so good.\n\nDan Glaser -- President and Chief Executive Officer\n\nThank you. Next question, please.\n\nOperator\n\nThank you. And our next question comes from the line of Brian Meredith with UBS.\n\nBrian Meredith -- UBS -- Analyst\n\nYes, thanks. And also just want to congratulate Dan, and I want to echo Meyer's comments. It's an absolute pleasure watching you lead this organization for the last decade. Question for you first, M&A.\n\nWhat does the pipeline looks like right now? And particularly as we kind of look at M&A here with private equity, maybe cooling off a little bit here, becoming a little more challenging. Are you seeing a better pipeline here? And, I'm assuming that John wants to outdo you on JLT here pretty quickly.\n\nDan Glaser -- President and Chief Executive Officer\n\nYeah. Looking at his chops over there. The M&A pipeline is good, as we've said a few times before, in the past, we cultivate relationships over long stretches of time. We're less interested in the call from a banker saying, hey, something's going to market, We're inviting ten people, and you want to participate.\n\nAnd so for us, pipeline development and meeting as a core executive team on a regular cadence to review the pipeline and talk to potential prospects in the future. That's just a part of how we go about the business. As, we favor building our business through acquisition over share repurchase, but they sort of go in tandem when we have a lighter year and in M&A will have more share repurchases sort of like this year when we have a heavier year in M&A. We'd have less share repurchase because our dividend comes first and is sacrosanct.\n\nSo when we look at the pipeline, the pipeline is good. Where we have a transaction that we've mentioned to you before and BT Westpac, which won't close until next year. But still, when we're thinking about the utilization of our capital, we're pretty much thinking that is kind of as well as part this year and partly next year, regardless of when the cash goes out the door. And as we've sort of averaged if you exclude JLT, we've sort of averaged about $1 billion a year on acquisitions and that's likely to continue.\n\nBrian Meredith -- UBS -- Analyst\n\nMake sense. Thanks. And then a quick follow here from Mark. Mark, any initial kind of thoughts on what the net benefit from pension could look like in 2023 given the big rise we've seen [Audio gap] in interest rates?\n\nMark McGivney -- Chief Financial Officer\n\nBrian, it's just really too early to tell which so much goes into that in that calculation of the other net benefit credits. Really not until we see with Mercer's great help, of course, the outlook for expected returns in our year-end valuation that we really formulate a view on that. So I think when we -- we're back together in January, I'll have a perspective then.\n\nBrian Meredith -- UBS -- Analyst\n\nGreat. Thank you.\n\nDan Glaser -- President and Chief Executive Officer\n\nThank you. Take care. Next question, please.\n\nOperator\n\nThank you. And our next question comes from the line of Michael Phillips with Morgan Stanley.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nThanks. Good morning. First question. So back on the theme of property cat reinsurance, guys, how much of real risk is it then that some business just simply is not going to get placed at the beginning of the year? And then, how the material could that be?\n\nDan Glaser -- President and Chief Executive Officer\n\nJohn, do you want to start with that?\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nYeah. Mike, happy to jump back in on this again. It's still quite early. And so, I think most reinsurers and insurers are planning.\n\nAnd trying to decide how to best deploy capital going forward. As Dean, Dan, and I've all discussed, we expect some level of disruption. It's going to be a challenging market. But again, we're using the capabilities of our entire firm to bring solutions to the market, data and analytics, new investors, and new facilities.\n\nAnd in some cases, it may mean clients retaining more risk, both insurers, but also our retail clients as well. And we're the global leader in managing captives, on behalf of our clients and so it's an example. Now, some of our clients may be pushed by the market to do that and some may choose, just given, what might be elevated pricing, may more elect themselves to retain more risk. So we're going to work with them to help all of our clients accomplish their risk management goals.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nOK. Thank you. And then, as you said, the property cat market was certainly hardening a bit before Ian, I think, we were hearing kind of low single-digit or -- I'm sorry, double-digit, but now we're hearing pretty massive increases. The question is that strict -- are those levels that we're hearing pick a number 30%, 40%, 50%? I don't care about the number.\n\nBut is that strictly just Florida or do you see such levels as well outside of Florida, around the world?\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nWell, Mike, I think what you've seen over the last several years is cat losses have exceeded modeled estimates. So, the market is underpriced. Insurers and reinsurers broadly, underpriced the risk over that period of time, right? You can look at it, for an extended period of time, and of course, get different outcomes. So, the market is reacting to that.\n\nSo you've also had an escalation of values that's happened in many cat-exposed markets as well. And then, broadly speaking, inflation creates some challenges. So, as I noted in my prepared remarks, we're heading to meaningful rate change prior to Ian, in the 20%, 25% plus range to cover inflation and against just the elevated weather-related events of the last several years. Now, it's likely to, of course, be, be higher than that.\n\nAnd so, in talking to reinsurers and insurers, they're thinking about it again, about how to best deploy their capital. They're in the business of taking these risks. And that will ultimately make choices about, where to best deploy that capital. And, what they're saying today is they want to reserve it for their best clients.\n\nOn the reinsurance side, that might mean clients that they also support them in casualty and other lines, as an example. And so, instead of it thinking about Marsh for a second, it's an interesting market. We have a high net worth, and personal lines support inside of M&A, important business to us. This loss is going to be more of a small business and personal line loss.\n\nSo it won't impact our major accounts really as much as other events had.\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nOK. Thank you for the color. Appreciate it.\n\nDan Glaser -- President and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Your next question comes from the line of Ryan Tunis with Autonomous Research.\n\nRyan Tunis -- Autonomous Research -- Analyst\n\nOK, Thanks. Good morning. Just a follow-up on the fiduciary investment income. So we've had a number of years of really strong margin expansion.\n\nWhere that hasn't played a role at all. Is it right, I think about this right, that, this should be kind of a separate and distinct margin tailwind on top of the type of margin expansion that we've seen over the past decade? Or is there investment potentially against some of that investment income?\n\nDan Glaser -- President and Chief Executive Officer\n\nI mean, you're basically right in that fiduciary income. We didn't have a lot of it, dropped to the bottom line. So a lot of it is profit and that will help margins in the future.\n\nRyan Tunis -- Autonomous Research -- Analyst\n\nPerfect. And then I'll follow up, I guess for Martine. Just in wealth, is there -- any way you can quantify with markets rolling over the type of impact that's having on organic growth?\n\nDan Glaser -- President and Chief Executive Officer\n\nPlease.\n\nMartine Ferland -- President and Chief Executive Officer of Mercer\n\nYes. No, thanks, Ryan. It has an impact, which we commented on it, and as you can imagine, it's what we call our OCIO business where we are paid at this point for the assets under management. It has been a very good business for us.\n\nIt's been growing rapidly, but it is exposed to short-term volatility from capital markets. And based on the market value that we see at the end of Q3, we do expect a drag from capital markets to continue in the fourth quarter, as a reference, and I think we alluded to that in our script. In Q3, this has cost us about two points of margin at Mercer, and four points on Wealth.\n\nDan Glaser -- President and Chief Executive Officer\n\nTop line -- yeah, yeah, of revenue.\n\nMartine Ferland -- President and Chief Executive Officer of Mercer\n\nRevenue, exactly.\n\nDan Glaser -- President and Chief Executive Officer\n\nSo Mercer would have been more like a seven instead of a five -- four.\n\nMartine Ferland -- President and Chief Executive Officer of Mercer\n\nYes. And, we had 15% in Career and 10% in Health rounding this up. And also it does help us on the DB consulting side where we consult with clients when there's such an impact on the capital markets. Our portfolio is diversified, so that helps.\n\nWe had also a great [Inaudible] coming to our funds which will impact here like we do [Inaudible].\n\nDan Glaser -- President and Chief Executive Officer\n\nOK. And so it's a terrific business, Ryan, as we noted, the assets under delegated management are down about 20% year over year. But having said that, if you look over the decade, over a decade, the CAGR on assets under delegated management is about 20% number on a CAGR. So it's a great business.\n\nWe're glad we're in it, but obviously, it's a headwind in the short term. Hopefully in the short term.\n\nOperator\n\nThank you. I would now like to turn the call back over to Dan Glaser, president, and CEO of Marsh McLennan, for any closing remarks.\n\nDan Glaser -- President and Chief Executive Officer\n\nThank you. And thank you for joining us on the call this morning. I want to thank our 86,000 colleagues for their commitment, hard work, and dedication to Marsh McLennan. And from the bottom of my heart, thank you for the trust you have put in me.\n\nServing as CEO of Marsh McLennan has been an honor. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDan Glaser -- President and Chief Executive Officer\n\nJohn Doyle -- Group President and Chief Operations Officer\n\nMark McGivney -- Chief Financial Officer\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nMartin South -- President and Chief Executive Officer of Marsh\n\nDean Klisura -- President and Chief Executive Officer of Guy Carpenter\n\nJimmy Bhullar -- JPMorgan Chase and Company -- Analyst\n\nNick Studer -- President and Chief Executive Officer of Oliver Wyman\n\nDavid Motemaden -- Evercore ISI -- Analyst\n\nYaron Kinar -- Jefferies -- Analyst\n\nMeyer Shields -- Keefe, Bruyette and Woods -- Analyst\n\nMartine Ferland -- President and Chief Executive Officer of Mercer\n\nRobert Cox -- Goldman Sachs -- Analyst\n\nBrian Meredith -- UBS -- Analyst\n\nMichael Phillips -- Morgan Stanley -- Analyst\n\nRyan Tunis -- Autonomous Research -- Analyst\n\nMore MMC analysis\n\nAll earnings call transcripts"
}