{
  "companyName": "The Cooper Companies",
  "companyTicker": "COO",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/the-cooper-companies-coo-q3-2022-earnings-call-tra/",
  "content": "The Cooper Companies (COO -1.11%)\nQ3 2022 Earnings Call\nAug 31, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to Cooper Company's third quarter 2022 earnings conference call. [Operator instructions] I would now like to hand the conference over to your speaker Kim Duncan, vice president, investor relations and risk management. You may begin.\n\nKim Duncan -- Vice President, Investor Relations and Risk Management\n\nGood afternoon, and welcome to the Cooper Companies third quarter 2022 earnings conference call. During today's call, we will discuss the results and guidance included in the earnings release and then use the remaining time for questions. Our presenters on today's call are Al White, president and chief executive officer, and Brian Andrews, chief financial officer and treasurer. Before we begin, I'd like to remind you that this conference call contains forward-looking statements, including all revenue and earnings per share guidance and other statements regarding anticipated results of operation, the market or regulatory conditions or trends, product launches, operational initiatives, regulatory submissions, and closing or integration of any acquisitions or their anticipated benefits.\n\nForward-looking statements depend on assumptions, data or methods that may be incorrect or imprecise and are subject to risks and uncertainties. Events that could cause our actual results and future actions of the company to differ materially from those described in forward-looking statements, are set forth under the caption forward-looking statements in today's earnings release and are described in our SEC filings, including Cooper's Form 10-K and Form 10-Q filings, all of which are available on our website at coopercos.com. Also, as a reminder, the non-GAAP financial information we will provide on this call is provided as a supplement to our GAAP information. We encourage you to consider our results under GAAP, as well as non-GAAP and refer to the reconciliations provided in our earnings release, which is available on the investor relations section of our website under quarterly results.\n\nShould you have any additional questions following the call, please email ir@cooperco.com. And now, I'll turn the call over to Al for his opening remarks.\n\nAl White -- President and Chief Executive Officer\n\nThank you, Kim, and welcome, everyone, to Cooper Company's third quarter conference call. Let me start by highlighting that this was the sixth consecutive quarter of double-digit organic revenue growth for CooperVision and the seventh consecutive quarter of double-digit organic revenue for CooperSurgical's fertility business. This impressive performance showcases the strength of our teams and the strong demand for our products and services. This momentum continued in August, and we're increasing the organic revenue guidance for both CooperVision and CooperSurgical, incorporating our strong Q3 and the strength we're continuing to see.\n\nOverall, the challenging macro environment, including headwinds from currency, inflation and supply chain challenges has negatively impacted profitability, but has not reduced our ability to take share and drive sustainable top line growth. Moving to the third quarter results. Consolidated revenues reached an all-time high of $843 million, with CooperVision posting record revenues of $566 million, up 11% organically and CooperSurgical posting record revenues of $277 million, up 35% as reported, up 3% organically. Growth was led by our Daily Silicone hydrogel portfolio and myopia management products for CooperVision and fertility for CooperSurgical.\n\nNon-GAAP earnings per share were $3.19 and we posted record quarterly free cash flow of $217 million. For CooperVision and reporting all percentages on an organic basis, revenue growth was strong and diversified in all product categories, spheres, torics and multifocals and within all three geographic regions. The Americas was up 7%, EMEA grew 15% and Asia Pac grew 11%. This performance was driven by a number of factors, including new product launches, expanded product ranges market-leading flexibility through our customized offerings, growth in key accounts and strength of branded products.\n\nRegarding product details, daily silicone hydrogel lenses grew 24%, led by great results from both MyDay and clariti. Daily silicones continue to be the main driver of growth for the contact lens industry, and we offer the broadest portfolio in the market with MyDay and clariti available on a broad range of spheres, torics and multifocals. Within this, we're continuing to see especially strong growth from MyDay, including from the very successful rollout of the MyDay multifocal which is taking share in markets around the world. The feedback from patients remains fantastic, and optometrists continue reporting that our breakthrough binocular progressive fitting system is allowing them to fit the lens quickly and accurately.\n\nThis success is driving a positive halo effect on MyDay spheres and torics, and we remain very optimistic about the future of this brand. Clariti also posted a solid quarter with particular strength noted in Asia Pac. And our silicone hydrogel FRP lenses, Biofinity and Avaira, reported another solid quarter of 8% growth. Regarding product launches, we remain very active.\n\nI'm excited to announce, we'll be seeding the market with MyDay Energys over the next several months with a full launch scheduled for early calendar 2023. We've had a lot of requests for the Energys technology in a daily lens and given the success we've had with Biofinity Energys. We're really excited about this opportunity. MyDay Energys will use the same digital zone optics technology as Biofinity Energys providing wearers greater comfort when using digital devices, along with enhanced end-of-day comfort.\n\nThis daily lens is a perfect product for today's digital world and another great example of CooperVision leading with innovation and manufacturing know-how. And building on this, we'll also be launching an expanded MyDay toric parameter range in early fiscal 2023. MyDay already offers the most prescription options in the daily toric market, and this expansion will essentially match the leading offerings in the FRP toric segment, which will be a first for the contact lens industry. All this activity supports a fantastic MyDay brand and exemplifies CooperVision's focus on offering practitioners a wide variety of market-leading technologically superior products.\n\nMeanwhile, we're expanding availability of clariti around the world, which will further strengthen relationships with customers using store brands. And I'm also happy to report that we've recently increased production of Biofinity, including made-to-order extended range torics and Biofinity toric multifocals. Demand continues to exceed supply on these products, which has caused supply disruptions, so adding capacity is great news. Overall, these products and technologies improve how eye care professionals deliver clinical care, and it's allowing us to lead into finding standard of care, a core component of our ongoing share gains.\n\nMoving to myopia management. Another exciting area where we're a market leader. We posted revenues of $24 million, up 42%, including MiSight up 109%. Our growth trajectory remains strong with the main challenge being in China, where all contact lens sales, including MiSight and Ortho-K products have experienced difficulties due to ongoing COVID restrictions.\n\nOutside of China, MiSight is performing really well, backed by its extensive seven-year clinical data and FDA approval, and we're seeing strength with key accounts and private practitioners around the world. We're also seeing a positive halo effect with customers selling MiSight accelerating their use of other CooperVision lenses. For SightGlass myopia management glasses, our JV relationship with EssilorLuxottica is going well, and the team continues to make progress. In the U.S., we're finalizing the submission of the three-year clinical data and expect to submit it to the FDA in September.\n\nAs a reminder, the only FDA-approved myopia management product on the market in the U.S. is MiSight, so obtaining approval for glasses has the potential to really propel the myopia management field forward. To finish on CooperVision, the contact lens market continues to perform exceptionally well with estimated growth of 8% in calendar Q2. Although COVID-related challenges remain, including here in the U.S., where back-to-school eye exam demand is exceeding exam capacity, the many long-term growth drivers of the industry remain intact.\n\nThis starts with a large macro growth trend that roughly one-third of the world is myopic today, and that is expected to increase to 50% by 2050. This is driving heightened screen time, among other factors. Additionally, the shift to silicone hydrogel dailies remains strong, the penetration of higher-value products such as torics and multifocals is growing. The number of wearers is growing, and we're seeing price increases.\n\nWe expect global growth to remain healthy and believe we'll remain a leader with our robust product portfolio, ongoing product launches, fast-growing myopia management business and leading New Fit data. And speaking of data, I'm proud to say Counter Q2 U.S. stats showed CooperVision was the  No. 1 company for new wearers and the only manufacturer to grow share in all three daily categories, spheres, torics and multifocals.\n\nMoving to CooperSurgical. We posted a solid quarter led by fertility, which reported sales of $112 million, up 13% organically. As I mentioned earlier, this was the seventh consecutive quarter of double-digit organic growth, so a big congratulations to that team. Success was seen throughout the product portfolio and around the world with particular strength noted in consumables with products like media, for pets, needles and catheters doing well.\n\nConsumables are a core part of our fertility business and an excellent indicator of future growth. So we remain in great shape to continue delivering strong results. Regarding the broader fertility market, the fundaments behind the industry's growth remained very healthy. There are many drivers, but women delaying childbirth is the primary factor as fertility challenges start increasing around the age of 30 with a more pronounced negative impact starting at 35.\n\nIt's now estimated that roughly 15% of reproductive age couples worldwide have fertility challenges and over 750,000 babies are born annually through fertility assisted measures, and these numbers are growing. Regarding CooperSurgical's positioning, we estimate the portion of the market we compete in is roughly $2 billion in annual sales, and that it will grow in the 5% to 10% range for many years to come. In addition to increasing maternal age, other drivers include improving access to treatment, increasing patient awareness, growth in the number of fertility clinics, improved product offerings such as donor activity and cryopreservation services and technology improvements for both male and female and fertility challenges. Given the momentum of the industry and the diversity of factors driving growth, fertility is certainly an exciting market to be in.\n\nMoving to office and surgical products, which includes OB/GYN medical devices, PARAGARD and stem cell storage. We posted sales of $165 million, up 36%, but down 3% organically. OB/GYN medical device sales were negatively impacted by heightened back orders due to supply chain challenges. We've seen good demand and positive signs in our supply chain to start this quarter, so we expect healthy growth in fiscal Q4.\n\nPARAGARD is down 7% as expected due to a difficult comp with last year's price increase and related buying activity, but we expect nice growth in Q4 with an easier comp improving patient flow and an increasing patient focus on the most efficacious forms of birth control, including 99% effective IUDs such as PARAGARD. Lastly, our stem cell storage business that we entered with the Generate acquisition this past December grew 1%. This was in line with expectations against the difficult comp from prior to our purchase of the business. To wrap up on CooperSurgical, fertility remains strong.\n\nThe other parts of the business are making progress, and the integration activity is going well. We expect a strong finish to this year and believe we're in an excellent position to deliver long-term mid-single-digit growth. To conclude, we operate in recession-resistant industries with strong macro growth trends but we're not immune to supply chain challenges and currency is having a material impact on our as-reported results. Having said that, our core business fundamentals are excellent.\n\nWe're taking market share. We're leveraging where we can, we're taking price. We'll remain extremely focused on the challenges facing us and will be proactive and we will proactively manage operations while maintaining a focus on delivering long-term shareholder value. And with that, I'll turn the call over to Brian to discuss financial results and guidance.\n\nBrian Andrews -- Chief Financial Officer and Treasurer\n\nThank you, Al, and good afternoon, everyone. Most of my commentary will be on a non-GAAP basis, so please refer to our earnings release for a reconciliation of GAAP to non-GAAP results. Third quarter consolidated revenues were $843 million, up 10% or up 9% organically. Consolidated gross margin was 66.1%, down 220 basis points from last year, driven primarily by currency.\n\nOperating expenses grew 13% and were 42.7% of revenues, primarily as a result of the acquisition of Generate Life Sciences. Consolidated operating margin was 23.4%, within these results, currency is having a significant impact -- negative impact along with supply chain and inflationary pressures. We raised prices to offset some of this and have additional price increases coming, and we'll continue to work diligently controlling costs. Moving below the line, interest expense significantly increased year over year to $17 million, with higher rates and debt balances driving a large year-over-year increase.\n\nThe effective tax rate was 10.2% and non-GAAP EPS was $3.19, with roughly 49.6 million average shares outstanding. Year-over-year FX negatively impacted earnings by $0.67 in the quarter, which was $0.10 worse than we forecasted at the time of our last earnings call. As with last quarter, a large part of the $0.10 was attributable to the remeasurement of foreign currency-based intercompany trade receivables, which are recognized in other income and expense. In order to reduce this variability moving forward, we've made moves, including closing out certain nonfunctional exposures and improving our natural and synthetic hedge positions.\n\nMoving forward, we believe these efforts will do a better job mitigating the impact of FX gains or losses that occur below the operating income line. Returning to the quarter. Free cash flow was extremely strong at $217 million, and we decreased net debt by $218 million to $2.64 billion. This reduced leverage to 2.44 times, which lowered the borrowing rate on our long-term credit facility pricing grid by 25 basis points.\n\nAs a reminder, $1 billion of our debt is fixed to 2025 with the remaining amount floating. Moving to guidance. We are increasing the full year organic revenue growth ranges for CooperVision and CooperSurgical to include our strong Q3 results, and the strength we're seeing as we enter fiscal Q4. For EPS, we're updating guidance to reflect the negative impact of currency and interest rates, offset slightly by better operational performance.\n\nSpecific to fiscal Q4, the consolidated revenue guidance range is $830 million to $850 million, up 9% to 11% organically, with CooperVision revenues of $554 million to $565 million, up 8% to 10% organically, and CooperSurgical revenues of $276 million to $285 million, up 10% to 15% organically. Non-GAAP EPS is expected to be in the range of $3.05 to $3.20 based on a roughly 13.5% effective tax rate and roughly $22 million of interest expense, which includes an assumption for a 75 basis point increase in September. Regarding currency, we're now forecasting the year-over-year negative impact in Q4 to be roughly 8% headwind to revenues and a 20% headwind to EPS. For fiscal 2023, we won't be providing detailed guidance, but let me provide some high-level direction.\n\nAssuming currency rates remain similar to where they are today, interest expense increases to around $85 million due to multiple rate hikes. Our effective tax rate increases to roughly 15%, and the macroeconomic environment remains challenging. We expect to report low single-digit year-over-year non-GAAP EPS growth. These expectations do not include the pending acquisition of Cook Medical's reproductive health business.\n\nLastly, as it relates to our pending acquisition of Cook, that transaction is still pending regulatory approval. We are currently exploring different options to close the transaction, including the potential sale of certain Cook assets in the U.S. and abroad. Given the process and necessary approvals, the timeline is tough to estimate, but we're hoping to close the transaction by June 30, 2023.\n\nAnd with that, I'll hand it back to the operator for questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Jason Bednar with Piper Sandler. Your line is open.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nHey, good afternoon. Thanks for taking the questions. Congrats on the strong organic growth here in the period. Maybe picking up on the real-time commentary you provided there, Al.\n\nYou mentioned strong growth for the business continuing into August. Just wanted to check, are you suggesting CVI and fertility both continue to grow at a double-digit pace? And then you also suggested contact lens demand is exceeding capacity with respect to office visits. It's a fortunate problem, but do you have a sense -- is this a function of staffing shortages or is demand around back-to-school simply really strong and above what's normal for the season?\n\nAl White -- President and Chief Executive Officer\n\nYes. On that second one, the back-to-school demand is strong. We've definitely seen an increase on that. And there's some commentary of other people.\n\nI think National Vision talked about it on their call. It comes down to staffing shortages and really strong demand. So that's putting pressure on the optometry community, whether it's retailers or independent optometrists to meet all that demand. So that's a challenge right now.\n\nIt's a \"good challenge\", right, but it's still a challenge that the industry needs to work through over the coming months. With respect to August, I won't give numbers on August, but yes, CooperVision and CooperSurgical, including fertility, are both having good August.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nAll right. That's helpful. And I hear the commentary on MiSight in China just probably got off to a little bit slower start with the lockdowns there. But now that you're into July and August, things around med tech seem to have started to recover in China.\n\nI mean, can you talk about uptake of the lens in that market compared to other regions where MiSight's been available? Are you seeing the sales and education process relatively shorter in that market? Just would love any color there.\n\nAl White -- President and Chief Executive Officer\n\nYes. So we have seen an uptick, if you will, in MiSight in of August, certainly and including in China, where we've seen things loosen a little bit there. So positive news on that. The uptake of that product and success of that product is moving faster than we've seen in most other markets around the world.\n\nSo certainly positive signs there and fingers crossed, we're now on a better path, right? Because is that's really the thing that impacted our numbers. It's really been China that's, I don't know, 99% or 100% of what's impacted those numbers.\n\nJason Bednar -- Piper Sandler -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Larry Biegelsen with Wells Fargo. Your line is open.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nGood afternoon. Thanks for taking the question. And Brian, thanks so much for the color on fiscal 2023. Maybe if I could ask about maybe some of the other assumptions embedded in the low single-digit year-over-year non-GAAP EPS growth.\n\nUnderlying organic sales growth, do you think -- should we think about that in line with historical 6% to 8% growth, organic growth for Cooper or do you think you can do better? And currency, Brian, I think I heard you talk about interest expense, but currency right now, we think it's about 3% headwind to sales, $0.80 to EPS, any color on those two? And I'll add one follow-up.\n\nBrian Andrews -- Chief Financial Officer and Treasurer\n\nLarry, thanks for the questions. Obviously, you've followed us for a very long time, you know our story really well. Long term, we've got -- right now, we've got all the economic environment that makes it really challenging to provide specific guidance into the P&L this far in advance. We've decided to give a few elements today just to calibrate some people on a few important pieces.\n\nAgain, I think we want to reiterate that the core fundamentals of our business remain strong. We're raising prices, we're growing share, and we're diligently controlling costs and to leverage where we can. Obviously, long term, we want to drive mid to single high -- mid to high-single-digit revenue growth and leverage the P&L to grow EPS to low double digits. But right now, it's just too hard to say, and we're just -- we're not going to go there.\n\nthis early in the year to talk about next year. So I appreciate the questions, Larry, but we'll update that in December.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nUnderstood. And Al, on SightGlass, and first of all, I didn't hear you reiterate the $90 million to $100 million for myopia management this year, but it looks achievable based on the $24 million you did in Q3 here, just want to confirm that? And for SightGlass approval in the U.S., what's your confidence here by calendar year-end 2022. Did you hit FDA's goals for axial length and myopia progression?\n\nAl White -- President and Chief Executive Officer\n\nYes. I think on myopia management globally, we'll probably end up in the $90 million $95 million range. And the only reason we're not -- well, two reasons. I mean, -- but the primary reason we're not at $100 million or a little over $100 million ends up being currency.\n\nThe other one would be obviously, China moving a little bit slower. So I wouldn't take it completely off the table, but I'd probably say $90 million, $95 million is probably a better number that we'll settle in. On SightGlass, I won't get into too many specific details on it, but I will say that we're submitting that data and looking forward to talking to the FDA on that and believe we have certainly a reasonable good chance to get approval by calendar year-end.\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Chris Cooley with Stephens.\n\nChris Cooley -- Stephens Inc. -- Analyst\n\nGood afternoon and thanks for taking the questions. Congrats on the strong organic growth. Just maybe two quick ones for me. First, when we just think about the new product cadence, the expansion of the MyDay portfolio.\n\nCould you give us a little bit more color about when that will start to roll out, just to make sure I have that understanding correctly? And then on the surgical side, may be wrong here, but I mean off of the fiscal 2Q, I thought we were going to expect a little bit stronger organic growth on the opposite side with the equipment, it looks like that's still a little bit more supply chain constrained. Could you give us some color about what gives you confidence that that improves as you go into the fiscal year-end?\n\nAl White -- President and Chief Executive Officer\n\nSure. Good questions, Chris. And you can see in the guidance we gave for CooperSurgical that were kind of in that 10% to 15% organic growth range for CooperSurgical in fiscal Q4. So expecting a really strong quarter.\n\nWe did have some stuff in Q3 because supply chains move itself into fiscal Q4. As I mentioned, we started off with a good quarter within both businesses, but within CooperSurgical to support that kind of guidance range. So anything that maybe you were thinking, hey, it's going to be a touch stronger in Q3, you're going to end up, I think, seeing in Q4 because I would imagine those kind of guidance expectations are a little bit above yours or most people's expectations for Q4. If we look at CooperVision, yes, the organic growth is really strong there.\n\nThe businesses is doing really well. That team is putting up some impressive results, and that's continuing. I think people underestimate the power of our portfolio, the breadth of our portfolio, the strength of our sales and marketing teams and the amount of new products that we're launching, right? And whether that's a parameter expansion or a new product itself, we're very active and we've been very successful in a lot of segments, and that's going to continue, as I mentioned. As we roll into this next fiscal year, we'll be expanding the parameter range of MyDay again.\n\nIt's already market-leading today. It's going to be even better. up where kind of Biofinity is. So MyDay is kind of turning into a Biofinity daily, if you will, kind of success story, which is just awesome, amazing.\n\nAnd when you think about Energys, I mean, I'm really excited about that. We launched Biofinity Energys. It did really well for itself. The demand around the Energys technology on a daily SiHy has been really strong.\n\nWe've had to ramp up production considerably within MyDay to be able to do that. The manufacturing team has done a killer job to get us where we're at today. So we have that product. We're going to start seeding the market here in the next couple of months and look forward to getting that launch in early next year.\n\nAnd all that activity, along with the other stuff I mentioned, Biofinity and the things like Biofinity toric multifocal and extended ranges and so forth are all going to continue to support what I believe is going to be stronger than people are probably expecting organic revenue growth.\n\nChris Cooley -- Stephens Inc. -- Analyst\n\nThank you. Appreciate the question.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Jon Block with Stifel. Your line is open.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nGreat, guys, thanks for taking me in. Brian, maybe I'll start with you and just the EPS, fiscal '23 EPS stepping down by roughly $0.40. I'm not sure if I missed it, but can you bridge the different components, clearly, FX hit you, the interest rate coming above what you guys laid out last quarter. So maybe just walk us through the headwinds from FX and interest rate? You mentioned a little bit on supply chain as well.\n\nAnd then, maybe what the offset was from better-than-expected -- sorry, there's a lot of noise, better than expected operational growth as the organic came up by roughly 100 bps?\n\nBrian Andrews -- Chief Financial Officer and Treasurer\n\nYes, sure. John, so prior to guidance midpoint was the $3.19. I gave the FX unfavorability versus last guidance in my prepared remarks of $0.10. The Q4 FX unfavorability is a 20% headwind to Q4.\n\nInterest expense is -- it went up because of the Fed increases.\n\nAl White -- President and Chief Executive Officer\n\nJohn, were you asking about Q4? I thought you were asking about 2023.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nNo, I'm sorry. I'm only asking -- just to be clear, on fiscal '22, like where we -- let me just sort of make up some numbers. I mean, did relative to when you last guided on the second quarter conference call, what if FX and interest rates take you down more by $0.20, if you go down by $0.50 on FX and interest rates and then make back $0.10, I'm just taking that investment off the bridge to get there?\n\nBrian Andrews -- Chief Financial Officer and Treasurer\n\nSo on the full year?\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nCorrect.\n\nBrian Andrews -- Chief Financial Officer and Treasurer\n\nOK. OK. OK. Yes.\n\nSo just starting with FX. I mean, I talked last quarter about the FX headwind to revenues for the full year being 5%, it's now 6%. The headwind to EPS flat -- last quarter was 14%. It's now 17%.\n\nAs it relates to interest expense, casted a 50-50 25, and it was 75-75, but now we're saying 75 again in September, that's about $0.05 right there. So your -- we've adjusted our guidance primarily tied to just FX and interest expense and some -- a slight operational improvement which gets you to that midpoint of $12.80.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nOK. I think I'm there. And then, Al, maybe a longer one for you, but since you rolled out the CVI organic growth again. Can you give us on the drivers? Is it new fits? It seems like it's certainly some incremental price.\n\nWhen do we think about price in fiscal '23, does that have to step back down in relative to '22? And then one last one on MiSight. We just picked up some chatter that you might have rolled out a rebate program recently, is that correct? And if so, was it just a year one rebate or newer, or is that a year two, year three?\n\nAl White -- President and Chief Executive Officer\n\nYes. On MiSight, Jon, I think what you're probably referring to is back-to-school promotional activity. So yes, I think the back-to-school demand has been very strong, and we've seen that demand on the optometry community. As part of that, we were running or are running promotional activity from my side.\n\nSo I'm pretty confident that's what you're probably seeing out there. If we look at price, yes, we took price earlier this year and then we took price again this summer. We're looking at additional price increases right now and in the next year. So I think if everything holds as it is with the economy and inflationary pressures and so forth, you'll see incremental price increases from us.\n\n2023 should still be a good growth year for us. We still have a lot of the underlying factors that are driving growth of the entire marketplace and our growth continuing. Now, we're gaining wearers. So when you look at the FIT data, as I mentioned, we're just doing really well.\n\nWe're No. 1 on Fit data. So when it comes to winning the new wearers coming in and winning the New Fits, we're doing really well in that space. And I think that as we continue to roll products out and launch some of these new products and improve availability of products, we'll continue to do well from a New Fit perspective.\n\nAnd when you combine that with some price, I think you end up with another pretty good year next year, frankly, for the entire marketplace and us included.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nHelpful. Thanks, guys.\n\nOperator\n\nThank you. Please stand by for our next question. [Operator instructions] Our next question comes from the line of Joanne Wuensch with Citi. Your line is open.\n\nJoanne Wuensch -- Citi -- Analyst\n\nGood evening and thank you for taking the questions. I'm curious about a couple of things. You're talking about a price increase earlier this year and the second one, a third one that's being happening now and then the fourth one. Can you quantify how much the price increases are? And then are those sort of like-for-like products? Or are they reflective of new product launches such as the Energys, Biofinity family that's going out the door?\n\nAl White -- President and Chief Executive Officer\n\nYes. I won't quantify it, Joanne. But there's different price increases happening on different products at different points around the world. Not only that, but you're also actually seeing some stuff in terms of like freight surcharges and so forth to offset some of those increases.\n\nI mean, the one that I think most recently that we took a few months ago was Biofinity. But we had other increases to start the year. You're right that MyDay, Energys is certainly being launched or will be launched at a price premium, which will be another \"increase\" if you will. And then, we'll look at other opportunities as we move through the end of this year and certainly into next year.\n\nJoanne Wuensch -- Citi -- Analyst\n\nAnd my second question is, I'm curious about your stores for the New Fit share. And is that a new No. 1 spot or is that a continued No. 1 spot?\n\nAl White -- President and Chief Executive Officer\n\nThat is a continued No. 1 spot.\n\nJoanne Wuensch -- Citi -- Analyst\n\nOn the source?\n\nAl White -- President and Chief Executive Officer\n\nA variety of areas. It would really depend on what product you're talking about. I mean, some of them are more dramatic than others as an example, of MyDay multifocal, it's doing really well, and it's picking up from a number of other multifocal companies, and then it's also picking up new multifocal wearers who are coming into the market. New wearers, and I'm talking about new wearers, the new 15-year-old, 16-year-old who enters the marketplace.\n\nWe're doing really well there with MyDay and clariti. We don't have the same opportunity of trade-off that you know as some of our competitors do in terms of them shifting from like an old traditional, if you will, hydrogel daily lens to a new silicone and getting the trade-up benefit of that. We don't have as much of that. So when you look at our growth, it ends up coming from those new wearers, and it's really a variety of different areas and different spots around the world.\n\nJoanne Wuensch -- Citi -- Analyst\n\nExcellent. Thank you.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Matt Mishan with KeyBanc. Your line is open.\n\nMatt Mishan -- KeyBanc Capital Markets -- Analyst\n\nHey, good afternoon and thank you for taking the questions. I know you guys have done some amazing things around the kind of resiliency and power supply down in Puerto Rico. Have you incorporated some assumptions for increased power costs in the U.K. and Hungary into the forward outlook? And how should we think about the manufacturing in those regions and some of the difficulty that may be this winter?\n\nAl White -- President and Chief Executive Officer\n\nYes. We have incorporated that. That was built into Brian's commentary when he was talking about next year's numbers and kind of ongoing challenges with respect to the macro economy, if you will.\n\nMatt Mishan -- KeyBanc Capital Markets -- Analyst\n\nOK. Excellent. And then, I know some of your competitors have had some supply chain issues. How much of a benefit do you think you're getting from some of the peers? And how sticky do you think those are?\n\nAl White -- President and Chief Executive Officer\n\nI would say, very little benefit. In the contact lens industry, so much of it still goes around to the prescription itself, right? You go get a script and you buy. So if someone's having supply chain issues, their wearer base generally extends their lenses or they avoid their glasses or whatever in order to get those products. You have to have supply chain challenges of a decent magnitude that lasts a while before you really start seeing changing fitting behavior.\n\nSo I don't think very much right now. I would change that answer if those kind of supply chain difficulties stay at high levels and go on an extended period of time, but I don't know. But as of now, I would say very little.\n\nMatt Mishan -- KeyBanc Capital Markets -- Analyst\n\nAll right. Thank you.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Jeff Johnson with Baird. Your line is open.\n\nJeff Johnson -- Baird -- Analyst\n\nThank you. Good afternoon. I know you said you didn't want to quantify the price increases. See if this is better, Al.\n\nIt sounds like I'm having the same problem Jon Block was having. Can you hear me OK?\n\nAl White -- President and Chief Executive Officer\n\nYes, we can hear you fine. Yes.\n\nJeff Johnson -- Baird -- Analyst\n\nSo I know you won't quantify the price increases, but our checks would stay maybe 1%, 1.5% earlier this year, another 1%, 1.5% in August, but it's hard to know with your contracting in that. I mean, are those about the ranges we should be thinking about maybe 2%, 2.5% points total net so far this year on the CVI side?\n\nAl White -- President and Chief Executive Officer\n\nYes, I think that's probably fair. And we had talked about this, I think, in last quarter and quarter before, right? Some of those price increases for us move in a little bit slower than others. Some of the guys have a lot on list price, right? So when they raise their list price, they'll get a benefit from those price increases relatively quickly. We have a lot under contract especially with respect to anything we're doing about store brands and that kind of stuff.\n\nSo some of those price increases for us have a tendency to roll in over a longer period of time as those contracts need to reup. But I think the magnitude of what you're talking about right now is somewhat in the ballpark/lower.\n\nJeff Johnson -- Baird -- Analyst\n\nOK. And then, maybe two follow-ups on that. One, can you just remind me the surcharges in that, transport costs and some distribution costs and that's starting to come down a little bit. Do those fall into revenue or those expense line item? And would you expect to keep those surcharges in place much longer? Or just how to think about that one? And two, you mentioned MiSight some back-to-school activity there on the promotion side.\n\nWhen you were finding that our survey work maybe a little bit of lower selling price to docs as well on MiSight. Have you changed kind of your sell-in price, not just to sell out?\n\nAl White -- President and Chief Executive Officer\n\nNo. So we haven't changed our pricing in terms of our sell-in we held pricing. We are trying to do some other stuff, right? When you think about the most successful referral source, if you will, or a person for us to market the product is anyone who's used MiSight. The success rate has been really, really positive.\n\nSo those parents who are positive on the product or telling other people, right? So we're trying to offer some promotional campaigns, for instance, for them. Hey, your kid is now in their second year or their third year were on MiSight, we'll give you a discount for everybody who you refer in, who comes to MiSight. That type of thing, promotional activity for a brand new wearer coming into MiSight around back-to-school. So there is some activity that we're doing, Jeff, to be fair, in terms of that pricing.\n\nThere's been a few highlights about the pricing be a little high. So if you will, we haven't taken the list price down, but we are running promotional activity, especially with the heavy back-to-school season here. On the other side of things, on the freight, there's still -- freight is still a tough one, I got to tell you. Yes, I would say things are getting a little bit better, but everyone still has their challenges there.\n\nI think that my gut tells me that those changes are just permanent price increases, if you will, and I think they all go through revenues, don't they?\n\nBrian Andrews -- Chief Financial Officer and Treasurer\n\nYes, freight revenue. I'll answer. I mean, the only thing I would add to that is, as we are having difficulty meeting demand, it does force us to fly more than we'd like to, and we're not able to take advantage of the ocean freight. So I mean, you're seeing freight charges go up all across the board.\n\nWe're doing whatever we can to try to manage that by raising surcharges and so forth. But there's still inefficiency in a way that we're having to ship to our customers, and you're seeing that as a detriment to both intercompany, but also for freight out and distribution.\n\nJeff Johnson -- Baird -- Analyst\n\nYou know, that makes sense. All right. Thanks, guys.\n\nOperator\n\nThank you. Please stand by for our next question. Our next question comes from the line of Robbie Marcus with J.P. Morgan.\n\nLily Lozada -- J.P. Morgan -- Analyst\n\nHi. This is actually Lily on for Robbie. So operating margin came in lower than what we were thinking and pretty significantly lower than a year ago today. So is there any way to quantify how much of that is FX headwinds versus operational challenges?\n\nBrian Andrews -- Chief Financial Officer and Treasurer\n\nI'll take that one. I think operating margins for us came in more or less where we expected. FX is just brutally killing our P&L, and you're seeing that in the third quarter. PARAGARD was down versus last year's third quarter.\n\nThat's a high gross margin product. So that impacted margins and the flow-through. We also had inefficiencies within CooperVision, which we knew about going into the third quarter tied to shutting down lines in fiscal Q1 that we always do to refurbish and what we usually do. And so, some of the activity we knew and we knew about and -- but it's really a story about FX.\n\nLily Lozada -- J.P. Morgan -- Analyst\n\nGot it. That's helpful. And just as a follow-up, where are New Fits relative to normal levels? Are there any geographies that stand out is lagging or being above pre-pandemic levels right now?\n\nAl White -- President and Chief Executive Officer\n\nYes. It's really interesting going through that data because even the U.S. data we just got shows that New Fits are not back pre-COVID levels. And there's different data, different spots kind of around the world being as much as 5%, 10% below pre-COVID levels.\n\nSo if you look at the strength of the revenue numbers and where the industry is today, and you go man, we still have 5% or 10% of fits to get back into the market just to get the pre-COVID levels, knowing that wearers are also increasing, right? You can get kind of excited about the potential opportunity there over the coming years. I happen to believe that a lot of those wearers are getting fit in different ways and maybe not getting fully captured in that data like through things like telehealth and so forth so that people are able to get prescriptions renewed, are able to buy their lenses in different ways. But to be fair, the data is showing that we're not back to pre-COVID levels in terms of fits.\n\nLily Lozada -- J.P. Morgan -- Analyst\n\nGot it. Thank you.\n\nOperator\n\n[Operator instructions] Our next question comes from the line of Steve Lichtman with Oppenheimer. Your line is open.\n\nSteven Lichtman -- Oppenheimer and Company -- Analyst\n\nThank you. Hi, Al. I just wanted to get your confidence on PARAGARD improvements from here beyond the easier comps. What are you seeing on the ground there for PARAGARD? And what do you see as potential drivers for improvement ahead?\n\nAl White -- President and Chief Executive Officer\n\nYes. On PARAGARD, we had a tough quarter, as we said this quarter because of the comp. We'll have a good Q4 we started off well here in August. As a matter of fact, we finished strong at the end of July with PARAGARD.\n\nSo with Roe v Wade and what's happened, women are out there, and they're a little bit more concerned about things for obvious reasons. We are seeing that women are looking at, OK, well, what's the most efficacious form of birth control, what direction should I go here. So we have seen an increase in interest in LARCs, and you've seen that in some of the numbers here more recently. So we'll see if that trend holds.\n\nIf it does, you'll continue to see outperformance in IUD. So I would say that the kind of Roe v Wade outcome, if you will, I was saying that it was neutral to a modest positive to us. I would probably upgrade that to saying that that's turning out to be a modest positive to our business. we'll see how PARAGARD goes.\n\nBut I would envision a decent quarter in Q4. That's for sure.\n\nSteven Lichtman -- Oppenheimer and Company -- Analyst\n\nOK. Got it. And Brian, you and Al talked about ramping production I think, across a number of lines in CVI. What is your outlook for capex spending this year? And directionally, are you anticipating next year to be up, down, flat versus this year in capex?\n\nBrian Andrews -- Chief Financial Officer and Treasurer\n\nSteve, good question. Yes. So capex ticked up a little bit in the third quarter. Yes, Al in his prepared remarks, talked about how we put some lines in place.\n\nAnd we're doing whatever we can -- as quickly as we can to ramp up capacity, it's hugely difficult to increase capacity quickly. And we're having a tough time meeting demand. So I would expect -- I'm expecting a pretty high capex number in the fourth quarter. Still free cash flow being strong for the full year, but that trend kind of continuing where next year capex continues to go higher as we continue to put more capacity in place to try to meet demand.\n\nSteven Lichtman -- Oppenheimer and Company -- Analyst\n\nGot it. Thank you, guys.\n\nOperator\n\nThank you. Our next question comes from the line of David Saxon with Needham. Your line is open.\n\nDavid Saxon -- Needham and Company -- Analyst\n\nYeah, hi. Good afternoon and thanks for taking the questions. Maybe just a follow-up on PARAGARD. I think last quarter, you noted softness in the market.\n\nBut it sounds like you have a fair bit of confidence in it returning to growth here in the fourth. So is that market dynamic kind of passed us at this point? And then just on pricing, I know you took price, I guess, you're going to be lapping it soon, but any opportunity to take price again with PARAGARD?\n\nAl White -- President and Chief Executive Officer\n\nYes. So a couple of things on PARAGARD. We did see office visits down, OB-GYN office visits down, and that was due to a -- sorry, COVID-related staffing challenges, right? We've seen some of that same stuff, obviously, in optometry offices, and I'm sure everyone has seen that in other areas of the world. But we definitely saw a negative impact to patient traffic, especially with respect to things like general OB-GYN visits and contraception OB-GYN visits during the summer months.\n\nAfter the Roe v Wade situation and a little bit of improvement in terms of capacity, you had a bunch more attention, if you will, focused on the matter. And we've seen that attention be a benefit to PARAGARD because PARAGARD is I mean it's highly efficacious, 99% plus efficacious. So if you don't want to get pregnant, get an IUD. And as people look at that, become more aware of that, obviously, PARAGARD is the only non-hormonal IUD in the marketplace.\n\nWe've seen an increase in terms of interest in the product and people inquiring about it, people searching for it. Our team, I think, has really done a nice job trying to capitalize on that activity. So we saw that improvement starting in July. We've seen it continue here through August.\n\nAnd yes, I think you'll see growth certainly in Q4. TBD on price increases, one of our competitors did a price increase or is doing one here. We'll evaluate another one and take price if we can, if it's appropriate.\n\nDavid Saxon -- Needham and Company -- Analyst\n\nOK. That's helpful. And then, on myopia management at -- sorry, 90 to 95 wherever it shakes out, is that portfolio going to be profitable? And if not, how should we think about when that starts to contribute to earnings?\n\nAl White -- President and Chief Executive Officer\n\nYes. I would call that somewhere around the kind of breakeven this year. Let's go with -- let's just say it's breakeven, and then it will shift to being profitable next year. We've built a lot of infrastructure there in terms of myopia management support people and so forth, we'll start to leverage that infrastructure as we get into next year.\n\nSo that's an operating margin drag certainly right now. It gets better next year. And then, hopefully, if it continues to grow at the pace it's growing and what we're seeing, we'll continue to improve that operating margin. Hopefully, at some point in the future, get that to the operating margin positive, especially with the gross margins in that business.\n\nOperator\n\nI'm not showing any further questions. I would now like to turn the call back over to Al White for closing remarks.\n\nAl White -- President and Chief Executive Officer\n\nGreat. Thank you. Thank you, everyone. Again, strength in the business and the core fundamentals are driving what we're -- what's making us optimistic.\n\nI mean, the one thing Brian touched on it, is currency has been painful for us. It's been pretty brutal. We're working through it the best that we can, and we're taking the measures that we can take. But if we exclude currency and really look at the fundamentals of the business, whether it's CooperVision or it's CooperSurgical, especially the fertility business, things are strong and we believe they're going to remain strong.\n\nStarted Q4 off well, and we're optimistic about finishing this quarter well and having a good year next year. So appreciate everyone's interest. Look forward to seeing people. Hopefully, some of you at the Wells conference with Larry here, I think, next week and look forward to speaking to everyone else during the quarter on the Q4 call.\n\nThanks.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKim Duncan -- Vice President, Investor Relations and Risk Management\n\nAl White -- President and Chief Executive Officer\n\nBrian Andrews -- Chief Financial Officer and Treasurer\n\nJason Bednar -- Piper Sandler -- Analyst\n\nLarry Biegelsen -- Wells Fargo Securities -- Analyst\n\nChris Cooley -- Stephens Inc. -- Analyst\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nJoanne Wuensch -- Citi -- Analyst\n\nMatt Mishan -- KeyBanc Capital Markets -- Analyst\n\nJeff Johnson -- Baird -- Analyst\n\nLily Lozada -- J.P. Morgan -- Analyst\n\nSteven Lichtman -- Oppenheimer and Company -- Analyst\n\nDavid Saxon -- Needham and Company -- Analyst\n\nMore COO analysis\n\nAll earnings call transcripts"
}