{
  "companyName": "Rite Aid",
  "companyTicker": "RAD",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/12/21/rite-aid-rad-q3-2023-earnings-call-transcript/",
  "content": "Rite Aid (RAD 0.91%)\nQ3 2023 Earnings Call\nDec 21, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Rob, and I will be your conference operator today. At this time, I would like to welcome everyone to the Rite Aid Corporation third-quarter fiscal year 2023 earnings conference call. All lines have been placed on mute to prevent any background noise.\n\nAfter the speakers' remarks, there will be a question-and-answer session. [Operator instructions] Thank you. Byron Purcell, vice president investor relations and treasurer, you may begin your conference.\n\nByron Purcell -- Vice President, Investor Relations and Treasurer\n\nThank you, Rob. And good morning, everyone. We welcome you to our fiscal 2023 third-quarter earnings conference call. Heyward Donigan, president and chief executive officer; and Matt Schroeder, executive vice president and chief financial officer, will begin the call with prepared remarks.\n\nAndre Persaud, executive vice president and chief retail officer; and Chris DuPaul, chief operating officer of Elixir, will also join the call during the question-and-answer session. As we mentioned in our release, we are providing slides related to the material we'll be discussing today. These slides are provided on our website, investors.riteaid.com. While management will not be speaking directly to the slides, these slides are meant to facilitate your review of the company's results and to be used as a reference document following the call.\n\nBefore we start, I'd like to remind you that today's conference call includes certain forward-looking statements. These forward-looking statements are presented in the context of certain risks and uncertainties that can cause actual results to differ. These risks and uncertainties are described in our press release in Item 1A of our most recent annual report on Form 10-K and in other documents that we file or furnish to the SEC. Also, we will be using certain non-GAAP measures in our release and accompanying slides.\n\nThe definition of our non-GAAP measures, along with the reconciliation to the related GAAP measure, are described in our press release and the slides. With that, let me turn the call over to Heyward.\n\nHeyward Donigan -- Chief Executive Officer\n\nThanks, Byron. Hey, good morning, everyone, and I just want to thank you for joining us today, and welcome to our third-quarter earnings call. The third quarter came in better than consensus on both revenue and adjusted EBITDA despite the continued challenging macro conditions. There were some clear positives, but I'll give you, there's also some challenges.\n\nAnd then for me, I want to share some key takeaways with you. I'll go into more detail on these combined with some discussion on some exciting new initiatives that I believe will set us up for success going forward. But first, a quick review of our third-quarter results. Revenue for the quarter was 6.1 billion, compared to 6.2 billion in the same quarter last year.\n\nThe third-quarter adjusted EBITDA was 121.9 million, compared to last year's adjusted EBITDA of 154.8 million. In our retail pharmacy business, total revenue decreased 0.5% from the prior year, driven by the expected reductions in COVID vaccines and COVID testing revenue in addition to the store closures that we've discussed. Results on a same-store basis are encouraging with improved growth rates in all key categories in the third quarter year over year. Overall, same-store sales increased 7.5% with pharmacy sales increasing 9.5% and front-end sales, when excluding tobacco, grew 2.7%.\n\nTotal same-store prescriptions increased 4.4%, and when excluding COVID immunizations, prescriptions increased 3.6%. Same-store maintenance prescriptions increased 2.1%, and same-store acute prescriptions increased 8%. We also improved our overall prescription market share by 20 basis points for same stores, bringing us to over 11% share in the markets in which we operate. This is a testament to the high performance of our front end and pharmacy teams, their customer relationships, and even in this challenging labor market.\n\nDemand for flu immunizations and COVID vaccines in the quarter were both weaker than we expected, consistent with trends in the overall industry. The demand for bivalent COVID vaccines has been less than we anticipated, and we expect that weakness will continue into the fourth quarter. However, due to one of the strongest flu seasons we've seen in decades, we expect a longer tail to the flu immunization demand and into the fourth quarter. We expect to finish the fiscal year administering approximately 5.2 million COVID vaccines and 2.7 million flu vaccines.\n\nTurning to the front end, we're pleased to post market share gains of 20 basis points in the third quarter. Front end same-store sales were aided by good results in health, consumable, and the beauty categories, offset by underperformance in alcohol and general [Technical difficulty]. Shrink for the quarter was 9 million worse than the prior year's third quarter. We expect shrink to be a continued headwind in the fourth quarter.\n\nAdditionally, we're seeing signs the consumer is remaining cautious, particularly in demand for discretionary seasonal products, which has driven increased markdowns. However, high demand for cough, cold, and flu products has resulted in higher out-of-stocks. You've probably heard this in the news. Turning to our pharmacy services business in the third quarter, Elixir reported revenues of 1.7 billion, compared to 1.9 billion for last year's third quarter.\n\nThis was primarily due to a planned decrease in Elixir Insurance membership and a previously announced PBM client loss on 1/1/22, partly offset by a combination of higher drug spend and utilization. Elixir's third-quarter adjusted EBITDA was 40.2 million versus last year's third-quarter adjusted EBITDA of 28.9 million due to strong procurement economics, as well as a reduction in SG&A expense. Procurement economics refers to contributions from an expanded set of solutions including plan design and administration, formulary and rebate management services, network performance management, and specialty and mail order pharmacy purchasing. These services add economic to our value -- economic value to our clients and also to Elixir.\n\nAs we look ahead to the fourth quarter, we expect some of the negative trends that we experienced in our retail business in the third quarter to continue. This includes lower pharmacy margins due to drug mix; weaker consumer demand for discretionary items, which will likely result in higher seasonal markdowns; as well as continued higher shrink expense. As a result, we're reducing our adjusted EBITDA guidance to 410 million to 440 million for the year, down from 450 million to 490 million previously reported. This guidance reduction is concentrated on the retail side of the business.\n\nThe key takeaway is that while we're seeing good script and front-end sales growth in our retail business and strong operational results at Elixir, we remain challenged by retail margin pressures. We took pride in the way we mobilize to continue to serve our communities during COVID. Now that the pressures of the pandemic are easing, we're working to bring that same call to action, that same agility and strong execution back to driving growth and performance in the core business. The core drivers of growth include script growth with a focus on adherence, smaller-format store launches, digital engagement, growing our loyalty membership, and driving increased own-brand penetration.\n\nWe are also laser focused on the long-term growth of our PBM membership with development of a strong pipeline for the 2024 selling season that is already underway. At the same time, we will continue to reduce costs and free up cash. Focus -- we are focused on adherence with our Courtesy Refill Program. 1.2 million new customers have enrolled in our program since June.\n\nAs a result, we're seeing a 1% increase in adherence scores for our Medicare book of business. The value we're seeing from these adherence initiatives reinforces the growth potential with our current customers. Also, we have a central fill facility that currently serves over 800 stores. This facility helps us dispense a higher volume of maintenance medications outside the stores, thus freeing up our in-store team for increased script growth and the delivery of enhanced clinical services.\n\nWe're planning to expand our central fill capabilities to service the remainders of our stores in the coming year. We're introducing technology and innovation to streamline core non-dispensing tasks such as inventory management, automating customer prescription transfer requests, and taking non-pharmacist calls out of the stores. We're bolstering our centralized pharmacy teams to include additional clinical support for customers through our Medication Therapy Management program, or MTM, as we call it, so our in-store pharmacists will always be available to counsel and support our customers. That's crucial.\n\nBut growing a centralized pharmacy team allows for additional touch points with our customers. And by growing our MTM program, we'll increase the number of medication interventions that focus on preventing or reducing drug-related risks, increasing customer knowledge about over-the-counter and prescribed medications, and supporting good habits to become or stay adherent to drive regimens. That's crucial to good health and preventing hospitalizations. And finally, this is all the first step of putting a pharmacist in your pocket, a virtual alternative to allowing customers to be able to access our pharmacy teams anywhere and anyhow.\n\nWe're also upgrading our proprietary pharmacy workflow technology to streamline the user experience for pharmacists and increase operational efficiency. These enhancements include the expansion of remote quality assurance, remote data entry, and problem resolution and centralized support for other prescription filling functions. Additionally, we just launched our first two small-format stores in Virginia. We believe these are a great way to expand and complement our footprint and better serve our communities.\n\nWe have strong momentum in our digital business with sales up 65% year to date over last year and healthy margin contributions as well, up over 50% in EBITDA from prior year. Our loyalty program also delivered strong results with 500,000 new members enrolled in the quarter. Rite Aid Rewards members spend 34% more on their front-end basket compared to nonmembers. We also had 300,000 members create digital accounts in the quarter.\n\nOur new own brand portfolio also continued to grow. We've talked about this before. We now are at 64% of our planned new own brand SKUs rolled out into the store year to date. The owned brand sales comp growth was 8.1% in Q3 year over year and up 67 basis points in penetration.\n\nNot only are our own brands more affordable and higher margined, we believe this growth shows the promise of our new packaging, excuse me, and our new brands that are appealing to our target growth customer. Q3 once again demonstrated the ability of our Elixir business to generate increased EBITDA on a year-over-year basis, despite a significant decrease in lives going into the plan year. The performance was the result of consistent execution of our management plan put in place during Q1 of FY '23 to increase our EBITDA margins through improved profitability and strict control over SG&A. We are on track to achieve our Elixir guidance of 145 million to 155 million for the year.\n\nMoving into Q4, we will cycle through significant membership losses on 1/1/23, resulting in a net decrease of 700,000 members. This change in lives is attributed to one large client loss that was previously disclosed and an expected reduction in Elixir Part D membership as a result of bidding above the benchmark in 23 of our 34 regions. We are aggressively working to adapt our cost structure to the lower life count, and we'll provide more details when we issue guidance for FY '24. We are taking action to improve and accelerate our performance and business executions across Rite Aid.\n\nWhile we're gaining real traction on many of our strategic initiatives, we recognize that we have to do more and faster. We have -- that's why we've launched a new performance acceleration program. We've already mobilized and trained over 400 associates on this new approach to fast-tracking initiatives that will improve business discipline and drive outcomes that increase growth and profitability. We will approach these initiatives with a focus on prioritizing our limited capacity and capital, and we will closely measure and track execution to build needed internal capabilities and processes.\n\nWhile it's still early days, we have already identified hundreds of opportunities and initiatives that will improve sales and script volume, expand our operating margins and free up cash. We see a real potential for this to drive performance through FY '24 and beyond, and we will share further details and expectations during our next earnings call. To close, we're encouraged by our strong script growth, our increasing front-end sales comps, and solid Elixir results. We're focused on the acceleration of initiatives that will propel the growth of our business going forward.\n\nWe're leveraging a new model to identify and manage initiatives positively impacting our operating results. We're committed to creating long-term value for our shareholders as we execute on our performance acceleration initiative and grow our modern pharmacy business. With that, I'll turn things over to Matt.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nThanks, Heyward. And good morning, everyone. As we have said previously, paying down debt, maintaining strong liquidity, and effectively managing our capital structure are top priorities for the company. During and just following the quarter, we completed two transactions to help us achieve these objectives.\n\nIn October, we completed a securitization of approximately $170 million of our 2022 CMS receivable, which represents the amount of the receivable that accumulated between January 1 and June 30 of 2022. This transaction preserves available borrowings under our revolving credit facility and was done at a rate similar to the rate that we incur on our revolver borrowings. We expect to securitize the remainder of the 2022 CMS receivable before the end of our fiscal year. In November, we launched an additional tender offer focused on our 2025 bonds.\n\nThrough this transaction, we paid down over $165 million of our 2025 bonds at a discount and lowered our overall debt outstanding by approximately $40 million. This also brings an additional benefit of interest savings as we are replacing these bond borrowings with revolver borrowings, which have a lower interest rate. In order to partially mitigate the impact of the tender offer on liquidity, we expanded our ABL revolver from 2.8 billion to 2.85 billion and increased the FILO term loan from 350 million to 400 million. These expansions added $100 million of availability in total under our senior secured credit facility.\n\nWe have lowered the amount of outstanding debt on our 2025 bonds, which is our nearest debt maturity, from 600 million at the beginning of the year to 320 million after the completion of our latest tender offer. We had over $1.3 billion in liquidity at the end of the third quarter and expect that number to improve at fiscal year-end as we reduce our seasonal build of inventory and complete the remainder of the calendar 2022 CMS receivable securitization. Now, I'll review our third-quarter results in more detail. Revenues for the quarter were down $145.5 million or 2.3% from prior year's third quarter, driven by a decline in COVID testing and vaccine revenue, the impact of store closures, and lower membership at Elixir.\n\nThird-quarter net loss was $67.1 million or $1.23 per share, compared to last year's third-quarter net loss of $36.1 million or $0.67 per share. The increase in net loss in the current quarter is due primarily to a decrease in adjusted EBITDA, an increase in interest expense, and an increase in restructuring charges. These items were partially offset by a reduction in facility exit and impairment charges. Now, we'll discuss the key drivers of operating results in our business segments.\n\nRetail pharmacy segment revenue for the quarter was $4.4 billion, which was $20.3 million lower than last year's third quarter, driven by the decrease in COVID-related revenue and store closures, partially offset by an increase in both maintenance and acute prescriptions. Retail pharmacy segment same-store sales increased 7.5% and with increases in front-end same-store sales, excluding tobacco, of 2.7% and in same-store pharmacy sales of 9.5%. We administered 1.9 million COVID vaccines in the third quarter of fiscal 2023, compared to 4 million in last year's third quarter. We also cycled a reduction in PCR testing demand from 1.2 million last year to 68,000 this year, offset somewhat by the impact of increased antigen testing sales.\n\nOutside of COVID vaccine impact, maintenance scripts were up 2.1% and acutes were up 8%. Third-quarter retail pharmacy segment adjusted EBITDA was $81.7 million or 1.9% of revenues, compared to last year's third-quarter adjusted EBITDA of 125.9 million or 2.8% of revenue. The decrease in adjusted EBITDA and EBITDA margin is attributed to lower COVID vaccinations and testing and higher shrink results, partially offset by increased non-COVID prescription volumes and reduced SG&A. Retail pharmacy segment adjusted EBITDA SG&A expense was $81.2 million or 173 basis points better as a percent of revenue than the prior-year third quarter due to lower payroll, occupancy, and other operating expenses.\n\nDriven by store closures and our cost reduction initiatives, we are on target to achieve the $190 million in SG&A savings in FY '23. Shifting to our pharmacy services segment, Elixir, in the third quarter, Elixir saw revenues decreased $132 million or 7.1% to 1.73 billion, due primarily to a planned decrease in Elixir Insurance membership and a previously announced client loss, partially offset by increased utilization of higher-cost drugs. Elixir's third-quarter adjusted EBITDA was $40.2 million or 2.3% of revenues, versus last year's third-quarter adjusted EBITDA of $28.9 million or 1.6% of revenues. The current quarter benefited from increased gross profit resulting from procurement economics and network performance management, as well as a reduction in SG&A expense, partially offset by the decline in revenues associated with lost clients.Turning to our cash flows and balance sheet, our cash flow statement for the quarter shows a source of cash from operating activities of 132.6 million, driven by the sale of the first part of the 2022 CMS receivable.\n\nCash used by investing activities was 40 million for the quarter. Included in investing activities were script file sales attributed to our store closings and sale-leaseback proceeds. Our net debt balance was approximately 3.1 billion at the end of the quarter as we continue to build the [Inaudible] CMS receivable and seasonal inventory in our regional business. We expect our leverage ratio to be around six times by the end of the fiscal year and to generate positive free cash flow for the year.\n\nNow, let's turn to guidance. While we saw good top-line results in our retail business, we are seeing greater-than-expected pressures on retail margins. Pharmacy margins are expected to be lower than previously forecast due to our actual mix of generic dispense having lower sales values than planned. In addition, our front-end margins will continue to be pressured by cautious consumer demand and the related impact on seasonal markdowns and higher than forecast shrink.\n\nBased on these factors, we are lowering our adjusted EBITDA guidance for the year. Adjusted EBITDA in the retail pharmacy segment is expected to be between $265 million and $285 million. Adjusted EBITDA at Elixir is expected to be between $145 million and $155 million. We expect the procurement economic improvements in SG&A trends that we saw in Q3 to continue through the remainder of the fiscal year, partially offsetting the reduction in lives that will occur on January 1.\n\nTotal revenues are expected to be between 23.7 billion and 24 billion. Adjusted net loss per share is expected to be between $2.18 and $1.78 per share. Capital expenditures are expected to be approximately $225 million. We continue to make investments to grow our business, including pursuing prescription file purchases and investments in digital.\n\nWe also continue to seek to enhance our efficiency by automating our supply chain and transforming our processes and technologies at Elixir. Interest expense is projected to be $220 million and reflects the impact of the latest round of rate increases announced last week. We expect to generate positive free cash flow to continue to pay down debt. This completes our prepared remarks.\n\nRob, could you please open the phone lines for questions.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Elizabeth Anderson from Evercore ISI. Your line is open.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nHey, guys. Thanks so much for the question. Maybe if I just -- and I apologize if I missed this while you were talking. In terms of the 190 million in savings for the quarter, can you just sort of talk us through where you are on that, sort of where the future pockets of opportunity are, and how we should think about that exiting the FY '23?\n\nHeyward Donigan -- Chief Executive Officer\n\nYes. Hey, Elizabeth. How you doing? It's Heyward. And I'll let Matt answer.\n\nThis is largely complete. Matt, you want to just update on that savings target?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYes. Thanks, Heyward. Good morning, Elizabeth. Yeah, we are on our way certainly to hitting our target of $190 million in SG&A savings for the year.\n\nAnd I think you saw a pretty sizable savings number year over year in the third quarter of this year in both the retail business but also in the Elixir business as we made some real efficiency improvements and managed through the reduction in lives. As we think about next year, still a lot of work to do on building out our plans for our 2024. But, you know, we'll continue to look at opportunities to close stores. We'll continue to look at opportunities to rationalize our labor.\n\nAnd we've got a lot of opportunities around getting more efficient on procurement and indirect procurement that are coming out of some of the work, the initiative work we're doing that Heyward described. So, more to come, but certainly looking at further cost reductions in 2024.\n\nHeyward Donigan -- Chief Executive Officer\n\nYeah. I think with the emphasis, Elizabeth, being on Elixir because of the lives lost, that will have to be addressed. So, that's the main -- that and procurement are really the main opportunities for next year.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. No, that makes sense. And it looks like at least on sort of my math here that your core profitability was much closer to sort of like 1Q levels in terms of dollar contribution versus last quarter. But I just wanted to check that I had two things right.\n\nOn the OTC test, when you said the antigen tests were increasing, did you mean sequentially or on a year-over-year basis?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nThey're increasing on a year-over-year basis, but they're also a little bit up sequentially as well, particularly in the last couple of weeks of the quarter, and in line in really in the first couple of weeks of the fourth quarter as well.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nOK, got it. And then flu testing, you would -- or sorry. Flu vaccines, you would say, 3Q over 3Q were about flat?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nFlat, yeah. Yeah.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nOK, got it. That's super helpful.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nI think as we think about the fourth quarter, Elizabeth, you know, what we're kind of seeing from a flu vaccine standpoint is anticipating a slightly better than prior-year fourth quarter but not dramatically so.\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGot it. No, that -- that makes it [Inaudible] Thank you for the additional color. That's very helpful.\n\nHeyward Donigan -- Chief Executive Officer\n\nThanks, Elizabeth.\n\nOperator\n\nYour next question comes from the line of George Hill from Deutsche Bank. Your line is open.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nGood morning, guys, and thanks for taking the question. I guess, Matt, on the change in the guidance in the pharmacy services segment, you talked about the mix of generics, the spends as being part of the issue and kind of pharmacy margin pressure. I'm just wondering if you can disaggregate that a little bit. And I guess I'm wondering if you can kind of bucket into what are we seeing at from reimbursement from payers.\n\nHow much of it is lower margin in the mix? And I'll kind of pause there and then come back.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah. Thanks, George. So, with regards to the pharmacy margins, headwinds that we're looking at and really the piece that, that drove a component of the guidance change, what we've seen is an increase in generic dispensing, which is positive for us. That's a good thing.\n\nBut the mix of drugs that we've dispensed in that kind of generic mix has resulted in a lower recovery rate than what we previously modeled. So, it's really -- it's more -- it's mix. It's not actual rate changes from our PBM partners. We don't expect this mix issue to persist in the next year.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nOK. That's super helpful. And then my follow-up question on that is, you guys talked about procurement. I guess can we dive a little bit more into that.\n\nAre we talking about the procurement of drug products in particular, or are we talking about front-end products? Or kind of like -- I'm wondering if you can kind of bucket what is the opportunity for savings in procurement?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah. I think that we've used the procurement in a couple of different ways. So, on the call on -- in reference to Elixir, it's really a combination of both drug purchasing especially but also network management, you know, rebate management and just kind of managing the best -- better managing the spread between what we kind of get in in various contracts and what goes to clients while at the same time, of course, being very competitive in the market and with our clients. On the retail side, a lot of opportunity that we see into next year around procurement for indirect.\n\nSo, think of that as like non -- not for resale -- non-payroll SG&A spend. And with an addressable spend volume that we have of about 1.3 billion in the retail side, there's a lot of opportunity for improvement there.\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nOK. That's helpful. If you'll humor me with two more quick ones. Are the shortages of amoxicillin and Tamiflu meaningful? And then are the sale leaseback proceeds that you guys called out, is that just an earnings contribution, a cash contribution, or both?\n\nHeyward Donigan -- Chief Executive Officer\n\nI would say -- let me start by saying. Go ahead, Matt.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nNo, go ahead, Heyward, please. Sorry.\n\nHeyward Donigan -- Chief Executive Officer\n\nWe really aren't having any significant experience issues with the amoxicillin or the Tamiflu, although you could probably hear this morning a number of people talking about that there certainly are some pocketed challenges. I think for us, the bigger issue is the over-the-counter drug supply chain issues. And then, Matt, you can answer the second question.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYes. So, George, the sale-leaseback proceeds that we're referring to are a cash benefit. They had nothing to do with -- there's a small gain on assets that's non-EBITDA. That's part of that.\n\nBut the main benefit is the cash benefit. And the proceeds we had for sale leaseback this quarter, it was about $10 million.\n\nOperator\n\nOur next question comes from the line of Lisa Gill from JPMorgan. Your line is open.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nThanks very much. Good morning. Matt, if I can start with just a couple of numbers questions. So, one, when I think about fiscal '23 and the current guidance, can you talk about how much you have in there for COVID in general? I mean every quarter, we've talked about numbers, and we talk about the swing factors of those numbers.\n\nBut as we sit here today, can you give us a total number? I'm just trying to think of what the core business looks like as we think about '24, would be my first question.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nSo, Lisa, we have -- I think as we said in the script, we have about 5.2 million in COVID vaccines kind of modeled out for the year. That's the biggest -- by far the biggest COVID factor. PCR tests have really fallen off to almost a negligible number. And then on the antigen test, you know, we've seen a level of antigen test disbursement as we talked about that's a little bit higher than last quarter.\n\nThose are really kind of the main factors. \n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nAnd so, if I think about that, right, so think about the 5.2 million at roughly $15-ish EBITDA, is that still the right number to think about when we think about the COVID vaccinations? And, again, it may carry forward into 2024, but I'm just trying to think about the core business.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYes. We've been using 20 million as a proxy for EBITDA for the COVID vaccines. I think that's the right number to use.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nAnd then as I think about the fourth quarter and I think about the $30 million swing factor, you talked about a number of things, whether you talked about the mix of generics, I think that you talked about the shortage on the over-the-counter side. Is there anything that you can help us -- I mean it's -- we're already in December, right, so you only have a couple of months left. Is there anything you can point out when we think about the swing factor on either end? Or, you know, is it kind of a midpoint that you're more comfortable with? Any color would be helpful as we think about modeling the fourth quarter.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYeah. Yeah, Lisa. I mean we try to pick a guidance range every quarter that really is an estimate of low and high end of the most likely possible outcomes. And that's what we've tried to do in the 410 million to 440 million.\n\nYou know, as far as like what could swing the number around, I think what could swing the number to the high end of the range into the good way is if we continue to see strong flu prescriptions. If COVID and flu vaccines are a little bit heavier than what we thought and a lot will depend too on how we do on the front end and the Christmas season with OTC, but if we continue to see like pretty strong demand on OTC and flu, then you're probably looking at something that's a little bit on the higher end. Something that gets you probably to the lower end are COVID and flu vaccine demand dropping off as a flu shot. And then certainly, markdowns and shrink continue to be things that we're looking very hard at from the standpoint of front-end business.\n\nAnd those are probably the swing factors. If things go bad in those areas would get you more toward the lower end.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nAnd then I guess my last question just would be kind of a longer term. Heyward, this would be more for you, I guess, as we think about your comments on the PBM membership and the potential positive for 2024, really two questions there. One, can you maybe size the RFP opportunity that you see for 1/1/24? And then secondly, do you see any midyear start opportunities in calendar '23?\n\nHeyward Donigan -- Chief Executive Officer\n\nWell, first, I'd say that we -- it's so early, and right now, we're selling into 1/1/24. There are always some midyear opportunities. I wouldn't consider them at this stage big enough to swing things one way or the other. The big business, the bigger business, and the bulk of the business is going to be 1/1.\n\nBut we are launching our Laker Software as a service business. We just hired a new sales leader there. We are also deep into the mid-market business, the public sector business, and we're showing, you know, a significant amount of interest from the national practice leaders who have -- we had almost every pharmacy national -- pharmacy business national practice leader come visit us at our collaboration center a few months ago. And to a person I would say, very, very interested in supporting Elixir as a credible alternative in our target markets.\n\nSo -- but we have a big road to climb here. We have a big hill to climb because of this loss of this one client and the Elixir Insurance business, which we had planned for that, but -- so SG&A is goal one, is to get the SG&A rightsized at the same time -- so that we can impact next year. And then at the same time, really both maximizing our margin opportunities and our procurement economics alongside of really trying to get that sales season to be -- this year's sales season on a sequential basis.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nAnd if I could just squeeze one in just as you're talking about that. So, the 700,000 lives that will move off your platform for January 1 of '23. Will you lose any of your leverage or purchasing power for the PBM? And then secondly, should we think about that as being kind of normal margins on those lives, or is there anything else that we should take into account as we're thinking about that?\n\nHeyward Donigan -- Chief Executive Officer\n\nYeah.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nAnd I know I'm asking a lot of questions trying to figure out '24 without you wanting to give '24, but we just want to start to think about how to model some of those.\n\nHeyward Donigan -- Chief Executive Officer\n\nOK. So, Chris DuPaul, why don't you answer that?\n\nChris DuPaul -- Chief Operating Officer, Elixir\n\nYes. Look, as we go into '24, those lives are split between the large client loss and the Elixir Insurance book of business, and we run those two parts of the business through different sets of paper. We're continuing to push through on the changes that we've made and how we handle our rebates and our rebate economics. And we've been very pleased with what that has done for the business this year in terms of our ability to be competitive.\n\nWe consistently are finding ourselves when we get into finalist meetings with a very competitive and compelling offer on the table. And we expect that position to continue into next year. So, I don't expect those lives to impact our ability to be competitive and to win business and continue to show improvement in our sales performance. But as Heyward mentioned, we do have, you know, an overall set of economics that we have to manage in the business to make sure that we're rightsizing our operations to match the life count that we have.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nThat's very helpful. Thank you.\n\nOperator\n\nYour next question comes from the line of William Reuter from Bank of America. Your line is open.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nHi, good morning. I recognize you probably don't want to say much here, but, Heyward, in your prepared remarks there were some pretty optimistic commentary about hundreds of opportunities to improve sales and scripts and your operating margins in fiscal year '24. Is it possible that EBITDA could actually be up next year despite a couple of these pretty large headwinds?\n\nHeyward Donigan -- Chief Executive Officer\n\nWell, obviously, we can't comment on next year because it is too early, and, obviously, we're not releasing guidance. All I can say is that we are facing headwinds, as you know, every year. And every year we have to fill those gaps. And we did a very good job this year on a number of initiatives to fill both EBITDA cash gaps and reimbursement rate gaps, whether it's a combination of growth, which we're now seeing nicely and SG&A reductions and cash and debt actions.\n\nSo, Matt, I'll let you jump in. That's -- our goal now is to double the number of initiatives. And what that leads to from a next year point of view is TBD. Matt, anything else you want to add?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nNo, nothing else to add, Bill. It's too early for us to be kind of putting a line in the sand on what EBITDA is going to be directionally. You know, to Heyward's point, our job is to use this initiative process to work to do what we can on the headwinds. More to come when we give guidance.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nYes. I was expecting you'd answer something like that. OK. And then, Matt, you did bring up the opportunity to potentially close more stores.\n\nIs there any sense you can give us of what the negative EBITDA is of those stores which are not profitable at this point?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nYes. It's not a number we've put out there to disclose, Bill. I think what I would tell you is there is an opportunity to close more stores. It's not nearly the size of the opportunity that we had this year.\n\nSo, it's on a much smaller scale because we have done a pretty good job in the latest -- last store closure program of really pruning a lot of the unprofitable stores or at least the unprofitable even with leases in, drain in out of the fleet. So, a smaller impact than this year; more to come as we go through.\n\nHeyward Donigan -- Chief Executive Officer\n\nYeah. This is no longer our key focus. We've done what we needed to do. Everything else is either a large lease, long-term lease that you don't want to vacate for dead rent or it's -- or these are stores that are on the bubble where if you can continue to see some of this growth that we are showing now, you could turn these stores into something profitable.\n\nThat would be our primary goal.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nOK. And then just lastly for me, it's been pretty well publicized the challenges of shrink. I was wondering whether you've been able to make any recent changes that could lead to shrink actually declining on a year-over-year basis over the next year?\n\nHeyward Donigan -- Chief Executive Officer\n\nAndre, can you comment on that?\n\nAndre Persaud -- Executive Vice President, Chief Retail Officer\n\nYeah. Thanks, Heyward. Good morning. What I would share first and foremost as we think about shrink, the safety of our associates and our customers is prioritized in how we manage this.\n\nAnd similar to others, we have seen a rise. It's organized crime driven. And to answer your question on what we're doing, we continue to be very, very involved working with our organized retail crime team, with local law enforcement and government to address. We continue to have a range of product protection opportunities in our stores, and that's how we're managing it at this point in time.\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nGreat. That's all for me. Thank you.\n\nOperator\n\nYour next question comes from the line of Carla Casella from JPMorgan. Your line is open.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nHi, thank you. On the CMS receivable sale that was nice to see in the quarter, do you still expect to do about 450 million to 500 million for the full year?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nHey, Carla, thanks for the question. Yeah. Probably more like 450 million for the full year. So, the build in the second half of the year is greater than what it is in the first half of the year.\n\nSo, we've got a pretty sizable receivable that's going to build through December that we'll be looking to securitize here before the end of the fiscal.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nAnd any change in terms as you look at that?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nOnly change in term is that -- it's no change in terms. It's tied to SOFR. So, the interest is a little higher than what was last year, consistent with overall market conditions but no change in terms other than that.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK, great. And then on your overall script count, can we just get an estimate kind of where it stands today? I think at year-end, it was 170 million on an equivalent basis.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nThat's directionally correct. That's directionally correct on the non-30-day adjusted. So, this is not adjusting for 30-day equivalents.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK. And then I'm just curious, with the changes in the cost cuts you're talking about at Elixir, how integrated are Rite Aid and Elixir at this point? I mean where does business overlap in terms of is there a shared overhead, warehousing, or how do they interact on a customer basis?\n\nHeyward Donigan -- Chief Executive Officer\n\nYeah. So, we did a significant amount of integration between Elixir and Rite Aid over the last three years. That's -- that was the first initial big body of work that we undertook. So, all of the corporate functions like HR and finance and legal and compliance all roll up into one leader within the Rite Aid enterprise.\n\nRegarding mail order and specialty procurement, we leverage the companywide procurement arm to purchase those prescriptions, which is part of how we get such good economics. And then, of course, Elixir, in and of itself, is undergoing a significant integration between the two PBM businesses that they have, and we call that Project Fusion. And that project, which will be complete over the next couple of years and is well underway is going to release additional synergies, economics, process improvements, and savings. So, consider those kind of the two big bodies of work, and I'm not sure if that answers your question fully.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nNo, that's great. And then how would you cut costs there? Are there assets closures and asset sales that we could look to for potential proceeds as you're cutting costs as well, or it's pretty much just an overhead analysis?\n\nHeyward Donigan -- Chief Executive Officer\n\nChris, do you want to answer that?\n\nChris DuPaul -- Chief Operating Officer, Elixir\n\nYes. I guess one piece of color I would put on it is when you look at the performance of Elixir across the course of this year, it would be misleading to say that it is entirely overhead in cost cutting. We certainly have done significant work throughout the year to streamline operations to take out SG&A and to right side according to the losses that we had coming into this calendar year. And we'll do those same types of actions as we go into next year to adjust the business.\n\nBut the performance that you're seeing in Elixir from Q1 through Q4, is more heavily driven by the changes we've made in the overall operations and performance of the business, the procurement economics that we referenced earlier. And that's why you see the EBITDA margins climbing throughout the year, and that's why you see the EBITDA performance stacking up so well over prior year. It's not because we just ripped all the cost out of the business. It has much more to do with we're doing a better job operating the PBM and that delivers better value to our clients, and it delivers better value to our shareholders.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nAnd Carla, what I would add is -- \n\nHeyward Donigan -- Chief Executive Officer\n\nAnd we do --\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nSorry. The only thing I would add, Carla, because I think part of what you're asking is about monetizing assets, really you think about like what we have at Elixir between the mail order facility, between the specialty pharma business and the Laker adjudication platform, those are all assets that really help us compete in the business and they are very valuable to us. So, when I would think about assets to monetize for cash in the overall enterprise view, it's really more on sale leasebacks and any fall sales we would do when we close the store.\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nOK, great. Thank you.\n\nOperator\n\nAnd we have time for one more question. Your final question comes from the line of Karru Martinson from Jefferies. Your line is open.\n\nKarru Martinson -- Jefferies -- Analyst\n\nGood morning. So, when we look at that 700,000 life loss here at the start of the new year, what is Elixir going to be standing at and kind of what's the opportunities to get part of those lives back in terms of live served?\n\nHeyward Donigan -- Chief Executive Officer\n\nChris.\n\nChris DuPaul -- Chief Operating Officer, Elixir\n\nYes. So, as we move into 1/1 of this year -- right now, we are coming in roughly around 2.3 million. So, we're forecasting that 700,000 life loss, and so you can do the math there. As we look forward, where I think we have the opportunity to gain that back, is you have to look at both sides of the business, you've got to look at the PBM side in terms of our PBM services.\n\nAnd as Heyward mentioned, we're actively building our pipeline. We're looking forward to the upcoming selling season. The last year was very much a rebuilding year for us. We went into the season with a relatively new commercial team, and we had several gaps in critical areas, including sales and underwriting.\n\nAnd so, as we move into the 2024 selling season, we filled many of those gaps, and we've also matured as a team. And so, we're entering this year, I think, as a stronger and more sophisticated organization. And so, when we look at how we're going to go to market, we're spending a lot of time with the top consultants, but we're also creating sort of a clear road map for our sales function with a set of key milestones across the next year to significantly increase the lives at the top of the funnel. Because if we look back on the prior year, we think that's one area where we really have the opportunity to grow lives and to bring more opportunities from our target markets into the top of the funnel.\n\nWhen you move on to the Elixir Insurance side of this, which is a significant portion, we've been very consistent over the last several earnings calls that the individual Part D market, which we participate in, is a very challenging market to be in as a stand-alone plan. And so, we've been, you know, very consciously managing the economics of that, making choices around how we manage that. And that's why you've seen the decline -- the steady decline in lives. On the flip side of that, we also participate on the EGWP side.\n\nAnd in contrast, we see the EGWP side of Part D as a much more attractive segment for us, both in terms of the margin and economics that are available but also in terms of our position and our right to win their relative to large integrated health plans because our interest is clean and clear in managing the EGWP benefit. And so, I think what you'll see over time is we'll work to rebuild the PBM services side focusing in our target markets. And then I think on the Elixir insurance side, we'll gradually, over time, continue to make that shift from the individual market to the EGWP and supporting the Medicare Advantage clients.\n\nKarru Martinson -- Jefferies -- Analyst\n\nOK. Last quarter of shrink was, I believe, like a $5 million headwind. What was it this quarter, and what are your expectations for fourth quarter?\n\nHeyward Donigan -- Chief Executive Officer\n\nMatt.\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nIt was a $9 million increase quarter over quarter for third quarter. We haven't given a specific number for fourth quarter, but certainly, one of the components of us guiding down versus where we were last quarter is we do expect continued shrink headwind.\n\nKarru Martinson -- Jefferies -- Analyst\n\nSo, year to date was 9 million or third quarter was 9 million?\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nThe third quarter was 9 million. Third quarter was 9 million.\n\nKarru Martinson -- Jefferies -- Analyst\n\nOK. And then just lastly, there's been a lot of news of settlements with CVS, Walmart, Walgreens on the opioid front. Where are we today on that, and what are our expectations?\n\nHeyward Donigan -- Chief Executive Officer\n\nYes. So, we have settled about three states, critical states, West Virginia, Ohio, and New York, for nominal settlement numbers. So, we're pleased with that. We were not a part of the global settlement agreement that CVS, Walgreens, and Walmart participated in.\n\nWe were not invited to be a participant in that. I think they were going where the money is. And, yes, it's a framework now for global settlements for other companies like us, smaller companies. And we do anticipate that we will be a part of next ground of global settlements.\n\nWhen that is, we have no idea. And how much, we couldn't even comment.\n\nKarru Martinson -- Jefferies -- Analyst\n\nAll right then. Thank you very much. Appreciate it.\n\nOperator\n\nI will now turn the call back over to Ms. Heyward Donigan for some closing remarks.\n\nHeyward Donigan -- Chief Executive Officer\n\nThank you so much. OK. Thanks for the questions. And I just want to close by thanking all of our teams for the work that they've done in this quarter, particularly the pharmacists and technicians across our organizations, the service associates and store managers in the store who have kept our customers happy.\n\nAnd you can tell they're happy because we're taking share and growing the business. But more importantly, helping our customers achieve whole health for life, especially in these times of any kind of sickness seems to be ranging in this environment right now, not just COVID and flu. So, we want to protect our people, our teams, their -- our customers, their children, their parents and their pets, each and every day. I would also like to congratulate the Elixir team for executing against an aggressive plan.\n\nAnd lastly, I want to thank our corporate associates who have shown incredible agility and ingenuity in identify and managing these new initiatives and the past initiatives, but more importantly, these hundreds of new initiatives for our future growth, for our shareholders, for our customers and for our teams. Thank you for joining us today, and I wish you all a really happy and healthy holiday season.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nByron Purcell -- Vice President, Investor Relations and Treasurer\n\nHeyward Donigan -- Chief Executive Officer\n\nMatt Schroeder -- Executive Vice President, Chief Financial Officer\n\nElizabeth Anderson -- Evercore ISI -- Analyst\n\nGeorge Hill -- Deutsche Bank -- Analyst\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nChris DuPaul -- Chief Operating Officer, Elixir\n\nBill Reuter -- Bank of America Merrill Lynch -- Analyst\n\nAndre Persaud -- Executive Vice President, Chief Retail Officer\n\nCarla Casella -- JPMorgan Chase and Company -- Analyst\n\nKarru Martinson -- Jefferies -- Analyst\n\nMore RAD analysis\n\nAll earnings call transcripts"
}