{
  "companyName": "New Relic",
  "companyTicker": "NEWR",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/new-relic-newr-q2-2023-earnings-call-transcript/",
  "content": "New Relic (NEWR 1.49%)\nQ2 2023 Earnings Call\nNov 08, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon. My name is Bailey, and I will be your conference operator today. At this time, I would like to welcome everybody to the New Relic second quarter fiscal year 2023 earnings conference call. [Operator instructions] It is now my pleasure to introduce your host Ingo Friedrichowitz, senior vice president of investor relations and corporate finance.\n\nThank you. You may begin.\n\nIngo Friedrichowitz -- Senior Vice President of Investor Relations and Corporate Finance\n\nGood afternoon, and welcome to our second quarter fiscal year 2023 earnings call. On the call with me are Bill Staples, our chief executive officer; and David Barter, our chief financial officer. On our Investor Relations website, you can find the earnings press release and investor summary slide deck, which is intended to supplement our prepared remarks during today's call. In addition, an audio replay of this call will be available on our website ir.newrelic.com in a few hours.\n\nDuring today's call, we will make forward-looking statements including about our business outlook and strategies, which we base our predictions and expectations on as of today. Our actual results could differ materially due to a number of risks and uncertainties, including the risk factors in our most recent 10-Q and our upcoming second quarter 10-Q to be filed with the SEC. Also, during this call, we will discuss certain non-GAAP financial measures. We have reconciled those to the most directly comparable GAAP financial measures in our earnings release.\n\nThese non-GAAP measures are not intended to be a substitute for our GAAP results. And with that, I'd like to turn it over to Bill.\n\nBill Staples -- Chief Executive Officer\n\nThank you, Ingo. I'm pleased to report another solid quarter with revenue at $226.9 million, a $10.4 million sequential increase over last quarter. Our non-GAAP operating profit was $6.9 million, a $24 million improvement over last quarter. Importantly, this also represents our first profitable quarter in two years.\n\nLast quarter we told you that we recognize the importance of driving both growth and profitability and that we would pursue cost discipline while continuing to invest in our future. Today's earnings report is the first installment on that commitment. I'm incredibly proud of the New Relic organization for embracing this mentality, which we believe positions us best to deliver a compelling value proposition to customers, while creating sustainable value for shareholders. Dave will share more about our financial performance in just a minute, as well as our updated guidance.\n\nHowever, before I hand it over to him, I'd like to remind everyone what makes New Relic differentiated and unique with our product and our go-to-market strategy. In 2008, New Relic invented cloud APM for application engineers. Today we're a source of truth for all engineers to make decisions with data across their entire software stack and across the software life cycle. There are an estimated 25 million engineers in the world across more than 25 distinct functions.\n\nToday, the vast majority of those engineers either don't have access to data about the performance and health of their systems or the data they have is tied up in legacy monitoring tools. We see observability as still a relatively new and emerging practice that will grow over the coming decade and we have been transforming our software and business model to win in the long run. While competitors still sell an array of specialty tools at disparate rates, propagating the customer challenges of the past decade, only New Relic provides an all-in-one platform that is built and sold as a unified experience and cloud-scale data platform for every engineer. Let's take a look at how our strategy is playing out and some recent highlights.\n\nFirst, let's focus on customer acquisition. Unlike competitors, who land new customers with a sales-led approach, only New Relic offers a unique perpetual free tier that offers every engineer an opportunity to learn and master observability, no credit card required or a fear of lock-in. Since launching our free tier and pay-as-you-go model two years ago, we've been working to steadily increase the efficiency of this experience and nurture customer value to paid levels. In the second quarter, we added over 800 net new paid platform customers using the high-volume low-cost product-led growth model.\n\nAt this rate, New Relic is now adding new paid platform customers at industry-leading levels. Our progress here is masked by a long tail of small APM-only legacy customers, who signed up years ago and continue to pay us small amounts each month, but whose spend is not increasing and whose churn partially offsets our new customer growth. This fast-growing cohort of customers, are new to the platform and embracing full stack observability practices at a rapid rate. It includes companies of all sizes from individual developers in the exploration phase to start-ups getting off the ground, as well as large Fortune 2000 companies with engineering teams seeking to modernize their engineering practice.\n\nThe spend in this customer cohort ranges from a small initial monthly amount to five-figure annual or multiyear contracts. In fact the team was able to nurture several customers away from leading competitors and into six-figure contracts. Let me tell you about one of them Tibber. Our consumption-based pricing model was the driving force behind our recent deal with Tibber, a fast-growing company in Europe using digital technology to make electricity consumption smarter.\n\nThey evaluated one of our close competitors but found that a host-based pricing structure of competitors limits agility. With New Relic, they get better economies of scale as their cloud infrastructure grows and predictable pricing as they expand their engineering team. They also appreciated how New Relic provides the opportunity to ingest telemetry data from any source and works well with modern microservice architectures on the cloud, which makes correlating data from infrastructure hardware mobile apps and web apps much easier. Next, let's turn our focus to our sales-led approach.\n\nCustomers graduate to our sales-led motion when they expand consumption beyond $50,000 annually and wish to make a contractual commitment to get better rates and receive additional technical services and support. Our sales-led motion, this quarter, were strong. The sales team is focused on three key priorities: number one, nurturing value realization with our customers against their committed spend through increasing platform adoption and usage; number two, helping customers align their contract commitments with their increasing usage; and number three, opportunistically landing new large enterprise customers. Let's talk through examples of each of those three priorities.\n\nFirst, a look at consumption. This quarter, we saw customers increase their consumption run rate in aggregate by net $50 million, a record one quarter increase and driven by increase in both users and data. A few examples of some of the biggest increases, one of our large streaming media customers increased their CRR from $4.6 million to $5.9 million during the quarter. A telecom went from $5.7 million to $7.9 million; a beverage company increased from $3.1 million to $4.0 million; and an online retailer moved from $8.8 million to $10.8 million in just one quarter.\n\nThe strength of CRR growth this quarter demonstrates the excellent product market fit and power of the consumption business model. However, with CRR growth continuing to outpace customer commitments, we also see a continuation of the trend of customers who manage consumption down to budget, especially in the final quarter among many of our accounts. I've highlighted this in the last few earnings calls and the gap between CRR and commitments increased this quarter, despite strong performance in contract renewals. Q3 and Q4 represent our opportunity to help the majority of our customers who are up for renewal to plan and secure budgets to support their ongoing consumption needs.\n\nSecond, let's look at a few examples of how we're helping our customers align commitments to support increasing consumption. Our customers are looking for ways to navigate through shifting economic, social and technological change by consolidating tool spend from other vendors and standardizing their observability with New Relic. Our sales team increased our in-quarter committed renewal base incrementally by three times compared to the quarter prior as we scaled the early renewal pilot that I talked about last quarter. I am pleased that we were able to pull forward nearly $18 million in early renewals for customers who are ready to renew ahead of schedule.\n\nLet's look at how we're doing that. A global online game and entertainment company increased their commitment from a mid-six-figure annual pool of funds to a three-year high-seven-figure savings plan agreement. The pandemic accelerated their digital transformation and growth in online social gaming. Looking for more efficiency, the company replaced four separate commercial and open-source competitors to standardize on New Relic as their observability platform, increasing the productivity of their engineering teams and improving their costs.\n\nNew Relic is now partnering with them in their cloud transformation journey to be 100% cloud native by the end of this year. We continue to have success in moving large, multiyear, legacy customers over to the new platform. For example this quarter an online travel company transitioned from our legacy business, where they had a $1 million annual spend to a new platform agreement for three years and more than eight-figure commitments. They selected us over competitors as they were looking for a developer-first observability platform to consolidate all their tools get deep cloud cost visibility and support a robust site reliability engineering organization managing their Kubernetes environment.\n\nAnd finally, our sales team continues to opportunistically land some very nice new logos this year. For example, we recently landed a large high seven-figure three-year strategic agreement with a grocery retailer in the UK, Tesco. They had been using competitors but once again found that a host-based pricing model limited their ability to achieve full stack observability, as they moved to a cloud-native microservices-oriented architecture. We're helping them standardize observability best practices, increase the reliability of their systems and identify business-impacting use cases.\n\nOur product organization contributed significantly to the ongoing efficiency improvements in gross margin and in parallel launched many small and large capability improvements to support increased value and consumption by our customers. The number of customers using our top four capabilities; APM, infrastructure, logs and browser grew again this quarter from 31% to 34%. As customers adopt more of the platform their consumption generally increases as does our revenue. The more of the platform our customers adopt, the more value they get.\n\nWe also announced several key partnerships this quarter with AWS, Atlassian, as well as strategic partnerships with multiple security vendors as part of our marquee innovation Vulnerability Management. The public preview launch just a few weeks ago has already garnered record interest from our customers with several thousand engaged users and we're on track to begin general availability early in the New Year. We also completed a technology tuck-in acquisition of K2 Cyber Security for approximately $20 million in the quarter to extend this offering further. In closing, we feel well-positioned as a strategic partner to our customers helping them navigate through economic, social and technological change.\n\nOur all-in-one platform is optimized to help them standardize their observability practice on New Relic and thereby save money and increase productivity of their engineering teams. Before I pass to Dave, I'd like to address what we are seeing in the business climate and how we're responding. Last quarter, I told you that we have not yet seen a meaningful impact from the macroeconomic climate. But that in an uncertain world we would control what we can control.\n\nToday, the macro clouds appear to be getting darker, but our mentality remains the same. Nearly every business leader I speak with today is looking hard at their budget and is looking for efficiency. We believe that this environment will ultimately serve to highlight the customers that we have superior alignment and value proposition of our consumption model versus competitors' pricing models. That said like our competitors, we are not immune to the macroeconomic conditions in the near-term and we see these headwinds in our conversations with customers.\n\nFor this reason, we are being prudent in our guidance, particularly, given increased adverse FX impact, consumption patterns and last year's seasonal variation. Dave will share more detail on our financial performance and outlook in just a minute. However the macro conditions unfold New Relic's response will be simple and in keeping with the strategy we have communicated to you. First, we will work tirelessly to help our customers succeed and drive superior value and efficiency from New Relic.\n\nIn an uncertain time, we are well-positioned to serve as a strategic partner to help our customers as they undertake cloud migrations and digital transformation initiatives we believe will remain investment priorities regardless of climate. Second, we will maintain a rigorous focus on cost discipline to drive profitability for our own business. Doing so will enable us to grow our margins regardless of the business climate, while also providing fuel for investment in our future. We are committed to continue to invest in innovation and our long-term strategy so we can deliver increasing value to customers with fair and transparent consumption pricing throughout this uncertain period.\n\nWith expanding leadership and new talent onboarded, I feel even more confident in our ability to execute and raise the standard of our performance. We have turned an important financial quarter with our first quarter with non-GAAP profit since the beginning of the transition and are committed to continued profitable growth. We are humbled by the opportunity before us, and hungry to continue driving toward our full potential. Dave, with that, over to you.\n\nDave Barter -- Chief Financial Officer\n\nThank you, Bill. Our financial results for the second quarter reflect our team's focus and execution. We exceeded the top end of the guidance for revenue and non-GAAP operating profit. Our revenue was $226.9 million, up 5%, or $10.4 million on a sequential quarterly basis, and an increase of 16% from a year ago.\n\nNon-GAAP operating income was $6.9 million, a significant improvement over last year when we incurred a loss of $6.4 million in the second quarter. Non-GAAP earnings per share was $0.13 on a share count of 68.2 million shares. We are focused on delivering profitable growth and we achieved this milestone ahead of schedule. I am pleased with the progress we've made adjusting our cost structure during the quarter.\n\nWe remain focused on delivering substantial levels of revenue growth and profitability in the future. Turning to our growth. During the quarter, we added more than 800 net new platform customers through our product-led growth engine. These customers come from diverse industries and geographies including Fortune 2000 companies and the public sector.\n\nThis is a key ingredient for setting up the foundation for growth in future quarters. It is important to note our net new customer growth from PLG is partially offset by the churn of legacy customers who only use our old APM product. This headwind naturally will diminish over time, which is why we are so excited for the company's future prospects. Non-GAAP gross margin increased another 1.2 percentage points over our first quarter to 73.7%.\n\nWe are on track to exit the year with a non-GAAP gross margin of 75% or higher, based on the execution of our key initiatives. We remain confident we can expand our gross margin over time even while investing in our multi-cloud strategy. During the quarter, we completed our restructuring. The one-time cost was $7.2 million and less than the range of $8.3 million to $9.3 million we had provided.\n\nWe expect this restructuring will save us approximately $6 million per quarter going forward. Building on this theme, we continue to improve our sales and marketing efficiency. As we look to next year, we expect to improve the magic number, or CAC by 20% or more as the prior sales model commission expense continues to add and our efficient product-led growth sales motion continues to deliver results. And finally, in G&A we also have been focused on reducing cost.\n\nWe will be reducing our real estate footprint through subleasing and then allowing leases to expire in line with our shift to the hybrid work model. I expect each quarter we will make progress in this area. Shifting to the balance sheet. We ended the quarter with $833 million in cash, cash equivalents and investments.\n\nWe have a convertible note that is coming due on May 1, 2023. It is our intent to repay this with our cash. We are not currently interested in or pursuing additional financing at this time that would dilute our shareholders. Before moving on to our guidance, I'd like to share a few thoughts.\n\nThe business executed well in Q2. We're pleased with our progress on our strategic initiatives including the rate of new customers, customer base expansions and the level of consumption. Our revenue has increased sequentially by over $10 million in each of the last two quarters. However, like every business we are not immune to the macro environment.\n\nWe are adjusting our full year outlook by 1% at the midpoint. It is driven by three factors. First and foremost, the impact of FX has been steadily growing each quarter and we expect the impact in Q3 will be more significant than in Q2. On a full year basis, it may represent a headwind of $5 million to $7 million.\n\nSecond, we also see customers being more budget sensitive. And third, we are also mindful of seasonal consumption patterns in particular over the holidays. With that, let's move on to the guidance. For the third quarter of fiscal year 2023, we expect revenue between $230 million and $235 million.\n\nWe expect non-GAAP income from operations between $9 million and $11 million, and non-GAAP earnings per diluted share between $0.14 and $0.17. For the full year fiscal 2023, we are adjusting our guidance range. We now expect revenue between $912 million and $920 million. At the same time, we are raising non-GAAP income from operations to a range of $8 million to $12 million and non-GAAP earnings per diluted share to a range of $0.16 to $0.22.\n\nTo conclude, I'm pleased with the performance we delivered in the second quarter and our focus on executing our plan. Equally, I'm energized by our strategy and we're very focused on delivering long-term profitable growth. With that, let's open up the call for questions. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question for today comes from the line of Kingsley Crane from Canaccord. Please go ahead. Your line is now open.\n\nKingsley Crane -- Canaccord Genuity -- Analyst\n\nHi. Thank you for taking my question. This one is for Bill. So thinking back to the New Relic One platform release, highly attractive data ingestion pricing idea with that customers could gain more value put more data into one platform.\n\nYou mentioned the Tesco and Confluent wins we appreciate that. I'm curious now that some time has passed, where do you feel you are in terms of customers standardizing on New Relic versus New Relic continuing to be one option in a broader ecosystem?\n\nBill Staples -- Chief Executive Officer\n\nThanks, Kingsley. Great question as always. I think when we launched our strategy a little over two years ago, we had the sense that one of the most important customer problems to solve was this problem of tool proliferation. And we really wanted to be a source of truth for engineers not just application engineers but those who manage the infrastructure of the company either on-prem or in the cloud, as well as network engineers, mobile engineers, the whole – and very disciplined of engineering.\n\nWe set up our go-to-market strategy to follow suit, right, to price on all data types and all data sources, so it would be easy to send data to our data platform at very low cost. And then also easy to add engineers, regardless of specialty, so that they can all collaborate on top of that data. In hindsight, I'm really glad we made that move especially given the current macro climate, where companies around the globe are looking for efficiency. They've got the tool proliferation problem still.\n\nAnd we now can position our platform as the best all-in-one place to standardize on New Relic. We can help offset hard costs. They have with other vendors and we can also increase the productivity of their engineering team by just bringing everyone into one place. So it's easier to get the data you need to resolve the customer incident and keep the business up and running healthy.\n\nSo I feel like we've made really good progress. We understand the value proposition. We're getting much stronger and better at telling that value proposition. And now that there's a forcing function with customers looking at their spend, given the macro climate, we're seeing increasing success at that standardization.\n\nI shared a few of those examples earlier in the script.\n\nKingsley Crane -- Canaccord Genuity -- Analyst\n\nOK. Thank you, Bill. That's really helpful. And then a quick one for Dave.\n\nJust to clarify -- I believe you mentioned on the call, but NRR at 119% and year-over-year revenue growth at 16%. Is this due to the legacy customer churn?\n\nDave Barter -- Chief Financial Officer\n\nIt is. That certainly weighs on the math when you actually look at the business.\n\nKingsley Crane -- Canaccord Genuity -- Analyst\n\nOK. Well, congrats on a solid quarter. Thank you.\n\nDave Barter -- Chief Financial Officer\n\nYeah. Thanks so much.\n\nOperator\n\nThank you. The next question today comes from the line of Sanjit Singh from Morgan Stanley. Please go ahead. Your line is now open.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nThank you for taking the questions and congrats on the underlying customer momentum. David, I had a couple of questions on guidance for -- on a couple of different factors. Is there any way to think about the reduction in the second half guide in terms of the impact of FX in 3Q and 4Q? I think, Bill, sort of, mentioned the dynamics of consumption run rate exceeding commitment, that being a factor, macro and then I remember last year we went into some seasonality with customers. Any way to think about how those various factors sort of play into the second half guidance?\n\nDave Barter -- Chief Financial Officer\n\nSo let's start with FX, because that's one that we can quantify. And I think, overall, as I shared, we see it at the low end at $5 million and at the high end it's about $7 million. So if you were to think about it on a quarterly basis in the second half, you're kind of looking at a couple of million bucks at least per quarter, could be up to maybe $2.5 million per quarter. So FX has -- just -- FX for us with a growing subsidiary in Japan has continued to step up each quarter.\n\nAnd, again, it will just be more pronounced in the second half. So that's certainly one component of it. And I think I think you called out that second component, which I alluded to in our remarks a secondary factor that we're looking at is some of those elements around seasonal consumption. And what we would highlight is, seasonal consumption combined with a macro environment that's clearly a little bit different than what we saw last year.\n\nAnd so it's a bit of an extrapolation on an unknown factor, but that actually -- that's featured into the math as well.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nOK. Got it. And so, Bill, sort of a similar question to Kingsley around the opportunity to consolidate spend. Is there any sense of within the New Relic customer base, on average, how many different tools they're using? And to the extent there's a category of competitors that you feel like your most prime to displace or at least consolidate that spend, would that be kind of the open source community, the commercial tooling community, some of the legacy APM vendors? What's sort of the opportunity around the consolidation effort?\n\nBill Staples -- Chief Executive Officer\n\nYeah. Good question. Well, first say, the majority of consumption increases we see in users and data are really driven by the greenfield opportunity out there. There -- most engineers don't yet have access to this data and don't practice observability.\n\nAnd most applications and infrastructure are not yet fully observable. And so as businesses embrace this practice and rely on our data and platform to run and operate their business that naturally drives consumption. To your question though about opportunity through tool consolidation, there isn't a customer that I talked to of any considerable size that doesn't have literally a dozen or more tools. And it is a combination of both commercial and open source systems that they're using today.\n\nAnd they realize the pain of that both from a productivity perspective, as engineers are swiveling between different tools and systems, or looking at different disparate data sets, or also from a cost perspective, they've got contracts with multiple vendors and they can't rationalize the expanding spend across multiple vendors. So it's a really great opportunity for us to both it help them make their environment more observable as they grow their digital presence, but also help them save money and increase the productivity of their engineers.\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nMakes lot of sense. Thank you, Bill.\n\nOperator\n\nThank you. The next question today comes from the line of Fred Lee from Credit Suisse. Please go ahead. Your line is now open.\n\nUnknown speaker -- Credit Suisse -- Analyst\n\nThis is Tim on for Fred. Thank you so much for taking my questions. First, could you give us more color as to, what you're seeing in overall consumption trends to-date and especially heading into the end of the year here? Any incremental color there would be helpful.\n\nBill Staples -- Chief Executive Officer\n\nYeah. We mentioned in Q2, we had a record $50 million consumption run rate increase, so from start-to-finish the quarter our CRR metric increased $50 million. To give you a little bit more color on that, if you measure just the increases, those who ended the quarter with a higher rate of consumption, we actually -- they actually added $100 million in consumption run rate. And then if you look at those who decreased their consumption from start-to-finish of the quarter, they offset that $100 million by about $50 million in decrease in consumption run rate.\n\nThat gives you a sense of both the power of this consumption business model, and how fast consumption can grow, but also gives you a sense, for some of the headwinds around consumption. The decrease in consumption comes about from a number of factors. First, our customers do have some seasonality in their own business as they do product launches or large sale events. Of course their consumption run rates are going to spike to support those events.\n\nAnd then it naturally comes down bigger than fast. There's also just standard business and talent cycles. As engineers leave an organization, the user-based consumption goes away, as they hire it comes on, same thing with apps and infrastructure. Applications or infrastructure get deep revisions or deprecated that telemetry data goes away as new one gets put up, it increases.\n\nSo there's that factor that drives the ebb and flow of consumption. Finally, the one that we're really focused on, is, the consumption run rate versus the commitments that customers make. The vast majority of our revenue is covered with commitments. But as I've shared previously, the consumption run rate far exceeds those commitments and it's actually continuing to increase.\n\nWe're trying to help our customers align their budgets through commitments to back up that consumption. But as the gap grows, it sets up the environment, the opportunity for customers toward the end of their contract in particular to manage the consumption down to avoid any excess overages. And then that drags on our revenue in that final quarter of the contract. And so Q3 and Q4 that is a huge focus for us.\n\nIt continues to be a focus for us. We had good success I mentioned last quarter, bringing a net new $18 million of revenue into the quarter through those early renewals. We're striving to beat that in Q3 and Q4 with the number of customers who've already reached the end of their commitment even though their contract has now expired and help them do an early renewal to shore up that consumption growth with committed spend. And we'll continue to focus on that as we rightsize the consumption run rate with the commitment we believe will unlock more steady predictable growth in consumption going forward.\n\nUnknown speaker -- Credit Suisse -- Analyst\n\nThank you. As a follow-up with Mark joining the organization as CRO, could you help us understand whether we should be thinking about any changes to the product-led growth organization or the self-led organization and just the general go-to-market structure?\n\nBill Staples -- Chief Executive Officer\n\nYeah, good question. You hopefully all saw that we announced we hired Mark Dodd as our chief revenue officer. Really excited to have Mark on the team. He joins us from AWS.\n\nAnd prior to that Dell and Microsoft, where he has been an executive sales and technical sales leader for some world-class companies and multibillion dollar businesses. He is a great addition to New Relic. And what I've done is taking this opportunity to bring together all of the constituents within the company that serve our sales-led business. This ranges from our -- obviously our sales team, but also our customer success, our customer support, our technical services team and enablement, all under Mark.\n\nSo that he has the mandate to help with that balance between CRR and ACR that I just described. You've got the technical services teams that are driving consumption hand-in-hand with our customers and you've got the sales organization that's focusing on helping customers secure budget with commitments and contracts. And so by putting all of that under one leader, we not only get the benefit of his scale and experience, but we have all the resources that he needs to help the company support our customers in continuing their consumption growth. So I'm really excited to have him on board.\n\nAnd I think it will only help us as an organization to simplify and focus our go-to-market motion to continue to accelerate the business.\n\nUnknown speaker -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question today comes from the line of Mike Cikos from Needham & Co. Please go ahead. Your line is now open.\n\nMike Cikos -- Needham and Company -- Analyst\n\nHey, guys. Thanks for taking the questions here. I did want to just circle up on some of the guidance questions that we're having and really just to get a little bit more color if I could, but when we look at the full year guidance reduction that we're talking about, maybe you can parse that with the commentary that you guys have had as far as the $18 million that were renewed early in 2Q. Is there a thought that early renewal that we're seeing in 2Q, kind of creates a little bit more of a headwind, when we think about Q4? And then the other part around the guidance question that I have is, the implied 4Q operating profit is now down from where we were previously.\n\nAnd just given some of the cost discipline that you guys are talking to just, curious why we would be seeing a downtick for Q4 profitability?\n\nDave Barter -- Chief Financial Officer\n\nThat's -- great questions, Mike. Thank you very much. In terms of the early renewals, what I -- the way I think about it is contract enable consumption. So by securing an extra $18 million of incremental contractual growth, it alleviates one of those pressures that Bill highlighted around people throttling or moderating their consumption, as they may be in the final two or three months.\n\nSo for us I think it is the element of it just allows them to keep that breadth of monitoring and observability. And as they continue to expand it, it just allows them to do it at the level of depth and completeness they'd like to do it, across their entire engineering team. So from my standpoint, it's almost -- it kind of enables you to continue prosecuting the opportunity and enabling consumption in a frictionless way. Does that help Mike, on that point?\n\nMike Cikos -- Needham and Company -- Analyst\n\nIt does. It does. Thank you. And then the commentary on the 4Q profit? Yeah, go ahead.\n\nDave Barter -- Chief Financial Officer\n\nYeah. Great question. So in terms of guidance maybe, I didn't do a good job on messaging. I think what we were trying to highlight is, felt very good about the $6.9 million of non-GAAP operating profit.\n\nI think we went ahead and we came in a little bit high on Q3, offering a guide of nine to 11. I think consensus was just below that, on that midpoint. And then for the full year, we nudged it up a little bit at the midpoint, in line with that outlook. So I'd say, we're increasingly optimistic around our ability to drive profitable growth and that's what we are trying to communicate through the outlook.\n\nMike Cikos -- Needham and Company -- Analyst\n\nThat's, great. Thank you for clearing that up. And if I could just tack on maybe one more if I could. But I guess now that you're in the seat here Dave, and congratulations.\n\nI know this is your first quarter in the CFO role on an earnings call for New Relic, but could you help us think about what changes if any have been implemented to the way New Relic goes about with its philosophy for guidance? And I know, it hasn't come up yet, but to the extent it's possible, can you guys also start talking about what the price increases that took place earlier. And the new data tier has that shown up in any way in the business model, or is that still coming down the pipe? Thank you.\n\nDave Barter -- Chief Financial Officer\n\nThat'd be great. Well, in terms of guidance, I think I guess what I'd observed I kind of said on the last call, is a bit of a buy standard. But I think maybe, I think you had observed in maybe a couple of others that the second half had an implied acceleration in it. What I would, I guess call out in this guidance, is from midpoint to top end of the range for Q3 and Q4, it implies a sequential step up of about $6 million to $8 million.\n\nSo I think what you'll find is that it has a very consistent lens through it, as you look at the outlook. Yeah, I'd say the other element, I'll maybe highlight in this guidance as well, particularly on profitability is, earlier I highlighted in our 6.9, it started to factor in some of the one-time costs associated with reducing our real estate. And by that I mean, what I'm specifically highlighting is as we close down offices sometimes, we need to write off some of the leasehold improvements. So non-cash charges.\n\nSo we can have left ourselves a little bit of room to work, knowing that leases will roll off at different points in time as we find opportunities to sublet. So I'd say in terms of profitability again, I think we feel like we have multiple levers and multiple opportunities to increase. But again, knowing that we'll be shrinking that real estate footprint, we've given ourselves a little bit of room to work knowing that that can impact profitability with some non-cash charges. Does that help at least in terms of guidance methodology and some of the things that were kind of on our minds?\n\nMike Cikos -- Needham and Company -- Analyst\n\nIt definitely does. It definitely does. Thanks, David. And then the other question that I had asked as well was around the increased pricing to the core data, as well as the – I guess new data tier that you guys have rolled out.\n\nI believe it was in June.\n\nDave Barter -- Chief Financial Officer\n\nYeah, it's a great question. And I think right now our standard observability is at $0.30. Customers, if they would like to go up to data plus that is $0.50. What we also offer customers is the opportunity, if they would only like to have standard but they'd like to have some of these enhanced features, they're able to buy them on a one-off basis as well.\n\nAnd so I'd say structurally what we're seeing and what I think you'll see in the data over time is that price and mix continue to climb over time as people adopt more and more of the platform. But we're pleased with how people adopt standard. We're pleased with the momentum that we have on Data Plus, as well as people choosing premium features such as FedRAMP or HIPAA or high-performance queries.\n\nBill Staples -- Chief Executive Officer\n\nYeah. And just a reminder I think we've shared on previous calls. For the majority of customers that price increase doesn't happen until their contract comes up for renewal. The majority of our renewals happen in this quarter Q3 and Q4.\n\nAnd we have had good success in Q2 and Q1. Once we introduced the price increase very good acceptance from customers on the standard data price increase and very good success in Q2 as well getting more and more customers into Data Plus. So that's definitely happening good adoption and uptake. It feathers into the revenue throughout the coming year and especially Q3 and Q4, as we go about the majority of our renewals.\n\nMike Cikos -- Needham and Company -- Analyst\n\nAwesome. I'll leave it there. Thank you, guys. Appreciate it.\n\nBill Staples -- Chief Executive Officer\n\nThanks so much.\n\nOperator\n\nThank you. The next question today comes from the line of Michael Turits from KeyBanc. Please go ahead. Your line is now open.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nHey, guys. Good evening. And I really like to see the raise in the EBIT dollar guide for the year discipline on that. So I just wanted to really clarify on the consumption – come back to clarify on the consumption pattern.\n\nSo $50 million incremental run rate consumption. So just to be clear and you mentioned it's a record but is that – are we increasing that consumption growth rate over where it was the past couple of quarters? And if you're bringing down the guide for the rest of the year, are you anticipating that that growth rate goes up down stays flat?\n\nBill Staples -- Chief Executive Officer\n\nYeah. Good question. First maybe a reminder on what consumption run rate or CRR is. What we do is every day we measure the annualized value of the business.\n\nSo we take that day's consumption present value, annualize it and measure that throughout the quarter every single day. What I was describing is from – we can mute line there. It sounds like somebody is unmuted. But if you take day one of the quarter and compare it today, the last day of the quarter, we see a $50 million net increase.\n\nAnd that is the most significant increase in CRR that we've seen in the business since we began measuring that about six quarters ago or so. We're excited by that. I did mention the offsetting decreases in consumption as I walked through it a minute ago and the causes for that. As we look forward into Q3 and Q4, every day brings different consumption patterns throughout the quarter.\n\nAnd this measure is a real-time measure of the consumption value. We expect it to continue as we go into Q3 and Q4 to continue to increase. As Dave mentioned, we are keeping an eye given the imbalance between the consumption run rate and the commitments that puts pressure on increasing consumption with many customers over 130% of their commitment already. We also are keeping an eye on the macro and the impact that's happening as executives look closely at budgets to ensure that they don't incur any unplanned expenses.\n\nAnd for those reasons, we felt it was prudent to look at the guide, but we do expect consumption run rate to continue to increase in Q3 and Q4.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nOK. So it increase, I guess, as the growth rate that I was questioning. No consumption run rate?\n\nDave Barter -- Chief Financial Officer\n\nMichael, are you asking about the sequential growth rate of consumption?\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nNo, year-over-year growth rate.\n\nDave Barter -- Chief Financial Officer\n\nThe year-over-year growth --\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nSo that year-over-year growth rate continue to increase. I know consumption will likely increase.\n\nDave Barter -- Chief Financial Officer\n\nI'll tell you what Michael, let me -- if you have another question for Bill let me see if I can take a look and see if I have at my fingertips.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nNo, I think -- yeah, if you could let us know that would be great. And then we could talk about it afterwards. But also just to clarify on FX. You guys do -- I thought you billed mostly in dollars.\n\nSo is that FX impact a demand issue relative to the strong dollar, or is there some portion -- I guess I thought it was mostly dollars?\n\nDave Barter -- Chief Financial Officer\n\nWe are mostly dollars. When we set up our footprint in Japan Michael, we set that up in yen and that just happens to be one of those subsidiaries that's done very well.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nOK.\n\nDave Barter -- Chief Financial Officer\n\nAnd what we're seeing out of there is just again accelerating pressure hence the outlook. And I just wanted the telegraphic impression that we're seeing.\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nOK. Sorry I missed that it was 10.\n\nDave Barter -- Chief Financial Officer\n\nSo that's different. Michael anything else?\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nNo, no. That was it. Yeah, if you can get back on that growth rate question that fine I'd like to hear it later. I appreciate it.\n\nDave Barter -- Chief Financial Officer\n\nOK.\n\nOperator\n\nThank you. The next question today comes from the line of Derrick Wood from Cowen and Company. Please go ahead. Your line is now open.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nHey, guys. Thanks for taking my question. Bill Atlassian indicated they're seeing a slowdown in developer hiring really across all geos and customer cohorts, as well as less free to paid motion. Are you guys seeing that same kind of dynamic? And I guess if you are like what are you thinking about offsetting that? I mean, you could look for new use cases, look for targeting new personas.\n\nJust curious if there's any playbooks to counter some of those macro headwinds?\n\nBill Staples -- Chief Executive Officer\n\nYeah, great question. I did listen to that Atlassian call and interesting trends they're seeing. No, actually, first I'd say, I mentioned on the call the success we're having with that product-led growth motion around new customer acquisition. And it's customers coming in, signing up for the free tier and then graduating to pay go 800 new paid customers coming into the platform this quarter.\n\nThat is very strong and exciting to see them come into the platform and expand quickly. So no headwinds we're seeing on that front. On the user front, it's important to understand how our user-based consumption model differs from Atlassian. It's a very different situation, where they have a very low-priced developer seat model that is fairly ubiquitous within engineering teams and heavily, I guess, influenced by engineering headcount and various other factors.\n\nWith New Relic, it's almost the opposite of that. We have a very low penetration in terms of users. As I said earlier, very few engineers actually practice observability, and that's our opportunity to grow. It's also a mission-critical workload.\n\nI think it's Gartner says that, the average cost of IT downtime is like $5,000 plus per minute. I think they estimate 98% of organizations say that, a single hour of downtime costs $100,000, 81% says that 60 minutes of downtime costs $300,000 and a full third of companies report that one hour of downtime cost $1 million to $5 million. Contrast that with the New Relic user seed price of starting at $99 per month. And you can kind of see the -- see the forest for the trees there.\n\nThe ROI on New Relic is incredible. They're paying $100 starting price for a user to be able to troubleshoot for an entire month an incident that might happen to cost the business millions of dollars. So the headwinds there in terms of user growth, we are not seeing and don't expect to see. We actually saw very good growth in both users and data this quarter, and believe that will continue.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nGreat. That's helpful color. And Dave one for you on the P&L, we saw a pretty sizable drop in sales and marketing sequentially. I know that, last quarter you had conference expenses.\n\nBut even accounting for that a decent drop and I'm sure some of that's due to the cost restructure efforts. But could you just give us a sense for where you've been able to take additional costs out? And then I know that you had a change in commission expense structure last year. Has that changed at all this year?\n\nDave Barter -- Chief Financial Officer\n\nLet me – I'll address the last part and then I'll get to the first part. In terms of the commission structure, we had the – about $34 million last year of extra commission related to the legacy model. This year, we have about $22 million. So I'd say naturally, we end up with about $11 million tailwind in that area, but we're still, I'd say sales and marketing, the way I think about it is it's overburdened by $22 million.\n\nSo you'll continue to see that ebb and work its way out of the P&L, which is certainly one driver. I guess, the other driver, I would say is that, last year at this time our product-led motion was about 5% of total revenue and now it's almost 10%, and that's a very high efficient from a magic number from a cap perspective a higher – just a very efficient motion. As we get that product-led motion aligned with our sales motion and a traditional account reps, I think Derrick you're going to find that we're going to be able to continue driving down our overall cost of sale. So that's one of my focus areas to continuing to find that.\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nYeah. Got it. Thank you.\n\nBill Staples -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. The next question today comes from the line of Noah Herman from J.P. Morgan. Please go ahead.\n\nYour line is now open.\n\nNoah Herman -- J.P. Morgan -- Analyst\n\nHey, guys. Congrats on the quarter, and taking our questions. This is Noah on for Pinjalim. Just two quick questions.\n\nMaybe going back to just the consumption trends. Is there any way to maybe elaborate that on what that was on a monthly basis or maybe the growth linearity through October this quarter? And then referring to maybe some of the cost saving initiatives you outlined earlier. Is there anything to really think about as we, sort of, look into the next fiscal year? And where you think maybe other costs can be reduced?\n\nBill Staples -- Chief Executive Officer\n\nI'll take the consumption linearity question. Maybe Dave you can opine on costs. On consumption linearity, we saw strong consumption growth increases all three months of the quarter in Q2. The second and third month were stronger than the first.\n\nThis quarter in October -- first month of consumption this quarter was a little bit ahead of last quarter -- last quarter's first month that is. So we're not sharing the month-to-month values on that. You can see more information in the investor letter around some of our key metrics. But hopefully that gives you a sense for how it's trending.\n\nDave Barter -- Chief Financial Officer\n\nIn terms of cost, I guess, I break it out into three areas. We are continuing, I think, as I suggested in my prepared remarks building on our multi-cloud strategy and what we find as we build out the multi-cloud strategy as gross margins continue to climb where we just naturally are finding cost savings both from shutting down the legacy centers, but also just how we're engineering our product. So I think we continue to be enthused. I think we highlighted that we would finish at gross margin of 75% or higher.\n\nThat's not a kind of a milestone that is an ending point but it's just a checkpoint and a broader journey. So you'll see core continue to come down. You'll continue to see sales and marketing efficiencies. And then certainly as I alluded to on real estate, we have an opportunity in G&A to continue optimizing that.\n\nSo you can imagine that we'll press on cost and drive up margins.\n\nNoah Herman -- J.P. Morgan -- Analyst\n\nYeah. All that helps a lot. Thank you so much.\n\nDave Barter -- Chief Financial Officer\n\nYeah. Thanks.\n\nOperator\n\nThank you. The next question today comes from the line of Rishi Jaluria from RBC. Please go ahead. Your line is now open.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nWonderful. Thanks so much for taking my questions. And nice to see underlying strength in the business. Two questions for me.\n\nFirst, I wanted to start by asking about churn. Just in terms of the -- in light of the macro headwind what are you seeing in terms of churn from your existing customers? And I'll add a wrinkle to that not just those that are fully unplugging, but maybe those who are actually reducing their spend with New Relic? And then I've got a quick follow-up.\n\nBill Staples -- Chief Executive Officer\n\nYeah. A couple lenses on churn. I think at the Investor Day back in May, we shared our dollar churn numbers. And if you remember, we had reached a low point of around 6% in that final quarter.\n\nWe mentioned in Q1 the churn would have been another low record, but for a few deals that slipped out of the quarter and closed in the first week of the new quarter. In Q2, we actually did achieve a new record low of 4%. So we are proud of that success and continue to work on helping our customers to stay in the platform and realize the value that they're after. In terms of customer churn -- customer count churn I mentioned earlier we have 800 new paid platform customers that came into the business this last quarter, but around 500 or so of our legacy APM very small customers that put a credit card on file and continue to allow us to charge it but that are churning out, offsetting that customer count growth.\n\nOverall, we feel good about that trend because the new customers coming into the platform are obviously adopting the full platform and growing much faster. And as we look forward when that churn rolls off, it's a very exciting future ahead. Does that answer your churn question?\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nThat absolutely does. Thank you for that. Really helpful. And then just a kind of a really quick one.\n\nLook, as we've been throughout this call having conversations around consumption trends and overconsumption, etc., it seems like CRR is going to be a very, very important metric. And I know you give us some sort of directional color and there's some stuff around in the slide deck. But why not just outright disclose that number? I think that -- it feels like that would help cut through a lot of the noise especially in kind of this environment. Thanks.\n\nDave Barter -- Chief Financial Officer\n\nIt's a great question Rishi. I think as we prepare to give an analyst update and share a long-term model, I think we will end up using CRR. I think there's probably still a question in my mind as to do we use it on a smooth basis because as Bill highlighted it's almost kind of like a balance sheet measure. It's kind of a point in time and it moves a little bit.\n\nAnd so we're still thinking through whether it's kind of a rolling one week it's a rolling 30-day, but almost in line with I'd say perfecting every metric. We want to spend a little bit more time thinking through the best way to present that metric, so that it's as useful to you as possible knowing that it's a representation of users and data and platform adoption. But definitely I give you a good measure.\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nAwesome. Thank you. I really appreciate it.\n\nDave Barter -- Chief Financial Officer\n\nThank you for your question.\n\nOperator\n\nYour next question today comes from the line of Keith Bachman from BMO. Please go ahead. Your line is now open.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nGood evening. Good afternoon. Thank you. I'll ask my two questions concurrently just in the interest of time.\n\nWe're at the back part of the hour. The first one is related to the consumption versus contract. And in our recent conversations you mentioned some of the customers are at 70% of their pay for capacity and yet some are 130% and you're trying to bring those back into closer symmetry around 100% so to speak. How do you get customers there? It sounds like some of the work you're doing is on New Relic side where you're trying to change go-to-market a little bit, but how you condition your customer base to try to bring these two more in balance? And how long do you think it takes? Because this caused a little bit -- historically, it's caused a little bit of variability in your model, but I think the model is maturing quite a bit.\n\nSo that's question one. And the second is I was hoping you'd give me the new customer adds was actually quite impressive I thought given the macro. Is there maybe a little bit more color you could add on what's -- if you did a histogram what's kind of a frequent win case? In other words, why are you winning these customers, what's the -- what's the size of the customer, what's the land size or any kind of metrics that you give us around that 800 new customer land? Many thanks.\n\nBill Staples -- Chief Executive Officer\n\nYeah. Thanks, Keith. First to your question around balancing CRR and commitment. I think one important piece of context to remember is we just eclipsed the first year of migrating the majority of our customers into that platform.\n\nAnd so that first year commitment was a hard commitment for our customers to make. They didn't understand the full value of the platform because they had never used it. It was a brand-new pricing model. They may have used APM before, but now we're offering them access to this all-in-one platform for one price, very hard to make a budgetary commitment.\n\nWe tried our best to guide them. Many, many customers ended up having their expectations exceeded and they consumed way more than they thought they would with that first year commitment. And that's what's created some of the headwinds that we're seeing now where many, many customers are 130% or more of their original first year platform commitment. You're right that now we're maturing.\n\nThey have a full year in the platform. We have a full year of executing. And now most importantly, we've got the right tools to help them, incentivize them, to increase their commitment for growth, to put them into a contract structure that allows for both top-ups where they can add more budget at any time. We didn't have that in the first year.\n\nThat also increased this dynamic. We also have the ability to early renew them. Once again, we didn't have that in the contract structure in the first year. And then third, we also offer the ability with our savings plan to make up basically low risk or no risk commitment, because you can -- now we offer the ability to roll forward any funds for an additional year, if you end up not consuming your full commitment.\n\nAll of those is now available to our sellers, makes it much easier for our customers to make commitments to right-size those commitments with their consumption patterns and none of that we had last year. So I think that's going to help us quite a bit. Of course, we do have to go through the renewal cycle with the customers before we get the chance to do that rightsizing if you will. And as I mentioned, Q3 and Q4 are the biggest renewal quarters for us.\n\nThink like two-thirds of the business or so is getting recontracted in the next -- in this quarter and next. And so that will help us go a long way to getting those more in balance. To your final question around customer adds, yes, we see the strength of New Relic APM as a capability and as a brand continues to give us a lot of great tailwinds. We're known as a company that was developer-first, it's cloud-first, the developers can trust.\n\nAnd of course, as is often the case, in developer circle word-of-mouth marketing means a lot. It's why we invested in the free tier as a product-led growth motion, because ultimately, even if a developer doesn't own the budget, their mind share matters a lot. We want to win their trust and win their mind share. And a lot of the new platform customers coming to us are coming to us first for that APM brand and reputation we have, but then also discovering with the way that we've evolved the platform over time, how quick and easy it is to instrument not just their application but also their infrastructure and get their logs in there, all three in just a few minutes and they get full visibility of their stack.\n\nThat's a really powerful value proposition that no other competitor really offers and they can do it for free, no credit card required. And then that leads them to say, hey, I want to add my teammates, I want to add more data and they put in their credit card in the way we go. The size of these customers does range quite a bit. As I mentioned, some -- they all start out at free.\n\nSome add their credit card and pay a few hundred dollars a month. Each quarter, we see the cohort of customers that come in their consumption expands quite dramatically over the first four to five quarters. And some customers come in for even a month or two, and realize they want a contract so they can get even better rates than the retail. And so as I mentioned Timber came in through this free tier funnel and we got them under contract and they're paying a six-figure contract, annual spend with New Relic.\n\nSo it varies widely, but it's a very strong high efficient high-volume motion that now we're focusing on helping move those customers into contracted consumption and into our sales-led model where they can get even more support from New Relic to expand their consumption.\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nAll right. Perfect. Many thanks.\n\nOperator\n\nThank you. The last question for today's call comes from the line of Yun Kim from Loop Capital Markets. Please go ahead. Your line is now open.\n\nYun Kim -- Loop Capital Markets -- Analyst\n\nAll right. Great. Just want to quickly follow up on the question regarding the gap between the commitment and CRR. It looks like you had a success with the early renewal program, you introduced in the quarter.\n\nObviously, that represents an opportunity the gap and that serves as a proxy for your future business. So what is your expectation regarding the early renewal program in the second half, given this gap that's out there? And then also, even without early renewals, should regular renewal cycle drive incremental uptick in commitment, reflecting at least some of that expanding gap? Thanks.\n\nDave Barter -- Chief Financial Officer\n\nYeah. Thank you, Yun Kim, for the question. I think it's -- we do think that the cycle in Q3 and Q4 will be helpful. What was interesting is even with the net ACR expansion of $18 million, the GAAP actually went up about 1%.\n\nIt was about 115%. I think we finished the quarter at 116%. So I think almost in line with the question earlier, the reason we focus on commitments and expansions, is actually just to continue what customers are doing whether it's in tool consolidation or continuing to support their cloud strategy or digital transformation, that they have plenty of contract to work with. So ironically, even with the success of last quarter, we kind of went thinking the gap actually went up one percentage point.\n\nAnd so we'll just continue to maintain focus on expanding contracts, supporting our customers and giving them plenty to work with, as they execute on a cloud initiative digital transformation or whatever key priority they may have.\n\nYun Kim -- Loop Capital Markets -- Analyst\n\nGreat. Real quick on contract length, especially on the early renewals. Does that renew at a one-year anniversary one-year length, or does it kind of renew at the end of the original contract?\n\nDave Barter -- Chief Financial Officer\n\nGreat question. We're traditionally a one-year shop, in terms of annual contracts. We've been shifting to multiyear contracts in order to support the multiyear strategy. And that's something that you'll continue to see play out, through RPO and other measures.\n\nBut we're very much in the early days of -- we're in the early days of phasing in three-year contracts.\n\nYun Kim -- Loop Capital Markets -- Analyst\n\nThanks so much for the questions.\n\nDave Barter -- Chief Financial Officer\n\nThank you so much.\n\nOperator\n\nThank you. That concludes today's question-and-answer session. So I'd like to pass the conference over to Bill Staples for closing remarks. Please go ahead.\n\nBill Staples -- Chief Executive Officer\n\nHey, and thank you all for joining today's call. We really appreciate your questions and interest in New Relic. Q2 was a solid quarter and really a new chapter for the company as we resume profitable growth. I'll express my gratitude to our customers, to Relics around the world, who work tirelessly to serve them and all of you.\n\nI'm really excited by the opportunity ahead. And I believe the transformation, we've undergone both in product and business model, has really set us up to help customers better manage through these uncertain times and bring greater predictability and efficiency to their observability spend, and to successfully further their own digital business. I look forward to seeing many of you on the road again this quarter, and -- or wherever the opportunity arises. Thanks again, for your interest in New Relic and for all of your support, until next time.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nIngo Friedrichowitz -- Senior Vice President of Investor Relations and Corporate Finance\n\nBill Staples -- Chief Executive Officer\n\nDave Barter -- Chief Financial Officer\n\nKingsley Crane -- Canaccord Genuity -- Analyst\n\nSanjit Singh -- Morgan Stanley -- Analyst\n\nUnknown speaker -- Credit Suisse -- Analyst\n\nMike Cikos -- Needham and Company -- Analyst\n\nMichael Turits -- KeyBanc Capital Markets -- Analyst\n\nDerrick Wood -- Cowen and Company -- Analyst\n\nNoah Herman -- J.P. Morgan -- Analyst\n\nRishi Jaluria -- RBC Capital Markets -- Analyst\n\nKeith Bachman -- BMO Capital Markets -- Analyst\n\nYun Kim -- Loop Capital Markets -- Analyst\n\nMore NEWR analysis\n\nAll earnings call transcripts"
}