{
  "companyName": "XPeng Inc.",
  "companyTicker": "XPEV",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/30/xpeng-inc-xpev-q3-2022-earnings-call-transcript/",
  "content": "XPeng Inc. (XPEV 0.61%)\nQ3 2022 Earnings Call\nNov 30, 2022, 8:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for the third-quarter 2022 earnings conference call for XPeng Inc. At this time, all participants are in listen-only mode. After the management's remarks, there will be a question-and-answer session.\n\nToday's conference call is being recorded. I will now turn the call over to your host, Mr. Alex Xie, head of investor relations of the company. Please go ahead, Alex.\n\nAlex Xie -- Head of Investor Relations\n\nThank you. Hello, everyone, and welcome to XPeng's third-quarter 2022 earnings conference call. Our financial and operating results were issued by newswire services earlier today and available online. You can also view the earnings press release by visiting the IR section of our website at ir.xpeng.com.\n\nParticipants on today's call from our management will include: co-founder, chairman, and CEO, Mr. He Xiaopeng; vice chairman and president, Dr. Brian Gu; vice president of finance, Mr. Dennis Lu; vice president of corporate finance and investment, Mr.\n\nCharles Zhang; and myself. Management will begin with prepared remarks, and the call will conclude with a Q&A session. A webcast replay of this conference call will be available on the IR section of our website. Before we continue, please note that today's discussion will contain forward-looking statements made under the safe harbor provisions of the U.S.\n\nPrivate Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, the company's results may be materially different from the views expressed today. Further information regarding these and other risks and uncertainties is included in the relevant public filings of the company as filed with the U.S.\n\nSecurities and Exchange Commission. The company does not assume any obligation to update any forward-looking statements except as required under the applicable law. Please also note that XPeng's earnings press release and this conference call include the disclosure of the unaudited GAAP financial measures, as well as unaudited non-GAAP financial measures. XPeng's earnings press release contains a reconciliation of the unaudited non-GAAP financial measures to the unaudited GAAP measures.\n\nI will now turn the call over to our co-founder, chairman, and CEO, Mr. He Xiaopeng. Please go ahead.\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] Hi, everyone. I'm He Xiaopeng. In the third quarter of 2022, XPeng delivered 29,570 electric vehicles, a year-over-year increase of 15%. Cumulative deliveries in the first three quarters of 2022 totaled 98,553 electric vehicles, representing a growth of 75% year over year.\n\nFrankly, we're going through a very challenging period in pursuing our long-term goals. In response, we recently conducted an in-depth strategic review and implemented organizational restructure. The competition for smart EVs is similar to a marathon. I believe that only strong players with core technologies, well-rounded capabilities, and the ability to monetize from both hardware and software will eventually win in the long run.\n\n[Foreign language] To enhance our product competitiveness and boost sales, we'll simplify configurations while improving our hardware and software products' attractiveness to incorporate customers' voices and needs. As market competition intensifies, we'll sharpen our marketing to highlight the great value in our industry-leading smart and electrification technologies and further enhance our branding, sales, and service capabilities. I would also like to take this opportunity to sincerely thank our customers and shareholders for their valuable suggestions regarding these areas for improvement. [Foreign language] Within the new organizational structure, I will focus on XPeng's strategy, product planning, and R&D.\n\nMy goal will be to drive organizational change and upgrades, ensure customer values is reflected in our entire product development process, including design, R&D, sales, and service, holistically making our business operation more concentrated and efficient. In a recent strategic review, I'm more convinced that the adoption of smart EVs will accelerate in the second half of 2023. We'll unwaveringly invest in the R&D of autonomous driving and smart cockpit technologies to strive to reduce the cost of these technologies to our customers while ensuring that customers' needs and preferences are at the center of our innovation to enhance our smart products' competitiveness and profitability, as well as our customer satisfaction. At the same time, the platform-based approach for our vehicles and power train will improve the efficiency of our research and development and will help consistently reduce our R&D expenses and BOM costs through technologies.\n\nBesides, our ecosystem affiliates, XPENG AEROHT and XPeng Robotics, have both raised funds recently and are now well equipped to operate independently. As a result, I will be spending much less of my time on our ecosystem affiliates operations. Our co-founder, Mr. Heng Xia will resign as an executive director of the board of directors to focus more on products.\n\n[Foreign language] In addition, we are restructuring our brand and marketing team. Through a strengthened team and more targeted content, I believe we'll succeed in addressing the key factors that affect consumers' purchase decisions in the most sought-after channels and across a broad range of customer demographics, paving the way for more powerful brand awareness of XPeng and our products. [Foreign language] Leveraging our dedicated EV platforms with a focus on architecture and power train, we expect to increase our R&D efficiency, enhance our cost control measures, and improve supply chain management. In line with our mission, we have invested in three powerful EV platforms over the past few years, including our fully established E platform and our third-generation F platform and H platform, both of which are expected to be mass produced next year.\n\nTogether, these advanced platforms form a solid technology foundation to support our product upgrades and iterations. Our core technologies, including our power train system, advanced driver assistance systems, chassis, and electrical and electronic architecture will be shared across multiple vehicles we are developing as much as possible. As a result, the required R&D cycle time and expenditure for each new product will be reduced, while the vehicle software and hardware quality will be more stable. We have also adjusted the organizational structure for our EV product management team accordingly.\n\nEach EV platform will be led by a senior product manager in charge of product development across the complete product cycle from design and development to sell, forming a market-led closed-loop system to improve user experience in sales. [Foreign language] Mass deliveries of the G9, our flagship SUV equipped with our most advanced technologies, commenced at the end of October. All of the G9s are equipped with an 800-volt high-voltage platform that enables excellent driving range. Its charging speed also outperforms all the other EV models in the market.\n\nThe increasing market recognition of G9's outstanding capabilities has marked XPeng's leadership in not only smart technology but also electrification. Such a reputation is not only popularized in China but also overseas. Despite near-term challenges brought by COVID-related restrictions and production ramp-up, we are confident that the G9 will soon rank among the top three in terms of monthly sales volume in a battery electric SUV segment priced above 300,000 RMB and draw closer to No. 1 next year as we continue to enhance our brand recognition.\n\n[Foreign language] We believe G9's sales ramp-up will drive future sales volume and pull it out of the trial we experienced in October. Moreover, beginning in the first quarter of next year, we will successfully launch three new vehicle models, which will further strengthen our product competitiveness. We also expect consistent improvement in our marketing capabilities to make our subsequent product launches successful. As we continue to roll out new products and technologies, coupled with technology differentiation of our next-generation full scenario ADAS products, we're confident that we will achieve a significant increase in sales volume and average selling price, gaining a revenue growth in 2023 that exceeds the industry average and increasing our market share.\n\n[Foreign language] Since the third quarter of this year, we have made significant progress in the mass production of autonomous driving technology. We continue cultivating consumers' trust and willingness to purchase our product with best-in-class ADAS software. On September the 17th, we delivered our City NGP pilot program in Guangzhou. In urban traffic scenarios, which are significantly more complex than highway scenarios, XPeng's P5 took the lead in delivering the best-in-class driver safety and driving experience at a much lower hardware cost.\n\n[Foreign language] We are accelerating the development of our next-generation full scenario advanced driver-assistance product, XNGP and plan to release its major functions to several dozen cities in the third quarter of 2023. In my view, the upcoming release of XNGP will represent an inflection point where smart driver-assistance software becomes a must-have product with high-frequency usage. We're also pleased to see that a high proportion of current G9 orders are for the max version that features XNGP ahead of the XNGP's OTA rollout. We look forward to enabling our cost competitive XNGP next year in more models.\n\nFurthermore, we believe XNGP's hardware costs will have the opportunity to be reduced as our technology advances and become significantly lower than that of our peers. Driven by strong brand awareness of our product and cost competitiveness, we're confident that XNGP will rapidly gain widespread adoption nationwide. [Foreign language] On October the 31st, the XPeng G9 obtained the Guangzhou Intelligent Connected Vehicle Road Test permit, making XPeng G9 the first unmodified mass-produced vehicle to qualify for autonomous driving tests on China's public roads. With the parallel development of our advanced driver-assistance system, XNGP, and mobile taxi capabilities alongside a closed-loop data and a complementary approach in software iterations, we plan to be the first to realize autonomous driving with cost-effective, mass-produced vehicles.\n\n[Foreign language] As we strive to bring our smart technologies and electrification technologies into commercialization, we firmly believe in the value proposition that our in-house developed, industry-leading technologies bring to our customers, as well as our commercial value, for our enterprise. We're open to opportunities for strategic cooperation and technology collaborations globally. [Foreign language] Regarding cash liquidity, our current cash amounts to over 40 billion RMB. We have become increasingly aware of the importance for automakers to maintain steady growth in adversity and not just in prosperity.\n\nTherefore, we will implement prudent cost control initiatives over the next few quarters and next few years to improve operational efficiency and streamline our investment projects. Building on our more focused R&D strategy and vehicle and technology platforms that can be applied across different vehicle models, we plan to roll out future products at a lower R&D cost. A stronger product portfolio and internal organizational restructuring will also help significantly improve our sales efficiency. Furthermore, thanks to our early investment in our production capabilities, our capex needs will significantly decrease over the next couple of years compared with 2022. Therefore, we're confident that our cash position of 40 billion RMB will support our business growth in the coming years.\n\nAlso, our cash flow will substantially improve as our product sales grow. [Foreign language] Looking ahead to the fourth quarter, we'll focus on mitigating the impact of COVID-related restrictions in China and making internal adjustments for our medium- and long-term development. Our November deliveries are estimated to reach at least 5,800 units, mainly due to the impact of the G9 production ramp-up. We're trying our best to expedite deliveries of our order backlog.\n\nIn December, our deliveries will rebound significantly month to month -- month over month. We expect to deliver a total of 20,000 to 21,000 vehicles in the fourth quarter of 2022 and generate revenue between 4.8 billion RMB to 5.1 billion RMB. We will accelerate internal organizational adjustments and management upgrades in the coming quarters. We're confident that we will rank among the top players in the smart vehicle industry in the medium to long term.\n\n[Foreign language] Thank you, everyone. With that, I'll now turn the call over to our VP of finance, Mr. Dennis Lu, to discuss our financial performance for the third quarter of 2022.\n\nDennis Lu -- Vice President, Finance\n\nThank you, Mr. He, and hello, everyone. Now, I would like to provide a brief overview of our financial results for the third quarter of 2022. I will reference RMB only in my discussion today, unless otherwise stated.\n\nOur total revenues were 6.8 billion for the third quarter of 2022, an increase of 19.3% year over year and a decrease of 8.2% quarter over quarter. Revenues from vehicle sales were 6.2 billion for the third quarter of 2022, an increase of 14.3% year over year and a decrease of 10.1% from the last quarter. The year-over-year increase was mainly attributable to higher vehicle deliveries, while the quarter-over-quarter decrease was mainly due to lower vehicle deliveries for the P5 and G3i. Gross margin was 13.5% for the third quarter of 2022, compared with 14.4% for the same period of 2021 and 10.9% for the last quarter.\n\nVehicle margin reached 11.6% for the third quarter of 2022, compared with 13.6% for the same period of 2021 and 9.1% for the last quarter. The quarter-over-quarter increase was mainly attributable to product mix changes. R&D expenses were 1.5 billion for the third quarter of 2022, an increase of 18.5% year over year and an increase of 18.5% quarter over quarter. The year-over-year increase was mainly due to the increase in employee compensation as a result of expanded research and development staff.\n\nAnd the quarter-over-quarter increase was primarily associated with higher new vehicle development to support our future goals. SG&A expenses were 1.6 billion for the third quarter of 2022, an increase of 5.7% year over year and a decrease of 2.3% quarter over quarter. The year-over-year increase was mainly due to expansion of our sales network and associated personnel costs. The quarter-over-quarter decrease was mainly attributable to lower operating expenses.\n\nAs a result of foregoing loss from operations was 2.2 billion for the third quarter of 2022, compared with 1.8 billion for the same period of 2021 and 2.1 billion for the last quarter. Net loss was 2.4 billion for the third quarter, compared with 1.6 billion for the same period a year ago and 2.7 billion for the last quarter. Comprehensive loss was 0.7 billion for the third quarter, compared with 1.6 billion for the same period a year ago and 0.8 billion for the last quarter. The primary difference between the comprehensive loss and net loss was foreign currency translation gain resulting from the rapid appreciation of U.S.\n\ndollar-denominated assets. As of September 30, 2022, we had cash and cash equivalents, restricted cash, short-term investments, and time deposits in total of 40.1 billion. To be mindful of the length of our earnings call, I will encourage listeners to refer to our press release for more details on our third-quarter financial results. This concludes our prepared remarks.\n\nWe will now open the call to questions. Operator, please go ahead.\n\nOperator\n\nThank you. [Operator instructions] We have a next -- we have a first question from the line of Tim Hsiao with Morgan Stanley. Please go ahead.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] So, my first question is about deliveries because the vehicle deliveries have been slow in rest of the month, likely due to the moderate transition and COVID curbs. XPeng has done a series of organizational restructuring, but how fast could this adjustment translate into more meaningful volume recovery in the upcoming months, assuming the impact from the COVID restriction could ease over time? And separately, have we adjusted our 10,000 target for G9 per month or the new P7 next year due to the current supply demand challenges, as this is also hardly correlated to the company's profitability into 2023? So, this is my first question. Thank you. \n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] All right. First of all, thank you for your question. Regarding -- well, I just reviewed a lot of historic cases of how manufacturers do changes over time. And currently, the organization adjustment that XPeng is conducting is for the mid- to long-term goals, not for the short term.\n\nSo, we ask for your patience. At the same time, we are very confident that we can see more significant changes to be translated into our sales performance in the coming several quarters. And in 2023, our market share will be further expanded. Now, in the short term, if the pandemic can be well under control, we are confident that in December, we can still maintain our original goal of reaching 10,000 of monthly sales for G9, and we can -- we are very confident that we can be ranked among the top three players in the battery electric SUV segment priced above 300,000 RMB.\n\nNow, in 2023, with the roll out of our further developed XNGP function, we believe that G9's sales volume can be further enhanced to further exceed actually P7's performance compared to the same developmental stage in the history. At the same time, P7's competitiveness will be further enhanced alongside with our technological improvements with the -- and also their sales performance will be improved in the coming year as well. Now, in mid-2023, we expect to launch a new product or a new model that are priced between 200,000 RMB to 300,000 RMB, which will be a B-class, mid-sized SUV. And that will definitely help us to further boost our product sales.\n\nAnd we believe that the sales volume of this particular model will actually exceed our current product portfolio. Thank you.\n\nAlex Xie -- Head of Investor Relations\n\nJust want to make a clarification. We mentioned that the December delivery overall will reach 10,000, not just G9, the overall delivery for December. Just want to make that clarification.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\n[Foreign language] So, my second question is about the cash flow. In light of the challenging macro backdrop, investors are increasingly concerned about expense cash flow. The company still has a pretty strong cash position and balance sheet based on the latest financial statement. But will there be any potential changes to our supplier payment turn or surge in new model investment next year that may deteriorate our operating cash flow? What kind of cash burn should we expect next year? And separately, based on the latest financial statement, expense short-term borrowing also increased more substantially in the quarter.\n\nIs there any specific reason to that? That's my second question. Thank you. \n\nBrian Gu -- Vice Chairman and President\n\nTim, it's Brian. Let me address your question. First of all, the payment terms for our suppliers, we don't see any material change. We're actually maintaining a pretty favorable payment terms with our suppliers and partners.\n\nAnd then if you look at the cash -- operating cash outflow, the first three quarters is actually less than 6 billion. And then, we actually also foresee the entire capex for this year 2022 to be less than 4.5 billion RMB and lower than what we anticipated earlier in the year. And then, looking to 2023, we actually see a significant change and reduction in capex due to a number of factors. First of all, as Xiaopeng mentioned earlier that we actually pretty much completed our capacity build out, so we don't need to incur significant capex for that.\n\nWe also have also completed the construction of these new product platforms for the new car launches. So, a lot of these capex has been already incurred already. So, next year, we think the capex for us will be significantly lower, actually below 3 billion RMB in our estimate for next year. And also in line with the current streaming line and focus that we are doing in our R&D projects, we think the R&D expenses next year compared to 2022 will also see not growth actually in line or reduction.\n\nAnd we also see that SG&A expenses going down due to some of the structural organizational changes we mentioned. So, overall, we're actually very confident that we can see free cash flow outflow significantly improve next year compared to this year. And also, with our current cash on hand, we have very adequate resources to meet our business plan, and we also anticipate that carries us to our projected cash flow positive sometime in 2024. \n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nThank you very much for sharing the details.\n\nDennis Lu -- Vice President, Finance\n\nThis is Dennis. I just want to supplement one point regarding your question on the short-term borrowing. Yes, you're right, we have increased our short-term borrowing in the third quarter. The reason is basically for the kind of the money management because we have established considerable credit lines with a variety of banks.\n\nAnd then we tactically draw down some part of the credit lines to strengthen the relationship with banks. So, that's why you see a slight increase in the short-term borrowing at the end of September.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nGreat. Thank you very much for sharing, Dennis and Brian. [Foreign language]\n\nAlex Xie -- Head of Investor Relations\n\nThis is Alex. I just like to clarify, when Brian mentioned the decrease of SG&A expenses, it means like as a percentage of revenues in 2023 compared with as a percentage of revenues in 2022. Thank you.\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nOK. Thank you. \n\nOperator\n\nThank you. We have next question from the line of Ming-Hsun Lee with Bank of America. Please go ahead.\n\nMing-Hsun Lee -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] My question is that the ASP trend in 4Q based on the difference between your volume guidance and also the revenue guidance. So, could you give us a more color on this? And besides that, looking into 2023, what's your plan to control the component costs, as well as the battery costs in order to maintain your gross margin? Thank you.\n\nDennis Lu -- Vice President, Finance\n\nMing, this is Dennis. Regarding your question on the ASP, yes, you're right, in the third quarter, our ASP increased primarily -- compared with Quarter 2, primarily due to the better mix, better P7 as mentioned also improved the margin. For the Quarter 4, the P7 -- in terms of P7 mix will be lower. However, because of the mass delivery of the G9, so we'll be able to maintain together the P7 and the G9 mix at about maybe 55% to 60%.\n\nSo, we should -- we actually will have slight increase in terms of ASP compared with the Quarter 3, offsetting some variable marketing spending on the P5 and G3. So, that's the answer to your first question. In terms of material cost increase, so far, we haven't seen the big changes in terms of the battery cost for the next year, mainly for the first quarter. But we believe, due to more supply, we are seeing opportunities in terms of the battery supply.\n\nAnd that would, in return, translate into a cost reduction maybe in the second half. So, with that, the cost improvement will help to maintain or to improve our margin, offsetting the NEV subsidy discontinuation.\n\nBrian Gu -- Vice Chairman and President\n\nYes. So Ming, just to also add to this, the fourth quarter, due to the volume contraction and also launching of our new product, G9, I think the gross profit will face some pressure versus the third quarter. And then the first quarter, given the subsidy elimination, which impacts some of our lower-priced models, so that will also present a challenge for the gross profit. However, our view is that with the volume rebounding starting in the second quarter and in the rest of the year with scale, and also, we anticipate battery prices moderate and also show some opportunities for decline later in the year, I think the gross profit trend will improve significantly in the later half of next year.OK.\n\nThank you, Brian and Dennis. I have no question.\n\nOperator\n\nThank you. We have next question from the line of Nick Lai with JPMorgan. Please go ahead.\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\n[Foreign language] Now, let me translate my question firstly. Now Chairman just mentioned that you are going to change a lot of strategy regarding the management, including branding and marketing team, and can you elaborate more what are going to change in terms of branding strategy and marketing campaign? And what -- when can we expect those changes having an impact on underlying demand or volume?\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] All right. Thank you, Nick, for your question. We're actually conducting or in the midst of doing this organizational adjustment with focus on our branding and marketing. Looking back, I mean, in the past, our branding and sales and marketing mainly focus on sales with more focus on boosting the sales of our products.\n\nBut going into the future, we're going to balance different aspects of our branding, marketing and sales with innovative measures, and we plan to actually reduce our spending to boost in the sales, while increasing our spending in marketing. Now, the second thing that is regarding the organizational adjustment is that we plan to -- we expect to integrate our organization to make it more efficient and effective, and we plan to recruit, you know, very high-quality talent from different industries in order to boost our sales and marketing efficiency. And we aim to launch a series of measures in order to tackle different challenges, as well as boost our effectiveness in order to align our product portfolio, as well as to achieve higher customer satisfaction rate, while adjusting the customer demand. Now, we are talking about our near-term strategy for these organizational changes in the coming 15 months, but we believe that in the long run, we will continue such adjustment in order to achieve our mid-to-long-term goal.\n\nThank you. [Foreign language] And just allow me to add several key points. The first one is that we will have a clearer positioning of our brands and products. And the second thing is that we are aiming for the long game.\n\nWe are not doing this for the short term. And the third point is that we are going to be more aggressive and more proactive in our sales and marketing campaigns rather than being rather passive just like in the past. And the fourth and the last point is that we will remain a very customer-oriented and focused. Thank you.\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\n[Foreign language] My second question is really about autonomous driving XNGP solution. And can you give a little bit more how are we different from the other solutions such as Mobileye, Huawei, and so on? And also, management mentioned that we are looking for potential opportunity to work with other potential partners XNGP product, and can you explain a bit more on that as well? Thank you.\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] First of all, allow me to address the first part of your question. From our own user experience, there are four key components to the adoption of ADAS technology nowadays. The first one is scenario coverage or scenario support. Now, from our data, we noticed that highway and parking only took up about 10% of people's daily use in terms of the scenario, and 90% of people's use of ADAS technology is actually on city roads.\n\nAnd the second component to the adoption of ADAS is the cost, you know, how much people are willing to pay for the advanced technology. And we actually are confident that, in the future, the cost of affording our XNGP or related ADAS software will be able to be reduced to 20% to 30% of their current cost. And the third component is safety, and the fourth component is the true value that you are able to contribute to your customers. Now, for XNGP, where we are able to roll out our city-based scenario or function, we are actually expanding the scenario coverage by over nine times because 90% of the usage happens on city roads compared to only 10% happen on highways and parking scenarios.\n\nNow, in the past, without our XNGP, people mainly rely on, for example, high-definition maps or laser-related -- laser-based technology, etc. Those pose a lot of challenges, especially in areas where you don't have high-definition mapping available. And that caused a sharp difference. That actually produced a sharp difference in terms of user experience and in terms of the safety as well.\n\nAnd we don't think that that is our final target. That's why we launched XNGP that allows very consistent performance even in areas where we don't have high-definition mapping or high-definition maps available. And that actually is the reason why we are so excited that with the rollout of our city road based or city scenario-based XNGP, we will be able to support a true -- a full scenario functionality in a true sense, and we will be able to provide a very consistent experience when people are switching the use of such functionality from areas with high- definition maps and without high-definition maps. And that will allow our customers to have a very easy and safe and efficient driving experience just like when you are a passenger in a car driven by an experienced driver.\n\nAnd that kind of seamless integration is our goal here, and that is why we are very confident with the rollout of our XNGP to achieve higher customer satisfaction. Thank you.\n\nBrian Gu -- Vice Chairman and President\n\nYeah. And, Nick, to answer your second question regarding the openness in terms of collaboration and cooperation, I think it's all generated from, you know, the recognition that we have spent a lot of effort and resources to develop market-leading technologies. And we think, actually, in addition to increase our sales, I think there is tremendous value embedded in these technologies that can be monetized in other ways potentially. We also saw tremendous interest in such technologies.\n\nWe have leading technology in smart driving autonomy, in smart cockpit, in electrification, and high-voltage platform, etc. So, I think these technologies, I think, could become valuable if we actually have ability to make it more scalable and also using -- leveraging potential partners' resources to quickly penetrate scenarios or markets that we currently doesn't focus on. So, with that, I think our openness, I think that we are evaluating a number of potential opportunities to hopefully help us to make these technology reach more scale, at the same time without compromising our focus on producing sort of attractive and competitive products ourselves. So, this is an attitude.\n\nObviously, you know, if there is more specific progresses we are happy to update when it's available.\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\n[Foreign language]\n\nOperator\n\nThank you. We have next question from the line of Bin Wang with Credit Suisse. Please go ahead.\n\nBin Wang -- Credit Suisse -- Analyst\n\n[Foreign language] My first question is about auto backlog, basically two parts. Number one, what's the new order flow for G9 in November? Second, what's the accumulative order backlog for G9? Because [Inaudible] this year, delivery should be more than 10,000, order backlog already secured? Thank you.\n\nBrian Gu -- Vice Chairman and President\n\nHey, Bin, it's Brian. First of all, as you have tried a number of times but we don't disclose backlog on any model of particular company backlogs. But there are a few things that I want to point out to you. One is that -- as you can see that our delivery timetable has now been extended to later in the first quarter.\n\nThat shows the strong -- our orders at hand, and we will be also delivering a significant number in December of G9. So, that's one indication. Secondly is that we also are confident that with our sales momentum, we see G9 become one of the top three, if not the top two battery electric SUV models over 300,000 RMB price, and that's also an indication of the level of demand that we see.\n\nBin Wang -- Credit Suisse -- Analyst\n\n[Foreign language] Actually, I was just want to check because on your official website, when we try to book G9 online, actually they show up expected deliver time. I want to know whether this might change according to your order backlog. Because some the test actually, if you go to the China website can show the model waiting time. Sometimes it was one to four weeks.\n\nSometimes it's 12 weeks. Actually, indicated demand, waiting time is changing according to the order backlog. So, I just want to know whether G9 waiting time in your website is changing according to your order backlog on real-time basis? Thank you.\n\nBrian Gu -- Vice Chairman and President\n\nYes, Bin. I think you're right. The wait time is correlated to the real-time demand and also our production ramp-up capabilities. So, what you see in the retail store reflects the various models real-time delivery timetable.\n\nBin Wang -- Credit Suisse -- Analyst\n\nOK, thank you. [Foreign language]\n\nOperator\n\nThank you. We have next question from the line of [Inaudible] with CITIC Securities. Please go ahead.\n\nUnknown speaker\n\n[Foreign language] I will translate my question. And my question is about how to be demand-oriented. And specifically, the first one is what is the real customers' demand? And secondly, how do we find them, and what will we do in terms of our structure? Yes, that's my question. [Foreign language]\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\n[Foreign language] All right. Thank you for your question. Now, there are two basic logics behind the industry of automaking, especially for our OEMs. The first one is to adopt the theory of bucket, which means that you have to identify your weakest links and also identify your strengths as well.\n\nNow, in the past several years, I think not just ourselves, but a lot of our peers have been doing their best to actually identify and also improve their weak links in terms of, for example, safety, product quality, service quality, and also cost control as well. We are also doing our best. We're striving to further perfect our service quality, as well as our -- the design of our products, interior design, as well as smart cockpit and other space design as well. So, in the long term, you know, one of the key competitive strengths is to really identify your goal, I'm talking about short-term, as well as the long-term goal as well.\n\nYou have to make sure that you understand the current focus, whether you aim for the short term or the long run. And the second logic behind our automaking industry is to define your customer portfolio or your targeted customer goal, as well as your original target as well. Now, for the past two to three years, XPeng has identified ourselves as a global company in the long run, and we really want to build scale as well. And that is why in the coming three years, well, based on which we have made our three-year plan in the future.\n\nAnd I apologize that, today, I won't be able to disclose further information regarding our future lineup or the, you know, market demand in regards to specific car models. However, what I would like to mention is that in the future, autonomous driving or ADAS technology will be a standard configuration in our future product lineup with very consistent performance and very high-quality capabilities across our product. And also, that's our long-term goal to -- based on which we will further enhance our technological capability and also do better in cost control so that we can deliver truly cost-competitive, high-quality products to our customers. And that will be something that we embody in our next generations of products.\n\nThank you. [Foreign language] Regarding the second part of your question, now our current organizational changes is mainly conducted to fulfill two goals or mainly focus on two areas. The first one is to do changes in terms of our product planning, product development, and also to have a higher efficiency and effectiveness in implementing our technology in our future products. And also to control -- well, first of all, to be able to identify true demand and to control our investment in, you know, the month that has less values.\n\nAnd that is why we have been invested so heavily in perfecting our, for example, electrical and electronic architecture, our whole vehicle architecture, as well as our power train and other systems. With those systems and those integration, we will be able to truly offer an end-to-end solution that are able to deliver high-quality products to our customers. Thank you.\n\nUnknown speaker\n\n[Foreign language] My second question is about P7. In 2023, we will have launched a new P7 with better configuration. And I think it would cause a rise in the down cost. And will we maintain relatively stable GP margin and drives our MSRP, or we want to boost our sales and maybe maintain our price or even lower our price? Thank you.\n\nBrian Gu -- Vice Chairman and President\n\nYes, [Inaudible] it's Brian again. On P7, next year, yes, we aim to launch the upgraded model to reflect the technology advancements, particularly the ones that you saw already on G9. So, the P7 will have the equally advanced autonomous driving architecture. It will also have the faster charging capabilities and higher voltage capabilities, as well as a number of other upgrades and fixes that will address the -- some of the shortcomings people have -- we received the feedback on.\n\nBenefiting from the platform development, actually, since a lot of these advancements are to sharing the modular and platform development, we actually are able to control the cost of the new P7 so to maintain the similar margins of the current version. And also, the current -- some models of the current version P7 will continue to be selling along with the updated P7. So, it's actually, I would say, the high-end or upgraded version of the P7. So, with that, I think we believe we can introduce a much more competitive P7, reflecting the top-of-the-line capabilities that we have in technology while maintaining the segment price and profitability on this series, the P7 series.\n\nUnknown speaker\n\n[Foreign language]\n\nOperator\n\nThank you. As there are no further questions, now, I'd like to turn the call back over to the company for closing remarks.\n\nAlex Xie -- Head of Investor Relations\n\nThank you once again for joining us today. If you have further questions, please feel free to contact XPeng's investor relations through the contact information provided on our website or the TPG Investor Relations. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAlex Xie -- Head of Investor Relations\n\nHe Xiaopeng -- Co-Founder, Chairman, and Chief Executive Officer\n\nDennis Lu -- Vice President, Finance\n\nTim Hsiao -- Morgan Stanley -- Analyst\n\nBrian Gu -- Vice Chairman and President\n\nMing-Hsun Lee -- Bank of America Merrill Lynch -- Analyst\n\nNick Lai -- JPMorgan Chase and Company -- Analyst\n\nBin Wang -- Credit Suisse -- Analyst\n\nUnknown speaker\n\nMore XPEV analysis\n\nAll earnings call transcripts"
}