{
  "companyName": "Lululemon Athletica",
  "companyTicker": "LULU",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/lululemon-athletica-lulu-q2-2022-earnings-call-tra/",
  "content": "Lululemon Athletica (LULU 1.12%)\nQ2 2022 Earnings Call\nSep 01, 2022, 4:30 p.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the lululemon athletica inc. second quarter 2022 conference call.\n\n[Operator instructions] And the conference is being recorded. [Operator instructions] I would now like to turn the conference over to Howard Tubin, vice president, investor relations for lululemon athletica. Please go ahead.\n\nHoward Tubin -- Vice President, Investor Relations\n\nThank you, and good afternoon. Welcome to lululemon's second quarter earnings conference call. Joining me today to talk about our results are Calvin McDonald, CEO; and Meghan Frank, CFO. Before we get started, I'd like to take this opportunity to remind you that our remarks today will include forward-looking statements reflecting management's current forecast of certain aspects of lululemon's future.\n\nThese statements are based on current information, which we have assessed, but by which its nature is dynamic and subject to rapid and even abrupt changes. Actual results may differ materially from those contained in or implied by these forward-looking statements due to risks and uncertainties associated with our business, including those we have disclosed in our most recent filings with the SEC, including our annual report on Form 10-K and our quarterly reports on Form 10-Q. Any forward-looking statements that we make on this call are based on assumptions as of today, and we expressly disclaim any obligation or undertaking to update or revise any of these statements as a result of new information or future events. During this call, we will present both GAAP and non-GAAP financial measures.\n\nA reconciliation of GAAP to non-GAAP measures is included in our quarterly report on Form 10-Q and in today's earnings press release. In addition, the comparable sales metrics given on today's call are on a constant dollar basis. The press release and accompanying quarterly report on Form 10-Q are available under our Investors section of our website at www.lulemon.com. Before we begin the call, I'd like to remind our investors to visit our investor site where you'll find a summary of our key financial and operating statistics for the second quarter, as well as our quarterly infographic.\n\nToday's call is scheduled for one hour. [Operator instructions] And now I would like to turn the call over to Calvin.\n\nCalvin McDonald -- Chief Executive Officer\n\nThank you, Howard. I am excited to be here today to highlight our second quarter results and the continued momentum we're experiencing at lululemon. While the external environment around us has been challenging, we are seeing our guests respond strongly to our product innovations, our community activations and our omni operating model, which allows us to meet and exceed their expectations. During the next few minutes, I will discuss the factors that are driving our broad-based strength.\n\nNext, I'll discuss the current supply chain environment, then our pipeline of product innovation, and I'll conclude with an update on our growth within the international business. As you've seen from our press release, the momentum in our business remained strong in the second quarter. Revenue increased 29% versus last year and 28% on a three-year CAGR basis representing an acceleration from quarter one. Adjusted earnings per share increased 33% and 32% on the same basis.\n\nAnd based on our guidance, we anticipate a high level of performance to continue in quarter three. These results are even more compelling considering the difficult macroeconomic environment in which we are operating. Our performance was only possible because of our teams across the globe. Their dedication, their agility and their enthusiasm for our brand, which enable us to consistently deliver for our guests and report these above-plan financial results.\n\nMeghan will share the detailed performance metrics with you shortly, but I'd like to give you my perspective on what's driving the strength and specifically speak to guest engagement. Given the current macro backdrop, we have been looking closely at our guest data and metrics to identify any shifts in spending patterns, behaviors or habits. And to date, I'm pleased to show that we are not seeing any meaningful variation in cohort behavior or the metrics we track in this area of the business. New guest acquisition remains strong with transactions by first-time guests increasing over 20% in quarter two.\n\nTransactions by existing guests increased in the high teens. Traffic across channels remains robust with store traffic up over 30% and e-commerce traffic increasing over 40%. And importantly, we are not creating this traffic through markdowns or price promotions. lululemon remains predominantly a full-price business, and we have not changed our promotional cadence or markdown strategy and we have no plans to do so.\n\nWhile we haven't seen anything on our internal dashboards to suggest any changes, we continue to monitor our guest behavior closely, and we remain agile in how we plan the business. Shifting topics, like others in the industry, we continue to navigate challenges throughout the supply chain. That said, we are pleased to see some promising signs of improvement yet recognize further normalization within the supply chain will take some time. We currently have no closures across our vendor base.\n\nAnd in China, vendors who had to close their slow production in quarter one due to COVID-19 are beginning to catch up. Ocean delivery times are improving, although they remain significantly elevated compared to the pre-COVID period. And while we continue to strategically leverage airfreight to help ensure timely delivery of product into our distribution centers, we are seeing these rates begin to come down. In terms of inventory, we remain comfortable with both our quality and quantity, and we are well-positioned for the fall season.\n\nAs you recall, for much of last year, we were under-inventoried and not able to fully maximize our business. This year, we are in a much better position to deliver product innovation to our guests wherever and however they shop with us. We remain in the early innings of our growth and we have multiple levers that we can pull to continue our momentum, particularly when looking at product. In quarter two, we drove expansion across our core play and new categories.\n\nLet me now share some highlights of our recent and upcoming product innovations. In our core product categories, we launched SenseKnit, our new proprietary fabric technology offering zone compression for runners and we saw great success in our core scuba and define franchises for women and in our ABC and commission franchises for men. Switching now to our play categories. Our strategy is to solve for our guests' unmet needs across their secondary sweat activities such as golf, tennis and hike.\n\nWe roll out targeted innovations while also leveraging the versatility of our core assortment. This not only builds our credibility within the activity, but it also allows us to drive overall sales while effectively managing SKUs. Our hike collection, which we launched in quarter two, is another example of how we are executing our play strategy well. Hike is an activity that grew in popularity with guests during the pandemic, and we are excited to now be able to serve our guests as they hit the trails.\n\nWe are thrilled by the early reaction to our hike collection with strong response from both guests and the media. And finally, let me update you on footwear. Blissfeel, the first style we launched in March, continues to perform well. We improved our inventory position after the strong guest response at launch, and we're seeing continued excitement around this technical running shoe.\n\nIn quarter two, we launched our next two footwear styles: Restfeel, our dual gender slide; and Chargefeel, our hybrid training shoe for women. Similar to Blissfeel, Chargefeel was designed specifically for women. Our teams developed a dynamic workout shoe to be used across a wide range of training activities, and we're excited about the initial response from both the media and our guests. Looking forward, our pipeline of innovation remains robust, and I'm excited with what the teams have developed for the second half of the year, including a further expansion of apparel for run with new styles offering heat retention and reflective detailing to enable outdoor runs in cooler and low light conditions as the season shift.\n\nWith the exception of a few outerwear styles and accessories, we've never had a sale for cold weather runs. The upcoming expansion of our assortment is a great example of the ongoing opportunity to build out our core categories and provide new solutions for our guests. Next, we will continue to expand our new hike category to include heavier styles to protect against the elements during cold weather outings. We will also continue our throwback strategy with the relaunch of our popular unicorn tears print in select styles.\n\nThis print has not been available since 2012 and has been one of the most requested by our guests, and we're thrilled to be bringing it back for a limited time. And finally, we'll launch our fourth footwear style, Strongfeel, a technical training shoe designed to keep the foot anchored and secured during multidirectional training workouts. While our product is clearly a key point of differentiation, our direct-to-consumer model also provides us with a compelling competitive advantage. Our own channels, both brick-and-mortar and digital, allow us to connect directly with our guests, foster deeper relationships and engage with them in many ways beyond just a purchase transaction.\n\nDuring the pandemic, we evolved our approach and developed new ways to connect digitally with our guests and communities. Now as we're moving into post-COVID world, we're once again connecting with our guests in person while also continuing to leverage new ways to engage digitally. Our new two-tier membership program, which we'll be launching shortly, is a perfect example of our ability to connect with guests in new ways. As we discussed at our Analyst Day, we will be rolling out a free program that will offer members benefits across the lululemon ecosystem, and we will be evolving MIRROR into lululemon studio, which will represent the paid tier of the program.\n\nCommunity connection is at the core of lululemon. Our ongoing outreach and engagement with our guests not only deepen our relationship, but also drive purchases. I'm particularly excited with the opportunity we have in front of us with our new membership program in lululemon studio to activate our community and enhance the connection to our guests across both our physical and digital platforms. Before turning it over to Meghan to discuss our quarter two financials and guidance outlook, let me share some insights into our international business.\n\nOverall momentum in our international business remains strong, with revenue increasing 35% versus last year and 40% on a three-year CAGR basis. In China, after a slower start to the year given COVID-19-related closures and capacity constraints, we have seen a rebound in the region. Revenue grew over 30% versus last year, and we saw a nearly 70% increase on a three-year CAGR basis. We remain in the early innings of growth in China and consistent with our approach in all other markets, we are leveraging our D2C model to grow our brand and attract new guests.\n\nIn quarter two, in our brick-and-mortar channel, we opened eight stores in China Mainland. We now operate 40 stores in Tier 1 cities, 25 stores in Tier 2 cities and 14 stores in Tier 3 cities and continue to see strength across this entire portfolio. In our e-commerce channel, we recently launched a digital flagship store on JD.com, a leading online retailer in China. JD's customer base skews more heavily toward men and represents a compelling new guest acquisition tool for us as we continue to grow our brand in the region.\n\nI'm also thrilled with how our local teams continue to build community, increase our brand awareness and deepen the relationship we have with our guests. A great illustration of this is our summer sweat games 2022. This event saw more than 2,000 guests participate in over 60 events in 20 cities across the China Mainland. Activities included outdoor yoga, dancing and surfing experiences.\n\nIn addition, more than 100,000 guests participated in sweat sessions offered by our ambassadors on Keep, a leading fitness app in China. Shifting now to Europe, where our momentum is also strong, revenue increased 20% and 22% on a one- and three-year CAGR basis, respectively. We are all excited that lululemon is entering Spain, our first new market in the region in three years. Our local e-commerce site is up and running, and our first two stores in Barcelona and Madrid are gearing up to open shortly, and we expect Spain to be a strong market for us going forward.\n\nIn total, we are now operating 40 stores and five websites in Europe. International expansion is one of the key pillars of our Power of Three x2 growth plan, which calls for a quadrupling of our business from 2021 levels by the end of 2026, and we are off to a great start. With that, I'll now turn it over to Meghan.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, Calvin. I'm pleased that we continue to see broad-based strength across our business. Traffic to both our stores and digital channels is strong and guests are responding well to our product innovations. We're in a better inventory position relative to last year, which is also helping to drive our top line strength.\n\nAnd looking at Q3, we're happy with the start to the fall season, which is reflected in the updated guidance I'll take you through shortly. Let me now share with you the details of our Q2 performance. I will also discuss specifics on our balance sheet, including our inventory and cash position. Please note that when comparing the financial metrics for Q2 2022 and Q2 2021, the adjusted operating results for Q2 2022 exclude a $0.06 gain related to the disposition of an office building, while the adjusted operating results for Q2 2021 excludes $0.06 of expense related to the acquisition of MIRROR.\n\nYou can refer to our earnings release for more information and reconciliations to our GAAP metrics. For Q2, total net revenue increased 29% to $1.87 billion, ahead of our guidance. Comparable sales increased 25% with an 18% increase in stores and a 32% increase in digital. On a three-year CAGR basis, total revenue increased 28%, an acceleration from our 27% three-year CAGR in Q1.\n\nIn our store channel, sales increased 30% on a one-year basis and 16% on a three-year CAGR basis. Productivity continues to trend above 2019 levels. On average, we had 98% of our stores opened throughout Q2, and we currently have 99% open. We ended the quarter with a total of 600 stores across the globe, a milestone we are all extremely proud of.\n\nSquare footage increased 19% versus last year, driven by the addition of 66 net new stores since Q2 of 2021. During the quarter, we opened 21 net new stores and completed six co-located optimizations. In our digital channel, revenues increased 53% on a three-year CAGR basis. We contributed $775 million of top line or 42% of total revenue.\n\nWithin North America, revenue increased 26%. And within international, we saw a 40% increase, both on a three-year CAGR basis. And by category, men's revenue increased 30% on a three-year CAGR basis, women's increased 25% and accessories grew 50% on the same basis. I'm also excited that we continue to see strength in traffic across both channels.\n\nAnd stores traffic increased over 30% on top of the 150% increase in traffic we experienced last year. And in our digital business, traffic to our e-commerce sites and apps globally increased over 40%. On a three-year CAGR basis, traffic is up 8% in stores and over 40% in e-commerce. This speaks to the strength of our omni operating model as we engage with our guests in ways most convenient to them.\n\nGross profit for the second quarter was $1.06 billion or 56.5% of net revenue compared to 58.1% of net revenue in Q2 2021. Our gross margin decrease of 160 basis points relative to last year was driven primarily by a 150 basis point decrease in product margin. Q2 product margin included an increase of approximately 130 basis points in airfreight related to macro supply chain challenges, which was slightly better than our guidance of 150 basis points. Markdowns were 30 basis points higher than Q2 2021, given low inventory levels and out of stocks last year.\n\nRelative to 2019, markdowns are flat. We also experienced 40 basis points of deleverage from foreign exchange. This was partially offset by 30 basis points of leverage on fixed costs, driven primarily by occupancy and depreciation. Moving to SG&A.\n\nOur approach continues to be grounded in prudently managing our expenses while also continuing to strategically invest in our long-term growth opportunities. SG&A expenses were $662 million or 35.4% of net revenue compared to 37.3% of net revenue in Q2 2021. Leverage in the quarter versus Q2 2021 resulted from leverage in our store and digital channels and modest leverage on foreign exchange, somewhat offset by increased investments in corporate SG&A and depreciation. Adjusted operating income for the quarter was $391 million or 20.9% of net revenue compared to adjusted operating margin of 20.6% in Q2 2021 and inclusive of approximately 130 basis points of additional airfreight expense.\n\nAdjusted tax expense for the quarter was $110 million or 28.2% of pre-tax earnings compared to an adjusted effective tax rate of 27.9% a year ago. The increase relative to last year is due primarily to a decrease in tax deductions related to stock-based compensation and an accrual for withholding taxes on a portion of our fiscal 2022 Canadian earnings. Adjusted net income for the quarter was $281 million or $2.20 per diluted share, compared to adjusted earnings per diluted share of $1.65 in Q2 of 2021. Capital expenditures were $145 million for the quarter, compared to $80 million in the second quarter last year.\n\nQ2 spend relates primarily to investments to support business growth, including our multiyear distribution center project, store capital for new locations, relocations and renovations and technology investments. Turning to our balance sheet highlights. We ended the quarter with $499 million in cash and cash equivalents and nearly $400 million of available capacity under our revolving credit facility. Inventory grew 85% versus last year and was $1.46 billion at the end of Q2.\n\nWe continue to strategically use airfreight to help mitigate industrywide supply chain issues and support our top line momentum, with these higher costs having an impact on inventory when looked at on a dollar basis. We also believe that 2019 is the most relevant comparison point given supply chain challenges since the beginning of the pandemic. On a three-year CAGR basis, unit inventory increased 38% relative to 2019 at the end of Q2. In-transit inventory is up relative to 2019 and is contributing approximately 2 percentage points to the three-year unit CAGR of 38%.\n\nI'd also point out that we likely left guest demand on the table last year as we were under inventory due to supply chain issues, and we continue to leverage our core assortment, which comprises approximately 45% of our inventory. Looking forward, on a one-year dollar basis, we expect the inventory growth rate at the end of Q3 to be slightly higher than the levels we saw at the end of Q2 before the growth rate moderates to 50% to 60% at the end of Q4. Our expectation of Q3 ending inventory now being the high-water line, when looked at on a one-year basis, is being driven by better on-time performance at our vendors, which is allowing us to receive products sooner than we initially expected. This is also allowing us to use less airfreight as we now expect airfreight for the full year 2022 to be 10 basis points under last year versus our prior expectation of 30 basis points above last year.\n\nOn a three-year CAGR basis, we expect unit growth to remain consistent with Q2 levels in Q3 and moderate somewhat in Q4. In Q2, we repurchased approximately 420,000 shares at an average price of $298. At the end of the quarter, we had approximately $830 million remaining on our recently authorized $1 billion repurchase program. I'm excited with our continued strong performance despite the challenges presented by the current macro environment.\n\nOur teams across the business are executing at a high level. However, as we did throughout the pandemic, we continue to plan the business for multiple scenarios, so we are ready should we see any change in guest behavior. We have multiple levers to pull when it comes to discretionary expenses and capital expenditures. And as Calvin said, we are monitoring our guest metrics very closely to determine if we need to make any adjustments.\n\nLet me shift now to our outlook for Q3 and the full year 2022. For Q3, we expect revenue in the range of $1.78 billion to $1.81 billion, representing one-year growth of 23% to 24% and a three-year CAGR of approximately 25. We expect to open 25 net new company-operated stores in Q3. We expect gross margin in Q3 to be down 50 to 70 basis points relative to Q3 of 2021.\n\nWhile we expect to see leverage on airfreight expense relative to last year, this will be offset by the timing of expenses related to our supply chain initiatives, as well as a more normalized level of markdowns relative to the low levels we experienced last year. In Q3, we expect our SG&A rate to be relatively flat with Q3 2021. Based on the timing of our investments, we would expect SG&A to be relatively flat with last year in Q4 as well. Turning to EPS.\n\nWe expect adjusted earnings per share in the third quarter to be in the range of $1.90 to $1.95 versus adjusted EPS of $1.62 a year ago. For the full year 2022, we now expect revenue to be in the range of $7.87 billion to $7.94 billion. This range assumes our e-commerce business grows in the low- to mid-20s relative to 2021. When looking at total revenue, our guidance implies a three-year CAGR of approximately 26%, which continues to be higher than our three-year revenue CAGR of 19% leading up to 2020 and higher than the target of approximately 15% growth we set forth in our new Power of Three x2 growth plan.\n\nWe now expect to open approximately 75 net new company-operated stores in 2022, up modestly from our prior guidance of approximately 70. Our new store openings in 2022 will include approximately 45 stores in our international markets and represents a square footage increase in the low 20% range in total. For the full year, we are forecasting gross margin to decrease between 100 to 130 basis points versus 2021. The reduction relative to last year is driven predominantly by increased investment in our DC network, and a more normalized level of markdowns relative to the low levels we experienced last year while still below 2019 levels.\n\nTurning to SG&A for the full year. We are now forecasting leverage of 100 to 130 basis points versus 2021, driven predominantly by increased sales. And when looking at adjusted operating margin for the full year 2022, we expect it to be approximately flat to up slightly versus last year. For the full year, we expect our effective tax rate to be 28% to 28.5%.\n\nFor Q3, we expect our effective tax rate to be approximately 28%. For the fiscal year 2022, we expect adjusted diluted earnings per share in the range of $9.75 to $9.90 versus adjusted EPS of $7.79 in 2021. Our EPS guidance excludes the impact of any future share repurchases and the gain on the real estate sale we realized in Q2. We now expect capital expenditures to be approximately $610 million to $635 million for 2022.\n\nThe increase versus 2021 reflects increased investment in our supply chain, digital capabilities, new store openings and renovations, as well as other technology and general corporate infrastructure projects. Notably, this includes our new multiyear project to increase our distribution capabilities to support our future volume and growth and increased square footage growth relative to last year. A range of $610 million to $635 million is approximately 8% of revenue, in line with our current Power of Three x2 target of 7% to 9%. Thank you.\n\nAnd with that, I'll turn it back over to Calvin for some closing remarks.\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks, Meghan. As you can see from our results, lululemon continues to perform at a high level, and I am consistently impressed by the ability of our teams to anticipate, meet and exceed the needs of our guests. And across the business, we're seeing that our guests are eager to welcome us into new categories, styles and markets, which speaks to the significant growth potential for lululemon going forward. We are off to a very good start as we embark upon our Power of Three x2 growth plan, and there's a clarity and focus on the work underway across the company.\n\nAnd in closing, I want to express my gratitude to everyone at lululemon for your hard work and the passion that continues to show all of us the power of our people and company. Operator?\n\nOperator\n\n[Operator instructions] The first question is from Adrienne Yih with Barclays. Please go ahead.\n\nAdrienne Yih -- Barclays -- Analyst\n\nThank you. Congratulations. Another just remarkable quarter. Calvin, I guess I wanted to talk about there was a lot of intra-quarter chatter about kind of promotions across the space and kind of a slowing in the athleisure.\n\nWe've obviously talked about how lulu is more of a brand rather than sort of a retailer. But I really want to understand what are -- what is the method that you're using to address some of the promotions that are going on around you? You no longer do warehouse sales. You're just doing sort of the online clearance, but you're not even calling that out as an online warehouse sale. So just what are the methods that you're using to move through the aged inventory that's allowing you to keep up the brand equities? Thanks so much.\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks, Adrienne. In terms of methods, there's been no change to our approach on markdowns. As you know, we were -- we took modest price increases on a small percentage of our range of product. We continue to closely monitor that.\n\nAnd our markdown activity is in line with past penetrations 2019 pre-pandemic. And it really is -- our momentum is driven through the pillars of growth and innovation of our product. So the positioning around unique innovative products through our core is resonating with our guests and our markdown behavior has not changed with no plans to change and the quarter's results were driven by full price selling prices.\n\nAdrienne Yih -- Barclays -- Analyst\n\nThank you very much.\n\nOperator\n\nThe next question is from Mark Altschwager with Baird. Please go ahead.\n\nMark Altschwager -- Baird -- Analyst\n\nThank you. Good afternoon. So really encouraging to hear you haven't seen any major shifts in consumer behavior. Given the choppier macro backdrop versus a few months ago that many others have called out, maybe just speak a little bit more to what you're seeing in your business that's giving you the confidence to actually raise the implied back half growth outlook? Thank you.\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks, Alex. One of the areas that continue to fuel our momentum and give us the confidence and the momentum heading into the back half of this year is the balanced growth that we're seeing across all of our pillars in the Power of Three x2 growth initiatives. And I'll quickly break them down because it really does support that narrative and the fact that we're in early innings of growth, and we have multiple levers to pull to grow our business that we are innovating into through our strategies, and they are resonating. So from a product perspective, when you look at our business across activities, categories and gender, where our men's business was up 27%, our women's business was up 24%, accessories was up 80%.\n\nWe were seeing very balanced growth in all of those activities driving and through innovation. On the guest side, the omni guest key initiatives, our new guests were up 24% existing. We're transacting at a 17% increase rate. Traffic was incredibly strong with stores up 30%, e-com up 40 and strong sales comps across both our e-com in-store business, again, very balanced.\n\nAnd then at the regional level, North America, up 28%; international, up 35%. So the plan that we've been working on is we are early innings of the execution, but it's resonating, it's working and the business is growing across all of these levers in a very balanced way that's allowing us to achieve the results, contributing the momentum. In the back half, when I look at product innovation, an innovation across the guest with the launch of our membership program and our expansion into the regions gives us the confidence that we can keep the momentum in our business strong and hence, the guidance that we've shared.\n\nMark Altschwager -- Baird -- Analyst\n\nGreat. Thank you, Calvin. And congrats to you and the team on the strong results.\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThe next question is from Alex Straton with Morgan Stanley. Please go ahead.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking my question, and congrats on another great quarter. I wanted to dig into the international result, amazing at 35% year over year. Can you just talk about the key drivers there? If there were specific geographies or more broad-based? And also, as it becomes a bigger part of lululemon's revenue over time, can you just talk about what the margin implications would be? Thank you.\n\nCalvin McDonald -- Chief Executive Officer\n\nWell, absolutely. Very pleased with our international business, as you know, our five-year plan is to quadruple it. And across every market we're in, we continue to see very strong results for the brand, the way it's resonating in the market. And excited about the investment strategies we have in a rolling out across -- in Europe.\n\nWe're seeing good growth across all countries. We opened our dot-com site in Spain. We actually opened our first store in Barcelona tomorrow. We opened Madrid in a few weeks.\n\nWe opened on [Inaudible] later this year. So excited about the opportunities we continue to see in Europe, across Asia Pacific, in Australia with some of the new stores that we've opened. And China, which continues to be one of our big market opportunities even with ongoing operational challenges we saw an acceleration in the quarter, with China growing 30%. And excited about the way the new stores are working in the market, the way that product continues to resonate, new guest acquisition and activating through communities.\n\nSo in every market where we're in, we're seeing a very balanced contribution to our growth and are early in the opportunities that we see in each of these markets.\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThe next question is from Matthew Boss with J.P. Morgan. Please go ahead.\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nGreat. Thanks, and congrats on a really nice quarter. So Calvin, on the high 20s revenue CAGR that you posted in the first half and taking into account the new customer acquisition metrics that you cited, so do you think the performance that you're seeing relative to the remainder of the market, is this a combination of a larger TAM, but then also company-specific market share gains? And then Meghan, I guess, more near term, have you seen any notable change in momentum in either stores or digital so far in August?\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks, Matthew. I'll take the first half. We've definitely seen market share gain according to NPD. We've -- we are the largest share gainer in the quarter at 1.4 points.\n\nSo we're very pleased with our performance, our performance relative to our peer sets. And I think the first half of this year is really a consistent narrative of new category expansion, driving awareness through a number of earned media opportunities, as well as us continuing our investment in collective and community and reactivating some events, great product that's driving new guest acquisition and an existing guests that continues to be engaged in the expansion of both our core and play activities, be it golf, tennis, hike, those are resonating very well. They're lifting our core sales. So it's a combination of the levers that we've been working toward, and it has translated into market share gain in the quarter.\n\nMeghan Frank -- Chief Financial Officer\n\nAnd Matt, I'd add on Q3, so we're happy with the start of the quarter. I'm comfortable with the guidance we provided, which was a three-year revenue CAGR of 25%. And as Calvin mentioned, we are seeing continued strength in our guest behavior and metrics there, which we continue to monitor closely. And I'd say within that, pleased with the performance of stores and digital that you asked about.\n\nAnd, obviously, the macro environment is dynamic. We continue to plan the business based on multiple scenarios and feel well-positioned as we enter Q3.\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nCongrats again. Best of luck.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, Matt.\n\nOperator\n\nThe next question is from Brooke Roach with Goldman Sachs. Please go ahead.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nGood afternoon, and thank you for taking our question. Calvin, I was wondering if you could reflect on the very strong new customer acquisition trends that you've been seeing in this quarter. Can you speak to more detail on what specifically is driving that new guest acquisition? Are the demographics of that customer changing versus your historical new guests? And how important are these new product categories or select accessory items in driving that engagement?\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks, Brooke. As you've indicated, very healthy new guest acquisition numbers at plus 24%. And I would say the majority of their first purchases have been very consistent with our traditional categories that we're seeing, very strong bottoms business and very strong in women's and new guests in men. So very pleased with the balance.\n\nThe success of the everywhere belt bag has added to new guest acquisition. So we're excited to see that as a way to bring even more into our collective and with our guests. But the bulk and the majority of the driver as it is with our sales growth is our core traditional. When we expand into new categories and as we expand deeper into play, it really resonates with our existing guests, which is a big part of the positioning of the strategy, and we saw that through existing guests increasing transactions with us at plus 17%, very healthy.\n\nSo the strategy is, obviously, bring them in, new guests, migrate them up and expand and increase the share of wallet. And innovation is doing both in pulling new guests in, as well as migrating them up in their spend. And we're seeing a very healthy balance across all of those levers.\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nThank you very much.\n\nOperator\n\nThe next question is from Lorraine Hutchinson with Bank of America. Please go ahead.\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nThanks. Good afternoon. Can you talk a little bit about the reaction to the limited price increases you've taken so far this year? And then any expectations for the back half or into 2023 to continue along the path of price increases?\n\nMeghan Frank -- Chief Financial Officer\n\nLorraine, as we mentioned, we've taken modest increases -- or we were taking throughout the year of modest increases on approximately 10% of the assortment. We haven't, to date, experienced any price resistance. We continue to closely monitor and don't have any plans to change our markdown cadence as we move throughout the year, still very high, healthy full price sell-throughs.\n\nOperator\n\nI think the line is mute -- is on mute for the speakers.\n\nMeghan Frank -- Chief Financial Officer\n\nGo ahead. We'll take the next question.\n\nOperator\n\nThe next question is from Dana Telsey with Telsey Advisory Group. Please go ahead.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nGood afternoon, everyone, and congratulations on the impressive results. As you see -- as you take a look at freight, it seems like it's moderated from the first quarter to the second quarter. How do you see freight going through the balance of the year? And then just next thing on -- Calvin, the core product, obviously, is 45% of sales. The new collections that are coming in are certainly driving conversion and interest.\n\nHow do you see core as a percent of the business going forward given the solid receptivity to new categories? Thank you.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, Dana. So in terms of airfreight, yes, we've started to see it moderate. As I mentioned, we are starting to see higher on-time deliveries from our vendors, as well as some shorter lead times. So we have amended the color that we provided on airfreight to be 10 basis points under last year for the full year.\n\nAnd then that compares to 30 basis points above that we previously guided to. We still see airfreight as an opportunity over the longer term. It still sits 280 basis points above 2019. But we'll continue to see that moderate through the second half of the year, and the team is looking for opportunities, wherever possible to be as efficient as fees well there.\n\nCalvin McDonald -- Chief Executive Officer\n\nAnd -- hi, Dana, on the question around core, we have not seen a material shift in that, nor does the strategy and the success of the strategy suggest we should. If anything, as we continue to create depth and strength in our core, it could increase as a percentage of our overall business. And as I shared, we have opportunity within some of our core own activities such as run, train and yoga to keep developing core items. And the play activities that we launched across golf, tennis and hike are designed to and absolutely achieved in the results, the goal of using unique innovation to bring in awareness, interest, credibility into these activities, but to ultimately still drive core as much of our core and the versatility of the product can be used in those sweat activities.\n\nAnd the strategy has worked in the first half of the year as we continue to innovate and lean in. So very niche and small number of SKUs, leveraging core which holds at 45%. And as we expand opportunities in some of the core activities, I expect that number to hold, if not improve.\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from John Kernan with Cowen and Company. Please go ahead.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nExcellent. Thanks for taking my question and congrats on phenomenal results. Maybe if you go back to international, it's obviously a huge portion of your future growth when you quadruple that. Just curious what is enabling you to outperform all of your peers in China to such an extent in the most recent quarter?\n\nCalvin McDonald -- Chief Executive Officer\n\nThanks, John. I think it's no different than the ability of us to put on market share and outperform the market -- in our most mature market in North America, where we are still early and have the opportunity to grow. We are early in brand awareness. The product led by innovation is resonating.\n\nOur investment in our guest relationships, I shared a little bit about the sweat games and the number of guests that participate in that both physical, as well as digitally, over 100,000 online with us. And the investment -- exciting to keep seeing the success, share the tier cities we're in now in Tier 1 and Tier 2 and Tier 3, all resonating, responding well. So our D2C model is unique versus our peers and other brands in that market. It's rooted in relationships, building the community, which has how we built our business and great innovative product that is differentiated and unique in the marketplace.\n\nSo it is our formula. It is resonating in that, and we have an incredible team led by San Yan leading it and across the stores and a very strong culture. So we're excited, but it really is the lululemon formula that's resonating and delivering the results.\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nVery riveting. Thank you.\n\nCalvin McDonald -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Michael Binetti with Credit Suisse. Please go ahead.\n\nMike Binetti -- Credit Suisse -- Analyst\n\nHey, guys. Congrats on a great quarter, and for taking our questions here. Meghan, on the gross margin, we're just trying to do a little bit of the math you gave us here in the second half. It looks like the overall gross margin range you're giving us for the back half is pretty close to what it was before.\n\nBut I think you have about 60 basis points less air freight pressure on a one-year basis in the back half. Any call-outs as to the offset there just so we can kind of track along with you on the build there? And then in the back half on air freight pressure, how locked in are you in the guidance that you gave versus -- fixed versus variable that could change here given how much spot rates have been moving around lately?\n\nMeghan Frank -- Chief Financial Officer\n\nYeah. Thanks, Michael. So we guided to 10 basis points under last year in air freight versus the 30 basis points higher than we experienced that we had shared on the last call. So we are starting to see both the impact of the early deliveries, as well as the rates coming down, and the team continues to look for opportunities there.\n\nWe will continue as the business expands to look at pulling forward investments that are part of our road map as we move to our next five-year trajectory. . So we have improved our margin guide for the year from 100 to 150 basis points down year over year to 100 to 130. So continue to feel like we're moving in the right direction, and air freight represents a big opportunity for us over the longer term, still 280 basis points above 2019 levels.\n\nMike Binetti -- Credit Suisse -- Analyst\n\nThank you.\n\nOperator\n\nThe next question is from Sharon Zackfia with William Blair. Please go ahead.\n\nSharon Zackfia -- William Blair -- Analyst\n\nHi. Good afternoon. Thanks for taking a question. I guess, first on the SG&A.\n\nI think Meghan, originally, you expected SG&A leverage in the fourth quarter. I heard you say flattish now. I'm just wondering if you're pulling forward or accelerating any investments? And then kind of a conjunct to that, I know at the Analyst Day, you had talked about a coordinated marketing campaign this fall. Is that still on tap? And can you give us an idea of what we'll see when that launches?\n\nMeghan Frank -- Chief Financial Officer\n\nYeah. So in terms of SG&A, we haven't previously provided Q4 guidance. We've got some timing, I would say, on investments. And again, as we look at our full year outlook, looking to pull forward some investments that are part of our road map as we look toward our next five-year trajectory.\n\nSo we are guiding now to 100 to 130 basis points of leverage for the full year versus our prior guide at 50 to 100. We -- yeah, and then Calvin is going to chime in here on the marketing.\n\nCalvin McDonald -- Chief Executive Officer\n\nYeah. On the marketing, there's a couple of exciting initiatives planned in the back half. One is around our launch of our two-tier membership program shortly. And that is more of a North American focus, but we're excited to bring that to our guests.\n\nAnd Nikki was referencing, as we continue to look at ways of just bringing a coordinated global message, our approach to holiday this year in some key categories. There's not a material change in spend, but we continue to find effective ways to deliver a strong, powerful product, community-led message around the globe. We're making gains on that. Helped in the first half, and we'll continue to do so in the second half and moving forward.\n\nOperator\n\nThe next question is from Tom Nikic with Wedbush. Please go ahead.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nHi, everybody. Thanks for taking my question. Meghan, I want to ask about the inventory growth. I know that there's a lot of puts and takes here.\n\nAnd one of the things is increased transit times and things like that. When we look at inventory, I guess, beyond the end of this year, like I mean, do you think that just structurally, you're going to carry more inventory on the balance sheet, relative to the sales level, or do you think when we kind of get beyond this year and things kind of normalize a little bit, maybe going forward, you would grow inventory at a slower rate relative to sales and you would see turnover improve?\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, Tom. Yeah. So inventory this year, when you look at it on a one-year basis includes higher usage of airfreight impacting our AUC, as well as comparisons to out of stocks last year. And then as I mentioned, we're starting to experience earlier deliveries, both vendor readiness and then also lead times.\n\nSo there is quite a bit of a dynamic nature, when specifically looking on a one-year basis, which is why we've been really focused on that three-year unit CAGR. I do see opportunity over the longer term for us to manage inventory below at some point, our sales trend -- as some of these trends normalize. And then over the longer term, we aim to manage our inventory in line with sales.\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nUnderstood. Thanks very much and look forward to the rest of the year.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, Tom.\n\nOperator\n\nThe next question is from Jay Sole with UBS. Please go ahead.\n\nJay Sole -- UBS -- Analyst\n\nGreat. Thank you. I want to -- Meghan, I want to follow up on the last point. Just talking about receiving inventory sooner.\n\nCan you give us an idea of how long it's taking now to receive goods and sort of how long it was taking it to peak? And what would be normal going forward? What would be a normal amount of time to receive the goods?\n\nMeghan Frank -- Chief Financial Officer\n\nYeah. There's a couple of dynamics going on. One would be we are seeing vendor readiness metrics improve. So that's one impact.\n\nAnd then the other impact, I would say, is ocean lead times. So we typically have seen, and this is on average about 45 days. These have gone up to 90 days plus during the kind of peak disruption. We've seen them drop approximately to 70 days.\n\nSo not back to where they were, but definitely improvement to what we've seen. So that, coupled with the earlier vendor readiness provides some opportunities for us to switch modes, which you see reflected in our guidance.\n\nJay Sole -- UBS -- Analyst\n\nGot it. And if I can just maybe, Calvin, asked you one question about accessories. You mentioned the belt bag, and just the success overall of the company adding new categories. Can you just talk about accessories, what's the opportunity to continue to segment that category to offer price points in bags maybe above $200 versus kind of what you're offering now, which is sort of like lower price relative to a lot of the competition that's out there selling tote bags and backpacks and things like that?\n\nCalvin McDonald -- Chief Executive Officer\n\nYeah. No. We're excited about the opportunity in our accessories business and definitely have plans across a number of the categories. Everywhere belt bag is a lower price point item.\n\nWe're seeing it being a great driver across existing guests, as well as guest acquisition. I think accessories, in general, has played a role like that and could continue to play a stronger role. The team has done a wonderful job in the last few years, bringing great innovation into the sock business, and we have a very strong growing innovative product line in the sock category. Bags, being one of the biggest opportunities, we are dropping and innovating incrementally in the pipeline for the foreseeable future is to continue to develop out that category, where we all agree we can do even more and have a great opportunity across.\n\nAs you said, backpacks, we have a lot of on-the-move bags for sport, but also a variety of unmet needs that the teams are innovating into. So bags is definitely on our road map of product pipeline, building on the everywhere belt bag, but accessories in general is a great opportunity to keep growing, contributing and guest acquisition.\n\nHoward Tubin -- Vice President, Investor Relations\n\nOperator, we'll take one more.\n\nJay Sole -- UBS -- Analyst\n\nGot it. Thank you so much.\n\nOperator\n\nThe next question is from Paul Lejuez with Citi. Please go ahead.\n\nPaul Lejuez -- Citi -- Analyst\n\nHey. Thanks, guys. Just looking at the reported sales numbers and comps, I think you got a spread of about 600 basis points, but your square footage is up around 19%. So just wanted to understand what accounts for the difference there, why there isn't a bigger between comps and total sales growth and maybe tie in how you're feeling about the new store performance as you're opening in some of these international markets? Thanks.\n\nMeghan Frank -- Chief Financial Officer\n\nThanks, Paul. Yeah, I'd say there's a nuance there and looking at it from an omni perspective with our -- the size of our e-commerce business. That said, what I'd share is we're really pleased with the productivity of both our existing store base. We've gotten above 2019 levels.\n\nWe continue to see opportunity for further expansion over the longer term. I'm really pleased with our new store expansion strategy. We did raise our guidance from 70 new stores to 75 for the full year with some exciting opportunity in front of us, both in our North America and international regions. So stores, I would say, remain a very important and productive part of our business model, including the operating margin, which we've seen get into the high 20s in the quarter.\n\nOperator\n\nThat's all that we have -- that's all the time we have for questions today. Thank you for joining the call, and have a nice day.\n\nDuration: 0 minutes\n\nHoward Tubin -- Vice President, Investor Relations\n\nCalvin McDonald -- Chief Executive Officer\n\nMeghan Frank -- Chief Financial Officer\n\nAdrienne Yih -- Barclays -- Analyst\n\nMark Altschwager -- Baird -- Analyst\n\nAlex Straton -- Morgan Stanley -- Analyst\n\nMatt Boss -- J.P. Morgan -- Analyst\n\nBrooke Roach -- Goldman Sachs -- Analyst\n\nLorraine Hutchinson -- Bank of America Merrill Lynch -- Analyst\n\nDana Telsey -- Telsey Advisory Group -- Analyst\n\nJohn Kernan -- Cowen and Company -- Analyst\n\nMike Binetti -- Credit Suisse -- Analyst\n\nSharon Zackfia -- William Blair -- Analyst\n\nTom Nikic -- Wedbush Securities -- Analyst\n\nJay Sole -- UBS -- Analyst\n\nPaul Lejuez -- Citi -- Analyst\n\nMore LULU analysis\n\nAll earnings call transcripts"
}