{
  "companyName": "Tradeweb Markets Inc",
  "companyTicker": "TW",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/tradeweb-markets-inc-tw-q3-2022-earnings-call-tran/",
  "content": "Tradeweb Markets Inc (TW -1.87%)\nQ3 2022 Earnings Call\nOct 27, 2022, 9:30 a.m. ET\n\nOperator\n\nGood morning and welcome to Tradeweb's third quarter 2022 earnings conference call. As a reminder, today's call is being recorded and will be available for playback. To begin, I'll turn the call over to head of treasury, FP&A & investor relations, Ashley Serrao. Please go ahead.\n\nAshley Serrao -- Head of Treasury and Investor Relations\n\nThank you and good morning. Joining me today for the call are our chairman and CEO, Lee Olesky, who will review the highlights for the quarter and provide a brief business update, our CEO elect and president, Billy Hult, who will dive a little deeper into some growth initiatives and our CFO, Sara Furber, who will review our financial results. We intend to use the website as a means of disclosing material, nonpublic information, and complying with disclosure obligations under SEC regulation FD. I'd like to remind you that certain statements in this presentation and during the Q&A may relate to future events and expectations, and as such, constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995.\n\nStatements related to, among other things, our guidance are forward-looking statements. Actual results may differ materially from these forward-looking statements. Information concerning factors that could cause actual results to differ from forward-looking statements is contained in our earnings release and periodic reports filed with the SEC. In addition, on today's call we will reference certain non-GAAP measures.\n\nInformation regarding these non-GAAP measures, including reconciliations to GAAP measures are in our posted earnings release and presentation. To recap, this morning we reported GAAP earnings per diluted share of $0.33. Excluding certain non-cash stock-based compensation expense, acquisition-related transaction costs, acquisition- and Refinitiv-related D&A, and certain FX items, and assuming an effective tax rate of 22%, we reported adjusted net income per diluted share of $0.45. Please see the earnings release and Form 10-Q to be filed with the SEC for additional information regarding the presentation of our historical results.\n\nNow, let me turn the call over to Lee.\n\nLee Olesky -- Chief Executive Officer\n\nThanks, Ashley. Good morning, everyone, and thank you for joining our third quarter earnings call. As I take part in my last Tradeweb earnings call, I sit back and reflect upon this start-up that I co-founded over 25 years ago with $10 million in capital. The core approach was simple.\n\nListen to our clients and build services, products, protocols, and functionalities that enhance their trading workflows. Over those 25 years, the talented Tradeweb employees have grown this institutional U.S. Treasury start-up into a global, multi-asset class, multi-client, and multi-protocol business. One of the crowning achievements was the 2019 IPO, followed by the tremendous growth the team has produced as a public company.\n\nIn fact, from 2004 through 2021, we have averaged 12.9% annual revenue growth. In the first three quarters of 2022, we generated revenues of $896 million, up 55% from the first three quarters of 2019 or an average growth of 16% per year despite the material FX headwinds we are currently facing in 2022. The lion's share of this growth has been organic as a result of relentless focus on innovation and collaboration that continues to be the north star of our company, as we help clients trade as efficiently as possible. This strategy sounds simple, yet success requires perseverance.\n\nOur team has dedicated the time and focus to link different liquidity pools and markets, to deliver holistic, global, multi-asset class solutions, something we call connecting the dots. This incessant focus on moving markets forward has allowed us to develop a diversified business model that allows the company to drive strong revenue growth even when facing a challenging macro environment in some of our products and client channels. I'm thrilled to pass the baton to my longtime friend and partner, Billy. I am excited to see him, Tom, Sara, Enrico Bruni, who is the head of Asia and Europe, Chris Bruner, who built our institutional U.S.\n\ncredit business, Justin Peterson, our chief technology officer, and the entire Tradeweb team as they continue to build upon our competitive advantage, our people, network and technology. I am excited to watch the team capitalize on the long-term growth runway ahead and most of our markets still trading over the phone. Turning to Slide 4, record third quarter revenues of $287 million were up 8.2% year-on-year on a reported basis. The underlying strength in the business was even better, stripping out the 490 bps of FX headwinds that have been the most severe since we went public, we generated strong revenue growth of 13.1% on a constant currency basis and another double-digit revenue growth quarter.\n\nThe revenue growth and the resulting scale translated into improved profitability relative to full-year 2021 as our year-to-date adjusted EBITDA margin increased by 83 basis points to 51%. Adjusted earnings per share saw healthy growth of 15% year-on-year. Turning to Slide 5, the diversity of our growth was on display once again this quarter, marked by double-digit constant currency growth across all of our asset classes. Rates and credit continued to lead the way, accounting for 40% and 27% of our revenue growth, respectively, while equities provided 22% of the growth, a high-water mark in terms of growth contribution.\n\nSpecifically, rates posted its best third quarter revenues ever, driven by our continued growth across global government bonds and swaps. In cash rates, U.S. Treasury revenues were up nearly 10% year-on-year given the acceleration of our retail business due to the higher rate environment. Swaps produced another strong quarter with positive market share growth, while mortgage revenues declined given the challenging rate backdrop.\n\nCredit posted another strong quarter, driven by strong Munis, U.S. corporate credit, and CDS trading. Equities posted its highest third quarter revenues ever driven by institutional ETFs and our efforts to diversify and grow our other equity products. Money markets set a new record fueled by growth in our retail CD franchise and continued organic growth in institutional repos.\n\nFinally, market data revenue growth was equally split across our Refinitiv contract and our proprietary data products, which continued to enjoy robust growth. Moving on to Slide 6 I will provide a brief update on two of our main focus areas U.S. Treasuries and ETFs and turn it over to Billy to dig deeper into U.S. credit and global interest rate swaps.\n\nStarting with U.S. Treasuries our market share fell slightly to 19.6% of the U.S. Treasury market. The slowdown that we saw in the second quarter within our institutional asset manager and hedge fund clients, as they moved to the sidelines and trimmed risk as volatility spiked, persisted into July.\n\nActivity started to improve exiting July with both August and September registering month-over-month increases. The leading indicators of the institutional business remain strong. We gained share versus Bloomberg and client engagement was good with the number of users increasing by 10% year-on-year and 3% quarter-on-quarter. On the other hand, our wholesale performance was mixed as our legacy streaming offering saw positive revenue growth while our CLOB underperformed as elevated volatility benefited the incumbent.\n\nRecall when we acquired NFI, the first phase of our integration plan was focused on expenses-consolidating broker-dealers and technology platforms and migrating the data center. We will be consolidating the broker-dealers shortly and plan to migrate data centers during the first half of 2023. After we migrate the data center, we expect that to be a catalyst for revenue growth as we rebuild the liquidity pool. On the whole, we believe the US Treasury business is in a unique position with deep retail, wholesale, and institutional liquidity pools giving us the ability to continue to grow and capitalize on any potential market structure change.\n\nFinally, within equities, institutional ETFs produced strong quarterly revenue growth with average daily volume up 43% year-on-year driven by new client wins and strong industry volumes. The client pipeline remains strong as the benefits of our electronic solutions continue to resonate. Structurally, we are seeing an increase in cross-asset trading, whereby ETF RFQs are being placed by both fixed-income and equity trading desks. Our other initiatives to expand beyond our flagship ETF franchise are also bearing fruit with momentum continuing in the equity options, convertibles, and ADRs.\n\nWe look forward to crossing the $100 million annual revenue mark in the coming quarters and we believe we remain well-positioned to benefit from the secular growth in ETFs and our other growth initiatives scaling. With that, I will turn it over to Billy.\n\nBilly Hult -- President\n\nThanks, Lee, and congratulations on a terrific run at Tradeweb. As Lee highlighted in his opening, we have methodically grown our asset class, geographic, and client footprint over the last 25 years. One thing that has been constant at Tradeweb is our singular focus on collaborating with our clients to drive change in the fixed-income markets. Despite all the success we've had to date, I believe the best is yet to come.\n\nIn fact, we just completed an offsite where we gathered our senior leaders and discussed our growth outlook for the next few years. The energy and optimism around the durability of our growth was remarkable-we expect credit and swaps to continue to be the backbone of our growth but will also be expanding our EM and muni footprint in a meaningful way. As you might expect, we are also working on a few more initiatives that we will reveal in due course. I am truly excited about the team that we have assembled and our ability to deepen our competitive advantage across our people, network, and technology.\n\nOn that note, I'd like to officially welcome Tom Pluta, who joined as president-elect at the beginning of the month, and I believe he will be a valuable addition as we look to grow Tradeweb's footprint over the coming years. Turning to Slide 7 for a closer look at credit. We quite often talk about the diversity of the business across asset classes, but the diversity within each asset class shines in moments like this. Corporate credit faced a mixed industry volume backdrop given the elevated volatility, continued fee per million pressures across institutional IG due to a reduction in duration, and tougher market share conditions across high yield.\n\nHowever, the elevated volatility and wider spreads continued to boost our CDS business, and the higher rates helped drive nearly 90% year-over-year revenue growth in our muni and retail and middle market credit businesses. The product of this was a healthy quarter with 12% year-over-year constant currency revenue growth. It's amazing to see our growing credit business now annualizing over $300 million in revenues, led by U.S. Credit.\n\nWe have a differentiated strategy in U.S. Credit, and we continue to work on building out that puzzle, expand our client network, grow our all-to-all volumes, and develop our integrated strategy across client channels. Electronically, credit is a young market with plenty of potential for further innovation and we believe that our holistic credit approach and strong feedback loop with clients will continue to help us expand our network. We are excited to hit new fully electronic market share records in IG and we believe further investments in high yield can lead to a similar outcome in the coming quarters and years.\n\nOur institutional volume growth continues to be underpinned by growth in RFQ and portfolio trading. Our third quarter RFQ average daily volume grew 14% year-over-year driven by investment grade. RFQ remains the main protocol in the U.S. Credit market, but we realized that the protocol hadn't evolved very much over the last 15 years.\n\nSo rather than imitate, we reimagined the RFQ protocol to create a differentiated client trading experience and we are excited about the initial positive results that we have achieved over the past few quarters. Expanding our RFQ presence across IG and high yields remains our biggest opportunity and we continue to see great success cross selling the innovations we have brought to the credit market to gain wallet share. Despite the continued increase in spreads and volatility, we also continue to see strong portfolio trading activity on the platform with average daily volume growing 13% year-on-year and September being another record month. The underlying trends remain impressive globally.\n\nThe number of users are up by 15% while the line items traded were up over 35% year-over-year. In the quarter, our largest trade was greater than $2 billion. Behavior change takes time, but clients are increasingly using our market-leading portfolio trading solution to access greater liquidity, minimize information leakage, improve certainty of execution, trade less liquid instruments more efficiently, trade credit portfolios at the close, and reduce workload and operational risk. The strength in RFQ and portfolio trading was matched by the strong growth of our anonymous liquidity solution, AllTrade, which saw nearly $100 billion in volume with average daily volume increasing 12% year-over-year.\n\nOur all-to-all liquidity volumes saw positive year-over-year growth across IG but faced tougher client conditions within high yield. While high yield volumes were down year-over-year, the number of high yield all-to-all responders increased by 12% year-over-year and is up 40% since the beginning of 2021 giving us confidence that we can continue to deepen our liquidity pool moving forward. Sessions volumes saw double-digit volume growth led by IG, while HY faced tougher hit rate conditions given more one-way submission flow. Finally, we remain laser-focused on maximizing the value of session liquidity uploaded on our platform through newer protocols like Rematch, which accesses our all-to-all liquidity.\n\nOur Rematch average daily volume was up nearly 80% in the third quarter. Turning to the non-US credit business, revenue grew 17% year-over-year and continued to perform well in the current market environment. Our muni business achieved record third quarter revenues, as the retail market sprung back to life and the institutional business, which grew more than 150% year-over-year, continues to attract new clients. We'll be leveraging our leading presence in the tax-exempt muni space to expand our institutional offering to include taxable Munis soon.\n\nOur recent rollout of our Ai-Price for Munis has gone well and we recently partnered with SIX Financial to redistribute our muni data. Another area of focus over the coming years is emerging market credit. Our current EM portfolio trading offering continues to scale, and we are methodically expanding our presence across all rates and credit products. We believe our position as a global multi-asset class firm gives us a unique one-stop shop proposition, being able to offer EM products across swaps, CDS, credit, and China bonds to our clients.\n\nThe continued volatility in the market boosted our CDS revenues which grew 45% year-over-year with strong growth across regions. Finally, we're excited about our collaboration with S&P Global Market Intelligence to introduce electronic connectivity between primary and secondary markets across European credit, covered, sovereign, supranational, and agency bonds. In sum, it was another solid quarter for credit, and we continue to see a lot of opportunity in credit as our institutional and wholesale platform continues to scale and the retail business continues to thrive. Moving on to swaps, the multi-year growth story continues as swaps registered another strong quarter aided by rebounding industry volumes and market share gains.\n\nOur variable swaps revenues grew 23% year-over-year, driven by strong growth across tenors and market share climbing to 15.2%. Since the beginning of 2019, the swaps industry has fluctuated from high growth to negative growth, high rates to zero rates, and now back to higher rates and fluctuating volatility. Over those 15 quarters, our swaps business has produced an average of 30% year-over-year revenue growth, a testament to the resiliency of our market-leading swaps business and the strong growth opportunity that we feel is underappreciated. Our momentum in major currencies continues with record year-to-date share in dollar, euro, pound, and EM-denominated swaps.\n\nWe believe the LIBOR transition is progressing well, 50% of our year-to-date volumes came from SOFR trades, up from 14% in the year-ago period with 95% of our dollar swap clients having executed a SOFR-based trade since the start of the year. Inflation and the upward pressure on commodity prices have shown little sign of abating. Central banks continue to raise interest rates to help counter rising inflation. However, such uncertainty means market participants have had to make longer-term decisions about how they hedge their exposure to inflation.\n\nSince executing our first cleared inflation swap transaction in 2017, Tradeweb has carved out a leading position in the electronic execution of inflation swaps, just another example of us helping our clients improve their execution experience. Year-to-date, inflation swaps volumes are up over 60% year-over-year. Beyond the risk-free rate transition and inflation swaps, we continue to respond to structural changes in the swaps market, making strong advances in cleared EM swaps and request for market protocol adoption. We saw record EM share in the first nine months of the year with revenue increasing by over 100% year-over-year.\n\nWe believe if we increase our market share by an incremental 10% of the cleared EM market, that could add up to an additional $15 million in variable revenues assuming current market average daily volumes. The long-term opportunity is even larger. Since 2017, Clarus EM IRS average daily volumes have increased at an average of 24% per year. Finally, we also saw record RFM activity as we continue to onboard dealers and deepen our liquidity pool globally.\n\nLooking ahead, we believe that the long-term swaps revenue growth potential is meaningful. With the market still only 30% electronified, we believe there remains a lot that we can do to help digitize our clients' manual workflows while the global fixed-income markets and broader swaps market grow. And with that, let me turn it over to Sara to discuss our financials in more detail.\n\nSara Furber -- Chief Financial Officer\n\nThanks, Billy, and good morning. As I go through the numbers, all comparisons will be to the prior year period, unless otherwise noted. Let me begin with an overview of our volumes on Slide 9. We reported record third quarter average daily volume of nearly $1.1 trillion, up 14% year-over-year, and up 12% when excluding short-tenor swaps.\n\nAmong the 22 product categories that we include in our monthly activity report, 10 of the 22 product areas produced year-over-year volume growth of more than 20%. Areas of strong growth include European government bonds, global swaps, U.S. investment grade credit, Munis, credit swaps, and global ETFs. Slide 10 provides a summary of our quarterly earnings performance.\n\nThe third quarter volume growth translated into gross revenues increasing by 13.1% on a constant currency basis, continuing our track record of double-digit revenue growth. FX headwinds of 490 basis points led to reported growth of 8.2%. We derived approximately 36% of our revenue from international customers and recall that approximately 30% of our revenue base is denominated in currencies other than dollars, predominantly in Euros. Our variable revenues increased by 14.8% and our total trading revenue increased by 8.6%.\n\nTotal fixed revenues related to our four major asset classes were down 5.1% but were flat on a constant currency basis. Rates fixed revenues were down given the migration of certain European government bond clients from fixed to variable contracts at the end of last year and the impact of FX. Money markets fixed revenue growth was driven by global repos. Other trading revenues were down 2%.\n\nAs a reminder, this line does fluctuate as it is affected by periodic revenues tied to technology enhancements performed for our retail clients. Market data increased by 3.4% due to growth in Refinitiv and our proprietary data products. This quarter's adjusted EBITDA margin of 51% increased by 86 basis points on a reported basis and 130 basis points on a constant currency basis relative to the third quarter of 2021. Similarly, our adjusted EBITDA margin for the first nine months of 2022 increased by 83 basis points on a reported basis, and 109 basis points on a constant currency basis from the full year 2021.\n\nWe remain committed and on track to deliver annual margin expansion in 2022 and there has been no change to our philosophy of balancing revenue growth with margin expansion. All in, we reported adjusted net income per diluted share of $0.45. On slide 11, we contextualize the impact of FX on our historical results. The key takeaway here is the extreme moves in FX this year are unprecedented and are masking the strength and consistency of our constant currency revenue growth.\n\nSpecifically, the third quarter FX headwinds of nearly 500 basis points were driven by a 14% decline in the Euro relative to the U.S. dollar, which is the highest decline we have seen year-to-date and remains in October. That said, when you compare our constant currency growth rates versus prior years, you can see the continued momentum across our business. This is a testament to the diversity of our business model across asset classes, protocols, geographies, and client channels.\n\nThis diversity allows us to uniquely navigate different macro environments while the secular story of electronification unfolds. As Billy highlighted, we are excited about the growth potential that lies in front of us and we believe we have multiple significant initiatives that will help us to continue to drive double-digit revenue growth over the long term. On top of our own initiatives, as yields increase across fixed income, we expect the interest from clients investing and trading in fixed-income products to continue to increase. Moving on to fees per million on Slide 12.\n\nThe trends I am about to describe are driven by a mix of the various products within our four asset classes. In sum, our blended fees per million increased 1% year-over-year, primarily as a result of stronger growth in higher fee-per-million rates derivatives and cash equities. Excluding lower fee per million short tenor swaps and futures, our blended fees per million were up 3%. Let's review the underlying trends by asset class, starting with rates Average fees per million for rates were up 4%.\n\nFor cash rates products, fees per million were up 14%, primarily due to a positive mix shift toward higher fee per million U.S. Treasuries and the migration of certain European government bond clients from fixed to variable contracts at the end of last year. For long-tenor swaps, fees per million were down 7%, primarily due to lower duration while we continue to see growth in EM swaps and RFM. In other rates derivatives, which includes rates futures and short tenor swaps, average fees per million increased 34% due to a shift toward rates futures, which carries a higher fee per million than the group average, and a core increase in OIS fee per million.\n\nContinuing to credit, despite the higher fee per million across cash credit, credit derivatives, and electronically processed U.S. cash credit, average fees per million for credit decreased 17% due to relative product mix with stronger volume growth in lower fee per million credit derivatives and electronically processed trades. Drilling down on cash credit, average fees per million increased 4% despite the continued U.S. high-grade fee pressures, due to stronger growth in U.S high-grade and Munis, which both carry a higher fee per million than overall cash credit.\n\nNotably, our fully electronic U.S. high-grade volumes were a record in the third quarter. Looking at the Credit Derivatives and electronically processed U.S. Cash Credit category, fees per million increased 3%, driven by stronger growth in European index CDS, which carries a higher fee per million than the group average.\n\nContinuing with equities, average fees per million for equities were up 23%. For cash equities, average fees per million increased by 20% due to an increase in fees per million within U.S. ETFs which was driven by a decrease in notional per share traded. Recall in the U.S.\n\nwe charge per share and not for notional value traded. Equity derivatives average fees per million increased 1% due to an increase in convertibles fees per million. Finally, within money markets fees per million increased 2%. This was primarily driven by a mix shift toward U.S.\n\nCDs, which offset a decrease in our U.S. repo fees per million. In addition, the higher fee per million retail money markets business continues to improve given the higher interest rate environment. Slide 13 details our expenses.\n\nAdjusted expenses for the third quarter increased 6.8% and 10.4% on a constant currency basis. Recall that approximately 15% of our expense base is denominated in currencies other than dollars, predominantly in Sterling. The third quarter of 2022 adjusted operating expenses were higher as compared to the third quarter of 2021 primarily due to increased employee compensation, technology and communication and G&A. Compensation costs increased 4.6% due to higher headcount.\n\nAdjusted non-comp expense increased 11.1% primarily due to technology and communications, G&A, D&A, and professional services but were helped by favorable movements in FX. Adjusted non-comp expense on a constant currency basis increased 16.1%. Specifically, technology and communication costs increased primarily due to higher clearing and data fees as a result of higher credit all trade volumes and streaming U.S. Treasury volumes which continue to grow.\n\nIn addition, this quarter also saw the continued impact of our previously communicated investments in data strategy and infrastructure. Adjusted general and administrative costs increased primarily due to an increase in travel and entertainment as we recover from the pandemic. Favorable movements in FX resulted in a $2.2 million gain in the third quarter of 2022 versus a $900,000 gain in the third quarter of 2021. Professional fees increased 6.4% mainly due to higher legal costs.\n\nSlide 14 details capital management and our guidance. First, on our cash position and capital return policy. We ended the third quarter in a strong position, holding $1.1 billion in cash and cash equivalents and free cash flow reached $555 million for the trailing twelve months. We have access to a $500 million revolver that remains undrawn as of quarter-end.\n\nCapex and capitalized software development for the quarter was $12.3 million, an increase of 23% year-over-year. We continue to expect capital expenditures and capitalized software to be in the range of $62 million to $68 million for the full year. With this quarter's earnings, the board declared a quarterly dividend of $0.08 per Class A and Class B share. We spent $11.3 million offsetting equity dilution during the quarter.\n\nSpecifically, we spent $9.0 million under our regular share buyback program, leaving $9.0 million for future deployment as of the end of the quarter. In addition, we withheld $2.3 million in shares to cover payroll tax obligations related to equity compensation. In October, we exhausted our $150 million share repurchase authorization, which expires at year-end. Given our historical philosophy of using share repurchases to offset the impact of our annual equity grants, we will be discussing with our Board renewing our buyback program, as well as other typical aspects and strategies within our capital management framework.\n\nTurning to other guidance items for 2022, we are now tightening our adjusted expenses to range from $620 million to $640 million, which incorporates the benefits from FX movements, mainly related to the Sterling. For forecasting purposes, we continue to use an assumed non-GAAP tax rate of 22% for the year. Finally, on slide 15, we have updated our quarterly share count sensitivity for the fourth quarter of 2022 to help you calibrate your models for fluctuations in our share price. Now I'll turn it back to Billy and Lee for concluding remarks.\n\nBilly Hult -- President\n\nThanks, Sara. Following the positive third quarter results, we believe we are on track for another great year at Tradeweb and for our 23rd consecutive year of record revenues. That level of consistent absolute revenue growth speaks to the resilience of our business model, and the team remains laser-focused on the things in our control, maximizing the power of our network to drive further innovation into the marketplace. While the ongoing FX environment act as headwinds to the core growth and earnings power of the business, we believe our competitive position has never been stronger, a testament to the impressive talent and network we have at Tradeweb.\n\nWith a couple of important month-end trading days left in October which tend to be our strongest revenue days, we are seeing double-digit volume growth across credit, equities, and money markets relative to October 2021. The diversity of our growth remains a theme as we continue to see double-digit average daily volume growth across U.S. high-grade credit, Munis, CDS, global ETFs, equity derivatives, repos, and retail certificates of deposit. We are seeing record average daily volumes in our muni business.\n\nOur IG share is in line with third quarter levels while high yield share is stronger than September levels.\n\nLee Olesky -- Chief Executive Officer\n\nI would like to conclude my remarks by thanking our clients for their business and partnership in the quarter and I want to thank my colleagues for their efforts that contributed to the record quarterly revenues and volumes at Tradeweb. As I sign off for my last earnings call, I want to also thank all the investors and sell-side analysts that I have had the great pleasure to meet over the last few years. With that, I will turn it back to Ashley for your questions.\n\nAshley Serrao -- Head of Treasury and Investor Relations\n\nThanks, Lee. As a reminder, please limit yourself to one question only. Feel free to hop back in the queue and ask additional questions at the end. Q&A will end at 10:30 am Eastern time.\n\nOperator, you can now take our first question.\n\nOperator\n\nThank you. [Operator instructions]. Our first question comes from the line of Richard Repetto from Piper Sandler. Your line is open.\n\nRich Repetto -- Piper Sandler -- Analyst\n\nYes, good morning, Lee -- and good morning, Lee, Billy, and Sara. First, Lee, I just want to congratulate you. You had a great run. You've been resilient and unflappable.\n\nI think I've used that word to describe you before. But well-deserved great run. My question is, what are you going to do now? Now my question is actually for Billy and you as well. But as you go through the transition, what will be your focus, Billy and what things you -- are you taken from Lee to -- as really the mantra to lead Tradeweb going forward?\n\nBilly Hult -- President\n\nIt's great question, Rich. Thank you for asking. Lee has obviously been great through this transition. I'm looking forward to working with him as chairman of the board.\n\nI would probably be a little bit more emotional and flowery in terms of what I was saying if like every analyst in the community plus all of these people weren't dialed in at this exact moment, so I'll leave that sentiment between Lee and I behind the closed doors. The groundwork has already obviously begun, and we're kind of hitting the ground running. We had -- and I referenced this in my prepared remarks, Rich, we had an excellent, excellent management offsite meeting at the end of the summer. When you have real engagement, you feel it and I think the team is, obviously, very charged up for the opportunities that lie ahead for the company.\n\nMy areas of focus, I think, obviously, you would understand exceptionally well. It's going to be talent development both myself and Lee have always kind of historically talked about the power and the importance of the people. So we're going to make sure that talent development stays first and foremost as a priority. Installing an executive leadership team, from my perspective, deepening our network with partnerships and acquisitions, these are major priorities.\n\nIt is, obviously, from my perspective, a great moment to have Tom Pluta on board. He'll be president of the company as of January 1. Both Lee and I have a long history and relationship with Tom. He's going to be an excellent addition to the management team.\n\nIt's always sort of awkward saying nice things about people while they are kind of looking across for me. Sara has been absolutely strong partner and an amazing CFO. So I feel personally really good about kind of where we are at this moment in time. To your great question about like what I'm going to kind of take from Lee, as much as I can.\n\nAt the end of the day, obviously, we're all kind of different people and different personalities. So I am going to be myself as the next CEO of the company in a way that I think will make Lee proud and the company proud and we're going to move on into this next chapter and succeed and do our best. But I appreciate your question, Rich. I think one thing for us to sort of determine is how I am going to still participate in your infamous kind of president's panel.\n\nMaybe Tom and I can kind of arm wrestle and figure out who is going to be the one that participates in that because I know that's like a big kind of historic ratings hit, but we appreciate your question always, Rich. So thank you.\n\nRich Repetto -- Piper Sandler -- Analyst\n\nI think you move up a slide, Billy, but anyway, Lee, great run, and congrats. Thank you.\n\nLee Olesky -- Chief Executive Officer\n\nThanks, Rich. I am just going to say something really quickly, and that is I think the company is in such good hands. I think the investors have a lot to look forward to. This is under Billy's leadership with Tom joining and Sara being here and the rest of the team, it's incredibly well positioned.\n\nAnd aside from the sort of opportunity of a company, the people who are in place are the same people who have been running this business for decades. Tom is new, Sara is relatively new, but I think we are so well positioned and I'm excited to watch them excel and grow the business and grow as leaders. Thanks for the kind remarks.\n\nRich Repetto -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Kyle Voigt from KBW. Your line is open.\n\nKyle Voigt -- Keefe, Bruyette and Woods -- Analyst\n\nHi, good morning. Maybe a question for Billy. There has been a sizable buy-side market participant in the U.S. treasury market that's been pretty vocal about wanting all-to-all solutions for the market.\n\nCan you just talk about the concept of all-to-all in U.S. treasuries? And how you see the market structure potentially changing over time from what is still a relatively bifurcated market structure today?\n\nBilly Hult -- President\n\nYes, sure. Great question, Kyle. How are you? So first thing you just ask like maybe like a quick, it's a good question, just like as a quick kind of point of kind of context to make a sort of strong point and kind of an important one. Obviously, the U.S.\n\ntreasury market is different than the credit market. It significantly start with, it's significantly more electronic. We have the estimates of the government bond market at around 60% versus kind of credit, which is around 45%. But I would say, more importantly, 80% of the activity in government bonds happens in like seven of the most actively traded issues versus credit, which you know well, Kyle, has, I think, like something like 13,000 CUSIPs, right? So there is a significant difference between those two businesses.\n\nThat being said, I think you've kind of nailed it in your question. First of all, the PIMCO kind of white paper that they wrote, I think, was like significantly important. PIMCO is a very influential, very important customer. It was a very thoughtful and very well-written white paper on some liquidity challenges in the government bond market.\n\nAnd so, we're going to be in a way that you would expect like exceptionally responsive. So I think we have a team literally at PIMCO kind of as we speak. We're going to engage with them directly, get their perspective on things. If we were going to kind of chart out some of our views on the evolution of it all, I think there is absolutely an aspect of all-to-all trading that makes sense in the sort of deeper areas of the off-the-run marketplace.\n\nWe can also kind of imagine a world, I think pretty easily where more and more of the buy side has access to what we describe as the central limit order book world, which is why it's been very important for us from a strategic perspective to be in that business. So we feel like we are kind of really well set up around this evolution and there is an interesting kind of back-and-forth debate on this, and I think, ultimately, at the end of the day, as we move forward around this, it's important to remember that there is not necessarily at all one trading protocol that fits one marketplace. So we do feel like there is a role potentially for all-to-all trading and government bonds, just like there's obviously always going to be a significant and sizable role around RFQ trading, request for market trading, disclosed stream trading. There are a bunch of very important protocols in the government bond market that will make this a continued vibrant and important marketplace.\n\nBut this is a topic that fits us like a glove and we're going to play a leadership role around it, I think, in a way that you would expect us to. So thanks very much for the question.\n\nKyle Voigt -- Keefe, Bruyette and Woods -- Analyst\n\nNo. Thank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from the line of Craig Siegenthaler from Bank of America. Your line is open.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nHey, good morning, everyone. And I don't know if you guys heard, but it's Craig Siegenthaler from Bank of America, it cut out on me.\n\nSara Furber -- Chief Financial Officer\n\nHi, Craig.\n\nBilly Hult -- President\n\nHey, Craig.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nSo my question is on portfolio trading. What were the major drivers of the sequential decline in international portfolio trading other than FX? And also, can you just put this in a context of the longer-term growth trajectory of portfolio trading adoption outside of the U.S.?\n\nBilly Hult -- President\n\nYes, I mean, I think we're fully trading is going to fit really well into that European community in credit. They tend to be very focused on I think, two of the most important kind of principles around portfolio trading, which is, from our perspective, information leakage and certainty of execution, and the feeling that we have is that it's going to become more and more of a risk transfer trading tool for those European customers. There is going to be kind of ebbs and flows on a month-to-month basis around some of these market share numbers. General feeling, obviously, is that portfolio trading works better and right now has more what we would describe as sort of straightforward acceptance in high grade than sort of the less liquid areas of the credit market, but this is a fundamentally important protocol in the credit markets globally.\n\nAnd we feel like the European community is generally very supportive of what we're building and where we're arriving with our portfolio trading. And thanks very much for the question.\n\nSara Furber -- Chief Financial Officer\n\nCraig, I'd just add that, obviously, as you alluded to, FX does play a role in terms of that comparison, whether you're looking at the year-over-year period, third quarter for third quarter, or nine months FX, particularly the Euro is down quite a bit.\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nThank you.\n\nOperator\n\nAnd one moment for our next question. Our next question comes from the line of Michael Cyprys from Morgan Stanley. Your line is open.\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nGreat. Thanks. Good morning. Hey, just curious your perspectives on the SEC's recent proposal for the central clearing of treasuries.\n\nWhat sort of potential impacts could we see in the marketplace? What sort of opportunity do you see in this for Tradeweb how you might sort of quantify that? And what sort of actions might you need to take to best capture the opportunity?\n\nBilly Hult -- President\n\nYes, a great question. It's interesting. I mentioned the PIMCO white paper, and I do think it resonated really strongly within the community. It's interesting.\n\nThey are not a proponent really of central clearing. So, I mentioned that because you do really get a sort of like interesting kind of debate back and forth around the benefits. Our general perspective is it's good for our business. In a straightforward way, it reduces our capital requirements and we have learned a bunch of lessons around how central clearing was applied to the global swaps market and how that accelerated the electronification of that market from really sort of a little bit of a negotiated back-alley market into this really strong electronified market that exists today.\n\nSo we are proponents of it. What we would say is, as the first question I got around government bonds was really about the liquidity of the market. We want to be exceptionally thoughtful that by embracing central clearing, we are not affecting the liquidity of the government bond markets where there can be a perspective that certain players who are important in the market today would find an expense level too high to be as active participants in a market going forward. So, we want to be thoughtful about how this winds up getting applied.\n\nWe are going to be kind of heard on this issue, I think, in a way that you would expect us to be heard. We have a lot of credibility, obviously, as the leading electronic venue in government bonds. So we're going to come out with our own, I think, strong view. But it's going to take into effect a lot of the nuances that I was kind of mentioning before.\n\nBut general feeling is like it's good for us and we're set up well for it. I think the debate on this will continue for a little while. And thanks for the question.\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nThank you.\n\nOperator\n\nOne moment for our next question. Our next question comes from the line of Andrew Bond from Rosenblatt Securities. Your line is open.\n\nAndrew Bond -- Rosenblatt Securities -- Analyst\n\nHey, good morning. Following up on that portfolio trading, September was a record month for portfolio trading at Tradeweb despite some concerns at higher levels of volatility to limit growth and more volume would shift to all-to-all protocols. Do you think portfolio trading continued to grow meaningfully if markets remain highly volatile or is there a limit to some of the growth in this environment?\n\nBilly Hult -- President\n\nNo, it's going to keep growing, right? It's getting more applied, for sure, into the IG world, into the investment-grade world than high yield, which still has, I think, some of the history and some of the behavior habits around the all-to-all kind of trading style. But I think the one thing that we have, I think, decided in a pretty strong way, is that the all-to-all environment is not necessarily the most conducive environment for real kind of risk transfer trades and so one of the things I think that makes us really strongly positive on the value of portfolio trading is the way that portfolio trading has from our perspective, become a real risk transfer mechanic or mechanism around that and that's important. So we feel like it behaves really well in volatile markets. Right now, it's kind of being applied more to IG than high yield.\n\nSome of that is behavior. As you know, the behavior change kind of takes time and I think some of the behavior around high yield still goes into that all-to-all environment, if that makes sense, and thanks for the question.\n\nAndrew Bond -- Rosenblatt Securities -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Alex Blostein from Goldman Sachs. Your line is open.\n\nAlex Blostein -- Goldman Sachs -- Analyst\n\nHey, good morning, guys. Thanks for taking the question. Billy, I wanted to spend a couple of minutes maybe on some of the competitive dynamics in credit trading and really just kind of maybe you zoning in on some of the convergence we are seeing between different protocols that you and MarketAxess are starting to zone in on. So on the one hand, you guys have been leading in portfolio trading.\n\nMarketAxess is now doing more portfolio trading as you guys are pushing more aggressively into RFQ with some of the innovation you mentioned as well as all-to-all. So, as these two kinds of Venn diagrams start to converge, what are your views on pricing? Is it reasonable to think we'll start to see more pricing pressure in the space or really more competitive dynamics on pricing, I guess? And then, just a reminder, how do you guys compare to the incumbent in the space in terms of apples-to-apples kind of comparison on pricing. Whether or not you guys will be able willing to kind of lean into that a little bit more?\n\nBilly Hult -- President\n\nIt's a great question, Alex, and thanks very much. I kind of have made this point before pretty strongly that as we have entered into the credit space and shown our ability to really compete in the credit space at a very high level, we've never kind of led with price. I think that's an important thing. We've led with innovations and creating efficiencies for our clients, and we feel at a very -- in a very strong way that the market is really supportive and wants kind of this competition in a way that you just described because they benefited from it.\n\nAnd I've always been, I think you know in a very straightforward way, like a complementary of MarketAxess from the perspective of having gotten a lot of things right. I think they were a little bit late around portfolio trading and have done a very good job recently of understanding how important that protocol is and doing better in it. One of the things for sure that we found is, as we delivered innovations to our customers, specifically speaking, around portfolio trading or around net spotting and net hedging, we are able to get more of their kind of traditional RFQ business as a consequence. So in the exact way that you described, I do think there is some convergence of where we are all competing.\n\nThat being said, again, high level and in a really important way, the market really does want to support and have this kind of competition in the space. As you know exceptionally well, we grew up competing in a lot of the markets that we are in, Alex, with Bloomberg from essentially day one. So that competitive dynamic has kind of existed for us always and I think it makes both firms better and I think the clients wind up winning as we continue to innovate. I don't know, Sara, if you have -- if you want to add any comment around kind of pricing?\n\nSara Furber -- Chief Financial Officer\n\nYes, I would say, look, we were a newer entrant into the credit space. I think generally, it's hard to be apples-to-apples, but generally apples-to-apples but I think our pricing is a little bit lower. But as Billy said, I think the more important point is we compete through innovation, and we compete differently. Our business mix in terms of different client channels is also a differentiator between retail, institutional and wholesale.\n\nBilly Hult -- President\n\nThanks for the question, Alex. Good to hear your voice.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Daniel Fannon from Jefferies. Your line is open.\n\nDan Fannon -- Jefferies -- Analyst\n\nThanks. Good morning. I had a question on high yields and just kind of the market share dynamics more recently. Is this -- can you describe it more to some of the volatility? Just trying to think about the longer-term trajectory of -- as you think about market share, is there something structurally different about this market and your ability to kind of grow share over time versus say, high grade and talk a little bit more specifically about some of the near-term dynamics?\n\nBilly Hult -- President\n\nI think it's a combination really of, sort of volatility in the market. It's a good question. I think it's a combination of sort of volatility in the market at a moment in time, plus the reality that high yield tends to be, ultimately, less liquid that tends to have strong behavior in that marketplace around all-to-all trading. And our network has come a long way from when we were first answering these questions from you guys, thoughtful questions from you guys back in March of 2020 around our high-yield responder network.\n\nBut at the end of the day, MarketAxess still has the sort of default liquidity in that high-yield network and as that market kind of stays all to all a little bit, they wind up winning. That being said, we had an excellent month so far in our market share around portfolio trading, specifically speaking, in high yield. So these things kind of have their own life form and can kind of turn pretty quickly. We are really strong on selling the benefits of portfolio trading to our clients around maintaining their relationship with the market makers, the benefits around cost, the benefits around information leakage, minimizing information leakage, and the benefit around executable trading on one level.\n\nSo we feel really good that that message continues to resonate. And at the end of the day, that's kind of what we care about. So I think we're well positioned there.\n\nOperator\n\nThank you. One moment for the next question. Our next question comes from the line of Gautam Sawant from Credit Suisse. Your line is open.\n\nGautam Sawant -- Credit Suisse -- Analyst\n\nHey, good morning, and thank you for taking my question. Can you please share your perspective on the impact that rise of fixed-income ETFs is having on industry market structure and fixed-income turnover velocity? And also, can you touch upon your future growth initiatives within the ETF marketplace and how the Tradeweb platform is positioned relative to competitors?\n\nBilly Hult -- President\n\nI mean, I think in the most straightforward way, right, we have an exceptionally strong ETF business both in the U.S. and Europe. So we have this great global ETF business that has had exceptional success throughout this year and specifically speaking over the last quarter. One of the things I think that's really important is that the traditional ETF market makers are playing a larger and larger role around market making in credit.\n\nWe do feel like that has given us a little bit of an advantage as we've continued to kind of march forward in our credit offering as the significant kind of ETF players also become stand-alone important market makers in credit. So that kind of helps kind of round out or kind of put the pieces of the puzzle together for us around ETFs and credit. Our perspective is, this ETF business is going to continue to grow. It's obviously benefited in a very strong way from the volatility in the equity markets and we have a really strong team globally around our ETF business.\n\nSo I feel really good about how we are positioned in ETFs and also feel really good about how that has given us an edge in terms of how we built out our credit business as well. And thank you -- thanks a lot for the question.\n\nOperator\n\nOne moment for our next question. Our next question comes from the line of Alex Kramm from UBS. Your line is open.\n\nAlex Kramm -- UBS -- Analyst\n\nYes. Hey, good morning, everyone. Not to be too overly focused on the monthly minutia, but when you gave your update for October, I know with a couple of days left, the one business that was noticeably absent, which is the biggest business is interest rate swaps. So just trying to get a feel what's happening there? I mean if you look at some of the data that we track intra-month, it looks like that business is actually down year-over-year.\n\nSome of this may be FX. But after seeing a nice trajectory during the third quarter, we are kind of hoping 4Q could kind of reaccelerate here. And just wondering if anything is weighing on this and what needs to change for that business to kind of accelerate to historical growth rates again. Thanks.\n\nBilly Hult -- President\n\nHey, Alex, it's Billy. You are allowed to get into the minutia in any way that you want. So we really appreciate the question. Like the European swap story for us has been like a significant, significant success, right? It's been really kind of the lead horse for us in our entire rates complex.\n\nTo your exact and specific question, it's taking -- the European swaps market is taking a little breather in these few weeks in October. So the volumes are down a little bit. I think it's been through, obviously, a significant amount of volatility and some of the players who have been actively involved throughout this year are taking a little bit of a half a step back. Big picture, we feel exceptionally strong about how we're positioned in that business.\n\nWe have built out really important protocols around request for market, which have landed squarely with our most important hedge fund clients in Europe. There is going to be a continued sort of onboardment of clients into the MiFID world in Europe and so we feel really strongly that we're positioned very well around our European swaps business going forward. So you are correctly identifying something, but I wouldn't read too much into it, Alex, but completely appreciate your question and your attention to detail. Thank you.\n\nOperator\n\nSir, will you be taking more questions at this time?\n\nAshley Serrao -- Head of Treasury and Investor Relations\n\nYes, we'll take two more.\n\nOperator\n\nOne moment for our next question. Our next question comes from the line of Ken Worthington from J.P. Morgan. Your line is open.\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nHi, thanks for squeezing me in. We talked a lot about innovation, and I think Lee kicked off with listen to your clients, build products, connect the dots. What happens to innovation at Tradeweb in more challenging or more extreme environments like we've seen in recent months and quarters? Do you get more actual ideas and more opportunities to execute? Is this really the time when innovation takes off or is it the opposite and things start to stall because you're too busy? And then you highlighted swaps and credit as the backbone for growth and EM and Munis is having a lot of opportunities, where does new innovation really need to be for you to deliver on these growth opportunities?\n\nBilly Hult -- President\n\nSo, good question, Ken. You -- in a very sort of reasonable way, in a way that you are describing, you have to be sort of aware of the environment. So I am going to say that in a very clear way. You have to have kind of good court awareness.\n\nSo when to make an obvious point, when the long bond is up a point or two points, you have to be a little bit careful around your 3:30 meeting that is scheduled, right? We thrive on this kind of sort of one-on-one meetings and the sort of like approach around the white paper and let's idea generate and let's solve things. So you have to be aware. To your question around the moment in time in the marketplace, and I think we're really good at that. We're really good at understanding what our clients are going through and what their lives, what their business lives are like.\n\nThat being said, in a really interesting way to your question, I think the stakes get really high around the innovations, right? So a tweak here or a tweak there around how portfolio trading works or a tweak around the response time around request for markets that I talked about around European swaps. These have like real market and real-life consequences at a point in time where the markets are extremely volatile and challenging. So I think the stakes get higher. I think our credibility of kind of having been that partner around innovation, I think, matters more when the markets get more challenging.\n\nOur pipeline is as strong as ever. The idea generation kind of continues. But you are right, you have to be kind of aware that there are moments where a Friday morning is free and then all of a sudden, it's not free. So you have to pick and choose your spots when you are dealing with and talking with high-level market professionals, the team is really good at that and really good at understanding that.\n\nSo that's how I would kind of understand -- that's how I would describe that point to you.\n\nSara Furber -- Chief Financial Officer\n\nAnd I'd just chime in, I think kind as a complement to that mindset which is, we have a really strong track record of continuing to make investments in all market conditions and so you mentioned EM and Munis. And I think it's not a need to invest in those initiatives. That's just our core philosophy on innovation and growth and so we've been able to do that. This year is a really good example.\n\nWe've been able to invest in these new areas, in our technology and our data and infrastructure while also delivering margin improvement. And so part of the beauty of the operating model is that strategy of constantly being close to your clients to innovate in the near term around acute volatility, in the long term around having fundamental growth drivers is something that we had a really good strong track record of.\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nBilly Hult -- President\n\nThanks for the question, Ken.\n\nOperator\n\nOne moment for our next question. Our next question comes from the line of Chris Allen from Citi. Your line is open.\n\nChris Allen -- Citi -- Analyst\n\nGood morning, everyone, and thanks for taking my question. Maybe just following up on Sara's comments around delivering margin improvement, can you maybe talk about your ability to manage expenses and provide some details on some of the puts and takes with FX, travel entertainment, inflation, and variable comp moving forward?\n\nSara Furber -- Chief Financial Officer\n\nSure. Thanks. It's a great question. I think at the highest level, I think a really helpful way to think about it is sort of a rule of thumb.\n\nAbout 50% of our overall expense base is either variable or discretionary. But the highest level we have a real amount of flexibility in terms of how we manage our expenses through various market conditions and be able to still deliver margin expansion. Obviously, we've talked about a very consistent philosophy of balancing that margin expansion with driving and investing in long-term revenue growth. You asked specifically, which is like a more near-term question around puts and takes and where we're managing inflation.\n\nI think this year is a really good sample set. Inflation for us really comes down to people costs. The vast majority of our expense base is people, and we feel like we've done a really effective job in managing those trends, while still investing in hiring and being able to compete really effectively for talent while still delivering on the margin and we expect to continue to do that. The last piece is FX, which is obviously not completely in our control as it was FX has been a headwind.\n\nThis quarter is somewhat unprecedented, and we put in the earnings, and I think it's at Page 11 to break it out a little bit in terms of how FX moves on the revenue line. On the expense line, roughly, the rule of thumb there is about 15% of that expense base is correlated to sterling. Sterling, if you looked at this quarter is down 14% versus the dollar. So that has a positive impact on the quarter.\n\nOverall, in that same time period, euro is much more of a correlation on revenues, that's a 30% correlation and that's also been a drag. And so net, net FX has diluted to our EBITDA margin. We do have a hedging strategy that dilutes that impact and that volatility quite a bit on the cash flow. But FX certainly has offset and sort of dampened the expense growth from a reported basis.\n\nBut overall, as we view with, I think, the comments that we've made, we like our flexibility. We like our ability to make consistent and continuous investments to overall make sure that we're making smart decisions that help support that double-digit revenue growth opportunity over the long term. It won't be linear, but I think that consistent philosophy has really served us well.\n\nOperator\n\nThank you. One moment for our last question. Our last question comes from the line of Brian Bedell from Deutsche Bank. Your line is open.\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nGreat. Thanks so much for squeezing me in. I appreciate it. A question for Billy.\n\nMaybe talk about the interest rate swap market. I mean, that and credit obviously, you've identified as the two biggest growth areas, but you did say the interest rate swap market for Tradeweb is an underappreciated growth story. So maybe just the credit business obviously gets all the hype given we can see your direct competitor there. Maybe talk about what you see between those two businesses as sort of the better, say five-year growth opportunity for Tradeweb in particular and why that would be the case for NIM?\n\nBilly Hult -- President\n\nYes. I mean it's an interesting story around interest rate swaps and it's a great question, right? The interest rate swap market historically was sort of the most resistant toward the electronification of markets of kind of any of the markets that we ever got into, and not to bring Lee down memory lane as the call is ending, but he remembers that the best. So, part of our success there came with a lot of hard work around behavior change. The other part of our success there came really around playing a leadership role around regulation as that market, obviously, went electronic around Dodd-Frank in the U.S.\n\nand then kind of MiFID in Europe. I would argue the combination of the dollar swap market and the European swap market are two of the most important markets in the world in terms of everything that's been happening in the rates complex over the past six months. We feel exceptionally good around how we're positioned kind of competitively in that space and we also feel exceptionally good around the kind of wallet that's historically been attached to that space. And we love the fact that our clients are getting more sophisticated using our products like AiEX more frequently and we kind of click I think, really, really well in that marketplace.\n\nObviously, considering we've had this leadership role in global government bonds, TBA mortgages for a long time. So it fits us like a glove and our general feeling is this marketplace is going to continue to be exceptionally important going forward and we are going to have that leadership role. And that's some of the kind of foundation about why we feel very confident there. And thanks a lot for the question, Brian.\n\nOperator\n\nNow I turn the call over to Lee Olesky for any closing remarks.\n\nLee Olesky -- Chief Executive Officer\n\nOK. Yes. Thank you. Let me just say quickly, I really wanted to thank all of the investors and analysts, anyone who's still on the line for all the support over the years.\n\nOur interactions have always been great. I am so proud really of the team. I think you can hear it in the remarks today. I feel like I am going out leaving you in the best possible hands with Billy and Sara and the rest of the team here and Tom, who's still is in the room.\n\nWe're going to let him talk maybe next time. And have a great day. Obviously, if you have any questions, don't hesitate to reach out to Ashley or anyone on the team, Sameer, and thanks a lot for joining. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAshley Serrao -- Head of Treasury and Investor Relations\n\nLee Olesky -- Chief Executive Officer\n\nBilly Hult -- President\n\nSara Furber -- Chief Financial Officer\n\nRich Repetto -- Piper Sandler -- Analyst\n\nKyle Voigt -- Keefe, Bruyette and Woods -- Analyst\n\nCraig Siegenthaler -- Bank of America Merrill Lynch -- Analyst\n\nMichael Cyprys -- Morgan Stanley -- Analyst\n\nAndrew Bond -- Rosenblatt Securities -- Analyst\n\nAlex Blostein -- Goldman Sachs -- Analyst\n\nDan Fannon -- Jefferies -- Analyst\n\nGautam Sawant -- Credit Suisse -- Analyst\n\nAlex Kramm -- UBS -- Analyst\n\nKen Worthington -- JPMorgan Chase and Company -- Analyst\n\nChris Allen -- Citi -- Analyst\n\nBrian Bedell -- Deutsche Bank -- Analyst\n\nMore TW analysis\n\nAll earnings call transcripts"
}