{
  "companyName": "Fastly",
  "companyTicker": "FSLY",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/fastly-fsly-q3-2022-earnings-call-transcript/",
  "content": "Fastly (FSLY 0.49%)\nQ3 2022 Earnings Call\nNov 02, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon. My name is Chris, and I'll be your conference operator today. At this time, I'd like to welcome everyone to the Fastly third quarter 2022 earnings conference call. [Operator instructions] I'd now like to turn the conference over to Vern Essi, investor relations at Fastly.\n\nPlease go ahead.\n\nVern Essi -- Investor Relations\n\nThank you, and welcome, everyone, to our third quarter 2022 earnings conference call. We have Fastly's CEO, Todd Nightingale; and CFO, Ron Kisling, with us today. The webcast of this call can be accessed through our website, fastly.com, and will be archived for one year. Also, a replay will be available by dialing (800) 770-2030 and referencing conference ID number 7543239, shortly after the conclusion of today's call.\n\nA copy of today's earnings press release, related financial tables and investor supplement, all of which are furnished in our 8-K filing today, can be found in the Investor Relations portion of Fastly's website. During this call, we will make forward-looking statements, including statements related to the expected performance of our business, future financial results, strategy, long-term growth and overall future prospects. These statements are subject to known and unknown risks, uncertainties and assumptions that could cause actual results to differ materially from those projected or implied during the call. For further information regarding risk factors for our business, please refer to our most recent quarterly 10-Q filed with the SEC and our third quarter 2022 earnings release and supplement for a discussion of the factors that could cause our results to differ.\n\nPlease refer in particular, to the sections entitled Risk Factors. We encourage you to read these documents. Also note that the forward-looking statements on this call are based on information available to us as of today's date. We undertake no obligation to update any forward-looking statements, except as required by law.\n\nAlso during this call, we will discuss certain non-GAAP financial measures. Unless otherwise noted, all numbers we discuss today other than revenue will be on an adjusted non-GAAP basis. Reconciliations to the most directly comparable GAAP financial measures are provided in the earnings release of supplement on our Investor Relations website. These non-GAAP measures are not intended to be a substitute for our GAAP results.\n\nBefore we begin our prepared comments, please note that we will be attending two conferences in the fourth quarter: the RBC Capital Markets Global TIMT Conference in New York on November 16; and the Credit Suisse 26th Annual Technology Conference in Arizona on November 29. With that, I'll turn the call over to Todd. Todd?\n\nTodd Nightingale -- Chief Executive Officer\n\nThanks, Vern, and hello, everyone, and thank you so much for joining us today. Let me start by thanking the Fastly team for such a cordial welcome and an amazing onboarding experience when I joined 60 days ago. The team here has been very supportive during my first two weeks in this role, and I want to thank Joshua for such a smooth handoff and the board for their support and guidance. I see tremendous opportunities ahead of us, and I'm excited to work with this incredible team.\n\nFirst, I will give a quick summary of our financial results and third quarter highlights and then provide a brief overview of my first impressions and near-term path forward at Fastly. I will then hand the call over to Ron to discuss the third quarter financial results and guidance in detail. We reported record third quarter revenue of $108.5 million, which grew 25% compared to last year and 6% quarter over quarter. I'd like to congratulate the Fastly team on this rate of growth, which takes pride in its achievement.\n\nHowever, I believe there still remains more customer opportunities out there to grow beyond the 22% year-to-date revenue growth we just posted as outlook. Our customer retention and growth engine remains strong. Our last 12-month NRR was 118% in the third quarter, up from 117% in Q2, and our DBNR was 122% in the third quarter, up from 120% in Q2. It's great to see such a passionate loyal customer base and the continued growth from these existing accounts.\n\nOur average enterprise customer spend was $759,000, representing a 4% quarter-over-quarter increase from Q2 and continue to demonstrate the success of Fastly's land-and-expand approach in strategic accounts. In the third quarter, we saw continued momentum in our portfolio expansion strategy with strong cross-selling activity in both Compute@Edge and Security. We saw Compute@Edge cross-selling wins at marquee accounts like New Relic and with Canada's leading content creation company. With Security, we saw cross-selling motion was one of the largest drugstore chains in Europe, which is now using our Next-Gen WAF on top of content delivery from Fastly and from a major Japanese video game company, who is now using Next-Gen WAF in addition to our content delivery and Compute@Edge capabilities.\n\nOur total customer count in the third quarter was 2,925, which increased by 31 customers compared to Q2. Enterprise customers totaled 482 in the quarter, an increase of 11 compared to Q2. I'm pleased to report that our third quarter gross margin of 53.6% improved 320 basis points quarter over quarter. Ron will talk in more detail about this in just a moment.\n\nOf course, this is an area we are focused on intently, and we've been able to remove duplicate site costs, improve our bandwidth costs, our network utilization and capacity planning. It's important to me to run an efficient, healthy business. And to that end, we will continue -- we will be continuing to focus on margin improvement in Q4 and through FY '23. It's also important to note, we've gone to great length to secure our supply chain to ensure that our platform expansion can continue uninterrupted, even in the presence of supply chain disruption to support existing Fastly customer growth and new logo acquisition.\n\nWe continue to expand Fastly's product offerings. In my first few weeks, I have been impressed with speed of innovation here. And in Q3, these releases include: service search, allow our customers to more easily access our technology; compliance routing, which is an alpha right now, helping customers with data sovereignty requirements, better manage how and where their data is processed; and web sockets and data giving our customers real-time, low latency solutions capable supporting the most responsive, engaging applications. We've also listed additional product releases in our investor supplement for your reference.\n\nMy first few weeks at Fastly, I talked to customers, partners, key stakeholders, and I have immersed myself in Fastly's culture and organization. This process yielded in an enormous amount of feedback in the form of praise and constructive suggestions. I'm grateful for everyone's thoughtfulness into the teams who facilitated all of those discussions. Fastly has an amazing culture and a talented employee base.\n\nThe team here is passionate about every customer, passionate about the technology we build, and most importantly passionate about our mission to make the Internet a better place where all experiences are fast, engaging and safe. There is tremendous opportunity in Fastly as a complete application experience platform to deliver cutting-edge digital experiences for everyone, everywhere. The more Fastly becomes a one-stop shop for the edge cloud, for content delivery, for network services, security and edge compute with observability, the more it will drive a more complete experience for our users. And for our customers to drive a differentiated experience for their developers, for their operations teams, and I believe in staying true to that vision and by focusing on our users, our developers and our customers, we can have an incredible impact on the industry.\n\nWe have a real opportunity to run a high-velocity, low-friction motion at Fastly. And I will be focused on: number one, simplifying our product packaging. This will enable our customers to understand purchase our technology more effectively, and our team can operate with less friction. Number two, we're also focused on more deeply embedding the Signal Sciences offerings into the Fastly platform and continuing to expand our Security offerings.\n\nNumber three, our Compute@Edge launch from last year has had great early success in part two to our developer relations investment and Glitch acquisition. I plan to continue to invest here as our customers demand even more dynamic capabilities at the edge. Four, I plan to align our go-to-market, service our customer success teams to focus more deeply on the customers they serve. And five, our goal is to make certain that our investments are in line with these priorities while implementing cost controls and to ensure that every dollar at Fastly is being used to fuel growth.\n\nAnd with regards to investments, I am acutely aware of our high operating expense levels, and I take this very seriously. We will focus on investing in our go-to-market and on our innovation engine to fuel growth while driving efficiency in everything we do. You will hear more about our long-term growth and spending forecast next quarter, but let me leave you with the understanding that I am very committed to meaningfully reducing our operating losses in '23. Let me close by saying that I'm very excited about the opportunity at Fastly.\n\nOur customers have a real passion for Fastly's solutions. And our employees have a real enthusiasm for Fastly's mission. Of course, we have plenty of work ahead of us, but I believe we can have significant impact on the way digital experiences are built and delivered around the world. I look forward to sharing more review regarding our progress, our focus on fueling growth, our customer acquisition and our velocity of innovation in the coming quarters.\n\nAnd now to discuss the financial details of the quarter and guidance, I will turn the call over to Ron. Ron?\n\nRon Kisling -- Chief Financial Officer\n\nThank you, Todd, and thanks, everyone, for joining us today. I will discuss our business metrics and financial results and then review our forward guidance. Note unless otherwise stated, all financial results in my discussion are non-GAAP-based metrics. Total revenue for the third quarter increased 25% year over year to $108.5 million, exceeding the top end of our guidance of $102 million to $105 million.\n\nIn the third quarter, revenue from Signal Sciences products was 13% of revenue, a 44% year-over-year increase or a 33% increase after purchase price adjustments related to deferred revenue are reflected. While we are not immune to the macroeconomic trends, we are seeing healthy traffic expansion from our enterprise customers, and given our relatively smaller market share, we are benefiting from share gains in an otherwise challenging environment and believe these dynamics position us for continued revenue growth. Our trailing 12-month net retention rate was 118%, up slightly from 117% in the prior quarter. We continue to experience very low churn of less than 1%, and our customer retention dynamics remain strong.\n\nAs Todd stated, we had 2,925 customers at the end of Q3, of which 482 were classified as enterprise. Those customers with an excess of $100,000 of revenue over the trailing 12 months. Enterprise customers accounted for 89% of total revenue on a trailing 12-month basis, up slightly from their 88% contribution in Q2. However, the key highlight here is that our enterprise customer average spend grew to $759,000 from $730,000 in the previous quarter, representing 4% expansion in dollars spent and further demonstrating our continued ability to expand our business within our largest customers and our strong customer retention.\n\nOur strong trailing 12-month net retention rate and growth in average enterprise customer spend demonstrate our continued ability to expand within our enterprise customers due to our increased share of delivery traffic and adoption of new products in Security and in our emerging compute business. Our top 10 customers comprised 36% of our total revenues in the third quarter of 2022, slightly above the 34% contribution in the prior quarter. As I last spoke to our Q2 results, we made a great deal of progress within our financial organization with efforts to align closely with Todd's new leadership. We completed the transformation of our finance leadership team and continue to enhance our cross-cultural efforts to streamline and improve our business visibility, including forecasting and review process to better align capital investments with traffic expectations, and improved management of our balance sheet and capital structure.\n\nAs I stated last quarter, these efforts not only strengthen Fastly's financial position longer term and allow us to drive increased efficiency in our business, but also improve Fastly's competitive positioning and its transparency to the investor community. I will now turn to the rest of our financial results for the third quarter. Our gross margin was 53.6% for the third quarter, compared to 50.4% in the second quarter of 2022. Recall that excluding one-time true-up costs, the gross margin for the second quarter would have been approximately 52%.\n\nThis sequential improvement in gross margin reflects our prior expectations that it would lift in the second half of 2022. As we previously discussed, this is due to the discontinuance of site implication expenses in the first half of 2022, improvements in our network investment capacity planning to more closely match our traffic patterns and demand and a focus on reducing the cost of components of our cost of revenue, including in the third quarter, a reduction in our bandwidth cost. As a result, we expect gross margin improvement of roughly 200 basis points in the fourth quarter relative to the third quarter. We do not see any meaningful changes, positive or negative to our pricing in the third quarter as compared to the prior quarter.\n\nI appreciate your patience through this phase of our gross margin volatility. As Todd stated, we will continue to be focused on gross margin improvement and efficiency through 2023 as our planned investment in our next-generation network architecture, ongoing management of network investments in line with respected traffic, continued improvement in efficiency and traffic handling and management of our cost positions us for further gross margin improvements in the medium to long term. Operating expenses were $78 million in the third quarter, up 24% over Q3 2021 and down 1% sequentially from the second quarter. This was higher than we had previously forecasted, but was offset by higher-than-anticipated revenue, resulting in an operating loss of $19.8 million, near the midpoint of our operating loss guidance range of $18.5 million to $21.5 million.\n\nDuring the third quarter, we accelerated our sales and marketing investments to position us for strong revenue growth in 2023. Additionally, despite our more disciplined hiring in the third quarter, our headcount costs were higher than we had previously forecast, as we saw a decrease in our employee attrition rate during the quarter. As Todd indicated, we are investing in our go-to-market efforts as part of our revenue growth initiatives. As these initiatives are put into motion, we anticipate fourth quarter sales and marketing expenses will increase sequentially, while R&D and G&A expenses will remain relatively flat.\n\nAnd despite our increasing investment in our go-to-market efforts, there are meaningful opportunities to drive greater efficiencies in our operations, especially across G&A that give us confidence in meaningfully reducing our operating losses in 2023 and beyond. Our net loss in the third quarter was $16.8 million or $0.14 loss per basic and diluted share, compared to a net loss of $13.2 million and an $0.11 loss per basic and diluted share in Q3 2021. Turning to the balance sheet. We ended the quarter with approximately $719 million in cash, cash equivalents, marketable securities and investments including those classified as long term.\n\nOur free cash flow of negative $44 million was down sequentially from the second quarter's negative $61 million, primarily due to a $27 million reduction in advanced payments of capital equipment and changes in operating cash flows. Third quarter free cash flow reflects the advanced payments of capital equipment of $2 million, capital expenditures of $15 million, which include cash purchases of capital equipment, capitalized internal use software and payments on financial leases during the quarter. Our cash capital expenditures were approximately 8% of revenue in the third quarter. Our cash and capital expenditures include capitalized internally used software and deployment of prepaid capital equivalent.\n\nWe continue to expect our cash capital expenditures for calendar year 2022 to be in the range of 10% to 12% of revenue. I will now turn to discuss our outlook for the fourth quarter and the full year 2022. I'd like to remind everybody again that the following statements are based on current expectations as of today and include forward-looking statements. Actual results may differ materially, and we undertake no obligation to update these forward-looking statements in the future, except as required by law.\n\nOur fourth quarter and full year 2022 outlook reflects our continued ability to deliver strong top line growth via improved customer acquisition and expansion within our enterprise customers, driven in part by new and enhanced products. Our revenue guidance is based on the visibility we have today. Historically, our fourth quarter sees strong growth relative to the third quarter, and we see a similar trajectory in 2022. I'd also like to note that given the nature of network traffic drivers in the fourth quarter, revenue is subject to volatility due to a variety of items, including holiday shopping patterns and live sports streaming viewership.\n\nAs a result, for the fourth quarter, we expect revenue in the range of $112 million to $116 million, representing a 17% annual growth at the midpoint. We expect the non-GAAP operating loss of $18 million to $14 million and a non-GAAP loss per share of $0.15 to $0.11. For the calendar year 2022, we are increasing our prior revenue guidance by $7 million to a range of $425 million to $429 million, representing 21% annual growth at the midpoint. We expect a non-GAAP operating loss of $82 million to $78 million and a non-GAAP loss per share of $0.67 to $0.63, reflecting the impact from increased revenue outlook.\n\nAnd as I discussed above, we now anticipate operating expenses will increase in Q4 relative to the third quarter, and our second half operating expenses will be higher than the first half due to our investments in sales and marketing. Before we open the line for questions, we would like to thank you for your interest and your support in Fastly. Operator?\n\nOperator\n\nThank you. [Operator instructions] Our first question is from James Fish with Piper Sandler. Your line is open.\n\nJames Fish -- Piper Sandler -- Analyst\n\nHey, guys. Nice bounce back on the top line there. And Todd, welcome to Fastly, looking forward to working with you again. I wanted to start on the sales cycles that you're seeing, particularly for new prospective customers.\n\nAnd obviously, you have some sales and marketing spending going on, but what are you guys seeing with sales cycles on those new prospective customers versus the willingness to consolidate more traffic and security functionality with your existing installed base?\n\nTodd Nightingale -- Chief Executive Officer\n\nThat's a great question and great to see you again, too. Appreciate you being here. I think that the -- as far as the length of the sales cycle go, we haven't seen any very significant change in the last couple of quarters. But we have seen some very relatively quick sales cycles and some large strategic deals, especially when we're talking about expansion deals, customers that might be in our content deliveries, out of the house and are moving to security, are moving to expand to edge compute.\n\nAnd so those cycles have definitely -- are definitely far shorter than the initial logo acquisition. And that's been helping us quite a bit as we see expansion in those areas. As far as new customer logo sales cycle changes, haven't seen any yet, but I think it's a good thing for us to look out for.\n\nJames Fish -- Piper Sandler -- Analyst\n\nAnd then just a follow-up on gross margins. A couple of things. Obviously, some of the colocation companies out there raising prices just given energy cost increases, particularly in the EMEA region. I guess, how is that impacting your gross margin for the next year or so? Or what are you guys seeing on that end? And at what point should we be through kind of the duplicative sites headwinds that you guys are, I'll say, self-creating?\n\nTodd Nightingale -- Chief Executive Officer\n\nYeah. We've seen some of the changes on the power side, especially in Europe. So we're seeing what you're seeing. But we have very close relationships with those providers, and I think we're going to be able to manage that.\n\nAs our scale continues to increase, our ability to find good pricing comes along with. And so we've actually done a good job bringing down our bandwidth costs. And I think that trajectory will continue. Specifically, not just for bandwidth, but when we look across all of the cost of revenue, we're pretty -- we're leaning in pretty hard right now, and really driving our margins up.\n\nWe saw great results this quarter. I believe that there's a real opportunity to continue that trajectory. And I think that is sort of core to our success as well. And so you're going to continue to see a ton of focus in this area.\n\nWe have opportunity with peering. We have opportunity with a higher utilization of our infrastructure, higher utilization of our network to drive our margins up even if we do find a little bit of incremental cost around energy usage. Anything you'd add there, Ron?\n\nRon Kisling -- Chief Financial Officer\n\nThe only thing I'd add, and I think to Todd's point, we're seeing good improvement constantly around bandwidth, managing our capex, helping on depreciation. And bandwidth and depreciation are kind of the biggest drivers of our cost of revenue with colo being a little bit smaller. So that tends to help against some of the increases we're seeing from the colocation providers.\n\nJames Fish -- Piper Sandler -- Analyst\n\nThanks, Todd. Thanks, Ron.\n\nOperator\n\nThe next question is from Frank Louthan with Raymond James. Your line is open.\n\nFrank Louthan -- Raymond James -- Analyst\n\nSorry about that. I think the telecom guy could work the mute button. But hey, Todd, good to reach -- thanks for being on there. Talk to us a little bit -- give us a little bit more details about the tech upgrade and the gross margin here.\n\nCan you just remind us the 200 basis points of pressure, was that the GAAP or non-GAAP? And any chance that bleeds into next year? And then walk us through what you've seen on pricing, good revenue trends, how is pricing going in the market currently?\n\nRon Kisling -- Chief Financial Officer\n\nYeah. So I'll start on the 200 basis points in pricing. I think the 200 basis points that we saw in Q2 was sort of one-time event. The duplication associated with our architecture migration was largely completed in the first half as we planned.\n\nSo that's really driving some of the Q3 improvements. And then I think as you look to Q4, you get a little benefit from the revenue accretion you see in Q4, as well as, as we indicated, we saw some improvements in our bandwidth pricing that we'll actually see that benefit for the full quarter in Q4. So that's why what's really the drivers behind the couple of hundred basis point improvement we'll see going into Q4. And then I think on pricing, we really haven't seen any meaningful changes in the quarter, positive or negative compared to the prior quarter.\n\nTodd Nightingale -- Chief Executive Officer\n\nI think as we look forward, there's real opportunity for us to sort of continue this trajectory of margin improvement. And we are deeply focused on this. One is just around really diligent capacity planning. We've seen some stabilization in the supply chain, maybe not complete, but enough.\n\nAnd we are focusing deeply on doing very rigorous capacity planning so that we are deploying our equipment as efficiently as we possibly can. And that goes beyond just how much we deploy, but where we deploy it. We're deploying our equipment into the right regions as we predict load. The second is network efficiency.\n\nWe have a real opportunity as Fastly scales to push more of our bandwidth costs to peering links which are radically less expensive for us and that gives us an opportunity to find serious efficiency and as Fastly continues to scale that that opportunity continues to be available to us. And last is really the efficiency of the system. One of the first things that I did when I sort of arrived at Fastly is to work closely with our infra team to understand all the work that's going on just to build the most efficient infrastructure possible capable of really maintaining a trajectory of margin improvement for the next few quarters. And that's what we plan to do.\n\nThat's our focus right now.\n\nFrank Louthan -- Raymond James -- Analyst\n\nWhere -- how high of a priority is it to get to EBITDA positive? And what time frame do you think you can do that?\n\nTodd Nightingale -- Chief Executive Officer\n\nI'll tell you that I believe we have a real opportunity to post a far more profitable or far better operating losses next year than this year. And it's something that is incredibly top of mind for me and our whole leadership team. In fact, the discussion of deploying every single dollar spent to Fastly's to fuel growth, be radically more efficient with our spend, more judicious and even scrappy with that spend is incredibly top of mind for us because it's not lost on me that we have to improve profitability here and specifically our cash burn. As far as the exact timing of going see that turnaround, we're going to try to give you as much information as we can in our next call when we'll be discussing the entire FY '23 plan and guidance.\n\nAnd I think that would be the right time for us to give you a further outlook there.\n\nFrank Louthan -- Raymond James -- Analyst\n\nAll right. Great. Thank you very much.\n\nTodd Nightingale -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThe next question is from James Breen with William Blair. Your line is open.\n\nJim Breen -- William Blair -- Analyst\n\nThanks for taking the question. just on the capacity side, where are you right now given the growth that you're seeing? Do you think there's staying in that capex range is reasonable given some of the new products and some of the growth seeing within your existing customer base? And then the gross margins have improved, how much of that is just from increased revenue on a fixed cost basis in terms of where the network is? And going forward, you continue to expect -- I guess, what do you think the gross margin potential is as you sort of reach scale? Thanks.\n\nTodd Nightingale -- Chief Executive Officer\n\nYeah. So on the capacity side, I think earlier this year, we kind of brought down our expected capex from 12% to 14% to 10% to 12% of revenue. I think there's opportunities as we get into next year to continue to see opportunities to improve around the capex side. As we use capex, a, more efficiently and continue to make sure we're aligning with traffic expectations.\n\nDespite what we see is really good growth and expansion within our existing customers.\n\nRon Kisling -- Chief Financial Officer\n\nAnd I think -- look, as far as the -- especially the capital expense goes, supply chain stabilization is going to help us control capex and specifically the demand planning improvements. And I think that's really key -- or getting -- we have been getting a better handle on being able to predict demand, and that's going to help us be more efficient in how we deploy capital, and that's going to be key to this. Again, look, I believe that the trajectory here that we're on is something that is incredibly important. We are deeply focused on this demand planning, efficiency of our -- of every single cost of revenue dollar, much on the capex side, but the entire cost of revenue line.\n\nBeing more efficient with our bandwidth is going to be incredibly important to us. And I don't want to lose track of that. Capex appreciation is a big deal, but the bandwidth cost is enormous. And so efforts around more efficient use of that bandwidth, better peak management, better peering utilization is going to be driving us, and we're going to be really building that muscle more and more over the next few quarters.\n\nWe're going to continue this trajectory. I don't want to speak to how high I think it can go. In this earnings call might just be a little for me, I'm still unpacking the business. But we will get into it more deeply as we give FY '23 guidance on the next call.\n\nJim Breen -- William Blair -- Analyst\n\nAnd just as a follow-up, DBNR was 122% or so, just below where your total growth rate is on the revenue side. What's the opportunity outside of your existing customer base? And think about that from a go-to-market perspective? Thanks.\n\nTodd Nightingale -- Chief Executive Officer\n\nYeah. That's great. I mean, of course, we look at the existing customer base with organic growth in the technology we're already delivering and portfolio growth, especially with the early success we're seeing on Compute@Edge and with Security and Signal Science acquisition. But as far as new logo acquisition goes, we've seen some real -- we've seen some real progress in the high-tech space, and we're looking at additional verticals where we can really make a concerted fast and wide go-to-market surge in terms of driving new enterprise logos in new verticals.\n\nAnd I think with the product packaging improvements that we mentioned, we actually have an opportunity to reach some of the mid-market, especially the high end of the mid-market with a simpler motion, a lower friction motion to onboard new accounts. And so as we start to get our packaging in order, I think we're going to be able to see some improvement in how well we penetrate, not just large enterprise accounts, but at the high end of the mid-market as well.\n\nJim Breen -- William Blair -- Analyst\n\nGreat. Thanks.\n\nTodd Nightingale -- Chief Executive Officer\n\nThanks.\n\nOperator\n\nThe next question is from Sanjit Singh with Morgan Stanley. Your line is open.\n\nMatt Wilson -- Morgan Stanley -- Analyst\n\nHi, it's Matt Wilson on for Sanjit. Thanks for taking our question. Maybe just back to that last one. Can you talk about the opportunity in mid-market through the better packaging? How large is this opportunity? When can it kind of start to show up in financials?\n\nTodd Nightingale -- Chief Executive Officer\n\nSure. Look, I think the better packaging really, it's not just a benefit in the mid-market. It gives us opportunity to lower the friction, really increase the velocity of our sales motion, the way we do our billing and invoicing, the way customers and how easy it is for customers to really understand what they bought and use as much of that as possible, really becoming platform users. And so I think from a packaging point of view, we have the opportunity impact, our kind of core existing enterprise motion for sure.\n\nI will say, though, as far as mid-market goes, it's absolutely a requirement that we have. Simpler packaging that can be bought holistically so that you can deploy our content delivery technology with a single SKU, and that SKU can be transacted quickly and easily. And also -- and this is, I think, really maybe the most important part of that packaging when it comes to mid-market, it unlocks the opportunity for us to bring content delivery through our channel. And we've had some early success in the security side of our business, bring that to the channel, especially from what Fastly's learned from the SigSci acquisition and by building real simple, straightforward packaging for content delivery with the opportunity to bring that to the channel as well.\n\nI'm pretty excited about that. As far as sizing it, I think that's a good question, but something we'll probably have to take to the next call as well.\n\nMatt Wilson -- Morgan Stanley -- Analyst\n\nAll right. Great. Thank you.\n\nTodd Nightingale -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question is from Will Power with Baird. Your line is open.\n\nWill Power -- Baird -- Analyst\n\nGreat. Thank you. Yeah, no, I appreciate all the color on -- focus on improving the cost structure. I guess, Todd, one of the questions might be as you think about the cost reduction opportunities and improving cash flow, how do you balance that against also trying to improve revenue growth? It sounds like you have some initiatives there.\n\nSo I guess what's kind of the confidence level and prioritization there between those two areas?\n\nTodd Nightingale -- Chief Executive Officer\n\nYeah. I think that is -- that's an amazing question because it's incredibly top of mind for Ron, myself, our entire senior staff right now is ensuring that every dollar we spend is fueling growth and ensuring that as we get a lot more serious about controlling expenses that we're doing in the most judicious way. We don't want to throw the baby out with the bathwater. And maybe the parallel to be drawn here.\n\nWe've worked hard at removing duplicative expenses in our infrastructure, in our cost of revenue. And we have some of that same thing in the -- on the opex line. So we're pushing really hard to ensure that we're that were first and foremost taking an opportunity to cut expenses everywhere, there's low-hanging fruit where it won't be a trade-off between growth and opex. And I think at that point, we will then have the opportunity to really figure out how much we want to balance our kind of spend and growth line.\n\nBut there's a huge amount of opportunity here for us to sort of get our house in order and make sure that every single dollar is being used as efficiently as possible, that we're stepping away from vendors and contracts that aren't really driving and fueling growth. And so I think realistically, look, there's an opportunity here for us to do better without having to make the trade-offs between spend and growth. That's what we're really focused on right now. I've been here about 60 days, so we're still unpacking all the details, I want to make sure I make these decisions as carefully as I possibly can.\n\nBut the opportunity is there, and we're going to get that done as fast as we possibly can and really try to set ourselves up for a much better profitability number for next year, and be careful and very judicious about doing that without sacrificing growth number. But I think we'll be in a really good place to discuss that in detail in the next earnings call.\n\nWill Power -- Baird -- Analyst\n\nOK. Great. Now I appreciate that color and good luck with those initiatives. Maybe if I can just have a quick follow-up for Ron here.\n\nUpside to revenue in the quarter, guidance a bit higher. Is there anything in particular as you look across product lines, whether Signal Sciences or something in media that's providing upside, maybe relative to where prior expectations might have been? And then I guess tied to that, any additional color on any macro headwinds you might be seeing either longer sales cycles, anything else to call out?\n\nRon Kisling -- Chief Financial Officer\n\nYeah. I mean I think on the first part of the question, I come back to what Todd said in terms of seeing fairly short sales cycles in terms of customers quickly adopting either additional delivery or even more importantly, additional products around security or compute where we're starting to actually see some traction in those areas. And so I think that expansion is one area that we saw in the quarter driving some of the sort of increased growth, particularly around the timing trajectory of when customers sort of took on that additional business. I think in terms of the macro headwind, I think to date, I sort of come back to what's been driving the business thus far is expansion with our existing customers where we've actually seen maybe even less friction and expanding on existing customers.\n\nAnd again, given our relative market share, market share gains have sort of helped us against any sort of macro headwinds that we see. I mean, ultimately, I think the service that we do is pretty key to customers. And if you look at kind of the dynamics of whether it's M&E or shopping, I think you see opportunities for that traffic to continue to grow.\n\nWill Power -- Baird -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThe next question is from Fatima Boolani with Citigroup. Your line is open.\n\nUnknown speaker -- Citi -- Analyst\n\nHey guys, this is Mark on for Fatima. Thanks for taking our question. Todd, congrats on the first few months in the role, and it's great to see top line raises on 2022. But just on the operating margin points coming down a point, on the sales and marketing investments, is there any specific areas there that's really driving the lion's share of the investments or just a function of the opportunity ahead that you could call out? And then maybe can we get a sense of how much incremental investments may be needed just going beyond 2022, just given your initiatives? Thanks.\n\nTodd Nightingale -- Chief Executive Officer\n\nSure. Yeah, I can speak to that. Look, on the sales marketing side, we've tried to focus any incremental investment on carriers. And that's been sort of a religion here is focusing on covering as much -- as many accounts as possible with the strongest possible teams.\n\nAnd so really quota carriers and the account executive in SE role, that's where we focus any incremental spend. As far as looking at the projections beyond FY '22, I think it will be a little bit early for me to make the call on it. And I recognize that this is a question that keeps coming up. We are deeply like concerned about it, especially the operating loss side of the house, and it's absolutely the area where my whole team right now is engaged in our planning for next year.\n\nAnd I do want to be just as judicious as I possibly can to put that strategic plan and budget plan together before we talk about it publicly.\n\nUnknown speaker -- Citi -- Analyst\n\nGot it. Thanks so much. Maybe just a follow-up on that. Just going to 2023, there's probably meaningful -- opportunities to reduce operating losses.\n\nAny areas of low-hanging-fruit outside of the gross margin levels that maybe you didn't expect? Thanks.\n\nTodd Nightingale -- Chief Executive Officer\n\nI'm sorry, low-hanging fruit in regards of --\n\nUnknown speaker -- Citi -- Analyst\n\nJust on the operating -- I guess operating expense structure outside of the gross margin side.\n\nTodd Nightingale -- Chief Executive Officer\n\nI think that there is actually some low-hanging fruit and duplicative systems to be asked. And we've seen this in a couple of areas. Of course, we saw in the cost of revenue that's going to help us drive up the margin side of the house. We see it on the opex side, too.\n\nWe have an opportunity to clean that up and drive some real savings there. I think there's also an opportunity for us to find efficiencies in our systems and how quickly our teams can operate with less outside contract or support. Simplifying our motion, moving our sales -- our default sales motion over to a package system is going to help us run a simpler motion, a leaner motion with fewer resources needed. And I think that's -- it's going to be important in driving our profitability for next year.\n\nIt's also going to be important as we look to scale over the next three to five years.\n\nUnknown speaker -- Citi -- Analyst\n\nGreat. Thank you very much.\n\nTodd Nightingale -- Chief Executive Officer\n\nThanks.\n\nOperator\n\n[Operator instructions] The next question is from Justin Rhee with Craig-Hallum. Your line is open.\n\nUnknown speaker -- Citi -- Analyst\n\nHey, this is Daniel on for Jeff. Just a quick question for me. You mentioned quota carriers. Can you just refresh us on where the sales heads are at right now in terms of count? And just update us on what you're thinking in terms of count moving forward?\n\nTodd Nightingale -- Chief Executive Officer\n\nThat's a great question. I don't have the numbers right in front of me, and I don't want to quote you something wrong either. We'll have to get back to you with the exact numbers. I don't want to give you a number that's close.\n\nUnknown speaker -- Citi -- Analyst\n\nYeah, yeah. All right. Well, just a second question there for you, Todd. A lot of conversation on the call about margins understandably so.\n\nBut just kind of wondering as you're entering or you're looking at the opportunities facing the company, what other areas are a focus of emphasis for you as you're looking at potential changes and things you're interested in that you're stepping in?\n\nTodd Nightingale -- Chief Executive Officer\n\nYeah. Look, I think the cost control is an opportunity, for sure, top of mind for us. Improving the margins, I think it's a huge opportunity we have, the ability to deploy technology and resourcing to improve the margins, which is great, too. But I think as far as the opportunity goes, it really is around driving growth for us.\n\nWe have the opportunity to drive organic growth, both within the technology or employee and portfolio expansion. We have local acquisition along a line of expanding from one vertical to the next, but also driving beyond the enterprise account set. And we've got a real, I think, a real opportunity to look at driving growth in a very significant way, even beyond those dimensions, geographic expansion as well. And so for us, trying to balance, like there's a huge opportunity in managing these different dimensions of growth and trying to really focus ourselves on the areas and the opportunities for growth where we have the best investment leverage.\n\nUnknown speaker -- Citi -- Analyst\n\nThanks for taking my question.\n\nTodd Nightingale -- Chief Executive Officer\n\nGreat.\n\nOperator\n\nThe next is from Tom Blakey with KeyBanc Capital Markets. Your line is open.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nHey, guys. Thanks for taking my questions. Some interesting comments about expanding on existing customers. I was wondering if you could maybe qualify some of those statements in terms of penetration rates? Any of the customers generally or anyone specific? And then those opportunities there, is there room for -- some of the room for expansion from taking share from existing CDN and security vendors as well? And I have a follow-up after that.\n\nThank you.\n\nTodd Nightingale -- Chief Executive Officer\n\nSure. Yeah. I think when it comes to logo acquisitions, I mean, we are largely looking at picking up share, no doubt about it. In some cases, that means actually transitioning customers over from another CDN provider or bringing their first CDN provider both cases really focused on picking up share, and picking our market share in the CDN space is an enormous part of our focus, no doubt about it.\n\nBut I do think it's important to remember, Fastly, while we deliver CDN, it's really edge cloud. And that's edge-cloud platform is our offering, which is why there's just been, I think, an enormous opportunity for us to do portfolio expansion with existing accounts. Expansion from content delivery to security, especially in the last space has been, I think, an incredibly powerful force right now, especially because the industry is focused on WAF right now. And Web Application Firewall is becoming more and more the fact of standard and the requirement for application developers or website developers.\n\nIt's a great and growing market. So we are focused on that expansion. That's really a -- security portfolio, we really think of our growth as a growth portion of our portfolio. When we look at edge compute, I think of that a lot in terms of incubation, an incubation business.\n\nSomething that was really a pleasant surprise when I got here is to see how much sure that business has gotten in such a short time. We've had very significant deals in edge compute and customers who were content delivery customers who are actually going to be spending more in edge compute next year than on content. I think that's a motion that we can replicate, and it's an important one because as app developers, especially are looking at how dynamic, how real time their applications can be pushing that compute to the edge has a huge opportunity to deliver that outcome for them. So we're very super bullish on that opportunity, and that's something we are really deeply focused on.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nVery interesting. Thanks, Todd. And then a follow-up on the talk about improving the supply chain in order to get equipment a little fast. I was trying to square that comment along the lines of capacity utilization.\n\nIf you could try to connect like that comment with current gross margins today and other than the impression that maybe there was enough capacity on the network, but it could be wrong, that would be helpful. Thank you.\n\nRon Kisling -- Chief Financial Officer\n\nYeah. So this is Ron. On the commitments, what we did, I think, going into really the pandemic when we realized there were going to be supply chains, we basically made commitments with the number of our suppliers to lock in a certain supply of equipment. And that supply the equipment, we're taking delivery on that as we need to deploy it in line with kind of those traffic patterns.\n\nSo from a cost perspective, and we did talk about last quarter that we did make some payments associated with these prepayments, but we haven't taken delivery of the equipment. So from a gross margin perspective, we don't actually start taking depreciation until we take title and deploy this. And we're going to deploy this in line with our build plans that are aligned very tightly with what that demand is. So when we see the demand, the equipment is available, and that's what we really start taking title to the equipment and reflecting the cost of that in our gross margins.\n\nSo with a cash commitment, it positioned us really well to be able to meet the increasing demand, and still allows us to deploy in line with expected traffic patterns.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nRon, just maybe if I could, back on -- is there any type of capacity utilization rate overall you can share with us relative to the gross margin structure of the company today? Is this -- like from -- is this a geo location issue? Or I'm just -- you keep saying deploying more equipment with demand, just maybe -- not trying to pin you down on a number, but --\n\nRon Kisling -- Chief Financial Officer\n\nNo, I mean, it's a good question. I think the challenge is that utilization varies a lot geographically, as well as when you are in the quarter. There's a little bit of seasonality in our business, which is you have to build capacity for the demand you see in Q4. So that traffic has to be -- capacity has to be there for that expected traffic.\n\nSo you build a little bit of that. And then as we've talked in the past, the other driver, which does affect utilization is -- typically, when we do expand, particularly into a new region, that initial deployment may be running at below our normal or desired utilization as we would deploy that to cover a certain opportunity. And as we add traffic in that area, we bring up that utilization. So the impact on utilization is really a combination of what the traffic levels we're seeing and where we're expanding the footprint of our global market, our global platform.\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nThank you, Ron.\n\nOperator\n\nWe have no further questions at this time. I'll turn it over to Todd Nightingale for any closing remarks.\n\nTodd Nightingale -- Chief Executive Officer\n\nThanks so much. Thanks, everyone. Before we close the call, I want to take an opportunity just to thank all of our customers, employees, our partners and our investors. Fastly's remain as committed as ever to making the Internet a better place where all experiences are fast, engaging and safe.\n\nAnd moving forward, we remain focused on execution, on bringing lasting growth to our business and delivering value to all shareholders. Thank you all. Thanks so much for the time today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nVern Essi -- Investor Relations\n\nTodd Nightingale -- Chief Executive Officer\n\nRon Kisling -- Chief Financial Officer\n\nJames Fish -- Piper Sandler -- Analyst\n\nFrank Louthan -- Raymond James -- Analyst\n\nJim Breen -- William Blair -- Analyst\n\nMatt Wilson -- Morgan Stanley -- Analyst\n\nWill Power -- Baird -- Analyst\n\nUnknown speaker -- Citi -- Analyst\n\nTom Blakey -- KeyBanc Capital Markets -- Analyst\n\nMore FSLY analysis\n\nAll earnings call transcripts"
}