{
  "companyName": "HUYA Inc.",
  "companyTicker": "HUYA",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/16/huya-inc-huya-q2-2022-earnings-call-transcript/",
  "content": "HUYA Inc. (HUYA 2.87%)\nQ2 2022 Earnings Call\nAug 16, 2022, 7:00 a.m. ET\n\nOperator\n\nHello, ladies and gentlemen. Thank you for standing by for the second quarter 2022 earnings conference call for Huya Inc. [Operator instructions] I will now turn the call over to Ms. Hanyu Liu, company investor relations.\n\nPlease go ahead.\n\nHanyu Liu -- Investor Relations\n\nHello, everyone, and welcome to Huya's second quarter 2022 earnings conference call. The company's financial and operational results were issued earlier today and are posted online. You can also view the earnings press release by visiting the IR website at ir.Huya.com. A replay of the call will be available on the IR website in a few hours.\n\nParticipants on today's call will be Mr. Rongjie Dong, chief executive officer of Huya; and Ms. Ashley Wu, vice president of finance. Management will begin with prepared remarks, and the call will conclude with a Q&A session.\n\nBefore we continue, please know that today's discussion will contain forward-looking statements made under the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements involve inherent risks and uncertainties. As such, the company's results may be materially different from the views expressed today.\n\nFurther information regarding these and other risks and uncertainties is included in the company's prospectus and other public filings as filed with the U.S. Securities and Exchange Commission. The company does not assume any obligation to update any forward-looking statements, except as required under applicable law. Please also know that Huya's earnings press release and this conference call include discussions of unaudited GAAP financial information, as well as unaudited non-GAAP financial measures.\n\nHuya's press release contains a reconciliation of the unaudited non-GAAP measures to the unaudited most directly comparable GAAP measures. I will now turn the call over to our CEO, Mr. Rongjie Dong. Please go ahead.\n\nRongjie Dong -- Chief Executive Officer\n\nHello, everyone. Thank you, all, for joining our conference call today. Our 2022 second quarter was largely conditioned by the turbulence in the macro and regulatory environment. We mentioned in our previous earnings that the new domestic livestreaming regulations, which were introduced in May, mainly focused on tipping behavior and the protection for minors.\n\nAccordingly, we adjusted the associated products and the operations on our platform. And we will continue to closely follow policy updates and make timely adjustments to ensure compliance. The prudent adjustments we undertook in Q2 carried a very immediate impact to certain facets of our business. And together with the macro headwinds, Q2 domestic livestreaming revenue increased by mid single digits on a quarter-over-quarter basis.\n\nDespite the impact, we still managed to grow our user base, as well as achieve approximately RMB 2.3 billion in revenues and approximately RMB 6 million in non-GAAP net income in the second quarter of 2022. We'll work to mitigate the effects on our business by dynamically adjusting our monetization strategies across our platform's operations. Essentially, our strong foundation and the business fundamentals will carry us through the long term. We are confident we have leverage in our business as we scale further in the game livestreaming industry through consistent investments in quality content and innovative products, while continuing to provide attractive games in sports and the entertainment content that satisfies the core needs of our users.\n\nOur business is a resilient one, which we expect to rebound. and prosper as market conditions stabilize. With that in mind, we remain focused on future opportunities. In spite of all the external factors, our Q2 results marked another quarter of user expansion.\n\nWe sustained growth in mobile MAUs and instituted aforementioned measures across our product upgrades and the game industry value chain integration. Now, let me walk you through some of our key metrics. Starting with user growth. Huya Live mobile MAUs reached 83.6 million in the second quarter, representing encouraging growth of 7.7% from the year-over-year period.\n\nThis growth was mainly due to the continuous investment of quality content, as well as product upgrades and optimization, which leveled our platforms user appeal. Additionally, it further highlights both the necessity and the efficiency of our content investment strategies and the product improvements. User stickiness also improved, with total user time spent on our platform in the quarter growing by about 12% year over year. Our Huya Live app next month user retention rate remained above 70% in addition to our growing active user base.\n\nWith respect to product upgrades, we have found positive strides in product interest using product innovations for our users. Our newest version 10.0 of Huya Live app further integrates community features and enhances the user interaction experience. More specifically, version 10.0, we are live, has a social community called Tiger chit-chat which features broader-based content ranging from videos, images, and the text post to Q&A, strategies, and the events. The community also serves as a discussion board between users and their favorite broadcasters, promoting better interaction between broadcasters and their fans to cultivate deeper bonds during livestreaming hours.\n\nEngaged in community interactions and activities, users are more motivated to produce high-quality UGC in the video category through our algorithm-driven recommendations and operations. Furthermore, segments for different game titles and tournaments are also being created, and official accounts operated by the game studios can join the community to provide the latest game information and strategies. In addition, based on the impactful one-click to join broadcaster's gameplay feature, which is available in our livestreaming channels, we launched competition function called Community Contest, enabling users to participate in our game competition with guests. And we are initiating battles in the matching system with just one click.\n\nHere, users can win prices offered by the platform and also have the chance to compete with celebrity game broadcasters. This new feature is another testament to our ability to recognize and fulfill user [Technical Difficulty] As a side note, I'd like to mention that our community features are not created at random. The foundation of communitization is deeply embedded on our platform through years of development. The features we institute are based in our understanding of community preferences, and most of our upgrades are born outright dictated by our users' tastes.\n\nOur achievements in product upgrades and the value chain integration actively advance us toward our vision of becoming a nonstop destination for comprehensive game-related services as we worked and collaborated with our partners to capture more opportunities across the industry value chain. Along with a more comprehensive offering, we aim to unlock more monetization opportunities going forward. In addition, by leveraging our long-term initiatives in game operations, we deepened our collaboration with game titles in recent months. Taking LOL Wild Rift as an example, we will team the app with the game studio across product function development and the game and community operations.\n\nExcitingly, Huya has contributed to the content and the interactive features of Wild Rift in-game streaming function. Additionally, Huya's community is linked too and since with additional LoL Companion app for popular Wild Rift-related videos and posts. On the tournament front, we are with among the first to stream the Wild Rift League, WRL, the games in more general professional leader in China. We also produced a service of our self-branded tournaments for these titles such as Huya Zhanshen Cup, which has become the Weixin as the official Wild Rift League.\n\nThese types of linkers help improve users' viewing experience, and they bring Huya first-mover advantage in Wild Rift mobile esports tournament system while strengthening Huya's leading position in this esports game. In promoting the newly launched LoL Esports Manager game, in addition to our work on general operational activities such as recruiting broadcasters and providing streaming incentives, by working with its game studio, we also integrated some game features in the broadcasting sessions of LoL's major events, LoL Pro League and LoL Champions Korea, and sent out Huya designated virtual items to users participating in those impactful activities. We are glad to see the game quickly gaining traction on our platform during the summer tournament season. Lastly, I would like to point out that on top of our continuous efforts in growing our user base and the game industry integration, at the corporate level we have been focused on improving our operational efficiency and adopting more stringent budget control measures.\n\nWe see these initiatives as necessary to help us navigate macro headwinds and other -- and have to know uncertainties. We are already seeing some very encouraging results from our operation of monetization efforts, which Ashley will cover in great detail in just a moment. Going forward, we aim to further strengthen our monetization capabilities, optimize our cost and expense strategy, and fortify our business fundamentals to achieve sustainable business development over the long term. With that overview, I will now turn the call over to our VP of finance, Ashley Wu, to share more details on how our operating metrics and financials.\n\nAshley, please go ahead.\n\nAshley Wu -- Vice President, Finance\n\nThank you, Mr. Dong, and hello, everyone. To expand on Mr. Dong's remarks, I will now provide some updates on our content enrichment and diversification initiatives.\n\nOn the professional esports content front, we broadcasted around 90 third-party esports tournaments in the second quarter of 2022 with the total viewership of those licensed tournaments reaching 608 million. During the quarter, we pursue our ROI-led strategy, procuring autonomous more selectively to ensure our high-quality content offerings aligned more closely with our budget control goals. In particular, legacy tournaments, such as LPL, Mid-Season Invitational, and King Pro League, maintained their leading positions in viewership. Thanks to our strengthened cooperation with the CROSSFIRE game, the CROSSFIRE Pro League spring continue to attract high user attention.\n\nI'd like to highlight that in 2022, Huya became one of CROSSFIRE's top-level partners. Our cooperation now spans the game viewing experience, esports content and virtual privilege. We expect our broader alliance with CROSSFIRE to help further expand our market reach in the first-person shooter game genre, giving us another competitive advantage. In addition to licensed esports content, we broadcasted 18 self-organized esports tournaments and entertainment PGC shows during the second quarter, generating total viewership of approximately 100 million.\n\nThis was a particularly remarkable achievement, given the pandemic-related lockdowns in a few major cities in Q2, as well as our stricter project selection process. During the quarter, outstanding self-organized channels included Honor of Kings Cup, Huya Tianming Cup, Huya division of Teamfight Tactics open championship in the seventh Huya mobile game arena. It is worth noting that the Thunder series, a phenomenal Huya IP tournament created for Honor of Kings, integrated online and offline gaming sessions promoting the influence of popular broadcasters on our platform. Such efforts are assisting Huya in building its proprietary comprehensive tournament system around Honor of Kings, which will help sustain the stable and healthy development of esports ecosystem on our platform.\n\nBeyond adopting a more selective approach and allocating our resources to more effective content, as Mr. Dong mentioned earlier, we remain diligent in improving our operational efficiency and optimizing our business expenses in a meaningful way. Our recent efforts in adjusting our overseas business, fine-tuning marketing channels and streamlining internal processes have led to a reduction of our Q2 total operating expenses by 17% quarter over quarter and 21.6% year over year. Next, moving on to our Q2 financial details.\n\nUnless otherwise specified, the percentage changes I'll be reviewing are all on a year-over-year basis. Our total net revenues were RMB 2.28 billion for Q2 compare with RMB 2.96 billion for the same period last year. Livestreaming revenues were RMB 2.05 billion for Q2 compared with RMB 2.38 billion for the same period last year. The decline was mainly due to recent micro and regulatory environment.\n\nWe saw lower average spending per paying user on Huya Live on a year-over-year basis. As the micro softness continue to adversely affect paying users sentiment, the number of paying users for Huya Live was 5.6 million, flat compared with the same period last year. Advertising and other revenues was RMB 223 million for Q2 compared with RMB 383 million for the same period last year, primarily due to lower content sublicensing revenues as the result of fewer sessions for licensing according to the licensing event schedule. The demand for advertising services was also soft due to the ongoing challenging macro environment.\n\nCost of revenues decreased by 13.6% to RMB 2.06 billion for Q2, primarily due to decreased revenue sharing fees and content costs, as well as bandwidth costs. Revenue sharing fees and content costs decreased by 13.3% to nearly RMB 1.77 billion for Q2, primarily due to the decrease in revenue sharing fees associated with declined livestreaming revenues. Bandwidth costs decreased by 9.9% to RMB 154 million for Q2, primarily due to improved bandwidth cost management and continued technology enhancement efforts. Gross profit was RMB 290 million for Q2 compared with RMB 581 million for the same period of 2021, primarily due to lower revenues.\n\nGross margin was 9.6% for Q2. Excluding share-based compensation expenses, non-GAAP gross profit was RMB 223 million and non-GAAP gross margin was 9.8% for Q2. Research and development expenses decreased by 19% to RMB 168 million for Q2, primarily due to the decrease in share-based compensation expenses. Sales and marketing expenses decreased by 40% to RMB 100 million for Q2, primarily due to decreased marketing and promotion fees, as well as personnel-related expenses.\n\nGeneral and administrative expenses increased by 13.5% to RMB 82 million for Q2, primarily due to the increase in professional service fees and personnel-related expenses. Other income was RMB 50 million for Q2 compared with RMB 48 million for the same period of 2021. As a result, operating loss was RMB 81 million for Q2 compared with operating income of RMB 182 million for the same period of 2021. Excluding share-based compensation expenses, non-GAAP operating loss was RMB 56 million and non-GAAP operating margin was negative 2.5% for Q2.\n\nInterest and short-term investment income were RMB 66 million for Q2 compared with RMB 58 million for the same period of 2021. Income tax expenses were RMB 1 million for Q2 compared with RMB 58 million for the same period of 2021, primarily due to lower taxable income. Net loss attributable to Huya Inc. was RMB 90 million for Q2 compare with net income attributable to Huya Inc.\n\nof RMB 186 million for the same period of 2021. Non-GAAP net income attributable to Huya Inc. was RMB 6 million for Q2 compared with RMB 250 million for the same period of 2021. Non-GAAP net margin was 0.3% for Q2.\n\nDiluted net loss per ADS was RMB 0.08 for Q2. Non-GAAP diluted net income per ADS was RMB 0.02 for Q2. As of June 30, 2022, the company had cash and cash equivalent, short-term deposits and short-term investments of RMB 10.72 billion compared with RMB 10.47 billion as of March 31, 2022. With that, I would now like to open the call to your questions.\n\nOperator\n\n[Operator instructions] The first question now comes from the line of Yiwen Zhang from China Renaissance. Please go ahead.\n\nYiwen Zhang -- China Renaissance -- Analyst\n\n[Foreign language] So thanks for taking my question. My questions is regarding the game community policy, the recent update. So, can you elaborate a bit more on the rationale behind the setting of this game community? And then what kind of opportunity does it provide -- does it synergize with the rest of our business? Thank you.\n\nRongjie Dong -- Chief Executive Officer\n\n[Foreign language] Thank you for this question. Recently, we have officially launched the Tiger chit-chat community in Huya's application version 10.0, which covers video and graphic communications. Users can initiate discussions on game Q&A, strategy tips, as well as tournaments, and etc. [Foreign language] On the one hand, it provides a place for a communication between users and livestreamers.\n\nUsers can also discuss interesting content with their peers. The livestreamers can better interact with their fans during nonstreaming hours, which is also conducive to consolidating their fan space. And on the other hand, the recommendations and operating screening, it can stimulate the enthusiasm of the users to reduce video UGC and increase the sense of user participation and help to improve the high-quality content output on our Huya platform. [Foreign language] In addition, we also set up zones for some major game titles and tournaments and invited the official operating accounts of the games to settle in so as to provide more accurate consultation and related video and live content of the corresponding game titles.\n\nAt the same time, it can also help the game studios to optimize their operation for a better effect and enhance their cooperation relations with Huya. [Foreign language] This version update comes as a natural upgrade of function of community. Huya's community has been gradually varied over the past several years. And therefore, it is necessary to upgrade the product to make an organic combination of livestreaming plus a video plus community in a one-stop manner meet the user's various needs for watching the game live, sharing and communicating, and joining the game at any time.\n\nThe content matrix of Huya meets the needs of the players to understand and discover the game before they play, consume the derived content after the game, and also precipitate the needs of the players. We hope to generate greater value in the game industry chain, explore other monetization opportunities, in addition to live revenue income, advertising, and games.\n\nHanyu Liu -- Investor Relations\n\nThank you. Let's have the next question.\n\nOperator\n\nFor the question, our next question comes from the line of Ritchie Sun from HSBC. Please go ahead.\n\nRitchie Sun -- HSBC -- Analyst\n\n[Foreign language] Thank you, management, for taking my question. Regarding the regulation tilting toward tipping rank and PK since May, could you please quantify the revenue, MAU, and paying user impact on the platform? And what are the alternative solutions for us to recoup the loss of revenue or users due to the regulation. Thank you.\n\nAshley Wu -- Vice President, Finance\n\n[Foreign language] The regulatory authorities issued the opinions on standardizing the online live broadcast reward and minors protection in May, we have implemented the requirements on schedule after the policy change accordingly. And this policy mainly focuses on minor protection and strengthening the management during the peak hours, such as the adjustment of peak playing sessions and key functions, such as the tipping and ranking modification. We believe that this policy change will help us to better regulate the industry and promote long-term development. [Foreign language] To some products and operations on the platform.\n\nAnd meanwhile, we have also made some more stringent management on the live content and behaviors of the livestreamers. We will also closely monitor the policy updates and timely improve the product and operation practices and create a more healthy platform atmosphere and content supply. [Foreign language] At present, these adjustments have been casting some impact on live broadcast revenue that we have in a certain period of time, among which the impact in Q2 is mainly in June. And it is expected that the Q3 will reflect its impact on the whole quarter.\n\nWe are also continuously assessing the subsequent impact of these adjustments on financial and operational indicators. [Foreign language] Nevertheless, on the whole, we believe that these adjustment and changes have limited impact on the demand of the core users of Huya but still serve the core users by providing high-quality games, videos, as well as other entertainment content, and at the same time will better optimize our strategy in operation and monetization for a balanced development of our product and the subscription businesses. [Foreign language] At the same time, we'll continue to strengthen the compliance capability of Huya and invest in the corresponding technologies. For example, here, there is this AI real-time sound silencing system, which is the industry's first launch recently.\n\nThis can help us to realize real-time shielding of audio transmission of potentially risky content and effectively improve our review ability of live content. The establishment of a better platform compliance system is conducive to help us in the longer-term growth in Huya.\n\nHanyu Liu -- Investor Relations\n\nThank you. Next question, please.\n\nOperator\n\nThank you. Next question comes from the line of Thomas Chong of Jefferies. Please go ahead.\n\nHanyu Liu -- Investor Relations\n\nPlease accept your line. Thomas, are you there? How about we move to next question, please, first? Thank you.\n\nOperator\n\nNo problem. Certainly. [Operator instructions] We will now move to the next question first from the line of Katrina Chiu of Citi. Please go ahead.\n\nKatrina Chiu -- Citi -- Analyst\n\n[Foreign language] Thanks, management, for taking my question. Can manage may share with us the measures we have taken for cost optimization and how we should expect the margin outlook in second half of '22. Thank you.\n\nAshley Wu -- Vice President, Finance\n\n[Foreign language] At present, to improve the company's operational efficiency, take more stringent budget control measures and optimize costs and expenses are an important job of ours, which will help us to better consolidate the company's businesses and financial foundations under the current environment and support the long-term sustainable development. [Foreign language] First of all, our recent adjustment of overseas businesses is a measure of overall cost optimization, which can help us to reduce the margin of overseas business loss on the whole. [Foreign language] In terms of the cost in the second quarter, in addition to more stringent screening procedures for copyrighted and self-made content, it has been optimized in terms of the livestreamer signing and bandwidth utilization efficiency. In terms of operating expenses, we are more cautious in channel and promotion expenses, and we also strengthen the internal processes for that matter.\n\nWe also have made more control over the personnel-related costs and expenses. Despite the decline in profit margins due to the decline in revenue in this quarter, we still made some achievements in improving the operational efficiency. The total operating expenses in the second quarter decreased by 21.6% year over year and 17% quarter on quarter. [Foreign language] We believe that these measures will continue to optimize the cost and expenses.\n\nHowever, due to seasonal factors, our profit margin level will be affected by the increase of event costs and the corresponding promotion expenses in the second half of the year. [Foreign language] For a longer-term perspective, by enhancing monetization capability of ours, we continuously optimize the cost and expense structure, such as a more balanced tournament and self-produced content and streamer costs, as well as continuous improvement of operational efficiency. We're confident in improving the margin and maintaining a positive profit.\n\nHanyu Liu -- Investor Relations\n\nOK. Let's have the next question.\n\nOperator\n\nCertainly. We will take the next questions from Thomas Chong from Jefferies. Again, please repeat your question. Hi, Thomas.\n\nPlease go ahead.\n\nThomas Chong -- Jefferies -- Analyst\n\n[Foreign language] Thanks, management for taking my questions. My question is about our content strategy. Can management comment about how we should think about the outlook in the second half, as well as in the future? Thank you.\n\nAshley Wu -- Vice President, Finance\n\n[Foreign language] Thank you for your question. As we mentioned before, the users are the core of our businesses. And it is the company's long-term development strategy to continuously drive user growth. And therefore, for a quality content investment, it is still necessary because they help us to continuously serve our users in consolidating the competitive position that we have.\n\nAt the same time, we will also adopt a more cautious investment strategy and concentrate our resources on more effective content. [Foreign language] In terms of IT and self-made content, we carry out more targeted analysis and meticulous evaluation on the ROI of various planned purchase that we have and content production and make timely adjustment according to the market conditions. And since this year, we have more strict choices in IT tournaments and self-made content projects. So, the total number may not be as many as before, but the overall quality is improved.\n\nThis is also reflected in the size of the viewership, watching these content and the growth of the MAU on our platform. Let me give you an example. In the second quarter, a total of about 100 million people watched 18 self-produced tournaments and PGC programs that we have. The year-on-year growth of mobile and they use in Q1 and Q2 was at a high-single-digit level.\n\n[Foreign language] Here, I would also like to mention that at present, we'll continue to invest in some top tier events with higher prices relatively. In the second half of the year, we'll broadcast a top level professional leagues of various mainstream game titles, including S-12. We consider not only the short-term direct cost and revenue but also the impact on user value, brand reputation, and platform cooperation, and so on. At the same time, we also hope to negotiate for better commercial terms in the future and realize long-term benefits.\n\n[Foreign language] In terms of livestreamer content, we will also dynamically address the input of signing and tipping sharing that we have with the live swimmers through the upgrading of technology. We can help and encourage the users and livestreamers of the platform to create videos and more interactive content to form a more complete matrix of content offering.\n\nHanyu Liu -- Investor Relations\n\nThank you. Let's have the next question, please.\n\nOperator\n\nThank you for the question. Your next question comes from the line of Lee Chong from Bank of America. Please go ahead.\n\nLei Zhang -- Bank of America Merrill Lynch -- Analyst\n\n[Foreign language] My question mainly is about our long-term growth. What are the growth driver in this long term that you can share with us? Thank you.\n\nRongjie Dong -- Chief Executive Officer\n\n[Foreign language] At present, our monetization result is mainly conditioned by the external environment. Huya has a continuously growing user base and good user loyalty and commercial operation ability. With our commercialization mode, we further explored and optimized as the market situation improves. We expect that our live broadcast revenue will gradually return to a growing trajectory, and we believe that starting from here, we have a few mid- to long-term development directions.\n\n[Foreign language] First, as mentioned before, Huya has key parts to the game industry chain, provides a lot of value for our game users and studios. For the category of long-tail game titles, more services can be provided from the operation and to help the game obtain and retain users and expand the influence of the games. At present, our direct income is mainly coming from the user side. While from the game studios side, we also hope to achieve win-win cooperation through deeper cooperation with them and more services provided, such as joint operation.\n\nIn the mid to long term, I think this is a place with a potentials for business and revenue growth. [Foreign language] Second point, we hope to better link the video businesses with livestreaming businesses. The community functions that we have now integrated into the video content, and we have also set up a vertical short-form video module. And through upgrading these products, about 30% of our daily users watch videos currently.\n\nWith this data being further improved in the future, we hope to realize more monetization from the video, such as advertising revenue. [Foreign language] In addition, we believe that interactive games in a livestreaming room, as well as the forms of a virtual streamer or virtual live room, are gaining popularity. So, we have explored and tried these forms and achieved some preliminary results. And it is expected that these forms will also present some opportunities to create more value in the future.\n\nHanyu Liu -- Investor Relations\n\nOK. Thank you.\n\nOperator\n\nThere are no further questions. Now, I would like to turn the call back over to the company for closing remarks.\n\nHanyu Liu -- Investor Relations\n\nThank you once again for joining us today. If you have other questions, please feel free to contact Huya's investor relations through the contact information provided if you have further questions or relations.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nHanyu Liu -- Investor Relations\n\nRongjie Dong -- Chief Executive Officer\n\nAshley Wu -- Vice President, Finance\n\nYiwen Zhang -- China Renaissance -- Analyst\n\nRitchie Sun -- HSBC -- Analyst\n\nKatrina Chiu -- Citi -- Analyst\n\nThomas Chong -- Jefferies -- Analyst\n\nLei Zhang -- Bank of America Merrill Lynch -- Analyst\n\nMore HUYA analysis\n\nAll earnings call transcripts"
}