{
  "companyName": "PTC",
  "companyTicker": "PTC",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/ptc-ptc-q4-2022-earnings-call-transcript/",
  "content": "PTC (PTC -0.89%)\nQ4 2022 Earnings Call\nNov 02, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Thank you for standing by, and welcome to the PTC 2022 fourth quarter conference call. During today's presentation, our parties will be in a listen-only mode. Following the presentation, the conference will be open for questions.\n\n[Operator instructions]. I would now like to turn the call over to Matt Shimao, PTC's head of investor relations. Please go ahead.\n\nMatt Shimao -- Head of Investor Relations\n\nGood afternoon. Thank you, Angela, and welcome to PTC's fourth quarter and fiscal year 2022 conference call. On the call today are Jim Heppelmann, chief executive officer; and Kristian Talvitie, chief financial officer. Today's conference call is being broadcast live through an audio webcast, and a replay of the call will be available later today at www.ptc.com.\n\nDuring this call, PTC will make forward-looking statements, including guidance as to future operating results. Because such statements deal with future events, actual results may differ materially from those projected in the forward-looking statements. Additional information concerning factors that could cause actual results to differ materially from those in the forward-looking statements can be found in PTC's annual report on Form 10-K, Form 10-Q, and other filings with the U.S. Securities and Exchange Commission as well as in today's press release.\n\nThe forward-looking statements, including guidance provided during this call are valid only as of today's date, November 2, 2022, and PTC assumes no obligation to update these forward-looking statements. During the call, PTC will discuss non-GAAP financial measures. These non-GAAP measures are not prepared in accordance with generally accepted accounting principles. A reconciliation of the non-GAAP financial measures to the most directly comparable GAAP measures can be found in today's press release made available on our website.\n\nWith that, I'd like to turn the call over to PTC's chief executive officer, Jim Heppelmann.\n\nJim Heppelmann -- Chief Executive Officer\n\nThanks, Matt. Good afternoon, everyone, and thank you for joining us. I'm pleased to report that PTC delivered an outstanding fourth quarter, which capped off a record year in fiscal '22. Our top line metric of ARR and bottom-line metric of free cash flow both came in above the guidance ranges we issued 90 days ago.\n\nExecution was strong throughout fiscal '22 as full-year results align well to the growth and margin expansion strategies we outlined at last December's Investor Day. Relative to top-line and bottom-line metrics, across both absolute and relative improvement measures, fiscal '22 was PTC's best year in decades. Before I dive in, I'd like to point out that Kristian will cover the ongoing effects of the strong dollar later during his section of the call. So to simplify things, I'll focus my discussion on constant currency results where applicable.\n\nTurning to Slide 4. ARR and free cash flow results for Q4 were very strong and the strength was broad-based across all segments and geographies. On particular note, we saw organic ARR growth continue at the accelerated pace of 15%, driven by strong performance across the board in digital thread core, digital thread growth, FSG, and velocity. Our Codebeamer acquisition had another strong quarter and contributed a point of inorganic ARR growth, taking PTC's total ARR to $1.71 billion, up 16% year-over-year.\n\nOur top-line ARR growth was helped by the lowest churn the company has seen in many quarters, even better than last quarter. Organic churn, excluding the impact from Russia, improved by 193 basis points, well better than the 100 basis points we guided to at the start of the year. Despite churning the entire Russian business, churn was lowest in Europe for both Q4 and the full year. Price increases provide a helpful tailwind to renewals globally, but the underlying gross churn improvement is what has carried the day all year long.\n\nFiscal '22 was the fifth consecutive year of double-digit ARR growth for PTC. It was also the second consecutive year of 16% ARR growth. But take note that the organic element of that growth mix has accelerated by 300 basis points from 12% in fiscal '21 to 15% in fiscal '22. Per our guidance, we expect to post a sixth consecutive year of double-digit ARR growth in fiscal '23 even after a considerable allowance for a potential macro slowdown.\n\nFree cash flow in Q4 was $29 million, ahead of our guidance. Free cash flow for fiscal '22 was $416 million, above our guidance and up 21% year-over-year despite an approximate $30 million or 700 basis points headwinds due to the impact of FX on our operations. Including $53 million of payments primarily related to our restructuring from a year ago and fees related to acquisitions, adjusted free cash flow was $468 million. Next, on Slide 5.\n\nI want to reflect on the margin expansion initiatives we pursued over the past year, including both the restructuring related to our SaaS pivot announced a year ago, and the portfolio resource optimization we discussed on the last call. Both programs have proven very successful because, against the backdrop of a rocky economy, we achieved about 3 percentage points of cash contribution margin expansion in fiscal '22, while simultaneously accelerating organic ARR growth rate by about 3 percentage points as well. That's six points of expansion against a rule of 40 type measure in a single year. We expect the ongoing effect of these profitability initiatives to lead the further cash contribution margin expansion in fiscal '23.\n\nWith the restructuring costs behind us and cash contribution margins expanding on double-digit ARR growth, we're expecting to drive free cash flow up about 35% to the $560 million level in fiscal '23. Moving to Slide 6. Despite the scary headlines we continue to read every day, we saw record demand for our offerings in the fourth quarter. While we again experienced some macro-related softness in smaller deals, notably in Europe, and some softness in China, these factors were offset by the strength in PLM, SaaS, and larger deals.\n\nAs we previewed on the last call, organic bookings were up low single digits from a blockbuster Q4 last year, setting new record highs in Q4 and for fiscal '22. Q4 bookings were up 30% sequentially from the strong Q3 level, which reflects typical seasonality. Bookings growth was strong in both the digital thread and velocity units. The recent Codebeamer acquisition continues to perform exceptionally well with Q4 wins at a large German automaker, a large semiconductor company, and a large Korean automaker, among others.\n\nTurning to Slide 7. In Q4, we again saw strong ARR growth across all geographies. ARR growth for the Americas was 17%. In Europe, ARR grew 16% despite the Russia exit in Q2, which still affects the growth rate given the trailing nature of our ARR metric.\n\nARR growth in APAC was 13%. Across all geographies, the largest ARR growth in terms of magnitude was driven by continued strong demand for our Creo CAD and Windchill PLM products within digital thread core. We saw the strongest ARR growth in terms of percentage across all geographies for velocity. With our cloud-native on shape CAD and Arena PLM products continuing to grow multiple times faster than the market rate.\n\nNext, let's look at ARR performance of our business units, starting with the digital thread on Slide 8. In our largest product segment, digital thread core, we delivered another strong double-digit growth performance in Q4 with 14% ARR growth. Within this, CAD again grew low double digits, while PLM accelerated to 19% growth as Windchill continues to be a hot seller. Q4 represents the 20th consecutive quarter of double-digit ARR growth that we've seen in the core CAD and PLM business.\n\nIn digital thread growth, which is IoT and AR, growth sustained the 19% ARR growth rate, and we were just a smidgen short of rounding up to that two-handle growth rate goal we were hoping for. Close enough in my view. ThingWorx DPM had a decent quarter, including a nice expansion deal from a customer who first purchased DPM last quarter. FSG posted great results again in Q4, growing 9% organically and 19% inclusive of Codebeamer.\n\nTurning to Slide 9. On the SaaS transformation front, we landed several Windshields deals including our first few lift and shift SaaS conversions with our partner, DXP services. The SaaS transition program is right on track. Our win at Raymond Corporation illustrates the value proposition of Windchill plus.\n\nRaymond Corp. is owned by Toyota Industries, and they make a wide variety of forklift trucks, pallet jacks, and warehousing products. Raymond conducted a study and found that with our Windchill plus SaaS solution, they can drive substantial savings in total cost of ownership while avoiding the burden of maintaining the software system themselves. Raymond is now enabling their distributed workforce with Windchill plus.\n\nA reminder that Windchill plus is the tip of the iceberg of a bigger plus strategy, and you will see us follow with Creo Plus and other similar premium SaaS offerings in fiscal '23 and beyond. We're aiming to launch Creo Plus and this bigger plus strategy at LiveWorx in May. Turning to the velocity business on Slide 10. Year-over-year ARR growth for the velocity unit maintained the accelerated rate of 29% we saw last quarter with Onshape and Arena, again, each growing multiple times faster than their respective market.\n\nArena continues to mirror the PLM strength we see with Windchill and the mid-20s growth rate of Arena that we've seen throughout fiscal '22 is more than 10 percentage points higher than Arena's pre-acquisition growth rate had been. Both Onshape and Arena have been great acquisitions for PTC. The strength of these businesses, which are the cloud-native pioneers in our industry gives us confidence that the future of our market will be SaaS, and the shift to SaaS will create strong growth tailwinds for PTC for years to come. Let's turn to Slide 11 and talk about the future.\n\nGiven the strength we've seen in our business throughout fiscal '22 juxtaposed against the likelihood of a more difficult macro situation that is said to be headed our way but has not yet arrived in a meaningful way, it's a real challenge to tell you with precision how our business will perform in fiscal '23. But because of our recurring model, the fact that our software is very sticky, and key to the digital transformation efforts that industrial companies around the world are pursuing, we think that the range of likely outcomes is fairly narrow at 10% to 14% ARR growth. Therefore, it's most likely that we'll see ARR growth in the double-digit range again in fiscal '23. At the high end of our 10% to 14% ARR organic growth guidance for fiscal '23, we would be looking at only modest bookings growth and no further improvement in churn, both somewhat disappointing outcomes versus the strength we've seen in fiscal '22.\n\nAt the midpoint of the guidance range, we're looking at no growth at all in bookings, plus 100 basis points more churn. At the low end of the guidance range, we're looking at a 15% decline in bookings all year, plus the 100 basis points more churn. We feel that these are the most plausible outcomes for fiscal '23. But I want to be completely clear that as we sit here today, we have no indication whatsoever that bookings will actually decline, or the churn will actually increase.\n\nWe are simply adding a prudent safety factor to our guidance range, so we're all prepared for a downturn should it happen. While we don't foresee even worse outcomes and thus have not included them in our guidance range, for the sake of illustration, a 30% decline in bookings all year, plus the 100 basis points more churn gets us to 7% ARR growth. And just to demonstrate the amazing resilience of our model, note that it would take a massive 75% year-over-year bookings decline on top of 200 basis points more churn to get to flat year-over-year ARR growth. But even then, free cash flow, which shows solid growth given cash contribution margin improvements already implemented, the restructuring payment that are now behind us, and the spending austerity we'd surely implement in response to a downturn of that magnitude.\n\nBottom line is that we're very confident that the resilience of our model ensures strong fiscal '23 results. While a potential macro downturn is on everybody's mind, the foreign exchange rates we're already experiencing is a bigger factor in our fiscal '23 free cash flow projections. The $560 million target for free cash flow correlates both to an ARR growth slowdown and to the very strong dollar that we're currently experiencing.  At today's foreign exchange rates, which are the most unfavorable in two decades, the $560 million of free cash flow in fiscal '23 includes a roughly $60 million headwind versus what the same free cash flow would be at given our fiscal '22 plan rates. The $560 million remains within the $550 million to $600 million free cash flow range we established back in 2019 when the world looked very different.\n\nBut I trust you can see, if not for significant FX headwinds we would, in fact, be guiding to a free cash flow number above that 2019 range due to the underlying strength in our business. Keep in mind that because our customer contracts are recurring, the same dollars flow through the system year after year. While FX is a big headwind now if exchange rates return to a more normal range in the future, then the headwind would dissipate, and free cash flow would trend back toward a higher level of performance. On the other hand, if today's FX rates become a permanent new normal, then we'll give consideration to other strategies like regional pricing changes to compensate.\n\nObviously, the company is very well positioned. And while we're allowing that the macro situation could slow us down somewhat versus our true potential in fiscal '23, our strategy is clearly working, our execution has been stellar, and our resilient business model means we're positioned to produce attractive and differentiated performance in our top line ARR and bottom-line free cash flow metrics, no matter what scenario unfolds. I shortened my typical customer anecdotes today because I want to save time to discuss the new IR reporting model that we're adopting as we transition into fiscal '23. Let's move to Slide 12.\n\nAs most of you know, with the Codebeamer acquisition landing in FSG last quarter, suddenly, FSG has become a growth business, which doesn't really match our original conception of FSG as a low-growth cash cow. In fact, with digital thread core growth and FSG segments, all growing mid-teens or better, our current reporting model yields little insight into our growth drivers. In thinking through what to do with FSG, we realized that the current segmentation also doesn't map very well to our strategy and it doesn't map at all to industry market segments, which makes competitor performance comparisons difficult. Worst yet by fragmenting parts of our PLM business across digital thread core where Windchill lives, FSG where our Retail Flex PLM business is based on Windchill lives and velocity where we have Arena, our IR reporting structure has obfuscated our strong market position in PLM.\n\nGiven how our business has evolved, we feel the current reporting model no longer serves any of us very well and it's time to evolve it too. Turning to Slide 13 to address these challenges going forward, we've decided to adopt a simpler reporting model of CAD and PLM and to be completely transparent in how we're recasting our business into this model. I've already discussed last year's growth rates using the existing four segments of digital thread core growth in FSG plus velocity.  On Slide 13, you'll see how the prior segments mapped to the new segmentation model. The mapping is more simple than it appears.\n\nIf we are referring to using a computer to aid in designing product information then it is computer-aided design or CAD. If we are referring to aggregating product data and databases and managing the processes to interact with it across the product life cycle, then its product life cycle management or PLM.  You can see that if we recast last year into the new model, then inside a $1.71 billion ARR company, growing 16% last year, we had a $756 million ARR CAD business, growing 11%, and a $950 million ARR PLM business growing 20%. In case it helps with competitor comparisons, total revenues were $1.137 billion for PLM and $796 million for CAD in fiscal '22. This new reporting model maps much better to our analysts' and competitors' view the world.\n\nYou can also see how we'd allocate PTC's 10% to 14% ARR growth guidance for fiscal '23 using the old model, and how those same growth allocations would then map to the new model. In the old IR segmentation model, we would have guided digital thread core to grow 10% to 14%, digital thread growth to grow 15 [Technical Difficulty] FSG to grow 5% to 10%, and Velocity to grow 20% to 25% in fiscal '23. I trust you find that all to be quite reasonable and consistent with the high level of the ranges correlating to fiscal '22 actuals in the low end of the range, leaving room for macro slowdown. In the new model, that same 10% to 14% company growth maps to CAD growing 8% to 10% and PLM growing 12% to 17%.\n\nPlease view this bridge from the old model to the new model as a one-time event because starting with the next earnings call, we will report using only the new CAD and PLM IR segmentation model. It will make things much easier for all of us. Turning to Slide 14. I want to briefly remind you that while we're adopting a new reporting model, it is certainly not a new strategy.\n\nI trust it might even feel a little familiar to you. Indeed, we've always been clear that it was our PLM strategy that led us to acquire Servigistics, ThingWorx, Arena, Codebeamer, and others. We have said that at each step of the journey. You might even remember me saying IoT is PLM and introducing the closed-loop PLM language back when we acquired ThingWorx.  Perhaps you even remember a few years back, we had a reporting category of extended PLM that included PLM, ALM, and SLM.\n\nWe've been pursuing a broad PLM vision for years and have made tremendous progress. Now we want to put it on display. We probably need a drum roll now because this reporting model unveiled some really great news on Slide 15 that's been true for some time but masked by our reporting structure.  As the new segmentation clearly reveals, with $981 million of PLM software revenue, I'm ready to declare that PTC has become the clear category leader in the hot PLM market. Using apples-to-apples definition similar to that of competitors, PTC is easily No.\n\n1 globally in terms of scale, ahead of No. 2 Siemens and No. 3 Dassault by some distance. Note that total PLM revenue at PTC is more than $1.1 billion when you include services, but being a software company, we think it's most appropriate to focus on software.\n\nWith a growth rate well ahead of these competitors in recent years, we are rapidly widening the leadership gap. A primary reason why we've been outpacing the market for years is because of the uniquely compelling PLM portfolio we've built. But a second key reason is that we transitioned to a subscription business model years ago, whereas competitors remain largely perpetual in nature. While the valley of death, which slowed PTC's growth for years, has faded in our rearview mirror, it lies ahead for these competitors should they attempt to transition to our business model.\n\nThat would only open the software revenue gap further. The takeaway is that just as surely as Dassault leads in CAD and ANSYS leads in simulation, PTC leads in PLM. Five consecutive years of PTC's accelerating PLM growth demonstrates that PLM supports a very attractive growth rate. I feel confident PTC can and will build on a strong leadership position in this great market segment for years to come.\n\nTurning to Slide 16. Today, we're guiding the first quarter and full year of fiscal '23. At our virtual investor day just two weeks from now, we'll give you a bit more insight into our business strategy and operations in fiscal '23 and then guide how we expect that to play out across a longer period through fiscal '25. I don't want to preview that content today, but I think you'll like where the company is headed as we continue performing while transforming as we've consistently done over the past decade.\n\nThen a bit farther down the calendar, we hope you'll join us here in Boston for LiveWorx 2023 on May 15 and 16 of next year, where you have an opportunity to dive deep into all things PDC. LiveWorx will afford investors ample opportunity to interact with management, employees, customers, and partners. Please block off both events on your calendars. Wrapping up my part then on Slide 17.\n\nAs I reflect on fiscal '22, demand remained strong all year, and we've seen only minor signs of a macro slowdown. Accelerating growth and expanding margins prove our strategy is working well, and strong execution has driven our top and bottom-line performance to levels that are among the best across our industry peer group.  Transitioning into fiscal '23, I'm excited about the opportunities to do even better as we push ahead with our SaaS and margin expansion initiatives. We're watching diligently for changes in the demand environment and feel well-prepared for whatever lies ahead. Because of our business model and spending discipline, we expect to deliver solid top-line growth and robust bottom-line growth across any of the more plausible macro scenarios.\n\nI continue to believe the company has never been in a better position to create shareholder value. And with that, I'm going to turn it over to Kristian for his more detailed commentary on financial results and guidance.\n\nKristian Talvitie -- Chief Financial Officer\n\nThanks, Jim, and good afternoon, everyone. Before I review our results, I'd like to note that I'll be discussing non-GAAP results and guidance, and ARR references will be in both constant currency and as reported. Turning to Slide 19. In fiscal '22, our ARR grew 16% on a constant currency basis and exceeded guidance.\n\nOn an organic constant currency basis, excluding Codebeamer, our ARR was $1.61 billion, up 15% year-over-year. As Jim explained, our top-line strength in Q4 was broad-based. We're executing well against our strategy, and we're continuing to improve upon our strong market position. Our SaaS businesses across our digital thread and Velocity groups saw continued solid ARR growth in Q4.\n\nOn an as-reported basis, we delivered 7% ARR growth, 6% organic, due to the impact of FX headwinds, which were $134 million, substantially higher than the approximately $85 million of FX headwinds that we would have expected assuming Q3 ending exchange rates and at the midpoint of our guidance for Q4. Moving on to cash flow. Despite the FX headwinds, our cash flow results were strong, with Q4 and full-year results coming in ahead of our guidance across all metrics. Solid collections performance and slower hiring helped to offset the incremental headwinds that materialized in Q4.\n\nAnd for the full year, our restructuring cost controls and above-planned perpetual license revenue, primarily from Kepware also helped to offset the FX headwinds. When assessing and forecasting our free cash flow, it's also important to remember a few things. FX rates were more favorable in the first half of fiscal '22, and the majority of our collections occur in the first half of our fiscal year. Q4 is our lowest cash flow generation quarter, and free cash flow is primarily a function of ARR rather than revenue.\n\nIn fiscal '22, FX fluctuations created a headwind of approximately $30 million to our free cash flow results. Q4 revenue of $508 million increased 6% year-over-year, and fiscal '22 revenue was $1.933 billion, up 7%. As we've discussed previously, revenue is impacted by ASC 606, so we do not believe that revenue growth rates are the best indicator of our underlying business performance but would rather guide you to ARR as the best metric to understand our top-line performance and cash generation. On a constant currency basis, our Q4 revenue was up 12% year-over-year, and our fiscal '22 revenue was up 11%.\n\nBefore I move on to the balance sheet, I'd like to provide some color on our non-GAAP operating margin as I did last quarter. We continue to caution because revenue is impacted by ASC 606, other derivative metrics such as gross margin, operating margin, operating profit, and EPS are all impacted as well. Still, it's worth mentioning that we're benefiting from the work that we've done to optimize our cost structure. Our non-GAAP operating margin expanded by approximately 300 basis points to 38% in fiscal '22.\n\nMoving to Slide 20. We ended the fourth quarter with cash and cash equivalents of $272 million. Our gross debt was $1.36 billion with an aggregate interest rate of 3.9%. During Q4, we repaid $75 million on our revolving credit facility.\n\nRegarding our share repurchase program, as we've communicated previously, we completed $125 million of repurchases at the front end of this fiscal year. Our long-term goal, assuming our debt-to-EBITDA ratio is below three times, is to return approximately 50% of our free cash flow to shareholders via share repurchases while also taking into consideration the interest rate environment and strategic opportunities. Next, Slide 21 shows our ARR by product group. In the constant currency section on the top half of the slide, we use rates as of September 30, 2021, to calculate ARR for all periods.\n\nYou can see on the slide how FX dynamics have resulted in differences between our constant currency ARR and as reported ARR over the past eight quarters. I provide a reminder on the previous call that when we set ARR guidance for fiscal '23, we would be providing that at the September 30, 2022 FX rates and restating history assuming those rates. Let's turn to that now. Here on Slide 22, we show the new reporting categories that Jim took you through with historical ARR results recasted using our FY '23 plan rate for all periods.\n\nWe post a set of financial data tables to our IR website that has our financial statements as well as these ARR tables. For comparative purposes, the constant currency historicals are at FY '23 plan rates and should be used when forecasting PTC's constant currency ARR results. This is important to consider in the context of our guidance because we provide ARR guidance on a constant currency basis. If exchange rates fluctuate significantly between the end of Q4 and the end of Q1, that would be reflected in our as-reported ARR.\n\nWe believe constant currency is the best way to evaluate the top-line performance of our business because it removes FX fluctuations from the analysis, positive or negative.  Given the sharp moves in FX that we've seen recently, I thought it would be useful to provide an updated ARR sensitivity rule of thumb here on Slide 23. And as you can see, in addition to the U.S. dollar, we transact in euro, yen, and more than 10 other additional currencies. Using our Q4 FX rates, the impact of a $0.10 change in the euro would be approximately $38 million positive or negative and the impact of a JPY 10 change would be approximately $7 million, again, positive or negative.\n\nAnd of course, the estimated dollar impact to ARR is dependent on the size of the ARR base. Turning to Slide 24. Since most of the sell-side forecasts have been built, assuming September 30, 2021 rates, I thought it would be helpful to provide this slide as a reference point before I take you through our actual guidance on Slide 25. Slide 24 illustrates what our guidance would have looked like if calculated using our fiscal '22 plan rates.\n\nThe year-over-year growth rate for ARR is the same 10% to 14% that you'll see on Slide 25. However, the absolute values for ARR are higher given the FX rates versus the FY '23 plan rates. For revenue, the actuals we report and the guidance we provide are on an as-reported basis, not on a constant currency basis. For illustrative purposes, this slide shows our fiscal '22 revenue on a constant currency basis, assuming our fiscal '22 plan rates.\n\nOn this basis, the illustrative year-over-year growth rates for fiscal '23 are about 6% higher than the comparable numbers you'll see on the next slide. The range of revenue growth is lower on Slide 25 because our reported revenue is based on monthly FX movements rather than a point-in-time set of rates, and we faced some tough comps in fiscal '23, particularly in the first half of the year. With that, I'll take you through our guidance on Slide 25. Today, I'll focus on FY '23 and Q1.\n\nIn a couple of weeks when we have our Investor Day, we'll focus more on the medium term. For all ARR guidance amount, we're using our fiscal '23 plan rates, the rates as of September 30, 2022. For fiscal '23, we expect constant currency ARR growth of 10% to 14%, which would make this the sixth consecutive year of double-digit growth. This corresponds to fiscal '23 constant currency ARR of $1.73 billion to $1.79 billion.\n\nChurn is a key component of our ARR guidance, and we significantly outperformed our churn guidance in fiscal '22 and ended the year with organic churn at 5.6% using our fiscal '22 plan rates. Our medium-term target, as stated back in 2019 was to get to the 6% level by fiscal '24, and we achieved this earlier than expected. Going forward, I think there's still room to improve our churn rate, but at the same time, I want to be cognizant of the macro environment, and that's the rationale behind keeping our churn assumption essentially flat for fiscal '23. Next, on cash flows.\n\nFor fiscal '23, we expect free cash flow of approximately $560 million, up about 35%, and adjusted free cash flow of $562 million, up about 20%. This includes an estimated $60 million of headwinds caused by FX impacts on our operations as compared to FY '22 FX rates. Our fiscal '22 restructuring is substantially behind us. So the difference between free cash flow and adjusted free cash flow is small for fiscal '23.\n\nOur capex assumption for fiscal '23 is approximately $20 million, and therefore, relative to free cash flow guidance of $560 million, we're guiding for cash from operations of $580 million. In a few minutes, I'll take you through an illustrative FY '23 free cash flow model in more detail. Moving on to revenue guidance. For fiscal '23, we expect revenue of $1.91 billion to $1.99 billion, which corresponds to a growth rate of negative 1% to positive 3%.\n\nASC 606 makes revenue fairly difficult to predict in the short term for on-premise subscription companies, hence the wide range. And remember, revenue does not reflect cash generation as we typically bill customers annually upfront regardless of contract term lengths. It's worth taking a few minutes to explain this. So let's go on a short detour from guidance and turn to Slide 26.\n\nThis slide shows a hypothetical example with 10 contracts and different assumptions for four variables: software type, which can be either on-premise subscription, perpetual support or cloud/SaaS; number two, upfront recognition percentage. To keep this model simple, we'll just assume that 50% of the on-premise subscription total contract value is recognized upfront under ASC 606. To be clear, this varies by company and even by product within each company. But here, we're just trying to keep this simple to illustrate the point.\n\nNumber three, term length. This example uses term lengths ranging from one to four years and four contract size. This is really total contract value or TCV. In this example, TCV ranges from $1,000 to $4,000.\n\nBut note, all of these contracts have the same ARR of $1,000. Moving to Slide 27 for certain contract types, namely SaaS and cloud and on-premise support contracts, revenue recognition is ratable over the term of the contract. For these contracts, term length and contract value do not have impact on revenue recognition and revenue aligns with ARR on an annual basis. You can see this here with $250 being recognized every quarter.\n\nOn the next slide, Slide 28. Here is an example of a one-year on-premise subscription that renews annually. Due to ASC 606, half of the contract value is recognized as upfront revenue and the remaining half is recognized ratably over the contract term. Since this is a one-year subscription, revenue aligns with ARR on an annual basis.\n\nHowever, on a quarterly basis, there is a difference because of the upfront revenue recognition was $625 in the first quarter and $125 in the next three quarters. Turning to Slide 29. Here, we're highlighting an example of a four-year on-premise subscription. Again, under ASC 606, half the contract value is recognized as revenue upfront.\n\nHowever, ARR and cash invoicing are both done on an annual basis. In this example, the amounts would be 1,000 per year. In contrast, as this example shows, we would recognize $2,000 of revenue upfront, and the remaining $2,000 will be recognized ratably over the 16 quarters of the term. Moving to Slide 30.\n\nThe graph compares ARR and revenue for these 10 hypothetical contracts over a 12-year period. Over the 12 years, this model assumes no growth, no price increases nor churn. There's no changing of term lengths, no migrating from support to on-premise subscription or from on-premise subscription to SaaS. Of course, as you know, we actually have programs in place that actively drive each of these dynamics, but it would be much too complicated to start adding these kinds of dynamics into this super simple example.\n\nThe green line, which is ARR, appropriately shows flat business performance, 10 contracts at $1,000 each for $10,000 in ARR each year, 0% growth. Whereas the blue line, which is revenue, shows a lot of volatility from year-to-year. Revenue growth rates vary from negative 33% to positive 69% in any given year. And again, while this example is overly simplistic, hopefully, you can see why we keep saying that you can't really look at revenue to understand the underlying performance of our business, nor is it helpful when trying to understand free cash flow dynamics.\n\nWhat is important to remember is that over the term of the contract, over the term of each contract, every dollar of ARR becomes $1 of revenue. However, how and when revenue is recognized is dependent on the mix of contracts starting and/or renewing in any given year and can vary significantly from period to period. And you can imagine what happens to margins and EPS under this kind of scenario. Next, on Slide 31 is the conclusion.\n\nDue to ASC 606, the revenue trend is noise for companies like PTC that sell on-premise subscriptions. But the point here is, don't worry because free cash flow is really a function of ARR. And this is why we focus on ARR and free cash flow and believe it to be the best way to assess our fundamental business performance.  Now returning from that fun side trip to guidance on Slide 32. For Q1, we're guiding for cash from operations of $170 million, free cash flow of $165 million, and adjusted free cash flow of $166 million.\n\nThere's one additional item worth noting related to the cash flow in Q1 and fiscal '23. In Q1, we expect to make a $10 million foreign tax payment related to changes to the withholding tax policy of a foreign country. Since we also expect this to be substantially -- all of this to be substantially -- substantially all of this to be refunded before the end of fiscal '23, there is no expected impact to the full year financials and we will not adjust for this. Aside from this item, as you model the quarters of fiscal '23, keep in mind that we expect the quarterly distribution to follow a similar pattern as in fiscal '22 and fiscal '21 for the cash flow metrics with over 60% of our cash flow coming in the first half of the year and Q4 being our lowest cash flow generation quarter.\n\nNext, on Slide 33. Let's take a look at an illustrative model that uses the assumptions that Jim described earlier and illustrates what you need to believe to achieve the midpoint of our fiscal '23 constant currency ARR guidance at the midpoint of $1.76 billion. In this illustrative model, which is for 12% constant currency ARR growth, we've assumed that churn worsens by approximately 100 basis points, and we kept new ACV flat. While new ACV is not exactly the same as bookings due to dynamics such as ramp deals and in-year starts, which we've discussed before, it's a close enough proxy for this exercise.\n\nI would point out that while the churn increase looks high, that is, in fact, the math of an approximate 100 basis point increase that we outlined earlier in the discussion. And while the macro environment may increase churn, as you can see on the page, a 100-basis point increase would push absolute churn level -- churn dollars above levels that we have not seen for quite some time. And we have some tailwinds on the churn front, which include term lengths lengthening. In fact, our expiring base in fiscal '23 is only slightly higher than in fiscal '22 despite more than $200 million of beginning ARR.\n\nThe price increase we implemented in May should also provide some tailwind throughout the year. And importantly, our product portfolio continues to mature and some of the product segments that have higher churn like IoT and AR have seen steady improvement in churn over the past three years and still have lots of room for improvement to get to renewal rates more in line with, for example, Creo and Windchill. On the flat new ACV assumption, I would also point out that we have slightly more deferred ARR starting in fiscal '23 than we did in fiscal '22. We will have a full year of new sales from Codebeamer versus the two-quarters worth that we had in fiscal '22, and the price increases that went into effect should provide a modest tailwind on the new sales front as well.\n\nYou can see that to hit the midpoint of $1.76 billion, we need to add $188 million of ARR in fiscal '23. Balancing potential macro uncertainties with the momentum we've been seeing in our business, our forecast and given some of the considerations I just mentioned, we believe our fiscal '23 guidance is prudent. Turning to Slide 34. Here's an illustrative constant currency ARR model for Q1.\n\nYou can see our results over the past eight quarters. In the far-right column, we've modeled the midpoint of our constant currency Q1 ARR guidance. Because our ARR tends to see some seasonality, the most relevant comparison is Q1 '21 and Q1 '22. The illustrative model indicates that to hit the midpoint of our Q1 '23 guidance of $1.59 billion, we need to add $18 million of ARR on a sequential basis.\n\nThis is less than the $40 million we added in Q1 of '21 and the $37 million we added in Q1 of fiscal '22. Again, for the reasons I mentioned just a minute ago, we believe we've set our Q1 '23 constant currency ARR guidance range prudently. Let's move on to Slide 35, which shows an illustrative free cash flow model for fiscal '23. I know that most of you model free cash flow using the indirect method, which uses the P&L and balance sheet as a starting point.\n\nGiven the complexities related to ASC 606 that we spent some time on earlier on this call, there are inherent challenges in using the indirect method to forecast free cash flow for PTC. The model on this slide is based on what we use internally. I know that looking at it in this way may be unfamiliar to some of you, so please feel free to reach out if we can help. Starting at the top with ARR.\n\nNote that the FY '22 ARR has been -- is at the September 30, 2022 rates and that for fiscal '23, we've used the midpoint of our constant currency ARR guidance. Moving down the model. The primary reason why FY '23 professional services revenue is down because of unfavorable FX developments we've seen over the past year. In addition, we expect roughly a third of our professional services revenue to transition to DxP over time.\n\nMoving to cost of revenue and operating expenses, the FX developments over the past year have the opposite effect here. Compared to revenue for costs and expenses, the FX moves are beneficial. You can see the powerful leverage on our cash contribution, which is a characteristic outcome of a sticky recurring subscription business model, combined with operational discipline. As you can see, expected restructuring payments are materially lower in fiscal '23 because, as Jim explained earlier, we completed the work related to the operational optimization announced a year ago and the related cash restructuring payments are now substantially behind us.\n\nWe've also completed the work to rebalance resources across the company to align with our growth opportunities and we did this without a restructuring charge. Moving on, you'll see that other expense is higher in fiscal '23 compared to fiscal '22, this is primarily due to higher interest rate on our revolver, given the higher interest rate environment. Cash taxes are also higher in this model and reflect both higher taxable income as well as the impact of Section 174. And finally, the other category is also higher in FY '23.\n\nThe main driver here is higher working capital to support continued growth. FY '22 also includes the impact of FX movements. All this sums up to expected free cash flow of $560 million, inclusive of the $134 million ARR headwind that materialized and consequent $60-ish million headwind to free cash flow. Jim explained earlier, we expect to deliver approximately $560 million under the most plausible ARR growth scenarios, and I'd like to reiterate that.  If the macro situation gets worse and our cash generation is impacted, you can expect us to moderate our spending.\n\nOn the other hand, if the macro situation improves or the dollar strength reverses, this would be favorable for our cash generation. And in that scenario, we'd likely invest more aggressively in our business. As we start the year, we believe $560 million is a good target.  And that's a good segue to Slide 36. First of all, we are prepared for a storm and expect to be resilient in the face of one.\n\nFrom a top-line perspective, we serve industrial product companies. And R&D at those companies tends to be quite resilient, so we have a supportive top-line backdrop. We've also transitioned successfully to a subscription business model, and our products are very sticky with our customers. Just as importantly, from a cost and operational perspective, we have done a lot of optimization in 2022 that will serve us well going forward.\n\nWe've already battened down the hatches. Nevertheless, as we've said in the past, we do not have a Pollyanna-type view when it comes to the macro situation. We have a strong track record of disciplined operational management. And in the event of a meaningful downturn, we're prepared to pull additional spending levers to mitigate the impact on our cash flows.\n\nVariable compensation would automatically adjust. And depending on the magnitude of the downturn, we would also curtail plant hires, look at backfilling, attrition, marketing spends, travel spend, etc. So with that, I'd like to wrap it up here and turn it over to the operator to begin Q&A.\n\nOperator\n\n[Operator instructions]. Your first question comes from the line of Steve Tusa with J.P. Morgan. Your line is open.\n\nSteve Tusa -- J.P. Morgan -- Analyst\n\nHi. Good evening. How are you, guys? Quite a comprehensive rundown there. Thanks for that.\n\nSo the message is that you guys are ready, I guess, that's the message. Just on this customer behavior, I mean, you went to great lengths once again, to highlight how you're ready for whatever comes your way with the business model. And in those parts of the business that you did see, perhaps not as much growth in bookings in Europe and China. I mean, there are obvious reasons for that probably.\n\nBut what are you seeing in customer behavior there? Is it just kind of like deferrals of budgets? Is it longer cycle times to close? And how do you expect this to kind of progress here into the fourth quarter?\n\nJim Heppelmann -- Chief Executive Officer\n\nYes. So first, again, I want to remind you, we had record sales in Q4. So while we saw some minor slowdowns, we also saw strength that more than offset it in other places.  But to answer your question, in China, it's really COVID, it's geopolitical, it's all those kinds of things. And China is 5% of our business.\n\nSo we don't have a lot of exposure there. In Europe, it tends to be smaller companies who are themselves battening down the hatches and they're trying to kick the can down the road and get a little bit more insight into what's going to happen to the economy. But I mean, I know this is a general question for everybody, so let me elaborate a little bit. It's a funny time because, on one hand, you have the PMIs coming down, and normally, that slows down our bookings, but it hasn't here.\n\nWe certainly read the papers like the rest of you do. But we also have customers everywhere who can't keep up with demand. I mean, we have a customer visit center here at PTC on the 17th floor, and it was completely packed today. We had six day-long meetings going on in parallel.\n\nWe only have the capacity for six. I'm on the board of an automotive supplier, and recently, we're reviewing the IHS forecast. And IHS is forecasting the auto industry to grow 2% to 6% next year. We're a big supplier to defense companies.\n\nIn fact, two of the companies that were here today were defense companies, and they can't keep up with the volume and their customers are asking for more and more and more. I was in Europe last week, and I visited a couple of clean energy companies. And again, because of what's going on in the energy industry, whether it's clean energy or not clean energy, there's a lot of action happening. People who used to ship gas through pipelines now need to ship it through ships.\n\nAnd so that creates a whole bunch of new demand for, for example, big compressors that sit on chips. We have a customer who makes those. I visited a wind turbine company, and they think their sales are going to triple over the next 10 years because of their desire for clean energy. I went to a truck company, and they can't keep up with demand for diesel trucks.\n\nMeanwhile, they have enormous demand for electric trucks because all these e-commerce companies, Amazon, Target, whatever, really want their packages delivered in electric vehicles. And so all these fleets are trying to move to electric. So I'm just saying, Steve, there's the headlines and then there's everything else we see and everything else really is quite encouraging. But we're trying not to be Pollyanna.\n\nWe're trying to be aware of the headlines that could, in fact, impact us, so we tried to model it in.\n\nSteve Tusa -- J.P. Morgan -- Analyst\n\nOne last quick one. On a look back to 2Q and any kind of impact from the price increases that you saw on a postmortem on that?\n\nJim Heppelmann -- Chief Executive Officer\n\nYes. Kristian, have you tried to size at all the impact of the price increase since Q2?\n\nKristian Talvitie -- Chief Financial Officer\n\nYes. I think it's probably high single-digit million worth of impact in fiscal '22.\n\nJim Heppelmann -- Chief Executive Officer\n\nSo that would be 0.5 percentage point of growth, let's call it.\n\nSteve Tusa -- J.P. Morgan -- Analyst\n\nOK. Great. Thanks a lot. Appreciate all the details.\n\nVery helpful. Thank you.\n\nJim Heppelmann -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nYour next question comes from the line of Ken Wong with Oppenheimer & Co.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nGreat. Just a quick question. I realize macro is going to get beat like a horse here, but you saw a little bit of SMB weakness in Europe. I guess what -- has that been baked into potentially spreading elsewhere? Or are you guys fencing it off in Europe for now in terms of the guidance?\n\nJim Heppelmann -- Chief Executive Officer\n\nNo, no. I think we're -- if you look at our guidance scenario, the best case shows a substantial slowdown in bookings momentum. And the worst case shows a substantial decline in bookings. And that would have to happen somewhere.\n\nAnd I can imagine it would start in SMB globally and work its way into bigger accounts. So we're giving you a guidance range that the entire range is well below sort of the level of performance we've had for a while now. And again, it's really just based on conservatism. There's not a lot of science, though, behind it because like I said, there's no science.\n\nThere's no data actually that supports taking the range down that low. It's just being prudent because of everything we read and everything we hear.\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nGot it. OK. Really appreciate that, Jim. I'll circle back in the queue.\n\nThanks, guys.\n\nOperator\n\nThat is all the time we have for questions today. I will now turn the call back to Jim Heppelmann. I do apologize.\n\nJim Heppelmann -- Chief Executive Officer\n\nYes. Thanks, Angela. So listen, everybody, I'm sorry, we didn't give more time for questions today. We had a lot of content.\n\nWe allowed Kristian to spend a little bit of time on an accounting lesson there because we think people are going to ask the question, how do you get a 35% free cash flow growth of flat revenue and flat margins? And the simple answer is revenue is noise. Free cash flow at PTC is based on ARR and we have substantial increases in our free cash -- our cash contribution margins against growing ARR. So the math works, but we want to make sure you understood that, so it didn't leave lingering questions. But anyway, we'll hopefully see most of you, all of you in two weeks when we have our investor day.\n\nWe'll go a little bit deeper into the business strategy, as I said, and then we'll get into some midterm guidance. We're going to guide fiscal '23, '24 and '25. And again, I don't want to preview that content now, but I think it's a positive story. You probably can sense that we feel good about the business.\n\nSo thanks a lot for your time. Sorry, we didn't have more time for questions, and we look forward to following up with you in two weeks or in whatever forums and venues happen before that. Thanks a lot.\n\nKristian Talvitie -- Chief Financial Officer\n\nThanks all.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nMatt Shimao -- Head of Investor Relations\n\nJim Heppelmann -- Chief Executive Officer\n\nKristian Talvitie -- Chief Financial Officer\n\nSteve Tusa -- J.P. Morgan -- Analyst\n\nKen Wong -- Oppenheimer and Company -- Analyst\n\nMore PTC analysis\n\nAll earnings call transcripts"
}