{
  "companyName": "Elanco Animal Health Inc.",
  "companyTicker": "ELAN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/elanco-animal-health-inc-elan-q3-2022-earnings-cal/",
  "content": "Elanco Animal Health Inc. (ELAN 0.83%)\nQ3 2022 Earnings Call\nNov 08, 2022, 8:00 a.m. ET\n\nOperator\n\nGood morning. My name is Rob, and I'll be your conference operator today. At this time, I'd like to welcome everyone to the Elanco Animal Health's third quarter 2022 earnings conference call. [Operator instructions] Katy Grissom, head of investor relations, you may begin your conference.\n\nKaty Grissom -- Head of Investor Relations\n\nGood morning. Thank you for joining us for Elanco Animal Health's third quarter 2022 earnings call. I'm Katy Grissom, head of investor relations. Joining me on today's call are Jeff Simmons, our president and chief executive officer; Todd Young, our chief financial officer; Ellen de Brabander, our executive vice president of innovation and regulatory affairs; and Scott Purucker from investor relations.\n\nThe slides referenced during this call are available on the investor relations section of elanco.com. Today's discussion will include forward-looking statements. These statements are based on our current assumptions and expectations and are subject to risks and uncertainties that could cause actual results to differ materially from our forecast. For more information, see the risk factors discussed in today's earnings press release, as well as our latest Form 10-K and 10-Q filed with the SEC.\n\nWe do not undertake any duty to update any forward-looking statement. Our remarks today will focus on our non-GAAP financial measures. Reconciliations of these non-GAAP measures are included in the appendix of today's slides and in the earnings press release. After our prepared remarks, we will be happy to take your questions.\n\nI'll now turn the call over to Jeff.\n\nJeff Simmons -- President and Chief Executive Officer\n\nThanks, Katie. Good morning, everyone. In the third quarter, the Elanco team executed well on the controllable aspects of our business. Starting on Slide 4, we continued to drive progress on our innovation, portfolio, and productivity, or IPP, strategy, demonstrated by the momentum in our pipeline and the productivity we delivered.\n\nThrough relentless execution on our productivity agenda, we delivered 5% growth in adjusted EPS and expanded adjusted EBITDA margin by 120 basis points, despite a 4% constant currency sales decline in the third quarter. Adjusted EPS and adjusted EBITDA were both above the midpoint of our guidance. However, in the quarter, we saw most of the same macro concerns we called out in August worsened compared to our expectations. The U.S.\n\ndollar continued to strengthen, China's COVID lockdowns did not improve in the quarter, and the global economic slowdown accelerated, impacting Europe and the U.S. pet retail OTC markets. Despite these macro pressures, Elanco progressed the controllable initiatives that will drive our future growth and value. On the R&D front, we initiated a submission to the FDA for our broad spectrum parasiticide, are finalizing a submission for our JAK inhibitor dermatology product expected before the end of the year, and are advancing our IL-31 short-acting monoclonal antibody in dermatology toward a submission in the first half of 2023.\n\nWith these three products, plus our parvovirus monoclonal antibody and exterior, we see a path toward having five potential blockbuster products approved in the U.S. by the first half of 2024. Additionally, we expect approval for at least three new OTC pet retail products in 2023. On the debt side, we paid back nearly $170 million of gross debt in the third quarter, with gross debt pay down of $500 million to $525 million expected for the full year.\n\nFinally, we've accelerated our plans for go-live on the Bayer systems integration by one quarter to early Q2 2023. Our pipeline and productivity efforts exceeded expectations this year. Importantly, Elanco has held market share in line with our expectations in certain markets. Pricing increased in the third quarter, with 4% growth in pet health and 3% growth in farm animal.\n\nAnd we expect 2 points of top-line growth from price for the full year. We believe price growth and sustained market share are key during challenging environmental conditions, and Elanco is executing on these. Despite our success on the controllable aspects of our business, the worsening economic conditions and less-than-expected improvement in China has led us to reduce our financial guidance for 2022. You can see the drivers detailed on Slide 6, and Todd will provide more information later in the call.\n\nBefore turning a call to Ellen and Todd, I want to address Seresto. Since the initial story about the product was published in USA Today about 18 months ago, Elanco has worked vigorously, using a science-based approach to address and defend the safety profile of Seresto. Numerous studies, detailed pharmacovigilance data analysis, and expert evaluations overwhelmingly support the safety of the product. We know the EPA is finalizing their review of data and analysis for Seresto.\n\nWe look forward to collaborating on brand stewardship and oversight for Seresto, as the product provides a safe and affordable solution to protect pets from fleas and ticks, which can transmit diseases to both pets and people. Elanco is in active communication with the EPA on brand stewardship and oversight opportunities. Elanco is as confident as ever in the continued registration of the product. While the routine registration reviews of the active ingredients in Seresto remain ongoing, we do not believe these evaluations will result in any changes in pet product uses.\n\nGiven the sustained value and efficacy provided, we expect Seresto to stabilize in 2023 and continue to be Elanco's largest individual product. Now, let's transition to the driver of Elanco's future growth: innovation. Dr. Ellen de Brabander, our executive vice president of innovation and regulatory affairs, joins us today.\n\nOver the last year, Ellen has leveraged her experience and expertise to integrate and reshape our R&D organization, implementing a disciplined approach to prioritize the portfolio and optimize resource allocation. Today's call further demonstrates proof points that Elanco is creating a disciplined and reliable innovation capability positioned to deliver consistent innovation that addresses unmet needs in the animal health marketplace. Under Ellen's leadership, this team has delivered remarkable progress on our late-stage development products and advanced new early stage programs from research into the development phase, which supports the longer-term innovation opportunity. With that, I'll turn it over to Ellen.\n\nEllen de Brabander -- Executive Vice President of Innovation and Regulatory Affairs\n\nThank you, Jeff. I'm pleased to join the call today. We have made tremendous progress advancing the One Elanco R&D organization, moving past the integration of the legacy organizations and now entering a more stable phase. Our intent is to consistently deliver high-impact innovation through differentiated and portfolio-enhancing new products and through life cycle management of our key brands.\n\nWe have a strong innovation pipeline, striking the right balance between research and development projects and between pet health and farm animal projects. Personally, I'm very pleased with the progress we have made in the last year and the potential I see for this organization to deliver consistent innovation, fueling Growth for Elanco. Elanco's next year of innovation is truly exciting. Recently, we expanded the pipeline with robust entries from research into development, where we have established proof of concept in the target species for several products that we believe are first-in-class or best-in-class opportunities.\n\nWe have also expanded the pipeline via strategic partnerships, like our exclusive licensing rights for Bovaer for methane reduction in cattle in the U.S. and other early stage opportunities in targeted areas. I believe these differentiated assets, combined with our enhanced technical capabilities, will drive sustained growth from innovation beyond our current late-stage pipeline. Today, I will provide an update on five late-stage development programs we are pursuing for the U.S.\n\npet health veterinary market, of which four are already in the submission or approval phase. First, an update on Bexacat, the feline diabetes product we announced in our August call. This product is expected to be the first SGLT-2 inhibitor to be introduced in the U.S. animal health markets.\n\nThe regulatory process has progressed faster than anticipated, and we now expect FDA approval before year end, with our U.S. pet health team preparing for an early 2023 launch. Moving to our parvovirus treatment, Elanco and the USDA recently agreed to focus on conditional approval to expedite product availability in the market, confirming the significant unmet customer needs to address this deadly disease in puppies and dogs. We expect the conditional federal approval late this year or in early 2023, with the U.S.\n\nlaunch planned in the first half of next year after state approvals are completed. Given the unmet needs, the unique value proposition and opportunity for expansion to international markets, we believe this product could be a global blockbuster. The parvovirus this treatment is Elanco's first monoclonal antibody and will be internally manufactured. This facility is also expected to manufacture our future monoclonal antibody products, including the IL-31 for dermatology.\n\nWe strongly believe in the significant potential for monoclonal antibodies in animal health, given their specificity and selectivity. And we will continue to build out and enhance this platform across Elanco. Transitioning now to our three key late-stage development products in parasiticide and dermatology. First, in parasiticide, I am pleased to share that we have initiated the submission of our combination flea, tick, heartworm, and other intestinal parasites prevention product to the FDA.\n\nWe expect the product will demonstrate positive differentiation compared to the combination in the ectoparasiticides products available already on the market today. In dermatology, we plan to initiate submission to the FDA for our JAK inhibitor before the end of this year. We expect the product to demonstrate positive differentiation compared to the current market incumbents. Additionally, we are pleased in the progression of our other dermatology asset, IL-31 short-acting, our second monoclonal antibody.\n\nAnd we expect to initiate its submission to the USDA in the first half of 2023. We believe that parasiticide in both dermatology products are blockbuster potential innovations with a path toward approval in the U.S. by the first half of 2024. In addition to our vet-focused development projects, we are advancing our innovation efforts in the over-the-counter U.S.\n\npet health market with the investment in life cycle management for our key brands. We work closely with our commercial colleagues to identify opportunities that leverage the strong Advantage brand name and see many refresh opportunities to further drive value. Advantage XD, the extended duration spot on products for cats, launched in October. We expect approval for at least three additional OTC products across the U.S.\n\nand Europe in 2023, expanding reach to new customer segments interested in convenience and value as we leverage our regulatory brand and channel strengths in over-the-counter markets globally. Innovative new treatments and differentiation in established basis are key to the value proposition we deliver to veterinarians and pet owners. We have a strong pipeline and a capable focus team, which I believe will fuel Elanco's next era of growth in both pet health and farm animal. We look forward to sharing continued updates on the progress of our pipeline.\n\nAnd with that, I will hand it over to Todd.\n\nTodd Young -- Chief Financial Officer\n\nThank you, Ellen. And good morning, everyone. Today, I'll focus my comments on our third quarter adjusted measures, so please refer to today's earnings press release for a detailed description of the year-over-year changes in our reported results. Starting on Slide 9, we delivered $1.028 billion in revenue, a 9% decline, or 4% decline in constant currency, with 3% growth in price.\n\nForeign exchange rates represented a headwind of $61 million in the quarter, or 5%, in line with our expectations in August guidance. Slide 10 breaks down our revenue performance by species, and Slide 11 provides revenue by region in the quarter. For pet health, we declined 7% in constant currency for the quarter, with volume declines in our parasiticides portfolio, partially offset by 4% price growth and growth in our pain portfolio. Our U.S.\n\nbusiness declined 8% compared to last year, primarily due to competitive and overall retail channel pressure. Our international business declined 5% in constant currency, primarily driven by the economic slowdown in Europe. While the overall 7% decline in constant currency was in line with our second quarter performance, it was significantly lower than our August expectations of approximately flat globally year over year for the quarter. The underperformance to our guidance was driven by the accelerating global macro-driven impacts from the economic slowdown in Europe and the continuation of restrictions in China, as well as macro pressures impacting the U.S.\n\nretail channel. In the third quarter, the Advantage family of products and Seresto declined 13% and 14% in constant currency, respectively, or $15 million and $8 million. In the U.S., available market data shows the OTC retail market down for the parasiticides overall. We believe there are three key trends driving this: economic-driven consumer behavior, moving from prevention to treatment and to lower-cost options; retailer inventory management across categories; and broader competition from prescription options.\n\nOutside the U.S., we believe the year-over-year decline is driven by the economic slowdown that has emerged, primarily in Europe from higher energy costs and consumer inflation. On a constant currency basis, we expect stabilization going into 2023 for both Seresto and the Advantage family, driven by price improvement, return of supply from the paper and packaging issues we remediated earlier this year, opportunities for expanded physical availability, and introduction of innovations like Advantage XD for cats. We will continue to monitor and respond to the macro dynamics in these important markets. While the pet retail market is experiencing pressure, we believe meeting customers where they want to shop with effective products at multiple price points provides us opportunity for long-term growth and profitability to complement our core business and pet clinics.\n\nOur best estimates suggest that manufacturer sales in the U.S. retail for OTC products is about a $1 billion market annually, which is approximately 25% of the total U.S. parasiticide market. In the U.S.\n\nand globally, we expect prescription products to remain the largest part of our overall pet portfolio, with tailwinds over time for the products Ellen mentioned earlier. On a year-to-date basis, the global pet health business declined 4% in constant currency. And while the parasiticide business remains challenged overall, the global Credelio franchise across dog, cat, and Credelio Plus grew 16%. Our pain portfolio grew 11% year to date, driven by Galliprant dispensing, outgrowing the market in the U.S., in combination with Zorbium's continued strong launch.\n\nFor the quarter, our farm animal business was flat at constant currency with 3% price growth. Increased demand for poultry products and strengthening aqua portfolio was offset by supply constraint for certain cattle vaccines in the U.S. and a continued decline in swine in Asia. Both our U.S.\n\nand international farm animal business was flat in the quarter. Overall, ruminants outperformed our expectations, primarily driven by Rumensin in cattle and the continued strong season for sheep in Australia. Poultry and aqua also outperformed expectations on a constant currency basis, helping to offset continued challenges in swine in Asia. On a year-to-date basis, Elanco's global farm animal business grew 1% in constant currency, with growth in poultry, aqua and cattle, and U.S.\n\nswine, partially offset by the double-digit decline in international swine, primarily in Asia. Overall, in farm animal globally, Elanco is holding or gaining market share in line with our expectations. Our innovation sales continues to track toward our August expectations of between $100 million and $130 million for the full year. Experior sales more than doubled sequentially in the third quarter compared with the second, and all leading metrics related to commercial uptake, reorder rates, and customer negotiations remain positive.\n\nSlide 12 further summarizes our financial performance for third quarter. In line with the decrease in reported sales, gross margin declined 160 basis points to 54.1%, primarily driven by inflation and input costs, freight and conversion costs, and unfavorable product mix. These were partially offset by productivity efforts across our manufacturing footprint and improved price. Operating expenses for the quarter was $376 million, a reduction of 14% year over year or $60 million.\n\nThe impact of FX on expenses was approximately $20 million favorable in the third quarter, or a 5% benefit year over year. Our R&D spend continues to be in a reasonably tight range of about $80 million per quarter this year. With respect to SG&A, we are pleased with the productivity mindset demonstrated by our team as synergies, integration, and restructuring actions continue to deliver above expectations. Our execution on the integration of the legacy Bayer Animal Health business and Elanco's ERP system, business processes, and shared service centers is progressing well.\n\nAnd we accelerated the timing of our go-live to early in the second quarter of 2023 from the middle of the year. Adjusted interest expense was $58 million in the quarter, a year-over-year decline of $2 million. The sequential increase from the second quarter of this year was $8 million, driven by higher interest rates on our floating rate debt. I will provide more details on the debt portfolio in a few moments.\n\nThe non-GAAP effective tax rate was 16.7% for the quarter, lower than our expectations, resulting from multiple discrete benefits in the quarter. We now expect the full year non-GAAP effective tax rate to be between 23% and 24%. Adjusted net income was $96 million, and adjusted EPS was $0.20 for the quarter. The $3 million increase in our adjusted net income was driven by the execution of our productivity agenda, more than offsetting the negative impact of a lower top line and stronger dollar as you move down the income statement, plus the lower tax rate.\n\nAs a reminder, approximately 25% of the $61 million in top-line foreign exchange headwinds in the quarter, or approximately $15 million, falls through to impact net income. Adjusted EBITDA was $205 million in the quarter, or about $10 million, better than the midpoint of our guidance, with margin expansion of 120 basis points. In the third quarter, our productivity initiatives across Elanco helped our adjusted EBITDA to decline just 3% despite a 9% decline in reported sales and a 12% decline in gross profit. Gross profit declined more than sales as a result of the unfavorable revenue mix from the lower pet health sales and higher inflation that we had faced over the last year on cost of goods sold.\n\nWe believe inflation has stabilized in the third quarter, and we continue to expect it to be in line with the $140 million we shared in August. Now, let's transition to our updated outlook for 2022 on Slide 14. As part of our guidance in August, we expect that the fourth quarter would represent a reversal of the constant currency sales decline from the last two quarters. However, because of the worsening macro environmental factors impacting Europe and our U.S.\n\npet health retail business, continued COVID lockdowns in China, and the strength of the U.S. dollar, we are reducing our full year revenue guidance by approximately $100 million. The bridge from the August guidance can be found on Slide 15, but let me provide context on the pressures that have intensified. In Europe, our business increased 1% in the first half of 2022, but declined 9% in the third quarter as a result of the economic slowdown in the region.\n\nWe have seen similar sellout data across the pet health market in several of our top countries in the region, generally in line with Elanco's results. In August, we expected China to decline 1% for the full year. However, despite a deceleration of the decline of the swine business in the third quarter compared to the first half of the year, the continued COVID-19 lockdowns and protein producer profitability pressures are impacting our China business more than our August expectations in the second half, leading us to update our outlook for China to be a 16% to 18% decline for the full year. Finally, in U.S.\n\nflea and tick over-the-counter retail channels, available data shows the market overall has experienced an accelerated decline year over year in the third quarter, as consumers have reduced basket sizes and shifted to lower-cost treatment options. The rest of our assumptions from our August guidance update remain largely intact. And for the full year, we now expect revenue to be between $4.385 billion and $4.43 billion, reflecting an expected 3% constant currency decline year over year at the midpoint. The bridge to 2021 can be found on Slide 23.\n\nAs you can see from the bridge on Slide 16, we now expect adjusted EBITDA to be between $1.01 billion and $1.045 billion for 2022, or approximately a $53 million reduction from the midpoint of the range from our August guidance. The stronger U.S. dollar drives approximately $6 million of the reduction, while the rest of the reduction is the net of our third quarter overachievement, offset with the gross margin drop-through from lower expected fourth quarter revenue and operating expense favorability. We now expect adjusted diluted EPS of $1.01 to $1.07 for 2022, which is a $0.06 reduction compared to the midpoint of the range from our August guidance.\n\nThe stronger U.S. dollar is driving approximately $0.01 of the reduction, while the other $0.05 is driven by the sales reduction, partially offset by a small amount of productivity and the operational overachievement in the third quarter. Our fourth quarter guidance is detailed on Slide 17. Finally, we expect to file our 10-Q in the coming days, but let's move to the cash flow and balance sheet metrics on Slide 19.\n\nIn the third quarter, our operating cash flow was $189 million, reflecting the lower reported net loss in the quarter year over year and a benefit of a net $73 million from a cash interest rate swap settlement. The swap settlement provides a cash benefit in the third quarter that will create a headwind in operating cash flow over the next four years as this cash acceleration reverses. The volatility in interest rates in both the second and third quarters allowed us to take advantage of our floating to fixed interest rate swaps being in the money to restructure the swaps and accelerate the cash benefit of the financial position, which allowed for greater debt paydown than the third quarter. Excluding the swap benefit, operating cash increased $27 million over the third quarter of 2021.\n\nWe ended the quarter with $5.51 billion in net debt, a reduction of $121 million compared to the second quarter of 2022. Our net debt to adjusted EBITDA ratio at the end of the third quarter was 5.2 time. On Slide 20, you can find detail on our current debt profile and interest rate swap positions. On debt paydown, reducing debt is expected to remain our primary capital allocation priority.\n\nThis year, we expect to repay approximately $500 million to $525 million in gross debt and improve our net debt position by approximately $350 million. Our net leverage is expected to be 5.2 to 5.3 times at the end of this year, down from 5.5 times adjusted EBITDA at the end of 2021. The impact of the stronger dollar has reduced our net cash balance by $49 million compared to the year-end 2021. In 2023, we have roughly $400 million in debt maturities, with limited additional obligations until 2027.\n\nWe remain confident in the durability and cash generation of the business and our ability to continue to reduce debt and meet our obligations. With that, I'll hand it back to Jeff.\n\nJeff Simmons -- President and Chief Executive Officer\n\nThanks, Todd. Elanco's relentless focus on the key controllable aspects of our business is evident in our productivity, improved contribution from pricing, and operating expense control, allowing us to guide to expanding EBITDA margins and additional debt paydown for the full year. We are advancing our pipeline, accelerating our systems integration, and holding market share in line with our expectations. All these set Elanco up for the next era of innovation and growth.\n\nAs we look to 2023, I want to provide our early considerations on Slide 21. The macro environment across the world continues to be uncertain, with likely continued pressure in Europe and U.S. pet retail markets, a competitive marketplace, increasing interest rates, and volatile foreign currency markets. Offsetting these headwinds, Elanco's ability to reach the world's animals and competitive portfolio are well-positioned.\n\nWe are holding share in line with our expectations and expect to see improvement aligned with global macro conditions. Second, we see stabilization as we continue to capture value from pricing actions. Tailwinds from more consistent supply and our market position in China sets us up well for when COVID-related pressures subside. Third, as you heard from Ellen, we are making great strides in advancing our pipeline.\n\nWe expect to continue to ramp the launch of innovative products, like Experior, Zorbium, and Advantage XD for cats, while expecting to introduce Bexacat, our parvovirus treatment, and several other over-the-counter prescription and portfolio-enhancing innovations. We believe there is a path as well to have five potential blockbuster products approved between now and the first half of 2024: Experior, our parvovirus product globally, broad spectrum parasiticide, and the JAK inhibitor, and IL-31 dermatology products. Fourth, our continued productivity efforts and the expected decrease in inflationary pressures on our manufacturing cost, as well as our systems integration, will be important for our continued margin expansion efforts. And finally, next year, the organization will prepare for the expected launches of our late-stage pet health blockbusters in the industry's largest markets, U.S.\n\nparasiticide and dermatology. We will achieve this by making the right investments in R&D, manufacturing in our systems, and in our launch capabilities. The Elanco team is focused on controlling the controllables, advancing our capabilities in manufacturing, marketing, and sales execution, while delivering new products from our pipeline. This team is embracing the opportunities in front of us and looking forward to this next era of growth.\n\nWith that, I'll turn it over to Katy to moderate the Q&A.\n\nKaty Grissom -- Head of Investor Relations\n\nThanks Jeff. We'd like to take questions from as many callers as possible, so we limit yourself to one question and one follow-up. Operator, please provide the instructions for the Q&A session, and then we'll take the first caller.\n\nOperator\n\n[Operator instructions] Your first question comes from the line of Mike Ryskin from Bank of America. Your line is open.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. Thanks, Jeff. For my first question, I want to talk about just the core portfolio in the third quarter and for the year, specifically.\n\nI mean, you keep commenting that you're holding share, and you're not seeing any significant share losses, and the majority of the fiscal year guide reduction is tied to macro conditions or all, essentially, kind of a macro environment, and yet we're just -- we're not seeing the same magnitude of those economic impacts on some of your peers that reported, both private and public. So, you know, is there a possibility here that you're just seeing a pretty significant share shift from OTC into prescription into the vet clinic, given that's where some of the competing products are launching? Because in that case, that's not going to necessarily going to reverse as the economy gets better. Just more about what's going on in the parasiticides space and sort of like your comments on maintaining share versus where you could be seeing share losses. Would appreciate some color there.\n\nJeff Simmons -- President and Chief Executive Officer\n\nYeah. Thanks, Mike. It's right -- that's the right question. And we spent a lot of time analyzing this.\n\nAnd what we would emphasize is, share in line, you know, with our expectation. And let me share a little bit at a high level. Again, we see the worsening environmental or economic conditions in the EU and pet retail contributing to this, as well as the worsening conditions relative to our expectations in China and the lockdowns. So, when you break those down, that's where we're seeing the lost sales.\n\nWhere we're not seeing the lost sales is as you look at markets like U.S. farm animal, when you look at pet pain, you know, when you look at even just the overall biological pet vaccine market, you know, we are holding or growing share there on a relative, you know, sales basis. Just a couple of metrics that we're looking at, first of all, in the EU, when we look at actually sell-out data, which has all industry data in it, we see the declines were very consistent with the industry declines country by country across Europe. And so, when we look at that, there's no question, you know, we see the consistency of us versus our competition in that category.\n\nAnd then, as you look at pet retail, the same thing. As we analyze both the data on in-store as well as e-commerce, those declines are very consistent competitors versus ourselves. So, when you look at the dollar decline that we're noting in this guide and the worsening, it's in those categories. On China, the lockdowns, we expected to lessen and improve.\n\nAnd they actually -- we have 60-plus cities in China in that August-September window actually continue, they worsened. So, the improvement we were expecting did not come. Again, we're going to watch share closely. But as a whole, we continue -- as we compare to our competitors, continue to see ourselves holding share in the other markets relative to our expectations.\n\nKaty Grissom -- Head of Investor Relations\n\nThanks. Mike, did you have a follow-up, or should we go on?\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nYes. Yes, sorry.\n\nKaty Grissom -- Head of Investor Relations\n\nOK.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nWanted to go one at a time.\n\nKaty Grissom -- Head of Investor Relations\n\nThank you.\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nI appreciate that. So, for the follow-up, on the approval timing for the parasiticides, great to see that you have that regulatory submission. But, you know, you keep talking about 12 to 18 months for the approval process and kind of give some more comments when you talk about early '24 approval, multiple other companies in recent months and quarters have had delays in terms of approvals. So, we're just, you know, wondering, as you think through that 12 to 18-month time frame, how much confidence is that? What sort of the confidence then it will be within 12 to 18 months versus 18 to 20, or 18 to 24? You know, will you be able to provide updates on that as that progresses? How much is the ability will you have into that? And also, your comments on these products being differentiated, you continue to emphasize that.\n\nAgain, any color you can give on how they'll be differentiated, this is the JAK and the broad spectrum, that would be appreciated. Thanks.\n\nKaty Grissom -- Head of Investor Relations\n\nYeah. Good. So, let's start with Ellen on the timeline and kind of how we think about differentiation.\n\nEllen de Brabander -- Executive Vice President of Innovation and Regulatory Affairs\n\nYes. Thanks for the question. I'm excited to share with you the progress we have seen in this -- in the broader R&D organization. We have a great team.\n\nWe have a great pipeline. We are building a great organization. And as you have seen from the results shared in the call, we also are making great progress. And one of the projects where we see great progress is indeed the broad spectrum parasiticides.\n\nWe are very excited about the data we have generated this year so far. We have done the first submission today to the FDA. And as you know, these are all insufficient. So, in general, it takes 12 to 18 months before we have the final approval for the -- from the FDA for these innovations.\n\nBut based on our experience and based on the data we have generated, we are indeed confident that we see a path forward to get the approval in the first half of 2024 for this project.\n\nKaty Grissom -- Head of Investor Relations\n\nAnd then, maybe on differentiation, how we think about that here at Elanco.\n\nEllen de Brabander -- Executive Vice President of Innovation and Regulatory Affairs\n\nYeah. That's an important question, so thanks for that. You know, usually, when we talk about differentiation, we think in three different channels. One is in the efficacy part, the coverage, so how broad and how well does it actually treat the disease or prevent the disease.\n\nSecond is the safety part, and third is in the area of convenience, so onset of activity, duration of activity, a pill versus injection. So, those are all elements where you can differentiate and bring something new that is not yet available. So, that's exactly how we are focusing our innovation more and more to focus on best-in-class or first-in-class. And we are quite excited that those in the broad sector parasiticides, as well as in the JAK inhibitor, we are targeting positive differentiation versus products already in the market.\n\nKaty Grissom -- Head of Investor Relations\n\nThanks, Ellen. We'll take the question from the next caller.\n\nOperator\n\nYour next question comes from the line of Erin Wright from Morgan Stanley. Your line is open.\n\nErin Wright -- Morgan Stanley -- Analyst\n\nGreat. Thanks for taking the question. So, given the varying progress we've seen with certain product launches, what's a reasonable time frame to get to blockbuster status here for your upcoming parasiticide, as well as the derm launches? And have you ramped up from a manufacturing perspective? And what are incremental investments that you need to make on that front? And just on the JAK inhibitor, do you anticipate you'll be second or third to market in that space? And then, just lastly, on the retail side in U.S. pet health, how is the new retail strategy working out relative to your internal expectations? You gave us global numbers for Advantage and Seresto, but, presumably, the U.S.\n\nnumber fared differently. And how much of that is macro versus supply chain versus the new retail strategy? Thanks.\n\nKaty Grissom -- Head of Investor Relations\n\nGood. All right. Jeff, let's start with you here, progress on kind of the ramp for as we're thinking about for the potential blockbusters and then the JAK timing.\n\nJeff Simmons -- President and Chief Executive Officer\n\nYeah. Thanks, Erin. Great questions. Excited about the derm launch, as well as the broad spectrum parasiticide.\n\nOn derm, as you know, this is a growing big market. It will be primarily all accretive to Elanco. We do have positive differentiation, and we'll have a portfolio coming, both in the IL-31 short-acting and the JAK, as well as a future pipeline to follow. So, we're excited about that.\n\nListen, you can be assured that we will be -- and expect to be launch-ready by the end of 2023. And we're looking at that in a multitude of dimensions. First, on manufacturing. We've got the manufacturing plant in place, and that is working and coming together, supply chain, the marketing, and selling.\n\nAs you know, in the U.S., we really even -- as we look at launching Zorbium right now, we're using digital. We're making sure share of voice is right. We're going to follow that with parvo and now the first SGLT-2 inhibitor. So, those same capabilities are really starting to build a muscle.\n\nWe'll be ramping those capabilities to be ready by the end of the year in 2023, so that we can, we believe, take significant share. And it will be tied to those capabilities. It will be tied to the differentiation and, of course, the investment as we enter the market. So, that's our expectation.\n\nAnd again, on the timing, you know, as said, the FDA, 12 to 18 months; the USDA, shorter than that. So, you know, we're -- we see, again, both of these compounds a path to the first half of 2024. We'll stay there at this point in time. Look, on pet retail, what I would share is that, you know, we come back to some of the message we conveyed early on Bayer, reaching pet owners where they want to shop.\n\nData like it's today are -- in our U.S. pet health business, about a third of it is retail. So, there's a balance. This is an and, not an or.\n\nWe've got, you know, still a third of pet owners not going to the veterinarian, and we have -- you know, that convenience factor is higher post-COVID than ever. So, we see what we're doing in pet retail, Erin, very importantly, and I would say significantly more today than when we bought it from Bayer as we brought in more expertise. We are, you know, working our value and our pricing at another level. We are, as Bobby Modi has come in, you know, physical availability, more stores, more shelves, more channels.\n\nThat's increasing significantly. And now, what's introduced on this call is proof points that Ellen has brought another dimension in, and we've developed now an OTC outside the vet innovation engine. We're bringing Advantage XD, an Elanco product with a Bayer brand. And then we're combining it, bringing three additional OTC products this next year between Europe and the U.S.\n\nSo, between innovation, marketing, channel expertise, yes, we're hit right now in the short term by a cycle. But we see, in the medium and long term, this playing nicely with all of our vet launches that we're expecting.\n\nKaty Grissom -- Head of Investor Relations\n\nAll right. Thanks. We'll take the next caller.\n\nOperator\n\nYour next question comes from the line of Chris Schott from J.P. Morgan. Your line is open.\n\nUnknown speaker -- JPMorgan Chase and Company -- Analyst\n\nHi. This is Katarina on for Chris. Thank you so much for taking our questions. So, the first is on the macroeconomic environment.\n\nCan you elaborate a bit on any notable differences when it comes to pet owner demand across geographies? How different are the dynamics that you're seeing in Europe, which you've highlighted are, you know, a little bit difficult comparing to what you're seeing like Latam, Asia, and other regions? And how does that compare to the U.S.? And then, my other question is on supply chain. It seems like this is a topic that has come into greater focus this quarter for the industry. Can you just elaborate a little bit of what you're seeing and what are the product lines that are seeing the most impact? And kind of where we are toward, you know, the resolution of this, and how quickly some of these issues can be worked through? Thank you so much.\n\nKaty Grissom -- Head of Investor Relations\n\nGreat. Thanks. Jeff, why don't you take the first one, just kind of on what we're seeing from a pet owner perspective across regions of the world? And then we'll go to Todd.\n\nJeff Simmons -- President and Chief Executive Officer\n\nYeah, I'll start. Thanks, Katarina. I mean, there's a lot there. What I would want to emphasize a few things is, just start really in the U.S.\n\npet vet market. Again, you've -- there's a lot of discussion on this. We've seen vet visits normalizing post-COVID, but spend continues to grow. This is an important factor.\n\nIt's indicating, we believe a willingness of consumers, still are, you know, willing to spend on their pets even under economic challenge. And we're seeing that in the U.S. vet market. Our adjustment in guidance is more around the pet retail side.\n\nIt's not anything different than our current assumptions that we see on the vet side. So, I want to emphasize that point. I think a few things that I would highlight that there's a little bit more price sensitivity that we're seeing in both the European and U.S. retail markets.\n\nAnd what's driving that are a few things. We're seeing a switch really from -- as the economic pressures increase, we're seeing a want to switch a little bit from prevention to treatment, some trade down where people will look for lower cost options, seeing some of the retailers in both geographies, you know, manage down inventories like other industries, and then some movements to broader Rx competition. So, those are the factors that we've seen. We look at the rest of the world outside of the COVID lockdowns in China and that impact, everything else is really for us seem pretty resilient overall.\n\nSpend continues to be pretty strong, Latin America, you know, Eastern Europe, and the Asia markets, Australian markets. So, again, overall, a robust marketplace. Retail is the area we're highlighting. We see this as cyclical.\n\nThis will recover as the economy recovers, and those are the factors driving it.\n\nKaty Grissom -- Head of Investor Relations\n\nTodd, on supply chain?\n\nTodd Young -- Chief Financial Officer\n\nCertainly. Thanks for the question, Katarina. Overall, our supply chain has stabilized in the last couple of months. As we called out on the last earnings call in August, we did expect some second half headwinds from supply mainly on third-party source product.\n\nThat has continued as expected. But overall, our internal production is doing better than it did in the first half of the year. All the paper and product supply issues we had in the first half have been resolved. And now, we have multiple suppliers for those products, which we believe will enhance our ability to effectively provide product next year, but also be in a spot to improve our procurement savings going forward.\n\nSo, overall, supply chain has stabilized as we noted on the slide. We expect that to be a positive next year, given the problems we had this year. The one item was some farm animal vaccines in Q3 with a little pressure on that in Q4, as well as our U.S. farm business.\n\nBut overall, as you saw in the U.S. farm business, its portfolio had a great quarter in Q3, especially across swine, poultry. And our cattle business did better than expected. So, again, that team is really delivering right now.\n\nKaty Grissom -- Head of Investor Relations\n\nThanks. We will take a question from the next caller.\n\nOperator\n\nYour next question comes from the line of Umer Raffat from Evercore ISI. Your line is open.\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nHi guys. Thanks for taking my questions. I have two today, if I may. First, I was just trying to think through supply challenges at Zoetis, sort of, and then, on the flip side, Merck reported a really strong animal health and a lot of tailwind in their parasiticide business.\n\nI would have thought you're experiencing some tailwinds on parasiticides as well. Could you speak to those dynamics? And were there any changes in any distribution model or inventory in Europe, etc., for you? And then, secondly, and this is minor, I'm probably reading into this. You might recall when you showed a pipeline slide at your investor day a couple of years ago. And for your Trio product, you had a very similar legend of those dark blue arrows, and -- but there were three arrows, meaning several hundred million implied for the Trio versus only one arrow today.\n\nAm I reading into it? Or is it fair to assume your view of commercial opportunity is unchanged, and you still do expect it to be a multi-hundred-million-dollar product? Thank you.\n\nJeff Simmons -- President and Chief Executive Officer\n\nYeah. Thanks --\n\nKaty Grissom -- Head of Investor Relations\n\nYeah. Go ahead, Jeff.\n\nJeff Simmons -- President and Chief Executive Officer\n\nThanks, Umer. Let me take the last question first just to be very clear. There is no change. You are reading into that.\n\nThere's maybe a change in graphics over the course of three years. We continue to see blockbuster potential. We see positive differentiation from, you know, all broad spectrums that are out there today. We're well-positioned.\n\nAnd today, compared to even during that investor conference, our capabilities in parasiticides to launch are much stronger, and we're a stronger company today in those capabilities. So, we expect to have a very strong launch as well. So, I'll start there, to be very clear and excited that the submission -- initial submission has been made. You know, relative to just the differences, I think there's differences in portfolios.\n\nThere's differences in geographies. What we would say is we're in line in parasiticides in the vet clinic with our expectations. We guided 70 million to 80 million down from competitive pressures, and we're still aligned with those expectations. No change.\n\nWe continue to see nice growth from Credelio globally. Credelio Plus is doing well internationally. Credelio and our portfolio is doing well relative to expectations. We saw nice growth with Credelio in the quarter, complemented candidly by extremely nice growth in pain.\n\nWe're taking share in the pain market here in the U.S. Got about just shy of 50% of our pain is non-Galliprant. So, Zorbium, Nocita, Onsior, that's doing well. And our vaccines have held well.\n\nSo, it is about pet retail. We see it cyclical. We see we're declining with the market in the data, very similar to the market. And we are doing what we should be doing, price, channel expansion in pet retail, and, more importantly, adding innovations that will bring value and convenience, which will fit the trends that we're coming after.\n\nKaty Grissom -- Head of Investor Relations\n\nGood. Thanks. We'll --\n\nJeff Simmons -- President and Chief Executive Officer\n\nAnd no -- let me also emphasize, I see that. I forgot the last question. No change in distribution. No change, inventory remains, very similar to all other quarters.\n\nSo, there's been no change in that at all. And again, as Todd just emphasized, our supply chain is stable and working.\n\nKaty Grissom -- Head of Investor Relations\n\nGood. Thanks. We'll take a question from the next caller.\n\nOperator\n\nYour next question comes from the line of Nathan Rich from Goldman Sachs. Your line is open.\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nHi. Good morning. Thanks for the questions. A couple of numbers ones and then one high level.\n\nAs we think about '23, should we think about the $80 million incremental revenue headwind that was put into guidance for the back half of this year related to Europe, China, and U.S. pet retailers kind of having to annualize into next year as we think about the right baseline for revenue, obviously, assuming no major changes in the macro environment? And can you quantify the impacts from higher R&D investments, FX, and interest expense on 2023? And then, at a high level, if I could just follow up on one of Ellen's prior comments. She mentioned the rolling submission process. Could you maybe just elaborate on what's needed for those future submissions? And are any pre-approval inspections required by the FDA for any of these products? Thank you.\n\nKaty Grissom -- Head of Investor Relations\n\nSure. Todd, let's start with some of the numbers in '23, or context, I should say.\n\nTodd Young -- Chief Financial Officer\n\nSure. Yeah, Nate, we appreciate the question. I understand everyone is already looking forward to 2023. We will provide our guidance for 2023 in February.\n\nToday, we did want to provide some context on the, you know, pushes and pulls we see going forward. With respect to your question on retail, we just remind everyone, we're out of season for the OTC products. This is a time when, you know, we have about 75% of Seresto sales in the first half of the year. So, much smaller base, and so we do want to caveat that as the timing where, given the economic pressures, easier to see someone making a choice to treat versus to buy the prevention, versus in the springtime when everyone is out with their dogs, going through the forests and hiking around.\n\nSo, we wouldn't necessarily say roll that into the base and just assume it. And then, with respect to China, we do expect that to get better. We all know and are following the China situation very closely. We feel very good about our competitive position on parasiticides, as well as where we fit with the large swine producers.\n\nAnd our team on the ground continues to diligently work through the challenges that come with the current environment. So, that end, we're not going to get into. And on FX, again, we've given our FX rate assumptions throughout. So, those are pretty easy to look at.\n\nIt is a headwind right now, given, you know, in the first half of the year, I would say euro was at about 105, just to provide context, versus the 97 parity that we've been seeing over the last couple of months. Interest expense will be higher on the P&L just from floating rate debt going up. And then, you know, from an R&D standpoint, we've been running at about $80 million a quarter. Ellen and her team have taken full advantage of the productivity and the reshaping and integrating of three legacy organizations from Bayer, Kindred, and Elanco into one.\n\nAnd we don't see, you know, a significant increase in that investment in order to drive the pipeline going forward. But I will say, to the extent we see items that will drive greater value from R&D, we'll certainly put money behind that. So, thanks for the question.\n\nKaty Grissom -- Head of Investor Relations\n\nYeah. And the second question kind of on submissions and pre-approvals of site. You know, we probably won't get into too much there, but Ellen just some -- may be some context on how you're thinking about it.\n\nEllen de Brabander -- Executive Vice President of Innovation and Regulatory Affairs\n\nYeah, thanks for the question. Indeed, you know, in order to get the approval, we need to do a number of submissions. We refer to those as rolling submissions because we don't have to do the submissions all at once. We have started the initial submissions for both our broad spectrum and parasiticides.\n\nWe will do one for our JAK inhibitor later this year. We expect to do the first one from our IL-31 short-acting early next year or the first half of next year. So, we are really entering that submission phase for each of those three projects. And part of the approval is indeed also that the regulatory agency involved will do an inspection of the manufacturing sites to basically build a confidence that, yes, we are able to manufacture the product in line with the shape that we submit.\n\nKaty Grissom -- Head of Investor Relations\n\nThanks. We will take the next question, please.\n\nOperator\n\nYour next question comes from the line of Balaji Prasad from Barclays. Your line is open.\n\nBalaji Prasad -- Barclays -- Analyst\n\nHi. Good morning, everyone. Thanks for the questions. Firstly, it's great to see the progress on the pipeline front.\n\nBut could you call out the opportunity size that you see in the market, both on the parasiticides side and the atopic derm side vis-a-vis the broader market size for these indications? Probably a bit more specifically, atopic dermatitis is going to be a function of market share gain, or would you be tapping into the nearly 40%, 50% market, which is still unaddressed? So, what would be the lower-hanging fruit for you? Thanks.\n\nKaty Grissom -- Head of Investor Relations\n\nGood. Yeah, Jeff?\n\nJeff Simmons -- President and Chief Executive Officer\n\nYeah, Balaji, great question, and we're spending a lot of time analyzing this and looking at some historical, you know, market archetypes, too. And no question, the first thing is when innovation comes into animal health into a market like derm, increased awareness will go up because share of voice will go up, marketing will go up. And so, that unaddressable market will expand. We're seeing that right now in pain as an example.\n\nPain in Europe is one of the faster-growing markets as an example. So, we see that happening in atopic dermatitis. You know, two is, you know, there's limited choices in a very large market. So, we're going to be able to provide veterinarians and pet owners increased choice.\n\nAnd then, third is differentiation. How we differentiate in the marketplace will be important, and then bringing it to the market, you know, equal or better than any launch we've ever had in what -- addressing the new approaches to the veterinarian and pet owners in the ways that they want to launch. So, those are all the factors that we see coming in. And, you know, very similar to parasiticides as well, there's still a global market that still has a lot of opportunity.\n\nAnd again, differentiation and our, you know, strength in multiple channels on parasiticides will also be very effective relative to launching this differentiated new broad spectrum parasiticide.\n\nKaty Grissom -- Head of Investor Relations\n\nGreat. Thanks. We'll take the next question.\n\nOperator\n\nYour next question comes from the line of Jonathan Block from Stifel. Your line is open.\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks, guys. Good morning. Maybe just a couple, and I'll ask them all upfront.\n\nTo begin, I think, Todd, I got the 2022 revenue guidance down about 100 million, EBITDA down 45 million to 50 million. So, the decrementals were close to 50%. And I think when I go back and I look at when you lowered '22 guidance last call in the 2Q, the decremental, I think, was closer to 30%. So, why the big step-up in the decrementals? Maybe you could talk to that bigger hit.\n\nIs it just a case of fewer levers to pull? Maybe a follow-up, I think the prior 2022 gross margin was 57.5% for this year. You missed this by a good couple of hundred basis points. Is there a new 2022 gross margin [Technical Difficulty]. Jeff, maybe just for you to end with, I know you called out global growth in Galliprant.\n\nBut a specific question, was it up year over year in Europe? Because clearly, that's where you're facing competition, and just I think it's an important data point as we think about competition eventually coming to the U.S. Thanks, guys.\n\nKaty Grissom -- Head of Investor Relations\n\nJeff, you want to start with Galliprant, and then we'll come back on the guide?\n\nJeff Simmons -- President and Chief Executive Officer\n\nYeah. Good question. Overall, Galliprant, nice growth globally in the quarter, driven by the U.S., without question. And we've seen continued double-digit growth overall on this brand in 2022 in the U.S., offset by, yes, we saw a slight decline in Europe.\n\nI would really emphasize a couple of things. We've got a different organization, and we're preparing a little bit more in the pain market in Europe. And two, there is a different label. We don't have the inflammation claim in Europe that we do in the U.S.\n\nSo, different labels, different approaches. But again, overall, we're expanding our pain portfolio and expanding capabilities in Europe over time. We continue to see nice growth ahead, both for Galliprant in the U.S., as well as for the pain sector overall.\n\nTodd Young -- Chief Financial Officer\n\nJon, thanks for the questions on the margin profile, the EBITDA flow-through. Two items. First, yes, less levers, less predicted savings late in the year. So, that is one of the items.\n\nAnd then the other is just the mix of products. With that retail being a big driver of the incremental change, that's one of our highest gross margin areas. And so, when that hits, there's a greater flow-through to the EBITDA side of things. And then, on the gross margin, yes, we'd expect for the full year to be about 100 basis points behind the previous guidance we gave in August as a result of both the Q3 being a little lighter than expected, plus then this incremental sales decline, deleveraging the fixed manufacturing cost base with the product mix.\n\nKaty Grissom -- Head of Investor Relations\n\nThanks. We'll take the next question.\n\nOperator\n\nYour next question comes from the line of Brandon Vazquez from William Blair. Your line is open.\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nHi, everyone. Thanks for taking the question. I wanted to focus on the macro conditions a little bit and maybe just get a little granular on kind of like the progression of macro headwinds you've seen over the past couple of months and as we go into the fourth quarter. So, I guess the question is, kind of, like, are macro conditions worsening.\n\nAre they kind of stabilized as we go into the fourth quarter? Trying to get a read of how things go into the end of the year and then how those macro headwinds progress through 2023?\n\nKaty Grissom -- Head of Investor Relations\n\nGood. Todd, let's have you started.\n\nTodd Young -- Chief Financial Officer\n\nBrandon, thanks for joining us for the new coverage universe from William Blair. Happy to have you on the side of us. On respect to the conditions, you know, we did call out these items from the global macro slowdown in August. We just under-told the impact.\n\nAs we look across Europe, it is, you know, getting more challenged, and we've seen that come through. As Jeff mentioned, we had a retailer in Europe shut down that's had an impact as a result of their retail space, as well as one in China. So, those are certainly ones that are impacting. As we look at our Q4 guide versus our Q3 guide, we do have Q4 down slightly more than Q3.\n\nBut overall, again, we've got it focused in the areas we called out in August. We just under-called them then. We feel good about the guidance we've provided today. And as we look to 2023, you know, we're excited about a lot of the innovation we're bringing to the retail channels, especially the U.S.\n\nAdvantage XD for cats being a long duration, spot-on treatment that we launched in October. And as the season comes in next year, you know, excited about what that product can do. So, a lot yet to play out over the next few months as we get into 2023.\n\nKaty Grissom -- Head of Investor Relations\n\nAll right. Thanks. We will take the next question.\n\nOperator\n\nYour next question comes from the line of Elliot Wilbur from Raymond James. Your line is open.\n\nMichael Parolari -- Raymond James -- Analyst\n\nHi, guys. This is actually Michael Parolari on for Elliot. Thanks for taking the question. Quick one for me today, just on the debt.\n\nI see via Slide 20 that cost of debt was 3.9% in the quarter, and you guys got about 70% of it fixed. Just wondering if you could tell us if you have it on hand, the effective rate between the fixed and the variable portion of the debt, and then, how to think about that going forward. Thank you.\n\nTodd Young -- Chief Financial Officer\n\nI don't have off the top of my head, Michael, the relative fixed rate versus floating. As you know, our fixed-rate coupons are reasonably high, given the coupon step-ups we had versus the face of those. And so, I believe -- you know, we did the tender earlier this year, which helped reduce interest expense overall in the year. So, you know, from that aspect, it's lower.\n\nI think we've got a LIBOR rate, you know, for the end of this year at, you know, projected to be about 4.77%. And our fixed rate is generally LIBOR plus 1.75. So, that gives you a feel for the floating rate debt. But if I step back, big picture, and look at our overarching debt profile, we've got 400 million due next year, then nothing until 2027 to speak of.\n\nWe're continuing to generate cash. We're continuing to pay down debt. We expect that will continue next year as well. So, you know, overall, we feel very comfortable servicing the debt we have.\n\nAnd we'll continue to look for ways to optimize our capital market strategy, much like we did by the interest rate swap transactions to accelerate cash inventory to pay down debt versus waiting for that to play out over time. So, again, I appreciate the question and feel good that we can manage through the higher level of debt that we expected when we started this year.\n\nKaty Grissom -- Head of Investor Relations\n\nThanks. I think that's all our questions. I'll turn it back to Jeff to close this out.\n\nJeff Simmons -- President and Chief Executive Officer\n\nYeah. I think the third quarter, without question, a worsening economic situation, China lockdowns, and a stronger dollar. But it really provided some significant proof points inside Elanco on where we're going as a company. The pipeline progress we know will be the biggest value driver.\n\nAnd to say that we have five potential path to five blockbusters from now through the first half of 2024 is one of the most significant things our company has seen. And it's in front of us, and we're in execution mode against that, but as well as market share and price being a focal point and improving supply situation. Our overall productivity that came through in opex and in the middle of the income statement, which led to cash and paying down debt. And I think I would like to also highlight a lot of the organization focused on standing up our systems to have one system and to be totally all integrated a quarter earlier by early Q2, all of this driving, expanding EBITDA and EPS.\n\nSo, we're controlling the controllables in a challenging environment. Thank you for your interest in Elanco. We look forward to continuing to engage with you in the future.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKaty Grissom -- Head of Investor Relations\n\nJeff Simmons -- President and Chief Executive Officer\n\nEllen de Brabander -- Executive Vice President of Innovation and Regulatory Affairs\n\nTodd Young -- Chief Financial Officer\n\nMike Ryskin -- Bank of America Merrill Lynch -- Analyst\n\nErin Wright -- Morgan Stanley -- Analyst\n\nUnknown speaker -- JPMorgan Chase and Company -- Analyst\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nBalaji Prasad -- Barclays -- Analyst\n\nJon Block -- Stifel Financial Corp. -- Analyst\n\nBrandon Vazquez -- William Blair and Company -- Analyst\n\nMichael Parolari -- Raymond James -- Analyst\n\nMore ELAN analysis\n\nAll earnings call transcripts"
}