{
  "companyName": "Fanhua Inc.",
  "companyTicker": "FANH",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/24/fanhua-inc-fanh-q2-2022-earnings-call-transcript/",
  "content": "Fanhua Inc. (FANH 1.93%)\nQ2 2022 Earnings Call\nAug 23, 2022, 9:00 p.m. ET\n\nOperator\n\nThank you for standing by for Fanhua's second quarter and first half 2022 earnings conference call. At this time, all participants are in a listen-only mode. [Operator instructions] After the management's prepared remarks, there will be a question-and-answer session. [Operator instructions] For your information, this conference call is now being broadcast live over the internet.\n\nThe webcast replay will be available within three hours after the conference is finished. Please visit Fanhua's IR website at irfanhuaholdings.com under the events and webcast section. Today's conference is being recorded. [Operator instructions] I'd now like to turn the meeting over to your host for today's conference, Ms.\n\nOasis Qiu, Fanhua's investor relations manager.\n\nOasis Qiu -- Investor Relations Manager\n\nGood morning. Welcome to our second quarter and first half 2022 earnings conference call. The earnings results were released earlier today and are available on our IR website, as well as on Newswire. Before we continue, please note that the discussion today will contain forward-looking statements made under the safe harbor provision of the U.S.\n\nPrivate Securities Litigation Reform Act of 1995. The accuracy of these statements may be impacted by a number of business risks and uncertainties that could cause our actual results to differ materially from those projected or anticipated. Such risks and uncertainties include, but not limited to those outlined in our filings with the SEC, including our registration statement on Form 20-F. We do not undertake any obligation to update this forward-looking information, except as required under applicable law.\n\nJoining us today are our chairman and chief executive officer, Mr. Yinan Hu; chief financial officer, Mr. Peng Ge; and chief operating officer, Mr. Lichong Liu.\n\nMr. Hu will provide a review of our financial and operational highlights in the second quarter of 2022. There will be a Q&A session after the prepared remarks. Now, I will turn the call over to Mr.\n\nHu.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nGood morning and good evening. This is Hu Yinan. Thank you for joining today's conference call.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nIn the second quarter of 2022, as we continued executing on our professionalization, career-based, digitalization, and open platform strategy and implemented a series of strategic initiatives, the efforts started to show some encouraging results with positive improvements across various operating metrics.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nOur insurance business grew 12.2% year over year to RMB 2.9 billion in gross written premiums, of which our life insurance first year premiums reached RMB 615.7 million, up by 43.7% year over year and 25% quarter over quarter. The growth was primarily driven by substantial increases in a number of high-performing agents and their per capita productivity.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nDuring the quarter, both the number of high-performing agents and the per capita performance indicators have enjoyed great improvement on a year-over-year basis. The number of three months 10,000 premium agents who are defined as those contributing over RMB 10,000 annualized premiums equivalent or APE monthly for three consecutive months during the quarter increased by 23.6% year over year with per capita productivity up by 33.3% year over year, while the number of 100,000 premium agents who are defined as those contributing over 100,000 APE during the quarter, increased by 41.2% year over year, with per capita productivity growing 6.3% year over year. Correspondingly, as we purposely reduced the number of nonperforming and low-performing agents, the total number of Fanhua's performing agents reduced by 37.6% in the second quarter of 2022. These are clear signs of the positive effect of our strategic focuses on serving mid- to high-end customers and high-performing agents.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nWith the steady progress in executing our new strategy, we were proud to deliver robust growth in our new business during the quarter, while operating income reached RMB 31 million, well exceeding our prior expectation. The year-over-year decrease in operating income was mainly due to: one, a loss of RMB 7 million within our claims adjusting segment due to impact of COVID-19 during the quarter, especially in our major business areas, we have failed to operate for quite a long time. So -- and also, we have a profit of RMB 3.5 million in the same period of last year. That is to say, we have been impacted income due to COVID-19 for about RMB 10 million in claims adjusting segment; two, an increase of investment in our Yuntong branches which correspondingly incurred a loss of RMB 15 million during the quarter; and three, our increased expenditure amounting RMB 10.3 million on refining our IT infrastructure to support digitalization of our operation and empower frontline operation of our agents.\n\nAlthough such investments may have increased our cost pressure, we believe it is necessary investments to strengthen capabilities. If excluding the impact of the above-mentioned factors, our operating income would have been approximately RMB 63 million, representing a growth of 34%, which again demonstrates that we are on track for future sustained growth.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nAfter over a year of implementation and continued refinement, our strategy is clear and pragmatic and the preliminary results have contributed to significant improvements of our brand image in the industry, further boosting the morale and confidence of our staff and sales force.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nBuilding on the preliminary achievements in the first half of 2022, we will focus on pushing forward the following strategic initiatives to further solidify our core competitiveness.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nOne, recruitment and training of top talent to build a highly productive sales force.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nFirstly, further expanding the coverage of Family Office Consultants, or FOC, and Family Retirement Planet or FRP training programs among high-performing agents while starting to initiate training and certification programs for Family Policy Managers, or FPC, which focus on helping agents to develop the ability to offer policy custody services, so as to help our agents transform from focused experts on insurance products to broader experts on family based asset allocation and then expanding to experts on elderly care and legacy management.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nSecondly, leverage our advantages in insurance trust services and healthcare services with the support of our well-proven 3R marketing model, i.e., account responsibility, solution responsibility, and fulfill responsibility and step-up efforts to attract industry top talents, especially million-dollar round table members, or MDRT, to achieve a target of 30% year-over-year growth in 100,000 premium agents.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nTwo, providing scenario-based trust, healthcare, and elderly care services facilitated by standardized 3R marketing procedures.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nFirstly, trust plus self-insurance. As of the end of June 2022, Fanhua has organized over 100 customer engagement activities and facilitated in setting up 123 trust accounts for over RMB 1.2 billion in trusted assets covering 215 new insurance policies with each trust account contributing one to two insurance policies on average and RMB 30,000 APE per policy. Our strategy of offering referral of insurance trust and family trust services to mid-to-high net worth customers have delivered significant results, establishing a good reputation in the industry and standing out with a competitive advantage. In the second half of 2022, in combination with our FOC training programs and the 3R marketing model, we plan to widely organize high-end customer engagement activities with the professional support of the 3R talent to provide a full suite of services from customer engagement, asset allocation planning, and solution making, setting up insurance trust accounts, to fulfillment and post-sale services.\n\nAs such, we expect to offer a closed loop of insurance trust services, making insurance trust accounts a new competitive moat for Fanhua.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nSecondly, health and elderly care plus insurance. Established in 2021, Fanhua's health management business unit is dedicated to pooling quality resources of medical and elderly care on the market to empower our partners, agents, and customers. In the first half of 2022, Fanhua has launched a wide spectrum of customer acquisition, acquisition products, and collaborated with providers of quality services such as cord blood bank and high-end medical service providers. Furthermore, we have made a breakthrough in securing access to quality elderly care facilities by sealing an in-depth cooperation agreement with the state-owned enterprise.\n\nIt also marks the first step for Fanhua to become an open platform for connecting small and medium-sized insurers with third-party health and elderly care service facilities. Into the second half of the year, we will make full use of these resources to facilitate scenario-based marketing by organizing on-site visits to healthcare and elderly care facilities for customers to experience quality lifestyles and related services, so as to stimulate their demand for wellness, health, retirement and legacy management solutions and thus, boost sales of insurance products.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nThirdly, upgraded Lan Zhanggui app to support digitalized operation. In the first half of 2022, our Lan Zhanggui app has been upgraded to a 3.0 version, a comprehensive platform that integrates customer engagement, customer service, trading support, online and offline operation, and professional training and personal branding. With the release of the Lan Zhanggui 3.0, we have observed significant improvement in the operational efficiencies with key performance indicators of the platform, also showing remarkable improvements. Specifically, the number of active agents on the platform were up by about 50% and has continued to increase.\n\nThe productivity of agents using our digital tools was nearly 1.5 times that of agents otherwise. And the productivity of agents that has become a Guanjia or insurance service butler was about 20% higher than that of those otherwise. All this shows that our digitalization efforts have been paying off.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nFor the second half of 2022, Fanhua will continue to improve our -- improve user experience by further optimizing key functions and making the system more stable and easier to use so as to support agents' activities more efficiently.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nInto the third quarter of 2022, while external factors such as COVID-19 and double recording may continue to exert a negative impact, Fanhua will continue to further implement our development strategy and work to improve company value by aggressively pursuing the enormous market opportunity. After considering our planned continued increased investments in technology and training in the near term, which will take time to fully show their benefits. The management is confident in achieving positive growth with an operating income of no less than RMB 30 million.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nThis concludes my presentation, and now the floor will open for your questions.\n\nOperator\n\nThank you. We'll now begin the question-and-answer session. [Operator instructions] Please stand by while we compile the Q&A roster. Our first question comes from Ziki Xang at CICC.\n\nPlease go ahead.\n\nUnknown speaker\n\n[Foreign language] So, first question, how do expect the company's revenue and profits in the second half of this year? And the second one is about the agent force. So what is the contribution our sales agents in aspect of region, age, education, etc., how about their income and the productivity? And the last one, can you share us with your current product mix? How do you expect the demand for savings products? Is duration of this product sustainable? Thanks.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nThank you for the questions. For the first one, regarding the outlook for our commission income and profitguidance in the second half of this year, our new strategies has been proven to be quite effective in driving our business growth. And a key part of this strategy is our focus on double high, which means that we focus on high-end customers and, as well as high-performing agents with digital empowerment. And these strategies have been proven to be quite effective in driving our business growth over the past quarters.We can see that even though the total performance agents -- the number of total performing agents has dropped by 30%; however, our first year premium continued to increase substantially, which proves that internal driving force remains strong.\n\nAnd as we continue to execute our strategies, we believe that we will see our growth momentum pick up over time in the third quarter, fourth quarter, and next year. \n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nHowever, we do notice that there are two factors that may pose adverse impact on our business results. Firstly, our product mix, even though we maintained strong growth in our first year premium, however, the products are mostly short-term products, which means that this product has lower embedded value for the company. So that's why our commission income and profit growth are not exactly in line with the growth of our first year premium. And the second factor is the resurgence of COVID cases in many regions in the third quarter, as well as the regulatory requirements for a double recording in some key markets, particularly in our major markets, which may pose some pressures on our business growth.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nNet-net wise, we believe that we are bottoming out, and we don't believe that we will see any further substantial decline in our business.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nThe second question regarding agent profile. Currently, about 60% of our agents are in Asia between 40 to 60 years so, this also aligns with our current strategy, our strategic focus on high-end customers, as many of the wealthy populations, although aspirant populations are also in the age of 40 to 60 years, so especially for those in the age group of 50 to 60 years old, there are about 300 million of them who have strong demand for elderly care and legacy management. So our -- the age profile of our agents are actually basically aligned with our customer group which was [Technical difficulty] a positive thing to execute our strategy.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nMost of our agents are located in the second-tier cities and to be honest, not very high education level.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nIn order to make up for the shortcomings of some of these agents, we launched a 3R marketing model, which basically to separate the whole sales process into several steps and with several roles to be played by different agents. For those agents that do not have very professional skills, they are responsible for our customer engagement, while more professional agents will be responsible for providing solution designs and to execute the transaction.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nIn the meantime, we are also stepping up efforts to recruit higher education agents and younger generation of agents to become professional solution managers or fulfillment managers to support the operation or support the customer services of those relatively ordinary agents. Currently, about 25% of our sales force are in the age group of 30 to 40 years old, and this age group of agents have typically higher education level and better learning abilities. In the first half of this year, we hosted a lot of our FOC and FRP training sessions in order to improve the professional skills of our sales force to support the customer services.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nAs for productivity, in the second quarter, the productivity of our effective agents were about RMB 20,000 per agent as compared to RMB 12,000 per agent in the same period last year. So that's a 60% improvement year over year.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nAnd the third question regarding to our product mix, as well as the demand and sustainability of growth for savings products, in the second quarter, whole life insurance and annuity products accounted for 79% of our first year premiums as compared to 68% in the same period of last year, while critical illness products accounted for only 7% as compared to 20% in the same period last year.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nThat's also the reason why we deliver strong first year premiums, but commission income was not exactly in line with the strong growth in first year premium.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nAs for the savings part of demand, as well as sustainability of the growth, we believe that in the next 10 years, we'll continue to see strong demand for savings products driven by the aging population in China. Well, 50 years ago, in China, there was a baby boomer trend, and then -- which means that at 60 years ago, roughly every year 20 million people were born. So that means that starting from this year, there will be 20 million people every year going to the retirement age. And the key demand for this age group of people are for quality retirement lifestyle and for wealth appreciation, as well as to --, as well as legacy management.\n\nSo, we believe that in the next 10 years, the people in this age group, the strong demand for savings product, which caters to their needs for retirement and the legacy management will become a key trend.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nBased on the strong market demand, as well as considering the potential worst impact of the increased contribution from savings products in our total mix, we will step up efforts to introduce our healthcare and elderly care services to cater to people's needs for quality retirement lifestyle, as well as to step up efforts to expand our insurance trust services, which may help people to cater to their needs for wealth management, as well as legacy management. And secondly, we also made effort to optimize our product mix by encouraging the sales of products with a longer payment period, particularly for products with over 10 years payment periods. And thirdly, we will also design new products by cooperating with reinsurance companies to improve the product embedded value. For example, we are recently cooperating with Aviva-COFCO to introduce a leveraged style whole life insurance products.\n\nAnd for this type of product, customers typically prefer a longer payment period between 10 years to 20 years. So this will help improve the overall embedded value of our products.\n\nYinan Hu -- Chief Executive Officer and Chairman\n\n[Foreign language]\n\nUnknown speaker\n\nThank you.\n\nOperator\n\nThank you. We have no further questions in queue. [Operator instructions] If there are no further questions, I will hand back to management for closing remarks.\n\nOasis Qiu -- Investor Relations Manager\n\nThank you for participating in today's conference call. If you have any further questions, please feel free to contact us. Thank you. Have a good day.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nOasis Qiu -- Investor Relations Manager\n\nYinan Hu -- Chief Executive Officer and Chairman\n\nUnknown speaker\n\nMore FANH analysis\n\nAll earnings call transcripts"
}