{
  "companyName": "Dynavax Technologies",
  "companyTicker": "DVAX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/dynavax-technologies-dvax-q3-2022-earnings-call-tr/",
  "content": "Dynavax Technologies (DVAX -0.19%)\nQ3 2022 Earnings Call\nNov 03, 2022, 4:30 p.m. ET\n\nOperator\n\nGood day ladies and gentlemen and welcome to the Dynavax Technologies' third quarter 2022 financial results. As a reminder, this conference call is being recorded. At the end of company's prepared remarks, we will open the call for questions and provide specific instructions at that point. I would now like to turn the call over to Nicole Arndt, senior manager, investor relations.\n\nYou may now begin.\n\nNicole Arndt -- Senior Manager, Investor Relations\n\nThank you. Good afternoon and welcome to the Dynavax third quarter 2022 financial results and corporate update conference call. In addition to our press release issued today, a supplementary slide presentation that accompanies today's call is available in the events section of our website. Before we begin, I advise you that we will be making forward-looking statements today based on our current expectations and beliefs, including, but not limited to potential market sizes and market share, ACIP impact, market trends, growth perspective, seasonality, financial guidance and trends, including revenue, profitability and sufficiency of current capitalization, timing of results of clinical trial starts and data readout, and potential future uses of CpG 1018 adjuvant.\n\nThese statements involve risks and uncertainties and our actual results may differ materially. These risks are summarized in today's press release and detailed in the Risk Factors section of our SEC filings, including today's quarterly report on Form 10-Q. Our forward-looking statements speak as of today, and we undertake no obligation to update such statements. Joining me on the call today are Ryan Spencer, chief executive officer, Donn Casale, senior vice president of commercial, Rob Janssen, senior medical officer, and Kelly MacDonald, chief financial officer.\n\nI will now turn the call over to Ryan.\n\nRyan Spencer -- Chief Executive Officer\n\nThank you, Nicole, and thank you all for joining us today. I'm delighted to have the opportunity to discuss the progress we've made this quarter and to review how far we've come over the last few years. It was just three years ago, we made a strategic pivot to focus on building a leading vaccine company by committing to drive value to Heplisav-B commercialization and leveraging our CpG 1018 adjuvant to develop new vaccine. At that time, Heplisav-B revenue for the full year of 2019 ended up at $35 million.\n\nSince then, we haven't seen significant growth as a result of strong execution from our commercial team. Heplisav-B generated nearly $38 million in revenue in this third quarter alone, keeping us on track for record Heplisav-B revenues for the full year of 2022 and providing us confidence in the expected continued revenue growth for the future. Also in 2019, we began to focus on broadening utilization of CpG 1018 for the development of new vaccine. Today, in addition to Heplisav-B, CpG 1018 is used globally in five COVID-19 vaccine programs, which have generated over $800 million in cumulative revenues for Dynavax through the third quarter of this year.\n\nAdditionally, CpG 1018 is the foundation of our expanding development pipeline. Currently including adjunctive vaccine [inaudible]. This is tremendous progress in a short-term time and a testament in the team's ability to successfully execute it. As we neared the end of 2022, we continue to expect between $550 million and $600 million in revenue from our CpG 1018 business for the full year.\n\nOur success in navigating the pandemic highlights the organization's execution abilities, underscores the scientific rationale supporting the use of CpG 1018 for broader vaccine development, and has transformed our financial profile. As we look to our future, our strong financial position supports continued investment in the commercialization of Heplisav-B and expanding our -- and advancing our clinical programs. With the recent data from our Tdap phase one trial and data from the phase one shingles clinical trial anticipated before year end, we believe we have the opportunity to highlight the value of our pipeline and strategy to produce best in class products targeting large markets. Additionally, we are advancing efforts to build on our vaccine portfolio by leveraging our capabilities in commercialization, development and manufacturing through the addition of late stage or commercial assets.\n\nWe were beginning a process of carefully identifying and evaluating opportunities with a high bar for potential transactions that we may consider. We believe this approach will further enable our success by leveraging our core organizational capabilities to strengthen our financial profile. I'll now turn the call over to Donn to provide more details on Heplisav-B performance.\n\nDonn Casale -- Senior Vice President of Commercial\n\nThank you, Ryan. I'm thrilled to share the third quarter results for Heplisav-B. The dedication and perseverance of our commercial team has resulted in another record quarter of product revenue and market share for Heplisav-B. Heplisav-B is a first and only FDA approved adult Hepatitis B vaccine that allows series completion with only two doses in one month.\n\nSeries completion is essential for high levels of protection. In an era of universal Hepatitis B recommendation, two dose Heplisav-B can make series completion easier and protect more patients faster. In the third quarter, Heplisav-B generated net product revenue of just under $38 million. Its highest single revenue quarter since launch and an increase of 65% from $23 million in Q3 of last year.\n\nThis significant revenue growth in the U.S. was largely driven by our continued gains and market share. We estimate Heplisav-B's total market share increase to 32% compared to 25% during the same period last year, while field targeted end market share increased to 43%, up from 32% during the third quarter of last year. Strong performance in Q3 was driven by two critical segments: retail pharmacy and integrated delivery networks or IDN.\n\nIn Q3, retail pharmacy had significant increases in the number of new ordering and reordering locations. We are encouraged by this trend and the positive feedback we're receiving from customers about the ACIP Universal Recommendation. During the quarter, several top retail chains expressed a desire to make Hepatitis B vaccine a priority focus for their immunization strategies moving forward. In addition to our success in retail, there has been considerable progress in the IDN segment.\n\nMany of our customers have expanded their use and increased reordering of Heplisav-B. Like in retail, we have received positive feedback from customers about the ACIP Universal Recommendation and their desire to enter this new era with a two-dose vaccine for Hepatitis B. In Q3, several large IDN customers updated their vaccine protocols and capabilities to reflect the policy change. The ACIP's recommendation that all adults 19 to 59 years of age should receive Hepatitis B vaccination significantly expands the number of adults in the U.S.\n\nwho should receive -- or should be vaccinated against Hepatitis B. We continue to believe that the Universal Recommendation will be a significant catalyst for growth and estimate the Hepatitis B market opportunity could grow to approximately $800 million by 2027, with Heplisav-B well-positioned to secure a majority market share over time. In Q3, we continue to see positive trends and Hepatitis B market recovery. During the quarter, the market was down only 7% from pre-pandemic level.\n\nThis positive recovery was due to the market continuing its return to normal pre-pandemic operations, coupled with expanded growth from customers implementing the Universal Recommendation. Looking ahead to this quarter, we anticipate the Hepatitis B market will remain flat or slightly below the level seen in Q3. This likely outcome is due to the typical Q4 seasonality, which has historically reduced the market by 10% to 15% quarter over quarter. With a proven clinical profile and our team's strong commercial execution, we expect further market share gains and continued annual revenue growth for Heplisav-B.\n\nWe remain confident in our ability to generate momentum and look forward to continuing to drive long-term growth for the brand. I will now turn the call over to Rob to take you through our clinical pipeline.\n\nRob Janssen -- Senior Medical Officer\n\nThank you, Donn. We believe there's a tremendous amount of potential in our pipeline, focusing on best-in-class products, targeting large markets by combining our CpG 1018 adjuvant with established antigens. We recently completed a phase one clinical trial evaluating and improved tetanus diphtheria, and pertussis or Tdap vaccine that utilizes our CpG 1018 adjuvant. Adult and adolescent safety data from this study demonstrated the vaccine candidate was well-tolerated without safety concerns.\n\nAdult immunogenicity results were consistent with our expectations and support continued advancement of the vaccine candidate. We're also conducting a non-human primate pertussis challenge study to assess the impact on prevention of disease symptoms and nasal colonization of the pertussis bacteria. Our second development area is the shingles vaccine program. The last participant visit has been completed in the phase one study evaluating safety, tolerability, and immunogenicity compared with Shingrix, a commercially available shingles vaccine in the U.S.\n\nand other countries. We believe that our vaccine candidate adjuvanted with CpG 1018 has the potential to elicit strong CD4 T cell responses, which are key in controlling reactivation of the zoster virus, while also providing improved tolerability compared to the current marketed product. Data from this proof-of-concept clinical trial are anticipated by year end. The advancement of our clinical candidates is a core priority.\n\nWe're confident in our strategy to leverage the proven profile of CpG 1018 to develop new and improved vaccine candidates that provide significant opportunities to address important unmet medical needs. I'll now turn the call over to Kelly to review our third quarter financial results.\n\nKelly MacDonald -- Chief Financial Officer\n\nThank you, Rob. I'm happy to report on another quarter of strong financial performance. I'll touch on some key financial items and then review our full year 2022 guidance and provide a few closing thoughts. Please note that all financial comparisons are versus the prior year period unless otherwise noted.\n\nPlease additionally refer to our press release and 10-Q for detailed financial information. Starting with revenue, total revenue for the third quarter was $168 million, up 55% year over year. This quarter marked another record breaking quarter for Heplisav-B with total net sales of $38 million, representing 65% year over year growth. What is equally impressive for the brand is the continued improvement and gross margin, which was approximately 69% for the third quarter and 70% year-to-date compared to 56% for the full year 2021.\n\nTurning to CpG 1018 adjuvant revenue. Revenue recognized under our commercial supply agreements for COVID-19 vaccines, totaled $126 million for the third quarter, bringing CpG 1018 adjuvant revenues to $440 million year-to-date. We had two unique items to highlight in the third quarter relating to our CpG 1018 COVID-19 partnerships. We have recently amended our commercial supply agreements with both Clover Biopharmaceutical, as well as biological E to reflect the reduction in demand as the COVID landscape evolves.\n\nDuring the third quarter, in connection with the Clover amendment, we recognized approximately $24 million in one-time revenue for cancellation fees covering the cost of raw materials and CMO-related fees incurred. Additionally, we wrote down approximately $14 million in corresponding inventory in connection with the reduction in demand. We are working closely with our CpG 1018 adjuvant commercial supply customers as they manage their initial stockpiling of CpG 1018 with forward looking demand as the global pandemic evolves. We continue to expect between $550 million and $600 million in full year 2022 CpG 1018 revenue with corresponding gross margins approximating 60% and we're very proud of the collective efforts with our collaborators to be an important part of the response to the COVID 19 pandemic during a very dynamic period.\n\nAs we look ahead to 2023, we believe our customers will likely have sufficient adjuvant stockpile as of the end of 2022 to service their initial commercial agreements, translating to substantially lower adjuvant sales expected in 2023. Beyond 2023, we expect to provide additional guidance as we execute these for commercial supply agreements and gain better line of sight into the endemic demand of COVID-19 vaccines for our customers. Now, turning to expenses, our research and development expenses for the third quarter of 2022 were $13 million compared to $6 million in the same period last year, reflecting continued advancement of our ongoing pipeline programs in Tdap and shingles, as well as our funded phase two contracts with the DOD for adjuvant display vaccine. Selling, general, and administrative expenses for the third quarter of 2022 increase to $32 million compared to $27 million for the third quarter of last year, primarily driven by increased headcount cross field, sales and G&A, coupled with focused marketing investments to drive growth in Heplisav-B.\n\nMoving on to profitability. For the third quarter of 2022, we generated GAAP net income of $64 million or $0.50 per share basic and $0.43 per share diluted. Turning to the balance sheet, we ended the third quarter with cash, cash equivalents, and investments of $587 million and we continue to believe this level of capital is sufficient to support our core business, including our R&D portfolio without the need to raise additional funds. Lastly, I'm pleased to reiterate our 2022 full year financial guidance, including CpG 1018 adjuvant revenues, expected to be between $550 million and $600 million, with approximately 60% gross margin for the year, reflecting the economics associated with the remaining firm under our commercial supply agreements, R&D expenses in the range of $50 million to $60 million, SG&A expenses in the range of $130 million to $140 million and interest expense of approximately $7 million.\n\nIn summary, with another quarter of strong commercial and financial performance, we remain on track for another great year with anticipated record revenues, continued progress and meaningful catalysts across our clinical portfolio, positive cash flow, and a second consecutive year of profitability. Our strong balance sheet position combined with a disciplined approach to capital allocation enables us to focus on selective investments to drive growth in Heplisav-B, and thoughtfully advance our clinical pipeline to drive long-term shareholder value. Thank you everyone for your attention today. Operator, we would now like to open the Q&A portion of today's call.\n\nOperator\n\nThank you. [Operator instructions] Our first question comes from Roy Buchanan from JMP Securities. Your line is open.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nGreat. Thanks for taking the questions. I guess, the first one is on HEPLISAV a good quarter do you know the market share and retail segments specifically? And if you do, is it consistent across the top 10 retailers where you have the contracts? Or is there variation between the retailers?\n\nRyan Spencer -- Chief Executive Officer\n\nDonn, do you want to go ahead and take that?\n\nDonn Casale -- Senior Vice President of Commercial\n\nYeah. So market share across the segment is just under 50% for the entire segment. We do see different market shares across the different retail chain with a few of them where we have majority market share. So it's kind of a blend.\n\nBut overall, we liked the momentum we have seen as it relates to our market share, as well as growth within that segment.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nOK, great. And then, the improvements in gross margin is impressive. You know, given all we've heard about inflation, I guess. Any thoughts on the impact of inflation, may we see that impact the gross margins going forward?\n\nRyan Spencer -- Chief Executive Officer\n\nThanks, Roy. Kelly, you want to take that one.\n\nKelly MacDonald -- Chief Financial Officer\n\nSure. So yeah, thanks, Roy for the question. Appreciate it. We've made substantial improvements and investments in our manufacturing facility in Germany, and we're really excited to be able to pull through some of the financial benefits of those investments over the last couple of years.\n\nWe don't expect inflation to have a meaningful impact to our gross margins. And, in fact, in the 70% range is where we expect gross margins to settle in at this level, this level and those volumes.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nGreat. Thanks for that. I had a quick one on the shingles data coming up later in a year or so you're going to have T cell beta for all the patients that I know you're looking at the CD4 cells at a secondary endpoint, are you also going to look at CD8 cells? Thanks.\n\nRyan Spencer -- Chief Executive Officer\n\nRob, you want to take that?\n\nRob Janssen -- Senior Medical Officer\n\nSo CD4 is associated with protection against reactivation of zoster, so we'll be predominantly focusing on CD4 for all patients,\n\nRyan Spencer -- Chief Executive Officer\n\nFor all patients in the study.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nThank you.\n\nRyan Spencer -- Chief Executive Officer\n\nThanks, Roy.\n\nOperator\n\nPlease standby for the next question. And that question comes from Matthew Phipps of William Blair. Your line is open.\n\nMatthew Phipps -- William Blair -- Analyst\n\nHi, everyone. Thanks for having me. And congrats on continued great momentum with HEPLISAV-B. I guess I'm a Shingle update in comparison to Shingrix.\n\nMaybe tough to answer, but how much better do you want to be in the tolerability your new decades? It's like on that Shingrix side effect profile. And are there any particular side affects you think are more impactful than others about kind of patient preference and adoption?\n\nRyan Spencer -- Chief Executive Officer\n\nThanks, Matt. We're going to have Rob to answer that one.\n\nRob Janssen -- Senior Medical Officer\n\nYeah. So what I anticipate that is that we would be able to demonstrate statistically significantly lower rates of post injection reactions in Shingrix. We're currently in the process of evaluating if any of the individual reactions would be more important than any other or whether we would use essentially a composite term, which is all of you know, any of the either local or systemic post injection reactions, but it's something that we're looking into right now.\n\nMatthew Phipps -- William Blair -- Analyst\n\nInteresting. OK. Thanks for Rob. A question about the IRA, inflation production, obviously, it's caused some headaches for other drug development companies, but there is some benefit for adult vaccine coverage.\n\nAs far as co pays and things like that. Is that impacting your development calculus for pipeline programs?\n\nRyan Spencer -- Chief Executive Officer\n\nYeah. Well, I mean, the benefits are relative compared to other products. I mean, the reality is for Hep-B, for example, it's incredibly favorable, because of the -- the impacts on Part D coverage. But without, without me specifically being called out on the Medicaid rebate program is not having to participate.\n\nThe -- and then not, we do not expect given the level of Medicare spend on Hepatitis B vaccine, that it would ever be a negotiated drug. So from a relative perspective, you know, I think, our long term revenue potential is, is comparatively strong, compared to other products possibly different, the calculus would be different, depending on the product, if you had a product that was focused on the over 65 population that could result in larger spend for Medicare, then it might be, it might have an impact. But I will say one of the benefits is that it's somewhat limited, given the IRA limited the negotiation down to 25% impact, which is less for vaccines, which is less than what you can see in other classes. So ultimately, I think being a vaccine manufacturer, the IRA doesn't have the same level of impact as other parts of our industry.\n\nMatthew Phipps -- William Blair -- Analyst\n\nThanks, Ryan, I guess maybe Lastly, obviously mentioning significant, maybe slowdown in CpG revenues next year. But I guess it implies at least there's still some you expect next year, is that kind of flow through of currently signed contracts, or is that you do see potential for some contracts tied to anything?\n\nRyan Spencer -- Chief Executive Officer\n\nYeah, I think the way we're -- what we're trying to provide as an overview of what we know now and what we what we know now is the markets changed pretty significantly over the last year as it relates to demand. It's the end there's a decent amount of stockpiles of agile within our, our collaborators. And so, it really would come down to how do we need shipments from the end of this year roll into next year, which would be minor. And then, how will the market evolved toward -- the toward the end of next year, which we don't have a ton of visibility into now.\n\nAnd so, what there is a potential for additional revenue in the second half of the year, depending on how the market evolves, which currently are not contracted for at the moment. So, we're going to have to let you know, as we know, as those contracts evolve, and which will be dependent on the line of sight as far as demand for collaborative vaccines.\n\nMatthew Phipps -- William Blair -- Analyst\n\nYeah. That's helpful. Thanks, Ryan. That's all for me.\n\nRyan Spencer -- Chief Executive Officer\n\nOK. Thank you.\n\nOperator\n\nPlease stand by for the next question. Our next question comes from Madhu Kumar from Goldman Sachs. Your line is open.\n\nMadhu Kumar -- Goldman Sachs -- Analyst\n\nHey, guys, this is Rob on for Madhu. Thanks for taking our question. I guess, we were just wondering, from a high level, how should we think about the year-end shingles data? And then also, I guess, how should we be thinking about modeling the adjuvant revenues, like in 2023, and on the forward\n\nRyan Spencer -- Chief Executive Officer\n\nFor the shingles data, we will we expect to have the data in hand by the end of the year and we will be weeks with issue with topline press release shortly thereafter, with more robust reporting of the data to follow in at a scientific meeting or publication. And then, the other question as far as how to think about the long term adjuvant revenue, I think, Rob, the key is you got to watch the market. And what we keep saying is there's been significant evolution of the COVID market during the course of this year. We think we're well positioned as it relates to the global need, recognizing that we have collaborators targeting very many different markets around the globe.\n\nBut as far as what that ultimate demand will be, I think, that's still kind of left to be determined as we move into this. And so, we were very pleased with how we positioned ourselves to be able to participate in the long-term demand, being able to quantify it at this moment is difficult.\n\nMadhu Kumar -- Goldman Sachs -- Analyst\n\nThat makes a lot of sense. Thanks for taking our question.\n\nOperator\n\nStandby for the next question. And the next question comes from Ernesto Rodriguez-Dumont from Cowen. Your line is open.\n\nErnesto Rodriguez-Dumont -- Cowen and Company -- Analyst\n\nHi. Thank you for taking our question. Congrats on the quarter. You highlighted the progress that you've had on the retail space and the hospital -- and with hospital system, and they seem to be aware of their individual clinical recommendation and seems that there's going to be a catalyst for growth.\n\nWhat do you expect them to be the hurdles there? Is it the logistics of them applying the recommendation, or are they going to wait for the demand to settle? Or they're going to try to push it? Or what is it? What is I guess the next step there? And if you -- and my second question, if you give also any color on the launch in Europe, any progress on other markets outside of Germany? Thanks.\n\nRyan Spencer -- Chief Executive Officer\n\nOK. Donn, why don't you take that hurdle -- that is focused on the hurdle of the uptake from Universal I think is what's the question not focus on market share, but let's start with the uptaking Universal.\n\nDonn Casale -- Senior Vice President of Commercial\n\nSo, right now, as I mentioned before a nurse though we see, quite a few of our hospitals that have implemented a flag within their EMR system. So it's a passive flag. That's the first great step gives us quite a bit of confidence. As we think about the market opportunities, we communicated $800 million opportunity, those types of signs are signs that we'd like to see.\n\nAnd we will continue to see that happening throughout the marketplace. Our role will be to pull that through with the customer to increase the awareness at the provider level of those six flags. On the retail segment, we've engaged with all of our top retail customers. From their point of view, as I mentioned before, they see Hepatitis B vaccine and Universal Recommendation as an opportunity, especially for those aged 30 to 50 to use it plus one strategy, especially going into 2023.\n\nSo they've been engaging us around opportunities to go after that patient population, and really see it as a strategic priority moving forward. So that's why we're really excited about the opportunities as relates to Universal both in retail and IDN.\n\nRyan Spencer -- Chief Executive Officer\n\nYes. And if I can just add a little bit of color onto that as it relates to clearing hurdles. I actually would say we've cleared a small hurdle already this year. In Donn's commentary around what we've seen with certain IDN customers turning on a flag which basically prompts physicians when a patient has not been vaccinated.\n\nWe've actually seen uptake and that is -- that's seems obvious, but that is a hurdle to clear that when physicians do have the prompts in front of them, patients are actually accepting of the recommendation. And we've already seen evidence that, that's taking place. So I would argue that we've cleared the first hurdle in expanding the market. Now, obviously, we have to that has to be done much more broadly as Donn highlighted, but we are seeing evidence that patients are going to be willing to accept a recommendation for Hepatitis B vaccine.\n\nSo that's -- it's an important step in the journey. I mean, and then Donn, you want to provide some commentary on the launch in Germany.\n\nDonn Casale -- Senior Vice President of Commercial\n\nYes. So the launches is going well, as you would expect, with most launches, it takes time. And -- but we're excited about the progress that's been made thus far. We'll continue to update as we get more information, but thus far, the launch is going as we expected.\n\nAnd this launches a tech guy.\n\nErnesto Rodriguez-Dumont -- Cowen and Company -- Analyst\n\nThank you. That was very helpful.\n\nOperator\n\nPlease stand by for the next question. Our next question is from Roy Buchanan from JMP Securities. Your line is open.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nOh, thanks for taking the follow-ups. I had a couple more. So what's the status of Heplisav in dialysis patients? I think you're expecting to meet with the FDA around this time, just curious if that happened and where that's path?\n\nRyan Spencer -- Chief Executive Officer\n\nYes, no, we've had good engagement that it was a little delayed due to the FDAs focus on COVID over the last few years. But we are working on the FBLA for dialysis, which looks like the file probably early next very early next year and to get that data into the label upon approval of the FBLA.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nOK, great. And then, back to the shingles, I guess, it's a little early, you're just finishing up the phase one, you're going to need to talk to the FDA, etc. But how do you picture the registrational path for that candidate at this point? Are you going to likely have to go head-to-head with Shingrix, need an efficacy trial? And then how do you think about the path ex US and the market opportunity there? Thanks.\n\nRyan Spencer -- Chief Executive Officer\n\nWe'll take the first point is probably worth hitting head on, which is when you have products with this level of efficacy that we expect over 95% efficacy, a head-to- head trial just doesn't make sense, you'll never be able to feasibly demonstrate actual efficacy. And so, we still obviously need to continue to advance our engagement with the agency given that we're in phase one to really fine tune what the expectations are for the full regulatory plan. But we do not expect it's just not feasible to do a head-to-head efficacy study in this case. So we -- there could be a placebo controlled efficacy study or even potential accelerated approval on immunogenicity.\n\nBut we haven't been able to fine tune that path just yet in US or in other markets.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nOK, great. But and then on the ex US, do you see that as a vibe? I mean, Shingrix does pretty well, ex US, especially as last quarter. How are you guys thinking about the opportunity there? Thanks.\n\nRyan Spencer -- Chief Executive Officer\n\nOh, well, I mean, like any products, we would expect to what we'd want to launch it broadly into all markets that would support the infrastructure cost of bringing the product into that region. So that's part of the strategy is a global strategy for shingles.\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nOK, perfect. Thank you.\n\nOperator\n\nThank you. We have no further questions at this time. I would now like to turn the call over to Ryan Spencer, CEO for closing remarks. You may begin.\n\nRyan Spencer -- Chief Executive Officer\n\nThank you, operator, and thank you all for your attention today. As we have reiterated on multiple occasions, we believe that the combination of our revenue generating asset, a highly experienced team, our strong financial profile, and an emerging pipeline of product candidates based on our proven adjuvant technology provide a solid foundation for Dynavax future. Our success this year and opportunities we see ahead are made possible by the dedicated team here at Dynavax. Our people are everything and I would like to thank them for their commitment and effort toward our mission.\n\nThank you for joining us today. We appreciate your time and interest in Dynavax. Operator, you may end the call.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNicole Arndt -- Senior Manager, Investor Relations\n\nRyan Spencer -- Chief Executive Officer\n\nDonn Casale -- Senior Vice President of Commercial\n\nRob Janssen -- Senior Medical Officer\n\nKelly MacDonald -- Chief Financial Officer\n\nRoy Buchanan -- JMP Securities -- Analyst\n\nMatthew Phipps -- William Blair -- Analyst\n\nMadhu Kumar -- Goldman Sachs -- Analyst\n\nErnesto Rodriguez-Dumont -- Cowen and Company -- Analyst\n\nMore DVAX analysis\n\nAll earnings call transcripts"
}