{
  "companyName": "Gilead Sciences",
  "companyTicker": "GILD",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/gilead-sciences-gild-q3-2022-earnings-call-transcr/",
  "content": "Gilead Sciences (GILD 0.69%)\nQ3 2022 Earnings Call\nOct 27, 2022, 4:30 p.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for your patience and thank you for attending today's third quarter 2022 Gilead Sciences earnings conference call. My name is Amber, and I will be your operator for today's call. [Operator instructions]. It is now my pleasure to hand the conference over to our host, Jacquie Ross, VP of investor relations.\n\nJacquie, please proceed.\n\nJacquie Ross -- Vice President, Investor Relations\n\nThank you, operator, and good afternoon, everyone. Just after the market close today, we issued a press release with earnings results for the third quarter of 2022. The press release, slides, and supplementary data are available on the investors' section of our website at gilead.com. The speakers on today's call will be our chairman and chief executive officer, Daniel O'Day; our chief commercial officer, Johanna Mercier; our chief medical officer, Merdad Parsey; and our chief financial officer, Andrew Dickinson.\n\nAfter that, we'll open up the call to Q&A where the team will be joined by Christi Shaw, the chief executive officer of Kite. Before we get started, let me remind you that we will be making forward-looking statements, including those related to Gilead's business financial condition and results of operations, plans, and expectations with respect to products, product candidates, corporate strategy, business and operations, financial projections and the use of capital and 2022 financial guidance, all of which involve certain assumptions, risks, and uncertainties that are beyond our control and could cause actual results to differ materially from these statements. A description of these risks can be found in the earnings press release and our latest SEC disclosure documents. All forward-looking statements are based on information currently available to Gilead, and Gilead assumes no obligation to update any such forward-looking statements.\n\nNon-GAAP financial measures will be used to help you understand the company's underlying business performance. The GAAP to non-GAAP reconciliations are provided in the earnings press release and our supplemental data sheet as well as on the Gilead website. Now I'll turn the call over to Dan.\n\nDan O'Day -- Chairman and Chief Executive Officer\n\nThank you, Jacquie, and good afternoon, everybody. We're pleased to connect with all of you today to share the details of another very strong quarter. Thanks to strong commercial and clinical execution by our teams, the positive momentum continues to build. Total product sales, excluding Veklury, were $6.1 billion, growing 6% sequentially and 11% year-over-year.\n\nThe total, including Veklury, was $7 billion. If we exclude the impact of foreign currency fluctuations and the tail end of the loss of exclusivity for Truvada and Atripla and HIV, total product sales excluding Veklury grew 15% from the third quarter of last year. The majority of this growth was driven by HIV, and over 40% of the $620 million increase in sales came from oncology. The team will share more details, but this has been a great quarter for commercial execution, including continued share gains for Biktarvy, growing momentum for Trodelvy, another impressive quarter for cell therapy, and a strong quarter for Veklury.\n\nWe also saw continued clinical momentum this quarter. Some of the highlights include the FDA priority review granted to Trodelvy for late-line HR-positive/HER2-negative metastatic breast cancer, the EU approvals for Yescarta for second-line relapsed/refractory large B-cell lymphoma; and Yescartas in adult acute lymphoblastic lymphoma. And in virology, lenacapavir received its first regulatory approval in Europe. Marketed as Sunlenca, it is approved for heavily treatment-experienced people living with multidrug-resistant HIV, making it the first approved casted inhibitor and the first therapy with a six-month dosing schedule for HIV treatment.\n\nWe are taking multiple important steps to advance our ambitious clinical pipeline, including in oncology, we are expanding our lung program with eight trials now active and three more planned to start in the coming months. We plan to resume our phase 2 trial investigating a once-weekly oral combination of Merck's and our lenacapavir. This will be one of many ongoing combination studies we have for long-acting HIV treatment in addition to our extensive program for prevention. And we continue to further strengthen our early stage portfolio, adding a BTLA agonist for inflammation from MiroBio and an option for a bispecific antibody for oncology for MacroGenics.\n\nMoving to our clinical goals for 2022 on Slide 5. We're on track to start the two remaining phase 3 trials, namely EVOKE-03 for first-line non-small cell lung cancer and ZUMA-23 for first-line high-risk LBCL. We continue to expect another interim readout for the phase 2 R7 study in first-line non-small cell lung cancer before the end of the year. Overall, this has been another very strong quarter and a very strong year for Gilead.\n\nWe're seeing impressive growth of our base business with continued share gains for Biktarvy and excellent performance for cell therapy and growing demand for Trodelvy. On the clinical side, we've had the first approval for lenacapavir, a foundational asset for the future of our HIV franchise. Trodelvy is now in a priority review for HR-positive/HER2-negative breast cancer in the U.S., and we're executing on an extensive development program across virology, oncology, and inflammation. Finally, the recent TAP settlement is expected to significantly extend the exclusivity of key components of our HIV franchise in the U.S.\n\nI'd like to take this opportunity to thank the Gilead and Kite teams for their outstanding clinical and commercial execution. This consistent execution of our strategy, along with a very robust portfolio, has led to some terrific progress in 2022, and we look forward to building on that momentum through the rest of the year and beyond. With that, I'll invite Johanna to share an update on our third quarter commercial performance.\n\nJohanna Mercier -- Chief Commercial Officer\n\nThanks, Dan, and good afternoon, everyone. Before I jump into the commercial results for the third quarter, I wanted to begin by acknowledging our team for another exceptional quarter. We're making important progress in our goals of ensuring the strength and sustainability of our virology franchise while also continuing to build our expertise and market presence in oncology. Turning to Slide 7.\n\nWe had a very strong quarter with total product sales, excluding Veklury of $6.1 billion, up 11% year-over-year or 15% excluding FX and the residual impact of the HIV LOEs, with growth in each of our core franchise areas and notable strength in HIV and oncology. Sequentially, total product sales, excluding Veklury, grew 6% driven by HIV, HCV, and oncology. Growth excluding FX impact and the LOEs was 8%. On Slide 8, HIV sales of $4.5 billion were up 7% year-over-year.\n\nExcluding the impact of both FX and the LOEs, HIV revenue grew 10% year-over-year. Similar to last quarter, this was primarily channeled mix-driven by U.S. government utilization leading to higher average realized price in addition to higher demand. Overall, despite the quarter-over-quarter shift in average realized price, government plans continue to represent approximately 60% of our U.S.\n\nHIV treatment prescriptions, including Medicare in the low 20s. HIV revenue growth was driven by the U.S. while Europe was down year-over-year due to FX and less favorable pricing dynamics, offset in part by higher demand. Quarter-over-quarter, HIV sales were up 6%, similarly driven by channel mix and inventory dynamics as well as higher demand.\n\nTurning to the market more broadly. We are encouraged that on a year-over-year basis, the HIV treatment market across the U.S. and Europe has grown for five consecutive quarters. This reflects the work we have been doing with our partners to bring people living with HIV and people at risk of HIV back into care following the pandemic.\n\nThe market growth we are seeing suggests that activity has returned to pre-COVID trends. In the third quarter of 2022, the market grew 2% year-over-year, both in the U.S. and Europe. Looking forward, we continue to expect annual treatment market growth in the 2% to 3% range.\n\nDescovy sales were $500 million, up 16% year-over-year and 9% sequentially, and perhaps market share remains stable despite generic and other entrants. For the quarter, the PrEP market continues to demonstrate robust growth largely driven by the growing awareness for PrEP and demand well above pre-pandemic levels. Overall, the PrEP market grew 19% year-over-year and 6% sequentially. On to Slide 9.\n\nThird quarter Biktarvy sales were $2.8 billion, up 22% year-over-year, driven by higher demand in both the U.S. and Europe and favorable pricing dynamics. Sequentially, sales were up 8% due to higher demand as well as favorable inventory and pricing dynamics. Once again, Biktarvy continues to command a leading position in the treatment of HIV with another record quarter growing to 45% market share in the U.S., up four percentage points year-over-year.\n\nMoreover, Biktarvy remains the leading medicine for those seeking to switch to a new regimen in the U.S. as well as those starting treatments in both the U.S. and Europe, most notably, capturing 10 new starts for every one person prescribed another medicine in the U.S. Looking to the fourth quarter, I'd like to call out a few points.\n\nFirst, given the historic trend toward a significant inventory build in the fourth quarter followed by inventory drawdown in the first quarter, we are renewing our focus on inventory management in an effort to better align the timing of product delivery with end-user demand. Second, while we continue to see strong market share gains for Biktarvy in addition to solid growth in both the treatment and prevention market, we will remind you that some of our second and third quarter performance has been driven by shifts in channel mix that have had a favorable impact on average realized price. Given the favorable trends we observed over the last two quarters, we do expect the channel mix to be more stable in the fourth quarter. With these factors in mind and also allowing for further FX impact, we expect fourth quarter HIV sales to be roughly flat on a sequential basis, noting that full-year 2022 HIV growth is therefore expected to be approximately 4% or 7% excluding the LOEs and FX headwinds year-to-date.\n\nIn summary, we're extremely proud of the portfolio we have built-in HIV and excited about the way Gilead is positioned for 2023 and beyond. Specifically, Biktarvy's clinical profile continues to impress, evidenced by ongoing strong growth rates, even though its annual revenue run rate is now in excess of $10 billion. Descovy for PrEP maintained over 40% market share despite competition and generic entrants. And most recently, lenacapavir approval for heavily treatment-experienced people living with multidrug-resistant HIV in the EU.\n\nThis is an important option for a group that has very few treatment options and is a great opportunity for physicians and the HIV community to get more familiar with a six monthly subcutaneous HIV therapy. We believe this sets the stage well for our other planned lenacapavir-based treatment and prevention regimens. All of this, combined with the treatment and prevention market showing solid recovery, the impact of the loss of exclusivity of Truvada and Atripla now behind us, and the recent task settlement extending projected U.S. LOEs for Descovy and into the early 2030s and driven Voya's patent to 2029 in the U.S.\n\nAll of this truly underpins our confidence that Gilead is well positioned for growth and continued leadership in the HIV market. Now on to Slide 10. HCV sales for the third quarter were $524 million, up 22% year-over-year and 17% sequentially, primarily due to the favorable resolution of a prior year rebate claim in Europe and other favorable pricing dynamics in the U.S. Offsetting these benefits, there were fewer patient starts in both the U.S.\n\nand Europe, consistent with our expectations for both the quarter and the general trend that you should expect in HCV going forward. Despite the trend in patients' start, we're pleased to maintain HCV market share of more than 50% in both the U.S. and Europe and third quarter share increased on a year-over-year basis. For HBV and HDV on Slide 11, sales were up 7% year-over-year and 13% quarter-over-quarter primarily driven by favorable inventory dynamics.\n\nMoving to Veklury on Slide 12. Third quarter revenues were $925 million. As expected, sales were down year-over-year, given lower U.S. hospitalizations as compared to the same period last year.\n\nIndeed, though hospitalizations are below the peak seen at the start of the year, it's clear with the sequential increase that the path of the pandemic remains difficult to predict. Nonetheless, we're proud of the role Veklury continues to play in the fight against COVID-19. In the U.S., Veklury is used in approximately 60% of hospitalized patients who are being treated for COVID. Now outside the U.S., Veklury's benefit to patients continues to be recognized by health authorities, including the World Health Organization and the European Medicines Agency based in part on the data, which demonstrated a significant reduction in the risk of hospitalization after three-day IV treatment in the outpatient setting.\n\nThese factors continue to support the clear utilization where it's needed. Moving to oncology and beginning with Trodelvy on Slide 13. Sales of $180 million grew 78% year-over-year and 13% quarter-over-quarter and we continue to work with regulators, payers, and clinicians around the world to broaden access. Since its approval in second-line metastatic TNBC late last year in Europe, Trodelvy is now reimbursed in 13 countries outside the U.S.\n\nwith additional markets in Europe and elsewhere expected to come online shortly. We've also begun work on establishing the right infrastructure to support a potential launch into pretreated HR-positive/HER2-negative metastatic breast cancer, reinforcing the significant unmet need in this population and the clinically meaningful overall survival data demonstrated in the phase 3 TROPiCS-02 study. FDA has accepted our supplemental biologics license application as priority review, and we look to a decision in February of next year. We're excited by the potential for many more patients to benefit from Trodelvy.\n\nNow on to Slide 14 and on behalf of Christi and the Kite team, I'm pleased to share that cell therapy sales in the third quarter were $398 million, up 79% year-over-year and up 8% sequentially. These strong results were driven by continued growth in large B-cell lymphoma and Kite's ability to reliably meet customer demand. Together with our recently FDA-approved viral vector manufacturing facility in Oceanside, Kite remains well-positioned to ensure clinical and commercial supply availability, while it continues to execute its geographic expansion. For the quarter, Yescarta sales of $317 million were up 81% year-over-year and 8% quarter-over-quarter, driven by a continued successful launch in second-line LBCL in the U.S.\n\nand partially offset by FX headwinds in Europe. Just last week, Yescarta was approved in the EU for second-line LBCL and we look forward to launching there in the months ahead. grew 72% year-over-year to deliver $81 million in sales, driven by growth in adult acute lymphoblastic leukemia. In early September, the European marketing authorization for Tecartus in relapsed or refractory ALL was granted.\n\nWe continue to broaden awareness and access to our cell therapy through indication and authorized treatment center expansion in existing markets as well as through geographic expansion, as demonstrated by our most recent regulatory applications in Brazil, Singapore, and Saudi Arabia. As always, Christi is available for Q&A later on the call. Overall, this was an incredibly strong quarter for Gilead oncology with revenue of $578 million, up 10% from last quarter and 79% from last year. This represents an almost $2.4 billion annual run rate as we move into the last few months of 2022 and hint that the possibilities ahead as we continue to execute on our commercial and clinical oncology goals.\n\nAnd with that, I'll hand the call over to Merdad for an update on our pipeline.\n\nMerdad Parsey -- Chief Medical Officer\n\nThank you, Johanna. Before I start, I'd like to recognize the strong execution of our internal team and external partners across a broad range of activities that's diversified across the therapeutic area and clinical stage with milestones spanning study initiations, the sBLA submission for Trodelvy, two EC approvals in cell therapy and our first approval for lenacapavir in the EU. On Slide 16, you can see that we've made a lot of progress so far this year, meeting nearly all of our milestones. Regarding our BLA filing for Hepcludex, we received a complete response letter from the FDA, citing concerns about the manufacture and delivery of Hepcludex.\n\nWe will take the time to fully digest the CRO, but note that no new safety or efficacy clinical trials were requested by the FDA. We plan to resubmit as quickly as possible, and we'll work with the agency on the path forward. We remain confident and we'll and the potential benefits it can bring to people living with HDV, and we'll share an update on the U.S. regulatory pathway when we can.\n\nMoving on to HIV on Slide 17. We're thrilled that lenacapavir received its first marketing authorization from the European Commission as Sunlenca for people living with multidrug-resistant HIV and in combination with other antiretrovirals. Sunlenca is a first-in-class capsid inhibitor. It's the first and only twice-yearly subcutaneous HIV treatment and as a much-needed option for those people living with HIV with limited alternatives.\n\nWe continue to expect a decision on our NDA from lenacapavir from FDA in late December of this year. In the meantime, this first regulatory approval from the EC is an important validation while we continue to progress our other lenacapavir-based treatment and prevention programs. For HIV treatment, a new clinical development plan, allowing a lower dose of islatravir, Merck's investigational and RTTI is moving forward after FDA review. As such, we're planning to resume the phase 2 trial investigating oral once-weekly lenacapavir and islatravir combination.\n\nOur internal combination programs are also ongoing and we expect to share data next year from the phase 1b proof-of-concept study for lenacapavir in two broadly neutralizing antibodies or BNAB, directed at HIV. In prevention, our clinical development continues to progress with four in process or planned clinical trials evaluating every six-month subcutaneous uncap over. Moving to Slide 18. Veklury continues to be recognized as the standard of care for patients with severe COVID-19 with updated guidelines for Veklury from the World Health Organization.\n\nAdditionally, the CHMP issued a positive opinion on the use of Veklury for the treatment of pediatric patients with COVID-19. Although novel treatments and vaccinations have improved the COVID-19 outlook, there is a continued need for effective and convenient oral treatment options for patients. I'm pleased to share that the FDA has just granted our novel oral nucleoside GS-5245 fast track designation which aims to expedite development of promising new medicines. We continue to be in active discussions with the FDA and other global regulators on potential clinical pathways, including a phase 3 study that we expect to start within the next several months either globally or outside the U.S.\n\nOn Slide 19, we show the phase 3 TROPiCS-02 results in patients with HR-positive/HER2-negative metastatic breast cancer. It was a late-breaking presentation at ESMO in September. Trodelvy demonstrated a statistically significant and clinically meaningful 3.2-month overall survival benefit. Patients with metastatic HR-positive/HER2-negative breast cancer who progressed on endocrine-based therapies in chemotherapy have limited options.\n\nAs a reminder, the patients enrolled in TROPiCS-02 were heavily pretreated with a meeting of three prior chemotherapy regimens in addition to prior CDK4/6 inhibitors. Importantly, the FDA recently accepted our sBLA for Trodelvy in HR-positive/HER2-negative metastatic breast cancer and granted it a priority review. The PDUFA date is currently set for February 2023. We continue to work with regulatory agencies outside the U.S.\n\nto potentially make this medicine available to eligible patients. Additionally, following the acquisition of Trodelvy's asian commercialization and development rights from Everest Medicines, we expect data from our phase 3 metastatic TNBC China bridging trial in the next few months and our phase 3 HR-positive/HER2-negative metastatic breast cancer study in mid-2023. Moving to lung cancer on Slide 20. You can see that we expect to have at least nine active clinical trials in non-small cell lung cancer by the end of 2022, including five with Trodelvy as well as programs with Zimberelimab, Domvanalimab, and Etruma, Merck's KEYTRUDA, AstraZeneca's durvalumab, and our own magrolimab.\n\nEight trials are already underway, including the phase 3 EVOKE-01 study and second to third-line non-small cell lung cancer and our phase 2 EVOKE-02 study in first-line non-small cell lung cancer without actionable mutations. Our partner, Merck, also plans to initiate the phase 3 EVOKE-03 study later this year to evaluate the combination of Trodelvy and KEYTRUDA in first-line patients with non-small cell lung cancer whose tumors express high levels of PD-L1. Additionally, with our partner, Arcus, we're looking forward to the fourth interim analysis of the phase 2 ARC-7 trial evaluating ZIM and DOM in PD-L1 high non-small cell lung cancer before the end of the year. Data from ARC-7 are expected to support our ongoing phase 3 studies for DOM-based combinations in lung cancer, including STAR 121, which just achieved first patient in.\n\nLung cancer is a disease area with high unmet need, and we believe we have multiple promising MOAs and potential combinations that could help bring additional new treatment options to patients. To explore these opportunities, we plan to initiate two phase 2 signal-seeking platform studies, Velocity and the ARCUS-led Edge 1 in the coming months. Overall, we have initiated a comprehensive evaluation of the assets in our portfolio to address the significant unmet need in lung cancer and look forward to sharing updates in the coming years. Moving to Slide 21.\n\nAnd on behalf of Christi and the Kite team, we're highlighting our expanding clinical pipeline as we build on the growing momentum and adoption of cell therapy based on the significant survival benefit that Yescarta and Tecartus are delivering to patients. We believe there are still opportunities to bring Yescarta and Tecartus to more patients by moving into earlier lines as well as new indications. As you can see, we have recently enrolled patients in several studies, including ZUMA-24, a phase 2 study to evaluate Yescarta in an outpatient setting for second-line LBCL and ZUMA-22, a phase 3 study for Yescarta in second-line plus high-risk follicular lymphoma. We also expect to begin screening for patients for the ZUMA-23 study of Yescarta in Q4.\n\nThe decision to initiate a phase 3 trial in first-line HR LBCL was based on the encouraging data from ZUMA-12 where Yescarta demonstrated 89% ORR and 78% CR. Additional studies include an evaluation of Tecartus in rare B-cell malignancies and Kite 363 is evaluating a CD1920-bisystronic CAR-T in post-CD19 third line plus LBCL. We're committed to continuously improving the safety and efficacy of our cell therapies through both internal pipelines and external partnerships. On Slide 22, we turn to hematology and highlight the breadth of our programs across MDS and AML.\n\nFor magrolimab, we fully enrolled our phase 3 ENHANCE study in MDS ahead of schedule. Our discussions with the FDA and other regulators continue, and we expect to share an update in early 2023. Moreover, enrollment for the two AML trials, ENHANCE-2 and 3 is well underway, and we're targeting top-line data in 2024. A few weeks ago, we announced our oncology collaboration with MacroGenics to develop bispecific antibodies.\n\nThis includes the exclusive option to license MGD-024 and a bispecific antibody that binds to CD123 and CD3, currently in phase 1 as well as 2 additional research programs. This complements magrolimab and furthers our work as we explore therapies that could translate into better clinical outcomes for patients with AML and MDS. Finally, we were pleased to FDA granted KITE-222 orphan drug designation at the end of September. It's the first CLL1 targeted CAR-T and is currently enrolling patients in a phase 1 study.\n\nOn Slide 23, I want to take a moment to welcome MiroBio to Gilead. We completed the acquisition a few weeks ago and pleased to add the MiroBio team to the Gilead Research family and bring their proprietary discovery platform an immune inhibitory receptor agonist to our portfolio. This acquisition complements our inflammatory disease cornerstones, including IBD, RA, and systemic lupus and opens opportunities in other indications. We're excited to continue to explore and develop these antibody agonists, which we believe have the potential to induce immunosuppressive signaling and restore tolerance in autoimmunity.\n\nWrapping up, I'll note that we now have 60 clinical programs underway here at Gilead, spanning a broad range of indications across urology, oncology, and inflammation. We've accomplished a lot in 2022 and yet feel we're really just getting started in exploring the possibilities offered by our portfolio. With that, Andy?\n\nAndy Dickinson -- Chief Financial Officer\n\nThank you, Merdad, and good afternoon, everyone. We are pleased to share another strong quarter of results, with sequential and year-over-year growth in every franchise across our core business. As shown on Slide 25, product sales, excluding Veklury, grew 11% year-over-year despite a $130 million headwind from FX. If we exclude this FX impact, in addition to the impact of previous HIV LOEs, total underlying sales growth year-over-year was 15%.\n\nMoving to Slide 26. You can see that Veklury was down as expected year-over-year, although it more than doubled on a sequential basis from the second quarter. I'll note that with the continued strengthening of the U.S. dollar, the total FX impact on revenue, net of hedges, was higher than expected at approximately $200 million compared to the third quarter of last year.\n\nNon-GAAP product gross margin was 87%, down 320 basis points from last year, primarily due to the third quarter 2021 reversal of a previously recorded litigation reserve. Additionally, non-GAAP product gross margin was impacted by higher Biktarvy-related royalty expense and lower Veklury sales. Non-GAAP product gross margin improved sequentially due to higher HIV and Veklury product sales. Non-GAAP R&D, excluding acquired IPR&D expenses was $1.2 billion, up 10% year-over-year primarily due to investments in oncology.\n\nSequentially, R&D excluding acquired IPR&D expenses was up 6%, driven by investments in oncology and COVID treatments. Acquired IPR&D, reflecting acquisitions milestones and upfront payments for the quarter was $448 million and includes $389 million of expense related to the MiroBio acquisition. Non-GAAP SG&A was $1.2 billion, up 3% year-over-year. Non-GAAP operating margin was 47%, down year-over-year and driven primarily by higher acquired IPR&D expenses and lower Veklury sales.\n\nSequentially, non-GAAP operating margin increased 400 basis points due to higher HIV and Veklury sales partially offset by higher acquired IPR&D expenses. Non-GAAP effective tax rate in the third quarter was 22.4%, higher than normal due to the non-deductibility of the upfront MiroBio payment. Overall, our non-GAAP diluted earnings per share was $1.90 in the third quarter of 2022 compared to $2.65 for the same period last year. Of note, the MiroBio transaction impacted post-tax EPS by $0.31 a share and this was not reflected in the full-year guidance we shared back in August.\n\nOn Slide 27, we take a quick look at our performance year-to-date, which shows total product sales, excluding Veklury at $16.7 billion up 7% year-over-year. If we exclude the approximately $385 million of FX headwinds year-to-date as compared to the same period last year, in addition to the impact of the HIV LOEs, the underlying growth year-to-date is 11%. Veklury, as expected, is down year-to-date highlighting the lower demand for COVID-19 treatment in this stage of the pandemic. Moving to Slide 28.\n\nWe are increasing our full year sales guidance to reflect our year-to-date results and our expectations for Q4, including our latest view of FX. For revenues, we now expect total product sales of $25.9 billion to $26.2 billion, up from our previous range of $24.5 billion to $25 billion. This reflects the strong performance year-to-date notably very strong growth in HIV, Veklury in cell therapy and incorporates our expectations for the broader macro environment, including FX, which will once again be a headwind in the fourth quarter. In HIV, as Johanna discussed, we expect HIV revenue in Q4 to be roughly flat on a sequential basis.\n\nIn cell therapy, we expect slower growth on a sequential basis primarily due to stabilizing demand following the second-line LBCL launch and FX headwinds. Additionally, we are taking a cautious view with regards to both the current shortage of fludarabine, which we expect to be partially mitigated later in the fourth quarter, and the competitive landscape as our peers improve their manufacturing reliability. Moving to Veklury. And with year-to-date revenue of $2.9 billion, we are increasing our expectations to approximately $3.4 billion for the full year.\n\nNote that we expect Veklury sales to continue to track hospitalization rates, and our guidance assumes no significant increase in hospitalization rates from the third quarter levels. Excluding Veklury, we expect our total product sales to be $22.5 billion to $22.8 billion, representing growth of 5% to 6% year-over-year, compared to our prior range of $22 billion to $22.5 billion. As for the rest of the non-GAAP P&L, product gross margin is now expected to be in the 86% to 87% range, compared to our prior guidance of approximately 85% to 86%. There is no change to our R&D guidance, where we expect full-year R&D expense to increase by a mid-single-digit percentage, compared to the 2021 baseline of $4.5 billion.\n\nMoving to acquired IPR&D, we are not issuing guidance for the full year. And similar to what we did with MiroBio this quarter, we'll update our EPS guidance quarterly as needed to reflect any relevant activity during the quarter. What we've included here is the year-to-date acquired IPR&D amount, including approximately $0.04 per share associated with the MacroGenics collaboration that we announced last week. The guidance shared today does not include any upfront payments related to normal course of business partnerships or licensing deals that we might close in the fourth quarter.\n\nFor SG&A, with our continued investment across our commercial organization and expectations for higher costs as a result of inflation, we continue to expect SG&A expenses to grow by a low single-digit percentage compared to 2021. Altogether, we expect operating income to be $11.8 billion to $12.2 billion for the full year, up from $11 billion to $11.6 billion previously. And finally, we now expect our non-GAAP diluted earnings per share to range between $6.95 to $7.15 per share, up from $6.35 to $6.75 previously. This EPS guidance range is approaching our 2021 non-GAAP EPS results despite an expected $2.2 billion decline in Veklury revenue and a more than $0.5 billion in total FX headwinds anticipated through the end of the year as compared to 2021 rates.\n\nThis highlights the strength of our core business, which is now expected to grow in the 5% to 6% range in 2022. on a GAAP basis, we expect our diluted earnings per share to range between $3.35 and $3.55 per share, compared to $2.90 and $3.30 per share previously. Finally, on Slide 29, you can see that there is no change to our capital allocation priorities. In the quarter, we returned over $1.1 billion to shareholders, including $928 million in dividend payments and $180 million in share repurchases.\n\nAs we announced previously, we repaid $1 billion of debt early in the third quarter and have returned to the same debt level we were at prior to the Immunomedics acquisition. With that, I'll invite the operator to open the Q&A.\n\nOperator\n\n[Operator instructions]. Our first question comes from Chris Schott with JPM. Chris, your line is now open.\n\nChris Schott -- JPMorgan Chase and Company\n\nGreat. Thanks so much for the question. My question was on lenacapavir and in treatment. I want to talk a little bit about -- maybe first, islatravir and the lift of the clinical hold.\n\nHow interesting is that as a partnered asset relative to your internal programs? And then the second part of that, just a bigger picture one in treatment. Do you see the portfolio with lenacapavir resulting in, I guess, a number of different combos that serve different segments of the market? Or is it more likely you're going to end up with one of these combos that really separates from the other and becomes an anchor-type asset like we see with Biktarvy? Thanks so much.\n\nMerdad Parsey -- Chief Medical Officer\n\nChris, this is Merdad. Let me first start by saying that we are really excited about the recent approval for lenacapavir in this -- in the highly treatment-experienced population. Obviously, that's a group of people who have limited options, and I think lenacapavir as a new class provides a new opportunity for them. In terms of islatravir, what we like about islatravir is that it is fairly late in its development.\n\nWe are able to be in phase 2 with that. And I think it provides us a relatively near-term opportunity to launch a partner in treatment for lenacapavir that could be given in a long-acting way. And I think that's really important in terms of where the market is going and what our goal is in terms of, as we've said before, providing a long-acting parenteral option that is longer than in the three months or longer time frame. And we're optimistic about our ability to do that.\n\nSo for that, we have our internal pipeline assets that are really providing our options there. For islatravir, that's part of our oral program. And for us, we do think that we have a number of opportunities in terms of oral programs to provide weekly oral treatment options for people using lenacapavir. And right now is a potential.\n\nCertainly islatravir is an option there, and we have other options in our pipeline that could potentially get that -- get to that level. So the way I look at it, just to answer directly your last question, we do think that there will be a lenacapavir partner, and there will be probably one partner that will achieve our therapeutic goals in oral, potentially a different partner in parenteral. And as we go forward, if we can make improvements whether that's lenecapavir and being able to provide even longer than six-month therapy or to the partner that we could extend the duration of therapy with a different molecule or a different formulation we'll always try to get to that longer exposure. So over time, I expect us to continue to try to innovate and move forward.\n\nJohanna Mercier -- Chief Commercial Officer\n\nSo maybe just to add to that, Chris, in light of what Merdad was just referring to, we've done a lot of patient market research to really understand the segments within the oral market, but also with the long-acting market, specifically in treatment, which is quite different to your point, to prevention. And in the treatment setting, it is clear that you will always have a market for that daily oral, which we believe Biktarvy has really set the standard there. And then there are others that the weekly oral will be more preferred. Some people just want to make sure they're taking something every single day.\n\nOthers don't want to be reminded that they have HIV. And then you have, obviously, the injectables or the subQ with lenacapavir combinations every three months or potentially even every six months that will be very appealing to some that don't want to be reminded at all. And so those are kind of the segments we're trying to play out. So I do think as a long-acting, there will be more of a split segment than we've seen in the daily oral.\n\nJacquie Ross -- Vice President, Investor Relations\n\nAmber, you ready for the next question, please?\n\nOperator\n\nOur next question comes from Salveen Richter with Goldman Sachs. Salveen, your line is now open.\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nGood afternoon. Thanks for taking my question. On the TIGIT program, what is the likelihood that we'll see PFS data at this point? And if we don't, when could that come? And then based on the interim updates, it does seem like you already have clear benefit on ORR at least on the doublet arm versus monotherapy. So would love to see if you could just walk us through the possible scenarios with this data readout.\n\nAnd if there's any outcome that could impact the recently initiated phase 3 studies.\n\nMerdad Parsey -- Chief Medical Officer\n\nThanks, Salveen, this is Merdad again. Yes, maybe I'll start by saying that really, nothing has really changed in terms of the ARC-7 study and where we're headed. And the reminder make is that this is going to be the fourth interim analysis for the ongoing phase 2 study and enrollment was only recently completed over the summer. And so when we look at that, if you think about it in that context, to your point, we continue to look for consistency in the DOM and ZIM combination as a doublet in the ORR to bolster our ongoing phase 3 program, right, just to underline our confidence in the TIGIT and DOM combination.\n\nBased on the data we've seen already, and this should continue to support that. in terms of PFS, I think PFS is -- as I tried to allude to, given the fact that enrollment went on until fairly recently, the likelihood is that PFS is going to be fairly immature and may not be informative. And certainly, when we think about the triplet there as well, it's unlikely that PFS is going to be informative, but it may be. And so we'll look at that, and our plan is to evaluate the data and then decide with our partners at Arcus what the data and how we approach it.\n\nAnd certainly, as we've said before, making sure that we are sharing the data at a medical conference next year. And exactly to your point, it's really about confirming the confidence we already have in TIGIT and moving into phase 3 with our -- with the lead programs that we're moving with. So I hope that answers your question.\n\nJacquie Ross -- Vice President, Investor Relations\n\nAmber, may we have our next question?\n\nOperator\n\nOur next question comes from Brian Abrahams with RBC. Brian, your line is now open.\n\nBrian Abrahams -- RBC Capital Markets --- Analyst\n\nGood afternoon. Congrats on the quarter, and thanks for taking my question. A question on Trodelvy. With the maturing TROPiCS-02 overall survival data and the evolving competitive landscape, I'm curious on your latest views on where you see Trodelvy fitting in, in the HR-positive/HER2-negative population.\n\nAny updates on market research on how it might be used, your commercial strategy to align with that? And curious also your latest expectations on how effective it could be post in HER2 in certain patients who may receive that first? Thanks.\n\nJohanna Mercier -- Chief Commercial Officer\n\nBrian, it's Johanna. Thanks for the question. So basically, let me start by saying with Trodelvy, the performance for the quarter has been really strong. We're seeing 78% year-on-year growth, 13% quarter-over-quarter.\n\nAnd we're seeing markets add in every week basically. And reimbursement kind of playing out. We have now over 13 countries ex U.S. that have gotten reimbursement.\n\nSo we're seeing really strong launches namely France, Germany right now and other markets coming in as we're speaking. So strong foundations there. I think having OS data in both triple-negative breast cancer as well as now with TROPiCS-02 in the HR-positive/HER2-negative, patient population really helps the foundation for Trodelvy but really helps across breast cancer. To your specific question around kind of where do we position ourselves, obviously, with TROPiCS-02, we're in previously treated -- heavily treated lines of therapy, right, when you think about this patient population, so a little bit different than some of our competitors.\n\nAnd so we're excited actually because these patients have very limited options. And so now with Trodelvy, there is a real potential for overall survival in these late-line patients. So we do think that as we're playing it out, as we're doing our market research, we feel very confident that Trodelvy will be very well positioned in the marketplace, and we'll build on the success that we've seen thus far in triple-negative breast cancer as well in how we're playing that out. So we expect continued momentum in our base business.\n\nAnd I might have mentioned before in one of the previous calls, how we've expanded our footprint, specifically in the U.S. to prepare for both not only the expansion of what we need to do in triple-negative breast cancer, but also what we need to do in HR-positive. And so we're well poised to make sure that we're ready for that PDUFA date coming up in February to make sure that we're successful.\n\nMerdad Parsey -- Chief Medical Officer\n\nAnd maybe -- this is Merdad. Maybe I'll add to that. We're not done, right? And I think we're excited about how much we've been able to achieve with Trodelvy so far, and you've seen consistent positive data across tumor types. And in particular, I think, as Johanna highlighted, the late-line therapy, certainly, those are patients who may now -- there's a potential that some of them will be getting in HER2 beforehand.\n\nWe don't have data on sequencing, but I do believe that there may be those who decide to treat for those patients who may not respond adequately to in HER2 to later lines, right? So that's kind of where, certainly, there's an opportunity there. The other thing I would add is that we've got really strong data in triple-negative breast, including the HER2 -- sorry, in HR-positive breast cancer, including the HER2 0 population. And I think that's a very important distinction and really important to remember. And then finally, based on what we've seen so far and the clinical benefit we've brought, we certainly believe that there's an opportunity for us to move to earlier lines of therapy as well in breast cancer in triple-negative, in HR-positive, and in other tumor types.\n\nI think that's -- our excitement about Trodelvy has always been the ability to go into broad tumor types, and our strategy has always been to advance into earlier lines of therapy as we generate positive data.\n\nJacquie Ross -- Vice President, Investor Relations\n\nMay we have our next question, please?\n\nOperator\n\nOur next question comes from Michael Yee with Jefferies. Michael, your line is now open.\n\nMichael Yee -- Jefferies -- Analyst\n\nHey, guys. Thanks. Congrats on a great quarter. I also wanted to ask Merdad a question on Trodelvy in lung cancer.\n\nI mean I would think that this is an even bigger opportunity than breast cancer on EVOKE-01 which is ongoing. Can you confirm you think you would update next year and how you think about that opportunity versus second-line docetaxel? I know there's some early response rates based on the basket study when you acquired Immunomedics. And I was wondering if you had more data in lung cancer that you've been observing to give you more confidence there. And then you commented on EVOKE-02 and EVOKE-03, which is first line.\n\nI just wanted to understand if you think we would update on EVOKE-02 next year. I would think that's pretty big trying to replace chemo. So maybe comment on EVOKE-01 and EVOKE-02. Thank you.\n\nMerdad Parsey -- Chief Medical Officer\n\nYes, Michael, Merdad, thanks for the question. I think just to follow on, it's a great follow-on to the prior question around our ability to really look across tumor types and earlier lines. And in particular, I think what you're referencing is our confidence in going into early line lung cancer and starting those studies. To your point, we've seen data, as you know, very well from our early phase 1b study in lung cancer.\n\nAnd we continue to enroll and we've initiated now studies looking at both the second- and third-line setting and we and then as well as in the frontline setting. As you know, we're doing a study in combination with OCO 3 with the PD-1 and the PD-L1 high population, which I think is really an important trial for us to proceed on. So I think what I would say is that the timing of the data, Michael, is always difficult to predict. We have to see how the study enrollment goes, and it's early days.\n\nBut we're really excited about the opportunity to bring meaningful therapy to a group with a very high unmet need.\n\nJacquie Ross -- Vice President, Investor Relations\n\nAmber, may we have our next question, please?\n\nOperator\n\nOur next question comes from Brian Skorney with Baird. Brian, your line is now open.\n\nBrian Skorney -- Baird -- Analyst\n\nThanks for taking the question. Maybe perhaps for Merdad, just kind of jumping off on the long-acting HIV discussion. I noticed in the pipeline slides, long-acting bictegravir has been removed from the pipeline. Obviously, it would have been nice to have a known entity like the bictegravir part of the combo.\n\nI was just wondering any insight to what happened in phase 1 there? Is it sort of bictegravir missing a PK threshold? Or is it something that you're seeing with the 6212 or 589 for -- that gives you more confidence there? Thanks.\n\nMerdad Parsey -- Chief Medical Officer\n\nYes. Thanks for the question. Happy to expand on that. Yes, look, bictegravir is an amazing molecule and has done a lot for patients.\n\nAnd one of the opportunities we looked at is in addition to thinking about bictegravir for long-acting oral was to see if we could give it as a long-acting subcutaneous. And really, what happened is we had tolerability issues just given that molecule subcu in terms of injection site reactions. So it's not about the molecule itself. One of the challenges of developing long-acting subcutaneous therapies is tolerability.\n\nAnd so I want to make sure that it's clear that bictegravir is an oral agent continues to be a huge part of where we want to go. And then maybe just to step back to your point, the way I think about it, maybe the way to think about is from a PrEP standpoint, long-acting, we are lenacapavir, it's prep for long-acting and that -- those studies are underway, moving along nicely. From a treatment standpoint, as I mentioned earlier, lenacapavir is a huge part of our backbone therapy for us. And now we are looking at a number of different opportunities to get to long-acting oral and long-acting parenteral.\n\nAnd molecules like lenacapavir don't come along every day. We are looking for a number of -- at a number of molecules. We think we have the world-class expertise in chemistry and preclinical development that gives us a leg up on the competition to get to those molecules that will really get to the need that Johanna has laid out, which is to get to the subcutaneous or every three-month dosing or even longer, and that's what we're looking for.\n\nJacquie Ross -- Vice President, Investor Relations\n\nAmber, may we have our next question, please?\n\nOperator\n\nOur next question comes from Matthew Harrison with Morgan Stanley. Matthew, your line is now open.\n\nMatthew Harrison -- Morgan Stanley -- Analyst\n\nGreat. Good evening. Thanks for taking the question. I just wanted to ask a question on Slide Q4 five.\n\nCan you just talk a little bit about the range of possibilities you might be thinking about in terms of what a phase 3 might look like? And then just sort of where you see commercially, what sort of data you might need to compete just given the fact that it may be hard to have the same kind of data set as some of those pills that were developed earlier in the pandemic. Thanks.\n\nDan O'Day -- Chairman and Chief Executive Officer\n\nHey, Matthew, Dan O'Day here. So we'll have Merdad take the first part of your question, and then Johanna can into the second.\n\nMerdad Parsey -- Chief Medical Officer\n\nYes. Thanks, Dan. Yes. Thanks, Matthew.\n\nSo 5245 has, as you know, we started those trials in phase 1 earlier this year. Things are going well. And as you know, the pandemic has changed a lot. And I think you make an excellent point that looking at high-risk patients is a challenge right now in looking at high-risk patients who may get hospitalized as a challenge right now, giving vaccination, other treatment options.\n\nSo exactly to your point, I think the discussion we're having internally and with our regulators is what's the best population for us to establish the benefit of 5245. And how does that anticipate what might come down the road, which has been the unpredictable part, whether that is resistance to other agents, the need for combination agents, new variants that may increase the hospitalization rates. Those are all the things that we have to be prepared for. And we really see 5245 as a way -- as we move forward with that and move into clinical trials once we demonstrate its efficacy as an important tool should the pandemic start to pick up again, heaven forbid, but that's how we think about it.\n\nSo both combinations and treating resistance or a new surge.\n\nJohanna Mercier -- Chief Commercial Officer\n\nYes. So in line with that, Matthew, it's Johanna. I would just add to what Merdad is saying. So I think from a commercial standpoint, what we're thinking is the fact that it doesn't have a boosting agent is a real plus here as well as the fact that we're going to look at rebound effects as we've seen with current marketed products right now have that issue.\n\nAnd so -- in addition to the antiviral activity. So I think those pieces are kind of what we're thinking about as well as you well know, drug-drug interactions has been a bit of an issue with some of the current agents today. So I think if you -- without the boosting agent, I think those will just open up a little bit more for a broader patient population potentially to really benefit. And as we've seen with this pandemic, it's not over.\n\nWe've seen hospitalizations go up and down. We've seen a little bit of an increase most recently, and we're tracking that very closely with hospitalizations, of course, because of Veklury. But we do believe that there's still opportunity for more options here to make sure that we curve this pandemic.\n\nDan O'Day -- Chairman and Chief Executive Officer\n\nAnd, Matthew, this is Dan. I'll just add one other thing in addition to my colleagues, which is in our conversations with the U.S. government, particularly the recent fast track designation that was applied to GSV-245, there's three major things that they're interested in to. Number one is more oral antivirals.\n\nNumber two, to the points that both Merdad and Johanna made, working across the variance as the virus continues to mutate. And then thirdly, lack of DDI, lack of boosting, and this rebound issue. So I think it's a recognition of the fact that there is a need for the ongoing pandemic/endemic, whatever you want to call it with COVID for additional options. And I think that's expressed in the way the U.S.\n\ngovernment wants to work closely with us as we continue to develop this program.\n\nJacquie Ross -- Vice President, Investor Relations\n\nAmber, may we have our next question, please?\n\nOperator\n\nOur next question comes from Tyler Van Buren with Cowen. Tyler, your line is now open.\n\nTyler Van Buren -- Cowen and Company -- Analyst\n\nHey, guys. Thanks. Congratulations on the results. Great quarter.\n\nI had a follow-up, a high-level question on Biktarvy. So the product continues to see very impressive uptake, and it looks like it will be around 60% of HIV product revenues this year. So where do you expect the product to peak out as a percentage of HIV sales over the next several years?\n\nJohanna Mercier -- Chief Commercial Officer\n\nTyler, it's Joanna. Thanks for the question. I would say that we're really proud of the Biktarvy performance, but I would say even the increased momentum that we're seeing. And this is not just in the U.S., this is really around the globe.\n\nAnd so we're just about 45% market share with Biktarvy. We've seen 4% share gain year-on-year. And now we're looking at an annual run rate in excess of about $10 billion. So I do think we're very well poised for the future.\n\nThe -- we're looking at both the naive share, obviously, just about under 60% of that share right now with Biktarvy, so really setting the standard for new patients coming into HIV. And obviously, the switch share, and you can't -- switch share is obviously a little bit lower because you can switch to Biktarvy if you're already on Biktarvy. So, therefore, we're tracking that very closely as well, but making sure that when there is an opportunity either from older drugs or when there have been some issues for patients to really come on to Biktarvy just because it really does have a profile from an efficacy standpoint and safety standpoint. So we do believe that continued growth with Biktarvy is on the agenda.\n\nAnd I would also add just a little bit of a note around the market as well, which also helps, right, because where the market goes, Biktarvy goes and where Biktarvy goes, the market goes. We've seen market stabilization actually back to pre-pandemic levels and growing at about 2% or so year-on-year, both in the U.S. as well as in Europe. And so that also really helps our momentum continue and Biktarvy is driving that as well, of course, in a lot of our efforts.\n\nThe teams have worked very closely with community partners and physicians and advocacy groups to make sure that we get patients back into clinics, back into care, both from a screening standpoint and diagnosis standpoint. Now that we're -- and you really see those numbers back to pre-pandemic. So I think we're in good place moving forward and well poised for the future to continue this leadership in HIV driven by Biktarvy.\n\nJacquie Ross -- Vice President, Investor Relations\n\nAmber, we'll squeeze in just two more, please. Maybe go to the next caller.\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nOur next question comes from Umer Raffat with Evercore. Umer, your line is now open.\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nHi, guys. Thanks for taking my question. I wanted to touch up on a slightly different topic today, and I have a two-part question for Dan and Andy. And this is on the tenofovir litigation that's been ongoing.\n\nAnd then I guess my question really was there's a very unusual amount of plaintiffs aggregated up in this case. And I'm curious, is it something you guys are looking to take to a final judgment? Or would you be open to a settlement? And that brings me to sort of the second part, Andy, how much of a legal charge have you taken on this litigation to date? Because I know you've been doing that on the Biktarvy and other indications in litigation in the past. And is there something more significant that has to happen for a more prominent charge to show up? I ask because every company handles the accounting differently. So I was just curious.\n\nThank you.\n\nDan O'Day -- Chairman and Chief Executive Officer\n\nThanks, Umer. Let me just start before I hand it over to Andy to say, obviously, with any litigation, we're -- we don't comment on ongoing litigation in any level of detail. I do want to emphasize the confidence we have in our overall patent portfolio in general. And maybe with that, I'll hand it over to Andy to answer some more specifics of your question as well.\n\nAndy Dickinson -- Chief Financial Officer\n\nYes. Thanks, Dan. Umer, thanks for the question. Happy to touch base on this.\n\nThis is a topic, as you know, that we've been getting a lot of questions on with the Zantac litigation. So a number of things that I can provide some background and context. So first of all, like most companies, anyone operating in the U.S., we are routinely managing a lot of different litigation matters, as you know. Many of those are from our perspective, meritless or baseless.\n\nAs a matter of practice, we don't typically -- or usually comment on specific litigation cases. What I can say stepping back is that we have won to resolve the three material litigation -- or three material litigation matters over the past year, as you know, on terms that were favorable to the company and to our shareholders, that is the Juno-Kite IP litigation, the ViiV IP litigation around bictegravir, then the third was the TAF litigation with generic companies. We have an outstanding legal team, both internally and externally. And then maybe to your specific question, I mean, we have complete confidence in the merits of the defense on the ongoing product liability case.\n\nSo it is very different than the Zantac litigation case. So just to your question on the number of plaintiffs, for instance, if I remember correctly in the Zantac cases, there were 250,000 patients in our case -- I'm sorry, plaintiffs. There were 25,000 in ours. But the key difference is that the issues at hand here, I mean, our TDF-based products are life-saving products that really transform care for HIV.\n\nAnd the side effects of the products were in the label from day one. The labels in the U.S. and Europe were slightly different at the labels were there. These were well-known, well-disclosed potential side effects.\n\nAnd I think that's an important piece of it. So it's a very different case. The Zantac I remember correctly was taken off the market and reformulated. So I'd be careful about drawing too many parallels between what you saw with Zantac and some of the companies that were affected by that in this litigation.\n\nThat doesn't mean that we don't take it seriously. We do take it very seriously. And as I said, we have a great team that's working on it. The last thing, Umer, maybe the last two things, there are a number of amicus briefs that have been filed.\n\nThose are all publicly available. This is in the California state litigation that I would encourage you to read. I think there are four or five Amicus briefs that really speak to how different this cause of action is relative to what you would typically expect to see in a case. And then finally, on the charge, no, we have not taken a charge.\n\nAnd as I said, we feel very strongly about the merits of our case and look forward to proceeding with the litigation over the coming months and years. So good question. Thank you.\n\nJacquie Ross -- Vice President, Investor Relations\n\nAmber, may we go to our last question, please.\n\nOperator\n\nOur last question comes from Geoff Meacham with Bank of America. Geoff, your line is now open.\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Good afternoon, guys. Thanks for the questions. And, Merdad, I want to follow up on a few questions that you've gotten on long-acting HIV.\n\nI know it's been tricky to develop a doublet that has a comparable profile to lenacapavir, but is there a mechanism that you have either in-house or that you've seen in HIV that looks like it's more straightforward to develop long-acting? I wasn't sure if Integrace would be better than new versus non-new, something of that category? Thank you.\n\nMerdad Parsey -- Chief Medical Officer\n\nThanks, Geoff. This is Merdad. Yes, we're -- I think our chemistry and our virology team do favor the as a class where we believe that we have a better shot at getting to a long-acting partner for the capsid inhibitors. So I would say a fair bit of our effort is going into those.\n\nBut -- and we are open to looking at a variety of mechanisms to achieve our goal. We just think that the entities are more likely to get there. I will remind you this may have gone under the radar, but we do have the program where we are looking at the BNAB. I did mention it in the script and that does provide us another option for people from a long-acting standpoint where we're looking at every six months potentially there.\n\nSo we are pretty open and committed to finding the right partner that will achieve our goals.\n\nDan O'Day -- Chairman and Chief Executive Officer\n\nTerrific with that. This is Dan. I just want to thank all of you for joining today. And I just wanted to emphasize how we believe our third quarter performance demonstrates the tangible impact of delivering on our strategy.\n\nAfter putting the right foundation in place over the past three years, we're now seeing the positive momentum that continues to build. It's an exciting time for the company as we realize our potential to do more, to reach further to help more patients and the communities we serve. So I just want to take this opportunity to thank all the colleagues again at Gilead and Kite to thank all of you for joining your interest in Gilead. And as usual, if you have any additional questions, please reach out to our investor relations team.\n\nAs you know, they're more than happy to help. And thank you for joining today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJacquie Ross -- Vice President, Investor Relations\n\nDan O'Day -- Chairman and Chief Executive Officer\n\nJohanna Mercier -- Chief Commercial Officer\n\nMerdad Parsey -- Chief Medical Officer\n\nAndy Dickinson -- Chief Financial Officer\n\nChris Schott -- JPMorgan Chase and Company\n\nSalveen Richter -- Goldman Sachs -- Analyst\n\nBrian Abrahams -- RBC Capital Markets --- Analyst\n\nMichael Yee -- Jefferies -- Analyst\n\nBrian Skorney -- Baird -- Analyst\n\nMatthew Harrison -- Morgan Stanley -- Analyst\n\nTyler Van Buren -- Cowen and Company -- Analyst\n\nUmer Raffat -- Evercore ISI -- Analyst\n\nGeoff Meacham -- Bank of America Merrill Lynch -- Analyst\n\nMore GILD analysis\n\nAll earnings call transcripts"
}