{
  "companyName": "Genesco",
  "companyTicker": "GCO",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/01/genesco-gco-q2-2023-earnings-call-transcript/",
  "content": "Genesco (GCO 1.10%)\nQ2 2023 Earnings Call\nSep 01, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to Genesco second quarter fiscal 2023 conference call. Just a reminder, today's call is being recorded. I will now turn the call over to Darryl MacQuarrie, senior director of FP&A. Please go ahead, sir.\n\nDarryl MacQuarrie -- Vice President, Financial Planning and Analysis\n\nGood morning, everyone, and thank you for joining us to discuss our second quarter fiscal 2023 results. Participants on the call expect to make forward-looking statements. These statements reflect the participants' expectations as of today, but actual results could be different. Genesco refers you to this morning's earnings release and the Company's SEC filings, including the most recent 10-K and 10-Q filings, for some of the factors, including the impact of COVID-19, supply chain issues, and the current economic environment that could cause differences from the expectations reflected in the forward-looking statements made during the call today.\n\nParticipants also expect to refer to certain adjusted financial measures during the call. All non-GAAP financial measures referred to in the prepared remarks are reconciled to their GAAP counterparts in the attachments to this morning's press release and in schedules available on the Company's homepage under investor relations in the quarterly earnings section. I want to remind everyone we have posted a presentation summarizing our results that is accessible on our website. With me on the call today is Mimi Vaughn, board chair, president, and chief executive officer, who will begin our prepared remarks with an overview of the period and the progress we are making on our strategic initiatives to drive the business this fiscal year, and Tom George, chief financial officer, who will review the quarterly financials in more detail and provide guidance for fiscal '23.\n\nNow I'd like to turn the call over to Mimi.\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nThanks, Darryl. Good morning, everyone, and thank you for joining us today. After last year's record fiscal '22 results, we are pleased with our second quarter performance, our strong first half of this year and the longer-term direction of our business. Following a stimulus-induced spending environment, in which consumers had ample disposable income to drive strong sales gains that significantly benefited the first half of last year, we are pleased we continue to drive our business forward and maintain the large majority of those gains.\n\nOur footwear-focused strategy is working and has created a much more resilient and fundamentally stronger business. The work we have done over the last few years to increase our digital penetration, strengthen our consumer connections, grow our footwear brands, and reduce and reshape our retail cost structure has put the company in a better position to both outperform and favorable economic backdrops and successfully navigate more difficult market conditions like we are facing today. Our second quarter performance highlights the benefits of our multi-divisional business model. Stronger than expected results that Schuh and Johnston & Murphy helped overcome some softness late in the quarter versus expectations at Journeys, due to an increasingly challenging macro environment, which is affecting certain segments of consumers more than others.\n\nThat said, Journeys year-over-year sales trends improved meaningfully each month in step with an improved inventory position on key brands and styles. This combined with the strength that Schuh and J&M and careful expense control allowed us to offset the lighter overall sales and deliver adjusted EPS that surpassed our expectations boosted further by a favorable compensation expense adjustment Tom will discuss later. The Schuh team did a tremendous job capitalizing on recent product and marketing initiatives, outperforming its competition in the U.K. marketplace fueled by pent-up demand and a warm summer.\n\nAt the same time, the reimagining of the J&M brand continues to attract a wider and younger audience at a time when its consumers are returning to life and looking to refresh their wardrobes. And across all our businesses, we have held on to the bulk of the digital gains we drove during the pandemic as we have grown this highly profitable channel. Our progress is especially evident, compared to where our business was before the pandemic began. A few key highlights of the second quarter include: compared with the pre-pandemic second quarter of fiscal '20 revenue grew 10% despite having 5% or 80 fewer stores.\n\nDigital sales grew more than 75% now representing 18% of total retail sales, compared to 10% in fiscal '20. Our branded wholesale sales increased more than 100% over the same time period spurred by our acquisition of the Levi's business. Gross margins were in line with our expectations, despite an increasingly promotional environment in the U.S. and operating income more than doubled that of fiscal '20 leading to adjusted EPS of $0.59 versus $0.15 in the second quarter of fiscal '20.\n\nAnd in addition, our business accelerated throughout the quarter with sequential monthly improvement in retail sales, compared to a year ago as we flowed in fresh product and accomplished the significant task of reinventorying and stimulus compares began to ease. And while at the same time investing in our business, we returned a notable amount of capital to shareholders opportunistically repurchasing $45 million of stock during the quarter representing about 6% of shares outstanding. Turning now to discuss each business in more detail, beginning with Journeys. While the second quarter started well with May and June benefiting strongly from the good work Journeys merchants have done to reinventory and achieve pre-pandemic inventory levels for the first time since the onset of the pandemic, sales did not further accelerate as much as we expected in July.\n\nThis trend included the last two weeks of the month, which is the beginning of the back-to-school season. Sales have since reaccelerated in August and are nicely up above last year, but we expected an even sharper acceleration given our vastly improved inventory position and a normal back to school this year. We are seeing some evidence of the Journeys consumer getting squeezed by inflation, making fewer trips to the mall, waiting for tax-free events to shop, delaying purchases until the time of need and trading down to more affordable price point footwear. The strength of Journeys vendor relationships and the breadth of its assortment have allowed the team to quickly pivot its current offering to more excessively priced products that aligns with the current more budget-conscious consumer.\n\nWhile we anticipated stronger store traffic, our motivated store associates have made the most of each customer crossing the lease line, driving improved conversion and higher transaction size, helped by higher ASPs as we ended the quarter. I've been describing the current fashion cycle is shifting away from fashion athletic more into casual, which plays into Journeys strength and casual continued its ascent in Q2 as a bigger part of the assortment. Although markdown and promotional actions have increased from essentially none last year, clean inventory, and more full price selling delivered both better-than-expected and higher Journeys gross margins, compared with pre-pandemic times. Over in the U.K., Schuh's strong second quarter cap -- a great first half of the business, the U.K.\n\nretail market has experienced major disruption during COVID with extended lockdown periods and many retail bankruptcies reshaping the landscape. The Schuh team has made the most of this disruption utilizing its advanced digital offering to drive online and out executing when stores were open. Schuh is also reaping the benefits of better product, brand purpose and marketing strategies. Driving this stellar Q2 performance was a better inventory position that included increased access to higher-tiered styles from several key vendors coupled with pent-up demand as young people enjoyed the warm summer weather and dressed fashionably for summer activities.\n\nSchuh sales continue to exceed expectations on both the constant currency and reported basis, despite the considerable decline of the pound versus the dollar. Constant currency revenue hit a Q2 record, up 9%, compared to last year and up 14% over pre-pandemic sales as strong demand fueled consumer spending, despite historic levels of inflation. Operating income also grew adjusting for last year's rent and other COVID credits. Like Journeys' Schuh strength is its ability to deliver the fashion brands desired by its youth consumer and casual was up as a greater percentage of the mix as well, led by sandal growth and helped by higher prices.\n\nMoving on to discuss our brands. We're incredibly excited about the potential of Johnston & Murphy as we reposition the brand for growth. Our efforts to reimagine J&M for a more casual, more comfortable, post-pandemic environment is delivering outstanding results with Q2 sales up 22%, compared to last year and operating income more than double pre-pandemic levels. Operating income was also up over last year adjusting for last year's sizable pickup from inventory reserve reversals.\n\nGross stemmed from all channels this quarter with stores up 13% year over year, direct up 16% and wholesale up nearly 60%. With return to the office figures well below 50%, the brand is experiencing this growth from a shift in strategy from not just the footwear consumers' need for work, but for footwear and apparel they desire for everyday life driving market share gains. As a measure of this progress, nine of the top 10 SKUs in J&M's DTC business in Q2 were casual and casual athletic styles. Intensified consumer messaging and fresh and continuous streams of new and innovative products with technology differentiating J&M's offerings are driving this growth.\n\nRounding out our brand review. Our licensed brands team has wholly remade this division since the start of the pandemic by adding attractive licenses led by Levi's, acquiring more robust product and sourcing capabilities and diversifying distribution with a focus on more moderate priced retail channels. This transformation was evident with an operating profit this quarter, compared to an operating loss in Q2 of fiscal '20. While its consumer has also been affected by the inflationary environment and we are currently in the midst of a Levi's distribution repositioning, we see an exciting run for this business going forward.\n\nSo shifting now to the current quarter. Back to school in the U.S. has delivered positive results so far and we were pleased to see the pickup in August over July's slower start. However, our expectations for increases for the season and back half over last year for Journeys were even higher at high single-digit growth.\n\nGiven how low we were on inventory and out of stock on core items throughout the back half of last year, we believe we left significant sales on the table and had planned to capture the upside during this year's back to school and holiday season. In addition to the behavior I described for the Journeys customer in reaction to the increasingly difficult macro environment, we are seeing customers come out and shop when there is a reason to buy and retreat to conserve cash during the in between period. Therefore, we're modifying our guidance for the back half in large part to reflect the trends we're currently seeing in Journeys, which while positive over last year or lower than our original forecast. Both the higher income J&M consumer and the Schuh consumer have exhibited resilience in their shopping appetites backed up by lists and traffic over last year.\n\nWe anticipate these patterns will largely persist although we have tempered expectations to account for the increasingly difficult economy that may impact Schuh consumers in the U.K. Our fresh inventory will be a positive and we believe the strength of our concepts position us well to get more than our fair share of consumer demand, especially when the customer has a reason to shop. We can manage inventory by adjusting receipts as needed and do not believe we will need additional markdowns to keep inventories right sized. Based on this more conservative back half outlook, we now expect adjusted fiscal '23 earnings per share to be between $6.25 and $7, somewhere close to the middle of the range is where we anticipate the year will come in.\n\nWe remain confident that our footwear focused strategy will continue to create value as we navigate this inflationary period and exit from it. Driving this strategy are six strategic pillars that emphasize continued investment in digital and omnichannel, deepening our consumer insights, driving product innovation, reshaping our cost base, and pursuing synergistic acquisitions all to transform and meaningfully grow our business. You heard how several initiatives positively impacted second quarter results and I would like to briefly highlight a few others. Starting with Pillar 2, maximize the relationship between physical and digital channels, we are advancing Journeys off mall strategy.\n\nThis initiative was developed to take advantage of the pronounced shift in traffic to more local, neighborhood, community, and power shopping centers. Journeys consumer research also told us its target consumers visit local non-mall shopping centers several times per month and enjoy shopping closer to home. After piloting and analyzing results of some initial locations, we signed more than 25 of these off-mall sites, which are larger than our mall locations and can carry a full assortment of adult and kids products. We opened five of these locations so far and plan on opening another 10 by fiscal year end.\n\nGiven that Journeys is predominantly mall based, we believe this is a meaningful opportunity. At Schuh, we opened a new distribution center in Ireland to better support omnichannel sales there, which also improves the profits of our Irish operations post Brexit. Under Pillar 3, build deeper consumer insights to strengthen customer relationships and brand equity. Schuh is generating positive success with its new loyalty program the Schuh Club.\n\nThis program combines online and store purchases together and allow Schuh to deliver increased personalization for an enhanced customer experience by recognizing and rewarding Schuh's most loyal customers. This program has seen greater success than initially expected with just under 750,000 sign-ups since fully launching in April and is now set to exceed the one million sign-ups targeted for the year. The ability to now recognize more customers at the point of sale has resulted in data capture doubling since the launch of the Schuh Club, giving us a richer set of first-party data. Total spend for club members accounts for almost 30% of total company sales currently with members making purchases at an average order value 14% higher than the average.\n\nJohnston & Murphy's insider program launched last year is seeing similar success with 75% of new customers signing up. Journeys's enhancing brand equity by elevating self-expression through the lens of youth culture and has significantly ramped up its collaborations with content creators across social and streaming platforms resulting in higher engagement and awareness on multiple channels, including TikTok and Instagram. One of the most significant elements of this campaign is a partnership with Karl Jacobs of Mr. Beast Fame as Journey's Creative Ambassador to activate exclusive content to engage his combined reach of 28 million followers across various social platforms.\n\nThese activations introduced Journeys to Karl's gaming community in a creative and authentic way. In an effort to place Journeys top of mind just before back to school, Journeys leveraged its music strategy as the presenting sponsor of the SaaS Summer Festival with events in 18 key markets. Journeys increased investment in digital and social are showing gains in brand awareness and intent to shop. Based on its most recent customer research this summer among 13 to 22-year-olds, Journeys remains a top shopping destination, significantly outpacing other footwear retailers as more welcoming pool, fun and a place to discover new brands and styles.\n\nUnder Pillar 4, intensified product innovation and trend insight efforts, J&M's product innovation strategy has driven substantial growth in the casual athletic category; doubling its size in the DTC channel to almost 40%, thanks in large part to the Amherst and Activate collection. In fact, the number one Amherst style sold more than double the pairs as our number one dress Schuh, further highlighting that this strategic shift into casual and casual athletic has been dramatic and is resonating with the consumer. In summary, we're making meaningful progress across our businesses and strategic initiatives to be the destination for our consumers' favorite fashion footwear. Beyond this, we're proud of the progress we've made on ESG.\n\nWe published an inaugural ESG report on genesco.com outlining our most recent ESG work policies and metrics. We continue to incorporate ESG as a factor in key operating decisions such as redesigning and reducing shoe box sizes and participating in energy reduction programs at the store level. We're committed to do more and look forward to posting you on future progress. To close now, we as a company are very good at navigating challenges and will manage through this period of high inflation and a pressured consumer much in the way we managed and emerged from the pandemic, a stronger and a more profitable company.\n\nAt the core of this are our incredible people and I'd like to thank you for our strong start to the year. Your determination and ingenuity allow us to consistently outexecute through dynamic and choppy environments and I look forward to continued success with you during the remainder of this year. And I'll now turn the call over to Tom.\n\nTom George -- Chief Financial Officer\n\nThanks, Mimi. As Mimi discussed, we were pleased with our performance during the quarter, especially our ability to drive profits ahead of expectations in the current climate. We have a solid foundation to not only navigate the current challenging environment, but also we continue to be confident in the ability of our footwear-focused strategy to drive strong results over time. Consolidated revenue in Q2 was $535 million, down 4% to last year as we continue to anniversary the significant stimulus distributed a year ago and we experienced foreign exchange pressure from the strengthening dollar.\n\nOn a constant currency basis sales were down 1%. As a reminder, Journeys consumer benefited most from the prior-year government stimulus. On a comp basis, Journeys total comp was down 8%. Schuh total comps increased 9% driven by stores.\n\nJ&M continued its strength versus last year in both stores and digital with total comps up 17%. Overall, total company comps were down 2% for the quarter with store comps down 2% and direct comps down 3%. We ended the quarter with 27 fewer stores versus a year ago as we optimize our store footprint and drive productivity in our existing store state. Digital sales as expected were down versus last year.\n\nHowever, direct still held on to 95% of its gains on a constant currency basis and was up over 75% versus pre-pandemic on a reported basis. E-commerce sales accounted for 18% of total retail sales versus 19% last year, up from 10% in fiscal year '20. Wholesale was up as strength in J&M offset the decline in Licensed Brands as we reposition the distribution mix of the Levi's brand to rely less on the value channel. Gross margins were down 160 basis points to last year but were in line with our expectations.\n\nThe main drivers of the year-over-year change from -- were Journeys and J&M. The expected decline in Journeys margin is due to a return to a more normalized promotional environment, as compared to essentially none last year. That said Journeys gross margin still exceeded pre-pandemic levels. For J&M this year, we experienced increased freight and logistics cost, as well as a difficult comparison to last year as the commencement of the brand's recovery drove major reductions in inventory reserves.\n\nIn summary, by business, Journeys gross margin was down 160 basis points, Schuh's gross margin was up 30 basis points driven by lower e-comm penetration. J&M's gross margin was down 640 basis points, driven by 410 basis points of freight and logistics cost pressure and a 300 basis point unfavorable inventory reserve reversal comparison. And Licensed Brands gross margin was down 40 basis points driven mainly by sales mix and increased freight and logistics costs. Altogether, increased freight and logistics costs put approximately 75 basis points or $4 million of pressure on Q2 gross margin and were the greatest drag in our branded businesses.\n\nAdjusted SG&A expense was 45.6%, which was 30 basis points more than last year. It is worth noting that last year we received significant one-time COVID rent credits and government relief during the quarter to the tune of $8 million, which made this quarter a difficult comparison. Without last year's one-time credits, total SG&A and occupancy expenses leveraged 120 basis points and 40 basis points, respectively. Regarding wage pressure, the competitive environment and legislative increases in minimum or living wages continue to pressure our selling salaries, but we continue to evaluate efficiencies in this area through our workforce management system, time and traffic studies and other automation.\n\nIn summary, deleverage in occupancy, selling salaries, marketing, and other expenses more than offset leverage from lower performance-based compensation and other pickups. As a result of the revised outlook for the back half in the way our performance-based compensation program is designed, we had a reversal of a bonus accrual in Q2 this year that was bigger than our typical adjustments. It is also worth noting that small changes in year-over-year expenses can have a larger impact on our SG&A percentage in the second quarter, due to the typically lower sales volumes. Rent credits decide we are achieving great success driving occupancy costs lower.\n\nAcross the company for the first six months of fiscal '23, we have negotiated 115 lease renewals and achieved a 17% reduction in straight line rent expense with a shorter average term of 2.5 years. This is on top of 192 renewals with a 17% rent production last year with over 45% of our fleet coming up for renewal in the next couple of years, this continues to remain a key priority. Good way to measure the benefits of our efforts to restate our P&L is to compare Q2 adjusted SG&A to pre-pandemic fiscal year '20 versus fiscal year '20, we leverage total adjusted SG&A by 200 basis points, driven by store occupancy leverage of approximately 300 basis points, which enabled investment to drive our digital business. In summary, first quarter adjusted operating income was $10 million, a 1.9% operating margin, compared to $21.1 million or 3.8% last year and 1% pre-pandemic.\n\nBoth additional freight and logistics costs this year and the significant COVID rent and other credits benefit last year that I discussed had a considerable impact on these results. For the quarter, our adjusted non-GAAP tax rate was 19.5%, which compares to 25.1% last year. This all resulted in adjusted diluted earnings per share of $0.59 for the quarter, which compares to $1.05 last year and $0.15 in fiscal '20. Our share count is down 11% to last year and roughly 19% from pre-pandemic levels.\n\nTurning now to capital allocation and balance sheet. Our net cash position at the end of Q2 was negative $4 million, a $288 million decrease versus last year. During the past 12 months, our strong cash balances and strong cash flow enabled us not only to reinvest in our business for growth, but also to accomplish the formidable task of reinventorying and at the same time returned significant capital to shareholders. While net inventories are up $150 million year over year, we believe it's more meaningful to compare this year's inventory levels to pre-pandemic Q2 fiscal year '20 since outsized stimulus demand and supply chain limitations resulted in unusually low inventories last year.\n\nInventories in Q2 this year were $507 million, 14% higher than fiscal '20, on a quarterly sales increase of 10%. Part of the increase at Journeys is we elected to receive and carry over some winter product, which was late in arriving as it consists of core inline styles that will give us a head start on back-to-school and holiday sales. We are pleased with the quality and level of inventory except for J&M where much of the increases in transit we are still chasing product. Over the last year, we repurchased 2.3 million shares or almost 15% of outstanding shares for $135 million at an average price of $58.86.\n\nMore recently for the second quarter, we repurchased $45 million of stock at an average price of $54.99 and now have $55 million remaining on our current authorization. Capital expenditures in Q2 excluding the new headquarters building were $9 million and depreciation and amortization was $11 million. We opened four stores and closed six during the second quarter to end the quarter with 1,412 total stores. As a reminder, traditionally the end of Q2 and during Q3 through the commencement of the holidays reflect our lowest cash levels for the year is -- this is the time for our peak working capital requirements.\n\nLooking out to the end of the fiscal year, we expect to end the year with ample cash and a balance sheet that remains a strategic asset. Now turning to guidance and more specifics as to how we are thinking about the business. As I said, we believe we have a solid foundation for growth and are confident in our long-term strategy. In the near term, however, we are seeing the impact, inflation is having on consumer discretionary spending.\n\nTherefore, we believe it's prudent to take a more conservative approach to our back half outlook and are revising our full-year guidance. I'll first talk through the changes in our top line guidance. Our prior annual revenue guidance reflected growth of 1% to 3% over fiscal year '22 or a range of $2.45 billion to $2.49 billion with the midpoint of the range, the most likely scenario. We now expect full-year revenue to be between down 3% and flat compared to fiscal year '22 or a range of approximately $2.35 billion to $2.41 billion.\n\nAgain, with the midpoint of the range, the most likely scenario. Note that full-year sales results in both our prior and current guidance are impacted negatively by about 2%, due to a strong dollar and lower exchange rate. Going into this year, while we knew we had some difficult comparisons to last year, particularly during the first half due to stimulus, we felt that the back half provided good opportunity for growth, mainly due to the replenishment of inventories and having what consumers needed at the key selling periods of back to school and holiday. Driving the projected second half acceleration was high single-digit growth at Journeys as we believe we left a lot of sales on the table last year due to a lack of key product.\n\nAs Mimi outlined, while trends improved throughout the second quarter, and the start of back to school as the stimulus compares became less pronounced, they didn't reach levels contemplated in our initial projections, which we attribute primarily to the impact on the consumer from inflation. The reduction in our full-year sales guidance is coming mainly from Journeys for the reasons we have described. We have also adopted a more conservative outlook for our businesses that serve a more cost-conscious consumer, and in the U.K., where the consumer is increasingly facing economic headwinds, including higher consumer prices and higher fuel cost. Our gross margin guidance remains unchanged.\n\nAnd we continue to expect gross margins to be down versus last year by 60 basis points to 80 basis points, mainly due to increased markdown activity, especially in the quarters in which markdowns typically occur, as compared to essentially no markdown in promotional activity last year. At this time, we are not expecting any additional incremental markdowns in total as we expect to align our inventory levels consistent with our reduced sales levels. In terms of expenses, with the decline in our sales outlook, we now expect adjusted SG&A, as a percentage of sales to delever in the range of 50 basis points to 90 basis points, down from the previous range of leveraging 10 basis points to deleveraging 10 basis points. Regarding overall operating expenses for fiscal year '23, the leverage we gain from reduced performance-based compensation is being offset by anniversarying significant one-time COVID credits, selling salary wage pressure, and marketing cost.\n\nThe reduction in our sales forecast makes it more challenging to leverage fixed expenses and increased selling salary cost. However, we are actively managing expenses downward and continue to work to mitigate inflationary pressures and limit the effect on profitability from the lower projected sales volume. This all results in an expected operating margin between 4.7% to 5.1%, which is down from 6.3% fiscal year '22 and up from 4.5% fiscal year '20 prior to the pandemic. EPS is now expected to range from $6.25 to $7 per share, down from the previous range of $7 to $7.75 per share and compared to $7.62 last year and $4.58 in fiscal year '20.\n\nNote that this new guidance is based on a weighted average share count of approximately $12.9 million for the full year versus our prior estimate of $13.4 million, reflecting our share repurchase activity during the second quarter, but assumes no additional share repurchases for the fiscal year. Furthermore, we expect some improvement in the tax rate at 26%, down from the prior guidance of 27%. While we don't provide quarterly guidance, I want to provide some perspective on Q3. We expect Q3 sales to be slightly below last year with gains in our branded businesses, offset by flattish sales at Journeys and pressure on Schuh's top line.\n\nWe had robust sales in September and October last year at Journeys with a change in pandemic shopping patterns. We are assuming that consumer will revert to historical patterns of lower shopping activity during this time, saving dollars to spend during holiday when we expect sales growth to be consistent with back-to-school growth. Regarding Q3 gross margin, we expect lower gross margins, compared to last year, but at about half the levels of Q2's reduction, due to higher freight and logistics costs and another difficult inventory reserve comparison last year for J&M. Note that while in total for the year, we do not expect gross margin to change from prior guidance, we do expect a shift with Q3 gross margin under more pressure, due to higher freight cost, which is offset in Q4.\n\nWe expect there will be a fair amount of SG&A deleverage to last year in Q3, driven by lower sales, last year's one-time COVID relief and increased marketing and selling salaries. In the end, from a basis point perspective, we expect the SG&A deleverage to be quite a bit more than the gross margin pressure. With all this, we expect Q3 operating income close to pre-pandemic fiscal year '20 Q3 levels with higher EPS, compared with the same period, driven by our share repurchase activity. To close, we are pleased with the quarter we just completed and while we acknowledge the challenges facing consumers these days and the temporary headwinds those might pose.\n\nWe remain excited about the future of our business and the strategy we are driving forward. Operator, we are now ready to open the call to questions.\n\nOperator\n\nThank you. [Operator instructions] Our first question is from Steve Marotta with C.L. King & Associates. Please proceed.\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nGood morning, Mimi, Tom, and Darryl. Congratulations on the earnings beat in the second quarter. Mimi, can you talk a little bit about the move from fashion athletic toward casual at Journeys. How can you capitalize on this? Do you think that you'll have the inventory associated with this shift in place by holiday? And can you talk a little bit about the ASPs between those two silos? Thanks.\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nThanks for the question, Steve. When you think about Journeys our skilled merchants place bets on the right product, they have lots of experience. They've made the right fashion calls over the last several cycles that is a competitive advantage for us. And out of the last few fashion cycles, the last one we came out of is retro athletic into casual and casual just continues.\n\nWe continue to see strength on top of strength. Teams always have fashion athletic in their closets, but when it moves to casual, it is beneficial for us. We're uniquely positioned to serve the customer here. There is more diversification in team fashion today.\n\nThere's a reinterpretation of the '90s trends. I've talked about even a little bit of '80s and there are just a number of brands that are popular right now that are being substituted for sandals and other things as we saw through the summer. We do have the inventory in place that we need. We had it for back to school, in fact, we have a head start on the holiday inventory, because we received some late items last holiday, and we carried them over so that we already went holiday sales kick in.\n\nWe do shift into boots much more so in the back part of the year. The ASP difference between the two categories between casual, athletic. And casual is interestingly not that different, because of the mix of boots with some of the other products. And so we have been seeing price increases.\n\nI did talk about -- we have been seeing overall ASP increases. I did talk about a shift that we're seeing with the Journeys customer into some more accessible price point product. But overall ASPs are still up.\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nThat's very helpful. Tom, can you talk a little bit about what total freight incremental freight dollars are expected this year? And I'm curious how much you think that reverts next year to normal? In other words, could all of those disappear frankly?\n\nTom George -- Chief Financial Officer\n\nYes. For this year in total is interesting. In total for the year, it's about $14 million to $15 million relative to last year, it's the same number, it's just sort of sequenced differently. A good amount of that is airfreight and we would expect in future periods maybe next year and out years that we shouldn't need that same level of airfreight.\n\nSo we should get a benefit in future years on airfreight.\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nYes. We're also hoping to see that container costs come down, they have been elevated over historical levels. We're seeing some easing on the pressure certainly of being able to get product onto ships, which is positive. And prices leveled out, came down a little bit, still above historical highs.\n\nBut as the whole supply chain normalizes and consumer demand lets off a bit versus last year those prices should get back down to -- we hope historical level.\n\nTom George -- Chief Financial Officer\n\nRight, and that's a good point.\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nSure. I'd like to expand on that actually offline. I mean, we have one other question, I know that you would also alluded to the fact that back to school started a little bit later this year than would normally be anticipated. There have been times, of course, in the last couple of years, with lots of durations among the consumer and when and where they purchase.\n\nI know it's maybe impossible. They may be covered at this moment, but still potentially comment on what are the odds that to believe this back-to-school season has a longer tail, in other words, same amount of dollars, but simply shifted maybe two weeks forward?\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nSure. That's a great question, Steve. We have seen a change in consumer shopping patterns for back to school, absolutely over the last couple of years, where it was a very late start where we usually see the back-to-school season in the last two weeks of July, into August, into the first two weeks of September, so eight weeks altogether. The last couple of years, we really didn't see any activity pick up.\n\nIn fact, last year, we saw that the whole July, August part of the season was softer than normal, but then we picked up the volume that we didn't see in September and in October. And I think last year and the year before were unusual times. I think that parents were waiting to see if kids went back to school and then when they went back to school, if they would stay in school. So we attribute that to those patterns to what was going on in the last couple of years.\n\nHowever, this year we're seeing the same dynamic. To be conservative, we have said that in September and October, the consumer will revert to historical shopping patterns. But typically, kids want to wear new shoes back to school. They want to come back and see what their friends are wearing.\n\nWe talk a lot about in the moment purchases. In the moment purchases have gotten to be in the moment at the last moment purchases. And so we would be cautiously optimistic that those trends would carry over into the fall, but for guidance purposes, we haven't built it in. The good news is that August picked up significantly, I mean, we were just really very pleased to see what a big swing we had between the end of July and into August and that momentum is continuing and we'll see what happens through the course of the Labor Day weekend.\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nYou know, I have one follow-up to that. What do you attribute the swing to? Do you think that consumers have reset their expectations for food and fuel? Do you think that because gas has rolled off, there's been that pickup? What do you attribute the delta being between August and July? More on a macro level than a micro level?\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nYes. You know, interestingly, we saw that back-to-school purchasing early in the cycle for early tax freeze wasn't as strong as when we got closer to school starting. I think more people were taking vacations in the back part of the summer this year. There's a lot of pent-up demand on vacations.\n\nI think that consumers were enjoying the summer. And so just really flipped into, wow, we've got to go back to school, I think that's a little bit of what has happened. We've seen overall the consumer cycle shift into consumers waiting until the last minute. I think there's just more information out there, it used to be that you'd go and you'd shop your shopping venue, shop them all in other places to see what trends were in style.\n\nWell, now you've got that in the palm of your hand and you can figure that out. You also have a lot more confidence about being able to find the inventory wherever it is. And so that has really pushed just shopping patterns closer to the time of need this year, especially I think that consumers were distracted enjoying the summer and that we've seen a pickup certainly a significant pickup in traffic, as we've gotten into August.\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nThat's really helpful. Thank you. I'll take the balance offline.\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nThank you.\n\nOperator\n\nOur next question is from Corey Tarlowe with Jefferies. Please proceed.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nHi. Good morning, and thank you so much for taking my questions. So I wanted to start talking about Johnston & Murphy given, I think, what's very clear is that you've done a tremendous job turning this business around from the start of COVID when everything was locked down and people weren't going to the office and now you've pivoted the business to be more casual, driving what I believe was a record second quarter revenue for the segment in spite of having fewer stores than prior years, which is incredibly impressive. So can you just talk about what you're doing at that brand that you think is really going to drive sustainable success and growth going forward? And then maybe just touch a little bit on what we can expect from a profitability standpoint as well?\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nSure. Thank you for that question, Corey. The J&M customer is in a good place. We are delighted by what we are seeing from the brand right now and have great prospects, great prospects in the future for the brand.\n\nWhat has happened in the most recent time is that the J&M customer got used to comfort working from home and once you experience comfort, it's hard to go back. The J&M team did really a terrific job during the pandemic, taking advantage of the opportunity to rethink the brand, the pandemic gave us a chance to think about how the brand could be different from a product perspective and also appeal to younger customers and we pivoted harder into casual and comfort. It's really terrific product. There's great styling with special technical features, proprietary chassis systems, great water proving, great moisture wicking, great just comfort features.\n\nAnd after the recession, after the great recession a number of years ago, we had a chance to reinvent the brand and were able to double the size of the brand and think that there is an opportunity to do that again this time around. We have a chance to sell customers, things that are not in their wardrobe, things that they need for today's lifestyle. So they're trading in their dress shoes or their more formal shoes for hybrid products, which is great styling with lots of comfort features. Johnston & Murphy has done such a great job repositioning.\n\nRight now, we are selling a lot of casual and casual athletic products I talked about, the top styles being casual and casual athletic. In fact, we are -- casual and dress casual are more than 90% of the footwear sold today. And so dresses is getting to be a much smaller portion of the overall sales. We've complemented that with additional categories that really round out the lifestyle offering.\n\nAnd interestingly, we used to worry about casual just trading down price points from dress footwear, but we have actually seen that we've been able to build in great comfort and technology features and have been able to see higher price point. So we like the profitability profile that we see. We like the potential for increased sales. We're spending a lot in marketing right now to let people know about some of the changes in the brand.\n\nWe've just done a market research study that says that as much as we think everyone knows about Johnston & Murphy, there's lots more potential for additional consumers. So great prospects going forward.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nGot it. And then just on the profitability expectations for the segment?\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nYes. So this year, it's a front half, back half story. We were chasing a lot of product. You saw a great turnaround in sales and really the second and the third quarter.\n\nTom talked about the overall pressure from airfreight and that's mostly in the Johnston & Murphy segment this year. I think profitability was up in the second quarter over pre-pandemic levels, but less than last year because of some of that airfreight and the inventory reverse. But I would say that we could get back to historical Johnston & Murphy has been as high as double digit profitability. We went from pretty big losses during the pandemic.\n\nWe're making good strides this year. And over the longer term, we think there is nothing that would prevent us from getting back to historical levels of operating margin.\n\nTom George -- Chief Financial Officer\n\nYes. Let me just reiterate what Mimi is saying. I mean, if you look at Johnston & Murphy where our expectations are for this year relative to pre-pandemic, you'll see that we really expect where the sales will be a little bit above pre-pandemic levels and we have profitability won't be the same as pre-pandemic, because we are investing in marketing for growth here. We've got a good opportunity to continue to grow that brand at a good pace.\n\nWe've got the distribution infrastructure in place to be able to get further efficiencies from the stores. We really see down the road even more upside inefficiencies on the stores going forward, because we sell a lot of apparel as well. And so the stores are a great opportunity for growth. Our digital business, as you've seen, has grown very well that's double-digit profitability on the margin, so another good thing.\n\nAnd then our wholesale business, again, a good opportunity to get a lot of traction, a lot of good sell-throughs there's a big wholesale opportunity for Johnston & Murphy going forward. And in the end, we ceased if we continue to invest in marketing and continue to keep the product development has seen going with new product, we can really grow that brand and take a lot of share in that category and get to even stronger profitability rates than they were pre-pandemic.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nThat's great. Thanks for all the color. And then just one final one to double click on a comment that I think Tom you made you had mentioned that you don't have any expectations for incremental promotions throughout the remainder of this year? Just I'm a little confused, because I think that stands in contrast to what we've heard from other retailers getting more cautious on promotions? So could you just clarify that and explain that? I want to make sure I heard that properly.\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nLet me jump in here and then turn it over to Tom. Lots of other retailers right now are just talking about a large amount of inventory in the pipeline and that is really dictating the need for more promotions. Where we sit in the footwear world, especially the parts of the market that we serve are certainly less promotional than apparel. The scarcity and supply coupled with the robust demand last year, let us see the best full price selling environment we've ever seen.\n\nSo we're normalizing versus that for this year. But our brands took the opportunity to rationalize allocations. We live in a highly allocated space where there's a lot of control and a lot of scarcity of supply in general. We've been chasing product through much of the year, and we were still down 25% at the beginning of the year.\n\nSo we feel like we've just gotten to the right points of inventory were reinventoried properly. And so we are certainly expecting that we'll have more markdowns this year because the consumer was just buying anything that was available last year. We did build back in some promotional activity for just to help spur demand as we usually do this year. But what Tom is saying is that we are not seeing that we are going to have to do even more activity than we had planned in order to right size inventories, because we feel like our inventories are in good shape.\n\nTom George -- Chief Financial Officer\n\nYou know, just add to that, I can give you some perspective. So really what I was referring to is really no change from the prior guidance on -- in terms of promotional activity and how that may impact margins, because what Mimi said, we've got great relationships with all our key suppliers, and we work with them all the time to right size inventories. So we can continue to protect those brands and not markdown product. And from a reference point, we certainly have more -- we are planning for some more markdowns this year relative to last year.\n\nWhen last year, there was virtually no markdowns, but we're still a lot of learnings from last we're still planning markdowns at lower levels than pre-pandemic levels.\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nUnderstood. That's very helpful. And thank you so much for all the color and best of luck.\n\nTom George -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question is from Mitch Kummetz with Seaport Research. Please proceed.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nYes. Thanks for taking my questions. Let me start just a question on boots, you talked about carrying over some product and I know that given supply chain challenges last year there were a lot of late receipts. So I'm just trying to understand how much better your position in the category this year versus last year? Can you say what boot penetration is for you guys in Journeys like in Q3 and Q4? And again, any way to sort of give us a sense as to how much better you feel about where your inventory is on boots going into the season, the heart of the season this year versus last? And I have a follow-up.\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nLet me talk about last year and then contrast that to where we are this year. So last year, we really hit supply chain challenges most pronounced in the back half of the year. In the back half of the year, we switched as you know, Mitch to a boot assortment from more sandal and fashion athletic assortment. And so last year, we were chasing boot inventory all throughout the year.\n\nWe were of the back half of the year. We were out of stock in core styles. We felt like we left a lot of demand on the table because we didn't have core styles. That was part of the reason that we chose to take that later arriving inventory and carry it over into this year, so we'd be better positioned at the start of the season.\n\nSo we are in much better inventory position to begin the season, a lot of supply chain issues have worked their way through the system. And so we expect that we'll get continuous flow of product and we expect that we will be well positioned to meet the demand in this holiday season.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. Thank you for that. And then my follow-up on the change in the sales guidance, Tom, it sounds like the biggest piece is Journeys. I thought I heard a high single-digit number mentioned in your discussion of that.\n\nI'm not clear as to like what the Journeys outlook has changed from two? Was it -- were you thinking high singles and now you're thinking less, I didn't put understand where that high singles came in? And also on the FX, I heard a 2% number and I know that the dollars strengthen since you guys last reported. And I'm just curious also what your -- did your FX outlook change for the year as the guidance was lowered? Or will not change? And if it was changed, how much did that change by? Thanks.\n\nTom George -- Chief Financial Officer\n\nYes. Mitch, on the FX, the outlook for the year, the impact, mainly that's obviously the Schuh in the U.K. impact a little bit of a Canadian impact on the Journeys business. But it really -- from a guidance-to-guidance perspective, it really didn't change much.\n\nWe're looking at for the total year impact of FX about 2% on the total year sales.\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nI'll talk about just the overall expectations for Journeys. So we had expected in our prior outlook, Mitch, high single-digit growth, because at least back to what I was talking about where we felt like we left a lot of boot and other sales on the table in the back part of the year. We are running up during this back-to-school, but more in the, I'd say mid-single-digit range, we're expecting in our forecast that the consumer will revert to historical patterns of not very robust shopping during the back part of September and October. But they will pick up and see at about the same levels for the holiday season for Journeys.\n\nSo we had really ambitious expectations for Journeys. We like what we're seeing, but we have modified it. We have modified our expectations to really align with the actual performance we are achieving.\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nOK. Thank you for that clarification. Good luck.\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nThank you.\n\nTom George -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nWe have reached the end of our question-and-answer session. I would like to turn the conference back over to management for closing comments.\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nThank you for joining us. I wish everybody a great Labor Day weekend and look forward to talking to you on our next call.\n\nTom George -- Chief Financial Officer\n\nAll right. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDarryl MacQuarrie -- Vice President, Financial Planning and Analysis\n\nMimi Vaughn -- Board Chair, President, and Chief Executive Officer\n\nTom George -- Chief Financial Officer\n\nSteve Marotta -- C.L. King and Associates -- Analyst\n\nCorey Tarlowe -- Jefferies -- Analyst\n\nMitch Kummetz -- Seaport Research Partners -- Analyst\n\nMore GCO analysis\n\nAll earnings call transcripts"
}