{
  "companyName": "Peloton Interactive",
  "companyTicker": "PTON",
  "quarter": 1,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/03/peloton-interactive-pton-q1-2023-earnings-call-tra/",
  "content": "Peloton Interactive (PTON -1.85%)\nQ1 2023 Earnings Call\nNov 03, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day and thank you for standing by. Welcome to the Peloton Interactive first quarter 2023 earnings call. At this time, all participants are now listen-only mode. After the safe harbor, there will be a question-and-answer session.\n\n[Operator instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Peter Stabler, head of investor relations. Please go ahead.\n\nPeter Stabler -- Head of Investor Relations\n\nGood morning. Welcome to Peloton's fiscal first quarter conference call. Joining today's call are CEO, Barry McCarthy; and CFO Liz Coddington. Our comments and responses to your questions reflect management's views as of today only and will include statements related to our business that are forward-looking statements under federal securities law.\n\nActual results may differ materially from those contained in or implied by these forward-looking statements due to risks and uncertainties associated with our business. For a discussion of the material risks and other important factors that impact our results, please refer to our SEC filings and today's shareholder letter, both of which can be found on our Investor Relations website. During this call, we will discuss both GAAP and non-GAAP financial measures. A reconciliation of GAAP to non-GAAP financial measures is provided in today's shareholder letter.\n\nI'll now turn the call over to the operator for the first question.\n\nOperator\n\n[Operator instructions] Our first question comes the line of Doug Anmuth from J.P. Morgan. Your line is open.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nThanks for taking the questions. Barry, it's clear you've made progress on the cost structure and free cash flow loss, but how should we think about your plan to drive growth? And in particular, can you give us an update on the FaaS rental model and how that's progressing so far? Thanks.\n\nBarry McCarthy -- Chief Executive Officer\n\nHey, Doug. Good morning. Thanks for the question. Well, look, our focus -- our job, one, is to ensure the viability of the business, which a year ago was in doubt.\n\nAnd I believe that is no longer the case because of our focus on driving -- rightsizing the cost structure, variable loss and costs, and driving the business toward a goal of a breakeven free cash flow. Clearly, that has come at the expense of growth and there will come a time when we begin to focus again on growth. With my leadership team, we already made that transition. The question is, and I framed this question at the end of my letter this quarter, how fast will we grow? What will the margin structure of the business be? We'll begin to see the answers to those questions take shape later this year as we lean into a number of the strategies that we've already articulated, like, fitness-as-a-service and certified pre-owned, and expansion into our third-party retail partners, and as lean into growth in our commercial business.\n\nAnd as we lean into relaunching the digital ad business to -- in pursuit of that goal of 100 million users, which I talked about when I first joined the business. As it relates to FaaS. It's going really fast. About a third or less have lease sign up.\n\nWe're doing an average over the last -- about two weeks of about 175 signups a day. We've only -- and we've only just begun leaning in on the web to growth. There's still unanswered questions about whether or not it will be financially viable for its long-term goal. What I've learned from the early growth is that we absolutely have to figure out how to make it work for us because it's enormously popular with users and it's -- there's considerable incrementality to it and we are attracting to our subscriber base a demo, which we have not previously been able to access so it's expanding our TAM.\n\nSo we need to look at the underlying economics. And where we do that is by focusing on the monthly price, which drives churn. And we need to understand more about what percentage of folks over time will exercise the option to buy out the bike. And probably we will adjust over time the buying options.\n\nLiz, anything you want to add to my summary with respect to FaaS?\n\nLiz Coddington -- Chief Financial Officer\n\nNo, I think I -- the only thing that I will say is that the one thing about FaaS it's important to note as you think about the growth of the business, is that the revenue profile and margin profile is a little bit different from our core business. And so as the FaaS -- as FaaS grows, we'll see that the revenue will take longer. We're not getting the benefit of the purchase of the connected fitness hardware in period because we'll get the rental income from that over time. So just highlighting that for everyone.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nAnd is there any kind of -- I know it's still early, but any kind of target or outlook on what you think FaaS could represent --\n\nBarry McCarthy -- Chief Executive Officer\n\nA reminder -- of the user base?\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOr just new subscribers.\n\nBarry McCarthy -- Chief Executive Officer\n\n30% or more of new subscribers. More than that on a net basis, because there's effectively no churn across the installed base. So the percentages of growth versus net will probably be a bit different.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. Thank you both.\n\nBarry McCarthy -- Chief Executive Officer\n\nYeah.\n\nOperator\n\nThank you. One moment for our next question. Our next question comes from the line of Edward Yruma from Piper Sandler. Your line is open.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nHey, good morning, guys. Thanks for taking the questions. We want to rotate a little bit toward the construct of growth. Two vectors, though, the app, I guess, which I think you guys noted, you saw some softer results and then maybe any insight into your view, Barry, on some of the newer modalities like Guide and Row.\n\nThank you.\n\nBarry McCarthy -- Chief Executive Officer\n\nAll right. Guide and?\n\nLiz Coddington -- Chief Financial Officer\n\nRow.\n\nBarry McCarthy -- Chief Executive Officer\n\nAnd Row. Yeah. Coming back to the FaaS for a moment, Doug, one additional comment. A reminder that [Inaudible] that we see attractive payback in somewhere between a year and 18 months.\n\nI think that the product is viable, but not as a drag as it's two years. And so when I talk about the financial viability of the product, it's sort of through that lens that we're thinking about how we tweak price and buyout option and directionally monthly churn, if that's helpful. Average of growth in the digital app, deemphasized it a little bit. Our strategy is to relaunch the digital app in the new year.\n\nIt will be a different price value opportunity than it is currently. There'll be a tiered pricing associated with a content strategy -- a new content strategy. We're chasing the 100 million digital app users. The current product has never really grown bigger than a million.\n\nWe -- the overarching strategy here is to gain access to competitive connected fitness hardware platforms. About half the users, paid users, of our digital app at one time or another use are connected fitness content on someone else's hardware. We've never actually marketed that use case. We're going to lean into it.\n\nThe digital app has kind of come at the end of our marketing funnel. We're going to move it up to the top with a premium offer and try to lean into that growth opportunity. In terms of guide, customer SAT scores are really high. Unaided brand awareness is really low relative to our other products like 17.\n\nAnd the purchasing stands for -- as high or higher than any of the other products in our product line based on some research I saw overnight. So it's an opportunity we haven't really leaned into. I don't think we've quite figured out how to market it effectively, so it's doing OK, but it's not doing nearly as well as you would think it would do based on the metrics I just described. With respect to Row, I think Tom Cortese and his team can be justifiably proud in having reinvented the Row category, like they reinvented the bike category with the connected fitness content.\n\nThe good news and the bad news about Row is for this fiscal year, we expect to be inventory constrained and to have more demand than we will have units to sell. And we're working ten to address those issues. But at least for the moment, it's been critically quite well received and we have just rolled it out through all of our showrooms as of yesterday. It's been in a limited number like 16 previously.\n\nAnd so I'd expect demand for Row to continue to grow as we increase people's exposure and the opportunity to get on it and try and see what's magical about it.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question will come from the line of Justin Post from Bank of America. Your line is open.\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Can we talk a little bit about the kind of 2Q sub guide? I think it's 30,000 subs. And you've got kind of retail kicking in. Obviously, some Rowers and then it's holiday promotion time.\n\nHow do you put that in context of your overall growth plans? What does it mean for the year and how are you thinking about the kind of reopening and macro challenges being maybe different this year than in future years? Maybe put all that in context. And then one quick one on the fitness-as-a service. Is that contributing to slightly elevated churn or is it still kind of immaterial at this point? Thank you.\n\nBarry McCarthy -- Chief Executive Officer\n\nLet me just do the churn beat both. It does have higher churn, but it's immaterial. It would be like a basis point. So we can ignore the effect of FaaS on churn for the foreseeable future.\n\nThe sub growth during the holiday is paced by the decrease in spending, which is quite substantial on a year-over-year basis and on a sequential basis. We want to spend more. Could -- we can have significantly more growth. I guess the other comment I want to make about growth and then I'll turn it over to Liz is it's not very ambitious target, is it? And there's good news and bad news in that.\n\nAnd the bad news is we'd like it to be higher and we'll see what happens. The good news is there ought to be limited downside in that number. From a cash flow perspective, I think we are on the right side of that equation for planning purposes. Liz, anything you want to add?\n\nLiz Coddington -- Chief Financial Officer\n\nYeah, I was just going to say that we have seen some research that indicates that the economy is a headwind for us as it is for many other companies. And that is currently having an impact on near-term connected fitness hardware demand.\n\nBarry McCarthy -- Chief Executive Officer\n\nSorry about that both. We're currently having a fire drill.\n\nOperator\n\nOur next question will come from the line of Eric Sheridan from Goldman Sachs. Your line is open.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for taking the question. Maybe following up on Justin's on retail, just how should we be thinking about the contribution from some of the new retail partners beyond just the December quarter and how you think they can help evolve the distribution strategy in light of what may remain sort of dampened end demand environment short term, but you're widening out the distribution narrative around the name. How should we think about those countervailing factors in terms of supporting growth as we turn the calendar into calendar 2023? Thanks.\n\nBarry McCarthy -- Chief Executive Officer\n\nWe have some of the same questions. We broadened our retail strategy because we felt it was important to be where our customers are. But the only way to know how successful the strategy will be is to actually do it and see what happens. And then based on what we're learning, flex the business model in order to capitalize on the successes and minimize any losses.\n\nIt comes at the cost of some margin. How is it going so far? Well, Amazon has outperformed our expectations for sure. We just launched Dick's Sporting Goods. We have high expectations for it, but it remains to be seen how it will perform over time.\n\nAnything you want to add, Liz?\n\nLiz Coddington -- Chief Financial Officer\n\nNo, I think that covered it. But I do want to go back to the prior question that got cut off. I apologize. The fire alarm went off for a second in the middle of our call, which is unfortunate.\n\nSo going back to that question around our guidance forecasts, I was talking a little bit about the economy and creating a headwind for us and for many other businesses right now. I do want to say that we do have confidence that our Q2 guidance forecast incorporates the latest on macroeconomic trends. And to various points, we do have the ability to grow faster if we wanted to, but because we are trying to balance on delivering on our cash flow goals, that we have not been overly aggressive in our guidance forecast for Q2. I do want to point out that again, FaaS and -- our fitness-as-a-service and our CPO, which we -- had been strengths for us and we will continue to grow fast CPO.\n\nWe may or may not be able to do in Q2, we'll see. But we also, with the secondary market activities being another opportunity for us to grow subscribers as well. In the context of the overall year, we are still not providing any sort of full year guidance on revenue or subs. But what we said last quarter still holds and that we do expect revenue for the year to resemble the seasonality of fiscal '22 in terms of revenue per quarter, if that helps folks with their modeling.\n\nBarry McCarthy -- Chief Executive Officer\n\nLet me just comment on -- let me add one additional comment. So Liz touched on the growth in secondary market's active subscription activation. That has grown significantly over the last year and I expect it to be a source of operating leverage for us and we're talking about how we can lean into that ecosystem and ensure that it's healthy and viable. So the avoidance of doubt, this is someone who owned a bike.\n\nIt became a potted plant in their home. They sold it in the secondary market, someone bought it, and then someone activates a subscription and becomes a monthly subscriber at zero cost to us. Next question, please, Victor.\n\nOperator\n\nThank you. One moment for next question. Our next question comes line of Lauren Schenk from Morgan Stanley. Your line is open.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nGreat. Thank you. Someone asked about -- can you hear me?\n\nBarry McCarthy -- Chief Executive Officer\n\nYes, go ahead, Lauren.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nOn the connected fitness gross margin, I think still negative 12% even excluding the recall impact. I guess with the restructuring changes largely behind us, what needs to happen to get that back into positive territory? And what's the rough time line for that? Thank you.\n\nLiz Coddington -- Chief Financial Officer\n\nSo you're correct. First of all, yes, you're right. If we adjust for the Tread+ recall, we would have been at a negative 11.6% gross margin.We are expecting to see increases -- sorry, first of all, I want to highlight, before I even start talking about digital, I want to highlight the improvement that we've seen in our gross margin quarter over quarter from Q4, so it's a tremendous improvement. In Q2, our overall gross margin, we're expecting it to be around 36%.\n\nAnd then for connected fitness, we're not guiding to that but we are expecting to see continued improvement as we improve our middle mile and logistics costs and [Inaudible] for our final mile. We'll see those continue to improve over time. One thing -- things that put pressure on our gross margin, though are things like FaaS, for example. So as FaaS continues to grow, that will put pressure because of the fact that we do take expense for the delivery cost of the bike upfront.\n\nAnd then also the economics of third-party retail are such that they do put pressure on our gross margins as we consider the marketing expense associated with those channels as contra revenue. So the key thing that I want to point out is that we are managing our business toward generating an improvement in gross margin and then also overall generating positive cash flow and positive adjusted EBITDA. So overall, we're looking -- you want to look at gross margin, but we need to also realize that some of these programs have just a different cost structure and profile. And it may bear out that we have some impact to gross margin, but we see a benefit also in the P&L, if that makes any sense.\n\nBarry McCarthy -- Chief Executive Officer\n\nIf I could just tease out one additional nuance. Could you comment on how long you think it takes for the cost reduction in final mile and middle mile freight, those kinds of things that find their way through our balance sheet and into the P&L?\n\nLiz Coddington -- Chief Financial Officer\n\nI think it's -- this is something that is going to take a little bit of time, but we are seeing the benefits every quarter, gaining more and more traction. So I think probably by -- I don't want to give the specifics but hopefully by the end of the year, we should be in a much better spot on that.\n\nBarry McCarthy -- Chief Executive Officer\n\nJust trying to tease out the average of pricing versus [Inaudible]  \n\nLiz Coddington -- Chief Financial Officer\n\nYou mean the --\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nOK. Thank you.\n\nBarry McCarthy -- Chief Executive Officer\n\nAnd the only point is that as the economy and freight costs decline and we restructure our middle mile and last mile, because of the way we account for our inventory, it's going to take a while for both benefits to find their way into the P&L. We have the cash benefit but we don't see the P&L benefit.\n\nLiz Coddington -- Chief Financial Officer\n\nYes, that's -- the point is that like the freight cost for when we brought some of that inventory on that was more expensive, that will have to work its way through our inventory. And then the other piece is that our storage costs will continue to decline as we have that inventory around. So those things will also be benefits as we lower our inventory position. That will be ongoing through the end of the year and probably into FY '24 as well.\n\nBarry McCarthy -- Chief Executive Officer\n\nAnd our storage growth have been very significant.\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nUnderstood. Thank you.\n\nOperator\n\nThank you. A moment for our next question. Our next question comes from the line of Shweta Khajuria from Evercore ISI. Your line is open.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nOK. Thanks a lot for taking my questions. How much -- how does the accounting for the third-party retail partnerships actually work? So whether it's Dick's Sporting Goods or Amazon or Hilton, how should we think about how you're accounting for in terms of subscribers, revenue? And then you -- Liz, you also mentioned there is a contra revenue aspect of it, so it would be great to understand that. And then the second is, Barry, if you could talk about how the leadership team and the company is organized now for growth.\n\nSo how are growth initiatives internally managed as the leadership team reports to you and which segments are focused on for long-term growth? Thank you.\n\nLiz Coddington -- Chief Financial Officer\n\nSo as far as the third-party retailers go, we do have a couple of different models that we use to work with them. So in the case of Amazon, we have a wholesale model. So Amazon will buy the inventory from us and then they will resell it and our revenue recognition will come at the time that we actually sell the inventory to them rather than when they sell it to the customer. And the subscriber will come even later.\n\nSo they have to sell the they have to sell the bike to the subscriber, it has to get delivered and then the sub has to activate. So think about that being a longer time frame from when that inventory gets sold to when we actually see the subscriber activation. There will be a disconnect in timing there. With Dick's, we have some wholesale type of model, but we also have a dropship model.\n\nSo that's the case where somebody walks into a Dick's Sporting Goods, orders a bike or a tread, and then they send a signal to us and we then fulfill the order and deliver it to the customer. So in that case, we recognize the revenue at the time of delivery like we do in our regular web sales. And so the -- and the activation will be similar timing. We expect that from when they get the -- received their bikes, we recognize revenue and we get the subscription.\n\nSo there is a couple of different models going on there that as these different models bear out over time, they're small right now, but they could have an impact on how we model out, how we see the subscription growth, revenue growth in comparison to the connected fitness first.\n\nBarry McCarthy -- Chief Executive Officer\n\nAnd then there was a part of the question about contra revenue.\n\nLiz Coddington -- Chief Financial Officer\n\nYeah, well, it's basically what happens is with we do have some marketing expenses that we said are in our agreements with -- particularly with Amazon. The way that those show up in our financials is a reduction to revenue. And so that is -- it's just a different model than -- it doesn't show up in a marketing expense line.\n\nBarry McCarthy -- Chief Executive Officer\n\nThanks for that. With respect to the leadership team and growth, I lead the effort. There's virtually no piece of the business that we haven't reorganized in some form or fashion. And it's been a substantial change in the leaders -- in the composition of the leadership team.\n\nLast quarter we restructured our approach to the market. Some people left the business as a result. And we're in the process of leading a search for a new head of marketing. In the interim, the marketing team is reporting to me and I'm spending a considerable amount of time focused on how we grow the business, how we work cross-functionally, rolled out our various initiatives.\n\nI'm quite proud of the team's performance with respect to the launch of Amazon, by way of example. There's virtually no function group in the business that wasn't touched by the complexity of that launch. Dick's is equally complicated. Fast is equally complicated.\n\nCertified pre-owned is also quite complicated. So it's about executing with precision and speed and risk-taking.\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nThanks, Barry. Thanks, Liz.\n\nOperator\n\nThank you. One moment for our next question. Your next question comes from the line of Deepak Mathivanan from Wolfe Research. Your line is open.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGreat. Thanks for taking the questions. So first, Barry, John, after making the adjustments for Canada is around like 1.2%. Now it's only better than 1Q, but are you comfortable with these levels as you think about the next, say, 18 to 24 months? Can you give some color on the profile of customers that are kind of churning right now? And then the second question, a little more strategic one.\n\nThe channel expansion and distribution makes a lot of sense, but I'm curious if you have explored opportunities to kind of leverage Peloton brand and content that you have or something in and maybe either under a franchise model or through kind of partnerships with other in-person fitness studios. And I would love to hear your thoughts on that. Thank you so much.\n\nBarry McCarthy -- Chief Executive Officer\n\nI think the first part of the question, Deepak, was any color in this churning. The short answer is no. Churn is one of the aspects of the business, along with Tom Cortese's product group and Jen Cotter's content team, I don't focus on. And the reason I don't focus on it is because it works well and it's not even remotely broken.\n\nThere is no operating leverage to be had in my trying to, say, reduce churns by a couple of four basis points. It's just not going to happen. What I am focused on with Tom's team, with Jen's team is in improving the user experience, primarily by leaning into personalization. We've made that a large focus area.\n\nThere are a number of improvements that have already happened and they are in process, both on your screen on a connected fitness device and in the digital app. My belief is that with a more deeply personalized experience, we will see -- we will continue to see improvements in engagement -- engagement improved versus pre-COVID period on about -- just shy of 20% in the current quarter. So I don't mean to signal that we have engagement issues, but I think it can be better still. And if it is better still, I think we will grow faster at a lower cost because we will have more organic growth because we'll have more delighted subscribers.\n\nI believe that because that was the phenomenon we saw at Spotify, and that was the phenomenon we saw at Netflix. So those are my comments on churn. As it relates to leveraging the brand through in-person fitness, I spend quite a bit of time thinking about this. And this is a use case that I'm trying to attack with our digital app.\n\nAnd I think doing it that way is the better go-to-market strategy than trying to negotiate revenue-sharing splits with other commercial businesses, and having to pay what I think would be considerably higher lease price as a consequence of it becoming a commercial application. So I'd rather sell to you and have you take your digital app wherever you want to take it to engage in our content. Could be your home, could be the gym, could be a friend's house, could be outside while you're running. That's a much larger TAM for us and has a better margin structure for us.\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nGot it. Very helpful.\n\nOperator\n\nThank you. One moment for next question. Our next question comes from the line of Ron Josey from Citi. Your line is open.\n\nRon Josey -- Citi -- Analyst\n\nGreat. Thanks for taking the question. Barry, I wanted to maybe walk back to turn around here and just about the free cash flow guidance. I think the letter talked about reaching near breakeven in '23.\n\nSo if you could just help us a little bit more on the investments and also what makes you feel better about beating that one year timeline and being the goal here to getting to breakeven? So questions on free cash flow and breakeven in the back half. And then any update on the ad campaign? I think we saw it in mid-September. Obviously, we know the guidance here for the holiday quarter. But talking -- just curious about the receptivity of the campaign.\n\nThank you.\n\nBarry McCarthy -- Chief Executive Officer\n\nI'm going to ask Liz to talk about the free cash flow guidance and then I might ask you to repeat the second part of the question. I had a hard time period. I'm sorry.\n\nLiz Coddington -- Chief Financial Officer\n\nSo while we haven't specifically guided to a free cash flow number at all, we talked about our goal of reaching free cash breakeven or near breakeven by the second -- for the second half of the year. And we remain on track to being able to achieve that goal. It's not certain. There's always some risk.\n\nIt's not a guaranteed outcome. But you can see in our -- this quarter we reduced our cash flow significantly from the prior quarter and the quarter before that. We're making a tremendous amount of progress toward that goal and we continue to remain focused on it. So that's our goal, and we're continuing to maintain that we'll be able to deliver on it.\n\nBarry McCarthy -- Chief Executive Officer\n\nI would add that -- a couple of things. One is I've grown increasingly confident in our ability to forecast free cash flow based on our recent performance over the last three quarters. So Liz and her team have done quite a good job there and we've made considerable progress. So that's point one.\n\nPoint two is a little color on cash flow. Quarter or two ago, I think there was the impression you have because we had a lot of inventory, at least in the first half of the year, we'd big tailwind.  We just liquidated that inventory and didn't pay to replace it. That is true, but we also had a big headwind, and that was the settlement payments that we negotiated with our suppliers when we realized that we had contractually committed to more inventory than we had understood back in the March time frame. And those two kind of netted out across the entire of the year.\n\nI think there's a net benefit in the order of $86 million, something like that. So it's entirely immaterial to the business, and I just want to make sure that that nuance was well understood.\n\nLiz Coddington -- Chief Financial Officer\n\nAnd that is certainly true this quarter for sure -- in Q1 that any inventory benefit that you see with inventory balances coming down is offset by supplier settlements for the quarter, more than offset.\n\nBarry McCarthy -- Chief Executive Officer\n\nThe last point I want to make is with respect to restructuring. We've recently eliminated approximately 500 heads in order to complete our rightsizing of the cost structure of the business. So we are done now. And in my humble opinion, there are no more heads to be taken out of the business.\n\nAnd so from a cash flow perspective, we're going to need our performance -- the rest of the business needs to perform as we expect the business to perform. Meaning no, our working capital dynamics need to be more or less aligned with our forecast. Our growth needs to be more or less aligned with our forecast. Cost for inventory needs to be aligned with our forecast.\n\nWe're not going to get there by taking additional heads out of the business and reducing operating expenses. And I just want to be -- I want to be clear with investors about that. I want to be clear with our employees about that. We are done.\n\nThis is the go-forward team.\n\nLiz Coddington -- Chief Financial Officer\n\nThe one thing that I will caveat to that just for completeness, Barry, is that we are still working through our first-party retail showroom. And so we are -- that is that that is one of those processes that just takes time to get out of some of these showroom leases. And so that will be the one ongoing piece that we will still have through the end of fiscal '23 and likely into fiscal '24 as well.\n\nPeter Stabler -- Head of Investor Relations\n\nAlready announced that on call. Thanks for the clarification.\n\nBarry McCarthy -- Chief Executive Officer\n\nAnd Ron, could you repeat your question about the advertising campaign? We didn't understand it.\n\nRon Josey -- Citi -- Analyst\n\nYeah. Thanks, Peter, and appreciate the answers on the free cash flow. Just on the ad campaign, I think we saw it started at least a new campaign started in mid-September and understood we have guidance here for the holiday quarter. But just curious on the receptivity of this recent campaign that we're seeing at -- for the broader Peloton family of products.\n\nSo any insights there would be helpful. Thank you.\n\nBarry McCarthy -- Chief Executive Officer\n\nWell, think about it in terms of purchase intent, Ron. Purchase intent for the brand is up slightly everywhere except for Germany, where it's taken a slight hit because of the advertising campaign or not, hard to say honestly. Second point I would make about advertising generally and not the campaign specifically is that in the current market environment, our dollars are going a lot farther than they were a few months ago because the advertising market has softened considerably. And so we were able to acquire more media impressions for dollars spent than we were expecting coming into the holiday season.\n\nNice to see how that translates into growth, but it is the first tailwind we've seen in that marketplace in the long-term.\n\nPeter Stabler -- Head of Investor Relations\n\nNext question please.\n\nOperator\n\nThank you. One moment. Our next question will come from the line of Aneesha Sherman from Bernstein.\n\nAneesha Sherman -- AllianceBernstein -- Analyst\n\nYeah, good morning. Thanks for taking my question. So Liz, you gave some great color on the hardware gross margins and the trajectory. I wonder if you could talk about the sub's gross margin and where do you think this could go as it scales up? And what -- can you give some color on where it was on an underlying basis? It seems like you had some one-off costs on music and things like that.\n\nSo where are we underlying and then where could it go as it scales up? And then I have another question on inventory. It was down 100 million. Obviously, you have a lot more distribution points in FaaS, etc. Is 100 million a good run rate? I mean, is that what you're kind of modeling through the rest of the year as you work through your existing inventory? Thank you.\n\nLiz Coddington -- Chief Financial Officer\n\nOK. Look, I'll the part of that question around subscription margin first. So we did see some pressure on subscription margin, particularly in this quarter, down a bit for Q4 in line roughly with the prior year. There were a couple of drivers of that.\n\nOne of them was just higher music licensing reserves for minimal guarantees, and that's related to just our subscriber growth and reserving for those. We also had some elevated stock-based comp costs for Q1. And that was specifically related to our equity recycling investing acceleration. And so we don't expect any further pricing pressure on subscription margin going forward, but I -- we wouldn't expect in the very near term for it to go up substantially from where it's at right now.\n\nThe other question about inventory, so we do expect the inventory to decline throughout the year. I don't necessarily have a view of how much it's going to decline quarter by quarter. One thing I do want to point out is we do have some inventory that we need to buy specifically related to, like, the Rower. And -- but we will see continued sequential declines in inventory as we work through it over the course of the year and beyond.\n\nAneesha Sherman -- AllianceBernstein -- Analyst\n\nOK. And one follow up, do you have any color on what the subs margin was ex those one-offs this quarter?\n\nLiz Coddington -- Chief Financial Officer\n\nI couldn't quite -- I'm sorry. Could you repeat that? I couldn't quite hear the first part of that.\n\nAneesha Sherman -- AllianceBernstein -- Analyst\n\nSorry. I just had a quick clarification on the subs point. Do you have any color on where the subs margin would have been ex those one-off costs this quarter?\n\nLiz Coddington -- Chief Financial Officer\n\nI don't have a specific number for you, but it's not -- it came down from where it was in Q4. It's hard to give you exact percentage of how much of that was related to the minimum guarantees in each piece. But I would say that where we're at now is a reasonable rough approximation of where it will be for a while.\n\nAneesha Sherman -- AllianceBernstein -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. One moment for our next question. Our next question from the line of Mario Lu from Barclays. Your line is open.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thanks for taking the question. Just wanted to follow up on the comment you made earlier in terms of revenue seasonality for the rest of the year. I just wanted to confirm, is that related to total revenue or just connected fitness revenue for the rest of the year? Thanks.\n\nLiz Coddington -- Chief Financial Officer\n\nAnd that would be total revenue.\n\nMario Lu -- Barclays -- Analyst\n\nGot it. And then, Barry, you mentioned half of the digital subs currently is likely using somebody else's hardware. I understand from the classes right now on Peloton guys in the future, world classes may be catered to only owners of Peloton devices. Can you talk a bit about this potential strategy of gating classes and if that could be a significant uplift to convert digital subs over time?\n\nBarry McCarthy -- Chief Executive Officer\n\nI'm going to hold off on talking about the digital strategy until we roll it out other than to say that it will have a premium component, there will be gated content.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nThank you. One moment for next question. And our last question will come from line of Andrew Boone from JMP Securities. Your line is open.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThanks so much for taking my questions. On the guide, it feels like opex declines are starting to slow as we think about next quarter. Can you provide a little bit more detail around R&D and G&A. Understood headcount is kind of stable, but any help in terms of other items that may be involved there? And then can you talk about the consumer reception to self-assembly and how that's gone? Thanks so much.\n\nBarry McCarthy -- Chief Executive Officer\n\nThere is a consumer reaction to what?\n\nAndrew Boone -- JMP Securities -- Analyst\n\nSelf-assembly [Inaudible]\n\nLiz Coddington -- Chief Financial Officer\n\nSelf-assembly [Inaudible]. So with regard to the opex, we -- some of the changes that we made regarding the reduction in force. Those were Q2 events. So we will see some declines in both G&A and R&D over the coming quarters.\n\nWhat you'll see in Q2 and that's reflected in our adjusted EBITDA guidance, is the fact that we will be spending more quarter over quarter on marketing as part of our holiday kind of promotion timing. And so to the extent that you're looking at the guidance and trying to back into what that implies for G&A and R&D, there will still be some declines there offset by some higher spending in quarter for sales and marketing. I hope that that addresses that question.\n\nBarry McCarthy -- Chief Executive Officer\n\nI would say, longer term G&A has got to come down as a percent of revenue, just to be clear. It's structurally broken currently. I can see the path to fixing it. There would be some additional spending along the way.\n\nFrom an IP perspective, there are a number of things that need to be fixed, and when they're fixed, they become the roadmap toward significant cost reduction. And then do you want to respond to that -- expert commented on self-assembly.\n\nLiz Coddington -- Chief Financial Officer\n\nI haven't seen much about self assembly aside from the fact that there hasn't been a lot of complaints about that. So to the extent that customers are not complaining about it, it's a good thing. And yeah, so that's -- that would be the -- we are getting good star ratings on Amazon so that again gives confidence that self assembly is working.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nBarry McCarthy -- Chief Executive Officer\n\nThank you very much.\n\nDuration: 0 minutes\n\nPeter Stabler -- Head of Investor Relations\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nBarry McCarthy -- Chief Executive Officer\n\nLiz Coddington -- Chief Financial Officer\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nJustin Post -- Bank of America Merrill Lynch -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nLauren Schenk -- Morgan Stanley -- Analyst\n\nShweta Khajuria -- Evercore ISI -- Analyst\n\nDeepak Mathivanan -- Wolfe Research -- Analyst\n\nRon Josey -- Citi -- Analyst\n\nAneesha Sherman -- AllianceBernstein -- Analyst\n\nMario Lu -- Barclays -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nMore PTON analysis\n\nAll earnings call transcripts"
}