{
  "companyName": "Pan American Silver",
  "companyTicker": "PAAS",
  "quarter": 2,
  "fiscalYear": 2021,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/11/pan-american-silver-paas-q2-2021-earnings-call-tra/",
  "content": "Pan American Silver (PAAS -2.21%)\nQ2 2021 Earnings Call\nAug 11, 2022, 11:00 a.m. ET\n\nOperator\n\nThank you for standing by. This is the conference operator. Welcome to the Pan American Silver second quarter 2022 results conference call. [Operator instructions] And the conference is being recorded.\n\n[Operator instructions] I would now like to turn the conference over to Siren Fisekci, VP, investor relations. Please go ahead.\n\nSiren Fisekci -- Vice President, Investor Relations\n\nThank you for joining us today for Pan American Silver's Q2 2022 conference call. This call includes forward-looking statements and information and makes reference to non-GAAP measures. Please see the cautionary statements in our MD&A, news release, and presentation slides for our Q2 2022 unaudited results. All of which are available on our website.\n\nI'll now turn the call over to Michael Steinmann, Pan American's president and CEO.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nThank you, Siren, and welcome, everyone, to our Q2 call. In Q2, we produced 4.5 million ounces of silver, led by strong performance at La Colorada. Production at La Colorada was up more than 50% from Q2 last year to approximately 1.7 million ounces, reflecting the improved translation conditions in the mine. In July, the new refrigeration plant began operating, which we expect will further improve working conditions in the mine.\n\nGold production was 128,300 ounces in Q2. Despite lower-than-expected production at Dolores from Phase 9B, which also reduced consolidated silver production. Q2 gold production was within our expected range for the quarter. Dolores had a marked impact on our Q2 results.\n\nThis stems from the shortfall in grades from Phase 9B and the resulting production year to date being less than expected, which triggered an analysis for impairment. We did that the impairment analysis at the time of industrywide cost inflation, incorporating higher cost assumptions, especially affects the value of the shorter-life assets,such as Dolores. It was a factor in our decision to suspend the underground mine in Q2 and the subsequent reclassification of underground reserves to resources, and it resulted in shortening the estimated duration of economic residual leaching to the year 2030. Of course, this is highly dependent on metal prices and costs over the coming years and will be adjusted accordingly.\n\nThe exploration drilling originally conducted for Phase 9B of the open pit at Dolores had some high-grade intercepts in the area that we expected to mine during the first half of 2022. However, these high grades were not fully realized, and we now believe the high-grade intercepts contributed to localized overestimation of the contained ounces within Phase 9B. Our updated winter resource and production plan for the life of mine adjusts for this overestimation. We recorded a $99.1 million impairment charge for Dolores in Q2 and together with $62.8 million net realizable value inventory adjustments, primarily at Dolores, drove the net loss of $173.6 million or $0.83 loss per share for Q2.\n\nAdjusting for these items, among other adjustments, results in an adjusted loss of $6.5 million or $0.03 loss per share. Cash flow from operations totaled $20.8 million, which includes $42.4 million in cash taxes and the $19.5 million buildup in working capital. Moving on to our guidance for 2022. We are maintaining our production guidance for both silver and gold, but expect to be at the low end of the ranges.\n\nThe slides on our website that accompany this conference call, include a quarterly breakdown of production in 2022, which better clarifies our expectations for the year, which we have always been weighted to the back half of 2022. Cash cost for the silver segment were $12,000.10 per ounce and $1,132 per ounce for the gold segment in Q2. All operations were negatively impacted by inflationary pressures, particularly from increased diesel prices and certain consumables, including cyanide, explosives and steel products such as grinding media, as well as supply chain shortages. Further, we are experiencing cost increases in services and other supplies, indirectly due to the inflationary impact of consumables on their input costs, particularly diesel fuel.\n\nIn addition to these global inflationary presence, gold segment cash costs were impacted by the lower grades at Dolores and at Shahuindo and La Arena from mine sequencing. We expect gold segment cash costs to be at the high end of our original guidance range for 2022. Silver segment all-in sustaining costs were $17.30 per ounce. Excluding net realizable value and our readjustments, silver segment all-in sustaining costs were $15.90 per ounce.\n\nWe are maintaining our guidance for 2022 silver segment cash costs and all-in sustaining costs. Gold segment all-in sustaining costs were $2,051 per ounce and $1,540 per ounce, excluding NRV adjustments. We are increasing our guidance for gold segment all-in sustaining costs to between $1,400 and $1,550 per ounce, excluding of NRV inventory adjustments as a result of increased capital spending and the great shortfall at Dolores. We have increased our estimate for sustaining capital to between $240 million and $250 million due to a change in the financing strategy for certain plant sustaining capital investments at the open-pit mines in Peru.\n\nRather than funding these projects through construction loans, as we had originally intended, we will fund them directly through cash flow, which will be offset by a decrease in future expected cash flows and loan obligations. We have decreased our estimate for project capital to between $55 million to $60 million based on expected delays in spending at both at the La Colorada Skarn and Timmins projects. Total capital spending is now expected to be between $295 million to $310 million in 2022, up slightly from our original guidance of $280 million to $305 million. The decrease in capital for the La Colorada Skarn current project is due to delaying the design and initiation of the access from development to optimize alignment with the highly efficient bulk mining method designs now being considered.\n\nThe current major projects at La Colorada are progressing well. In addition to completion of the refrigeration plant, we have set the Galloway structure during the quarter and now installing the headframe and hoist for the concrete line ventilation shaft. We will start sinking the shaft before year end and aim to advance to the 600-meter depth by this time next year. Yesterday, we provided an update for our consolidated reserves and resources as of June 30, 2022, which demonstrated reserve replacement at our most significant mines.\n\nWe replaced 108% of the annual silver production at La Colorada and added another 42.8 million ounces for the inferred mineral resources in the veins above the Skarn. At Huaron, we replaced 165% of the several mine last year. 81% of gold production was replaced at Shahuindo and 46% at La Arena. Timmins replaced 26% of the gold mine and added a further 53,000 ounces to inferred resources at Timmins West.\n\nGolden-silver mineral reserves were impacted by the reclassification of reserves to resources at the Dolores underground mine. We are looking forward to updating the resource estimates for the La Colorada Skarn later this quarter. On July 21, we announced the most recent rule results for the La Colorada Skarn, which included the highest grade intercepts to date of 97 meters at 654 grams per tonne of silver, 15.35% lead and 11.38% zinc. These most recent full results will not be included because they were drilled after the timing cutoff for the new resource estimate.\n\nAt Escobal, the ILO 169 consultation has now progressed to the consultation phase from pre-consultation with the next meeting scheduled for August 21. We look forward to participating in the next phase of the consultation process and listening to the Xinka people regarding their perceptions of that Escobal in an open, inclusive and respectful process. We're on track to achieve most of the ESG goals we set for 2022. We are hosting our third annual ESG call on September 22, when we will provide more information on our progress and areas for improvement.\n\nIn closing, we remain in a solid financial position with cash and short-term investments of $241.3 million and an undrawn line of credit of $500 million. We declared a dividend of $0.11 per share in line with our dividend policy. And now I would be happy to take your questions.\n\nOperator\n\n[Operator instructions] The first question is from Cosmos Chiu from CIBC. Please go ahead.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nHi. Thanks, Michael. Maybe my first question is around Dolores. Certainly, with the write-down, you've made some changes, as you mentioned, I think mining will likely last another two years, and that it sounds like residual leaching until year 2030.\n\nCould you maybe wrap it up for me in terms of what sort of the new mine plan is? And how that's changed from your previous assumptions?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nYes, Cosmos. I'll just start general then pass it over to Steve for some more detail. Actually the mine plan and the open pit mining did not change the timing, the two years. Afterwards, we go into the residual leach that was longer term there.\n\nWe cut it at the moment that 2030, as I mentioned in the call, that obviously is going to be an economic analysis that happens every year, right, when you go to whatever 2028, 2029, 2030, depending on cost and metal prices, etc., how long that leach cycle will continue. But I'll pass it on to Steve for further details.\n\nSteve Busby -- Chief Operating Officer\n\nYes. The only thing I would add, Cosmos, is that the original plan we had after open-pit mining ended, we had some stockpiles that were going to run through the plant for -- I think it was initially estimated for a couple of years. If you look at our current life of mine open pit plan, the tons of ore really hasn't changed much at all. The only thing that's fallen out are the two extra years of stockpile rehandle.\n\nAnd then as Michael says, we've shortened the duration of residual leaching as well.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nOK. Great. And then maybe two follow-up questions. Number one, at Dolores, after the write-down, what's your current book value for the asset? And number two, as you said, the underground has now been suspended, how easy it is based on metal prices, maybe hopefully higher metal prices later on, how easy is it to restart it again? And in the meantime, are you keeping the pumps running to make sure you're dewatering it, keeping it in good state?\n\nIgnacio Couturier -- Chief Financial Officer\n\nCosmos, this is Ignacio. Preferred book value is around $260 million, and that includes both the PP&E and the leach pad.\n\nSteve Busby -- Chief Operating Officer\n\nAnd then relative to the underground, yes, we are keeping the dewatering pumps running because that does open the open pit as well, and we're keeping the ventilation and all the ground control systems in place. So we could go back in. There would be a bit of development work that would have to be done toward the open pit to open up the additional ore reserves that move to resources. But apart from that, everything is in good shape to restart.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nGreat. Maybe switching gears a little bit on to more positive news. Michael, it certainly sounds like there's positive progress being made at Escobal. To the extent that you can elaborate on going from preconsultation to consultation, any details that you can give us in terms of what the next stage sort of entails? And then in negotiations or in consultation with Xinka, have they made any specific requests, either it be financial or social that you can share with us?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nYes. Definitely, the change there, as we described in the press release that we are now moved as it's locally defined as Phase 2, which is the consultation itself. During this phase, the Guatemala's Ministry of Energy and Mines, which leads that process is it's a formal dialogue process but they stated the aim to identify and clarify baseline conditions, describe potential impacts and define possible impact mitigation. So thus the Xinka indigenous communities, the Ministry of Mines and Pan American Guatemala, obviously, a subsidiary of Pan American Silver, are participating in that process.\n\nSo there's a lot of details on so far what happened in Guatemala on the process and what's to come on the MEN, the government website. So I would refer everybody to that. There's a link, I believe, on our Escobal section on our Pan American website there, and you will see links and videos and description of the process and how the meetings that happened on so far.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nGreat. Thanks, Michael. And maybe one last question, again, something else here. Provisional pricing, I think I read in your MD&A that there was a $9.3 million negative price adjustment, which is understandable for the quarter just given the decrease in base metal prices.\n\nBut I'm trying to reconcile that because I saw that the realized prices for the quarter was $4.42 per pound copper, $1.73 per pound zinc, which is not that bad. So I guess my bigger question is, how should we look at it on a go-forward basis? How should we calculate it? And is there a bigger potential impact for Q3 and then onwards?\n\nIgnacio Couturier -- Chief Financial Officer\n\nHi, Cosmos. This is Ignacio again. So yes, the provisional price adjustments are just a function of the amount of metal that has open QPs quotational prices at the end of every quarter, and it does vary depending on the contracts that we have. It is a difficult thing to the model given that a lot of the times, the clients are the ones that have the options on the QPs that they declare.\n\nBut just to give you some approximate numbers, at the end of Q2, we had about 1.2 million ounces of silver that didn't -- that the prices were still open and around 1,000 ounces of copper approximately and 3,800 ounces of, sorry, tonnes of copper and around 3,800 tonnes of zinc. So that gives you an estimate. But it does vary quarter to quarter. We do monitor it.\n\nAnd obviously, given drops in prices, that's what impacts it.\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nGreat. Thanks again. Those are all the questions I have. Thanks again for answering my questions.\n\nIgnacio Couturier -- Chief Financial Officer\n\nThanks, Cosmos.\n\nOperator\n\nThe next question is from Trevor Turnbull from Scotiabank. Please go ahead.\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nHi. Thank you. Hopefully, I'm not going to repeat too much of what Cosmos just asked, but I just wanted to ask one high-level question on the Dolores suspension. I know that operating margins were clearly the issue, but can you just discuss kind of what aspect was the tipping point? Was it a matter of the scale of the operation, grade profile or labor rates? And what I'm trying to get at, I guess, is just trying to understand what would need to change going forward that would let you bring it back online?\n\nSteve Busby -- Chief Operating Officer\n\nTrevor, I assume you're talking the underground mine suspension at Dolores specifically.\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nYes. Sorry about that, Steve, yes.\n\nSteve Busby -- Chief Operating Officer\n\nYes, yes, yes. OK. Fair enough. Yes.\n\nSo it's really -- it was truly a function of cost and development needs. I think we've talked in previous quarters that the residual -- the remaining reserves that we had on the books to be mined was in and around the open-pit mine. So there was some sequencing challenges we had as we are mining the depth of Phase 8 and Phase 9 that we're in now, that we didn't really want to have any kind of interference between the underground mine and the open pit. So we always kind of backed away from that development over the last few quarters.\n\nAnd now with these increased costs, as we look at it and what it takes to develop back in there, at these current cost levels, we just didn't feel the margins were worth pursuing that. So if cost structure changes, if metal prices changes, by all means, that would open back up and we could get in there and get the residual part of those reserves that move to resources.\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nOK. That's all I had. Appreciate it, Steve.\n\nSteve Busby -- Chief Operating Officer\n\nYou bet.\n\nOperator\n\nThe next question is from Lawson Winder from Bank of America Securities. Please go ahead.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Good morning, and thank you for the updates on everything here. I wanted to ask a really, really sort of like high-level big picture question about Dolores and the Minefinders acquisition. So as we approach the end of life at Dolores, I mean, I think it's pretty fair to say that it's kind of underperformed expectations since the Minefinders acquisition back in 2011.\n\nWhat would you chalk that -- or how would you explain what everybody kind of got wrong at the point of that acquisition? Because I know both Pan American and analysts were quite excited about that at the time. Yes, I'd love to hear your thoughts on that.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nWell, I think one of the major differences is when -- remember, the acquisition happened in 2012, but substantially much, much higher metal prices. And while we did a lot of analysis at different metal prices, I believe, at that time, silver was probably in around $30. We obviously -- we didn't account for that silver price dropping to what was the low in that time between $10 and now probably...\n\nSomewhere $12 to $14. So that was probably one big driver of that. Definitely now, of course, much higher costs that we see, but there's still some time left, but it's a shorter life asset now. And obviously, we will need to see quite some changes in metal prices or costs, as Steve said, to like to, for example, we start the underground.\n\nI don't know, Steve, if you want to add something.\n\nSteve Busby -- Chief Operating Officer\n\nJust to add to what Michael said, Lawson. I mean, clearly, the margins are squeezed greater than we thought given the metal price wasn't as high as what we use for the acquisition basis back in 2012 and then the cost kind of squeezed on the other side, too. So the margins were not as prescribed given most factors. The mine overall, despite this issue of what we're facing today at 9B in the open pit, the mine resource overall has performed, I think, pretty close to expectations all in all.\n\nThe only other area where we felt we probably underestimated some of the complexities at Dolores was on the leach pad construction and the leach pad construction costs. That topography and the challenges we found in building reliable leach pads in that area was greater than we thought going in. But apart from that, it was really the margin squeeze based on pricing costs.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nYes. I know that's very helpful color. I appreciate you giving those thoughts. OK.\n\nSo we've already talked a lot about Dolores. I wanted to ask just about a few of the other assets. So at La Arena, are you starting to see any increased levels of sulfide material mixed in with the oxide?\n\nSteve Busby -- Chief Operating Officer\n\nYes. Lawson, Steve again. No. We're strictly mining in the oxide zones.\n\nWe know pretty well based on all our modeling where that boundary is, and we're pretty well above that, and we're outside of that. Currently, I think we think the economic hit debt limits are going to be above that zone. We are still drilling. We're still going down.\n\nWe know where that zone is. We know when we get close to it, and we don't really mine any about sulfide ore. But it doesn't really recover on the leach pad anyway.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nJust to add something to La Arena. And you probably heard in the call, as I mentioned on site in the press release that we again replaced 46% of the gold ounces mined. Just astonishing when you think in our purchasing model, we assumed that La Arena will be mined out. The assets will be mined out, I believe it was mid-2021.\n\nWith the new reserve update, I think we go well into 2026, with still -- quite some upside. We are still drilling there. And I think there's probably a good chance for more to come. So at least another five years at it in mine lives up to now with more upside.\n\nSo a very positive story there.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nYes. I couldn't agree more there. I mean, that's certainly been a very positive story for you guys, the whole La Arena thing. I also wanted to ask about Huaron.\n\nSo in Q2, you had really, really strong lead production and then a little bit lower silver production. I just kind of wanted to get an idea for how you see that split moving into the second half. So would that be expected to reverse?\n\nChris Emerson -- Vice President, Business Development and Geology\n\nLawson, this is Chris. Certainly, as the amount of different veins we have from Traviata, which is high copper. We've got all these different structures with the lead and the silver more predominant or we've got lead, zinc, silver and copper, etc. So really it's a mix of all of those different veins that come in.\n\nAnd certainly, we would be performing to budget and forecast. And so I think you can expect potentially us reverting back to that budget.\n\nSteve Busby -- Chief Operating Officer\n\nYes. I just would add to what Chris said, Lawson, Steve here, is, to be honest, we really drive that plan on NSR. And from a corporate mine planning perspective, the sequencing is really related to the development and the opportunities that the team has to develop into different zones, and these zones are quite variable between lead or copper or high zinc. So I'd say it's hard for us to predict exactly what's going to happen in the second half.\n\nBut I think generally, we will probably not see the same degree of lead, maybe a little bit more in copper is my general gut sense going into the second half, but not materially different.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nAnd then just following the same theme here at Huaron, looking at the reserves, 165% replacement of silver ounces. Huaron is a long time with the company. I believe soon, we will be probably soon having two decades of probably most of the reserve replacement and Huaron. So that just shows you how large and how prospective that, that ground is.\n\nAnd of course, much easier in that sense to replace your reserves in the vein deposit than in an open pit where you're bound to a pitch out.\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nYes. That's helpful. I guess you were asking about the lead. I know obviously, you have silver production guidance for each mine.\n\nBut on a mine-by-mine level, there is no base metal production guidance. So that color is very helpful. That's it for me.\n\nSo that color is very helpful. Thank you. That's it for me.\n\nOperator\n\nThe next question is from John Tumazos of John Tumazos. Please go ahead.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nThank you. I'm trying to imagine what consultation might be in Guatemala. And I recall years ago going to the Marlin Gold Mine where the local people spoke a language called Mam and another time going to the nickel mine in the East where the local people spoke K'iche. What language are the consultations held in? Are the Xinka people able to understand how a mine and a profit-seeking business operates? Would you say that 100% of the consultation involves things that can Pan Am can control and manage? Or does the consultation stray where a large fraction of it is contemporary social issues of the country for the last 500 years where the Xinka people might not have been represented by the government or 1700s, the Catholic church paid bounties on Xinka scouts, things like that?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nThanks, John. I'll pass on to Sean McAleer is here. He's participating as the country manager in Guatemala in the consultation. So please, Sean.\n\nSean McAleer -- Senior Vice President and Managing Director, Guatemala\n\nYes. Good morning, John. The meetings right now are held in Spanish. And while there is a Xinka language, but the meetings are held in Spanish right now.\n\nAnd so all the transcripts, the discussions and all the presentations are done in Spanish, so that's what we expect going forward. And there may be issues with Xinka language that arise, and those will be dealt with at the time. We expect that we're going to be providing information as a company, the Ministries of Health, culture, environment and energy mines will be presenting information about the project as well as the company in the next few months. And I think at that time, we'll hear specifics about the concerns and the men will have to address what the government is going to do, and we'll probably be asking the company for what the mitigations might be possible.\n\nSo we expect that to be developing in the meetings coming up in the next few months.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nDoes the dialogue relates specifically to the Escobal project, or to broader social and political issues possibly outside your control?\n\nSean McAleer -- Senior Vice President and Managing Director, Guatemala\n\nSo up to this point, the meetings have really been about the process itself. And again, I expect that we'll get into those kind of details that you're asking about over the coming months, that's things that we discussed as the information is presented, the concerns are raised and then the issues are resolved. So I expect to -- we'll have more information about that toward the end of the year and probably next quarter update.\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nThank you. Sorry for the detailed nature of the questions. I just don't know what consultation means in Guatemala.\n\nOperator\n\n[Operator Instructions] The next question is from Don DeMarco from National Bank Financial. Please go ahead.\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nWell, thank you, operator. And good morning, Michael and Steve. So Q2 also saw the cost at other mines and focusing on La Arena and Manantial Espejo, did you perform impairment testing on these assets? And if so, how did they fare and what's the asset? They're also somewhat short lived, and so is the outlook unchanged despite the elevated cost that we saw in Q2?\n\nSteve Busby -- Chief Operating Officer\n\nYes. I could start, and then I'll turn it over to Ignacio. Basically, no, the outlook at those mines hasn't changed. The results for Q2 were pretty much in line with what we expected even though there were some higher costs.\n\nWe think they were in the range to where it really didn't lead to any kind of trigger to do any kind of impairment analysis for those assets. Ignacio, I don't know if you want to add.\n\nIgnacio Couturier -- Chief Financial Officer\n\nYes. Not much more to add, Steve. Yes, there were no impairment indicators different from Dolores. So therefore, we didn't do any sort of testing.\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nOK. Thanks for that. And with the end of Dolores in view and other mines that are short-lived. Does the company have a strategy for replacing assets or perhaps a targeted level of production in gold and silver segments to maintain?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nSo Don, as you know, we are always very active on the business development side. There's different ways to do that, one is exploration. As I mentioned before, there was a lot of strong replacement of our reserves in many of our flagship assets. And we did that over many, many years or decades here in the past.\n\nSo that's obviously one way to expand. Like the example, I gave at La Arena, I can give that example for several mines here. The other one is bigger exploration success. And I would really like to add there, the Skarn discovery.\n\nI think when you looked at the last results we published, and this is becoming a really, really big discovery. We will publish the new resource update at Skarn, I would say probably within a month time or so. So that will be a very interesting data point. But as you can imagine, the old resource we have that is currently on our books already, 100 million tonnes.\n\nAnd I would expect that number to grow. So that's the other way to replace our reserves by adding a completely new project like that Skarn. And then the third way is obviously acquisitions, which we always have to look out there to see what there is either an earlier stage project or later stage. As I always stated, we are very picky on that because we want to -- we're looking for acquisitions that are accretive.\n\nAnd I think we've shown that with the acquisition of Tahoe three years back. And the positive impact that can have. So it's really those three pillars, not different than for any other mining company, I would say, we're in a very strong financial position. So doing acquisitions and consolidate our space is obviously something that lies well in our means.\n\nBut as I said, now I mean we have shown over years and years and years on our exploration success, and I think that really got topped with the Skarn discovery at La Colorada.\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nOK. OK. Fair enough. That gives some good color.\n\nShifting over to La Colorada, performed well, and I see that some of the access to high-grade zones resumed, thanks to the ventilation. Do you expect that to continue? And would we expect to see further incremental gains both in terms of throughput or grade in the coming quarters?\n\nSteve Busby -- Chief Operating Officer\n\nYes, Don. Steve here. Certainly, on the throughput side, this ventilation is really, really helping us a lot and the refrigeration plant is also helping a lot. So it is allowing us to catch up, if you will, on ground control and development into the areas that were originally scheduled to mine a couple of years back.\n\nSo we do anticipate seeing throughput come up, but we do think grades will kind of maintain in and around the reserve grade of the deposit. We're really targeting to mine this. We see this as a very long-term asset, and we'd like to mine it consistently at reserve periods as we go forward.\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nOK. Well, thanks for that, Steven. Just to segue into the Skarn then, we're all excited to see the resources. Was there any reason why it was just pushed forward a little bit?\n\nMichael Steinmann -- President and Chief Executive Officer\n\nWell, it's just we always announced in Q3, I mean it was kind of a -- is it ready? There's a lot of work right now going on, as you can imagine, as it is so large and a lot of decisions on the mining method. So we're talking about a few weeks here, not a major change and well within Q3 that we will publish those new resources.\n\nSteve Busby -- Chief Operating Officer\n\nIn terms of the resource. In terms of the mining method, I mean, we are making great progress in evaluating this bulk mining method that we talked about a couple of quarters ago. And it does look quite exciting to us, but it is a complex method. This is a deep mine.\n\nSo it is taking a lot of time to build this mine plan. And we're looking at a couple of unique options kind of leading-edge technologies for cave mining in these days and applying it here. So we want to make sure we look at that right. And correctly, we've got a lot of really high talented consultants who have developed these things around the world.\n\nSo we need some time to work through that and be comfortable before we start coming out with mining plans, mining costs, things of that nature.\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nOK. Great. We'll look forward to that, and good luck in the back half of the year. Thank you very much.\n\nSteve Busby -- Chief Operating Officer\n\nThanks, Don.\n\nOperator\n\nThis concludes the question-and-answer session. I would like to turn the conference back over to Michael Steinmann for any closing remarks.\n\nMichael Steinmann -- President and Chief Executive Officer\n\nThanks, operator, and thank you, everyone, for joining us on this call. We'll talk again in November to share our Q3 results. Have a good rest of the summer. Thank you very much.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nSiren Fisekci -- Vice President, Investor Relations\n\nMichael Steinmann -- President and Chief Executive Officer\n\nCosmos Chiu -- CIBC World Markets -- Analyst\n\nSteve Busby -- Chief Operating Officer\n\nIgnacio Couturier -- Chief Financial Officer\n\nTrevor Turnbull -- Scotiabank -- Analyst\n\nLawson Winder -- Bank of America Merrill Lynch -- Analyst\n\nChris Emerson -- Vice President, Business Development and Geology\n\nJohn Tumazos -- John Tumazos Very Independent Research -- Analyst\n\nSean McAleer -- Senior Vice President and Managing Director, Guatemala\n\nDon DeMarco -- National Bank Financial -- Analyst\n\nMore PAAS analysis\n\nAll earnings call transcripts"
}