{
  "companyName": "Lowe's",
  "companyTicker": "LOW",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/16/lowes-low-q3-2022-earnings-call-transcript/",
  "content": "Lowe's (LOW -1.49%)\nQ3 2022 Earnings Call\nNov 16, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, everyone, and welcome to Lowe's Companies third-quarter 2022 earnings conference call. My name is Rob, and I'll be your operator for today's call. As a reminder, this conference is being recorded. I will now turn the call over to Kate Pearlman, vice president of investor relations.\n\nKate Pearlman -- Vice President, Investor Relations\n\nThank you, and good morning. Here with me today are Marvin Ellison, chairman and chief executive officer; Bill Boltz, our executive vice president, merchandising; Joe McFarland, our executive vice president of stores; and Brandon Sink, our executive vice president and chief financial officer. I would like to remind you that our notice regarding forward-looking statements is included in our press release this morning, which can be found on Lowe's Investor Relations website. During this call, we will be making comments that are forward-looking, including our expectations for fiscal 2022.\n\nActual results may differ materially from those expressed or implied as a result of various risks, uncertainties, and important factors, including those discussed in the risk factors, MD&A, and other sections of our annual report on Form 10-K and our other SEC filings. Additionally, we'll be discussing certain non-GAAP financial measures. A reconciliation of these items to U.S. GAAP can be found in the quarterly earnings section of our Investor Relations website.\n\nNow, I'll turn the call over to Marvin.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nThank you, Kate, and good morning, everyone. In the third quarter, our total company comparable sales increased 2.2%, while U.S. comps increased 3%. These better-than-expected sales were driven by improved DIY demand supported by fall nesting trends as travel slowed down and children returned to school.\n\nWe also saw continued momentum in Pro reflecting the success of our Pro initiatives and the resilience of home improvement demand. In addition to strong sales growth, our persistent focus on productivity once again drove improved operating performance with substantial improvement in adjusted operating margin of 54 basis points and adjusted diluted earnings per share of $3.27, an increase of 20% as compared to last year. These outstanding results enable us to make critical investments in our most important asset, our associates. In this quarter, we announced an incremental $170 million investment and permanent wage increases for our frontline hourly associates.\n\nThese increases are designed to ensure that our more tenured associates continue to receive market-competitive wages. And in further recognition of the hard work and dedication, we are awarding $200 million in bonuses to our frontline hourly associates ahead of the holiday season. At Lowe's, we make every effort to ensure that our associates share in our financial success, and I am very pleased that we are once again able to award a discretionary bonus because our performance is tracking ahead of our expectations. This is a true win-win outcome for the company, for our shareholders, and for our associates.\n\nAll of these investments reflect our efforts and our commitment to become the employee of choice in retail, where we continually invest in our associates and help them support their families and grow their careers at Lowe's. Now, turning to Pro. We delivered growth of 16% and 36% on a two-year basis, the tenth consecutive quarter that we've driven double-digit Pro growth. We are building on our greatly improved Pro product and service offerings with our new MVPs Pro Rewards and Partnership Program and our enhanced Pro CRM, which Joe will discuss later on the call.\n\nWe recently completed our annual Pro pulse survey, which provides real-time insights into what's on the minds of our Pros and how they view their future business opportunities. And we're encouraged to hear that Pros remain optimistic with over 70% saying that they expect even more work in 2023 than they had in 2022. This is just another proof point of the resilience of home improvement demand even in this uncertain macro environment. On lowes.com, sales grew 12% this quarter over four times our U.S.\n\ngrowth rate, representing a sales penetration of 10%. We continue to enhance the online user experience, as well as our fulfillment capabilities, as we focus on driving this critical growth initiative within our total home strategy. Turning to our supply chain transformation. We've made significant strides in our rollout of our market delivery model for big and bulky products this quarter, spanning the country from Southern California to Southern Illinois to Atlanta, Georgia.\n\nWe've now reached an important milestone with eight geographic regions covering more than half our stores converted to the new model, and we're on track to complete the rollout by the end of next year. This is a centerpiece of our supply chain transformation as the market delivery model will enable us to further consolidate our industry leadership position in appliances and position us for profitable growth in other big and bulky products like grills, riding lawn mowers, stock cabinets, and vanities. This also improves the customer experience through expanded fulfillment options and a seamless omnichannel shopping experience powered by technology. We also just announced that we will be opening a new coastal holding facility in the port city of Suffolk, Virginia.\n\nOur expanded coastal holding facility network is opening up capacity for us to hold product upstream from our distribution centers, which creates the flexibility we need to flow the products quickly and where and when it's needed. This helps us to not only capture sales but also mitigates markdown risk because we avoid stranding product unnecessarily in our stores. And now, I'd like to discuss the macro environment and specifically address some misperceptions that I've heard about the home improvement market. You've heard me talk about this before, but demand drivers for home improvement are distinctly different from those that drive home building, so it's important not to confuse the two.\n\nAnd as a reminder, at Lowe's, the three highest correlating factors of home improvement demand are home price appreciation, age of housing stock, and disposable personal income. So, let's start with home price appreciation. Even if there is a broad-based decline in home prices, homeowners currently have a record amount of equity in their homes, nearly $330,000 on average, which remains supportive of home improvement investment. And even in the select U.S.\n\nmarkets where home prices have declined after a particularly steep run-up during the pandemic, we are not seeing any impact to sales. Second, the average age of homes in the U.S. is over 40 years old and roughly 3 million more homes built during the housing boom in the mid-2000s, will be entering prime remodeling years by 2025, which is a key inflection point for big-ticket repairs. This is one of the key reasons why two-thirds of home improvement spend is nondiscretionary on repair or maintenance projects that cannot be delayed.\n\nThird, consumer savings are near record highs, while disposable personal income remain strong. And more than 90% of homeowners either own or home or are locked into a low fixed mortgage insulating them from rising rates. On top of these three factors, there is a persistent $1.5 million to $2 million under supply of homes, and 250,000 first-time millennial homebuyers are expected per year through 2025. This unique combination of factors is causing homeowners to trade up in place, preferring to invest in repairs and renovations, to make their current homes meet their families evolving needs rather than buying a new home.\n\nAnd this is why we're so confident about the outlook for the home improvement industry even in a period of high inflation and rising interest rates because the key drivers of our business remain supportive. And with the investments that we've made to transform our business, we also have the operating agility needed to rapidly pivot if market conditions worsen. And we have a very experienced leadership team of home improvement veterans who have developed a proven playbook to respond to a slowdown. At the same time, we would not lose our focus on investing in long-term growth.\n\nNow, before I close, I'd like to take a moment to discuss our recent announcement regarding our intention to sell our Canadian retail business to Sycamore Partners. Lowe's first entered Canada in 2007 and later expanded with the acquisition of RONA in 2016. Over the last few years, we focus on the retail fundamentals of our Canadian operations, which brought the Canadian business to profitability and improved its operating cash flows. However, for this business to achieve the profitability in line with the U.S., significant incremental capital investments would be required to streamline the banners and improve operating margins.\n\nBy contrast, we have tremendous opportunity for continued market share and profitable growth in our U.S. home improvement business. This transaction will simplify our business model, improve our operating margins and return on invested capital while enabling us to deliver sustainable value to our shareholders. Brandon will provide details regarding the financial impact of the transaction later on the call.\n\nI would like to thank our entire Canadian team for their hard work and dedication to our customers, and we look forward to collaborating with Sycamore Partners in executing a seamless transition. I'd like to also extend my appreciation to our team in the U.S. for their ongoing commitment to serving customers and the communities. And with that, I'd like to turn the call over to Bill.\n\nBill Boltz -- Executive Vice President, Merchandising\n\nThanks, Marvin, and good morning, everyone. In the third quarter, U.S. comparable sales increased 3%, reflecting solid core home improvement demand across both Pro and DIY customers. This quarter, we drove positive comps in our building products and home decor divisions, fueled by momentum with the Pro and improve DIY demand.\n\nIn hardlines, comps were down slightly as we cycled over significant storm prep activities in Louisiana from Hurricane Ida in 2021 that did not repeat at the same scale when Floridians prepared for Hurricane Ian in 2022. Overall, growth was well balanced with eight of our 15 merchandising departments above company average. Beginning with our home decor division, the fall nesting trends that Marvin mentioned led to standout performance across core interior categories, including appliances, paint, kitchens and bath, and flooring. Appliance sales were bolstered by a strong Labor Day event and higher online sales as we continue to enhance our lowes.com user experience.\n\nAs an example, this quarter, we began displaying delivery dates earlier in the purchase process to highlight our improved next-day delivery options. If the customer needed to quickly replace a refrigerator or washer that's just stopped working, this feature now helps them focus their attention to product that's immediately available. This is especially important for Lowe's as our appliance business is skewed toward replacement within existing homes versus new housing starts. As I mentioned last quarter, we also continue to see customers trading up for innovation, like with our new Maytag Pet Pro washer with technology that removes pet hair from clothes in the wash cycle, which is exclusive to Lowe's.\n\nThis quarter, we also launched a new exclusive home center partnership with Mila, a global leader known for high-end premium appliances. This reflects our ongoing commitment to ensuring that we have new, high-quality offerings across all price points with leading products from all-star brands like Trex, DEWALT, Owens Corning, John Deere, EGO, Honda, KitchenAid, Samsung, LG, Kohler, Moen, Whirlpool, Husqvarna, and Ariens. Paint delivered strong positive comps this quarter across both Pro and DIY. Many of our Pros, especially those who focus on repair and remodel work, paint as part of their larger jobs.\n\nIn other words, these are Pros who paint rather than professional painters. And these Pros are starting to see the value of our new MVPs Pro Paint Rewards program paired with our expanded job site delivery for paint. These enhanced benefits and capabilities are making it more convenient and cost-effective for Pros to purchase their paint directly from Lowe's, earning us more of their business. In our continued partnership with Sherwin-Williams, we are also upgrading our paint departments across the U.S., including a new color wall that converts all HGTV colors to Sherwin-Williams colors, which resonates with both DIY and Pro customers.\n\nWith our new color wall, we are bringing all the colors together so that customers can easily match their favorite Sherwin-Williams paint color at our paint desk. We are also resetting some categories to pull relevant, higher-margin, and more frequently purchased products closer to the front of the department, making it easier for customers to get everything they need for their paint project in one trip. We plan to have half of our stores converted to this new color wall by the end of this year and roll it out everywhere by the end of next year. We are very pleased with the progress we've made in this core category in just a few short years.\n\nWe are gaining traction with both Pro and DIY, and this recent update highlights just a few ways that we plan to continue to take market share in paint. We also had strong positive comps in kitchens and bath, largely driven by improved in-stocks for cabinets and customers opting to trade up for larger, higher quality in-stock cabinets versus waiting for custom orders. Within flooring, vinyl flooring once again led the way as busy homeowners returning to durable, low-maintenance flooring options available in popular brands like Pergo and STAINMASTER. And we're gaining momentum across our private brand portfolio, especially in STAINMASTER, Origin 21, Allen + Roth, and Kobalt, as this is just another indication of the traction that we are gaining with our total home strategy.\n\nTurning to our performance in building products division. We continue to see broad-based, balanced growth across Pro and DIY in millwork, rough plumbing, electrical, lumber, and building materials, driven by strong project-related demand. We are encouraged by the DIY strength that emerged in building products this quarter as lumber prices come down, DIY consumers are reengaging in home improvement projects they had previously put on hold, leading to double-digit lumber comps in the quarter. In our hardlines division, as lumber demand increased, so is demand for related attachment categories like fasteners, leading to our strong positive comps in hardware.\n\nWe also continue to see a trend of customers investing in innovation. Our EGO battery now powers 75 different tools, everything from traditional outdoor power equipment like mowers, trimmers, and leaf blowers to lifestyle products like camping generators and misting fans. And with the accelerated growth in battery-powered products that we're seeing, it's not surprising that EGO continues to lead the pack in battery-powered outdoor power equipment. Given the concerns in the marketplace, some of you have asked if we're seeing a shift away from discretionary purchases, which is what we typically expect to see in a softer macro environment.\n\nAnd the straightforward answer is no. We had a strong sell-through in Halloween this year with an early sell-out of our 12-foot lighted animated mummy at a price point over $300. One could argue that this is one of the most discretionary items we sell. And with Halloween, in total, being a highly discretionary category, this continues to give us a positive indication of the strength of our consumer.\n\nWe kicked off the holiday season with our trim a tree sets early in the quarter. We are seeing early sell-through on taller, higher-end artificial Christmas trees, which is another example of both discretionary purchasing and consumers trading up. Before I close, I'd like to thank our merchants, supply chain team, and our vendor partners for their hard work and the continued partnership as they continue to provide our customers with the products that they need as we support our stores and communities in the recovery efforts from Hurricane Ian. Thank you, and I'll now turn the call over to Joe.\n\nJoe McFarland -- Executive Vice President, Stores\n\nThank you, Bill, and good morning, everyone. Let me begin with a heartfelt thank you to our associates. Our strong performance this quarter is a direct reflection of their hard work and dedication to providing excellent customer service. That's why we are so focused on becoming the employer of choice in retail where associates choose to stay to build their careers.\n\nAt its core, that means providing good, stable jobs, comprehensive benefits, competitive wages, and bonus opportunities. As Marvin mentioned, this quarter, we announced $170 million in permanent wage increases, and we are awarding $200 million in bonuses ahead of the holiday season for our frontline hourly associates. This translates to up to $1,000 for eligible full-time associates and up to $500 for eligible part-time associates. As someone who started my career as an hourly associate in home improvement, I understand how meaningful this type of financial recognition can be.\n\nOur executive leadership team is passionate about rewarding our associates and taking care of our customers, which is demonstrated in the investments we make in both our people and in the communities we serve. Another example of these investments in action is the transformation of our disaster response capabilities over the last few years, which dramatically improved our ability to support communities through devastating storms like Hurricane Ian. Year round, Lowe's now has a cross-functional command center dedicated to supporting our disaster response efforts. In fact, it was these enhanced capabilities that enabled us to respond so effectively to the pandemic.\n\nWe also deploy our emergency response teams to the hardest hit areas. These associates volunteer to lead their home stores, giving their colleagues in the impacted areas a chance to focus on their families, and we go a step further to help impact the associates by deploying refueling stations and our mobile disaster relief trailers with showers, washers, dryers, and meals and offering financial assistance through our Lowe's Employee Relief Fund. In addition to demonstrating the importance of our improved disaster response capabilities, Hurricane Ian also spotlighted the value of our expanded omnichannel fulfillment options. Earlier in the quarter, Lowe's rolled out same-day delivery nationwide with more than 1,700 stores now supported by Instacart.\n\nThis partnership allows us to deliver over 30,000 items stocked in our stores, that weigh up to 60 pounds, to our customers. In the days leading up to the storm, we received thousands of these same-day orders to help customers prepare and protect their homes. Customers were able to get critical items they needed like water, sand, buckets and batteries without having to leave their homes, and it continues to be a helpful option for many who need supplies in the wake of the storm. And we continue to optimize our parcel network in Q3, another important step in our journey to enhance our omnichannel fulfillment capabilities.\n\nWe rebalanced our network to ensure our parcel stores are optimally located close to shipping hubs, and we have upgraded our technology and hardware to support faster fulfillment. Ahead of the holidays, we are on track to meet our goal of decreasing shipping times by 50%. And these are just a few of many examples of our tenacious focus on perpetual productivity improvements, or PPI, that are scaling across our stores over time. Shifting to Pro, I would like to thank our Pro team for delivering outstanding results once again this quarter, driving Pro comps over 16% for the quarter and 36% on a two-year basis.\n\nWe are leveraging our new MVPs Pro Rewards and Partnership Program to capitalize on this continued demand by engaging Pros, incentivizing purchases, and building long-term loyalty. Our program is laser focused on helping Pros grow their business because we know that when Pros succeed, we succeed. This partnership-based approach is already paying off with higher-than-expected adoption rates and building overwhelmingly positive feedback from our Pros. We recently asked all of our regional vice presidents to find Pros who do not want to sign up for our loyalty program, so we can talk to them and understand why.\n\nBut that proved to be a real challenge because once Pros here the benefits, they are eager to join. So, awareness and continued execution will be the key to our ongoing success. As I close, I would like to thank our associates once again for their commitment to Lowe's and our customers. Without them, the strong results that we delivered this quarter would not be possible.\n\nNow, I'll turn it over to Brandon.\n\nBrandon Sink -- Executive Vice President, Chief Financial Officer\n\nThank you, Joe. I would like to begin this morning by providing additional details regarding our recent announcement of our intention to sell our Canadian business. As Marvin mentioned, despite making meaningful progress in improving our Canadian retail business over the past few years, it has continued to lag our U.S. operations and sales growth, operating profit, and return on invested capital.  In fact, the Canadian business represents approximately 60 basis points of dilution on our full-year operating margin outlook.\n\nAnd during the quarter, we recorded a pre-tax noncash impairment charge of 2.1 billion related to this business. Looking ahead, this transaction makes us a U.S.-focused business and gives us a clear line of sight to meaningful, long-term improvement of our sales productivity, operating margin, and return on invested capital in particular. We are excited to share our updated financial targets at our upcoming analyst and investor conference in December. Turning to our Q3 results.\n\nWe generated GAAP diluted earnings per share of $0.25 compared to $2.73 last year. Now, my comments from this point forward will include certain non-GAAP comparisons where applicable. Excluding the 2.1 billion asset impairment charge, we generated adjusted diluted earnings per share of $3.27, an increase of 20% compared to third quarter of 2021. This increase was driven by a combination of top-line growth, strong P&L management, and disciplined capital allocation.\n\nQ3 sales were 23.5 billion with comparable sales up 2.2%. Comparable average ticket increased 8%, driven by product inflation, 80 basis points of commodity inflation, and higher Pro sales. Of note, FX represented a 30-basis-point headwind to consolidated comps. Higher average ticket was partly offset by comp transactions declining 5.8%.\n\nOf note, comp transactions have improved significantly as we moved through the year with Q3 over 730 basis points higher than Q1 and 60 basis points higher than Q2. U.S. comp sales were up 3% in the quarter, while sales in Canada were down 10.2% in USD, with roughly half of the decline attributable to a stronger dollar. Pro sales were up 16% in the quarter, driven by broad-based strength across all categories.\n\nDIY sales trends improved from Q2 with strong performance across many core home improvement and categories as consumers spent more time at home following summer travel activity. DIY project-related demand also increased sequentially due to lower lumber prices. On lowes.com, sales increased 12% in the quarter, partly driven by strong appliance sales. Finally, we estimate that the net effect of storm-related sales year over year was relatively flat as we cycled over Hurricane Ida in the prior year.\n\nOur U.S. monthly comps were up 4% in August, 3.4% in September, and 1.4% in October. On a three-year basis, U.S. comps increased 33.5% in August, 37.8% in September, and 42.1% in October.\n\nGross margin was 33.3% of sales in the third quarter, up 20 basis points from last year. Product margin rate was up 110 basis points versus the prior year as we cycled over a lumber margin pressure in the third quarter of 2021, which was triggered by a steep decline in prices that began last July. Higher product margin rate was partly offset by 30 basis points related to higher domestic and import transportation costs, as well as the expansion of our supply chain network, along with 35 basis points of pressure from shrink. Adjusted SG&A of 18.7% of sales levered 41 basis points, driven by higher sales and substantial improvement in productivity.\n\nAdjusted operating profit was 3 billion, up 7% versus the prior year. Operating margin rate of 12.71% of sales leverage 54 basis points, driven by both higher gross margin and SG&A leverage. The adjusted effective tax rate was 24.5% below the prior-year rate. Inventory ended the quarter at 19.8 billion, up 3.1 billion from the same quarter last year, largely driven by product inflation and higher freight costs with units roughly flat to prior year.\n\nThis morning, we are increasing our full-year 2022 financial outlook based on stronger-than-expected flow-through year to date. Please note that our outlook for operating margin, diluted EPS, and return on invested capital are all adjusted to exclude asset impairment and expected transaction costs associated with the sale of our Canadian retail business. We now expect 2022 sales of approximately 97 billion to 98 billion, representing comparable sales of flat to a decline of 1% as compared to prior year. Please note that at the midpoint of the range, this implies that fourth-quarter comparable sales will be slightly positive.\n\nThis reflects our expectations of continued strong Pro performance and steady DIY trends. As a reminder, our 2022 sales outlook includes a 53rd week, which equates to approximately 1 billion to 1.5 billion in sales. We continue to expect gross margin rate to be up slightly as compared to the prior year. As you look ahead to the fourth quarter, keep in mind that we are cycling over the second round of lumber inflation in 2021, which benefited product margins.\n\nWe also expect continued shrink pressure next quarter. Given our disciplined focus on expense management, we now expect adjusted operating margin of approximately 13% for the full year. And we are raising our outlook for adjusted diluted earnings per share for the year from $13.10 to $13.60 to our updated range of $13.65 to $13.80. This reflects better-than-expected SG&A leverage, as well as higher-than-planned share repurchase activity.\n\nWe expect capital expenditures of up to 2 billion this year. Additionally, given our larger-than-expected 4.75 billion notes offering in Q3, we expect to accelerate share repurchase activity that we had originally planned for 2023 into this year. We now expect 13 billion in share repurchases in 2022. And finally, we are raising our outlook of adjusted return on invested capital to above 37% for the year.\n\nNow, turning to our best-in-class capital allocation strategy. In Q3, the company generated 1.7 billion in free cash flow. And through a combination of both dividends and share repurchases, we returned 4.7 billion to our shareholders. During the quarter, we repurchased 20.5 million shares for 4 billion.\n\nWe also paid 666 million in dividends at $1.05 per share. Capital expenditures totaled 403 million in the quarter as we continued to focus on high-return projects that support our growth objectives. We ended the quarter at 2.5 times adjusted debt to EBITDA, and we are well on track to reach our target leverage of 2.75 times in 2023 while also maintaining our triple-B-plus rating. Finally, we delivered return on invested capital of 27.6% inclusive of a 590-basis-point impact related to the asset impairment recorded in the third quarter.\n\nIn closing, I'm confident that we will continue to deliver shareholder value through our leading capital allocation strategy while investing in our associates and our business to drive long-term sustainable growth. And with that, we'll open it up for questions.\n\nOperator\n\nThank you. We're now ready for questions. [Operator instructions] And our first question today comes from the line of Simeon Gutman from Morgan Stanley. Please proceed with your question.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nGood morning, everyone. Hey, Marvin, I wanted to maybe play devil's advocate for a second on housing, this idea that it's just taking a long time for all these pressures to catch up to the consumer in the segment for all the reasons you cited, plus there's been some labor and product shortages. So, curious how much you debate that, and that there is a certain level of home price depreciation that's going to eventually weigh on this customer.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nNo, I appreciate the question. And here's what I would say. When we look at markets around the country where we saw an aggressive increase in home prices during the pandemic, now you can see some of those prices start to fall. Those markets are performing at the same rate of performance as other markets.\n\nSo, we're already seeing due to the life cycle of home price appreciation and home price declines around the U.S., signals of kind of what the broader macro may look like in months, quarters, and years in the future. The great thing about operating stores in every state and virtually in every ZIP code is that you have a pretty good sample size of kind of what's currently happened but also what future trends may look like. And we're not trying to spin the data. I mean, trust me.\n\nWe're looking at this every day like you are but from a different vantage point, trying to understand demand patterns. But the reality still remains that home prices have appreciated at record levels, as I said in my prepared comments, on average, $330,000 per home. The facts are that homes are older than they've been since World War II. And two-thirds of our business is nondiscretionary because when your house gets older, things break.\n\nThat's just commonplace. The facts are that we have more personal disposable income today than we had before the pandemic, and that's primarily in the bank accounts of homeowners. And the facts are, we're still 1.5 million to 2 million homes under current demand because of the lack of home building coming out of the financial crisis in 2008, 2009. So, those are just facts.\n\nAnd when we look at and try to forecast our business, we have to ask one simple question. Historically, what data points correlate closely to demand patterns for Lowe's? And what I just outlined to you are the data points that correlate to demand patterns, and that's what we look at.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nYep. That's a fair point. I'll jump off of housing and maybe go back to the business. If you look at the things Lowe's can be doing better, and, obviously, you're executing against all the plans that you put in place since you've joined, does it involve higher capex, maybe reallocation of capex? Or is it mostly execution in process?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nWell, I would say from a capex standpoint, we have no expectation to go above our current, you know, capital allocation dollar amount of roughly 2 billion per year. We'll have our investor conference next month, and I can just give you a little bit of a precursor. That's what the number is going to be for next year. So, as we look at things that we still have to catch up, and I'll be very transparent, we're not where we want to be.\n\nWe still have a supply chain transformation process that's underway, but we can get all that accomplished and stay within that $2 billion capex dollar amount. We still have significant IT investments that we need to make. We made incredible improvement, but all those things also fall within that current allocation of capex. You know, Bill is working to continue to improve merchandising and pricing systems.\n\nAgain, those things are all mapped out. They're costed out, and we have a good understanding of it. And we feel like at $2 billion of capex will allow us to achieve all of these things. And again, we'll speak to those in more specificity next month in New York.\n\nBut what I will say to you is, yes, are we working on execution? We are. But I can tell you right now, I couldn't be more pleased with our ability to execute at a high level and arguably the most difficult retail environment of our lifetimes. Anytime you could be a $100 billion company and you can be so dependent on the global supply chain, and you can manage inventory with basically flat to negative units for the whole year as we have, that tells you that the degree of execution and collaboration is at a high level.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nThank you. Good luck.\n\nOperator\n\nOur next question comes from the line of Michael Lasser with UBS. Please proceed with your question.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. Your big competitor yesterday talked about seeing some early signs of deceleration in the business in areas like grills. Are you seeing any of those similar signs? And separately, what do you think drove the acceleration in October on a monthly -- three-year monthly stack basis?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nYou know -- so, Michael, I'll take the first part of that. I'll let Bill Boltz come in and provide some perspective. But when we look across all of our merchandising departments, we don't have any really red blinking lights of concern relative to certain categories, certain items, certain SKUs. Obviously, when you start to get into different times of the year, we're going to have performance changing based on customer demand.\n\nSo, we didn't have an anticipation that grills would be a top-selling category in the third quarter. It tends not to be. The same wood patio. And as we spoke to a lot of detail last quarter, we do believe there was some degree of pull forward in some of these more seasonal discretionary categories.\n\nBut we are not seeing anything that feels or looks like a trade down or consumer pullback. I mean, to the contrary, the third quarter was our best performing DIY quarter of the year. And that customer segment tends to be kind of the indicator for us on the overall health of our business. Pro has been strong all year.\n\nAnd the good news is for the first time this year, we saw continued strength in Pro, and we saw sequential improvement in DIY. So, that is something that gives us confidence that things are headed in the right direction. I'll let Bill talk about what performed well in the third quarter relative to product categories that really gave us a really strong two to three years stack for that mark.\n\nBill Boltz -- Executive Vice President, Merchandising\n\nYep. Thanks, Marvin. And, Michael, I think just a couple of things. We see -- as we go into Q3, we see a shift away from a heavy reliance on seasonal like we do typically in Q2.\n\nYet there was still some seasonal business to be had in Q3, and that helped us as the weather was favorable. We -- as I said in my prepared remarks, our building products business continued to perform well, and we continue to see strength really across all of our Pro-related categories. And then the shift to indoor, as you see, appliances, kitchen and bath, flooring, paint, those businesses, both on a DIY and the Pro side, you know, continue to do well. And then, holiday with Halloween, and then the early sets of our trim a tree categories were what we saw in Q3.\n\nAnd then our online business continued to perform well in Q3 as well.\n\nJoe McFarland -- Executive Vice President, Stores\n\nHey, Michael, this is Joe. I'll add just one additional point. And that's our new MVP Pro Rewards Program that we have been discussing. And so, when I look at our adoption rates being way better than expected, the new Pro CRM platform and then just a combination of our strong credit offering along with Pro loyalty gives us a lot of confidence in that business as well.\n\nMichael Lasser -- UBS -- Analyst\n\nAwesome. My follow-up question is at the risk of pulling forward a little bit of your messaging from a couple of weeks now, your SG&A dollars have been very well contained over the last few quarters, leading to the idea that maybe Lowe's doesn't have as much cushion in its cost structure in the event that there could be a downturn in home improvement demand, either because of housing or just a weakening labor market. Why is that wrong?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nWell, I would say it's wrong based on the performance in Q1, just use that as your data point. The season broke late, top line was not what we anticipated, yet we still leverage operating margin for the quarter. We see that as an example of the levers that we now have in place to be agile. As I said in my prepared comments, we've got a lot of experience sitting around this table.\n\nThere's very few things that we have not seen. We have a really strong playbook developed. And we think that if the market turns more negative than we may anticipate, then we have the ability to pull those levers and perform really well. As a matter of fact, we're not giving you the details.\n\nBrandon is going to spend a bit of time next month at the investor conference outlining some of those levers and the agility we built so that we can be really, really swift to react to any market conditions.\n\nMichael Lasser -- UBS -- Analyst\n\nThat sounds great. Have a nice Thanksgiving, and thank you very much.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nThank you. Same to you.\n\nOperator\n\nYour next question comes from the line of Brian Nagel with Oppenheimer. Please proceed with your question.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nHi, good morning. Congrats on the nice quarter again. My first question, you know, I don't want to have the risk of sounding nitpicky, but I mean, given the strength in the business, and as Michael just pointed out in his question, the -- basically, these accelerating trends through Q3, and then you talked about the initial strength in seasonal with the mummy sales, why not lift -- why not lift sales guidance for the year, especially in -- when you're lifting earnings guidance?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nSo, I'll give you the philosophical perspective, and I'll let Brandon give you the financial perspective. As you know, Brian, there's a lot of unknown out there. And so, we're not going to be overly bullish for no reason. You had a midterm election that still candidly hadn't been quite determined.\n\nYou have aggressive action from the Fed. You have global geopolitical events happening. And so, we're just being, what I'll describe as appropriately conservative. Do we have confidence in our business? Absolutely.\n\nDo we have confidence in what we're going to deliver for the holiday season, you bet we do. And we think we have a great plan for the balance of this quarter and going into next year. But in an environment where there's so much concern in the macro. We just felt it was appropriate to just be conservative.\n\nSo, our decision not to lift guidance has nothing to do with our lack of confidence. It's just more about being prudent and not being overly aggressive in an environment where there's a lot of on-asset macro questions. So, I'll let Brandon add some additional detail.\n\nBrandon Sink -- Executive Vice President, Chief Financial Officer\n\nYeah, Brian, this is Brandon. As I indicated in my prepared remarks, we looked at three-year comps did see sequential improvement as we moved across the quarter. The Q3 exit rates were strong. Bill mentioned the improvement specifically in the interior DIY-related categories.\n\nThe midpoint of our full-year guide is flat to down one, which implies a slightly positive comp for Q4. And if you recall back in August, we were guiding actually to the bottom end of that range of flat to down 1%. I will cite that the commodity volatility and the impact Q3 to Q4. With lumber where it is, we've actually seen a benefit of 80 basis points to comps in Q3.\n\nIf the pricing runs out into Q4, we're expecting that to actually flip to a 90-basis point drag. So, that's about 170-basis-point swing. Again, that's taken where we are from a benchmark perspective of below about $500 and running that out and comparing that to where lumber prices inflated round 2 of last year. So, all in, excluding lumber, and the differences I just cited, the Pro comp momentum is expected to continue, and the DIY trends that Bill mentioned are expected to continue through Q4.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nThat's very helpful. I appreciate the color there. Then my follow-up question in a separate topic, it is with regard to supply chain. So, Marvin, you keep talk -- you highlighted that there's a lot of success that you've had in improving the low supply chain internally.\n\nBy most measures, now the external environment for supply chain is getting better with shipping costs and such. So, I guess the question, are you seeing that? And then recognizing you haven't given guidance yet for 2023 but to the extent these external supply chain issues continue to correct, could that be a tailwind of some sort as we hit over the next several quarters?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nYeah. Look, it's a great question, Brian. And without getting in front of what we're going to discuss next month, I would say that the short answer is, yes. There are elements of the supply chain that definitely will give us some cost advantages next year.\n\nBrandon is going to be very transparent and very detailed on kind of what we see going into next year. And, obviously, supply chain is going to be a big component of that. In addition to just the overall cost environment for supply chain, we're going to talk about strategic initiatives as well that we're excited about because as far as much work as we've done in supply chain, as I mentioned earlier, we still see it as one of our key opportunities to improve. There's not a great retailer in the world that doesn't have a great supply chain, and we're committed to having a great supply chain.\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nAppreciate it. Congrats.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nOK. Thank you.\n\nBrandon Sink -- Executive Vice President, Chief Financial Officer\n\nThanks, Brian.\n\nOperator\n\nOur next question comes from the line of Liz Suzuki with Bank of America. Please proceed with your question.\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nGreat, thank you. Just as you think about the makeup of comp going forward between transactions and average ticket, you mentioned that in some categories where you saw inflation moderate, you saw a subsequent increase in transactions. Does that give you confidence going forward that as inflation does start to moderate, it will be -- you know, that average ticket decline or lower growth rate would be offset by a pickup in transactions?\n\nBrandon Sink -- Executive Vice President, Chief Financial Officer\n\nYeah, Liz, this is Brandon. I think on the inflation front, we do continue to see high single-digit inflation this quarter, inclusive of about 80 basis points that I mentioned earlier of commodity inflation. Our consumer does continue to be resilient. We haven't seen any significant trade down.\n\nIn fact, we've actually seen trade up in place across a number of categories. And our Q4 forecast, which we're focused on at this point, we're expecting that to continue at the high single-digit mark. We are going to get some relief related to lumber pricing that I mentioned earlier, so that net 170-basis-point swing. But for Q4, that's the forecast is that the inflation is going to continue to lift our ticket, which is going to be the primary driver of our comp, and it's going to be offset by transactions being down in Q4.\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nAnd then just looking out beyond Q4, as you think about the potential outlook for comps going forward and how that ticket versus transactions could play out, I mean, one of the pushbacks that we get is that if ticket remains -- if ticket starts to come down but transactions remain negative, that would be a severe headwind to comp. I'm just, you know, curious how you're thinking about that outlook going forward.\n\nBrandon Sink -- Executive Vice President, Chief Financial Officer\n\nYeah, Liz. We're going to hold until December to really give you a deep view there. We'll have an updated view of the macro, the comp scenarios within that, and specifically the makeup of our comp. And we'll plan to go into details there on December 7.\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nAll right, great. I'll see you then.\n\nBrandon Sink -- Executive Vice President, Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from the line of Zach Fadem with Wells Fargo. Please proceed with your question.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nHI. good morning. So, following up on the SG&A dollar question, as you've been able to take out a couple of hundred million of SG&A in both Q1 and Q2, and while Q3 was basically flat, it looks like your Q4 SG&A embeds a pretty notable step-up in trend, even excluding the extra week. So, can you just help me understand the puts and takes on the SG&A line in a little bit more detail and perhaps talk through the impact of the efficiency initiatives and then also to what extent you're able to flex up and down labor with the lower volumes today?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nSo, Zach, I'll take the first part of that, and then I'll let Brandon and, maybe, Joe provide some additional detail. So, for us, I think the key thing to understand is we have what we call PPI, perpetual productivity improvement initiatives. And we're going to go into some level of detail on how this has become more of cultural process across the whole company at the investor conference next week. But specific to your question, we still believe that we have technology investments that we can make in the store environment specifically to where we can continue to drive SG&A leverage while improving customer service.\n\nBut it's easier to drive SG&A leverage if you're just pulling payroll out indiscriminately. But what Joe and his team has done, we've actually improved leverage in the store from an expense and payroll standpoint and concurrently drove up customer service. And that's the key, and that's really all about technology investments. So, we think that there's still additional initiatives on our project road map that will continue to give us those benefits.\n\nI'll let Brandon take the more financial part of your question, and then if Joe can add something else about payroll and how we can adjust it rather quickly relative to the demands that we're seeing from the consumers in our stores.\n\nBrandon Sink -- Executive Vice President, Chief Financial Officer\n\nYeah, Zach, this is Brandon. The only thing I would add, implied, our SG&A is expected to lever in Q4. And just as a reminder, we are cycling an incentive payout from 2021 in Q4. But I would just add to what Marvin said, continuing to drive substantial PPI initiatives -- store tech modernization, front-end transformation, managing back-office spend.\n\nSo, we're really proud of the progress that we've made, as we mentioned earlier, expecting to significantly outperform from an EBIT standpoint even in declining sales for the full year. And we'll tell you more about what we have in store 2023 in December.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nAnd, Zach, I'm going to let Joe talk about the activity-based model that drives our payroll system in the stores, so you can get a sense that we just don't have a blanket approach. We generate payroll based on a number of transactions and footsteps, and we think that's the best way to look at it. So, Joe, you can expound on that.\n\nJoe McFarland -- Executive Vice President, Stores\n\nYes. And so, thanks, Marvin. What I'd tell you is with our labor system that we have implemented in the last few years, this is really detailed. It's down to by store, by department, by day, by time of day.\n\nIn addition, as you think back in the last several years, our 60-40 initiatives to align the associates with customers and then the tasking activities, you know, we've gone through a series of steps that continued pay go-forward dividends for us. And so, we have a lot of confidence in our ability to navigate to continue with the large investments we've been making. I think, you know, 2023 will be a transformative year for us from an IT system standpoint and the ease of what we're doing.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nGot it. Appreciate all the color there. And then, Marvin, you've mentioned in the past about two-thirds of your business is tied to repair and maintenance activity. And then the remaining third of your business, to what extent would you say those sales are tied to, housing turnover or home price appreciation? And then considering the slowing in these housing metrics, how do you characterize the current demand environment for repair and maintenance activity, which is more stable and recurring versus sales that are perhaps more discretionary or bigger ticket in nature?\n\nMarvin Ellison -- President and Chief Executive Officer\n\nNo. Zach, it's a fair question. What I will tell you is that we're seeing strength in both areas. So, obviously, when you see 19% growth in Pro, 10 consecutive quarters of double-digit Pro growth, then that tells you that there's big-ticket projects going on that are remodel in nature but are also what I would call upgrade in nature.\n\nWe talked about trading up in place, and that is a phenomenon that we're seeing because the 1.5 million to 2 million shortages of homes and the high-interest rate environment is just incentivizing homeowners to keep their low fixed rate and modify their existing home. And so, because of that, you're seeing a combination of older homes getting the maintenance and repair that falls in that two-thirds. But then you see the other one-third that simply upgrading and improving the environment, a new kitchen, finishing the basement, a new bathroom, etc. And so, we're seeing a combination of all of those things.\n\nAnd as Bill walked through the different merchandising department of performance, you can see it embedded in all of those different results.\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nGot it. Thanks for the time.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nNo. Thank you.\n\nOperator\n\nThe next question comes from the line of Jonathan Matuszewski with Jefferies. Please proceed with your questions.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nGreat. Thanks for squeezing me in. And great results. My first question is on inventory.\n\nIt looks like the inventory sales spread widened a bit sequentially in 3Q. From our store check, it looks like your in-stock positions are the best they've been in years. So, is it safe to say that the majority of that inventory increase year over year is tied to average unit cost? And on that topic, how should we think about inventory levels tracking at the end of 4Q? That's my first question. Thanks.\n\nBrandon Sink -- Executive Vice President, Chief Financial Officer\n\nYeah, Jonathan, this is Brandon. So, I would say inventory overall, we feel, is in a really solid position. Balance is up 19%, driven exclusively by product cost inflation and freight units are flat. As you mentioned, our in-stock rates continue to improve across all of our categories.\n\nWe're continuing to make investments in Pro, specifically in those high-demand SKUs. We feel like we got the right levels to support the expected demand that we see for Q4 and into '23. And in reference to Q4, we do expect the inventory to build over Q4 with early ordering, I think, for springs consistent -- compared to pre-pandemic levels. We are still seeing a bit of unpredictability in the supply chain due to the zero-COVID policy in China.\n\nBut just also as a reminder, when we look at our seasonal businesses, specifically, we do start setting south and deep south in Q4, and then we're also maneuvering around Chinese New Year, which is the latter part of January. So, it's going to be critical that we're in stock for spring, and we're making those decisions based on lead times and supplier health across each of our categories.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nThat's really helpful. And then a quick big-picture question on Pro for you, Marvin. Lowe's continues to have great traction there. It looks like the multiyear comp held up this quarter at 36%.\n\nSo, when you think about the recent share gains with the Pro, curious if the drivers have evolved at all. If you could talk through how much new Pro customer acquisition has been driving Pro sales versus greater wallet share from existing Pros, you know, that would be great, and whether you're seeing any change in those 2 drivers. Thanks.\n\nMarvin Ellison -- President and Chief Executive Officer\n\nThank you for the question. We don't give a lot of external information on number of new customers down to that level of specificity. But what I will tell you is that our new loyalty program is absolutely driving new Pro customers, and it's driving more return visits of existing customers, which is exactly what we wanted. And a key data point is this.\n\nWhen a Pro customer is enrolled in our Pro Rewards platform and credit, they shop three times more. So, that is the key data point. And so, in Joe's scripted comments, he talked about the adoption rate and how it really comes down to our ability to engage the Pro. And when we engage them and educate them, they tend to adopt the program.\n\nSo, I'll let Joe provide a little bit more context on Pro. But we're really pleased with the progress and equally pleased that we saw the DIY customer come back strong in third quarter than we've seen them all year.\n\nJoe McFarland -- Executive Vice President, Stores\n\nJonathan, just a couple of things to add. First off, our Pro team here at Lowe's is just full of deep experience inside sales, outside sales, and they've done a really nice job. And so, we're still in the early stages of the MVPs Pro Program but very, very pleased with the adoption that we're seeing. So, we've spoken a little bit in the past about our Pro CRM platform, so we have the ability to better anticipate Pro's needs and drive sales.\n\nAnd then, you know, this really does a nice job of what we call leveling the playing field so that every Pro is important and has the ability to earn points no matter what the size -- and so, things like purchase-based offers, then completing different actions to deepen their relationship with Lowe's. And so, we'll continue pressing forward here but very pleased with the Pro progress.\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nNice to hear. Best of luck.\n\nKate Pearlman -- Vice President, Investor Relations\n\nThanks. Thank you all for joining us today. We look forward to speaking with you at our analyst and investor conference on December 7.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nKate Pearlman -- Vice President, Investor Relations\n\nMarvin Ellison -- President and Chief Executive Officer\n\nBill Boltz -- Executive Vice President, Merchandising\n\nJoe McFarland -- Executive Vice President, Stores\n\nBrandon Sink -- Executive Vice President, Chief Financial Officer\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nBrian Nagel -- Oppenheimer and Company -- Analyst\n\nLiz Suzuki -- Bank of America Merrill Lynch -- Analyst\n\nZach Fadem -- Wells Fargo Securities -- Analyst\n\nJonathan Matuszewski -- Jefferies -- Analyst\n\nMore LOW analysis\n\nAll earnings call transcripts"
}