{
  "companyName": "Target",
  "companyTicker": "TGT",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/17/target-tgt-q2-2022-earnings-call-transcript/",
  "content": "Target (TGT 0.45%)\nQ2 2022 Earnings Call\nAug 17, 2022, 8:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by. Welcome to Target Corporation's second quarter earnings release conference call. [Operator instructions] I would now like to turn the conference over to Mr. John Hulbert, vice president, investor relations.\n\nPlease go ahead, sir.\n\nJohn Hulbert -- Vice President, Investor Relations\n\nGood morning, everyone. And thank you for joining us on our second quarter 2022 earnings conference call. On the line with me today are Brian Cornell, chairman and chief executive officer; Christina Hennington, chief growth officer; John Mulligan, chief operating officer; and Michael Fiddelke, chief financial officer. In a few minutes, Brian, Christina, John, and Michael will provide their perspective on our second quarter performance and our outlook and priorities for the remainder of the year.\n\nFollowing the remarks, we'll open the phone lines for a question-and-answer session. This morning, we're joined on this conference call by investors and others who are listening to our comments via webcast. Following the call, Michael and I will be available to answer your follow-up questions. And finally, as a reminder, any forward looking statements that we make this morning are subject to risks and uncertainties, the most important of which are described in our most recently filed 10-K.\n\nAlso in these remarks we refer to non-GAAP financial measures, including adjusted earnings per share. Reconciliations of all non-GAAP numbers to the most directly comparable GAAP number are included in this morning's press release, which is posted on our investor relations website. With that, I'll turn it over to Brian for his thoughts on the quarter and his perspective on the back half of the year. Brian?\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nThanks, John, and good morning, everyone. Back in June, we announced that our team would be undertaking a bold effort to right size our inventory position in the categories for which demand patterns have radically changed. While this decision had a meaningful, short-term impact on our financial results, we strongly believe it was the best path forward. Consider the alternative.\n\nWe could have held on to excess inventory and attempted to deal with it slowly, over multiple quarters or even years. Well, that might have reduced the near-term financial impact, it would have held back our business over time. Of course, this decision would have driven incremental costs to store and manage the excess inventory over a longer period. But much more importantly, it would have degraded the guest experience.\n\nIt would have cluttered our sales force and hampered our ability to present new, fresh, and fashionable items, the ones our guests expect from Target. Just as importantly, the extra inventory would have presented an ongoing burden to our supply chain and store teams as they face the distraction of working around it day after day. Instead of taking that path of position, our team chose a more decisive path, aggressively reducing the inventory we already owned and cutting back on receipts for the back half of the year. And today, with those decisions behind us, we're in a much better position as we head into the fall season.\n\nAs you'll hear in more detail, we've meaningfully reduced our ownership and commitments in categories where we've seen softening demand. This has allowed us to strengthen our inventory position and in-stock position in the categories that are driving our growth, most notably in food and beverage, beauty, and essentials. Regarding the financial impact of those decisions, Michael will provide more details in a few minutes. But the high-level story is the vast majority of the financial impact of these inventory actions is now behind us.\n\nThis positions our business to deliver a meaningful improvement in operating margin rates in the fall season. However, beyond financial and operational outcomes, I'm focused on how our inventory actions will benefit our guests and our team. Regarding our guests, we're now positioned to continue driving engagement and growing traffic with a clean, safe, and uncluttered store experience and an assortment that highlights newness and supports growth. For our team, this quarter's inventory actions will enable them to focus on doing what they do best: providing a great guest experience while reducing the stress and distraction from overly crowded store backrooms and distribution facilities.\n\nAfter we announced the rightsizing effort at the beginning of June, I've heard from countless leaders across the company. We wanted to relay their gratitude for the decision to move quickly and face the issue head on. In the same spirit, I want to pause and acknowledge the incredible effort of the entire Target team during a very challenging time for the economy, for our industry, and our business. Our success at reducing inventory was a result of unprecedented effort, coordination, and collaboration across multiple teams from our U.S.\n\nheadquarters to our Target India headquarters; to our stores, distribution centers, transportation team, and sourcing offices around the world. And today, in the face of a very challenging backdrop, I'm proud of how our team and business model continue to serve our guests' evolving needs. Everything we do, the design of our operating model to the way we train our team is done with a focus on better serving our guests. It's reflected in how we choose our assortment, where we curate a broad range of items both in-store and online, from the stylish to the functional, incorporating quality and value throughout.\n\nIt's also evident in the way how we design our store; and the digital shopping experience that make them easy, convenient, and inspirational, inviting guests to choose the right option every time they shop. All of these decisions make our business model more durable, allowing us to drive deeper engagement and grow traffic in every environment. Consistent with the shopping trends we've seen for more than a year, our second quarter comp increase of 2.6% was driven entirely by traffic, which expanded 2.7% this year on top of double-digit growth a year ago. With this increase, second quarter traffic has expanded by well over 20% since 2019.\n\nIn raw numbers, that means in the second quarter alone, we've added more than 90 million guest visits over the last three years. These visits are a vivid demonstration of a deepening level of guest engagement resulting from multiple investments throughout our business. These investments include dozens of new stores and hundreds of remodels every year. They also include investments in our industry-leading same-day services, which have transformed our business in a short time.\n\nMore specifically, three years ago, in the second quarter of 2019, digital fulfillment accounted for just over 7% of total sales. In contrast, by the second quarter of this year, the same portion of our digital sales accounted for more than 10% of our total sales. This drove our total digital penetration up to almost 18%, more than doubling in only three years. Beyond our stores and fulfillment services, guests continue to respond to our investments in our owned brand portfolio.\n\nThis portfolio delivers more than $30 billion in annual sales and includes 12 brands that generate more than $1 billion each. At the same time, we're investing in new spaces and presentation for key national brand partners like Apple, Disney, and Levi's. And of course, we've been rapidly expanding the number of stores that feature an Ulta Beauty at Target, given the incremental traffic and sales they deliver. But nothing has been more important than the investments we made in our team.\n\nThis investments include the move to a starting hourly wage range of $15 to $24 across the country, enhanced healthcare and wellness benefits for a larger percentage of our team, the rollout of an industry-leading debt-free college educational plan, and our work to enhance the growth and development opportunities available to all of our team members and the team members of color, in particular. As we look ahead to the back half of the year, the team is laser-focused on delivering convenience, value, and joy at a time when our guests are facing multiple challenges. And while we've taken a cautious stance on our inventory commitments, we'll continue lean into frequency categories where guest demand has been strong and where the markdown risks are very low. In addition, given the ongoing pressure our guests are facing from inflation, we're leaning into value.\n\nThis means we're focused on providing great everyday pricing and strong opening price points across every category, including in our owned brands. At the same time, we hear from our guests that they're focused on celebrating the seasonal moments they missed over the last two years. As a result, we'll lean into those seasonal moments, helping our guests find ways to come together and celebrate with family and friends. So, we still have a lot of business ahead of us.\n\nWe've seen an encouraging start to the back-to-school and back-to-college season, and our teams already deep into their planning for the upcoming Halloween season, a time when we expect our guests will fully embrace trick or treating and scheduling parties to celebrate with family, friends, and neighbors. Given continued volatility in the external environment, we built our fall plans with the priority on flexibility and agility. And that's where our business model shines. More specifically, our multi-category portfolio stays relevant and drives trips across a wide range of wants and needs.\n\nIn today's environment, that means our food and beverage category is front and center, having grown more than 50% or $1.8 billion since the second quarter of 2019. But regardless of whether a Target run begins with a need for an item in food and beverage or household essentials, to see what's new in our beauty assortment, to pick up a toy for a birthday party or a piece of luggage for an upcoming trip, our safe, one-stop shopping experience provides an opportunity to sell items in every one of our categories on every guest visit. Beyond our assortment, our unique storage operating model offers unmatched flexibility in how we can fulfill guest demand. Whether a guest wants to make a conventional in-store shopping trip, place a drive-up order, arrange a Shipt delivery, or simply have a box delivered to their front door, stores can fulfill every one of those needs quickly and reliably, allowing our guests to choose what works best for them in that moment.\n\nAnd as Michael will outline in more detail, our strong balance sheet and robust cash generation support continued investments during tough times like these, investments in our long-term growth and market share. At a time when many others will be struggling just to survive, the ability to play offense and focus on the long term makes us well-positioned to emerge from the current downturn even stronger than before. So, as I get ready to turn the call over to Christina, I want to thank our team for their continued passion for serving our guests and each other. While the environment remains challenging, I'm inspired by the new and unique merchandise, seasonal offerings, and partnerships our team has planned for the back half of the year.\n\nAnd as I've traveled across the country to visit our stores and distribution centers, I've been inspired to hear how our team is energized and eager to serve our guests with energy, empathy, and care, bringing some daily joy at a time when our guests are dealing with multiple headwinds. This unshakable guest focus is one of the many reasons our unique team makes Target a great company, and I am privileged and grateful to serve with them. With that, I'll turn the call over to Christina.\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nThanks, Brian, and good morning, everyone. Despite the tough environment we are facing today, I continue to be pleased with both our top-line performance and the underlying market share we're seeing across our business. Notably, across all five of our core merchandising categories. We saw unit share gains in the second quarter, providing clear evidence that our guests are finding more and more ways to satisfy their wants and needs with every Target run.\n\nAs Brian mentioned earlier, the inventory actions we announced in June involved incredible collaboration across teams at headquarters, stores, and throughout our supply chain network. And I'm proud to say that together as one team, we accomplished what we set out to do. By moving through excess units, we were able to realign our broader inventory portfolio to those categories our guests are most focused on, including frequency categories like food and beverage, everyday essentials, and beauty, as well as all things new, seasonal, and fashion-forward. To accomplish that goal.\n\nTeams analyzed and built action plans to aggressively work through excess inventory at every point along the product journey from vendor to guest. This included rigorously reforecasting expectations for the balance of the year and beyond and determining where to reduce future receipts and orders. In some cases, it meant working with vendor partners to reduce our fall receipts in light of our updated expectations. It also meant quickly building compelling promotional plans to drive unit velocity for product we already owned, all with a focus on providing great value and generating excitement for our guests.\n\nAnd throughout the execution of these action plans, our teams remained steadfast in their guest-first focus, refusing to compromise the shopping experience in our stores or online. As you heard from Brian, the short term profit implications of these decisions were meaningful. But we're confident they're the right long-term decisions for our business, for our teams, and for our guests. As we formed and revisited our plans for the third quarter and beyond, we spent a lot of time listening to the wants, needs, hopes, and concerns of our guests.\n\nWhat we're seeing in our results and hearing from our guests is that they still have spending power, but they're increasingly feeling the impact of inflation. And while the recent reduction in prices at the gas pump has been encouraging, guests' confidence in their personal finances continues to wane. Against that backdrop, we've seen our guests shop our owned brands in bigger ways and more frequently, knowing they're choosing great quality products with incredible value. We've also seen guest behavior evolve as they focus on optimizing their personal budgets through a heightened response to promotions, as well as greater trip consolidation.\n\nAt the same time, guests continue to experience difficult news headlines, COVID surges, and continued political volatility, leading them to seek more ways to celebrate, connect, and find opportunities to bring joy to their families. This is one of the reasons we continue to see such strength in our seasonal categories, which we expect will continue in the back half of the year. Now, let me turn to some of the category highlights from the second quarter in which overall comparable sales grew 2.6% on top of 8.9% a year ago, reflecting continued strength in food and beverage, beauty, and household essentials. Food and beverage led the way in the quarter, with growth in the low double digits, reflecting broad strength across multiple subcategories.\n\nBeauty grew in the high single digits, reflecting notable strength in Ulta Beauty at Target, along with the skincare and bath categories. Essentials grew in the mid single digits with performance led by pets and healthcare. Overall across our discretionary categories, sales were softer than a year ago but remain nearly $3.5 billion or more than 35% higher than the second quarter of 2019. In hardlines, overall comp sales were down slightly to last year.\n\nWithin hardline, softness in electronics was partially offset by strength in entertainment, which grew in the high single digits, along with high-single-digit comp growth in toys, an encouraging sign as we plan for the fourth quarter holiday season. Overall, the home category saw a low-single-digit decline compared to last year, despite affinity for our seasonal assortments and encouraging early results in back-to-school and back-to-college. Apparel also saw a low-single-digit decline in the second quarter, but saw meaningful growth in women's fashion forward categories along with performance apparel on top of strong sales growth in the category over the past two years. As I mentioned earlier, while overall sales growth is one key indicator of the health of our business, market share is an equally important measure that we use to understand how we're performing.\n\nAnd notably, during inflationary times like these, we heavily focus on unit share specifically to better understand our relevance as compared to our competitive set, given that growth in both traffic and units is a strong proxy for the guests' overall engagement with Target. Time and time again, these metrics have proven to be a better barometer for lasting success as compared to growth solely through average retail prices. That's why I'm so encouraged that across all five of our core merchandising categories, we grew unit share in the second quarter. So, now let's turn our sights to all that is to come for the balance of the fiscal year.\n\nHaving celebrated holidays in a big way in the second quarter, guests already have their sights set on upcoming holidays and seasonal moments in Q3 and beyond. Preparing for the upcoming school year is top of mind for families right now. And to help with the transition, we're providing budget-friendly options for students, parents, and teachers alike. Beyond our assortment of value-priced home brands and leading national brands, we're offering a one-time 20% off Target Circle deal for college students to get those dorm rooms prepped and ready.\n\nAnd we've also extended our teacher prep event to nearly eight weeks of discounts on supplies and more. And today, while we still have several weeks of the season left to go, we've been encouraged by early results in both our back-to-school and back-to-college programs. Shortly after school begins, we'll turn our attention to celebrating Latino Heritage Month, which begins in the middle of September. We're excited to help celebrate this important cultural moment with our guests through the presentation of a compelling assortment, 99% of which was created by members of the Hispanic Latino community.\n\nThen before we know it, Halloween celebrations will be underway with all the tricks and treats the season has to offer. Our guest research indicates that more families plan to participate in Halloween festivities compared with last year, and we're ready with a wide array of gender- and size-inclusive costumes, new owned brand trick or treating candy and accessories, haunted house cookie building sets, and so much more. And for those that want to celebrate the broader fall and harvest season in general, rest assured that there will be no shortage of new offerings from Good & Gather to create perfect meal snacking and entertaining solutions, including delicious new flavors of the season like maple, cinnamon, apple, and, of course, all things pumpkin spice. Outside of specific holidays, we are focused on helping our guests experience everyday joy.\n\nAnd our ability to cut across brands and categories is part of what makes us uniquely Target. For an example, look no further than our upcoming collaboration this fall with Marvel to bring a unique assortment to our guests across \"The Avengers\" and \"Spider-Man\" franchises. One stand out will be lots of Marvel Studios' \"Black Panther: Wakanda Forever\", and \"Black Panther\" legacy exclusives within toys, apparel, home, and more. We'll have more details to share in the coming months.\n\nAnd in an exciting collaboration with longtime partner, The LEGO Group, we are bringing their popular LEGO Ideas contest to Target in which LEGO super fans submit ideas for a themed LEGO building set. After a public submission phase, a handful of finalists will be selected for guests and fans to choose their favorite idea to be produced as an exclusive set at Target and LEGO brand retail stores. But Target joy goes well beyond key holidays or exclusive launches. It's about how we continue to iterate and improve upon what our guests already know and love from their regular Target run.\n\nThis next quarter, you'll see us elevate our fashion assortment with several new collections and updated brands. We'll introduce new, well-known national brands in cookware and kitchen, while also continue to expand our leading national brand partnerships, including opening more Disney stores and, of course, Ulta Beauty at Target. In fact, we're only a year into this new partnership, and there's plenty of room to grow ahead. With the introduction of new designer fragrance brands, including Coach, Clinique, Kate Spade, and more, as well as additional skin and hair care products, we continue to evolve the assortment to bring more joy to our beauty guests.\n\nWe remain on track to open at least 250 of these unique spaces this year. Plus, we've already seen more than 1.5 million guests link their Target Circle and Ultimate Rewards accounts, a number that's sure to continue to grow in the months and years ahead. So, now, before I pass things over to John, I'd like to take a moment and echo Brian's gratitude for the team. While we have demonstrated time and time again that our durable, flexible model can quickly pivot with changing consumer demands and a host of retail and economic conditions, none of that can happen without an incredible team.\n\nTheir talent, dedication, passion, and expertise allows us to continue putting the Target guests at the center of every decision we make. As a result, we continue to benefit from deeper guest loyalty and preference for our brand. I have been at Target 19 years, and I continue to be inspired every day by the talent around me. Thank you for your commitment and care to all our stakeholders.\n\nWith that, I'll pass things over to John.\n\nJohn Mulligan -- Executive Vice President, Chief Operating Officer\n\nThanks, Christina. In past calls, I described how our operations team is always focused on two things at the same time. Of course, they're always focused on short-term execution and problem solving to ensure we provide a convenient, consistent, and inspiring experience for our guests. In addition, our team works every day to deliver on our long-term vision and aspirations, ensuring our operations are ready to support our future plans.\n\nWhile this dual focus on both near-term and long-term priorities has always been present, it's been especially notable this year, given that we've been operating in a very unique environment. In terms of the short term, and as Brian and Christina mentioned earlier, our work to quickly rightsize inventory required determination, commitment, and coordination between multiple teams across the company. And given the need to protect the guest experience, there was no higher priority than delivering against this near-term plan. At the same time, our team remains passionately focused on the long-term investments we're making in our future.\n\nThese investments include our work to modernize and expand our store footprint, increase upstream capacity in our supply chain, automate distribution center processes to reduce store workload, and enhance our last-mile fulfillment capabilities by opening sortation centers and integrating them into our Shipt network. And fortunately, as Brian highlighted, the strength of our business allows us to continue funding these long-term investments, even in the face of the challenging external backdrop we're facing today. I want to first turn to our work on inventory. And I'm happy to report that our team has made remarkable progress over the last few months, causing conditions in our supply chain to improve significantly.\n\nMore specifically and to provide some helpful context, over time, we want to keep our DC network operating at or below 85% of its maximum capacity, given that operational difficulties and costs rise significantly when we move beyond that level. So, it's important to note that back in June, inventory in our DC network peaked at well over 90% of our capacity. Also notable, by the end of the second quarter, less than two months later, our team had quickly reduced DC capacity utilization to below 80%. Put another way, by the end of the second quarter, the physical space occupied by our distribution center inventory was more than 20% lower than the peak we reached in June.\n\nSo, today, while we still have some individual sites where we need to make more progress, the team has accomplished a remarkable improvement in a very short time, which will allow our end-to-end operations to function more efficiently and effectively in the back half of the year. As Christina mentioned, beyond addressing the inventory we already owned, the team also took a hard look at sales trends and determined ideal inventory levels across every category for the remainder of the year. As a result, we've meaningfully reduced our fall season receipt commitments in many discretionary categories. With these reductions, we're projecting our DCs will remain at or below 85% capacity through the remainder of the year, even after the seasonal increase in holiday inventory is set to occur over the next two months.\n\nIn other words, for the first time I'm aware of, our fall season inventory is projected to peak at a lower level than in spring, providing another vivid illustration of the unique dynamics we've encountered so far this year. While this inventory rightsizing process hasn't been easy and our teams have devoted an amazing amount of effort in a small amount of time, this work has allowed our teams to strengthen ongoing communication mechanisms and build new processes. Going forward, these improvements will enable our merchandising and supply chain teams to maintain enhanced real-time communication, particularly with respect to categories where we face the highest inventory risk, allowing us to respond to changes with more speed and agility. While pressure from excess inventory has presented the biggest challenge to our team this year, dealing with high costs and volatility in the external supply chain has run a close second.\n\nAnd today, while conditions remain far from what we would have considered normal in the years before the pandemic, there are early signs that both costs and volatility may have peaked. More specifically, lead times in global shipping have begun to decline. Spot rates to move shipping containers have fallen somewhat. And in light of the reduction in petroleum prices we've all seen recently, fuel surcharges have been easing somewhat compared with the peak rates we saw earlier in the second quarter.\n\nThat said, conditions remain highly unfavorable when compared to the years before the pandemic. And we're mindful of the continued risks in the months ahead, including potential slowdowns at the West Coast ports, a reversal of the recent decline in energy costs, and the possibility of additional COVID lockdowns in China. In addition, we continue to encounter far too many delays affecting overseas shipping, which require us to pay spot rates to move containers, rates that are well above our pre-negotiated shipping rates. As such, we're maintaining our practice of moving receipt dates earlier than we would have in the past, which allows us to mitigate the business risk from receiving shipments later than expected.\n\nYou'll recall that at this time a year ago, when the external supply chain began slowing down and shipments were arriving late, we began relying on airfreight much more than usual to ensure we received key seasonal merchandise on time for the holiday season. Well, that was the right decision at the time, given the circumstances we were facing. This year, we expect to meaningfully reduce our reliance on airfreight by moving to early receipt dates for seasonal inventory. To accommodate these early receipts without adding further color to our supply chain and stores, we secured temporary capacity to store and stage shipping containers near the ports where we receive them.\n\nWhen needed, this allows us to quickly clear the containers from the port area and hold them until the ideal time to begin moving inventory into our supply chain network. Well, we don't expect to need this additional capacity over the long term, we believe it's clearly the most efficient approach in today's environment, given the volatility we continue to face. I also want to highlight the critical role that our stores have played in our work to improve conditions in our supply chain. During the second quarter, our store teams engaged in a host of activities to support the effort, including the execution of countless promotions and markdown programs to move the excess merchandise quickly and the development of innovative presentation strategies to highlight the deals we were offering our guests.\n\nThis included repurposing the seasonal presentation space in our stores to highlight deals and create meaningful statements, including key item promotions. It also included the early wind down of our outdoor living assortment, which allowed us to bring in our back-to-school set earlier than usual, ensuring we were back in stock and reliable on key items parents needed to fill their back-to-school shopping lists. More specifically, at the end of the second quarter, about three quarters of our back-to-school and back-to-college receipts were already downstream in our stores, a number that was closer to 50% at the end of Q2 a year ago. So, now, before I turn the call over to Michael, I want to turn my focus to our longer-term priorities and the multiple ways we're investing in our future growth.\n\nAs you know, the majority of our capex is going into our store network, both to extend our footprint and invest in existing locations. These store investments fall into three major buckets. The first and largest investment is in our store remodel program, where we completely transform the space in the existing location, modernizing the shopping experience while enhancing the productivity of our team. At this point in the year, well over 100 remodels are currently in flight across the country, keeping us on track to complete nearly 200 remodels this year.\n\nIn addition to these complete transformations, we're also making smaller investments in hundreds of other locations. This includes the hundreds of fulfillment remodels we'll accomplish this year in which we reconfigure portions of the store to enhance the efficiency, safety, and capacity of our drive-up, in-store pickup, and Shipt from store services. In addition, this year we're investing in several hundred locations to add an Ulta Beauty at Target, a co-branded Apple shopping space, or a Disney store presentation to the sales floor. And finally, we're on track at add about 24 new store locations in 2022.\n\nSo far, this year, we've opened 12 new locations across the country in neighborhoods as diverse as SoHo in New York and Jackson Hole in Wyoming. Beyond this work in stores, we're also making significant investments in our supply chain focused on three main priorities. The first is to build additional upstream capacity to our network, given that we continue to grow sales on top of the $27 billion we added in 2020 and 2021. In support of this goal, we opened two upstream DCs near the end of 2021 and plan to open six new upstream facilities over the next several years, including two on track to open in 2023.\n\nIn addition to the space we're adding to the network, we're continuing to modernize how our existing distribution centers serve our stores by developing and automating processes that reduce the amount of store workload in order to receiving inventory and restocking store sales floors. And finally, we're rapidly expanding the number of sortation centers operating around the country. We have six of these facilities operating today, including three that have opened in the last few months. And we have plans to add five more by early next year.\n\nThese small facilities expand Shipt and storage capacity in the locations they serve, while significantly reducing last-mile delivery costs, particularly as we integrate our Shipt drivers into the process. Given the package delivery density we've achieved across many markets over the last few years, we see continued opportunities to add more sortation centers over the next few years, which add speed and significantly reduced last-mile costs in markets where they operate. As I mentioned last quarter, this year's capital projects are being impacted by the cost increases, material shortages, and supply chain pressures that are affecting other parts of our business. And I'm really proud of how our construction team is managing through these headwinds.\n\nMore specifically, while cost increases are raising the cost of many of these projects, the team has done an excellent job in keeping the vast majority of projects on track and on time, despite the significant headwinds they are facing. So, as I conclude my remarks, I have to pause and add my thanks to the entire team for their resilience and perseverance during a period of incredibly rapid change, which caused this quarter to be as challenging as any I've seen in my career. In the face of that challenge, what's been amazing is how our team members have stayed positive, how they've worked to find collaborative solutions across multiple teams and never strayed from their commitment to our guests and our company purpose. With the progress they've made, our operations are now in much better shape.\n\nAnd the team is energized and ready to play offense in the back half of the year. While we are all mindful of the near-term volatility in the environment, it's times like these that often present the biggest opportunity to gain long-term market share, as others face the distraction of trying to stay afloat while we continue to invest and improve our operations. That's one of many reasons that I've never been more optimistic about our prospects in the years ahead. With that, I'll turn the call over to Michael.\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nThanks, John. As John mentioned, we often ask our team to be mindful of both short-term and long-term considerations when making decisions. And given the unique circumstances we've been facing, this quarter, we faced a decision with meaningful implications for both. As Brian outlined earlier, if we had decided not to deal with our excess inventory head on, we could have avoided some short-term pain on the profit line, but that would have hampered our longer-term potential.\n\nInstead, because of the path we took, our quarterly profit took a meaningful step-down. But our future path is brighter. Our operations are healthy, our store in DC teams have more flexibility to maneuver, and we're ready to feature both the fresh assortment and uncluttered shopping experience our guests expect and deserve. That passionate commitment to the guest experience is one of the many reasons we've now seen 21 consecutive quarters of comparable sales growth.\n\nWhile normally our income statement gets the most attention, I want to start my remarks today with the balance sheet and specifically our inventory position. And as I dig into the detail, I want to acknowledge upfront that this kind of analysis is a relatively complex exercise because of the growth and volatility we've experienced over the last couple of years, because of the broad and diverse assortment that we sell, and the fact that our business is seasonal from quarter to quarter. More specifically, given that our inventory position throughout the pandemic was far from optimal, focusing on year-over-year growth numbers isn't very helpful right now. As a result, we often base our inventory analysis on growth trends compared with 2019, a pre-pandemic year when our inventory and sales trends were much more in sync.\n\nWith that as context, I want to zero in on one of the questions I'm sure you have, which is why our inventory on the balance sheet remained roughly constant at around $15 billion between the first and second quarters. The simple answer is that while that single number didn't change much, we accomplished exactly what we intended to do during the quarter, which helped changed conditions significantly below the surface. More specifically, because of the inventory actions we executed, unit growth compared with 2019 in our discretionary categories decelerated by more than 15 percentage points between the first and second quarter, a change we estimate would have reduced our inventory position by more than $1 billion if taken in isolation. However, a couple of offsetting changes moved our quarter-end inventory in the other direction.\n\nFirst among them, we leaned into our frequency categories during the quarter, accelerating three year unit growth versus Q1 at a double-digit rate, resulting in stronger in-stock metrics compared with 90 days ago. Another factor that drove inventory dollars higher is the continued increase in unit costs we've been seeing across all of our categories, which caused the dollar value of our inventory to grow faster than unit growth in the second quarter. So, where do we stand today? At the end of the second quarter, inventory on the balance sheet was about $6 billion higher than we reported three years ago. Of that dollar growth, about $3 billion or approximately half of that total growth is the result of higher unit costs across our assortment.\n\nOf the remaining $3 billion, our analysis indicates another $1 billion to $2 billion is related to our decision to move receipt timing earlier, given the volatility we continue to expect in the supply chain. And also importantly, beyond reshaping the inventory we already have, our Q2 inventory actions also included the removal of more than $1.5 billion of fall receipts in our discretionary categories, reflecting our continued focus on reducing risk in the current environment. That's why we feel good about our inventory position as we head into the back half of the year. So, now I'll turn to a review of our second quarter financial results.\n\nTotal sales increased 3.3% in the quarter, driven by a 2.6% increase in comparable sales combined with the impact of new stores. Total revenue increased 3.5%, reflecting sales growth along with the benefit of nearly 15% growth on the other revenue line, driven by continued strength in our Roundel ad business. Just as Christina pointed out that unit share is a key measure of Target's relevance versus competitors, traffic growth is another important indicator of the relevance of our brand. Our continued traffic growth in the second quarter clearly demonstrates the ability of our balanced multi-category assortment to deliver continued relevance in a rapidly changing environment like we're seeing today.\n\nSo, that even as our guests preference for individual categories has been changing dramatically so far this year, that hasn't affected their preference for Target. As a result, traffic accounted for 100% of our comparable sales growth in the second quarter, increasing 2.7% on top of 12.7% a year ago. Average ticket remained essentially flat in the quarter as low-single-digit increase in average retail was offset by a similar reduction in the number of items per transaction. Across our sales channels, store comps grew 1.3% on top of 8.7%, a year ago while digital comps grew 9% on top of 9.9% last year.\n\nDigital growth continues to be led by our same-day services, which saw double-digit growth overall and mid-teens growth in drive-up. On the gross margin line, we saw a nearly nine percentage point decline compared with last year. Merchandising accounted for more than seven points of this pressure, driven primarily by our inventory reduction efforts along with the impact of higher fuel and transportation costs, product cost increases, and higher shrink, partially offset by the benefit of retail price increases. In addition, digital fulfillment and supply chain drove about 1.5 points of pressure, reflecting increased compensation and headcount in our distribution centers combined with the cost of managing excess inventory and higher last mile shipping costs.\n\nConsistent with the first quarter, mix accounted for approximately 10 basis points of pressure. The softness in higher-margin categories like apparel and home was largely offset by softness in lower-margin discretionary categories, most notably electronics. On the SG&A line, we continue to benefit from fixed cost leverage and efficiency gains across our operations, which helped to offset the impact of cost inflation across multiple expense lines. Within overall compensation, lower incentive compensation more than offset continued investments in pay and benefits for our hourly team members.\n\nAltogether, our second quarter operating margin rate was 1.2%, down from an unusually high 9.8% a year ago, driven entirely by the decline in our gross margin rate. This operating margin performance was below the midpoint of our most recent guidance as the cost of our inventory actions was somewhat higher than expected. While an operating margin rate of just over 1% is well below anything I've seen in my career and something I never expect to see again, I have no doubt that it was the right outcome given the unusual circumstances we've been facing this year. Our focus throughout the second quarter was to ensure that we took care of the excess inventory of our network and adjust future receipts to reflect the rapid change in sales trends we've seen so far this year.\n\nWe accomplished this goal to the benefit of our operations, our team, and our guests. Finally, one note on our tax rate. In a period like this year when our operating profit is unusually low, tax benefits have a larger-than-normal impact on our tax rate, which helps to explain why our year-to-date tax rate has been lower than expected. Looking forward, given that we anticipate a meaningful improvement in our operating performance in the back half of the year, we continue to expect our full year effective tax rate will be in a range around 21%.\n\nNow, I'm going to turn to capital deployment and begin where I always do by articulating our priorities which we've supported consistently for decades. Our first priority is always to invest fully in our business in projects that support our strategic and financial criteria. Once we've met this first priority, we support our dividend and look to extend our 50-year record of annual increases. And finally, once we've supported the first two priorities, we return any remaining excess cash by repurchasing our shares over time within the limits of our middle A credit ratings.\n\nRegarding the first priority, second quarter capex was approximately $1.5 billion, bringing our year-to-date total to just over $2.5 billion. As you'll recall at the beginning of the year, we guided to an expected full year capex range of $4 billion to $5 billion. And at the time, I indicated my hope that we'd reach the high end of that range with the outcome depending on how many capital projects could stay on schedule. So, I'm happy that, as John mentioned, the team is doing a great job of keeping projects on track despite facing multiple headwinds, all while inflation in the cost of equipment materials and labor is driving project spending above initial projections.\n\nAs such, we now expect our full year capex will be $5 billion or more for the year, reflecting both the number of projects that remain on track and the expected impact of cost inflation. Of course, while we prefer not to face the cost pressure on these projects, I'm encouraged that so many value-creating projects remain on track to be completed this year, projects that will benefit our operations and our P&L for years to come. Turning to our second capital deployment priority, we returned $417 million in dividends to our shareholders in the second quarter, up from $336 million a year ago, driven by a 32% increase in the per share dividend, partially offset by a decline in average share count. And finally, in June, we reached the final settlement for the accelerated share repurchase agreement we initiated last March.\n\nUnder this ASR, we invested $2.6 billion to retire 12.5 million shares of our stock. Looking forward, just as our inventory commitments reflect continued caution for the remainder of the year, we're taking a similar cautious stance in terms of our share repurchase activity. And of course, any repurchase activity will be consistent with our long-term goal to maintain our middle A credit ratings. So, now, I want to close my commentary on the quarter by covering our after-tax return on invested capital, which measures both our near-term profitability and the efficiency of our capex decisions over time.\n\nIn the second quarter, our trailing 12-month after-tax ROIC was 18.4% compared with 31.7% a year ago. And it's notable, while the current number is well below where we expect to operate over time, an after-tax number in the high teens would have been considered aspirational for our business only a few years ago. So, for us, to temporarily move down to this level in an environment as challenging as we're facing is a vivid confirmation of the underlying strength and resilience of our business model and the reason we continue to be incredibly optimistic about our future prospects. And that confidence starts and ends with our team.\n\nSo, I want to pause and express my gratitude to the best team in retail. Without your efforts, we couldn't have achieved the remarkable growth in traffic and sales that we've seen over the last few years and why even in a tough year our business remained strong. Now, let's turn to our guidance. And based on the hard work of our team in the second quarter, we feel really good about how we're positioned going into the back half of the year.\n\nAt the same time, given that we've been experiencing volatile economic conditions so far this year and that volatility appears likely to continue in the months ahead, we're maintaining a cautious stance as we plan our business given the potential macro and consumer risks that might emerge. That's why, as you've heard throughout our remarks today, our second quarter inventory actions were specifically designed to reduce our level of risk in discretionary categories. And in terms of our operations, the team has focused on building flexibility into our plans, placing a premium on staying nimble and adjusting quickly in the face of any potential change in macro trends. Regarding the top line, our expectations have remained consistent so far this year with guidance for full year total revenue growth in the low- to mid-single-digit range.\n\nWith the front half of the year behind us, both our Q1 and Q2 results have put us squarely in the middle of that range. And today, based on our current performance and plans for the back half of the year, we remain positioned to deliver full year revenue growth in the low- to mid-single-digit range. On the operating margin line, our most recent guidance anticipated a fall season operating margin rate and a range centered around 6%. This expectation is nearly double our spring result.\n\nAnd notably, if we hit that rate in the fall, it would exceed the fall season rates we were delivering prior to the pandemic. And today, similar to my commentary on the top line, based on the success of our Q2 inventory actions and our current performance, we remain positioned to deliver an operating margin rate in a range around 6% in the fall season. Between the last two quarters of the year, we expect our third quarter rate will be well below our Q3 performance over the last couple of years, while our fourth quarter rate should be much more in line with our recent Q4 experience. Most notably, in the third quarter, we'll continue to experience some spillover impact from our inventory actions in the range of $200 million.\n\nIn contrast, in Q4, we'll be annualizing meaningful cost headwinds that surfaced a year ago, which will make the year-over-year comparison more favorable, despite the current headwinds we're facing. All that said, while we typically anticipate something closer to a balance of upside and downside potential when we make any forecast, the macro and consumer risks in the back half of this year feel skewed to the downside. That's why, even in the face of consistent business trends in recent months, we've undertaken the significant cost and effort to remove risk from our inventory commitments. It's why we're stubbornly focused on real-time monitoring and communication of evolving conditions and why we've asked our team to build flexibility and agility into their plans.\n\nWith that mindset if trends move away from what we're seeing today, we're ready to quickly adjust. So, now, before, I turn the call back over to Brian, I want to emphasize why we're so confident in our long-term potential. Even as we navigate a very challenging environment in a year of multiple challenges, including rapidly changing consumer preferences inflation at four-year highs, volatile supply chain conditions, and rising fuel and transportation rates that are expected to add well over $1 billion of cost this year, our business continues to generate historically strong traffic increases, low to mid-single digit revenue growth, and unit share gains across all of our core merchandising categories. And even in the face of unprecedented profit rate pressure driven by the host of factors I just listed, we remain profitable with an after-tax ROIC in the mid-teens.\n\nIn fact, if our performance in the fall is consistent with the revenue growth and operating margin rates I outlined earlier, we remain positioned in 2022 to generate higher operating margin dollars than we did in 2019. That's what we mean when we say we have built a durable model. And today, while we expect conditions to remain challenging in the near term, the operating margin rate improvement we're projecting in the back half of the year should serve as an early indicator of the continued rate improvement we should deliver in the years ahead. With the potential for additional rate expansion and continued growth in traffic and revenue in the years ahead, we're facing a compelling financial picture as the economy and consumer eventually recover.\n\nThat's why I've never been more confident in our long-term prospects than I am today. With that, I'll turn the call back over to Brian.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nThanks, Michael. I often tell my team that leadership and performance are tightly linked over time, but that leadership often appears first. That's why I'm extremely proud of the leadership our team showed in the second quarter. After they took a hard look at our own inventory position and the amount that was building up across our industry, they opted to make the hard choice, get in front of the problem, and address it head on.\n\nThey made that decision with the full knowledge it would have a profound impact on our near-term profitability. They also knew there was another path. We could have avoided attacking the problem and avoid some of the pain in the short run. But instead, our team chose to lead.\n\nThey knew the best path for our guests and for our teams in our stores and distribution centers was to take action and improve the condition of our inventory and operations quickly. That path would allow the entire Target team to move ahead without facing the ongoing burden of excess inventory holding us back. So, the team quickly developed the bolder plan, which we announced in early June, just over two months ago. And in the intervening weeks, teams across the company worked tirelessly to take the plan and make it a reality.\n\nThat's the reason we're positioned to deliver a strong improvement in our profitability this fall despite an environment that's far from ideal. Because of our team's leadership, our business today is much better positioned to perform, and I couldn't be more proud and grateful for the courage they have shown. So, with that, I want to thank you for listening into our call today. And now, Christina, John, Michael, and I will be happy to take your questions.\n\nOperator\n\n[Operator instructions] We're now ready with our first question from Christopher Horvers with J.P. Morgan. You may go ahead. And, Mr.\n\nHorvers, your line is open. You might be muted.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nThanks. Good morning, and thank you for all the detail. You talked about an encouraging start to back-to-school. Can you talk about what you've seen in July and August? A lot of retailers like you have talked, you know, about improving trends.\n\nSo, what does that mean for how you're thinking about the back half comps? And does that reflect the current trend in the business as you said in the guidance? Because I guess the question we have is, is the risk -- how did you incorporate the risk that the bounce in trend that you're seeing now is just that episodic event-type spending that you've been highlighting all year?\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nChris, thanks for joining us this morning. I'll let Christina talk about some of the back-to-school and back-to-college trends, and Michael to build on guidance. But before we start, based on the length of our prepared comments, we are going to ask for some additional time for Q&A. So, operator, we're going to extend the time for this call to make sure we cover as many questions as possible.\n\nChristina, do you want to start by talking about some of the back-to-school and back-to-college trends we're seeing?\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nYes. As I shared earlier in my prepared remarks, we're optimistic about what back-to-school and back-to-college means. This -- during seasonal times is when Target really shines. The reason being that our multi-category portfolio makes us even more relevant, the opportunity to buy kids uniform, backpacks, to lunch kit, and everything that goes in it, and of course, all the supplies.\n\nAnd so, a forward seasonal moments have always been a good proxy for the strength of the total portfolio. And so, as we're seeing, you know, good, early trends, albeit there's a lot of business left to be done, we believe that, that is a good indicator of the strength of the potential for the fall. The other thing to look at, of course, is how we have performed to date and our traffic. And the unit share growth that we've seen across the portfolio holistically, gives us confidence in the guest choice as Target as their retailer of preference.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nChris, I'll let Michael talk about guidance. But one of the things that really stands out for me, if I look at our position today is that continued strength in traffic and the growth we're seeing in units across our entire portfolio. I'd also recognize, based on the actions we've taken with our inventory position, if you walk our stores today, it is clear that we are prepared for back-to-school and back-to-college, and we're really standing tall in those categories. Mike, do you want to talk about the guidance?\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nYeah. And I'll build off the comment you just made, Brian. When we look at the quarter, Chris, a lot of the trends, we see in Q2 are in forming our view of the back half of the year. And I think Q2 is a pretty good proxy for some of those top-line assumptions that we have in the back part of the year.\n\nThe consistency of traffic for the year, across the month of the quarter, I think that's the thing that we look at really closely that gives us a lot of evidence that even as, you know, shopping habits have changed and category trends have changed, we've seen a consistent draw to more and more shoppers, shop in our stores, and shopping us online. And that consistency of traffic is the thing that gives me lot of optimism, as I look to the back half of the year, even if we can't sit here today and predict every twist and turn.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nChris, I'll add one final point. As we talk to our guests, when we talk to consumers, while there's certainly a cautionary environment in front of us. But one thing that seems to be very consistent is a guest and consumer who say they want to celebrate the holiday seasons. So, we certainly expect that they are going to be celebrating Halloween this year and actively trick or treating and hosting parties with friends and family.\n\nWe know they're looking forward to Thanksgiving, and they're going to look forward to celebrating the Christmas holidays. And that comes out each and every week as we survey consumers and talk to our guests. So, that gives us great optimism for our ability to perform during these key holiday seasons.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then -- thank you very much. And so, my follow-up is just, Michael, you talked about the phasing of the operating margin. So, the interpretation is that the fourth quarter is going to look a lot more consistent with what you did last year, maybe a little bit below.\n\nSo, the third quarter comes in, you know, well below that 6% -- around 6%?\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nYeah. If you -- as I said in my remarks, expect a -- we sit here today expecting a fourth quarter that looks more like the fourth quarter we've seen in the last couple of years. And so, I think that's a 6.8 last year and 6.5 the year before that. That's the right range around which we set our expectations for the fourth quarter.\n\nAnd obviously, to get to a 6% in total that implies a lower number in the third quarter. And the driver there is like I talked about in remarks some of the costs of our inventory actions do spill over into the third quarter. And we'll continue to manage the elevated fuel and freight costs and kind of how those net against pricing action and things like that over the balance of the year. But we feel good about that range around 6%, and we'll continue to watch the macro environment really closely.\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you very much.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nChris, thank you for joining us.\n\nOperator\n\nThank you. The next question is from Edward Yruma with Piper Sandler. You may go ahead.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nHey, guys. Good morning, and thanks for taking the questions. Two for me. I guess, first, on the variance relative to your previous expectations in terms of the inventory actions, were there specific areas where you had to cut deeper or cost to get out of inventory positions.\n\nAnd then as a broader question, you know, one of your peers talked about some changes they're seeing in their customer base. I guess are there any noteworthy changes that you're seeing? Are there customers trading down or trading into Target? Thank you.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nI'll start and then I'll turn it over to John to talk about some of the inventory actions, but I really want to start by recognizing our team. I think as we sit here today, over the last few weeks since our announcement in June, this has been a collaborative effort. And the team has accomplished so much to put us in the right place as we get ready for the back half of the year. So, based on the work that the teams have done across our supply chain system, in merchandising, in finance, in supply chain, and stores, you know, the team has accomplished more than we expected in a short period of time and put us in a better position from an inventory standpoint than we might have expected back in June.\n\nJohn Mulligan -- Executive Vice President, Chief Operating Officer\n\nYeah. Ed, I'll just add on it. I think largely we're on track with what we thought at the -- when we came out with the announcement earlier in Q2. A little bit of it cost us a little bit more in promos or clearance to move some inventory.\n\nBut I think the work the team did in a very short amount of time to size what we needed to take care of is largely in line with where we are today. And we feel really good about where we're at. As Michael said, a little bit spilled over into Q3, and that's really just timing more than anything else. We just didn't get to it.\n\nBut the work that's been done, we're really proud of it. And I would say, from my position, we did exactly what we set out to do. We got rid of the inventory we needed to. The operations are in a much better place.\n\nThere's a little bit more to do here in Q3 that will clean up. And I think the one thing I'd add on that I don't want to get lost is the amount of receipts that were cut from discretionary categories in Q3 and Q4, and that is just huge for us. Again, because of the uncertainty in those particular categories and if sales end up a little bit higher, we'll have a little bit higher sell-through, and that will be a great day. But that really derisks those categories going forward.\n\nSo, we feel great about the work that's been done over the past few months.\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nAnd Ed, maybe I can add a little bit to the question about the customer. You know, as I shared in my prepared remarks, our guests still demonstrating that they have spending power. The choices that they're making to balance their budget is what we're watching. And so, obviously, we're moderating our investment in some of those discretionary businesses.\n\nAnd we're leaning very much into food and beverage, essential, beauty, but also, select portions of the portfolio and discretionary that have stayed resilient, whether it's toys, luggage, seasonal moments, fashion-forward apparel. And so, it's really about reading the guests, listening to them, and continuing to support a level of agility in the business model. And in terms of other choices that they're making, I think traffic and unit share are the best barometer for their investment in Target. We're still a growing traffic, and we're growing unit share in every major category, which to me says that our relevance is high with the guests right now.\n\nAnd they're managing their budgets as best fit, and they're finding options at Target.\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Our next question is from Steph Wissink with Jefferies. You may go ahead.\n\nSteph Wissink -- Jefferies -- Analyst\n\nThank you. Good morning, everyone. Just wanted to ask a follow-up question on pricing for the back half. Just give us some sense of how you're thinking about promotionality.\n\nI think you've mentioned in your prepared remarks that consumers were responding to some of the promotions you were putting out. Just give us a sense of what you factored into the guidance in terms of heightened levels of promotions. Thank you.\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nThanks for the question, Steph. I mean, we always know as we get to the back half of the year. It's a promotional environment. The holidays always are, and so we factored that in accordingly.\n\nAnd we see a consumer in the current inflationary environment that's focused on value. And like we've said many times in these calls, we think about pricing first through the lens of our guests. We want to make sure the guests can find great value on shelf, online and the way that we're priced, and we feel good about where we've struck that value equation. And I think the traffic we're seeing speaks to the fact that guests see it, too.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nAnd, Steph, I'd only add that Christina and her team have done a wonderful job as we plan for the back half of the year of ensuring that we have great value for our guests but also that we have exciting newness. And I think that combination is a winning formula for us as we think about the back half of the year.\n\nSteph Wissink -- Jefferies -- Analyst\n\nOK. Thank you very much.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question is from Michael Lasser with UBS. You may go ahead.\n\nMichael Lasser -- UBS -- Analyst\n\nGood morning. Thanks a lot for taking my question. My first question is how much did the clearance of promotional activity contribute to the same-store sales growth in the first -- in the second quarter? And if you do see more downside than upside risk to the guidance for the back half of the year, why didn't you just moderate the guidance a little lower for the back half?\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nSure, Michael. Thanks for the question. While the kind of counterfactual every elasticity of where Q2 would have landed, it is a little bit more art than science. We think that the net dollar impact of our markdowns is probably negligible all in in the second quarter.\n\nAnd, you know, of course, we took some markdowns to move through some product, but we think that probably net-net, that didn't move our top-line comp a lot. As we think about the back half of the year, we're informing the back half based on the trends that we're seeing now in the business. And as we've talked about, some of those trends that we saw change at the end of Q1, we've seen persist into Q2. And we factored that into our thinking for the back half of the year.\n\nWe'll continue to be mindful of what's clearly in a certain environment for the economy and the consumer. And to the point Christina made earlier in Q&A, we'll stay close to those trends, and we'll adjust accordingly. And that's why taking the inventory actions we did to give us some room to operate and to give us some flexibility in the system will be important in an uncertain environment.\n\nMichael Lasser -- UBS -- Analyst\n\nOK. My follow-up question is there's obviously a lot of moving pieces with what's happening at Target right now. But isn't a lot of it is transitional in setting the stage for a better 2023, really somewhat independent of the macro environment? So, with that being said, could you size the impact to your margins, all the inventory actions that you're taking this quarter, next quarter that are temporarily will be isolated to this year and won't repeat next year? Can you give us a better sense of what the ongoing profitability of the business is?\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nMichael, I'll start by saying, I think, your summary really captures the actions we've been taking today, really to make sure that we continue to build on the traffic we're seeing in our stores and the visits to our site, the strength we're seeing in unit market share gains. But importantly, the investments we made to ensure we have a great guest experience in the back half of the year and going into 2023. So, the bold decisive actions were really make sure, we continue to build on our current momentum, the great relationship we have with our guests, the momentum we're building from a market share standpoint, and providing our guests with a great Target experience every time they shop. That will continue and set us up well for 2023.\n\nAs far as sizing it, we'll certainly come back to all of you, as we think about guidance for next year. But we certainly expect to see a more normalized environment from an operating profit standpoint as we move into 2023 and continue to build on the momentum and the investments we've been making in our business for years.\n\nMichael Lasser -- UBS -- Analyst\n\nThank you.\n\nOperator\n\nThank you. The next question is from Simeon Gutman with Morgan Stanley. You may go ahead. Mr.\n\nGutman, your line is open. You might be muted.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nYeah, sorry about that. Hi. Good morning, everyone. Following up on actually Michael's question, is there any way you can quantify some of the structurally higher costs in labor in the DC just as a way to, you know, back out.\n\nThat might be the one driver that stays in gross margin. But then, in theory, you should recapture most of what's happened this year.\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nYes. I mean, there's probably a piece in each bucket, Simeon. As we've grown the business, obviously, we invest more labor and moving the product to support that growth. And that's a piece system of that growth there.\n\nAnd then, it also costs us more when we're full. And our supply chain was full in the second quarter. And so, there's a piece of that that will result in improved productivity over time, as we get some of that inventory out of the system. To Brian's point, we'll come back and unpack next year when the time is right to do that.\n\nBut I expect to see both of those drivers present as we discussed.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nAnd maybe just a quick follow-up. You mentioned Q4 profitability should look more Target-esque. Does that mean -- like, what's the assumption for mix in that fourth quarter relative to where we are today?\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nYeah, we aren't breaking out a specific assumption for mix. But I think, if you look over the last couple of quarters, you see mix isn't a big driver of our margin results. And so, I wouldn't think about the market any differently as we project ahead.\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nOK. Thanks. Good luck.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nThank you.\n\nOperator\n\nThank you. Our next question is from Kelly Bania with BMO Capital. You may go ahead.\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nThanks for taking our questions. Curious if you could just help us dissect the gross margin a little bit between the promotional activity, the inventory impairment versus the cost of storing and moving this excess inventory. Because I think it would just be a little helpful for investors to interpret that comp and traffic number and just how you're thinking about that traffic and comp as the promotions moderate into Q3. And it sounds like Q4, you're planning for very little promotional activity.\n\nSo, I was just wondering if you could kind of parse some of that out to help us think about that.\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nI'll maybe start at the end of your question. We expect Q4 to be promotional. It always is. And our plans plan for promotions that will provide great value to our guests and those seasonal moments that matter.\n\nThat's been true in every Q4 in my 18 years here, and I expect it not to be any different this time around. With respect to unpacking the margin, I'll go back to some of what I said in my comments. And, you know, we were year-over-year nine percentage points down. Seven of that is, you know, mostly driven by inventory actions and you see incremental markdowns as a piece of that.\n\nYou also see the cost of some of those receipt cancellations that John talked about earlier. And then you see about 1.5 points of pressure from supply chain and digital. And a piece of that is related to us being heavier in the system and that drives some costs. A piece of that is the elevated freight and transportation rates that we've talked about previously that, you know, continue to kind of maybe move up and move down based on the day are definitely elevated versus any historical measure.\n\nAnd you can see that that is a piece of that year-over-year pressure, too.\n\nJohn Hulbert -- Vice President, Investor Relations\n\nOperator, we have time for two final questions.\n\nOperator\n\nThank you. Our next question is from Robbie Ohmes with Bank of America. You may go ahead.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nThanks for squeezing me in here. My question was on inflation in food and consumables. And can you give us any number on how much inflation you guys saw in the second quarter, but also the two half guide you guys have given us? What's the inflation tailwind you guys are expecting in food and consumables? And also, related to that, you guys talked about the focus on everyday pricing. Is there any incremental margin pressure from the, you know, frequency items or the focus on, you know, everyday pricing being sharp?\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nI mean, we've seen persistent cost inflation in food. And I think across the industry, you've seen price move with that. That's been no different here at Target. We're really mindful of making sure that we feel good about our price gaps.\n\nWe definitely do today in food. And if you zoom out from the food-specific piece of that, again, I'll come back to traffic. If you look at what drove our growth in the second quarter, there were some puts and takes within basket between ASP and units. But the story was traffic.\n\nAnd so, you know, again that gives us evidence that we're getting that value equation right for our guests.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nAnd is the inflation component, you know, within same-store sales in food and consumables, is that similar to, you know, sort of the numbers we're seeing in the CPI for food at home?\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nI think that's -- it's generally in the right ballpark. Obviously, there's some mix implications there if you're comparing retailer to retailer. But we've seen persistently high inflation in food. I think that's a trend that's been with us for a while, and we don't expect it to change anytime soon.\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nAnd, sorry, just to clarify. The pricing folks, are you -- would you say you guys are investing in price in food and consumables? So, maybe taking a lower margin in, you know, the grocery part of your business than maybe historically you would have.\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nYou know, maybe I'll add a little context here. We're consistently evaluating our complete value proposition to the consumer. And so, part of that is price. And in the consumable categories, we've had a little bit more flexibility to move with the market because it's domestically replenished and bought every single day.\n\nAnd so, we have absolutely moved up in some retail. But the way we counterbalance total value proposition is by looking at, of course, what else produces value, compelling promotion, an incredible owned brand portfolio that allows the guests to opt into whatever price point is right for them, and a maniacal focus on balancing our good, better, best and opening price point options. And that -- the combination of those things, are yielding more unit share growth at Target, which means the guest is actively engaged in the offering that we're providing and, of course, that traffic that Michael pointed to.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nAnd Robbie as Christine have noted, the strength of our own brand portfolio in this environment is a really important element of how we deliver value to our guests each and every day. And in food and beverage, our Good & Gather brand now is a $2 billion brand that continues to see very strong growth. So, that's just one way we deliver value to our guests each and every day at Target. So, operator, we've got time for one last question today.\n\nOperator\n\nThank you. Our final question is from Oliver Chen with Cowen. You may go ahead.\n\nOliver Chen -- Cowen and Company -- Analyst\n\nHi, thank you very much. On the topic of back-to-school, what would you speak to as factors that are most different this year versus last year as you get ready for that? And secondly on the inventory actions, as they relate to third quarter, what's left to do there? And might you have to take deeper promotions than you thought previously? The consumer is requiring a lot of discounts to respond to promotions more than other retailers thought in many cases. Would love any thoughts there. Thank you.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nOliver, I'll start, and I'll let Michael finish up. But I think the one big difference today as we sit here today and think about back-to-school and back-to-college is certainty. I think we know, across the country, children are going back to school. They'll be in classrooms.\n\nThey're going to be back on campus. So, I think that element of certainty is very different from what we've faced over the last couple of years. And again, we expect to see a very solid back-to-school and back-to-college season because we know children are going to be in classrooms and will be back in campus. And Target's a place they go during this important back-to-school and back-to-college season.\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nAnd then, Oliver, kind of what's in some of the Q4 actions we still have to take just to provide kind of an example there, if there's seasonal product, it's a natural time to leave our store within Q3. And we'll continue to work through some of that inventory then. And so, that's an example of, you know, some of the work still to be done. But kind of in where we started, we feel really good about our inventory position as we exit the second quarter.\n\nAnd we accomplished what we set out to do from an inventory perspective.\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nSo, operator that concludes our second quarter call. We look forward to talking to many of you over the next few weeks and seeing you later this year. So, thank you.\n\nDuration: 0 minutes\n\nJohn Hulbert -- Vice President, Investor Relations\n\nBrian Cornell -- Chairman and Chief Executive Officer\n\nChristina Hennington -- Executive Vice President, Chief Growth Officer\n\nJohn Mulligan -- Executive Vice President, Chief Operating Officer\n\nMichael Fiddelke -- Executive Vice President, Chief Financial Officer\n\nChris Horvers -- JPMorgan Chase and Company -- Analyst\n\nEdward Yruma -- Piper Sandler -- Analyst\n\nSteph Wissink -- Jefferies -- Analyst\n\nMichael Lasser -- UBS -- Analyst\n\nSimeon Gutman -- Morgan Stanley -- Analyst\n\nKelly Bania -- BMO Capital Markets -- Analyst\n\nRobbie Ohmes -- Bank of America Merrill Lynch -- Analyst\n\nOliver Chen -- Cowen and Company -- Analyst\n\nMore TGT analysis\n\nAll earnings call transcripts"
}