{
  "companyName": "DoubleVerify Holdings, Inc.",
  "companyTicker": "DV",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/doubleverify-holdings-inc-dv-q3-2022-earnings-call/",
  "content": "DoubleVerify Holdings, Inc. (DV 0.18%)\nQ3 2022 Earnings Call\nNov 08, 2022, 4:30 p.m. ET\n\nOperator\n\nGreetings, and welcome to the DoubleVerify third quarter 2022 financial results conference call. At this time, all participants are on a listen-only mode. A brief question-and-answer session will follow the formal presentation. [Operator instructions] As a reminder, this conference is being recorded.\n\nIt is now my pleasure to introduce your host, Tejal Engman, investor relations. Thank you. You may begin.\n\nTejal Engman -- Senior Vice President, Investor Relations\n\nGood afternoon, and welcome to DoubleVerify's third quarter 2022 earnings conference call. With us today are Mark Zagorski, CEO; and Nicola Allais, CFO. Today's press release and this call may contain forward-looking statements that are subject to inherent risks, uncertainties, and changes and reflect our current expectations and information available to us, and our actual results could differ materially. For more information, please refer to the risk factors in our recent SEC filings, including our Form 10-Q and our annual report on Form 10-K.\n\nIn addition, our discussion will include references to certain supplemental non-GAAP financial measures and should be considered in addition to and not as a substitute for our GAAP results. Reconciliations to the most comparable GAAP measures are available in today's earnings press release, which is available on our Investor Relations website at ir.doubleverify.com. Also, during the call today, we'll be referring to the slide deck posted on our website. With that, I'll turn it over to Mark.\n\nMark Zagorski -- Chief Executive Officer\n\nThanks, Tejal, and thanks, everyone, for joining us this evening. We delivered another record quarter with revenue growth of 35%, above the top end of the raised guidance we provided in August, as a testament to the strength and resiliency of our business. Once again, all three of our revenue lines delivered double-digit growth. We created greater value for our existing clients by upselling products and growing product usage across platforms and geographies, and also one large roster of new clients who have steadily ramped up usage of DV solutions over the last 12 months.\n\nWe are raising our full-year guidance to reflect 36% revenue growth and 31% adjusted EBITDA margins at the midpoint. In a year that has become increasingly challenging for global advertisers, DV continues to deliver strong growth plus substantial profitability, a rare combination in today's tumultuous public markets. The drivers that have helped us grow in the third quarter, and throughout 2022, are also catalyst for future momentum. I will discuss these within the context of DoubleVerify's three key differentiators, our rapidly growing scale, our focus on market-defining innovation, and the deep level of trust we have built with our customers as an unbiased and independent partner.\n\nBeginning with scale, we are laser-focused on winning new clients and gaining market share. We won a greater number of new deals in the third quarter than we did in the entire first half of this year despite increasing macroeconomic headwinds. Our unique value proposition versus our competitive set has resulted in an 80% plus win rate across all opportunities over the 12 months ending September 30. In the third quarter, we won Mattel, Gap, and several other large and high-profile advertisers away from our competitors.\n\nIn addition, we successfully broke through a number of greenfield accounts, including TUI, Marina Bay Sands, and Smart Energy U.K. In fact, 71% of our third quarter wins were greenfield, representing the highest share of greenfield wins in any quarter this year. our vast TAM remains largely untapped with a significant number of global greenfield opportunities for us to win and expand our business with over the long term. So, why does DV win? First, the efficacy of our technology enables our solutions to perform better in head-to-head testing with our competitors.\n\nWe won 100% of the RFPs that require a test of DV's solutions and that were decided on in the third quarter. And a recent test of authentic brand suitability versus a competitor's alternative, ABS' superior performance resulted in a lower post-bid block rates and an average CPM that was 9% more efficient, potentially saving that client millions of dollars in future ad spend. We also win because our expansive platform helps our clients solve measurement problems holistically, consolidating fragmented solutions and providing clients with a simplified path to verification and optimization across all media buying channels. Point solutions just can't deliver a standardized single measurement currency across every media environment, channel, market format, and device in the way that a comprehensive platform like DV can.\n\nAnd finally, we win because we inspire customer confidence. DV has the most comprehensive accreditation coverage across measurement and activation, making us a trusted, independent, and unbiased partner that brands know they can rely on. Turning to channel expansion opportunities. We are focused on driving scale across three fast-growing media environments, CTV, social media, and retail media networks.\n\nBeginning with CTV, ad spend on CTV is expected to double from $14 billion in 2021 to another $28 billion in 2025, according to eMarketer and Statista. As the CTV ecosystem increasingly becomes advertising-dependent, there are a growing number of opportunities for DV to capitalize on. Recently, we announced the upcoming launch of our verification solutions across the ad-supported tier of Netflix, one of the most popular streaming services in the world. DV's fraud protection and viewability verification solutions are expected to be available across all countries where Netflix provides coverage, including the United States, Canada, Brazil, Mexico, Germany, U.K., France, Italy, Spain, South Korea, Japan, and Australia.\n\nWe are looking forward to working on our technical integration with Netflix over the coming months and expect to announce additional exciting CTV-related partnerships in the quarters ahead. DV's customer value proposition is particularly compelling to CTV advertisers because ad fraud typically targets premium inventory where demand outstrip supply. This year alone, we've identified 17 different fraud variants and schemes targeting CTV media investments and saved our clients tens of millions of dollars in waste ad spend. There remains a lack of data, transparency, and industry standards when it comes to CTV, resulting in a growing imperative for third-party verification.\n\nOur CTV measurement volumes have continued to grow rapidly this year delivering 53% year-over-year growth through September 30. And with the rising levels of CTV inventory expected to hit the market over the coming quarters, DV is well-positioned to continue to take advantage of this trend. Moving on to Social. We are thrilled to continue to expand our partnership with TikTok.\n\nThrough the implementation of our brand safety and suitability measurement tools, which complement our brand safety controls currently on TikTok, global brands will have an end-to-end in-feed solution that provides greater clarity and confidence in their investment. Our solution is based on DV's proprietary brand safety and suitability capabilities that align the standards from the 4A's Advertiser Protection Bureau and the Global Alliance for Responsible Media or GARM. As a result, DV advertisers will be able to consistently measure their media investment across all platforms DV measures in order to effectively inform future media planning and buying decisions. In addition, we are pleased to have completed the development of brand safety and suitability measurement on Twitter's News Feed, known as timeline, and are launching the beta in the coming weeks.\n\nWe are also continuing to expand our relationship with LinkedIn to support suitability and contextual alignment for advertisers. Shifting to our continued growth on retail media networks. In the first nine months of 2022, we grew revenue from these networks by more than 130% year over year, with gross spread across all three of our revenue lines: activation, measurement, and supply side. A notable recent win for DV was Kroger Precision Marketing, Kroger's retail media business, our authentic brand suitability and DV Authentic ad solutions supported Kroger Precision Marketing's three main objectives, which are scale, efficiency, and quality.\n\nWe expect the success of retail media networks, which are projected to attract over $100 billion in media spend by 2024 according to BWG Strategy, to drive further volume increases across our solutions as we expand our partnerships with some of the largest players in the space. including Amazon, Walmart, Target, Macy's, Best Buy, and Kroger. Let me wrap on the topic of scale with our recent international expansion activity. While FX headwinds and a pullback in EMEA by a few large advertisers impacted our relatively small international measurement revenue numbers, we have been very successful winning new EMEA and APAC clients.\n\nIn the third quarter, we signed several advertisers in EMEA, including TUI, Club Med, Mattel Global, Mulberry, Müller Milch, and SC Johnson. We also signed a number of new deals in APAC, including Mead Johnson, Marina Bay Sands, KFC India, and Goibibo, one of India's largest travel booking sites. We invested in building our sales and customer service footprint in several overseas markets last year in recognition of the fact that our largest opportunity for greenfield wins lies in the international markets. Our investment has generated significant new client wins and is expected to be a key driver of our long-term revenue growth in the years to come.\n\nTurning to DV's market-leading innovation. We launched the DV Authentic Attention Snapshot in the third quarter. located within the DV Pinnacle UI, the Snapshot provides visualizations of attention, exposure, and engagement data with real-time reporting which allows users to analyze performance by multiple dimensions, including campaign, creative, and device, and enables a variety of strategic campaign improvements. To date, we have over 600 clients actively evaluating their Snapshot data, which has generated nearly 200 customer sales opportunities.\n\nSelect large advertisers across verticals, including technology, automotive, CPG, and telecom, have been converted to activate the full version of the product, while numerous others are testing the solution. While it's still early days for DV's Authentic Attention solution, the industry is increasingly embracing attention as an alternative currency for outcomes, fueled by ongoing industry disruption in attribution and audience measurement caused by the loss of third-party cookies. We continue to see traction with our suite of pre-campaign social media activation tools powered by OpenSlate's brand suitability and contextual analysis engine. Since the second quarter, 22 new advertisers have signed up for this capability, including high-profile brands, such as Nestle Japan, Colgate EMEA, and the Emirates Group.\n\nIn addition, we continue to cross-sell pre-campaign social activation solutions to our existing post-campaign social measurement clients thereby creating a beneficial optimization loop within walled gardens that's similar to the optimization loop that we have created for the open Internet. One of our most important recent innovations, authentic brand suitability, continues to be an incredible growth driver for our business. ABS revenue grew 46% year over year, primarily driven by large new advertisers activating this solution, including Best Buy, Norwegian Cruise Lines, and State Farm. ABS' ability to reduce media waste while safeguarding brand reputation in programmatic applications has rapidly evolved this solution from an upsell to a competitive conquesting tool for DV.\n\nRecurring customers drove about 40% of ABS' revenue growth as our top 100 customers, including Amazon and Dell, expanded their use of ABS to additional international geographies. And we continue to grow ABS activation beyond our top 100 customers. In the third quarter, approximately 63% of our top 500 customers activated ABS. ABS usage by this customer cohort has grown steadily each year.\n\nIn the third quarter of 2020, usage was 33%, which grew to 55% in the third quarter of 2021, and 63% this quarter, a testament to the value of this premium-priced product creates for DV of any size. Let me end with our final differentiator, trust, which is core to the value we deliver to our customers and underpins our important role in the digital advertising ecosystem. In the third quarter, we achieved ISO 27001 certification, the most widely recognized international standard for information security management. Our clients and partners trust DV to protect their brands and their information and this latest addition to our robust list of industry certifications and accreditations demonstrates our commitment to offering the highest standard of information security, protection, and confidentiality.\n\nIn a digital advertising environment that increasingly seeks stability and transparency, DV's unmatched roster of accreditations and independent perspective have set us apart and supported long-term sticky client relationships that continue to grow. Our gross retention rate remains over 95%, and we have achieved 41% growth in the total number of customers, generating more than $200,000 of revenue on a trailing 12-month basis. To conclude, our business continues to demonstrate resilience due to fundamental attributes that are worth reiterating. First, the essential nature of our products, which protect brand equity and optimize media efficiency by reducing waste, help us continue to win new customers and expand our relationship with current customers and is especially important when marketing budgets get tight.\n\nNext, our largely fixed transaction fee business model substantially insulates our revenue from CPM volatility, while our verify everywhere product strategy diversifies our revenue across platforms and verticals, making DV largely agnostic to shifts in ad spend. Our well-diversified customer base comprises the world's largest and most trusted brands with no single vertical driving more than 20% of revenue last year. And finally, the number of solutions in our product offering continues to expand, further enhancing our ability to penetrate a vast and untapped TAM and sustain our long-term growth. We've had a strong first nine months of the year and remain confident that our growing global scale, market-defining innovation, and legacy of trust will continue to solidify our client relationships and fuel steady growth that will outperform our competitors in the broader digital ad industry in 2022 and beyond.\n\nWith that, let me turn the call over to Nicola.\n\nNicola Allais -- Chief Financial Officer\n\nThank you, Mark, and good afternoon, everyone. We're pleased to have delivered another strong third quarter and year-to-date revenue growth of 35% and 40%, respectively, with adjusted EBITDA margins of approximately 30%. The durability of our revenue growth and profitability reinforces the resilience of DV's business model and the essential role DV solutions play for its customers even in a challenging macro and geopolitical environment. While we remain mindful of the possibility of further reductions in ad spend that could impact our performance, we're raising the midpoint of our full-year revenue guidance range by the magnitude of our third-quarter outperformance.\n\nThis is based on our current visibility into the fourth quarter and an expectation of the typical seasonal upswing in our activation business into year-end. Third quarter total revenue growth of 35% was driven by 48% growth in activation, 14% growth in measurement, and 57% growth in supply side. Our activation and measurement business is derived from advertisers and drives, a combined, 90% of total revenue. Advertiser revenue grew 33% in the third quarter, with volumes, or MTMs, growing 17% and pricing, or MTF, growing 10% on a year-over-year basis, excluding revenue contributions from OpenSlate, which continues to perform in line with expectation of $15 million to $18 million of revenue for full year '22.\n\nOn volumes, our 17% year-over-year growth continues to significantly outpace the industry as reflected in Magna forecast of 7% growth in 2022 U.S. digital ad spend ex-search. With regards to pricing, our MTM growth of 10% in the quarter was primarily driven by improved premium product mix, followed by the impact of the programmatic display and video price bifurcation which we initiated on our core programmatic products in the first quarter of this year. Our fixed transaction fee model is not a take rate model, which allows our pricing to remain broadly insulated from CPM volatility.\n\nThe price of DV's advertiser products is fixed both for measurement and activation. On platforms that charge based on a percent of media, our pricing includes caps, which effectively mirrored DV's standard fixed fees. As a result, MTFs have remained generally stable throughout 2022. Shifting to activation.\n\nRevenue growth was led by our premium price programmatic products, authentic brand suitability, and custom contextual which delivered 46% revenue growth and comprised 55% of programmatic activation revenue compared with 53% in the prior-year period. Approximately 60% of ABS' revenue growth was fueled by new client activations, while 40% was generated by existing clients, growing their ABS impression volumes. Increased volume in our standard programmatic products also significantly contributed to our activation revenue growth, as well as the impact of the price bifurcation. Turning to measurement.\n\nRevenue grew 14%. Measurement growth was driven by new client activations and is reflected in our strong CTV volume growth of 48% and Social volume growth of 23%. International measurement revenue growth for the quarter was 2% on a reported basis. FX movements resulted in a headwind of approximately seven percentage points in the quarter.\n\nWhile international growth has slowed, today's DV's measurement business remains predominantly U.S.-based with a relatively small exposure to international, which comprised 26% of total 2021 measurement revenue. Longer term, we see several catalysts for the continued growth of DB's measurement business. The first is expansion on Social, where, as Mark mentioned, our brand safety and suitability measurement products have now launched on TikTok and are continuing to expand on LinkedIn, as well as on other leading platforms. The second is CTV where Netflix selected DV to provide viewability and fraud measurement across its platform with brand safety and suitability to follow.\n\nThe third is authentic attention, which is gaining momentum with advertisers following the launch of DV's Authentic Attention Snapshot. Finally, there is a continued opportunity to cross-sell our measurement suite to activation-only clients. Of our top 500 customers, over 20% have used DV solutions for activation only but not for measurement this year. Using both product suites enables advertisers to further optimize media quality and reduce media waste, a compelling customer value proposition for our commercial team to cross-sell.\n\nShifting to supply side, which includes home and publisher customers, revenue grew 57%, largely driven by new revenue from major platforms that embed DV solutions, including OpenSlate, to provide their customers with inventory that meets a standard level of third-party verification. Public revenue also grew, mainly driven by growth in new publisher customers. Moving to expenses. Cost of revenue increased by 44%, primarily driven by a revenue-sharing arrangement with programmatic partners as activation revenue grew to 55% of total revenue in the third quarter from 50% a year ago.\n\nRevenue less cost of revenue has remained steady this year at 83% of revenue at slightly lower levels than prior year, reflecting the larger share of activation revenue in addition to continued infrastructure investments to scale and accommodate our growth. Non-GAAP product development costs grew 34%, while sales, marketing, and customer support grew 26% in the quarter as compared to prior year. G&A costs have remained relatively stable at approximately 14% of revenue this year. Overall, we had 885 employees as of the end of the third quarter, an increase of 14% year over year as compared with a 40% year-to-date revenue growth, reflecting the efficiency of our operations as we scale.\n\nWe delivered $34 million of adjusted EBITDA or 30% margin and $10.3 million of net income as our business continues to combine high revenue growth and high margins. Additionally, we generated approximately $32 million of net cash from operating activities in the third quarter and $58 million year to date, resulting in a year-to-date operating cash flow to adjusted EBITDA ratio of 63%. We expect capital expenditures of approximately $35 million in 2022, including approximately $25 million invested globally in office space as we return to office this year with a significantly larger employee base than before the pandemic. Finally, we ended the quarter with approximately $243 million of cash on hand with zero long-term debt.\n\nAs we noted in prior quarters, balance sheet strength remains an important advantage for DV as rising interest rates negatively impact more leveraged companies and decreasing valuations provide opportunities to accelerate long-term growth through strategic investments, including M&A that will advance our product and technology road map unlock adjacencies and expand our global footprint. We remain disciplined with regards to capital allocation and continue to believe that the investment climate in the digital advertising ecosystem is likely to become even more favorable over time. Now, turning to guidance. We expect fourth-quarter revenue in the range of $131 million to $135 million, which implies year-over-year growth of 26% at the midpoint.\n\nThe midpoint of the range is based on our current visibility into the quarter and an expectation of typical fourth-quarter seasonality where activation volume momentum builds into year-end. We expect fourth-quarter adjusted EBITDA in the range of $45 million to $47 million, which represents a year-over-year increase of 14% and an adjusted EBITDA margin of 35% at the midpoint. For the fourth quarter, we expect stock-based compensation to range between $11 million and $12 million and weighted average diluted shares outstanding to range between 170 million and 172 million shares. For the full year, we are raising revenue guidance to range from $450 million to $454 million, which implies year-over-year growth of 36% at the midpoint.\n\nWe expect adjusted EBITDA in the range of $138 million to $140 million, which implies a year-over-year increase of 27% and an adjusted EBITDA margin of 31% at the midpoint. To close, we delivered a strong third quarter and year-to-date revenue growth and profitability, which reflects the resilience of our business. We continue to engage regularly with our clients to ascertain their commercial and spend outlook as we execute our plan throughout the end of the year and over the coming quarters. And with that, we will open the line for questions.\n\nOperator, please go ahead.\n\nOperator\n\nThank you. We will now conduct a question-and-answer session. [Operator instructions] Our first question comes from Matt Swanson with RBC Capital. Please proceed.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nYeah. Thank you, guys, so much, and congratulations on the quarter, especially in this environment. Mark, I think the first thing I want to kind of touch on here was that 71% of wins were greenfield. And then following that, we've seen more deals in Q3 than the first half of the year combined.\n\nIt feels like just kind of intuitively, this would be a challenging environment for finding new customers, especially ones on have a previous solution when you're kind of maybe doing a little bit of evangelizing. Can you just maybe talk us through what's working so well, especially in this macro for landing new customers in those greenfields?\n\nMark Zagorski -- Chief Executive Officer\n\nYeah. Hey, thanks for the question, Matt. And yeah, you know, it is truly part of what we've been focusing on over the last 12 months with regard to investments. If you remember, kind of where we started journey after IPO is we had significantly underinvested in some of our sales and marketing resources over the previous years.\n\nAnd last year, we leaned in pretty hard into those resources, particularly outside of the U.S. And I think what we're seeing now is the payoff of the investment of that additional sales headcount and what they've been able to do with our products. We knew that if we get our solutions in front of folks and seen by our RFP win rate that's been above 80% for the last trailing 12 months, we can win those deals. So, I think, A, it was part of the investment thesis that we have on sales and getting our product in front of the right people.\n\nMore specifically, when you're talking about kind of how are we making these sales in a challenging kind of macro environment, I think it really is a testament to what our solution does for advertisers, which it helps them drive better ROI. And if you're a CMO and your budget just was cut by 20%, you now have much less money to deliver the same or better results. And because of that, concerns about ad fraud, concerns about as that can't be viewed, concerns about ads that are delivered in an environment that's not going to sell anything for you because it's either a wrong geography or the wrong context, those concerns become that much more important to advertisers. So, I think our sales motion has really been focused on our solutions that focus -- that deliver media quality but also that drive real ROI.\n\nAnd I think that's the message we're delivering to the market and make the market is responding to, which is, every dollar I have to spend is that much more precious, and your solution help me do so.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nThat's really helpful. And it kind of tails into my next question for Nicola, you know, where based on everything Mark just said, we can all feel that your model is very resilient in this macro, but nobody is immune. So, can you kind of talk a little bit more color around the macro assumptions in Q4? And then maybe just kind of what gives you confidence around seeing that typical upswing in activation to end of the year?\n\nNicola Allais -- Chief Financial Officer\n\nYeah, sure. At the -- so what I would say is we have been planning for a year-on-year slowdown since the beginning of the year, and it's been reflected in sort of the patterns that we've guided to. We haven't seen material signs of changes in that trajectory, but we did create a range on the Q4 guide which kind of reflects the sensitive factors that you mentioned, particularly around what might happen on activation for the end of the year, which generally does show an uplift. So, the guide range is sort of where we feel we might have some sensitivity around that.\n\nAnd just to dig a little bit deeper on that, as the advertisers are getting more concerned about spend, that's where you're going to see some of the shift of the money right toward activation. And so, that's really the part that remains sensitive. That's the sensitivity for the fourth quarter. Measurement, we have significant visibility into the quarter already.\n\nSo, really, the sensitivity is just around activation.\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nI appreciate the color. Thank you.\n\nNicola Allais -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nOur next question comes from Andrew Boone with JMP Securities. Please proceed.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nHi, guys. Thanks so much for taking my questions. To start, it sounds like Authentic Attention is moving toward a more real inflection point for monetization. Mark, how should we think about sizing that opportunity as we head into 2023? Can you help us understand the contribution to MTF or anything else that we should think about as we think about just sizing how big that could be? And then secondly, opex has been very disciplined.\n\nJust going back 1Q, 2Q, 3Q, you guys have kind of nudged up by about $1 million a quarter here. Can you just talk about 2023 as you're now going through likely the business planning cycle for next year? How should we be thinking about expenses just given the lack of visibility overall within macro? Thanks so much.\n\nMark Zagorski -- Chief Executive Officer\n\nAll right. I'll start off, and then if you take the tough question on opex, Nicola? So, thanks, Andrew. Regarding Authentic Attention, I think we have been really pleased with the launch of the Authentic Attention Snapshot as we noted, is now being engaged with over 600 of our clients, which is exactly what we wanted because as we talked about this earlier this year. As we look at building an entirely metric [Inaudible] attention, we have to have both industry acceptance and standardization, which is fast occurring at multiple levels.\n\nlevels, but also better understanding on the brand and client level. And the launch of the snapshot, which is a freemium version of our tool, is doing exactly that. It's getting attention metrics in front of our key clients, getting them to engage with them, and getting them interested in actually employing them to better optimize their campaigns. To date, you know, we now are looking at almost a third of those 600 -- or actually even a third of those 600 who are now interested in kind of pursuing further deals.\n\nBut with regard to scale of the business next year, it's still early days. We're still looking at building out those business metrics. It is a premium-priced product. So, I think the implementation of the product over the first several quarters of next year is going to be when we start seeing the real scaling, and we'll be able to provide a bit more color on what we think the impact will be for the year.\n\nSo, sorry for not a specific number here because at the end of the day, we're still building out the solution. It's still a minor contributor to our revenue, and we think it will probably likely be so moving into next year. But at the end of the day, as we're looking to scale seeing marketwise, and for us, this can be easily as bad as viability because it's a metric that really connects engagement plus exposure. And those two things are essential to driving outcomes for advertisers.\n\nSo, early days, we've got more to do on kind of converting those testers and to pay customers. But the motion is in play, and I think we see some early results.\n\nNicola Allais -- Chief Financial Officer\n\nYeah. And on the question of '23 expenses, your question was specifically around in a challenging environment. What would we do on expenses? What I would start by saying is we do have a very profitable model, as you know, and we've been able to maintain 30-plus margins throughout. If the growth is reduced, right, if we are in a challenging macro, we would look to maintain, you know, a decent level of EBITDA.\n\nIf growth slowed, I think we'll just throttle expenses until the conditions improve. We don't want to necessarily decide the fact that the TAM is very large, and so there are opportunities to invest opportunistically. We would do that, but we will keep an eye on the expenses is the growth really does slow down. I would also say, in a tougher macro environment, in fact, we have a lot of cash on the balance sheet creates an opportunity for us to invest in different ways, which is another thing that we could look at.\n\nAndrew Boone -- JMP Securities -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Laura Martin with Needham and Company. Please proceed.\n\nLaura Martin -- Needham and Company -- Analyst\n\nHi there, guys. Excellent numbers, raising guidance, stocks up 10% aftermarket, really excellent numbers. I have two questions. The first is -- let's follow up on Andrew's question about -- and I'm going to ask it the other direction, which is, I get that you want to maintain margins, expenses are important to you.\n\nHowever, Twitter just, thanks to Elon Musk, laid off half of their workforce. Facebook is laying off people. Alphabet is laying off people. It feels like there's going to be a lot of really talented technical people coming available, and I'm wondering how you think through since your numbers continue to hold up so nicely, grabbing some of this talent that's now going to be out over the next six months, especially if we go into recession.\n\nCan you talk through how opportunistic you're going to be as talent comes available in the marketplace from very high-quality places as they try to throttle their cost growth, basically, at Wall Street insistence, actually? And then my second question is, Mark, 57% growth in supply side, what the heck is this? It is now over 10% of your revenue. It's growing the fastest. Could you tell us who's selling the supply side? Or are they just coming in over the transom, and you guys don't have to do anything? How is this growing? How is this tiny piece of your business growing so fast? And is it going to end up being a third of your business? Or are you -- I'm shocked at the growth in the supply side. I didn't even know we focused on that in this company.\n\nSo, let's talk about those two subjects first.\n\nMark Zagorski -- Chief Executive Officer\n\nAll right. Good questions, Laura. I'll start off a little on the people one, and then maybe Nicola can add a little more of a technical take on it. But People are our most expensive asset, right? And when we talk about opex and investments, it's really what we're talking about is people.\n\nAnd as you noted, the market for those people over the last trailing several quarters, has been incredibly intense, right? The hiring coming out of the pandemic was feverish. The cost of those resources was incredibly high, and we were competing against everybody for great resources. Now, I think that the market has loosened up. There are great people coming into market.\n\nAnd for us, that means an opportunity and an opportunity for us to continue to upgrade our team an opportunity for us to fill spots with great people and do so at a cost that's, hopefully, significantly less than it was a year ago. So, we continue to focus on margins. We continue to focus on running a sound and a well-run business that generates growth and profitability. But we're going to look for opportunities to get great people.\n\nWe're able to look for spending against growth as it makes sense. But one of the nice things right now is that spending has just gotten a little bit cheaper for us. So, we're as there's inflation all over the place, I think people costs on a per-head basis are going to start to look a little bit better for us. Nicola, do you want to add -- anything to add?\n\nNicola Allais -- Chief Financial Officer\n\nYeah. No, I agree with what Mark said. For us, it really just gets easier to find talent. It has been hard.\n\nAt the beginning of the year, it was difficult to find talent. So, I think this just creates an easier pool for us to find a time that we need. And I would say if we will remain opportunistic, if there's an opportunity for us to invest faster because we think the opportunity is there, we might do it. We will be very mindful of our margins.\n\nBut point up or down, obviously, we would do it for the right level of investment.\n\nMark Zagorski -- Chief Executive Officer\n\nFor sure. And look, yeah, I have to give our teams some kudos here. We have an incredibly talented team that's doing great work in a challenging macro environment. So, we already have great assets, adding more is going to be the best thing to do.\n\nOn your second question on the supply side, I think this is a nice piece of our business. I know it's still relatively small as a revenue generator. But a lot of this has to do with us working with platforms to leverage our data to give them, for example, a minimal level of brand safety floor on the inventory that they're offering out providing them with internal fraud verification tool set. So, it's basically taking our core data sets and just leveraging them on the supply side, on SSPs, on publisher sites, on retail media platform.\n\nSo, folks who basically are pushing inventory out, but [Inaudible] wants to provide some level of transparency and cleanliness to that inventory. We see that grow at a nice steady pace. We've got a team that's focused on it. They are, like the rest of our folks, performing really well.\n\nAnd as more and more platforms, particularly folks on the CTV and gaming space, deliver -- start to become focused on being ad-supported and talking the talk of advertisers, we think there's continued opportunities there as well. So, it's a nice revenue growth for us. We don't talk about it a lot. That also includes our publisher business, which has a nice growth trajectory, but it is complementary to our advertiser business.\n\nWe will continue to grow that business, and we have got a great feeling in --\n\nLaura Martin -- Needham and Company -- Analyst\n\nThank you. Got it.\n\nOperator\n\nOur next question comes from Youssef Squali with Truist Securities. Please proceed.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nGreat. Thank you very much. Congrats, guys. You make it look pretty easy in a pretty challenging environment.\n\nSo, please keep it up. So, my two questions are, first, I know you're not guiding to 2023 yet. But as you look forward at next year and you go through your budgeting process, what base case are you guys baking into your expectations? And maybe can you talk about the resiliency of the model, as you know. I think in your prepared remarks, you talked about your pricing model.\n\nBut what else is there that gives you the confidence that your business is resilient, relatively resilient? And then can you just provide us an update on the media relationship and the integration of brand suitability solutions into the news feed? Thank you.\n\nMark Zagorski -- Chief Executive Officer\n\nMaybe I'll start a little bit and then [Inaudible] add some color. So, let me start at the back, which is the easier one to talk about is -- it's kind of like fight club, you can't talk about that. Yes, it's first rule. But they announced last month that initial testing had begun for third-party verification solutions for the feed.\n\nAnd we've said publicly that we look forward to potentially working with them on expanding those solutions because we are -- what they call a badged brand safety business partner. So, we've been working and consulting with them as they continue to develop the solution and the plan is to offer it at some point next year. So, still leaning in there and still excited about the opportunity, and a great one for us in the company. On the -- I'll talk a little bit about resiliency and maybe Nicola can talk about how we're looking at 2023.\n\nSo, I think we heard from earlier this year when we had our Investor Day, we talked about what drives resilience for us. And everything from the fact that we've got solutions that are -- we consider essential and then drive ROI for advertisers, right, they're needed. To the fact that we have a business model that's based predominantly on fixed fees that don't suffer like a percentage of media model does when CPMs of media go down. That, plus the fact that we still have a lot of greenfield to go after -- I mean, 71% of our deals this quarter were greenfield.\n\nThey weren't competitive takeaways that are new to DoubleVerify. So, that plus new products coming out, all of those things give us a good level of comfort that, again, we never said we're immune to downturns in advertising. But we've built a pretty resilient model in which no single sector, no single media property -- if dollars shift from Social to over web, we're OK. And no single buying strategy is really going to impact us accurately.\n\nSo, all of those become factors as we look at next year, which I think is we're not the first one to say is still a question are from an advertiser perspective and from a macroeconomic perspective. Yes. Go ahead, Nicola.\n\nNicola Allais -- Chief Financial Officer\n\nWhat I would add is you think we make it look easy. It's obviously not easy. It's hard work from everybody here to make sure the products are superior to what else is in the market and that we -- our go-to-market strategy is the right one. I would say, in addition to the pricing model, there is one aspect that this year makes us feel good about how we're continuing to enter macro disruption is that we are far outpacing the industry in terms of growth.\n\nSo, we do feel like we're still at a higher clip than what the macro is showing in terms of digital ad spend. And I think going into '23, setting a size of pace of adoption into new areas, there are a lot of new arts that are going to come to play next year. Netflix is a known one. Take off is very new for us.\n\nThere are other areas that make us feel good about the opportunities out there. I think the macro will impact the speed at which we get into those areas, but they're all there, right? So, it might delay a little bit, but we do feel like there's plenty of us to go after on the TAM side of things. So, I think '22 was confirmatory that we're a little ahead of where the industry is at and that's where we're looking to build our case.\n\nYoussef Squali -- Truist Securities -- Analyst\n\nMakes sense. Thank you both.\n\nOperator\n\nOur next question comes from Arjun Bhatia with William Blair. Please proceed.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nHello. Thanks for taking my question, guys, congrats on the quarter. Maybe I wanted to pick up on that last point. Nicola, it seems like there's a lot of important partnerships and big opportunities that are going to come into play.\n\nNext year, you have Netflix, you have Meta, and you have other opportunities that you can certainly go after. Can you talk a little bit about how the R&D or is faring from a capacity perspective as you're looking to build maybe the technical integrations into a lot of these newer opportunities? And how do you think about that from a hiring perspective, right, you need to add more engineers and maybe ramp up hiring there as you have more opportunities to go after?\n\nNicola Allais -- Chief Financial Officer\n\nYeah. I'll start, and Mark can trend in. I think -- I'll pull back on a few things that we've talked about in the past. We do have a unified pipeline for social product.\n\nand that becomes something that really allows us to go into new areas faster than just having to start from scratch, right? And the deep knowledge we have in integration really help us to get into the next one. I think the partnerships that we have with the various platforms really helps us accelerate that first point, right, when we start talking to the platforms about what it means to integrate. And so, we feel like we have a head start on all of that. Obviously, we will have to look at our resources if something very large comes to play, but we're also redeploying the resources that we have, right, after a while you're able to learn from what we've already built and kind of move into the next integration.\n\nSo, we are balancing a little bit with just reapplying our staff into new areas using the lines that we already have, supplementing a little bit with outsourcing, obviously. But if a very large opportunity comes, as I said earlier, we'd be willing to look at additional investments, you know, with one or two points on the margin. And I think if it's the right investment, we would do it.\n\nMark Zagorski -- Chief Executive Officer\n\nAnd I think you nailed it, which is basically, you know, we've been able to build a very flexible and agile, you know, data ingestion system that allows us to move to different types of platforms, but provide the same level of data out and measurement out regardless of what kind of data comes in. So, I think that's helped us. And when we started in social years ago, it was a different story. But every social platform that we've added since has given us more knowledge, allows us to do quicker.\n\nAnd when we start moving into CTV, the work that we've done, for example, on Hulu, it forms the work that we do with Roku, which will inform the work that we do with Netflix, right? So, I think it all builds on each other. And there are certainly checkout projects and platforms that will involve additional resources. But the good news is kind of just like fraud schemes that all kind of look almost the same, but they have different variants, platforms, in a lot of cases, look very similar. They just have different brandings that we have to deal with.\n\nSo, it's not like reinventing the wheel each time we create a new integration.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nOK. Got it. Very helpful. And then, Mark, maybe for you, that -- when you think about a lot of these newer deals and newer opportunities that you're closing, especially the greenfield opportunities that are out there, where is brand safety like ranking in terms of priority from a customer advertiser perspective? Like, we've known it's been high, but it seems like it's still increasing off of a relatively high level.\n\nSo, when you're pitching ROI and value prop to customers, where is brand safety relative to a lot of the other forms of return that you offer with your solution?\n\nMark Zagorski -- Chief Executive Officer\n\nIt's a great question. And I think we've talked about past how our sales section has changed to lean much more into brand safety and brand suitability over the last several years just due to the macro environment that advertisers are dealing with, right? So, kind of a no-brainer to want to filter out ads that people can't see they're not viewable or as that can potentially fraud. But what keeps -- those are many losers, right? You'll lose money, and it's not great and no advertiser wants to do so. But what keeps them up at night is brand safety and brand suitability.\n\nThat becomes the nightmare of a CMO, which is my ad shows up next to hate speech or white supremacist content or something that's totally inappropriate for my brand. And I think that has become the resounding message that we've got out to market with, it's just we're going to help you sleep better at night. Our sales team uses brand safety and suitability as entry and a lot of discussion. You see that in the ABS growth that we have, which is, besides even measuring and blocking, don't even buy it, right? So, Authentic Brand Safety became Authentic Brand Suitability because we want to provide even a greater level of granularity in that kind of protection down to the suitability level.\n\nSo, it has changed. The dialogue has changed is now a big part of how we go to market. You can see it in our results. products like ABS are growing as fast as they are.\n\nAnd it's not a U.S. phenomenon anymore. It's a global phenomenon, brands are global. There are regional challenges to brand suitability and brand safety.\n\nAnd now as we operate all of our brand safety to the build tools around the globe, we see opportunities for them there as well. So, it's been a -- it's been a really important shift in not only how we sell, but where we invest in products and what our customers are really interested in buying from us.\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nAwesome. Got it. Thank you.\n\nOperator\n\nOur next question comes from Michael Graham with Canaccord. Please proceed.\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nThank you. So, one quick one on Twitter. Just -- I know you mentioned that you've just integrated for brand safety and stability. Any thoughts on like sort of the timing to that having an impact on the revenue? And is there any worry that with the changes there that might get disrupted at all? And then a bit of a broader question.\n\nMark, is there a good way to think about like how much headroom you have with a typical large advertising client? You mentioned 20% of the top 500 are taking activation only. But is there a good way to think about sort of how much growth you have and how much visibility you have, I guess, within some of your big advertising customers just to expand wallet, you know, share with them?\n\nMark Zagorski -- Chief Executive Officer\n\nSure. Thanks for the question, Michael. And we are waiting for our first Twitter question, so surprised it took this long. So, we're still in the beta process of getting that product out market.\n\nWe obviously are excited to -- and our advertisers are really excited about having a brand safety and suitability solution in that environment. Right now, Twitter is a relatively small portion of our social media revenue, and we haven't planned for that to grow significantly over the next couple of quarters and still seem to be a smaller social network, both from a scale from an advertiser wallet share and from our business. It's a great opportunity. We're likely going to see some delays in development and launch of that product just due to the chaos that we see at Twitter.\n\nBut ultimately, as a financial impact to our business, it's very, very light. So, good opportunity, good opportunity for advertisers. We think it's a good timing to get that product to market. We're still excited to get to general acceptance, but we're expecting some delays in that.\n\nOn the second question, when we look at kind of our solution set and where we have more opportunity to grow. I think we've always start with kind of the number of products, the number of products that we have with our customers. So about 60% our customers use less than four products, which means that we still got a decent amount of headroom to go out and sell our full suite to them. right? So, we look at, for example, growth of ABS over the quarter.\n\nA lot of that growth is with current customers expanding that into new markets. When we look at the adoption of, for example, new platforms in our Social business, so new social coverage we saw Social grow significantly over the quarter, and that's from current clients as well. So, I think we still have a good amount of room. When we look at, I believe, on our ADS business for our top 500 customers, that number is still relatively low penetration.\n\nI think 63% in our top 500 are using it, but that's 63% using it in one market, could be. So, lots of room there. As we've always said, we'll love adding new customers, but we still got lots of growth with our current customers. And I think the product that we continue to expand means that that 63% using four or less products means that there's probably -- that number is going to be increasing over time.\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nThank you, Mark.\n\nOperator\n\nOur next question comes from Vasily Karasyov with Cannonball Research. Please proceed.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nYou know, about how political spending, which is [Inaudible] at all because looking at the transaction measure, there is no change versus Q2. So, can you talk about your exposure? And then I have a follow-up on that.\n\nMark Zagorski -- Chief Executive Officer\n\nVasily, you broke up a little bit there. So, maybe if you can repeat it.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nOK. I can repeat if it helps.\n\nMark Zagorski -- Chief Executive Officer\n\nYeah, please. Please, please. Yes.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nMy question was about political spending in the space, whether it had an impact at all in the quarter. Or are you seeing it because looking at your transaction measures, growth is the same as in Q2, right? So, it doesn't seem by that metric that you are benefiting from that. So, am I right? And then I have a quick follow-up on that.\n\nNicola Allais -- Chief Financial Officer\n\nYeah, yeah. I think your read is right. And we've said it in the past. You know, we don't -- political spend doesn't really have any direct impact campaigns, and are now using our products the way a brand would, right? Because there's our specific to a specific time for a specific purpose.\n\nSo, we don't have a lot of direct impact from political campaigns.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nThank you. What some of your peers in the programmatic space say is that when political spenders are in the market, brands sometimes step aside because political campaigns are not price-sensitive. Is that something that you're seeing? So, is it possible that there will be even an improvement in trends with brands after the political spending season is over?\n\nNicola Allais -- Chief Financial Officer\n\nYeah. I mean, we -- yes, I mean, we're aware of that thought that maybe political kind of just puts the brand aside. We frankly -- we haven't seen it to the point that it's directly tied to political. Like, in our trend, we have to -- even in prior campaign cycles, we haven't seen that necessarily.\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nOK. Thank you very much.\n\nOperator\n\nOur next question comes from Mark Murphy with J.P. Morgan. Please proceed.\n\nArti Vula -- JPMorgan Chase and Company -- Analyst\n\nHey, guys. Thanks for taking the questions. This is Arti Vula on for Mark Murphy. Quick question.\n\nIf you're looking at the retail segment of your customers, anything worth calling out there since you're kind of heading into the holiday season? Some of the companies expressed a little bit of caution but then they also have a lot of inventory to try to move. So, that's generally a positive for advertising.\n\nNicola Allais -- Chief Financial Officer\n\nYeah, that's exactly -- that would be exactly the dynamic that we're looking at, which is it is a heavy season for retail. But on the other hand, those are the types of companies that have been perhaps a little bit more confine spending. What I would say is the good news for us is we're not overly weighted on any specific industry. The largest one for us is CPG, it's 20% of our revenue.\n\nSo, to the extent that some industries are going have down, it generally is offset by another industry that takes up the additional inventory. So, we are monitoring, of course, and we do think that there's a huge opportunity on the retail media network. It feels disrupted maybe currently, but it's not that the opportunity is there long term.\n\nArti Vula -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thanks. And then just generally, if you're looking at kind of add volumes or demand, as you kind of exited Q3 into October and November, anything kind of changed, any variance to call out by geography, industry, or anything along those lines?\n\nNicola Allais -- Chief Financial Officer\n\nI think the guidance that we have for Q4 sort of reflects three things. One is, obviously, it's at a lower rate than it was prior year, right? So, we have put into the numbers sort of a lower overall market, right, for digital advertising. So, that's one. Step 2 is specific lead to the fourth quarter.\n\nWe have decent visibility around campaign life on the measurement side of things. And based on what we see there, generally, there is a strong correlation with what we would see on the activation side. That's what the past years, the past quarters have shown. But this time around we're being a little cautious around the upper and lower parts of the guidance in case that year-end upswing on programmatic doesn't happen.\n\nArti Vula -- JPMorgan Chase and Company -- Analyst\n\nRight. Thank you.\n\nOperator\n\nOur next question comes from Mark Kelley with Stifel. Please proceed.\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks very much. I just have one. I'm going to go against the fight club here for a second, but hopefully, this is a question you can answer.\n\nBut last week Meta received MRC accreditation. So, we've getting a question as to whether that impacts your business on Facebook and Instagram and whether advertisers still think that they would need to use a third party like DoubleVerify. I'd love to get your bigger-picture thoughts on that question and sentiment. Thank you.\n\nMark Zagorski -- Chief Executive Officer\n\nYes. Look, it's definitely a fair question. But I think if you look at all the platforms we work with -- there is an absolute value to the thing that we always talk about, which is our independence, right? And there are many platforms that have their own validated verification solutions that they try to push out that provide solutions for free for advertisers. And at the end of the day, we are a trusted independent third-party arbiter quality.\n\nAnd I think that's been a position since day 1. I think advertisers are always going to want someone outside of the media transaction to help support their VR quality initiatives. So, I think at the end of the day, whether it's Meta or any of the other platforms, we still have an incredible value proposition to our advertisers, which is an independent full functioning multiplatform, which is important multi-platform metric that allows them to make buys and constantly make buys across any social media platform and the open web and Connected Television and mobile applications, etc. So, I think that's the key here.\n\nSo, the independence and the fact that we are cross-platform, not a single series of metrics that an individual platform may have, I think, is important for [Inaudible].\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nMakes sense. Thanks, Mark.\n\nOperator\n\nOur next question comes from Raimo Lenschow with Barclays. Please proceed.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nThank you. Thanks for squeezing me in. The Internet guys on the call might know already that, and you had them on already. But from the software side, Mark, can you talk a little bit about the proportion of money that people spend on you versus the total advertisement spending? You mentioned earlier it's kind of really worth spending the money rather than raising it.\n\nCan you just kind of remind kind of the people that are not as familiar in terms of what the mix is? And then related to that is also like where are we in terms of penetration given the number of new customers that you kind of signed this quarter? Thank you.\n\nMark Zagorski -- Chief Executive Officer\n\nSure. Yes, I'll talk a little bit in general on the first point, which is we look at our fixed transaction fee as a percentage of the average we use it as a rule of thumb, somewhere around 1% to 2%. And that obviously varies based on the type of media some buying. But as our media mix starts to lean more toward the start leading more toward Connected Television.\n\nThe percentage of that transaction that we take is still incredibly small for the value we deliver. And that's why I think even when we started the Q&A here, I mean, we talked about why we believe we can be resilient even in downtimes. The ROI that we deliver for folks using our solution is incredibly high. And that ROI is based on the fact that we're saving them from impressions that never viewed by human that can be potentially fraud or could actually fresh their brand in the long term.\n\nSo, we are a very small investment for an advertiser is looking for a great return on their spend. So, that's -- I think, again, as our product mix start to lean more toward higher-cost media, that ROI actually increases over time. With regard to penetration, I don't know, Nicola, if you have a comment on that.\n\nNicola Allais -- Chief Financial Officer\n\nI think, Raimo, for us, this may sound like a nonanswer, but the TAM is so large, and the penetration the fact that we still have so many greenfield opportunities, makes us feel like we have a ton of opportunities just to get more clients. We're not really thinking about tapping out the opportunity. And so, we just continue to deliver the products and just going after the greenfield. And as Mark said, that the greenfield percentage of our wins is higher.\n\nI think as we -- if there is something that might happen in a slowdown is, I think clients may not switch as easily. But the fact that our greenfield is growing as a potential for new opportunities is a sign that there's still a lot of opportunities out there for us.\n\nMark Zagorski -- Chief Executive Officer\n\nYeah. We shared some metrics earlier this year. which of the top 700 global advertisers, 58% of them are still not covered. And to our benefit, obviously, as we've seen FX issues over the last several quarters, we are still predominantly U.S.-based as far as our revenue is concerned, whereas a significant growth a significant amount of ad dollars are still spent outside the U.S.\n\nSo, that greenfield opportunity is both real from a dollar perspective of where our revenue comes from internationally, but also just from an advertiser perspective. We still got literally hundreds of advertisers that we don't have relationships with that at the top 700.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nOK. Thank you. Congrats.\n\nMark Zagorski -- Chief Executive Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Justin Patterson with KeyBanc. Please proceed.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nGreat. Thank you very much, and good afternoon. Two quick ones if I can. First, Mark, when you look at just attention and consider that as a currency, could you talk about just which inning you're in there and perhaps just compare, contrast attention in international markets versus the U.S.? If I recall, Europe might be a little bit further ahead there.\n\nAnd then secondly, just going back to retail media, I believe you had some announcements there last quarter. I want to say that broadens the type of advertisers from a size perspective that you work with. So, any updates on just retail media progress and potentially new clients coming in via that would be helpful. Thank you.\n\nMark Zagorski -- Chief Executive Officer\n\nSure. Let's talk a little bit about attention. We talked about it a lot because we're incredibly enthusiastic about the long-term opportunity there. And we do think it's a long play, right? When we talk about what innings we're in, I think we're in the second inning, still warming up a bit, team is on the field and start to hit their group, but it's still early days.\n\nAnd I think we've said this several times, which is we've got two tasks here. We've got client introduction and client acceptance, but we also have market introduction and market acceptance. So, that market introduction, it's all about creating standards that are accepted by the industry by ensuring that there's accreditations behind tools that are used for attention. And so, that the same way that people view viewability and know that there's a viewability standard.\n\nThey know that they're buying an attention metric that there's a standard out there. That's a credit as well. So, I think that is a big part of us getting to that next inning, which is making sure that there's industry acceptance, market access, or market industry acceptance. Client acceptance is really something I think we're probably maybe a bit further on, which is getting this into the hands of our customers, getting them using it, I think the launch of the Authentic Attention Snapshot is a big step forward for us.\n\nThey're looking at those metrics every day. They're engaging with them. So, now it's all about conversion. So, it is a -- it's a long play that we're going here for.\n\nWe think that this is an investment that will pay off substantially over time, but it's still very early innings. The flare in retail media, we think that's just another great opportunity. It does open up a couple of different group of advertisers to us because, A, it's not just advertisers, it's not just the retailers themselves, which we've always had great relationships with, it's expanding into their networks and providing them services for small advertisers, for small OEMs that are advertising across their properties. So, when we start thinking about how do we move out of just enterprise-level clients, channel partners is a way of getting there.\n\nAnd in some ways, those retail media networks really do become channel partners for us, getting our data in front of smaller advertisers who are looking to leverage it within retail media networks.\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nAt this time, I would like to turn the call back to management for closing comments.\n\nMark Zagorski -- Chief Executive Officer\n\nThanks, everyone. Despite the challenging advertising environment ahead, we remain excited about DV's long-term secular growth story and our ability to drive continuous innovation that maximize immediate quality and performance for the world's largest brands. Have a great night.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nTejal Engman -- Senior Vice President, Investor Relations\n\nMark Zagorski -- Chief Executive Officer\n\nNicola Allais -- Chief Financial Officer\n\nMatt Swanson -- RBC Capital Markets -- Analyst\n\nAndrew Boone -- JMP Securities -- Analyst\n\nLaura Martin -- Needham and Company -- Analyst\n\nYoussef Squali -- Truist Securities -- Analyst\n\nArjun Bhatia -- William Blair and Company -- Analyst\n\nMichael Graham -- Canaccord Genuity -- Analyst\n\nVasily Karasyov -- Cannonball Research -- Analyst\n\nArti Vula -- JPMorgan Chase and Company -- Analyst\n\nMark Kelley -- Stifel Financial Corp. -- Analyst\n\nRaimo Lenschow -- Barclays -- Analyst\n\nJustin Patterson -- KeyBanc Capital Markets -- Analyst\n\nMore DV analysis\n\nAll earnings call transcripts"
}