{
  "companyName": "Roblox Corporation",
  "companyTicker": "RBLX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/09/roblox-corporation-rblx-q3-2022-earnings-call-tran/",
  "content": "Roblox Corporation (RBLX 5.06%)\nQ3 2022 Earnings Call\nNov 09, 2022, 8:30 a.m. ET\n\nOperator\n\nGood morning. My name is Dennis, and I will be your conference operator today. At this time, I would like to welcome everyone to the Roblox Q3 2022 earnings conference call. [Operator instructions] I would now like to turn the conference over to Stefanie Notaney, director financial communications.\n\nPlease go ahead.\n\nStefanie Notaney -- Director, Financial Communications\n\nGood morning, everyone, and thank you for joining our Q&A session to discuss Roblox's Q3 2022 results. With me today is Roblox's CEO; David Baszucki; and CFO, Mike Guthrie. Before we start, I want to remind everyone that earlier this morning, we published a shareholder letter and earnings results on our investor relations website at ir.roblox.com. On this call, we will make some brief opening remarks and reserve the rest of the time for your questions.\n\nFor our webcast participants, please note the question icon at the bottom of your screen where you can type in your questions. We'll do our best to take as many questions as possible in the time we have allotted today. On today's call, we may be making forward-looking statements, including but not limited to our expectations of business, future financial results and business, and financial strategy. Forward-looking statements are subject to risks and uncertainties that can cause actual results to differ materially from those described in our forward-looking statements, and such risks are described in our risk factors, including in our SEC filings, including our most recently filed Form 10-Q.\n\nYou should not rely on our forward-looking statements as predictions of future events. We disclaim any obligation to update any forward-looking statements, except as required by law. During this call, we will also discuss certain non-GAAP financial measures. Reconciliations between GAAP and non-GAAP metrics for our reported results can be found in our press release issued as well as in our supplemental slides, copies of which can be found on our IR website.\n\nFinally, this call is being webcast, and it will be archived on our website shortly afterwards. With that, I'll turn the call over to Dave.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nThank you, Stefanie, and welcome Roblox investors, Roblox community. Some quick bullets before we dive into your Q&A. We had a wonderful October as we mentioned in our letter, $701 million bookings in Q3, up 10% year on year. And on a currency-adjusted basis, up 15%.\n\nAlso, we've shared October 27 day numbers so you can do compares to last year, and the first 27 days of October on a bookings basis were up 13% on an adjusted basis. I want to really highlight to the Roblox community on the revenue side, where in Q3, we showed up 2% at $517 million that we follow GAAP accounting principles, and we defer revenue over the life of our payers. And in our letter, we highlighted we've increased that lifetime from 25 to 28 months. That is a very, very good thing that relates to the retention of our player bases.\n\nAnd we would ultimately want that number to be as large as possible the more we retain our customer and user base. Without that increase, our Q3 revenue GAAP accounting would have been $628 million, $111 million larger. So actually, watch us continue to try to increase that lifetime to increase retention. On a DAU basis in Q3, our DAUs were at 58.8 million, which is a 24% year-on-year growth rate.\n\nAnd highlighting October, those numbers in the first 27 days were 57.8 million, up 14% year over year. I want to note, we still have difficult compares relative to opportunistic regions from last year. But you're seeing our core and strategic users with the bookings start to lap COVID. Our developer community, once again, number of developers with experiences gathering over 100,000 hours, up 54% and number of developers with experiences with over one million hours, up 47%.\n\nA couple of things for our large Roblox and investor community I really want to highlight. As you look at our business, we run the business internally as 30 separate cohorts. That's five age ranges. We look at gender, and we also look at the region around the world and we have a lot of headroom in many of these cohorts, and I'm going to comment on that a bit.\n\nI also want to comment that we run the company as seven product groups and we have product groups directly responsible both for retention or frequency, for engagement and for monetization. I'm going to highlight a few of those numbers as well. Before we even went public, we've been sharing with all of you our vision of building a platform that optimistically brings people together around the world of all ages and for a wide range of uses, including playing, learning and working together. And I'll highlight a few of those as well.\n\nAround the world, in the U.S. and Canada, we're showing 17% DAU growth in what has historically been our most early and saturated region just showing the amount of headroom we have in our core market there. In Europe, our DAUs are up 30% year on year. In APAC, our DAUs are up 40% year on year.\n\nTalking about aging up, highlighting that our over 13 segments grew 34% and now accounts for 54% of our DAUs and also 17 through 24 is our fastest-growing cohort growing at 41% year on year. There is a lot of room for us in both our 17 through 24 cohort as well as our 24 and up cohort is -- and that is why, once again, we ask all of our investors to look at us as a wide range of businesses across all of these cohorts based on age and region. I also want to share some of the drivers of our business that highlight our optimism around Roblox's ultimate evolution to be a utility that is used very frequently. We started to share some signal on frequency, which is the ratio of our DAUs to MAUs.\n\nAnd I want to highlight that relative to September 2019, our frequency is 20% higher and our frequency is at or above levels we saw in '20 and '21 during peak COVID. The other thing I want to share the same with engagement, our engagement levels which are hours relative to DAUs are now nearly 20% higher than pre-COVID September 2019, slightly below peak COVID times but in a great direction. And then finally, just highlighting the extent to which our brand experiences has started to grow and expand. We're participating with Elton John in a new persistent world called Elton John Presents Beyond the Yellow Brick Road that premiered last Thursday on November 3.\n\nI think it's just showing the extent to which Roblox brands have become really ubiquitous in the music and brand industry. Finally, we shared a lot around our product progression during Roblox investor day. We thank you all for participating. I want to highlight just on one small detail and that is we have started rolling out early versions of our immersive ad product and we are testing now with some publishers and brands, and we will keep iterating on that.\n\nWith that, I will ask Mike Guthrie, if he wants to add any other comments. And if so, welcome, Mike. If not, we'll go straight to Q&A.\n\nMike Guthrie -- Chief Financial Officer\n\nYes. Thanks, Dave. I think you covered it. The secular trends that we talked about in aging up, our core markets and strategic markets are really, I think, some of the key financial points.\n\nSo why don't we turn it over to Q&A.\n\nOperator\n\n[Operator instructions] And your first question is from the line of David Karnovsky with J.P. Morgan. Please go ahead.\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nThank you. Dave, as you noted, the fastest-growing demo is 17 to 24. Was just hoping you could speak to some of the drivers of this growth? Are these last players that are coming back? If not, what are the types of experiences that are bringing these new users? And then one for Mike. Just hoping you could remind us of your typical seasonality in the year-end.\n\nI think you've seen some pretty strong step ups in bookings the prior two years, but there might have been some COVID factors that were helping with that. Just want to get a sense of how this has looked over a long period of time?\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nYeah, I want to highlight the 17- to 24-year-old growth has been a continuous improvement over the last three to four years. And our whole stack is contributing to this. We continue to make exceptional gains in search and discovery, both cold start and warm start, which means when an older player signs up and joins Roblox, they see more and more experiences that are tailored to them. We continue to make improvements in our game engine and our cloud game engine as far as raw performance.\n\nWe have made amazing improvements in our avatar stack with layered clothing and the ability for older players to more and more have avatars that they can identify with. We are seeing developers respond with more and more content that is interesting and applicable for older players. We introduced experienced guidelines and shared that with you at our investor day, which we will start over time having some experiences that are ultimately 13 and up and 17 and up type experiences. So this is pervasive throughout the stack, throughout the seven product groups.\n\nWe really all are working on this. And it's many, many factors that have contributed to drive this growth. I'll turn it over to Mike on the seasonality.\n\nMike Guthrie -- Chief Financial Officer\n\nYeah, great. Hey, David. Thanks for the question. So we're in a period right now, September and October, when we were coming down off of the summer -- peaks in the summer, July and August.\n\nWe saw that seasonality occur in September, down from August. October is pretty similar to September with a pickup then right around Halloween. We had a really strong beginning of October of this year, a lot of special content around -- seasonal content that was quite popular. Going into the rest of the quarter, November is typically up a bit from October.\n\nAnd then, of course, December is a big month in the fourth quarter. So like a lot of companies around the holidays, like for example, November, we usually see a pretty big step up around Thanksgiving, and then we're into the holiday season. So December is always the biggest month by a long shot. And we -- so far, seasonality seems totally normal to us.\n\nI think what we're probably most excited about is this growth in the payer base. And so you saw it in the third quarter, all-time peak number players at 12.9 million. That's a really good signal for us.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nHey. And one other thing you may have picked it up in what I just said, and I'll circle back to the aged up growth. Thank you, Mike. You hear how we always lead with raw product, quality and virality.\n\nBut I do want to pay notice to all the wonderful brands and music producers out there, the intermediate agencies creating some of these experiences in our own brand team, that is also contributing to growth. So Wimbledon, WimbleWorld 11.8 million visits. Our Tommy Play experience, our Chipotle experience has had over 20 million visits. Our FIFA World just started, millions of visits.\n\nOur Chainsmoker Concert, once again 8 -- 16 million visits. So there's also a lot of potential traffic being driven by our brand and music partnerships on top of the raw product virality that we focus on.\n\nOperator\n\nYour next question is from the line of Omar Dessouky with Bank of America. Please go ahead.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nHey, guys. Wanted to ask about something I don't -- I think that the market doesn't appreciate enough about how transformational limited items will be to the platform in 2023. Can you explain why it will fundamentally change behavior among users? And which of your KPIs should see the biggest inflection? And also among which of your 30 cohorts do you expect to see those metrics inflect the most pronounced? And I have a follow-up after that.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nYeah. I'll -- Mike, I'll do an early one on the cohorts. All 30 of our cohorts are doing amazingly well, and Mike will comment more on that. Very early on in Roblox, we started building Roblox items with the vision that ultimately, we want our user and community base to be really the provider of all UGC items, both clothing, avatar items, avatars, all of that.\n\nAnd the final step of that, that we are in the process of completing is a limited marketplace. What this means is a creator such as, I'll use Gucci, as an example, can be validated. They can have a blue check mark next to their profile. And if they so choose, they can make 10 of something rather than an unlimited number.\n\nThose items can be indexed. And just like in the real world where we have both high-volume items, I always call white T-shirts the example of a high-volume, low brand item. Just as we have that, we're moving to an economy where top brands will have limited index items. The items that Roblox has made, which we want our creators to make that we've done in a limited fashion, for example, our Domino Crown trade at $20,000 on the platform.\n\nAnd we believe we will see similar trade value, similar things that we see in the real world with scarce items with some of these. We believe this is going to be really fun, really good for engagement and we'll ultimately expand our economy so it does look more like the real world, and we have very high priced items as well. The metric this affects is bookings per hour or monetization. And when we affect bookings per hour, it affects the whole platform because we're driving those hours and raises monetization.\n\nI'll kick it over to Mike as to whether you want to comment on any cohorts.\n\nMike Guthrie -- Chief Financial Officer\n\nYeah, yes. So Omar, thanks for the question. I -- because it's going to be an open marketplace, I think the answer is going to be all cohorts. There will be content that is appealing to younger users and older users.\n\nI agree with Dave that you're going to see it mostly reflected in monetization as a core metric, though I also expect frequency engagement to also move up because it's a better experience for the user. I also believe, and it's something we don't talk enough about, is that will also affect all genders as well. So the cohort is not just age cohorts, but content will be appealing to male users and female users as well. So I think that's also really exciting.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nYeah. One way to think about it -- one cohorts put this effect in the real world, who buys high-priced jewelry, rare artwork and Ferraris, those cohorts, I think, will be affected on Roblox as well.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nAwesome. All right. Looking forward to that. So then the second question is I wanted to ask about when some incremental revenue opportunities may hit, namely dynamic heads and game fund.\n\nSo in June, I think your blog said that dynamic heads would be in the avatar store later this year. It's November now. Are you still kind of on track to have those in the avatar store this year? And if so, kind of what's your monetization model there? And then on the game fund side, I think you showed game fund examples throughout the year. When will those start to go into soft launch? Number one.\n\nWhen will they launch in earnest? Number two. And do you expect any of them to become like top 10 hits in the next year?\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nYeah, I can comment on a couple of things. I think for our investors, I would ask you to consider dynamic heads as not just a monetization product, but ultimately, the future of Roblox as far as immersive conversation. And we're moving from a world -- when we think about where all of the people in Roblox are primarily using text chat with static heads, so the demo I showed at investor day where more and more -- we show expression, our faces animate just like we do with our camera. And we're communicating by voice as well.\n\nSo we have dynamic heads in the catalog. The vision ultimately is everyone and every head on Roblox is dynamic. And we ultimately get to the point where everyone can animate their avatar. We've not given a specific day on this, but this is slowly rolling out and will roll out continuously over the next year.\n\nThere is a blog post on our blog for those that are interested that we published at the end of September called funding future Roblox creations that shows some of the progress in the game fund. I think some of these will be transformational. I don't want to comment on which and when. But if you see the general pattern of the game fund experiences, you'll see they're primarily aimed at older players.\n\nMany of them involve older avatars. And many of these are getting ready to launch soon, and we have more in the hopper side. I won't comment on them, but I will comment that we have some fairly seasoned developers building very professional experiences for older players. And Mike, I don't know if you want to rip at all on that at all.\n\nMike Guthrie -- Chief Financial Officer\n\nNo, I think it's perfect. I got nothing to add.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you.\n\nMike Guthrie -- Chief Financial Officer\n\nThanks, Omar.\n\nOperator\n\nYour next question comes from the line of Drew Crum with Stifel. Please go ahead.\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nOK, thanks. Hey, guys. Good morning. So Mike, in the shareholder letter, you noted that you intend to target an EBIT margin -- sorry, EBITDA margin below 10% through at least 2023.\n\nIs there any change to what's driving that figure relative to the updates from earlier in the year? And how are you viewing this metric beyond next year? And then, I guess, for Dave, you briefly touched on the immersive advertising efforts. Any early observations you can share? And any update on how and when you intend to deploy that across the platform? Thanks, guys.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nYeah. Mike, I want to quickly lead first on the earnings and EBITDA long term. And I know, right now, there are a lot of companies doing layoffs and I want to highlight a couple unique things about Roblox. We are going to continue hiring through 2023.\n\nWe have an exceptional talent base that we are constantly adding to and improving. And we're going to do this in a way that keeps really stock-based comp in really good range. And I think this is highlighting our drive to continue innovating and the ability to do this with $3 billion of cash in the bank and a good forward-looking cash position in the company. So we are in innovation mode.\n\nWe are in thoughtful, balanced hiring and growth modes. We run the company in a very thoughtful way, looking forward, modeling forward several years in advance. So hopefully, we're moving the tiller gently and thoughtfully toward driving this type of innovation. And I'll let Mike comment a little bit more on the earnings as a result of that.\n\nMike Guthrie -- Chief Financial Officer\n\nYeah. Hey, Drew. There are really, again, four big areas of cost and investment in our business. Payment processing is one because that's what's changing or it hasn't even changed.\n\nPayment processing has generally been coming down a little bit as a percentage of bookings or we've been getting a little bit more efficient there, which is great, not massive moves, but comfortable improvements over time. And then there's three big investment areas that Dave has really highlighted that revolve around being innovative. And that's our infrastructure and trust and safety, personnel and the investment in our developer community. All of those are --really, nothing has changed in terms of the waiting, the emphasis, our desire to make investments in those areas.\n\nWe have the ability to do it. We have a lot of liquidity. We feel like we're adding long-term value into the business. We've grown them all in really sustainable ways.\n\nAnd so we see this opportunity as one of sort of optimizing investment in the near term. And coming out of this maybe after '23 into '24, with an ability to see real leverage in the cost structure across really almost all of these areas. So nothing has changed. We're not -- what we haven't done is ramped up investment in marketing or any other things like that.\n\nUser base and top line are still very much organically driven by great product and improvements in that product. So we are really taking an opportunity to continue to innovate and build the best business with the most defensibility and sustainability that we possibly can.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nRiffing on -- thanks, Mike. Riffing on immersive advertising and the opportunity. One of the things we've always done at Roblox is built, you can call it UGC or self-serve and that is build platform and products that everyone can use and that treat all of our developers as well as all of our partners equivalent. That is the target for next year, hopefully, in the first part of next year to get this rolled out for everyone without a specific ship date.\n\nThat said, we are testing right now. So we are testing our immersive advertising technology right now with some brands and with some of our developers. So testing now. Next year, self-serve for everyone.\n\nOperator\n\nYour next question is from the line of Matthew Cost with Morgan Stanley. Please go ahead.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nHi, everybody. Thanks for taking the questions. I have two. So just looking at the bookings in September and October, there's a pretty meaningful acceleration going on there in terms of year-on-year growth.\n\nAnd I'm just wondering, Dave, earlier in the Q&A, you were talking about some of the platform improvements that you've been making, which make a lot of sense. Were there any specific user behaviors or types of experiences or new platform features that were kind of needle-moving and behind that reacceleration you saw in the past two months? And then just separately on frequency, given that you're running kind of at levels of kind of DAU to MAU ratio that you saw during COVID, I think you said at or above, how much headroom do you see going forward in terms of boosting that ratio? Thank you.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nYeah. From a product architecture and the way we work on Roblox, this is really a wide technology stack. We have amazing product and engineers working on our user experience, on our social graph, on the access points, mobile, console. We have awesome people working on our growth team, search and discovery, our core creator tools, the 3D simulation engine that powers Roblox, the economy that drives not just monetization, but actually the fun on the platform, the core cloud infrastructure that supports this.\n\nAnd of course, the very wide-ranging safety and stability team that make Roblox a welcoming, safe and optimistic place. There's so much stuff going on that historically, growth has been driven not by single big needle movers, but by many, many needle movers all being developed in parallel as quickly as possible. And I'll highlight, some of these things are things most people don't notice, including gains in the raw performance of our game engine or kudos to the game and simulation engine team, gains to the raw -- to the time and how quickly people can join these experiences, which most people don't notice but actually drive growth as well. So there are a wide range of things we've really done across the platform that improved search and discovery, have improved all areas really of the product.\n\nOn frequency, I am personally so bullish, even in our core nine through 12-year-old USA market around the headroom there because I think as we saw during COVID, people used Roblox as a utility to connect and be together. People used Roblox side-by-side with video and phone and text as a way to hang out together. And this is a utility use that goes beyond play that I think we'll see people migrating to more and more higher frequency numbers. I can't share specifically what they are, but there is a lot of headroom in USA nine through 12 DAU.\n\nMike Guthrie -- Chief Financial Officer\n\nYeah. And Matthew, it's Mike. I want to just add a couple of things to what Dave just said. As regards to bookings and acceleration, maybe just I would point you to Page 27 in the supplemental materials, which is the payer community.\n\nIf you look at Q2 '22 and Q3 '22, that sequential growth in payers is as high or higher than I think we've almost ever seen. So there was a big pickup in the number of payers and we talked about the ratio of payers earlier in the call, and you can see that in second or third quarter and so obviously, September is a part of that. Similarly, you would expect that we had pretty good payer numbers in October. So that conversion rate is really a very good point right now.\n\nAnd we talked about it in the letter -- earlier in the letter. There's a whole bunch of reasons for that. One is there is a very positive mix shift going on, as Dave suggested, in our core markets, U.S., Canada. We are back to peak levels in all age cohorts, and we are aging up very quickly.\n\nAnd so as the rate of number of payers, it's increasing in the U.S. and Canada. It's also increasing as a percentage in the strategic markets. Opportunistic has slowed down a little bit.\n\nThey do have a little bit of a tougher COVID compare right now. So mix shift of payers is moving toward areas where there's more monetization. One question is why are we seeing that conversion rate? And for that, you have to look at our other core metrics; our frequency, our retention and our engagement numbers, and those are all moving up as well. And that impact starts at the highest level with your users and then flows all the way through until you get the payers.\n\nAnd so we're seeing improvement really across the board in all age cohorts, all demos and more and more payers and again, very good sequential growth in payers in the third quarter. There was a question earlier around seasonality. To me, that speaks to really healthy movements as we go into the rest of the seasonal -- rest of the year in the fourth quarter. But I really would look at that number as an output of a whole bunch of core metrics that we are focused on that start with frequency, goes to engagement, goes to monetization.\n\nThat conversion rate has just been -- has really held up post COVID at very high rates. And so I think that's why you're seeing that acceleration.\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nYour next question is from the line of Clark Lampen with BTIG. Please go ahead.\n\nClark Lampen -- BTIG -- Analyst\n\nHey. Good morning. Thanks for the question. I have two on the developer community and advertising.\n\nFirst, Mike, you talked about secular dynamics with aging up before. Are those as prevalent on the developer side such that you're bringing on more 17- to 24-year-old developers and the content that they're creating is helping you drive what seems like a more recent inflection in growth of other users and also monetization and payer conversion? And then second question on advertising. Understanding that, that sort of vector of monetization is really early stage right now, we did pick up some good feedback intra-quarter from marketers that basically said, we'd like to spend more on Roblox over time. There's demand from our customers or from us ourselves, but one of the factors right now is measurement.\n\nAnd I'm curious if building that sort of performance framework is part of the road map for the ads business? And if so, is it possible that you could give us some color on the time line for introducing something like that? Thank you.\n\nMike Guthrie -- Chief Financial Officer\n\nDave, do you want to start off on the ad question, and I'll take the first one then?\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nI'm really excited about the potential for measurement of both brands as well as action-based type advertising here. And we are going to be providing both of those types of things. There will be two types of immersive 3D ad units on the platform, those that are the brand where we will be able to measure views, amount of dwell time. And really, this is the creation of a set of new types of measurement for immersive 3D advertising.\n\nIt's almost as if in the real world, it's really hard to measure how many people saw a billboard on a bus when it went driving by. But in an immersive 3D world, we can actually measure how many people saw that. So there's the potential in digital to measure things we can't do in the physical world. More and more of the experiences we believe in platforms like Roblox will be teleport-type ads where brands that we highlighted today want to bring fans to their experience even for a short amount of time to experience the brand, to possibly acquire items from the brand and to pop back out and come back to where you were.\n\nAnd these, of course, will be fully measurable as action type units once again measuring ultimately the time and the experience as well. There is an even longer-term thing that we're not going to comment on or promise. But ultimately, the ultimate long-term thing is we hear anecdotally about people who have been in our experiences, then migrating to the real world and wanting to go into that same store. We've heard that anecdotally around our Vans experience, where the ultimate would be to figure out a way to measure the players on Roblox connection to visiting that 3D experience and then visiting the real experience.\n\nAnd there's a lot of savvy people out there starting to think about how we might do that. So yes, this will be measurable. It's early. And I think there's potential for types of engagement that just cannot be done with video, that cannot be done with print.\n\nI'll kick it back to Mike for the other piece of it.\n\nMike Guthrie -- Chief Financial Officer\n\nHey, Clark. Your question on developers is a really interesting one. So we are seeing a dynamic with older users wherein they are monetizing very well in what I would call the top experiences on Roblox that may or may not be aged up experiences. However, we also see that same user base experimenting in other experiences that are much more aged up content.\n\nThey're not the most popular experiences right now on Roblox, but they're much more aged up experiences. And in those, the older users are spending quite a bit more. Now it's early, and it's on a smaller base, but that indicates to us that they -- that the older users have a really high affinity for aged up content. Our belief is, of course, that most of that aged up content is also coming from an aged up developer community.\n\nSo to answer your question, I don't know -- I don't have numbers specifically with the same level of precision on growth rates, but I suspect they're pretty similar and we're seeing more and more aged up content that's starting to break through. I think there's a long way to go there. And we'll try to pull together some metrics that we can share on that. But we definitely see that behavior with our older DAUs and time spent.\n\nThey are finding cool aged up experiences and they're very engaged, and they monetize very well in those experiences and those are going to get bumped up over time. And again, there's almost no doubt those are coming from an older developer base.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nYeah. And we don't -- I don't -- I think Roblox, long term, combines the best of long-tail discovery, young developer starting out as a hobbyist. On the high end, though, as our larger studios go beyond 100 people and are earning tens of millions of dollars a year, I think the top developers ultimately and very quickly mirror top game developers on any platform or experienced developers, we're seeing that mature very quickly.\n\nClark Lampen -- BTIG -- Analyst\n\nThank you.\n\nOperator\n\nYour next question is from the line of Eric Sheridan with Goldman Sachs. Please go ahead.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the questions. Sticking with the theme of aged up cohorts, do you see different behavior by geography in aged up cohorts? And I'm curious if you do, how that informs elements of what you want to invest in the infrastructure or the product development over the long term? And then even away from just geographic SKU among aged up cohorts, any sense of how you continue to think about partnerships on the content side and bringing more original content into the platform that can be consumed via partnership or licensing over time to sort of drive up higher forms of engagement as well? Thanks so much.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nYeah. I feel as if we're doing our job right, we are building high-performance immersive 3D infrastructure as the utility presents with amazing search and discovery and an amazing creator base. So just as with other forms of immersive media of which we're very immersive, but whether it's video, print or whatever, we're providing a high-performance platform in all regions of the world that our developer community can respond to more than we respond to technically. So we focus very much on what's latency in India.\n\nWe have a new data center in India. Do we have edge data centers around the world to provide high performance? Are we doing awesome search and discovery in South Korea or Japan or India to help drive growth there? And then what we can see is when we go to various regions around the world, a mix of what we would expect? Some classic Roblox experience top in many, many countries using our dynamic translation facility, but also regional experiences just as we would expect in various countries. I think this is what philosophically is driving our growth in Japan now, which is driving our growth in India right now, which is our awesome infrastructure, coupled with great, really content from our developers. From a partnership standpoint, our goal is to make this self-serve.\n\nOur goal is to make it so developers can couple with brands. And we're seeing more and more partnerships on the platform that we have not been involved with, which is exactly where we would ultimately want to get to which is the spontaneous partner ecosystem. And then kicking to Mike, if you want to add anything on the partnerships, Mike?\n\nMike Guthrie -- Chief Financial Officer\n\nNot on the partnerships, but your question on aged up, I just want to make sure I got it right. You're saying by geography, do we notice any different behavior with aged up users across the geos? Meaning does an aged up user and -- 17 to 24 year-old user in the U.S. behave differently than in Germany. Is that what you're asking?\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nYeah, that's part one. And if so, does that inform any elements of how you think about product development or platform development over the long term?\n\nMike Guthrie -- Chief Financial Officer\n\nYeah, I would -- so basically, by geography, what we're seeing is similar in each geo, meaning aged up users are now engaging at basically the same rates, if not even higher, in some cases, of younger users. They're monetizing now at higher rates than younger users, and that's pretty consistent around the world as we look at it. So they -- we're seeing the same kinds of dynamics within each geo. And if I were to say an aged up user in the U.S., the rate of monetization of an aged up user somewhere else in the world is about the same as it is with the younger user.\n\nSo it's pretty similar. But within a demo, aged up user is now pretty much the same frequency, pretty much the same amount of engagement and higher monetization.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nYeah. Maybe a philosophical way of thinking about this if we saw different behaviors with aged up people in Germany relative to the U.S., we would take a look at that and build platform infrastructure that supported both of those so that our developers could respond to the differences rather than us having to split the platform. So we're always trying to build a worldwide utility that works in all regions.\n\nMike Guthrie -- Chief Financial Officer\n\nOK. We have time for one more question, and then obviously, we're going to be available for the rest of the day. Operator?\n\nOperator\n\nThank you. Today's final question will come from the line of Mark -- one moment, will come from the line of Matthew Thornton with Truist Securities. Please go ahead.\n\nMatt Thornton -- Truist Securities -- Analyst\n\nHey. Good morning, David, and good morning, Mike. Maybe two, if I could. First, Mike, on expenses, as we think about 2023, I mean, should we go back and look at kind of what the opex-centric lines have done in terms of sequential dollar growth over the past four quarters and kind of extrapolate that forward? And similarly, should we look at kind of where we are right now, when you look at the two more variable type lines and again, kind of assume that we kind of hold there through next year.\n\nIs that a reasonable framework to thinking about the expense base and expense investments through 2023? And then just second question, more on just what you're seeing from a macro perspective. I'm just kind of curious, you guys have a global footprint. I'm kind of curious what you're seeing, if anything, in terms of any type of changing behavior as macros got a little more challenging, specifically in certain regions and perhaps certain demos? I'm kind of curious what you're seeing, if anything? Thanks, again, guys.\n\nMike Guthrie -- Chief Financial Officer\n\nMatt, on costs, I mean, again, let me just sort of point people to the supplemental materials. Looking at Pages nine through 12, those are the big cost items. Cost of revenue as a percentage of bookings or payment processing fees as a percent of bookings has generally been flat to down. And I think flat is a good way to model it.\n\nWe hope to see a little more efficiency. Prepaid cards have definitely helped us take that number down. And we are growing our prepaid card business. There's a lot of demand for it out there.\n\nIt's done incredibly well, and it's a really efficient channel for us. So that could help us lower that cost over the next few quarters in '23. Developer exchange fees have been running 22%, 23% of bookings. We're not looking for leverage in this area right now.\n\nSo I would suspect they will stay in this range throughout '23. And if they went up a point or two, we would be OK with that. But flat is probably a good way to estimate it. Personnel costs, exclusive of stock comp as a percentage of bookings, the last few quarters, this number has been going up as we have been hiring and investing.\n\nI think it will hold at around the 2Q, 3Q numbers for most of the year. While we are going to continue to hire, as Dave has mentioned, we're probably not quite at the same rate of hiring next year, but we're adding quite a few people into the company. But I think as a percentage of bookings, that number will be closer to what you see in Q2 and Q3. And in terms of infra, trust and safety, we made a really healthy investment here over the last three quarters.\n\nThere will be leverage in this number eventually. I wouldn't look for too much of it in '23. We're still making significant investments, but we're also -- with all of our teams pushing to make sure we're doing things in the most efficient way possible. So I think if you model it out in the last -- where the last couple of quarters have been, you're probably in pretty good shape.\n\nAs it relates to the macro, I'll start and have Dave make any other comments. We look a lot -- other than the fact that, obviously, currencies continue to move against the dollar, when we look underneath the currency changes around the world, we're seeing really healthy behavior. Users are growing around the world, hours of engagement are growing around the world. Our retention looks good.\n\nOur conversion rates look very good. Pure monetization around the world looks quite good when adjusted for those currencies. So I would say, we all know the macro environment is a little bit challenging. Where it is most pronounced for us is translation of currencies back into dollars.\n\nBut overall, the behavior of the user base seems fairly healthy. I wouldn't say we've seen anything significant. I don't know, David, do you have anything to add to that?\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nWe're going to wrap really quickly. I'm going to add two lightning bullets. One, if you rewatch our investor day, you'll see a wonderful presentation on how our infra ultimately is moving to active-active and there'll be amazing leverage there. We're right now doing a two to one infra build and as that gets to four to three and five to four, you'll see amazing cost savings there.\n\nI think long term, also, we pay all of our wonderful engineers and product people in U.S. dollars right now. So you'll see a long-term move from us just to make sure we're absolutely tightening up exchange rates in our platform when we collect Roblox as well around the world. But I'm feeling very positive about the macro trends that we see around the world on the platform.\n\nMike Guthrie -- Chief Financial Officer\n\nYeah. Just on the infrastructure spending since Dave brought it up, we'll spend a little over $300 million on PP&E this year. The lion's share of the big infra investment is done this year, although we'll spend another $300 million next year, there'll be a little bit of a shift. A little bit less of that will be on infrastructure and a little bit of incremental will be around real estate.\n\nSo we are still growing, we're moving into some new offices and so we have modeled in some investments in real estate. So overall, PP&E will be basically flat year over year but the amount that's around infrastructure will actually be down next year as we have taken most of that this year.\n\nMatt Thornton -- Truist Securities -- Analyst\n\nThat's great color. Thanks, Mike. Thanks, David. \n\nMike Guthrie -- Chief Financial Officer\n\nOK. Operator, I think we are ready to wrap up, Dave, any closing comments.\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nNo. Just once again, thank you to the Roblox community. All of our wonderful investors, we love working with you and appreciate your support.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nStefanie Notaney -- Director, Financial Communications\n\nDave Baszucki -- Co-Founder and Chief Executive Officer\n\nMike Guthrie -- Chief Financial Officer\n\nDavid Karnovsky -- JPMorgan Chase and Company -- Analyst\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nMatt Cost -- Morgan Stanley -- Analyst\n\nClark Lampen -- BTIG -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nMatt Thornton -- Truist Securities -- Analyst\n\nMore RBLX analysis\n\nAll earnings call transcripts"
}