{
  "companyName": "Kinder Morgan",
  "companyTicker": "KMI",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/19/kinder-morgan-kmi-q3-2022-earnings-call-transcript/",
  "content": "Kinder Morgan (KMI -0.39%)\nQ3 2022 Earnings Call\nOct 19, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to the quarterly earnings conference call. [Operator instructions] Today's call is being recorded. If you have any objections, please disconnect at this time. I'll now turn the call over to Rich Kinder, executive chairman of Kinder Morgan.\n\nRich Kinder -- Executive Chairman\n\nThank you, Ted. And before we begin, as we always do, I'd like to remind you that KMI's earnings release today and this call include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and the Securities Exchange Act of 1934, as well as certain non-GAAP financial measures. Before making any investment decisions, we strongly encourage you to read our full disclosures on forward-looking statements and use of non-GAAP financial measures that are set forth at the end of our earnings release, as well as review our latest filings with the SEC for important material assumptions, expectations and risk factors that may cause actual results to differ materially from those anticipated and described in such forward-looking statements. An analyst recently described Kinder Morgan as a capital-efficient business model leveraged to natural gas infrastructure growth.\n\nI largely agree with that assessment, although it omits our significant steps in our energy transition efforts, including renewable natural gas, renewable diesel and potentially carbon capture and sequestration. I spent the last several quarters on this call, describing that capital-efficient business model. And today, I want to spend a bit of time discussing natural gas infrastructure and the value of our existing infrastructure in today's environment. As we all know, it's become increasingly difficult to build new greenfield pipeline projects, particularly in the Northeast and other areas outside the U.S.\n\nGulf Coast. While this situation is, in my opinion, unfortunate and poor public policy, it does make existing infrastructure even more valuable. I don't think that value is fully recognized by the equity markets. The difficulty in building new pipeline and ancillary facilities widens the moat to use long bucket sprays around existing assets at a company like KMI.\n\nThat's an obvious source of additional value. But beyond that, having such an extensive network already in place affords great opportunity for a company like ours to extend and expand our assets on an incremental basis without the Herculean task of permitting and building a new greenfield project. Those step-out projects can provide great service to our customers and yield a very good return for our shareholders. We're fortunate at KMI that a large portion of our network is in Texas and Louisiana, states that understand and appreciate the need for new energy infrastructure and where so much of the demand for additional throughput, particularly natural gas, is located.\n\nLet me be more specific. The demand for natural gas in those states is projected to grow enormously over the rest of this decade. That growth is driven by a number of end users but let me just focus on LNG export facilities. Year-to-date, in 2022, LNG is consuming over 11 Bcf a day and that number incorporates the absence of roughly two Bcf a day of demand from the Freeport facility, which has been shut down since June.\n\nAccording to the S&P Global LNG forecast, that number is predicted to grow to 22 Bcf a day by 2027 as new facilities come online. That's virtually doubling the current demand, which has already grown by 400% in the last five years. We project that after '27, LNG demand will continue to grow and expected to be 28 Bcf a day by 2030. Given the situation in Europe today, which will result in more long-term contracts and the continuing usage in Asia, this hyper-growth scenario actually seems pretty reasonable to me.\n\nThat's a huge increase, and most of it will occur in Texas and Louisiana, where so much of our asset base is located. That is what we, in the pipeline business call demand pool, which in many respects is more valuable than supply push. As you know, we currently move about 50% of all the gas consumed by LNG facilities, and we expect to maintain or expand that share in the future. To serve our customers, both producers and end users, we are continuously expanding our system on an incremental basis to accommodate the growth we expect.\n\nJust a couple of examples of that effort include the expansion of our PHP system that connects the Permian basin, the Gulf Coast and the building of the Evangeline Pass system to serve the venture capital LNG facility in Plaquemine, Paris, Louisiana, and we expect to announce additional projects in the coming months. When you add the increasing need for natural gas for industrial uses, electric generation and exports to Mexico to that massive LNG demand, the result is an enormous opportunity to grow our system in a capital-efficient manner, which in turn will grow the value of our company. Steve?\n\nSteve Kean -- Chief Executive Officer\n\nYes. Thanks, Rich. We are having a good year. We are projecting to be nicely above plan for the year and substantially better year over year Q3 to Q3, as Kim and David will show you.\n\nSome of the outperformance is commodity price tailwinds, but we're also up on commercial and operational performance. Just a couple of highlights. Our capacity sales and renewals in our gas business are strong. Gathering and processing is also up versus plan and up year over year.\n\nExisting capacity is growing in value on our natural gas network. And we're seeing it across our network on our major interstate systems and on our Texas intrastate system and we are seeing it in both storage and transportation service offerings, and we're even seeing it on a previously challenged system, the Midcontinent Express Pipeline. In CO2, SACROC production is well above plan. And of course, we are benefiting from higher commodity prices in this segment, though prices are not as elevated as they were when we talked after Q2.\n\nWe are facing cost headwinds, mostly because of added work this year. But while costs are up, we're actually doing very well in holding back the impacts of inflation. It's hard to measure precisely but based on our analysis of what we can reliably track, we are well below the headline PPI numbers that you're seeing. Actually, we appear to be experiencing about half of that increase.\n\nMuch good work by our procurement and operations teams and much of this good performance is attributable to our culture. We are frugal with our investors' money. Looking ahead, we are seeing good opportunities across our network and in gas, in particular, Rich emphasized LNG, and that is clearly the biggest long-term opportunity and our network is especially well positioned. I'll give you an illustration of that.\n\nWe currently have 5.7 Bcf a day under long-term contracts serving existing LNG facilities. The associated investment for that 5.7 Bcf was $1.3 billion. That is very capital-efficient expansion of our network. There are other opportunities as well.\n\nWe have identified and talked to customers on our Texas Intrastate system about over a Bcf a day each of power plant, industrial and utility expansions. Of course, not all that's going to happen, but it shows the level of economic activity in one of our biggest natural gas markets. We now have a backlog of $2.7 billion of projects, that's up $600 million on a net basis since last quarter, meaning taking into account the projects that rolled into service over the quarter and almost 80% of that backlog is in low-carbon investments, natural gas, energy transition ventures and renewable diesel and renewable feedstocks projects in our products and terminals businesses. On energy transition Ventures, we expect with what we have already acquired and with the projects under construction or development right now to invest about $1.2 billion at an EBITDA multiple of a little over five times when everything is up and running.\n\nI'll add that while we have experienced some delay and modest cost increases in this business, the returns are very good and the EBITDA multiple is strong. We also closed on the sale of an interest in our Elba Liquefaction facility during the quarter. The implied enterprise value to EBITDA multiple of the sale was approximately 13 times. And so, to think about in terms of use of proceeds, that can pay us very favorably to our expansion project multiple of 5.5 times in aggregate over the last three years, as well as through our share price multiple.\n\nAgain, we're having a very good year, and we are setting our business up well for the future. Our balance sheet is strong. We are seeing good value, particularly in natural gas and renewables. We are finding and executing on projects with attractive returns, and we are returning value to shareholders.\n\nAnd I'll turn it over to Kim.\n\nKim Dang -- President\n\nOK. Thanks, Steve. Starting with the Natural Gas business segment. Transport volumes were roughly flat for the quarter versus the second quarter '21, and we saw increased volumes from power demand, and that was offset by reduced volumes to Mexico as a result of third-party pipeline capacity added to the market.\n\nThe pipeline outage on EPNG, the Freeport LNG outage and continued decline in Rockies production. If you adjusted our volumes for the EPNG and Freeport outages, which are temporary in nature, we estimate volumes would have been up about 4%. Deliveries to LNG facilities off our pipe averaged about 5.2 million dekatherms per day. That's about 1% higher than the third quarter of '21, but it's lower than the second quarter of this year.\n\nAgain, that's due to the Freeport LNG outage. Deliveries to power plants were robust in the quarter, they were up about 11%, driven by record summer power demand, that's 880 million dekatherms per day of incremental gas moving to power plants. It's pretty incredible. Our natural gas gathering volumes were up about 13% in the quarter compared to the third quarter of '21 and that was driven by the Haynesville volumes, which were up about 70%.\n\nSequentially, volumes are up 6% with big increases in the Bakken, up 14%, Haynesville, 8%, and Eagle Ford, up 7%. Overall, our natural gas gathering volumes were budgeted to increase about 10% for the full year and we're currently on track for about 13%. Overall demand for natural gas is very strong, as both Rich and Steve mentioned, driving the demand for our transport and storage services, and we expect that demand to continue to grow. To add on to what Rich and Steve said, our fundamentals group estimates natural gas demand to grow from roughly 100 Bcf a day market currently to approaching 130 Bcf market by 2031.\n\nSo the world needs a reliable supplier of natural gas and the United States is positioned to be that supplier. According to the EIA, we have 80-plus years of recoverable reserves. And from an environmental perspective, the U.S. is one of the lowest emission producers in the world.\n\nOn the products segment, refined products volumes were down about 2% in the quarter versus the third quarter of '21, slightly outperforming EIA, which was down 3%. Gasoline and diesel were down 3% and 5%, respectively. But we did see an 11% increase in jet fuel demand. For October, we started the month a little bit stronger than the Q3 results.\n\nOn crude and condensate, volumes were down about 5% in the quarter. Sequentially, they were down 2% with a reduction in the Eagle Ford more than offsetting an increase in the Bakken. On the Terminals business segment, our liquids lease percentage remains high at 91%. If you exclude tanks out of service for required inspection, so that lease percentage is roughly 95%.\n\nLiquids throughput, which does not drive current results, but it's an indicator of our ability to renew contracts in the future was up about 7%, driven by gasoline, diesel and renewable volumes, which comprise over 85% of our liquid volume. We continue to experience some weakness in the New York Harbor and our tankers business was hurt in the quarter by lower average rates, but that business has continued to improve. We currently have all 16 vessels sailing under firm contracts with average remaining terms of over five years. For '23, we have approximately 90% of the vessel days under firm charter.\n\nAnd if you look at the shipper contractual options likely to be exercised, it's 100% at average rates that are higher than 2022. We've also seen interest in chartering vessels several years out. On the bulk side, overall volumes were flat. Petcoke and steel were up nicely, but that was off -- I mean, petcoke and coal were up nicely, but that was offset by lower steel, but from a margin perspective, the higher petcoking coal substantially offset the lower steel.\n\nCO2 segment, metal production in the quarter was up 7% versus our budget. For the full year, we're expecting oil production to be about 4% above our budget, CO2 volumes to be about 8% of our budget and price to exceed our budget. These positives are partially offset by higher operating expenses, not due to a combination of higher activity level/production and inflation. For Q3 versus Q3 '21, crude production was down about 3%.\n\nCO2 sales volumes were down 11%, and that was driven by the expiration of a carried interest in a project. NGL volumes were up 1% and prices were higher across the board. Overall, we had a very good quarter. DCF per share was up 7% versus our plan and up 8% year-to-date.\n\nWe currently project that we will exceed our full year guidance on DCF per share and EBITDA by 4% to 5%. Timing on sustaining capex into the fourth quarter out of the second and third is the primary driver of the DCF difference between the year-to-date performance and the expected full year performance. As we progress through the year, we're seeing more high-return expansion opportunities, in the quarter, as Steve said, our backlog increased about $600 million. And as a result, going forward, we'd expect to be in the middle of our $1 billion to $2 billion range or maybe to the higher end.\n\nAnd with that, I'll turn it over to David Michels.\n\nDavid Michels -- Chief Financial Officer\n\nThank you, Tim. So for the third quarter of 2022, we are declaring a dividend of $0.2775 per share, which is $1.11 annualized and 3% up from our 2021 dividend. One highlight before I start on the financial performance. We continue to take advantage of our low stock price by repurchasing shares this past quarter.\n\nWe added over $90 million of repurchases to what we reported last quarter. And so, year-to-date, we have now repurchased approximately 21.7 million shares at an average price of $16.94 per share. We believe those share repurchases are going to generate an attractive return for our shareholders. Our savings from the current dividend alone without regard to the terminal value or dividend growth is 6.6%.\n\nFor the financial performance for the quarter, we generated revenue of $5.2 billion, up $1.35 billion from the third quarter of 2021. The associated cost of sales also increased by $1.16 billion. So combining those two, our gross margin was $195 million higher. Our net income was $576 million up 16% from $495 million in the third quarter of last year.\n\nOur adjusted earnings, which excludes certain items was up 14% compared to the third quarter of last year. On a distributable cash flow basis, our performance was also very strong. Natural gas -- the natural gas segment was up $69 million with greater volumes on our KinderHawk system, Haynesville, higher recontracting rates on MEP, NGPL and SNG, greater contributions from our Texas Intrastate systems and favorable commodity prices impacting Altamont in Altamont and Copano, South Texas. Our product segment was down $23 million, driven by a decline in commodity prices impacting our inventory values, lower crude volumes on our HH system, as well as higher integrity costs partially offset by higher rate escalations year over year.\n\nOur Terminal segment was up $7 million with -- as Kim mentioned, greater coal and petcoke volumes partially offset by lower contributions from our New York Harbor and Houston Ship Channel liquids terminals versus the third quarter of last year. Our CO2 segment was up $41 million, driven mostly by favorable commodity prices. So our EBITDA of $1.773 billion was up 7% from last year, and our DCF was $1.122 billion, our DCF per share was $0.49, both 11% above last year. For the full year, as Kim mentioned, we expect to be 4% to 5% above our budget.\n\nAnd for the quarter, DCF was ahead of budget by 6.5%. Some of that is due to a shift of sustaining capital into the fourth quarter. And as a reminder, at our Investor Day presentation in January, we said about 22% of our DCF would come in the third quarter of this year. If you apply that 22% to our budgeted DCF increased by 5%, which is what we guided you to last quarter, you will see that we exceeded that expectation this quarter.\n\nSo a helpful reminder that we provide useful information on quarterly shaping at our Investor Day. Moving on to the balance sheet. We ended the third quarter with $31.2 billion of net debt and a net debt to adjusted EBITDA ratio of 4.2 times. That's up from 3.9 times at the year-end as the nonrecurring EBITDA contribution from the Winter Storm Uri in February 2021, it was captured in that year-end ratio.\n\nThe year-end ratio was 4.6 times, excluding Uri EBITDA contribution. So we ended this quarter nicely favorable to the year-end metric excluding Uri. Our net debt decreased to $10 million or has decreased to $10 million year-to-date. So I'll go through a high-level reconciliation of that.\n\nWe've generated year-to-date DCF of $3.75 billion. We've paid dividends of $1.83 billion. We've contributed or repaid growth capital and contributed to joint ventures $700 million. We had $225 million of increased restricted deposits, which is mostly due to cash posted for margin related to our hedging activity.\n\nWe've repurchased $331 million of stock through the third quarter end. We've had about $500 million of acquisitions, and that's sort of the two renewable natural gas companies. We received approximately $560 million from the sale of our interest in Elba Liquefaction company and we've had about $750 million of working capital use, which is primarily interest expense payments and some other legal and rate settlements. And that gets you close to the reconciliation for year-to-date change in net debt.\n\nSo that completes the financial overview, and I'll turn it back to Steve.\n\nSteve Kean -- Chief Executive Officer\n\nAll right. Ted, let's go ahead and open up the channel for questions here and I'll just remind everybody, limit yourself to one question and a follow-up. And then, if you've got more, get back in the queue, and we will get to you and get your questions answered. And also, we have a good chunk of our management team sitting around the table here today, and I'll make sure that you hear from them on questions about their businesses.\n\nAll right. Ted, with that, let's take the first question.\n\nOperator\n\n[Operator instructions] First question in the queue is from Chase Mulvehill, Bank of America. Your line is now open.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good afternoon, everybody. I guess first thing I wanted to hit on is just kind of Permian residue gas egress. And you've got EPNG outage today.\n\nAnd I guess, maybe could you talk about the timing and how much incremental throughput you would see out of Line 2000 of basically EPNG system, which Line 2000 is back up and running.\n\nSteve Kean -- Chief Executive Officer\n\nOK. Tom Martin?\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nYes. So given the nature of that outage, we can't say too much in detail. But just in general, we see somewhere between 500,000 and 700,000 a day of incremental volumes flowing west when that line is back in service.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. Perfect. And unrelated follow-up. I know it's a little early to talk 2023.\n\nI know you're not going to give us exact numbers or anything, but maybe just some puts and takes as you see the overall business as we kind of look out to 2023?\n\nSteve Kean -- Chief Executive Officer\n\nYes. It is too early. We're just in the middle of our annual budget process. And so, as we always do, we'll give you an update when we've got that information complete.\n\nBut I mean, I think it's the things that we've talked about here today. We've got some nice tailwinds. Who knows what commodity prices are going to look like next year. But we have some nice tailwinds in our Natural Gas business and a good backlog of projects and good project opportunities.\n\nAnd so, those are the pluses. On the minuses. We don't know what's going to happen with interest rates, but we do have about $7.5 billion of floating rate debt, and we have some renewals or some refinancing on about $3.2 billion, which is actually our highest year next year. We don't see another year above $2.1 billion after that.\n\nAnd so, those are some of the big puts and takes.\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nOK. Perfect. I'll turn it back over. Thanks, Steve.\n\nOperator\n\nNext question is from Jeremy Tonet with J.P. Morgan. Your line is now open.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nHi. Good afternoon.\n\nSteve Kean -- Chief Executive Officer\n\nGood afternoon.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nCapital allocation is a big debate point in the market are focused, if you will. And just wondering if you could update us as how you see your capital allocation philosophy these days. On the one hand, there's a case to be made for repurchases, saw some in the quarter. But how do you weigh, I guess, maybe ramping up the pace of buybacks there relative to the other opportunities you have, especially with regards to RNG consolidation or other energy transition growth capex opportunities as you laid out there?\n\nSteve Kean -- Chief Executive Officer\n\nYes. We look at all of those things. And of course, we're kind of a broken record on this, but the first in the order of operations, making sure we've got a strong balance sheet, we do. And our metrics are proving to be stronger than the long term approximately 4.5x.\n\nAnd so, we're in good shape there. As David said, at the beginning of the year in the investor conference, having a little extra capacity is a good thing, including for equity investors because it positions you well against the -- for the pluses and also against the minuses. Then from there, we want to invest in attractive returning high NPV projects well above our cost of capital that we're confident we can execute on well. And so, that goes to what you see has happened in our backlog and the opportunities that Kim alluded to.\n\nAnd then, from there, it's returning value to shareholders, and that's a combination of a growing but well-covered dividend. So we're up 3% of the dividend year over year, as David mentioned, and then opportunistic share repurchases, which we've done a significant amount of this year. And so, that's kind of the order of operations for how we think about capital allocation and all of it, keeping in mind bringing value to our investors.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. Very helpful. And just want to circle up with Elba real quick. Just wondering, could Elba be expanded? And might you look to monetize more of that or similar assets in the future?\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nSo yes, it can be expanded, and we are going through the evaluation process now, very early days looking at potentially a little over 5 million MTPA -- five MTPA opportunity there. But again, very early days to know whether that will work, but we do have the space for it. And that would be synergistic with the existing tankage and dock usage there. And as far as selling incremental interest there, I mean, that would be on the existing cash flows, really, any expansion opportunity would be separate and apart from that.\n\nSteve Kean -- Chief Executive Officer\n\nYes. And to be clear, I mean we like our position in Elba, where we got a very, very nice -- we made several very good deals at attractive multiples and actually have pulled in more proceeds than we've invested in the facility, and we still own 25% of it and the expansion opportunity that Tom is referring to is outside of the JV. And so, if we are able to -- and we're not -- it's not in our backlog, we're not projecting that for you today, but we are examining the opportunity to do an expansion, which would be to our account.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. Thank you very much.\n\nOperator\n\nThe next question is from Marc Solecitto with Barclays. Your line is open.\n\nMarc Solecitto -- Barclays -- Analyst\n\nHi. Good afternoon. So maybe just to start on the guidance language, you referenced trending 4% to 5% above budget for EBITDA. You obviously announced the Elba transaction, strip has come down a bit.\n\nBut I wonder if you could talk about any other drivers around the subtle change in the language from last quarter.\n\nDavid Michels -- Chief Financial Officer\n\nYes. Since the last quarter, we've seen significant outperformance in the gas group. We've got lower sustaining capex. On the other hand, as you noted, commodity prices have decreased.\n\nWe've seen lower volumes in the Bakken is -- primarily because it took longer for them to recover from an April storm than we anticipated, lower refined products volumes and higher interest.\n\nMarc Solecitto -- Barclays -- Analyst\n\nGot it. That's helpful. And then, in the event of a potential product export ban, I wonder if you could just talk about how your assets would be positioned in that scenario, particularly thinking about storage, product pipes and the Jones Act tankers business?\n\nSteve Kean -- Chief Executive Officer\n\nYes. But we'll start with terminals and ask products the way too. John?\n\nJohn Schlosser -- President, Terminals of the Kinder Morgan, Inc.\n\nFrom a terminaling standpoint, we think it will be neutral for us. And on the negative side, we'll see a decrease at our export docks. And we handle about 50 vessels a month there at about 43,000. So it's roughly $2 million each month we'll see degradation on.\n\nBut on the positive side, you'll see an increase in Jones Act volumes. You'll see an increase in volumes of the Colonial and Explorer pipelines, which were the largest origin point. And you'll see a spike in my opinion, in the price of storage, both in there and in New York Harbor.\n\nSteve Kean -- Chief Executive Officer\n\nAnd Dax from a products pipeline.\n\nDax Sanders -- Executive Vice President and Chief Strategy Officer\n\nYes, for us, it's probably neutral to positive. I think the West Coast is probably reasonably neutral. But if you look at the Southeast and you've got products that back up in PADD 3 and you've got to clear that out of there. We certainly have capacity on product Southeast pipeline.\n\nAnd I would expect that the products would move on that, particularly if Colonial moves in or continues to stay in allocation. We clearly have storage position in the Southeast that I think to John's point would benefit as well. And then, probably a little bit less important, but on CFPL I think that some of the imports that you're seeing coming into Port Canaveral that get trucked into Central Florida would probably get backed off, and we could see some benefit on CFPL as well.\n\nSteve Kean -- Chief Executive Officer\n\nAnd Marc, just to comment on probability here. I mean, I think that -- and some of you have written about this, it won't have the desired effect, right? It's not going to improve things at the pump for U.S. consumers. This is a global and integrated market.\n\nAnd as a consequence, we think that as it's thought through more, it becomes less and less likely to happen.\n\nDax Sanders -- Executive Vice President and Chief Strategy Officer\n\nGot it. That's very helpful. Appreciate the time.\n\nOperator\n\nNext question is from Neal Dingmann with Truist Securities. Your line is now open.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGood afternoon, guys. Could you talk -- you mentioned on CCS, and I'm just wondering maybe in broad stroke, can you talk about the type of opportunities you may be seeing near term or the magnitude of that? Obviously, I think you guys have a lot of things going on. I'm just wondering what you can talk about. Maybe any details.\n\nSteve Kean -- Chief Executive Officer\n\nYes. I'll start and ask Anthony to -- Anthony Ashley, who runs that group, to weight in. But I think, look, the -- out of the IRA, the Inflation Reduction Act, there was an increase in the 45Q credit, which is a refundable credit and that increase in the credit has made more sources of CO2 economic for capture. So picking up things like ammonia plants.\n\nSo we started with kind of processing plants and ethanol plants. Now, it's picking up things like ammonia plants, cement, some coal plants and some natural gas plants. And so, we had active discussions going on that kind of pause while we were seeing how that worked out. And then, those discussions started picking up.\n\nAnthony?\n\nAnthony Ashley -- Vice President and Treasurer\n\nYes. As Steve mentioned, definitely seen increased activity since the IRA passed, I would say. Our focus areas have been around our existing footprints in West Texas that seem to be off of gas processing plants, which are a little bit smaller opportunities. I would say those are probably the most likely near-term opportunities that happen in the space.\n\nBut we are having much larger conversations around the U.S., especially around the bigger emissions areas, but those will take a little bit longer to develop and to be able to discuss with you guys.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGot it, guys. Great details. And then, just one follow-up. I don't know if you could say anything, just what do you say currently with -- you mentioned the downtime of the volumes associated around Freeport, and I just didn't know if there's any update you could say what's going on there?\n\nSteve Kean -- Chief Executive Officer\n\nWe don't have anything other than what you can find out in reading in public and from the company itself.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGot it. OK. Thank you all.\n\nOperator\n\nNext question is from Keith Stanley with Wolfe Research. Your line is open.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nHi. Thank you. I wanted to start on RNG. Just curious if you have any takeaways from the BP, Archaea deal and I guess how you're thinking about the competitive landscape over the long run? And relatedly, are you open to a larger platform deal like this? Or is it pretty clear you're going to focus more on organic development there?\n\nSteve Kean -- Chief Executive Officer\n\nBP is best to speak on the deal and the prices where they're getting synergies and other sources of value, but just on a bare kind of EBITDA multiple basis without taking into account those other things that they bring to the table. It's a very attractive valuation and well above that $1.2 billion that identified earlier that based on our investments, our acquisitions and the things that we're doing. I would say that the focus here is less on M&A at this point. We have a nice platform there, but we continue to have active discussions that are more organic growth.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nSecond question just on interest rates. So the higher rates, if they're sustained over time, does that make you rethink the leverage target at all? Or is it more kind of what you alluded to on maybe keeping a little financial cushion. And then, I guess related to that, just -- I believe in the past, you've hedged some of your variable rate exposure heading into the current year. Have you done any of that to date? I think you had done that for this year for a fair amount of it.\n\nDavid Michels -- Chief Financial Officer\n\nSo heading into this year, we hedged about $7.5 billion of the -- $5.1 billion -- of the $7 billion of the swaps. So that is going to roll off in '23. So we'll have $7.5 billion of floating in '23 and we have not hedged any going into next year. And right now, we don't think that's a good opportunity to be able to hedge that.\n\nIn terms of our policy on floating, the reason that we have the policy on floating is because we've looked over long periods of time, and it looks like that the forward curve over predicts where floating rate debt is going to trade. And so, we want to take advantage of that. And so, that means that some years, we're not going to -- we're going to pay more. In some years, we're going to pay less, and we're going to pay less for more dollars, right? So it ends up being a net present value positive trade for us, and so I don't think -- that's not -- our policy is not going to change because in one year, we have to pay higher interest rates.\n\nSteve Kean -- Chief Executive Officer\n\nAnd as you know, Keith, it's worked very well for us over the years. So over the long term, the approach has been proven value creative.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nYes, it has. Just on the leverage target, too, like you're -- there's no -- I mean, it seems like this is going to fluctuate and the leverage target, you're still very comfortable with the four and a half, where things are today.\n\nSteve Kean -- Chief Executive Officer\n\nYes. Yes, we are. Now, as we said and as David said at the beginning of the year, we're targeting to be better than that. And we do think that there is value in having that capacity to take advantage of share repurchases, potential for projects, potential for asset acquisitions, that sort of thing.\n\nSo we have trended a little lower. We're lower right now, yes.\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nThank you very much.\n\nOperator\n\nNext question is from Jean Ann Salisbury with Bernstein. Your line is now open.\n\nJean Ann Salisbury -- AllianceBernstein -- Analyst\n\nHi. Two more questions about Permian gas takeaway. So late 2023 is the target start date for the Permian Highway expansion. Given that there might be demand for that earlier than that, I was wondering if that's like the kind of project that could be brought on gradually, like you had a compressor that adds 100, for example, and you just sort of gradually do that earlier to late 2023?\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nWe will just have to see how we get into the year if that's possible to do. Certainly see the same need in the marketplace that you do, and we'll look to do that if we can, but nothing that we can really speak to with a certainty today.\n\nJean Ann Salisbury -- AllianceBernstein -- Analyst\n\nOK. That's helpful. And then, relatedly, I was just wondering if there's any update on the GCX expansion open season or if we should sort of consider that not -- maybe not in this upcoming round?\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nYes, nothing really new to report there, continuing to market it. As we've talked about in the past, the fuel is sort of the issue in the marketplace at these higher gas prices, but as prices come down, there could be some opportunities there, but nothing really new to speak to right now.\n\nJean Ann Salisbury -- AllianceBernstein -- Analyst\n\nOK, great. That's all for me, thanks.\n\nOperator\n\nNext question is from Brian Reynolds with UBS. Your line is open.\n\nBrian Reynolds -- UBS -- Analyst\n\nHi. Thanks for taking my question, everyone. Maybe just a quick follow-up on the capital allocation question. There are significant debt maturities coming due in '23.\n\nSo I was just curious, as you think about the leverage target and just rising rates and the ability to perhaps refinance at lower rates in the future. Kind of curious if you can talk about how you're thinking about refinancing that debt and perhaps using some of the liquidity over the near term and some of the free cash flow to refinance that over the near term in the hope of better rates in the back of '23.\n\nDavid Michels -- Chief Financial Officer\n\nYes. Brian, we'll have a lot more information at the Investor Day. Having just -- having completed our budget yet, we've just really just begun our budgeting process. And so, we don't have a lot of detail to provide to you.\n\nBut I guess just generally speaking, interest rates are much higher now than they have been in the recent past and have been for many years. And so, I think we're going to take a patient approach toward locking in rates at these levels. We have the $4 billion of revolver capacity right now that's available to us. We're sitting on a healthy amount of cash.\n\nIn addition, so we have flexibility, and we'll be patient.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. Appreciate that. And thanks for the color on the expected nat gas demand growth of both local and LNG exports in the prepared remarks. I was just curious if you could talk about Kinder's positioning to support that 16 Bs of nat gas demand growth over the next seven years.\n\nThat type of growth implies a lot of capex spend along the nat gas value chain. And just given your previous remarks around trying to maintain that 50% market share for LNG, was kind of curious if you could talk about areas of opportunity for future growth around the Permian, Haynesville and Northeast to supply -- Northeast to supply that 16 Bs of growth over the next, call it, seven years?\n\nSteve Kean -- Chief Executive Officer\n\nTom?\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nYes. So I mean, clearly, our -- as discussed in the earlier remarks, our proximity to the Texas Louisiana Gulf goes from many of our assets, whether it be the Texas Intrastate, Tennessee Gas Pipeline, NGPL and others, Kinder Morgan Louisiana. We're in a really great position to expand and extend our network in support of LNG growth and also grow with the Haynesville and the Permian as those volumes grow as well. And I mean the Eagle Ford is another nice -- lean Eagle Ford is a nice -- another nice opportunity for us to support Texas, Louisiana markets as well.\n\nYou mentioned the Marcellus/Utica, a lot -- a great resource base, a lot harder to get incremental volumes to the Gulf Coast there. So I think what the market will see is Haynesville growing really concurrently with, if not sooner, than the incremental Permian and the Eagle Ford largely supplying the next wave of projects across Texas, Louisiana, and we think we're in a great position to maintaining our 50% or even exceed that as we go forward.\n\nSteve Kean -- Chief Executive Officer\n\nAnd look, I think I tried to illustrate the proximity of our network to these outlets, right, to the liquefaction facilities and the capital-efficient nature of the expansions we can do of that network by talking about the 5.7 Bcf that's under a long-term contract, there's more than that that's flowing on our systems, really more like seven Bcf. But that 5.7 Bcf that's under contract. The capacity was created with about $1.3 billion of investment. And as we look ahead, look, there could absolutely be chunkier projects, right, bigger builds as you get to the 28 Bcf that Rich mentioned.\n\nThere could be some bigger ones, but there's also a fair number of $150 million to $300 million projects, call it, roughly that are not ready for prime time. But as we look at people who have not yet FID-ed but may, and we look at where they are sitting on our network, we think we can reach them and with expanded quantities with relatively capital-efficient investments.\n\nBrian Reynolds -- UBS -- Analyst\n\nGreat. That's super helpful. Enjoy the rest of your evening, everyone.\n\nOperator\n\nNext question is from Michael Lapides with Goldman Sachs. Your line is now open.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nHey, guys. Thank you for taking my question. I actually had two up. First of all, given the volatility in Southern California gas prices, is there any future opportunity to expand EPNG once the outage is done.\n\nThat's the first question. Second question is probably one for David. Working capital has been a negative cash drag this year, a little over $500 million. Should we assume that's just kind of temporary and it reverses? Or is this something left over from kind of the muddiness from the first quarter of 2021? Just curious the thoughts on the cash flow impact there.\n\nSteve Kean -- Chief Executive Officer\n\nTommy, start with PNG.\n\nDavid Michels -- Chief Financial Officer\n\nYes. So EPNG, certainly, we continue to look at those opportunities. I think the challenge is getting the proper term on incremental projects that it would take to support capital out there. We have been looking at storage opportunities in Arizona continue to look at that.\n\nI think really, the volatility largely revolves around supporting power demand, which I think high deliverability storage is a better solution there. But we're looking at all of that. Again, I think it's about can we get contracts for the right term to support that kind of capital.\n\nSteve Kean -- Chief Executive Officer\n\nDavid?\n\nDavid Michels -- Chief Financial Officer\n\nAnd on the working capital use, we had had a high amount of working capital use of our cash year-to-date. Some of that is going to turn around. The interest expense payments are generally heavier in the first and the third quarters, the second and fourth, you see that turn around a little bit. So for the full year, I'd expect that piece to turn around a bit.\n\nWe've also had a legal settlement and a rate settlement this year, which were unique to 2022. So I wouldn't see those as recurring items. Finally, we had some cash margin, which I called out in my reconciliation earlier on the call. Margin calls on our hedging activity, and that's driven by commodity price fluctuations.\n\nCould turn around, but it depends on commodity prices.\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nGot it. Thank you, David. Thanks, guys. Much appreciated.\n\nOperator\n\nNext question is from Michael Cusimano with Pickering Energy Partners. Your line is now open.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nHi. Good afternoon, everyone. To quickly follow on to, I think it was Keith's question earlier, on RNG. Could you maybe speculate on the value attributed to KMI versus what the Archaea valuation was and how you feel about the options or -- curious how you feel about the option you mentioned earlier about maybe like a separate public vehicle down the road?\n\nSteve Kean -- Chief Executive Officer\n\nYes. So I mean, look, as I try I'm not commenting on BP's economics, OK? They have a lot that they bring to the table across their portfolio, their user of RINs. There's a whole bunch of things going on there. So my comment earlier was about really just focusing on the EBITDA and what that multiple looks like in, call it, middle decade.\n\nAnd if you apply that multiple tars, it's a couple of times at least what we have invested in this business or expect to invest when all those facilities are up and running. And so, -- and that's probably appropriate, right? It's a growing business and a growing opportunity. It's why we're in it. And we think we'll do well with it.\n\nIs there an opportunity to monetize at some point in the future when you reach critical mass? Yes, but we also like the business. And so, we'd have to compare those alternatives when we get there.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nGot it. That's helpful. And then, on the product segment, can you give a little extra detail on the lower crude volumes maybe where it stands today, if those have fully recovered from the weather outage? And then also, if you can talk a little bit about how like lower refined product prices affected margins. Trying to think of like what's structural and what's variable to this quarter?\n\nDax Sanders -- Executive Vice President and Chief Strategy Officer\n\nYes. So the biggest driver in crude for the quarter was on HH volumes. So on HH, they were down roughly 26% year over year. And the biggest driver on that is some of the Canadian upgraders are down, which has had, I think, PADD 2 refiners paying a pretty good premium for Bakken barrels, which has decreased the decrease the basis differential to both Guernsey and Cushing, which has had an impact on that.\n\nAnd so, hopefully, we'll see that as the upgraders come back, that we'll start to see a little bit of that basis come back and some additional barrels come on HH. Hiland Crude, to your point, has -- or to Steve's point, has come back from the winter storms in April. We're reasonably close to flat for the prior year, a little bit less than what we had hoped in our budget. We budgeted for 186 wells.\n\nRight now, we're forecasting about 154, but a good chunk of those are coming in, in the fourth quarter. And we're seeing some improvements on Hiland Crude in the fourth quarter, and we're looking at hopefully somewhere in the neighborhood of going from kind of, call it, flat to prior year to, call it, 7% above for Hiland Crude. So we're hoping to -- right now, we're seeing some improvements in the fourth quarter.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nOK. Great. And then, any comment on the refined product pricing maybe impacting margins and how to think about that going forward? I guess it's mostly on like the transmix business.\n\nDavid Michels -- Chief Financial Officer\n\nAre you asking about retail prices impacting demand on refined products? Or you're asking about -- what did you ask? We don't understand.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nSpecifically about any variability in your margin that you receive from maybe transmix volumes that fluctuate with refined product commodity prices?\n\nDax Sanders -- Executive Vice President and Chief Strategy Officer\n\nYes. Well, what I'd say is we had -- to David's point, we had -- we took a low comp adjustment for closing price as of September, the way that works. Clearly, we can't -- with a low comp adjustment, we can't write it back up. But as we cycle inventory at higher prices, we can move it through and it works through margin.\n\nAnd right now, where prices are, they're higher than where we marked from a LOCOM perspective. So I don't have a specific number on that, but generally speaking, they're high, and you would expect as that inventory cycles through that that would be a positive.\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nGot it. All right. That's all for me. That was helpful.\n\nAppreciate it.\n\nOperator\n\nNext question is from Jeremy Tonet with J.P. Morgan. Your line is open.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nHi. Thanks for squeezing me back in real quick. Just want to see, after Matterhorn, what your thoughts are on cadence of Permian gas production and the need for incremental infrastructure, what type -- what year do you think that might materialize at that point?\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nSay that again. Permian, incremental Permian takeaway?\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nYes.\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nSo it's very fluid. I mean I think the fundamentals would say later in the decade, but I think some of our customers based on their destination desires may say sooner than that. So I think sometime between '25, '26 at the earliest, but I think the fundamentals may say potentially even a little bit later.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nSo a range of like '25 to '28. Is that what you're thinking about kind of bookending it, just to make sure I understand it correct?\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nYes. Yes. You got it.\n\nSteve Kean -- Chief Executive Officer\n\nThat's for a big new long haul.\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nYes. I mean I think expansions can still be supported along the way but for a big greenfield project. I think that's kind of the timeline.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nGot it. And just last one real quick. Elba, great price tag there. Do you see other bids like that in the marketplace right now? Just wondering how you see the market interest rates moving up, I thought might depress some interest from private equity, but obviously, you've got quite a nice price tag there.\n\nSo just trying to get a feeling on the market and your desire to transact.\n\nSteve Kean -- Chief Executive Officer\n\nYes. Look, I think we had a unique interesting opportunity around Elba that we were able to capitalize on and we are happy with the price, not just from the price for the base assets, but also the ability to maintain the upside there. But I think interest rates historically have helped drive some of the valuations around infrastructure investors in assets. And so, those are rising and probably eating a little bit into the returns that we continue to see interest across the midstream space for our assets from infrastructure investors, particularly as people think about the terminal value opportunities longer term for the space.\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nThat's very helpful. Thank you.\n\nOperator\n\nAnd I'm showing no further questions at this time.\n\nRich Kinder -- Executive Chairman\n\nOK. Well, thank you very much. And for you baseball fans, it's only a couple of hours to the American League Championship Series. For all of you people from New York.\n\nGood luck.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRich Kinder -- Executive Chairman\n\nSteve Kean -- Chief Executive Officer\n\nKim Dang -- President\n\nDavid Michels -- Chief Financial Officer\n\nChase Mulvehill -- Bank of America Merrill Lynch -- Analyst\n\nTom Martin -- President, CO2 and Energy Transition Ventures\n\nJeremy Tonet -- JPMorgan Chase and Company -- Analyst\n\nMarc Solecitto -- Barclays -- Analyst\n\nJohn Schlosser -- President, Terminals of the Kinder Morgan, Inc.\n\nDax Sanders -- Executive Vice President and Chief Strategy Officer\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nAnthony Ashley -- Vice President and Treasurer\n\nKeith Stanley -- Wolfe Research -- Analyst\n\nJean Ann Salisbury -- AllianceBernstein -- Analyst\n\nBrian Reynolds -- UBS -- Analyst\n\nMichael Lapides -- Goldman Sachs -- Analyst\n\nMichael Cusimano -- Pickering Energy Partners -- Analyst\n\nMore KMI analysis\n\nAll earnings call transcripts"
}