{
  "companyName": "Take-Two Interactive",
  "companyTicker": "TTWO",
  "quarter": 2,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/08/take-two-interactive-ttwo-q2-2023-earnings-call-tr/",
  "content": "Take-Two Interactive (TTWO 2.75%)\nQ2 2023 Earnings Call\nNov 07, 2022, 4:30 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to the Take-Two Interactive Software second quarter fiscal year 2023 earnings call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. [Operator instructions] Please note, this conference is being recorded.\n\nI will now turn the conference over to our host, Nicole Shevins, senior vice president of investor relations and corporate communications. Thank you. You may begin.\n\nNicole Shevins -- Senior Vice President of Investor Relations and Corporate Communications\n\nGood afternoon. Thank you for joining our conference call to discuss our results for the second quarter of fiscal year 2023 ended September 30, 2022. Today's call will be led by Strauss Zelnick, Take-Two's chairman and chief executive officer; Karl Slatoff, our president; and Lainie Goldstein, our chief financial officer. We will be available to answer your questions during the Q&A session following our prepared remarks.\n\nBefore we begin, I'd like to remind everyone that statements made during this call that are not historical facts are considered forward-looking statements under federal securities laws. These forward-looking statements are based on the beliefs of our management, as well as assumptions made by information currently available to us. We have no obligation to update these forward-looking statements. Actual operating results may vary significantly from these forward-looking statements based on a variety of factors.\n\nThese important factors are described in our filings with the SEC, including the company's most recent annual report on Form 10-K and quarterly report on Form 10-Q, including the risks summarized in the section entitled risk factors. I'd also like to note that unless otherwise stated, all numbers we will be discussing today are GAAP and all comparisons are year over year. Additional details regarding our actual results and outlook are contained in our press release, including the items that our management uses internally to adjust our GAAP financial results in order to evaluate our operating performance. Our press release also contains a reconciliation of any non-GAAP financial measure to the most comparable GAAP measure.\n\nIn addition, we have posted to our website a slide deck that visually presents our results and financial outlook. Our press release and filings with the SEC may be obtained from our website at take2games.com. And now I'll turn the call over to Strauss.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nThanks, Nicole. Good afternoon, and thank you for joining us today. I'm pleased to report that we delivered another consecutive quarter of solid results with net bookings of $1.5 billion. We experienced healthy player engagement, driven by exciting new game releases, host launch content updates, and bold beats for many of our mobile offerings, even as consumers continue to navigate the effects of various macroeconomic and geopolitical factors.\n\nWe made excellent progress with our integration of Zynga, and we remain highly optimistic about the vast long-term growth potential for the mobile industry, which is expected to reach over $160 billion in gross bookings within the next four years. Some of our key achievements in the period include we successfully reached our 100-day integration milestone at the end of August. Zynga's president Frank Gibeau and his leadership team have evaluated our mobile portfolio, including existing games and titles in development, and they've identified numerous opportunities to enhance our performance. These initiatives include reorganizing several teams, sharing development tools, resources, and best practices across our mobile studios, conceptualizing new bold beats, and leveraging Zynga's highly valuable publishing platform, which is now even stronger following the recent acquisition of Storemaven.\n\nWe're also starting to expand our direct-to-consumer efforts more meaningfully across our mobile portfolio further to enhance profitability. We remain committed to delivering $500 million of annual net bookings opportunities over time. The Zynga team has been working with our other labels to explore potential creative projects. As part of this process, we've identified certain underrepresented genres in our mobile portfolio that we believe we can pursue more aggressively over time.\n\nOur efforts to deliver cost synergies are tracking extremely well, and we're now confident that we can achieve over $100 million of annual savings within the first two years post close. I'd like to thank Frank, his leadership team, and all of our new colleagues at Zynga once again for helping to make our combination happen so seamlessly. We're thrilled to have Zynga as part of our Take-Two family. Turning to our second quarter results.\n\nOur net bookings performance was within our guidance range, led by Grand Theft Auto V, which exceeded our expectations and to date has sold more than 170 million units worldwide. Starting July 26, Grand Theft Auto Online launched its latest major update, The Criminal Enterprises, introducing expanded gameplay across the criminal careers of executives, bikers, nightclub owners, and gun-runners, as well as the opportunity to work with federal agents to uncover a criminal conspiracy in the new Operation Paper Trail series of contact missions. The update also featured a range of new vehicles and more, including the new Community Series, showcasing some of the most fun and unique experiences created by players across the globe. This major update also delivered a host of overall improvements to the gameplay experience, including increased payouts across a wide array of activities and several other player-requested features.\n\nThe Criminal Enterprises was very well received, and we've seen millions of players engaging with significant new features such as the ability to run cell missions and private lobbies, new weapon wheel controls and more. In addition, Rockstar Games GTA+ subscription service continues to grow its members who enjoy a rotation of numerous exclusive in-game benefits, including vehicles, upgrades, and gear every month. On September 9, 2K and Visual Concepts successfully launched NBA 2K23 with the title earning an 80-plus Metacritic grading at launch and is receiving praise for raising the bar on the top-selling sports title in the U.S. To date, NBA 2K23 has sold in nearly 5 million units, alongside significant growth in virtual currency sales and a higher average selling price compared to NBA 2K22.\n\nPlayer engagement has been very strong with more than 2 million daily active users and 4% growth in average days played. We believe that NBA 2K23 will continue to grow its audience as the title provides a year-round experience for its fervent community of players throughout the world. I'd like to congratulate the teams of 2K and Visual Concepts for once again delivering such a stellar basketball experience. The franchise's momentum extends beyond the core console experience, with NBA 2K22 Arcade Edition for Apple Arcade remaining the No.\n\n1 game on the platform, and our recent launch of NBA 2K23 Arcade Edition offering many new features and improvements. Furthermore, NBA 2K Online continues to be the No. 1 PC online sports game in the country with nearly 59 million registered users. Red Dead Redemption 2 is continuing to impress, with sell-in of more than 46 million units worldwide to date and more active players in the second quarter than we've seen for the comparable period in previous years.\n\n2K supported WWE 2K22 and Tiny Tina's Wonderlands the final downloadable content packs for each title, which were made available individually and as part of the game's season passes. During the quarter, recurrent consumer spending rose 76% and accounted for 80% of net bookings. Zynga continues to experience strong engagement among its active players and we believe that we're maintaining our market share globally. Our mobile business delivered mid-teens growth in advertising bookings on a year-over-year basis, outperforming the broader industry.\n\nAt the same time, in-app purchases continue to be under some pressure due to current macroeconomic conditions. Some key highlights of our mobile offerings during the quarter include: the Rollic business remained very strong and exceeded our plan. Notably, Rollic surpassed 2 billion lifetime downloads worldwide and have now launched 19 titles that have reached No. 1 or No.\n\n2 most downloaded game position in the U.S. App Store. Several of Zynga's title-celebrated milestones, including the second anniversary of Harry Potter Puzzles & Spells, the tenth anniversary of Farmville and the 15th anniversary of Zynga Poker. Each of these anniversaries was supported with an array of in-game events and unique content offerings.\n\nZynga unveiled several high-profile brand integrations, including Social Point's partnership with AMC Networks' the Walking Dead and Dragon City and Monster Legends; CSR2's debut Pagani's new multimillion dollar, Utopia Hypercar, and Game of Thrones Slots Casino launched a new in-game event, Week of the Dragon, in conjunction with HBO's new hit fantasy series, \"House of the Dragon.\" Turning to our outlook. We now expect to deliver net bookings of $5.4 billion to $5.5 billion in fiscal 2023. Our reduced forecast reflects shifts in our pipeline, fluctuations in FX rates, and a more cautious view of the current macroeconomic backdrop, particularly in mobile. Lainie will provide more detail on our outlook shortly.\n\nDespite these headwinds and their effect on our guidance for the year, we remain highly confident in our diverse and extensive development pipeline that we expect will deliver a sequential growth and record performance over the next several years. Take-Two has a proven strategy, a consistent track record of success, driven by our core tenets. We aspire to be the most creative, the most innovative, the most efficient entertainment company in the world. As we strive to capitalize on the numerous opportunities ahead of us, we're committed to creating significant, long-term value for our shareholders.\n\nI'll now turn the call over to Karl. \n\nKarl Slatoff -- President\n\nThanks, Strauss. I'd like to begin by thanking our teams for delivering another strong quarter, which reflects our ability to captivate and engage audiences consistently by delivering the highest-quality entertainment experiences across all platforms. And I'll discuss our recent releases. On October 14, 2K and HB Studios launched PGA Tour 2K23, the latest entry in our golf simulation franchise, a positive community sentiment, and great critical acclaim, including GameSpot coining the title the Best Simulation Golf Game Ever Made.\n\nPGA Tour 2K23 features golf icon and all-time sports great Tiger Woods, and celebrates his legacy by introducing him as both the playbook in-game pro and an executive director who advised the games development team. The game features several new additions and improvements, including an enhanced roster of male and female pros, the ability to play NBA legends' Michael Jordan and Steph Curry, a top golf mode, a deeper array of personalization options and gear, license courses, and the ability to design original courses and multiplayer offerings. HB Studios will continue to support the game with additional pros and courses, as well as seasonal updates in the Club House pass. On October 21, 2K and Gearbox Software released new tales from the Borderlands, a choice-based narrative adventure game that is a successor to the beloved Telltale Games title.\n\nThe franchise has always been an incredible canvas for storytelling, and we are pleased to add this new offering to the portfolio. On November 2, Private Division and Roll7 released Finding the Flowzone, the second and final DLC expansion for the critically acclaimed skateboarding action platform of OlliOlli World. The release has received praise from critics, including Eurogamer, who commended Finding the Flowzone as a fun to this magnificent game and stating that the expansion is completely rad. Now I will discuss our announced offering for the balance of fiscal 2023 and beyond.\n\nOn December 2, 2K and Firaxis Games will launch Marvel Midnight Suns on Windows PC, Xbox Series X and S, and PlayStation 5. The X|S1, PlayStation 4, and Nintendo Switch version will follow at a later date. In support of the upcoming launch, 2K has produced five short videos that are being released weekly on Marvel Entertainment's YouTube channel, which provide the backstory to how the game's lead character Lillis became the mother of demons and how superheroes like Blade, Magic, Ghostrider, and Nico Minoru came together to form the young core of the Midnight Suns. 2K will have more to share on the game in the coming weeks.\n\nDuring the fourth quarter, 2K and Visual Concepts will launch WWE 2K23. Building upon the success of 2K22, which had nearly 450 million matches played and 10 million hours of game content viewed on Twitch, fans can look forward to the series of, once again, redefining interactive entertainment within the squared circle. We are grateful to have such a supportive and collaborative partnership with WWE, and 2K will have more to share about WWE 2K23 in the coming months. On February 24, Private Division and Intercept Games will launch Kerbal Space Program 2, the sequel to the beloved rocket-building sim.\n\nAn early access for PC on Steam, Epic Games Store, and other digital storefronts. KSP2 will bring an array of content at the launch of early access, making this the most digitally impressive KSP game yet. The game will also feature improved tutorials and user onboarding to provide players with the necessary knowledge to excel at space flight. Built from the ground up, KSP2 will also introduce the ability to customize and paint vehicles, leading to deeper personalization and expression in every build.\n\nThose who purchased KSP2 and early access will help inform the future development of the game by providing feedback directly to Intercept Games leading up to the full launch of the title. We can't wait for the incredibly passionate KSP community to take flight in this new entry to the series. Throughout the balance of the fiscal year, Rockstar Games will continue to support Grand Theft Auto Online with additional major content updates alongside popular annual seasonal theme offerings and more. In mobile, Zynga's Wallet Studio will continue to release a consistent cadence of titles, while the label of other studios remains hard at work on a variety of offerings, including several titles that are currently in soft launch and expected to release in fiscal year 2024.\n\nTurning to eSports. The NBA 2K League is currently gearing up for its sixth season, which will tip off in spring 2023. Last month, the League announced a landmark agreement with Australia's National Basketball League to launch an expansion team, NLB Oz Gaming. Not only is this the first time an Australian professional sports league has joined a global sports league but it also marks our third expansion team from outside of North America.\n\nWe remain very excited about the continued growth and success of the NBA 2K League. In closing, we believe that Take-Two is home to the best talent in our industry across all segments of interactive entertainment. With an expanding portfolio of the most exciting and commercially successful owned intellectual property and the ability to deliver deeply engaging and captivating entertainment experiences to a broad array of audiences around the world, we believe that we are well-positioned to deliver long-term value for our shareholders. I'll now turn the call over to Lainie.\n\nLainie Goldstein -- Chief Financial Officer\n\nThanks, Karl, and good afternoon, everyone. Today, I'll discuss the key highlights from our second quarter before reviewing our guidance for fiscal year 2023 and our third quarter. Please note that our second quarter results include our combination with Zynga, which affects the comparability of our results relative to last year. Additional details regarding our actual results and outlook are contained in our press release.\n\nAs Strauss mentioned, our combination with Zynga is tracking very well, from the progress we are making against our integration milestones with the net bookings and cost synergy realization that we are working toward and our highly complementary company cultures. We have great confidence that over the long term, our portfolio is poised to benefit from the significant expected growth in mobile gaming, evolving player dynamics toward more immersive mobile content, and our massive combined scale, which will enable our teams to cross-promote titles and build stronger tools to connect with new users. During the quarter, we identified additional cost savings opportunities, and we now feel confident that we can deliver over $100 million of annual synergies within the first two years post close. We're also evaluating other efficiencies across our core businesses while ensuring that we have the appropriate resources to deliver on our significant growth prospects.\n\nOur second quarter results were solid and we delivered net bookings of $1.5 billion, which was within our prior guidance range. Movement in foreign currency exchange rates negatively affected our net bookings by approximately 1%. With consumers navigating ongoing macroeconomic uncertainties, we believe that our financial performance truly demonstrates the incredible quality of our games and the significant value that our interactive entertainment experiences provide to our players. During the period, recurrent consumer spending rose 76% and accounted for 80% of net bookings.\n\nNBA 2K and Rollic's hypercasual mobile portfolio outperformed our plans, while we experienced some softness across other parts of our portfolio as the interactive entertainment industry face continued headwinds. Digitally delivered net bookings increased 62% and accounted for 94% of the total. During the quarter, 73% of console game sales were delivered digitally, up from 65% last year. GAAP net revenue increased 62% to $1.4 billion, and cost of revenue increased 56% to $714 million.\n\nOperating expenses increased by 144% to $932 million, primarily driven by the addition of Zynga, business acquisition, and higher personnel costs, which was partly offset by lower console and PC marketing expenses. And GAAP net loss was $257 million or $1.54 per share, which was impacted by $320 million of amortization of acquired intangibles and $37 million of business acquisition costs. Our management tax rate for the third was 18% as compared to 16% in the prior year as a result of our combination with Zynga. We ended the quarter with over $1.3 billion of cash and short-term investments and $3.3 billion of debt.\n\nTurning to our guidance, I'll begin with our full fiscal year expectations. As Strauss mentioned, we are revising our guidance. We now expect to deliver net bookings of $5.4 billion to $5.5 billion. Approximately 70% of the downward revision reflects lower expectations for our mobile business and shifts in our release slate, while the balance reflects an updated view for the rest of our portfolio based on current business trends across the interactive entertainment industry.\n\nOur guidance reflects $50 million of FX headwinds. The largest contributors to net bookings are expected to be NBA 2K, Grand Theft Auto Online and Grand Theft Auto V, Empires & Puzzles, Rollic's hypercasual mobile portfolio, Toon Blast, and Red Dead Redemption 2 and Red Dead Online. We expect the net bookings breakdown from our label to be 45% Zynga, which includes our former TTWO mobile titles, 36% 2K, 18% Rockstar Games, and 1% Private Division. We forecast our geographic net booking split to be about 60% United States and 40% international.\n\nWe now expect recurrent consumer spending to grow by approximately 90% and represent 77% of total net bookings. Our digitally delivered net bookings are expected to grow by approximately 70% and represent 96% of the total. Our forecast assumes that 75% of console game sales will be delivered digitally, up from 68% last year. We expect to generate more than $650 million in non-GAAP adjusted unrestricted operating cash flow.\n\nAnd we're expected to deploy approximately $150 million for capital expenditures. We expect GAAP net revenue to range from $5.41 billion to $5.51 billion and cost of revenue to range from $2.61 billion to $2.64 billion, which includes approximately $694 million of amortization of acquired intangibles. Total operating expenses are expected to range from $3.4 billion to $3.42 billion as compared to $1.5 billion last year. This increase reflects the inclusion of Zynga, business acquisition costs, and higher personnel marketing and IT expenses, which we anticipate will be slightly offset by our expected cost synergies.\n\nIn light of the current economic backdrop, we continue to monitor our costs prudently to find potential areas of savings this year while being mindful of the resources we need to support a robust multiyear release schedule. And we expect the GAAP net loss ranging from $631 million to $674 million or $3.95 to $4.22 per share, which assumes a basic share count of 159.8 million shares. Our revised forecast includes an increase in amortization for intangible assets acquired from Zynga based on updated valuation estimates. We expect the management tax rate to be 18% throughout the year.\n\nNow moving to our guidance for the fiscal third quarter. We project net bookings to range from $1.41 billion to $1.46 billion compared to $866 million in the third quarter last year. The largest contributors to net bookings are expected to be NBA 2K, Grand Theft Auto Online and Grand Theft Auto V, Empires & Puzzles, Rollic's hypercasual mobile portfolio, and Toon Blast. We project recurrent consumer spending to grow approximately 125% and digitally delivered net bookings to increase approximately 80%.\n\nOur forecast assumes that 72% of console game sales will be delivered digitally, up from 63% last year. We expect GAAP net revenue to range $1.43 billion to $1.48 billion and cost of revenue to range from $690 million to $710 million, which includes approximately $198 million of amortization of acquired intangibles. Operating expenses are expected to range from $897 million to $907 million. At the midpoint, this represents a 126% increase over last year.\n\nThis increase reflects the inclusion of Zynga, business acquisition costs, and higher marketing, which we believe will be slightly offset by the realization of some of our anticipated cost synergies and cost-saving efforts. And GAAP net loss is expected to range from $142 million to $160 million or $0.85 to $0.95 per share, which assumes a basic share count of 167.7 million shares. In closing, we continue to focus on our execution against an uncertain economic backdrop, and we are highly optimistic about our future growth trajectory. Our long-term development pipeline is stronger than ever, and we're excited to deliver a high profile of sequels and engaging new properties that have the potential to enhance our financial profile even further.\n\nAt the same time, we are confident in our ability to create significant shareholder value as we continue our integration of Zynga by collaborating on new creative projects, leveraging our combined scale, unlocking greater potential from their mobile platform, and entering new business models and geographies. Thank you. I'll now turn the call back to Strauss. \n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nThanks, Lainie and Karl. On behalf of our entire management team, I'd like to thank our colleagues for delivering another solid quarter. And to our shareholders, I want to express our appreciation for your continued support. We'll now take your questions.\n\nOperator?\n\nOperator\n\nThank you. And at this time, we'll be conducting our question-and-answer session. [Operator instructions] Our first question comes from Eric Handler with MKM Partners. Please go ahead.\n\nEric Handler -- MKM Partners -- Analyst\n\nGood afternoon and thanks for the questions. Wonder if you could just give us a little bit of insight into the mobile business. Do you feel like we're sort of close to a stabilization for that business? And we've been hearing everything -- a lot of different things about what's going on in mobile now, specifically top games are doing well, it's the smaller games that are having some problems. Are you seeing issues with maintaining DAUs or is it spending? Any insight you can give would be greatly appreciated.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nLook, engagement is very stable. We got a lot of terrific hit titles at Zynga. It's what we like about the company. Unlike many mobile businesses of this kind of scale, our bookings are not concentrated in two or three titles.\n\nWe have more than 10 big titles and more coming. So, engagement is incredibly solid. We are seeing some pressure on in-game spending. We also have a great story in advertising bookings because our advertising bookings are up mid-double digits year over year.\n\nAnd so, there are plenty of bright spots in the business as well. The most important spot, people love mobile games. They love our mobile games, they continue to play them. And we're seeing no significant change in engagement across our titles.\n\nIn terms of what I expect to change, look, it's very hard to say. I think that's -- it's anyone's guess what the economy will do. My own opinion, and it's really just one person's opinion, as we're looking -- we should be looking at six to six more months of downward pressure. And I expect by the end of '23, we'll be in good shape. \n\nEric Handler -- MKM Partners -- Analyst\n\nGreat. That's helpful. I wonder, just as a follow-up, it looks like just going between your company presentations, it looks like your pipeline of games from fiscal '23 to fiscal '25 is unchanged. Is that a pretty fair assessment?\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nIt is. We have 87 titles coming across mobile, PC, and console. And it's the most robust pipeline we've ever had certainly and one would argue, one of the most robust pipelines in the industry.\n\nEric Handler -- MKM Partners -- Analyst\n\nThank you very much.\n\nOperator\n\nOur next question comes from Andrew Uerkwitz with Jefferies. Please go ahead.\n\nAndrew Uerkwitz -- Jefferies -- Analyst\n\nYeah. Thanks for taking my question. I guess there's a lot of frustration. You had the S-4 out earlier in the year.\n\nWe've gotten two cuts here. And the move in the pipeline around is part of the blame. What -- is there anything you guys can share that gives you confidence that there's going to be growth next year, especially in the core Take-Two? It looks like part of the cut is half 2K, if I'm doing my math right. So just curious, what is giving you that confidence or anything you can share that gives us the confidence to go along with it here? Thanks. \n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nIt's driven by the pipeline, of course. So, we know what the release schedule is and we feel really good about it. And if we didn't, we wouldn't call for a sequential growth and record results in the next three years. But I understand the frustration.\n\nAnd look, we call it as we see it and I think we're known for that. Had we expected where we were right now, then we wouldn't be guiding down. We're guiding down because things have materialized in a way that's different than our expectations. Some of that is related to pipeline, but frankly, not most of it.\n\nMost of it's related to mobile, significant amount of FX as well. But there have been some modest pipeline shifts. So, the good news is those titles are, of course, coming.\n\nAndrew Uerkwitz -- Jefferies -- Analyst\n\nGot it. And then if I could just throw one follow-on there. You guys are known for quality and I'm sure a lot of the delays or shifts are related to polish. But is there something you guys are seeing that's -- it's just too much going on? Just kind of just walk us through kind of the thought process behind it.\n\nIt just seems like -- was COVID a bigger impact? This will be, I think, two or three years now with record pipeline and so far, just we're all being patient here.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nI understand the concern and I understand the question as well. No, we're not seeing any productivity issues, for example. We definitely have very high-quality expectations in the bands, and that's reflected in the fact that we're performing across the board. So, this company is a hit factory.\n\nWe haven't had a disappointing release in as long as I can remember. And that's honestly the most important thing. So, we would much rather -- if you have to choose, I'd much rather have the situation we're in, which is we've had some delays and we have had to revise down guidance. I'll choose that any day over taking some flops.\n\nThat's really the key in this business. We've had issues -- I mean, we've been around here long enough to remember them. Where in the past, we had delays in titles and it was ultimately always worth waiting for because when we got to the other side, the results were delivered, and the small amount of the time delay didn't ultimately matter in the context of the results that we were able to deliver. I'm hopeful that will be the case here as well.\n\nAndrew Uerkwitz -- Jefferies -- Analyst\n\nThank you. Appreciate the color. Thank you,\n\nOperator\n\nOur next question comes from Eric Sheridan with Goldman Sachs. Please go ahead.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks so much for taking the question. Maybe I could just go back to the mobile business for a minute. In terms of what you've learned about the mobile business over the last 12, 15 months, some of before the close and since the close in Zynga, how do you think about what you need to build for the long term versus some of the elements of change that you can see on some of the distribution platforms from Apple and Google, and how that might impact what you need to build and scale on either the acquisition front or the monetization front for the long term? Thanks so much. \n\nKarl Slatoff -- President\n\nHi. It's Karl. So really, what it means to us, what we're working on building is Zynga and this is what's happening obviously well before we merged with the company. as we're working on building the mobile platform.\n\nAnd one of the most exciting things and obviously, Zynga has got some amazing forever franchises and some great IPs and some good titles and some great titles coming out. But a huge part of the value is that platform and the ability to manage the customer life cycle very effectively. And you can see the company investing in that over time and we continue to invest that. And as we bring together the databases across our entire company, that power of data management, particularly in the context of IDFA and some of the challenges that privacy rules may sent to us, the better your data, the broader your data set, and the better the bigger and broader your platform and the more capabilities you have in your platform will enable you to mitigate those effects.\n\nAnd we're already seeing some of that. And that's been a focus for Zynga for quite some time, and we're going to continue to invest in that. You saw it with the acquisition of, the acquisition of Storemaven, but also bringing all of the Zynga portfolio and the new Take-Two portfolio onto the centralized Zynga platform is going to yield significant results for us.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Matthew Thornton with Truist Securities. Please go ahead.\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nGood afternoon. Maybe two, if I could. One for Strauss. Strauss, you talked about sequential years of growth and a record performance.\n\nI guess the question there is, what are you alluding to? Is that EBITDA, earnings per share, margins? Any meat you can kind of put on that would be helpful. And then just second one for Lainie. Lainie, I think you called out $50 million in -- I interpreted that as incremental currency headwind impacting the full year guide, but you also alluded to pipeline moving around. Could you quantify what that impact is and kind of what that is for the year?\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nYeah. What I was referring to is top and bottom line so net bookings and income, however you describe EBITDA as a handy measure. \n\nLainie Goldstein -- Chief Financial Officer\n\nYeah. And for the full year, I mentioned that about 70% of the downward revision is the mobile business and the release slate together, and about $50 million is for the FX currency headwinds. \n\nMatthew Thornton -- Truist Securities -- Analyst\n\nOK. And is there any color on what slipped in the pipeline? And I'm sorry if I missed that. \n\nLainie Goldstein -- Chief Financial Officer\n\nSure. For -- the changes in release schedule, there are several changes that happened during the quarter. So, there was one mobile title from 2K that moved, and Gen 8 and Switch versions of the Marvel's Midnight Suns moved into fiscal '24. And also, KSP2 has now shifted to early access this year.\n\nSo those are the major changes in the release schedule.\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nPerfect. Great. Thanks, everyone.\n\nOperator\n\nOur next question comes from Matthew Cost with Morgan Stanley. Please go ahead.\n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nHi, everyone. Thanks for taking the questions. Just on the PC console business, are you seeing a divergence between the performance of Grand Theft Auto and NBA 2K, specifically where NBA 2K RCS is outperforming Grand Theft Auto? And if so, can you give any more color on the player and consumption dynamics you're seeing in GTA? And then on the mobile side, you highlighted how the advertising business is hanging in there and growing a fair bit better than in-app purchases. Do you expect the advertising to materially outperform in-app purchases over the next couple of quarters? The reason I ask is because presumably, a lot of those ad dollars are coming from other game companies.\n\nAnd then I wonder if eventually, that feels the pain from in-app purchases across the industry going down. Thank you.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nYeah. Thanks for your questions. Look, GTA Online and NBA 2K are very different animals. GTA Online has been around for nearly 10 years.\n\nIt's beloved by a massive audience. GTA V, the underlying title has sold in more than 170 million units. NBA 2K is an annualized release, and so we get an annual snapshot of how virtual currency is doing. Engagement is very high indeed.\n\nVirtual currency is up in NBA 2K23. The mobile advertising business, look, these are two different businesses and the vast majority of our net bookings at Zynga comes from in-app purchases still. So yes, we expect the growth rate in advertising probably to exceed the growth rate in in-app purchases, certainly for the next year. Beyond that, I think it's too early to say.\n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from Drew Crum with Stifel. Please go ahead.\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nHey, guys. Good afternoon. Maybe just taking back off the last question, asking more broadly. With your guidance update and the impact from more cautious macro backdrop, if you isolate your console PC business, can you discuss it in any way you change your view on RCS for this part of the business, so excluding multiple? And then separately, can you talk about the decision to close Playdots? And is this, in any way, factors into that $100 million-plus of cost synergies that accompanied the Zynga transaction? Thanks.\n\nLainie Goldstein -- Chief Financial Officer\n\nSo for RCS, we did lower our expectations. Most of it was for mobile since our prior guidance assumed that mobile would experience some improvement in the second half of the year. But we no longer expect that since the current data for the industry and our real-time performance has shown that we think it will lower in the second half of the year. But we are also assuming some softer performance for several of our large nonmobile titles that are meaningful contributors to RCS.\n\nSo that's why our expectations for RCS are to come down in the second half of the year.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nAnd with regard to Playdots, we've relocated the operations of our successful game, Two Dots to another studio. And yes, that was driven by the integration benefits that we felt we could achieve.\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nOK. Thanks, guys.\n\nOperator\n\nOur next question comes from Mario Lu with Barclays. Please go ahead.\n\nMario Lu -- Barclays -- Analyst\n\nThanks for taking the questions. Wanted to ask about mobile. With the full year guidance, 70% of it coming from mobile but Rollic outperformed in the second quarter. So is there some main factors you can point to that separate Rollic from the rest of the mobile portfolio? Is it being kind of immune to IDFA? Is it competition? And then lastly, just curious to hear your thoughts on potentially leveraging the success of Rollic with perhaps cross-promotion to other mobile games.\n\nThanks.\n\nLainie Goldstein -- Chief Financial Officer\n\nSo, Mario, 70% is mobile and the movement in the release schedule, so it's a combination of both of those two items. So it's not only mobile. But you're right, Rollic did outperform in Q2 so that business is doing really well.\n\nKarl Slatoff -- President\n\nAnd some of the reasons, because the Rollic is doing well, is obviously, it's an advertising-driven business, and we've had some success from an advertising perspective, both in terms of efficiency and inventory availability. And also, it's just given the nature of the hypercasual business, it's not necessarily reliant as much on targeted advertising. So it's a little bit easier to grow your UA in that context because -- where you have situations like IDFA doesn't necessarily Rollic business or the hypercasual business in the same way that it would in the normal bubble business. I'm sorry, I missed the second question.\n\nWhat was that, about cross-promotion? \n\nMario Lu -- Barclays -- Analyst\n\nYeah, the question was, your thoughts on potentially leveraging the success of Rollic to cross-promotion or view that as an acquisition channel to other mobile -- \n\nKarl Slatoff -- President\n\nYes, there are certainly opportunities to do that. You can make an argument that it's a different kind of a customer. I think there's obviously overlap. There may be some differences.\n\nBut the fact that you've got a large funnel of players coming into your database always going to be something that's going to help your UA strategy across your entire enterprise and specifically on the mobile side of the business.\n\nMario Lu -- Barclays -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nOur next question comes from David Karnovsky with J.P. Morgan. Please state your question.\n\nDavid Karnovsky -- J.P. Morgan -- Analyst\n\nAll right. Thanks for the question. Just regarding the $500 million of revenue synergies with Zynga, which you reiterated, any early opportunities you're seeing across your portfolio to execute on this? And then Lainie, you mentioned other potential cost opportunities that could come up. Is that something that's factored into your guide or would that be incremental to it?\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nYeah. On the first question, yes, there are a number of early opportunities that we've identified, including our approach directly to the consumer on the mobile business, which is pretty exciting and could generate material benefits. And we're working on a number of properties as well. It will take longer to bring some titles to market but that's super exciting.\n\nLainie Goldstein -- Chief Financial Officer\n\nAnd in terms of the operating expense synergies, we do have some of the synergies with Zynga included in our guide. But in terms of the other areas of efficiencies, we don't have those in our guide yet. We have some ideas that we're looking at. So, like on a multiyear basis, we're evaluating our real estate footprint as we adopt flexible work policies.\n\nWe're also looking at identifying some core functions that we can centralize across our labels, determining the necessity of some opening to hire positions, and also negotiating some vendor contracts more effectively across the company. So those are additional opportunities that we're seeing in our cost structure. So, we'll be looking at achieving those in the next year or so.\n\nOperator\n\nOur next question comes from Doug Creutz with Cowen. Please state your question.\n\nDoug Creutz -- Cowen and Company -- Analyst\n\nHey, thank you. Just to tie a couple of things that have already been said together. You mentioned that you've been assuming that mobile would improve in the back half of the year and now you're not assuming that. Is it simply to say that you thought it would get better isn't or that it's actually continued to deteriorate since the last call?\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nIt's the former.\n\nDoug Creutz -- Cowen and Company -- Analyst\n\nOK. Thank you. \n\nOperator\n\nOur next question comes from Martin Yang with Oppenheimer. Please go ahead.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nGood afternoon. Thanks for taking my question. My first question is on NBA 2K's ASP trends. You mentioned there's some year-over-year improvement.\n\nCan you maybe dig into details on what contributed to the ASP improvement?\n\nKarl Slatoff -- President\n\nYeah, it's basically we came out with a Championship Edition this year. Every year, we do different marketing packages or different SKUs. We had a particularly successful one this year that features some very prominent basketball players, and that carries a much higher average selling price and that's affecting the ASP. So it really is just sort of -- it's the SKU mix of the title.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nGot it. And then a follow-up question regarding your mobile synergy. Is there any milestones you could share with us updating where the teams are at? Are new teams being formed to build mobile game space on your core IP? Is there any games in aviation phase or any other milestones will be appreciated. Thank you. \n\nKarl Slatoff -- President\n\nYeah. We don't have anything specific to announce right now. And I assume your question is really related, as it relates to releasing Take-Two IP or games, yes. Because obviously, there's a lot of other smaller things we can do with leads, etc., and also just the efficiencies about bringing the companies together, T2 mobile and Zynga -- the acquired Zynga component.\n\nBut yeah, there are a lot of conversations going on. There are a lot of ideas flowing back and forth. We don't have anything to announce right now, but those conversations are going very well and they're exciting. When it materializes, it's difficult to assess.\n\nThe creative process is a very specific process and some of them take longer than others. And the most important thing is that we have game concepts that make sense from a commercial perspective but also from a brand perspective. So, the teams are having those conversations for now. So, stay tuned.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nThanks, Karl.\n\nOperator\n\nOur next question comes from Matti Littunen with Bernstein. Please go ahead with your question.\n\nMatti Littunen -- Bernstein Investment Research and Management -- Analyst\n\nHello. Good evening. First question on NBA units. So it sounds like, if I heard correctly, that the unit number so far is very similar to what you said a year ago.\n\nSo could you just confirm, has it been broadly similar? Has there been any slight growth or decline on that? And then on the live services revenue, could you give us any color in terms of how that revenue is currently split between MyCAREER and MyTEAM and maybe how that's trending over time? Thank you.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nYeah. It's roughly the same number of units year over year and virtual currency spending is up. And we don't split out the spending in the different modes for the purpose of this call.\n\nMatti Littunen -- Bernstein Investment Research and Management -- Analyst\n\nThanks.\n\nOperator\n\nOur next question comes from Brian Fitzgerald with Wells Fargo. Please go ahead.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nThanks. Lainie, you talked to this a little bit. But in terms of labor, how do you think about things improving as the market cools off a bit for tech employees? And how are you thinking about headcount growth and retention from here? Does the cooling labor market give you any leverage in terms of getting developers back to the office? Does that help things? Any color there would be great.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nWell, we don't really look at our relations with our colleagues as one of leverage, so we probably wouldn't describe it through that lens. I do think that it's probably going to become easier to hire people when a lot of tech businesses are laying people off. We don't expect a rip and we don't have a hiring freeze. We're always judicious about the people we bring on board.\n\nWe pride ourselves on being highly efficient, and we believe we are highly efficient now. So, I do think that this may make it somewhat easier to hire really talented people, but we wouldn't use these times to apply leverage. We believe that we have great relationships with our workforce and those are terribly important to us.\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nThank you, Strauss.\n\nOperator\n\nOur next question comes from Omar Dessouky with Bank of America. Please state your question.\n\nOmar Dessouky` -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking the question. My question is about mobile advertising efficiency. How has mobile advertising efficiency in the September quarter trended versus the March and the June quarters, especially at Zynga? And what are your go-forward assumptions for the December and March quarter? And what I mean by advertising efficiency is the kind of in-app purchase bookings divided by the advertising spend.\n\nKarl Slatoff -- President\n\nYeah. Just to be clear, you define advertising efficiency as in-app purchases divided by advertising spend?\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nYeah, or the reciprocal of that. So, like the total advertising spend as a percentage of bookings. Sorry, I should have said it that way.\n\nKarl Slatoff -- President\n\nRight. So, I think, look, we don't break -- we're not necessarily breaking that out specifically and I'm not sure that I would characterize that as efficiency, but it certainly would be an interesting measure to look at. And as we said before, we've experienced pretty strong growth in our advertising business and we've had some pressure on in-app purchases. So, it stands to reason that, that ratio would probably be going more in favor of the advertising business versus in-app purchases.\n\nThat isn't necessarily a long-term trend. That's just something that we're seeing in the short run. We fully expect in-app purchases to come back at one point in the future. As Strauss said before, a little hard to gauge that when that may happen, but that is our expectation.\n\nSo those ratios, I don't believe are necessarily going to be fixed over time or necessarily moving in a specific direction, again, depending on what happens in the broader market.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nOK. And just a follow-up on that would be, have you changed which channels you're using for user acquisition for mobile, specifically for Zynga? Or how do you, for example, concentrate your spend in specific channels? Has that changed at all?\n\nKarl Slatoff -- President\n\nYeah, I don't think the mix in terms of where we're spending concentrating has changed dramatically based on anything that we've seen in the market. You can certainly expect that day-to-day, quarter-to-quarter, month-to-month, you're going to see variations depending on where media opportunities exist. So I'm sure you're going to see some variation depending on what happens in specific media outlets. But I don't see a broader trend that's pushing us toward any particular asset versus another.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nOK. Thanks a lot.\n\nOperator\n\nOur next question comes from Mike Hickey with Benchmark. Please state your question.\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nHey, Strauss. You guys are good. Thanks for taking my questions. The first one is on your guidance for '23.\n\nI mean, obviously, a couple of revisions here. Do you feel like you're sort of being conservative enough? Obviously, a lot of uncertainty on the macro mobile, but is there still downside risk and where would that be? And then on '24, you said growth sequentially. You've given us some data on the S-4 and I think on your presentation with Zynga. Street's looking for $8 billion in revenue, 759 in ETFs.\n\nObviously, that's a pretty big step-up. Guessing it's coming from premium as mobile is slowing here. Obviously, live service is not great. Is it just one, two, three titles on premium or any sort of granularity, I guess, on the '24 growth would be great? And then the second question is on the very unfortunate GTA leak.\n\nJust curious how you and your teams are sort of managing through that impact, if you feel that there's a residual advantage or not, and how you sort of move forward and think about timing.\n\nLainie Goldstein -- Chief Financial Officer\n\nSo, in terms of the guidance for '23 on being conservative or still downside risk, we always guide based on what we know at the time that we know it. So, I wouldn't say they're conservative or a risk either way. I feel like we gave the best information that we have at the time that we have it. So, it's what we know right now.\n\nAnd hopefully, the -- it gets better, but that's what we feel the numbers are at this time. And in terms of the CAGR and the fiscal -- the numbers that were in the S-4, we generally do not provide long-term growth targets in our normal course of business. We only did that previously because of the pending combination with Zynga. And as you know, the in our business because of the changes in the shifts in the release slate can happen, it really doesn't make sense for us to give long-term numbers on a regular basis.\n\nSo, we've never really done that in the past. But we're really continuing to be very excited about our pipeline of the strong titles that we have, and we have many large-scale projects underway. So, the potential of the titles in the pipeline, that has not changed at all. We remain highly confident that they're going to deliver us sequential years of growth and record performance in the next few years.\n\nSo that hasn't changed. So, we really feel great about our numbers in the next few years, as we said.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nAnd with regard to the leak, it was terribly unfortunate, and we take those sorts of incidents very seriously indeed. There's no evidence that any material assets were taken, which is a good thing. And certainly, the leak won't have any influence on development or anything of the sort. But it is terribly disappointing and causes us to be ever more vigilant on matters relating to cybersecurity.\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nThanks, guys. \n\nOperator\n\nOur next question comes from Clay Griffin with MoffettNathanson. Please state your question.\n\nClay Griffin -- MoffettNathanson -- Analyst\n\nHi. Good evening. Thanks for taking the question. I guess two.\n\nI guess two. It seems like the legacy Take-Two mobile games are holding in a bit better than the legacy Zynga. I guess, what would you attribute that to? Is it just kind of a life cycle of where those titles are relative to kind of when IDFA ATT dropped? And then secondly, just curious, Strauss, I think Phil Spencer was talking about Game Pass and essentially implying that they were nearing saturation, I guess, relative to kind of where the Xbox console installed bases. Just curious if your thoughts about subscription models relative to the traditional premium window have changed over time.\n\nI think his comments generally, I think, could be characterized as lining up maybe what your view of the value proposition for a subscription product.\n\nKarl Slatoff -- President\n\nSo, in terms of the legacy Take-Two mobile business versus the Zynga business, I wouldn't necessarily -- I mean, again, we don't really disclose that so I don't think there's any really way try to see that behavior. But I can tell you that we wouldn't look at it that way because there are certain games within the Take-Two legacy portfolio and the games in the Zynga portfolio, some are doing better than others and some are doing great, some are not doing as well. So, there's a lot of variation within the portfolio itself. So, I wouldn't necessarily characterize it as the T2 mobile businesses are doing better than Zynga or vice versa.\n\nIt's not really how we look at the business anymore.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nIt's all one, it's all Zynga. It's managed by the Zynga team and we have a lot of great titles.\n\nKarl Slatoff -- President\n\nYeah. And we're specifically hoping that with the T2 mobile titles, and we're starting to see some of this collaboration happening that we're going to be -- they're going to be able to benefit from the power of the Zynga mobile platform, which has some really interesting opportunities for us to be more efficient and opportunistic in the consumer life cycle management.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nAnd on the subscription side, look, we've been very cooperative with both Sony and Microsoft on their subscription offerings when it makes sense for us. And my own views have not changed at all since I first started talking about subscription, which is now, I want to say, probably four years ago. The interactive entertainment business is very different than the linear entertainment business. People consume far fewer hours of interactive entertainment in a given month than they do of linear entertainment.\n\nAnd within that consumption, there are far fewer titles consumed in interactive entertainment than there are with linear entertainment. So, I, at least, pose the question as to whether subscription makes as much sense for interactive entertainment as it does for linear entertainment and registered some skepticism, which I still hold. I think the second area of skepticism was whether it made sense, and this is a rhetorical question because I think the answer is no, to offer frontline titles day and day with titles on a subscription service. I don't think that ever made sense.\n\nI still don't think it makes sense. And I believe that it's now becoming obvious that it doesn't make sense. It's just a lost opportunity for the publisher. So, I wouldn't want to speak for my friend, Phil, but our views remain unchanged.\n\nThere probably is a subscription business. It's a catalog business. It's probably best aimed at very avid consumers because those are the consumers who are interested in playing catalog titles, implying a whole bunch of different titles in a given month. But I don't think it's a mass market service that supplants the interactive entertainment business as we know it at all.\n\nAnd I don't think there's any evidence to the contrary so far.\n\nClay Griffin -- MoffettNathanson -- Analyst\n\nOK. Thanks.\n\nOperator\n\nThank you. [Operator instructions] We have a follow-up question from Matthew Thornton with Truist. Please go ahead.\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nThanks, guys. Maybe two quick follow-ups. First one on coming back to mobile, again. Maybe this is for Strauss.\n\nHow do you think about what's currently going on from a macro perspective as opposed to just a user acquisition perspective, given what's going on in the iOS environment, in particular? Is there a way to tease apart what percentage of the pressure is from one versus the other? And relatedly, what's your level of confidence that we come out of? I mean, macro will resolve itself. But from a UA perspective, from an ecosystem perspective, what's your level of confidence that you can kind of control coming out of this doldrum? That's the first question. The second one is a really easy one. Given where the stock price is, I'm kind of curious your appetite around buybacks.\n\nI know you guys have been fairly opportunistic in the past. Obviously, we've taken on some leverage with Zynga, but I'm kind of curious how you're thinking about that, given where the share price is. Thanks, again. \n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nYeah. In terms of mobile, from a macro perspective, I think that you're right. There's a difference between user acquisition and retention and conversion. And on user acquisition, I think we and everyone else is just going to be a bit more selective to drive efficiency.\n\nAnd in terms of retention and conversion, that's a reflection of people just not having to spend mobile. You can enjoy a title without spending in-game. Ninety-plus percent of consumers do not spend in-game. And so, at times when consumers are feeling the pressure of higher prices for fuel and food, for example, they may be less likely to spend money on entertainment, especially when you can have the experience anyhow.\n\nSo, in terms of our expectations, I think this is -- it's a moment where we will, in fact, tune up our UA spend to become more efficient. That's a good thing. And yeah, we will probably see some pressure on in-game purchases for a period of time. As I said earlier in the call, not that I think you can underwrite to this because it's just one person's opinion, I think there'll be pressure for three to six months at least that's driven by the economy and geopolitical factors.\n\nAnd I'm hoping that by the end of '23 -- I believe that by the end of '23, things will normalize and will be on an upward swing again. And Lainie will take the question about buybacks.\n\nLainie Goldstein -- Chief Financial Officer\n\nSo we continue to believe in returning value to the shareholders and via share buyback, but we'll only do so when the conditions are right. And obviously, we believe that there is deep value in our market price currently. But in order to do a share repurchase, we would need to do it in an open trading window and also have the optimal capital structure that supports the purchases. So, we'll see when it makes sense for us to do it.\n\nSo that's how we see it.\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Martin Yang with Oppenheimer. Please go ahead.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nThis is a question referring to your earlier definition of Take-Two entity is a hit factory. I want to know if you hold a similar view over your mobile game portfolio. Do you feel there's a need for a portfolio review on mobile games based on the quality and future potentials? Thank you.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nYeah. At any given time, we're always reviewing our portfolio, both in terms of the performance of the current titles and the potential for new titles that we're working on. And Frank and his team are very focused on making sure to optimize the current title lineup and to make sure that our development for new titles is as effective and poised for success as it possibly can be. Good news is we have a terrific lineup of great titles and our mobile titles all make money.\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Omar Dessouky with Bank of America. Please go ahead.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks. I'm just going to sneak a quick one in here. And apologies if Karl had already answered this by saying that you don't have the details.\n\nBut in terms of part of your synergies may come from applying PC console IP to the casual mobile market using the Zynga development resources, I think when I've spoken with you in the past, you called out an example of like a Red Dead Redemption poker game, for example. Are these mobile games you're envisioning targeted toward fans of the existing PC console franchises like Red Dead or toward mobile-first casual gamers that would play -- that would otherwise play games like Zynga Poker or Empires & Puzzles? \n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nI think it's a great question, thank you. And I think the bottom line is you're probably not going to convert a console player to become a mobile player. You have to appeal to a mobile player. And we believe that legacy IP, when properly developed as a great title, can do just that.\n\nBut it's not a slam dunk by any means. It's still got to be a great game. But you're not going to convince someone who never plays a mobile title to play a mobile title just because it's based on console IP.\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nThank you, Strauss.\n\nOperator\n\nThank you. There are no further questions at this time. I'll hand the floor back to management.\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nI want to thank everyone for joining us today. I want to say thanks, particularly to our dedicated team of colleagues all around the world who continue to do a great job. While it would be nice always to have the best possible news in an upward-sloping curve, this is a business that occasionally does present us with challenges. This team is well suited to challenges.\n\nWe have a great pipeline. We have a great team. We have the ability to deliver. And we wish you all a great holiday season.\n\nThank you for joining us, and thank you for your support.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nNicole Shevins -- Senior Vice President of Investor Relations and Corporate Communications\n\nStrauss Zelnick -- Chairman and Chief Executive Officer\n\nKarl Slatoff -- President\n\nLainie Goldstein -- Chief Financial Officer\n\nEric Handler -- MKM Partners -- Analyst\n\nAndrew Uerkwitz -- Jefferies -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nMatthew Thornton -- Truist Securities -- Analyst\n\nMatthew Cost -- Morgan Stanley -- Analyst\n\nDrew Crum -- Stifel Financial Corp. -- Analyst\n\nMario Lu -- Barclays -- Analyst\n\nDavid Karnovsky -- J.P. Morgan -- Analyst\n\nDoug Creutz -- Cowen and Company -- Analyst\n\nMartin Yang -- Oppenheimer and Company -- Analyst\n\nMatti Littunen -- Bernstein Investment Research and Management -- Analyst\n\nBrian Fitzgerald -- Wells Fargo Securities -- Analyst\n\nOmar Dessouky` -- Bank of America Merrill Lynch -- Analyst\n\nOmar Dessouky -- Bank of America Merrill Lynch -- Analyst\n\nMike Hickey -- The Benchmark Company -- Analyst\n\nClay Griffin -- MoffettNathanson -- Analyst\n\nMore TTWO analysis\n\nAll earnings call transcripts"
}