{
  "companyName": "Workday",
  "companyTicker": "WDAY",
  "quarter": 3,
  "fiscalYear": 2023,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/29/workday-wday-q3-2023-earnings-call-transcript/",
  "content": "Workday (WDAY -0.27%)\nQ3 2023 Earnings Call\nNov 29, 2022, 4:30 p.m. ET\n\nOperator\n\nWelcome to Workday's third quarter fiscal year 2023 earnings call. [Operator instructions] We will conduct a question-and-answer session toward the end of the call. During the Q&A, please limit your questions to one. With that, I will now hand it over to Justin Furby, vice president of investor relations.\n\nThank you. Justin, you may begin.\n\nJustin Furby -- Vice President, Investor Relations\n\n[Technical Difficulty] and Chano Fernandez, our co-CEOs; Barbara Larson, our CFO; Pete Schlampp, our chief strategy officer; and Doug Robinson, our co-president. Following prepared remarks, we will take questions. Our press release was issued after close of market and is posted on our website, where this call is being simultaneously webcast. Before we get started, we want to emphasize that some of our statements on this call, particularly our guidance, are based on the information we have as of today and include forward-looking statements regarding our financial results, applications, customer demand, operations, and other matters.\n\nThese statements are subject to risks, uncertainties, and assumptions, including those related to the impacts of the ongoing COVID-19 pandemic and recent macroeconomic events on our business and global economic conditions. Please refer to the press release and the risk factors and documents we file with the Securities and Exchange Commission, including our 2022 annual report on Form 10-K and our most recent quarterly report on Form 10-Q, for additional information on risks, uncertainties, and assumptions that may cause actual results to differ materially from those set forth in such statements. In addition, during today's call, we will discuss non-GAAP financial measures, which we believe are useful as supplemental measures of Workday's performance. These non-GAAP measures should be considered in addition to, and not as a substitute for, or in isolation, from GAAP results.\n\nYou can find additional disclosures regarding these non-GAAP measures, including reconciliations with comparable GAAP results, in our earnings press release in our investor presentation and on the investor relations page of our website. The webcast replay of this call will be available for the next 90 days on our company website under the investor relations link. Additionally, our quarterly investor presentation will be posted on our investor relations website following this call. Also, the customers' page of our website includes a list of selected customers and is updated monthly.\n\nOur fourth quarter fiscal 2023 quiet period begins on January 15, 2023. Unless otherwise stated, all financial comparisons in this call will be to our results for the comparable period of our fiscal 2022. With that, I'll hand the call over to Aneel.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nThank you, Justin, and welcome to Workday's third quarter fiscal 2023 earnings conference call. I'm happy to report that we had a solid Q3 as we once again outperformed across our key operating metrics. There is no question that the macro environment presents increased uncertainty. But as we've said before, we are well positioned in this type of environment because our cloud finance and HR solutions are truly mission-critical.\n\nAs our Q3 results showed, more and more organizations are selecting Workday as their trusted partner to help them successfully navigate today's changing world. We remain confident in our ability to capitalize on the opportunity ahead and are pleased to announce our first ever share repurchase program and up to $500 million under authorization. This program will help reduce the rate of our share dilution going forward and is driven by our belief that our share price is undervalued given the long-term growth opportunity ahead. Barbara will share details shortly, but know that we feel confident that we'll reach a scale where we can roll out this repurchase program, while continuing to prioritize investing for long-term profitable growth.\n\nWith that, I'd like to share some highlights from the quarter. In Q3, we further solidified our position as a leader in cloud HR with notable new HCM customers, including Intermountain Health, SGS, and Texas Roadhouse. In addition, we had several key HCM go-lives, including Best Buy, Canadian Tire Corporation, and the state of Oklahoma. For Workday Financial Management, we continue to see strong demand and momentum in Q3.\n\nKey new wins included a Fortune 200 provider of information technology solutions, Cincinnati Children's Hospital Medical Center, EZCORP, and Thomas Jefferson University. It's important to note that each of these customers have also selected us for HCM, reinforcing the power of the full Workday platform, providing further evidence that companies are going all-in with us. Key financial management go-lives during the quarter included city of Baltimore and Medical University of South Carolina. Q3 also saw us get back in person for Workday Rising, our annual customer conference for the first time since 2019.\n\nWe had nearly 16,000 in-person and virtual attendees, and it was great to experience the energy and see firsthand our community is growing and evolving. This was highlighted by the fact that this year's event has a large percentage of senior leaders, finance, and IT attendees ever. One big takeaway from Rising is that our innovation story is resonating with customers as we evolve to be more open and connected. While we've traditionally targeted the offices as CHRO and CFO, we have placed increased focus recently on the office of the CIO, which presents another growth opportunity for us.\n\nOne solution in particular that was a popular topic among IT attendees was Workday Extend. Workday Extend lets customers and partners build their own unique solutions on top of Workday, which is a huge point of emphasis for CIOs and, in their eyes, positions us even more as a true platform player. While we announced several availability at Workday Extend in 2020, we've continued to see accelerated demand for it over the last year as the need for organizations to quickly innovate and adapt in today's business environment increases. We also announced new, more personalized UX enhancements that meet every type of work they use and the natural flow of their work, such as mobile devices, Microsoft Teams, and Slack, which helps us to address another CIO priority as they are more focused than ever on driving increased employee engagement.\n\nAnd finally, we further reinforced our leadership in artificial intelligence and machine learning with the announcement of next-generation skills technology that allows customers to more easily and securely bring skills data in and out of Workday. This helps customers leverage the full power of machine learning to gain deeper insights into their workforce skills and deliver more personalized employee experiences. In closing, we once again delivered a solid quarter with strength across a number of key growth initiatives, showcasing why Workday is the backbone of digital business. And while we expect that the macro uncertainty will cause our growth to moderate in the near term, we continue to believe we are well positioned to navigate this environment and emerge even stronger.\n\nDriving constant innovation to address our customers' evolving needs has always been key to our success and will continue to be our focus in this environment. With that, I'll turn it over to our co-CEO, Chano Fernandez. Chano, over to you.\n\nChano Fernandez -- Co-Chief Executive Officer\n\nThank you, Aneel, and thank you to everyone for joining today's call. I want to start off by offering my sincere thanks to the more than 17,500 workmates that help us deliver another solid quarter. Your relentless focus on the customer continues to push us and the broader Workday community forward. Great job, team.\n\nI've been on the road a lot the last few months, including Workday Rising in Europe, which has wrapped up in Stockholm and Workday Rising in U.S. back in September. I've had the opportunity to spend time with hundreds of customers and prospects, and there are a couple of key themes emerging. First, despite all the challenges that companies are facing today, they increasingly realize the pressing need to modernize their HR and financial systems.\n\nThe executives that I speak with have different viewpoints on what the macroeconomic climate will look like in the year ahead. But one thing they agree on is that the change is constant, and it's nearly impossible to navigate with legacy systems. Second, there is a clear desire to consolidate and prioritize spend across a new organization's more strategic technology vendors. Given our positioning as the backbone of digital business across HR and finance, this trend has led to more and more companies going all-in with Workday as they look to harness the power of their data across the enterprise.\n\nAnd when I look at our solid Q3 results across both the large and medium enterprise is a direct validation of these themes being seen across organizations of all sizes. From a geographic standpoint, we saw solid results across North America, with a number of core HR and FINS wins that Aneel mentioned, in addition to several strategic expansions across the Fortune 500. APA also outperformed with wins at Bank of Queensland, Fletcher Building, Ono Pharmaceutical, and Trip.com, to name a few. And in EMEA, we had a number of important wins and expansions, including SGS, Alliance Medical Group, and Equiniti.\n\nOur customer base sales team once again saw outstanding growth, a direct reflection of the trust that customers are placing in us and a validation of our strategy. We drove very strong renewal rates in Q3, and we closed a number of strategic expansions at companies such as Accenture, University of Maryland, the state of Nebraska, Pick n Pay, Puma, and VF Corporation. As we shared at our recent analyst day, our customer base momentum is being driven by our broad portfolio. Solutions such as journeys, help and talent optimization, for example, are seeing strong adoption as customers look to support employee experience, while our scheduling, time tracking, and payroll solutions are all resonating as customers increasingly focused on labor optimization.\n\nAnd other products such as Planning, Extend, Accounting Center, VNDLY, and our Spend Management solutions are all contributed to this quarter's strength across the customer base. Our industry focus continues to pay off. In Q3, nowhere was this more evident than the healthcare vertical, where we had a strong growth in new ACV and where we surpassed $0.5 billion in annual recurring revenue. By far, the two largest costs for healthcare organizations are labor and materials.\n\nAnd by leveraging our full suite of HCM, FINS, and supply chain solutions, they are able to help optimize spend across these critical areas. In fact, all of our larger Q3 healthcare wins were full suite, and including Workday Supply Chain Management. We also saw healthy momentum within the professional services industry, highlighted by the aforementioned expansion at Accenture, as we continue to co-innovate across the quality platform, including significant new developments in the skills cloud, public cloud, and accessibility. Other strategic wins in the professional services industry, including Novozymes and Reed Global, which was a full suite win.\n\nOur expanding partner ecosystem is also becoming an increasingly important driver of our growth. Key to our strategy is driving core innovation across the platform, which increases the differentiation of our solutions, enables even faster innovation to address real-time customer challenges, and allows our partners to leverage their deep industry and solution insights to differentiate in the market. Examples of recent partner-driven innovation built on the Workday platform include Accenture's digital revenue operations solution, which integrates CPQ capabilities with Workday's billing and revenue automation, to enable seamless quote-to-cash functionality for software and technology companies. Another great example is employee document management, built by partner, Kainos, on Workday Extend, which provides our customers with advanced document generation, access control storage, and finely tuned document retention rules.\n\nThese are just a few several solutions that were recently released by our partner ecosystem, and we have those and more on the road map. As we move into our fourth quarter, the environment remains uncertain, which has led to increased scrutiny and the lengthening of certain sales cycles, particularly with the net new opportunities. While we aren't immune to these and see signs that it will persist into next year, we are confident in our diverse pipeline and are focused on executing in Q4 and laying a strong foundation for FY '24 and beyond. With that, I will turn it over to our CFO, Barbara Larson.\n\nOver to you, Barbara.\n\nBarbara Larson -- Chief Financial Officer\n\nThanks, Chano, and good afternoon, everyone. As Aneel and Chano mentioned, we delivered solid Q3 results in the face of continued economic uncertainty, a testament to strong execution across the company, as well as the strategic and mission-critical nature of our solutions. Subscription revenue in Q3 was 1.43 billion, up 22% year over year. And professional services revenue was $167 million, up 7%.\n\nTotal revenue outside of the U.S. was 394 million, representing 25% of total revenue. Twenty-four-month backlog at the end of the third quarter was 8.62 billion, growth of 21%. The result was driven by solid new business sales and strong renewals, with gross and net revenue retention rates over 95% and over 100%, respectively.\n\nTotal subscription revenue backlog at the end of Q3 was 14.10 billion, up 28%. Our non-GAAP operating income for the third quarter was 314 million, resulting in non-GAAP operating margin of 19.7%. Margin overachievement was driven by revenue outperformance, favorable cost variances across the business, and the timing of certain expenses shifting into Q4. Q3 operating cash flow was $409 million, growth of 6%.\n\nOur cash flow this quarter was impacted by a $55 million semiannual interest payment associated with our Q1 debt offering. We also paid off the principal balance on our 1.15 billion convertible debt with cash in October, resulting in a reduction to our non-GAAP diluted share count of roughly 8 million shares. Given the late Q3 timing, this share count reduction will be fully reflected in our non-GAAP weighted average share count in Q4. During the quarter, we successfully added approximately 600 net new employees, ending Q3 with a global workforce of more than 17,500.\n\nWe expect a strong moderation of hiring as we move into Q4, but we'll continue to add key talent across strategic growth areas of the business, notably go-to-market and product and technology. Overall, we're extremely proud of the strong companywide performance in Q3, and we're focused on executing in Q4, our seasonally strongest quarter of the year. Now, turning to guidance, which reflects both the continued momentum in our business, while also balancing an uncertain macro environment. With that context, our guidance for FY '23 subscription revenue is now 5.555 billion to 5.557 billion, representing 22% year-over-year growth.\n\nWe expect Q4 subscription revenue to be 1.483 billion to 1.485 billion, 21% year-over-year growth. We now expect professional services revenue to be 645 million in FY '23, with the slight reduction driven by the delay of a large project. For Q4, we expect professional services revenue of 147 million. We expect 24-month backlog to grow approximately 19% year over year in Q4.\n\nWe expect Q4 non-GAAP operating margin of approximately 17.5%, which includes some expenses that shifted out of Q3. Our FY '23 non-GAAP operating margin guidance is now 19.2%. GAAP operating margins for both the fourth quarter and the full year are expected to be approximately 23 percentage points lower than the non-GAAP margins. This includes a change to our employee stock plan that will take effect in Q4 to provide more flexibility to our employees during the open trading window each quarter.\n\nOur vesting date will move from the 15th to the 5th of each month for all outstanding grants, resulting in an acceleration of stock-based compensation expense of approximately $30 million in Q4. This change will result in reduced stock-based compensation expense by the same amount over the next few years and has no impact on our dilution. The FY '23 non-GAAP tax rate remains at 19%. We are maintaining our FY '23 guidance for operating cash flow of 1.64 billion but are reducing our capital expenditures outlook to approximately 375 million, reflecting the timing of certain data center and real estate investments being pushed out to future periods.\n\nAnd as Aneel mentioned, we are pleased to announce a share repurchase program with authority to repurchase up to 500 million in shares over an 18-month period. We will continue to prioritize allocating capital toward organic innovation, followed by targeted M&A. But given our strong balance sheet and free cash flow, we intend to use a portion of our capital toward the repurchase of shares, enabling us to partially offset future dilution from employee stock programs. This repurchase program is a direct reflection of our confidence in the business and our view that our shares are currently undervalued.\n\nWhile we are early in our planning cycle for next year and have an important Q4 ahead, we'd like to provide a preliminary view of FY '24. As discussed at our financial analyst day, we have a significant long-term opportunity and multiple growth levers that drive our goal of sustaining 20% plus subscription revenue growth on our path to $10 billion in revenue. While this remains our multiyear goal, given the continued macro uncertainty, we believe it's prudent to provide a preliminary FY '24 subscription revenue range of approximately 6.5 billion to 6.6 billion, or 17% to 19% year-over-year growth. This outlook takes into account the lengthening of sales cycles that we're currently seeing impact our net new business.\n\nFrom a margin standpoint, we currently expect FY '24 non-GAAP operating margin expansion of 150 to 200 basis points from FY '23 levels, placing us firmly on track to our target of 25% non-GAAP operating margin and 35% operating cash flow margin at 10 billion in revenue. The expected margin expansion is driven by the scalability of our model, a strong moderation of hiring, and ongoing expense discipline. We plan to operate the business with agility, and we'll continue to appropriately balance growth investments based on what we see in the underlying market environment. And, finally, I'll close by thanking our amazing employees, customers, and partners for their continued support and hard work.\n\nWith that, I'll turn it over to the operator to begin Q&A.\n\nOperator\n\n[Operator instructions] Our first question is from Kash Rangan with Goldman Sachs. Please proceed with your question.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you so much and fabulous, fabulous quarter, given the macroeconomic conditions. I was wondering if you could give us some perspective. In some sense, this is a recession that everybody has been expecting. Nobody's going to be surprised.\n\nI was wondering if you could offer some insights into how Workday has been able to execute so well during a tough time and other software companies are facing headwinds. And to the extent we get some relief next year, if the economy does improve, could you do even better considering that your results are actually quite impressive? Thank you so much.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nWell, I don't think we'll comment next year just quite yet, Kash, but thank you for the kind comments. I think the value proposition of our products, you know, works in a downturn just as it does in a good market, just like it did in 2008, 2009 and every other downturn. Chano, do you want to add anything?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nNo, I think I agree with what you said, Aneel. I believe the mission-critical applications of our solutions really resonates with our customers as they are modernizing their HR and finance solution. And as I said in my comments as well, Kash, there is a consolidation of spend across strategic vendors, and we clearly are being one of those these days.\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nThank you so much.\n\nOperator\n\nOur next question is from Kirk Materne with Evercore. Please proceed with your question.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nHi. Thanks very much and I'll echo the congrats on a really nice quarter in a tough environment. I guess, Chano, you talked about some deal cycles extending. I was just wondering if you could talk a little bit about what you're seeing at the top of the funnel.\n\nObviously, you guys sort of came out perhaps of the COVID recession a little bit later than some others. I think there's a fear out there that once we get through this current wave of deals in your pipeline that there might be some sort of, you know, cliff in terms of net new billings. But, you know, it sounds like you guys feel pretty good about your pipeline. So, I was wondering if you could just sort of expand on that? Thanks.\n\nChano Fernandez -- Co-Chief Executive Officer\n\nThank you for your question, Kirk. Overall, companies continue to prioritize HCM and financials transformations, and we see ongoing momentum in important growth areas like our customer base team. What is a clear market trend, as I said, toward consolidation of vendors and as well the medium enterprise. There's good pipeline momentum, but maybe, Doug, you can add some color in terms of pipeline and deal dynamics overall?\n\nDoug Robinson -- Co-President\n\nYes. I think, well, you captured two of it, which is I described, Kirk, as -- we've got a diversity of revenue streams. So, as Chano mentioned, medium enterprise performed well. We've got the customer base in motion.\n\nAnd that was a theme that I certainly heard at our customer conference is our large customers wanting to consolidate rationalize number of suppliers and expand their footprint with us. So, I think that certainly helps. In terms of like top of the funnel, sort of the core of your question, it's really interesting in that our Q3 pipeline build, so the pipe we're building now, which is largely about next year, met our internal targets. So, we're seeing project formation.\n\nAt the same time, we're seeing some projects elongate. So, I think Chano mentioned this. But they tend to be large enterprise net new. Those projects have extra steps to complete.\n\nAt the same time, at the top end, the starting of projects is meeting the goals that we've established internally.\n\nKirk Materne -- Evercore ISI -- Analyst\n\nThank you, all.\n\nOperator\n\nOur next question is from Mark Murphy with JPMorgan. Please proceed with your question.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nYes. Thank you very much, and I'll add my congrats. I'm interested in whether it's possible that the volatility of this type of environment where you have so many vectors moving around inflation, interest rates, FX, supply chain issues. Is it possible that it's coming together in a way that really elevates the Workday value prop with integrated planning, you know, cloud-based, maybe more so than in the smooth-sailing environment that we had in the last decade.\n\nBecause as Kash mentioned, you know, you're navigating your way through this very well. I'm just wondering if you see any effect of that. Maybe it's increasing some of your win rates and maybe it builds up a little pent-up demand for some time in the future when the environment starts to improve?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nWell, I guess, I'd start with I wish that was the case across the board. We definitely see some -- you see it in a downturn, you see some movement, too, while I got to get on the right stuff to help me manage through these volatile environments. At the same time, there are other customers that are just cautious in making new decisions. And so, I think they tend to balance each other out.\n\nI'm not sure there's a -- I'm not sure it's a big boost for us or a big negative for us. You know, we're all seeing the same environment. But there are definitely customers who are behind on making the transition. I feel like this is a catalyst to make that transition.\n\nAnd then there are others who already made the transition that maybe think, \"Hey, let's be cautious on, you know, follow-on purchases.\" Chano, anything to add?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nNothing to add.\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nThank you.\n\nOperator\n\nOur next question is from Keith Weiss with Morgan Stanley. Please proceed with your question.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nThanks. This is Josh Baer on for Keith. I was hoping you could expand a bit on the macro assumptions that are embedded in that FY '24 subscription revenue guidance range. Just wondering what areas get worse? What stays the same when thinking about different geographies, as well as new business from new logos or expansion and renewals from existing customers? Thanks.\n\nBarbara Larson -- Chief Financial Officer\n\nHi, Josh. Thanks for your question. So, the guidance range that we provided is our best view at this time. It takes into account the continued momentum across important growth areas, such as customer base, medium enterprise, but also balancing that with lengthening sales cycles that we're seeing impact our business, particularly our net new opportunities.\n\nSo, given the uncertain environment, we provided an estimated subscription revenue range with that low end of the range, assuming a larger impact to sales cycles than we're currently seeing today.\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nThat's really helpful. Thank you.\n\nBarbara Larson -- Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nOur next question is from Brad Zelnick with Deutsche Bank. Please proceed with your question.\n\nJustin Furby -- Vice President, Investor Relations\n\nBrad? Operator, can we go to the next question, please?\n\nOperator\n\nOur next question is from Alex Zukin with Wolfe Research. Please proceed with your question.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nHey, guys. Thanks for taking my question. I'll extend my congratulations not only on the quarter, but on the prescriptiveness of the guide, both on top and bottom line in what is clearly a very uncertain and tenuous environment. So, I guess maybe just the first one, if we look at the patterns emerging in the sales cycles in the business, I guess, Aneel or Chano, can you guys compare and contrast this with -- from a pipeline perspective going into 4Q, you know, what are you expecting the impact to be in your biggest quarter on bookings on new ACV growth on -- you know, and maybe FINS versus HCM specifically, where you feel a little bit, you know, better or compare and contrast that, I think, would be super helpful.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nWell, let me just offer a high-level commentary. I spent a lot of time with other CEOs. And this is not 2008, 2009. You know, no one sees the world coming to an end like they did at that time.\n\nI think right now, we're in a world of caution, where no one's quite sure what's going to happen, but things don't feel really bad. And so -- but caution and stopping can sometimes look the same. And so, it's kind of hard to predict right now. Every CEO I talked to is still relatively feeling positive about their business, but worried about the economic underpinnings of what the Fed is doing and the potential recession.\n\nAnd so, I think, the word that I keep coming back to is everybody is cautious. And I don't know how that -- Chano, how do you think that reflects in the pipeline and Q4 and other quarters, but it's -- this is not an end-of-the-world scenario, not at least yet, like '08, '09.\n\nChano Fernandez -- Co-Chief Executive Officer\n\nYes. Thank you, Alex, for your question. I would say, first, when it comes to HCM or FINS, we don't see any significant difference between one or the other. So, they're proportionally impacted, given the macro environment.\n\nWhen it comes to Q4, I would say we had the pipeline to execute on the quarter. Of course, you know, that usually will not manifest as a prioritization because those projects have been already prioritized. But it may have some lengthening of sales cycles as we said before, particularly on net new deals and opportunities that they're more scrutinized on those, right? And Doug already commented on the growth pipeline for next year.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. And then, I guess, if I think about what you're saying around net new and how well, I think, you're doing on renewals and selling into the base specifically, is it fair to assume that, you know, in the near term, there could be a bit more bookings concentration coming from existing customers? And kind of how well -- how important is that dynamic that informs some of your margin commentary for next year, given it should be a little bit easier, it should be a little bit more predictable to sell into the base?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nYes, Alex, it is fair to assume that there will be more concentration on the customer base and areas like medium enterprise, as we said before. And then, hence, we'll, you know, put more focus on both marketing environments and sales go-to-market environment into those areas. Of course, that will potentially provide higher yield on these times.\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nPerfect. Congrats, guys. Thanks, again.\n\nOperator\n\nOur next question is from DJ Hynes with Canaccord. Please proceed with your question.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nHey, thanks guys. Maybe building off Alex's last question there. I mean there's lots of interesting partner commentary in the script. I'm curious about the level of collaboration you have with partners on what they're working on with Extend or in industry accelerators.\n\nAnd assuming you have visibility there, maybe you could talk a bit about like where you draw the line on what Workday might own or build directly versus what you let go to partners?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nPete, do you want to talk about the product side first? And then, Chano can talk about the partner side.\n\nPete Schlampp -- Chief Strategy Officer\n\nSure. Thanks again for that question. As you heard us talk about, the momentum with Extend that we've seen recently has been great. We talked about that a lot, both in Stockholm and in Orlando at our user conferences this year, now over 750 applications in production.\n\nWhen it comes to where that momentum is coming from its customers and its partners as well. Partners are beginning to build on the Extend platform and Extend Workday applications, as well as build net new applications that connect with HCM and financials. So far, the -- our customers have been getting value through both of those. The question of where do we draw the line between what is ours and what is our partners, I'll hand over to you, Chano.\n\nChano Fernandez -- Co-Chief Executive Officer\n\nYeah, I think, as we commented on some of my prepared remarks, I mean, clearly, driving co-innovation with our partners across the platform is very critically important. You would say, where you draw the line when, you know, something is kind of would define, or I would define the last mile in a particular industry, or we need some more content-driven specific understanding of that value-add in that industry with a partner. There's where we see an opportunity to collaborate with our partners. I mentioned some of these solutions that we're building with -- for different industries, like, you know, the revenue operation solution.\n\nAgain, that is very critical to the software and technology companies. There are others that would be a bit more, let's say, across industries like the document management -- employee document management that I provided on. But honestly, we don't see that as a core, let's say, value add from us in terms of building that solution. But, of course, it's adding value to our customers there and partners take just advantage of the maturity of Extend to bring that value add that is resonating with our customers.\n\nSo, we're really pleased, as you can imagine, that customer partners can differentiate and bring additional offering to our customers.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYes, makes sense. And then, Barbara, maybe I could sneak in a follow-up for you. The buyback is great to see us analysts always ask for more. Why not be more aggressive given where the stock is, the strength of the balance sheet, you know, expect the cash generation next year? Like what were the considerations there?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nI'll answer that one because I think Barbara probably wanted to do more. You just don't know what you're going into a tough economic environment, and cash is king. And so, we wanted to be conservative. And, you know, if we come out in a good market environment in the next six to nine months, you definitely could see more.\n\nBut there's just a balance of risk.\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nYes, perfect. OK. Thank you guys. Congrats.\n\nOperator\n\nOur next question is from Raimo Lenschow with Barclays. Please proceed with your question.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nHey, thank you. Congrats from me as well. Chano, the one thing that we're seeing in the industry at the moment is that there seems to be more money in HR post-pandemic with the great reshuffle, etc. Could that -- are you seeing that in terms of like interest of pockets of where customers are? And do you think that's kind of more a short-term thing, and we're at the back part of that trend? or do you think HR HCM strategically is having a new position in the enterprise? Thank you.\n\nChano Fernandez -- Co-Chief Executive Officer\n\nThank you, Raimo for your question. I think both of them, to be honest, has some good tailwind out of the pandemic. But clearly, of course, that nets out of balance out with the macro environment we are living into. But I would say that, now, the financial transformations, we see those in the market, and they are taking place as we speak.\n\nAs a dynamic of companies having a tough time to just navigate through their finance modernization or honestly doing simple things like closing their books online in terms of many legacy platforms and in terms of a lot of manual processes, that could just not happen once you are not in the office. Clearly, employee engagement as a whole in HCM, the skills area, all the machine learning, you know, and AI that we're bringing to those processes are obviously, you know, value-add to that company to see and want to take advantage of and continue to be a great tailwind for the HCM value proposition as a whole.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nYeah. And then one follow-up. If you think about selling in this kind of slightly more tougher environment, can you talk a little bit maybe about the steps you're taking in terms of sales execution to kind of make sure you continue to deliver in this market. I'm thinking about higher pipeline coverage kind of making sure you kind of -- you time the deals better, etc.\n\nLike where are we on that journey of implementing these kind of recession handbook kind of selling kind of policies that we used to take out in the older days?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nYeah. Doug, do you want to add some color there on the sales strategy in the market?\n\nDoug Robinson -- Co-President\n\nYeah, sure. I think Aneel or you, Chano, might have mentioned it after Q1, but we pivoted to our ROI-based and TCO-based way to engage with customers right at Q1. Of course, we've always done business cases with our customers. But entering a tougher environments, it comes down to TCO, hard dollars that you can take out, system rationalization productivity.\n\nSo, I think it's showing up really focusing with our customers on the HR side. So, there's no doubt, tight labor markets. And so, that's driving, I think, the TCO on that side of it. And it was touched on earlier by Aneel.\n\nYou know, we had a really good Q3 as it relates to financials. So, FINS plus performed well. And those are ROI-driven as well. And those are companies looking for sure, it might start with an aging -- retiring older systems, but it pivots pretty quickly when they engage with us to that plan, execute, analyze and offering up more business agility in an uncertain environment.\n\nSo, those are the things from a go-to-market, from a field-deployed resources standpoint, that we're spending a lot of time with customers on the business case.\n\nRaimo Lenschow -- Barclays -- Analyst\n\nPerfect. Thank you. Well done.\n\nOperator\n\nThank you. Our next question is from Brad Sills with Bank of America Securities. Please proceed with your question.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thank you so much. I wanted to ask a question around backlog for next year. I think, Chano, you made some comments that you feel good about Q4 pipelines heading into Q4.\n\nAnd the question on everyone's mind is really what about next year. There's a lot of moving parts. In your conversations with office of CFO, office of HR, what are they saying with regard to budgets for next year? Do you feel pretty confident that you can sustain this kind of growth, you know, into next year as well?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nWell, Brad, thank you for your question. Right now, we're exactly on those discussions, right, where companies are going through their planning and budgeting cycles. And it is a question of prioritization of projects. And we're having those discussions that that was commenting on that are really TCO- and ROI-based, right? So, clearly, here where you see some different scenarios and our guidance, particularly depending on what happens on some of the new local sales cycles that might put some lengthening.\n\nAnd, clearly, even though they might be building right now, maybe fall outside of next year or some of them that just may be pushing forward. But right now, we're having most of those discussions. Overall, we feel good given the momentum we have and given the momentum on the new pipeline build and the conversations we're engaging with, the strength of our customer base, our medium enterprise, and the diversity of our business, as Doug has commented. But clearly, we are cautiously, you know, monitoring what's going on in the environment.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Chano. And then one more, if I may, please. Just on the verticals. You called out some strength in financials, healthcare.\n\nIs there a case to be made that perhaps you guys have more exposure to more resilient verticals, you know, with those in particular public sector education kind of less affected by, perhaps, the macro?\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nYou know, we're pretty diversified across, you know, all the industries and some have held up better than others. When I look at what's happening in Silicon Valley, we definitely have a bunch of tech companies, but we're not exposed to tech the way maybe a newer company might be where they got a huge amount of exposure to just tech companies. So, -- and our tech companies tend to be the mature large company. So, I don't think there's any particular sector that's held us up.\n\nI would say financial services is strong, though. The one beneficiary of rising interest rates is the financial services sector, and they continue to grow. And we have a very strong presence there.\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nThanks, Aneel.\n\nOperator\n\nOur next question is from Brent Thill with Jefferies. Please proceed with your question.\n\nBrent Thill -- Jefferies -- Analyst\n\nThanks. Aneel, just to follow-up on the verticals. A number of the partners have been talking about strength in state and local government and higher ed. I'm curious if you could drill in on those two to give us a sense of what you're seeing right now in both those sectors.\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nYou know, I may turn that one over to Doug to talk about. Doug, are you there?\n\nDoug Robinson -- Co-President\n\nYes, sorry about that. I was on mute. The question was around education, government. Is that correct?\n\nBrent Thill -- Jefferies -- Analyst\n\nState and local and higher ed.\n\nDoug Robinson -- Co-President\n\nYes. So, both performed well in the quarter. We had a number of students or student deals, which, for a while there, we were doing a number of financials, HCM on the higher ed side, but we took down some student deals in the quarter and showed really nice growth in Q3. And so, we feel good about, you know, both of those verticals right now.\n\nBrent Thill -- Jefferies -- Analyst\n\nBarbara, can I just follow up real quick on international? It was the lowest growth in five quarters. Is there anything to point out in Europe versus the U.S., kind of, just the classic spillover of what we've been hearing, or is there anything specific on an execution? Can you just compare and contrast what you're seeing?\n\nChano Fernandez -- Co-Chief Executive Officer\n\nI would say, clearly, the environment is more uncertain in Europe. Obviously, you know, on top of everything else going on in the world, we have energy as a big challenge. And where we see, let's say, an increase signs of deals and sell cycles lengthening that things to happen in Europe. And I would say, in general, we are more cautious overall what's going there in the near relative terms than in other markets and other segments.\n\nBrent Thill -- Jefferies -- Analyst\n\nGreat. Thanks.\n\nOperator\n\nWe have time for one final question from Scott Berg with Needham. Please proceed with your question.\n\nScott Berg -- Needham and Company -- Analyst\n\nHi, everyone. Thanks for taking my question. And I guess this one will be relatively straightforward. You all called out slowness in the enterprise segment a couple of different times.\n\nWe talked about the mid-market being, I guess, relatively untouched. Can you help us kind of understand maybe what's going on in the mid-market to not really see any weakness today? I think that's an interesting kind of a change at least relative to what we're seeing out there. And then, as we think about the guidance within the mid-market, is the slowness or maybe additional macro uncertainty that's impacting the low end of the guidance, do you have some sort of conservatism baked into any potential slowdown in the mid-market also impacting that guidance? Thank you.\n\nChano Fernandez -- Co-Chief Executive Officer\n\nYes, I guess we've not said that the mid-market is not impacted. What we said is that, of course, we had overall more strength in the medium enterprise and in the customer base. If you look at what it tends to happen more scrutiny around either the business case or additional approvals. Clearly, those are on the larger deals and larger companies that we usually -- we tend to see it more.\n\nOur value proposition is strong and resonates and quicker time to value fixed cost of implementations, very predictive ones across HCM and finance in the mid-market. Brings good ROI, brings good total cost of ownership in terms of the financials and main transformation as a whole, and that is a value proposition that mid-market is taking the same on a faster clip as they are modernizing their legacy system on their platforms.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJustin Furby -- Vice President, Investor Relations\n\nAneel Bhusri -- Co-Chief Executive Officer\n\nChano Fernandez -- Co-Chief Executive Officer\n\nBarbara Larson -- Chief Financial Officer\n\nKash Rangan -- Goldman Sachs -- Analyst\n\nKirk Materne -- Evercore ISI -- Analyst\n\nDoug Robinson -- Co-President\n\nMark Murphy -- JPMorgan Chase and Company -- Analyst\n\nJosh Baer -- Morgan Stanley -- Analyst\n\nAlex Zukin -- Wolfe Research -- Analyst\n\nDJ Hynes -- Canaccord Genuity -- Analyst\n\nPete Schlampp -- Chief Strategy Officer\n\nRaimo Lenschow -- Barclays -- Analyst\n\nBrad Sills -- Bank of America Merrill Lynch -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nScott Berg -- Needham and Company -- Analyst\n\nMore WDAY analysis\n\nAll earnings call transcripts"
}