{
  "companyName": "Dave & Busters Entertainment",
  "companyTicker": "PLAY",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/07/dave-busters-entertainment-play-q2-2022-earnings-c/",
  "content": "Dave & Busters Entertainment (PLAY 1.05%)\nQ2 2022 Earnings Call\nSep 07, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, and welcome to Dave & Buster's second-quarter 2022 earnings conference call. All participants will be in listen-only mode. [Operator instructions] I would now like to turn the conference over to Michael Quartieri. Please go ahead.\n\nMike Quartieri -- Chief Financial Officer\n\nThank you, Andrea, and thank you all for joining us today. Joining me on today's call is Chris Morris, chief executive officer. After our prepared comments, we will be happy to take your questions. This call is being recorded on behalf of Dave & Buster's Entertainment, Inc.\n\nand is copyrighted. Before we begin our discussion on the company's results, I'd like to call to your attention to the fact that in our remarks and our responses to questions, certain items may be discussed, which are not entirely based on historical fact. Any of these items should be considered forward-looking statements relating to future events within the meaning of the Private Securities Litigation Reform Act of 1995. All such forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ from those anticipated.\n\nInformation on various risk factors and uncertainties have been published in our filings with the SEC, which are available on our website. In addition, our remarks today will include references to financial measures that are not defined under generally accepted accounting principles. Investors should review the reconciliation of these non-GAAP measures to the comparable GAAP results contained in our earnings announcement released this afternoon, which is also available on our website. Also, pro forma financials, including Main Event for the prior fiscal year and the current six months ended July 31, 2022, is available on Form 8-K filed with the SEC and available on our website.\n\nNow I'll turn the call over to Chris.\n\nChris Morris -- President and Chief Executive Officer\n\nOK. Thank you, Mike. Good morning, everyone -- or good afternoon, rather. We are pleased to report solid financial results, as well as strong operational progress during the quarter as we brought together the Dave & Buster's and Main Event organizations.\n\nAs noted in our press release, we reported record quarter revenue and record second quarter adjusted EBITDA this period. We experienced strong guest visitation and spending across both brands this quarter. Our teams continue to deliver high levels of service to our guests while simultaneously beginning the process of integration into one company. I want to recognize the efforts of our combined team as we work to capture the synergies from our combination and adopt best practices across our brands.\n\nWhile we saw substantial headwinds during the quarter from wage and commodity inflation, we remain focused on driving revenue and strong cash flow while aggressively working to mitigate inflationary pressures with operational efficiencies and appropriate pricing actions. We have significant upside potential, and with our continued focus on innovation, growth, and value creation, we are determined to deliver on that potential. We are excited about the future of this new organization and look forward to sharing our progress in the coming quarters. OK.\n\nNow, let me share with you my impressions from the first 60 days as CEO of the company, my thoughts on the current environment, and a few of our near-term strategic priorities. My primary focus so far has been centered on three near-term priorities: first, performing a deep dive into our store operations; second, getting an in-depth understanding of our guests; and third, driving the integration of our combined companies to establish a winning culture. Tony Weiner, our chief operating officer, and I just completed our field listening tour. We held meetings with over 300 team members, met with every general manager and sales manager within the Dave & Buster's brand, and visited over 30 stores.\n\nThis tour enabled us to gain a hands-on understanding of our operations and to hear directly from our front lines about our challenges and more importantly, our opportunities. I'm delighted to report that we have a passionate group of team members who are dedicated and eager to serve our guests and propel our leadership position in our category. We are working diligently to gain insights into our guests, supported by data and analytics to understand their desires and expectations to better align our product offerings and enhance our position in the market for both Dave & Buster's and Main Event. Our merger integration is off to a terrific start.\n\nWe are ahead of schedule on our key timelines. We've already implemented over $11.5 million of annualized synergies to date and increased our target from $20 million to $25 million. We've combined our corporate offices under one roof, and the team is aligned and focused on delivering exceptional results. As our teams continue to come together and gel, we are capturing synergy opportunities, implementing best-in-class operating initiatives, and leveraging the scale of our combined operations.\n\nAs we look further into the future, the senior leadership team will be taking the next few months to build our long-term strategic plan based on the output of our in-depth work. After our board approves our midrange plan, we plan to host an Investor and Analyst Day in Dallas, likely in late Q1 next year, where you'll have a chance to meet the entire senior leadership team and hear more about our plans to grow this business. Now, let me touch upon recent trends and near-term operating initiatives. Our second quarter results clearly demonstrate that guests continue to visit and spend at a higher level than previously seen in either 2021 and 2019.\n\nWhile the special events business has yet to fully recover to pre-COVID levels, we are seeing meaningful improvement in booking trends, and I'm optimistic that the comparisons will turn positive in the back half of this year. We are confident that guests will continue to visit our stores as we improve our offerings, increases the level of service, and refresh our physical footprint where needed. While we still expect to see higher levels of inflation over the next few quarters, we have worked and will continue to work on offsetting these additional cost pressures, primarily in labor and commodities, as well as with synergies from the acquisition and other cost savings initiatives. In the near term, we are focused on a number of key initiatives.\n\nFirst, we are gearing up for a strong holiday banquet season in the fourth quarter. Our special events sales teams are focused, and our operators are ready to execute; second, today, we launched our national where winners watch football campaign featuring Kansas City Chiefs' great, Travis Kelce. This national media campaign includes a national partnership with ESPN and includes spots airing on ESPN's Sunday NFL Countdown, NFL Live, College GameDay, College Football Games, Sports Center, and more. The campaign also includes digital and social platforms like CTV, YouTube, TikTok, and Twitter and is designed to drive awareness of Dave & Buster's as a great football viewing destination.\n\nWe are also taking steps to strengthen our brand identities and on honing our customer communications and value propositions. An example of this would be our D&B Rewards Program, which continues to grow, now surpassing 4 million members since its launch in November 2021. Year to date, loyalty accounts for higher visitations. Loyalty numbers visit two times per card.\n\nNonloyalty members visit 1.3 per card. And they have a higher average guest check, 33% higher than nonmembers. Our loyalty members make up 5% of sales year to date, and we are just getting started. Equally exciting is that our guests love using the D&B Rewards.\n\nAs you can see, we have significant upside potential. And with our continued focus on innovation, growth, and value creation, we can deliver on that potential. It should come as no surprise that I'm extremely excited about the future of this company. We are optimistic about the state of our business and look forward to sharing our ongoing progress in the coming quarters.\n\nAt this time, Mike is going to cover our second quarter results. After that, I will return with some concluding comments. Mike?\n\nMike Quartieri -- Chief Financial Officer\n\nThanks. As Chris noted, we delivered record revenue and adjusted EBITDA in the second quarter despite continued headwinds in the economy. We continue to benefit from a higher mix of amusement and a leaner operating model. While we are still experiencing pressures from wage and commodity inflation, we are working to offset these cost pressures through operational efficiencies, continued emphasis on achieving our synergy targets, and thoughtful pricing actions.\n\nWe reported record quarterly revenue of $468.4 million, an increase of 35.9% from the second quarter of 2019 and an increase of 24% from the second quarter of 2021. Main Event branded stores contributed $51.4 million of revenue during the quarter. Comparable store sales at Dave & Buster's branded stores increased 9.6% compared to the second quarter of 2019. Walk-in comparable store sales at Dave & Buster's increased 13%, while special event comparable store sales declined 23.1% compared with the same period in 2019, but on a quarter-sequential basis, improved 11.5 percentage points compared to Q1 of 2022.\n\nComparable store sales at Main Event branded stores for the period from June 29, 2022, through the end of the second quarter, increased 29.7% compared to the same period in 2019. Walk-in comparable store sales at Main Event increased 34.9%, while special event comparable store sales declined 1.4% compared to the same period in 2019. Operating income totaled $56.5 million or 12.1% of revenue compared with operating income of $79.2 million or 21% of revenue in the second quarter of '21, and operating income of $46.2 million or 13.4% of revenue in the second quarter of '19. Operating income during the second quarter of '22 was negatively impacted by transaction costs related to the acquisition of Main Event, increases in preopening and stock-based compensation expenses, and an impairment charge related to the closure of the Main Event corporate office in conjunction with our office consolidation.\n\nThese increases as compared with the second quarter of '21 totaled $19.5 million, all of which is included as an add-back to our adjusted EBITDA. Net income totaled $29.1 million or $0.59 per diluted share compared with net income of $52.8 million or $1.07 per diluted share in the second quarter of '21 and net income of $32.4 million or $0.90 per diluted share in the second quarter of '19. We reported second-quarter adjusted EBITDA of $119.6 million or 25.5% of revenue, which is an increase of 39% versus the second quarter of '19 and a slight increase from the second quarter of '21. Adjusted EBITDA in the second quarter of 2019 was $86 million or 25% of revenue and adjusted EBITDA in the second quarter of '21 was $119.2 million or 31.6% of revenue.\n\nWe generated $84.5 million in operating cash flow during the second quarter. We ended the quarter with $591.8 million of liquidity, which consisted of $100.4 million of cash and -- or sorry, $491.4 million of availability under our new $500 million revolving credit facility. During the second quarter of '22, we repurchased 764,988 shares for a total of $25 million under our board-authorized $100 million repurchase program. Turning to capital spending.\n\nWe invested a total of $59.9 million in capital additions net of tenant allowances and opened four new stores during the quarter: three Dave & Buster's in Brooklyn, New York, Modesto, California, and Augusta, Georgia; and one Main Event in Brownsville, Texas. We plan to open four additional new Dave & Buster's branded stores and two Main Event branded stores in the back half of fiscal '22. Looking ahead to fiscal '23, we plan to open 15 to 17 new stores, including 11 to 12 Dave & Buster's and four to five Main Event. Finally, let me update you on our comparable store sales for the first five weeks of the third quarter.\n\nConsolidated comparable store sales have increased 22.1% compared to the same period in 2019, with increases at Dave & Buster's branded stores at 17.6% and 42.3% at Main Event branded stores. Consolidated walk-in comparable store sales increased 24.7%, while special event comparable store sales declined 4.2% for the five-week period compared to 2019. At Dave & Buster's branded stores, walk-in comparable store sales increased 20%, while special event comparable store sales declined 11.9% for the five-week period compared to 2019. At Main Event branded stores, walk-in comparable store sales increased 49 -- or sorry, 48.9%, while special event comparable store sales increased 9.3% for the five-week period compared to 2019.\n\nI'll conclude by saying that we remain optimistic about our business. We recognize the macroeconomic factors facing everyone today, still, we remain focused on our continuous improvement philosophy, closely watching costs and capital spending to ensure we deliver the highest returns possible for our shareholders. In summary, our team continues to execute on our initiatives to drive organic growth, improve profitability, integrate our operations, and produce significant cash flow from the business. We are pleased with our progress and are well positioned to deliver improved financial results for the remainder of fiscal year 2022 and beyond.\n\nWith that, I'll turn it back to Chris.\n\nChris Morris -- President and Chief Executive Officer\n\nOK. Thank you, Mike. We are excited to have Dave & Buster's and Main Event operating under one company umbrella. The combination of these industry-leading brands brings together two exceptional business models, strong assets, and talented teams.\n\nThis strategic fit presents our company with exceptional growth opportunities, which will benefit all stakeholders. There's a lot happening at Dave & Buster's, and we are excited about the meaningful upside potential for this company and our stakeholders. We look forward to keeping you apprised of our strong momentum and progress against our long-term initiatives. With that, we now open it up to Q&A.\n\nOperator\n\nWe will now begin the question-and-answer session. [Operator instructions] And our first question will come from Jake Bartlett of Truist Securities. Please go ahead.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nGreat. Thanks for taking the questions. And my first question, and congratulations on it, is the acceleration of same-store sales quarter to date, really strong acceleration there versus what you had in the second quarter. And so, my question is, what do you think is driving that? Is there anything that you're doing at either of the brands or both the brands that is driving that acceleration? Or is it something that you're seeing with the consumer? Just help us understand maybe -- maybe it was a mismatch of marketing dollars or specific promotions.\n\nJust anything to help us understand really what is driving that strong acceleration here.\n\nChris Morris -- President and Chief Executive Officer\n\nHey, Jake, thank you very much for the question. This is Chris. Listen, the first thing I'll tell you is we're incredibly enthusiastic about the momentum that we're seeing in both businesses and really the strength of that momentum over a long period of time. So, we're very optimistic about the direction of both brands.\n\nThe acceleration of comp store sales going from Q2 to Q3, there's really not one single thing that we can point to. But what I'll tell you is we're seeing that lift, that acceleration across the entire portfolio. So, it's not centered in one particular region of the country. There's not one particular market initiative.\n\nThere's no mismatch that's really driving that. It's just simply an acceleration across both brands that we're feeling at this point in time.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nGreat. Great. That's helpful. And, you know, just a question of check.\n\nAnd you've talked about kind of intelligent pricing actions to defend margins here. But -- can you talk about how much of the quarter to date, maybe just to kind of frame the quarter-to-date results and how much is driven by check versus '19? I assume that traffic is still negative on Dave & Buster's side. But I think there's certainly some uncertainty about whether that check can be sustained at this higher level than in '19. And if you could maybe talk about your confidence that it can or can't?\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. It's Mike here. So, given where we are, we really don't have a very solid measure of traffic. So, we've kind of refrained from having any type of detailed discussions between traffic versus check.\n\nBut the trends that we've seen in the past have continued. We are still seeing that higher than normal -- I would say it's become a new normal because it occurred just right after the reopening with the pandemic with the higher-than-normal power card purchases that we've seen. So, other than that, business is just up across the board, and I think we're really pleased to see that. But we also want to be cautious about what we're seeing going forward because it is two days after Labor Day, and we've typically seen in history show that once we get past Labor Day, there is a bit of a slowdown with kids being back in school.\n\nSo, at this point, we're watching that very closely to make sure we monitor our costs in conjunction with what we're seeing on the comp store sales at this point.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nGreat. And then my last question is just on margins. Obviously, a lot to factor in here with Main Events results being folded in. But in the past, sometimes you've given us a little bit of help in terms of what you expect margins to be, whether it's in the third quarter or maybe the back half of the year, higher or lower than previous years.\n\nAny sort of guidance that you're willing to provide just on what we should expect from, you know, maybe at store level margins or, most importantly, EBITDA would be helpful.\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. I think we'll reiterate, from an EBITDA margin perspective, we had talked previously about a 200-basis-point improvement over '19. We obviously did not see that in this quarter, but we do expect that to return back in Q3 and beyond.\n\nJake Bartlett -- Truist Securities -- Analyst\n\nGreat. That's helpful. Thank you very much.\n\nMike Quartieri -- Chief Financial Officer\n\nThank you, Jake.\n\nOperator\n\nThe next question comes from Andy Barish of Jefferies. Please go ahead.\n\nAndy Barish -- Jefferies -- Analyst\n\nHey. Good afternoon, guys. Just first for me on drilling into Main Event and kind of the labor model. Dave & Buster's made a lot of progress with some technology implementation during the pandemic.\n\nIs there some things that you're looking at and learning potentially in that regard, Chris, as we move forward here in an inflationary labor environment?\n\nChris Morris -- President and Chief Executive Officer\n\nYeah. Great question, Andy. The first thing I'll tell you is, you know, we are spending a lot of time, we're going to continue to spend a lot of time with our teams on just sharing best practices across both brands. So, it's not only labor but, you know, across all operating expenses and as well as just strategic opportunities.\n\nWe really think that's a big benefit of this merger is being able to take the best of both. And leverage it in a way of meaningful growing both brands. As it relates to labor and the technology that Dave & Buster's has implemented, Main Event has implemented a lot of the same tools. Just the approach was slightly different.\n\nBut server tablets, every Main Event server now have a server tablet, which then allows them to have cover more tables in the dining room. We're able to get more labor efficiency through that. And so, we're in the process of kind of digging in deep and just seeing, you know, what we can share. I would say that both brands have an opportunity to do a better job embracing guest-facing technology to not only improve labor productivity but also doing a way to elevate the guest experience.\n\nAnd so, our focus as a team is going to be on straddling both sides of that fence. And I firmly believe that as we do that, we'll be able to really have a win-win-win. We're able to improve labor productivity, we're able to elevate the guest experience, we're able to improve tips across our servers, which then, of course, leads to, you know, more sales growth.\n\nAndy Barish -- Jefferies -- Analyst\n\nGotcha. And then just -- I know there's a lot of work underway on a variety of the sales-driving sort of initiatives. I mean, it sounds like special events is sort of first and foremost going into the holidays. And obviously, football season is upon us, what would be one or two more that kind of come to the forefront from your early thinking in working with your team and the consultants, Chris?\n\nChris Morris -- President and Chief Executive Officer\n\nYes. So, we're -- you know, right now, we're digging in deep to build our long-term strategic plan. And so, you heard me say that there are two work streams that we're following. One is getting out, spending a lot of time with our operators, hearing directly from our teams on where the opportunities are.\n\nSo, that's more of a ground-up approach. And then secondly, we're doing a deep dive into the consumer environment, the competitive environment, understanding the core brand attributes, which is more of a top-down approach. We're about 30 days away from wrapping up that work. And then what we will do is we'll converge those two work streams and say, OK, team, here's where we have the greatest opportunity to grow our business, not only now, but over the next five years.\n\nSo, it's going to be a very thoughtful, very deliberate strategic approach anchored in core brand positioning that we will reinforce over a long period of time. And so, that is very important work that we -- and that's exactly what we will be presenting more than likely in the first quarter when we host our Analyst and Investor Day. In the near term, I think where we've been spending time with our operators is on really managing the peaks and so much of our business is done in such a short period of time. Typically, where you can get the greatest traction on sales growth is just improving the focus on those peak times.\n\nAnd addressing bottlenecks and relieving pinch points, putting labor in the right areas, both to manage velocity, as well as to manage average guest check. And so, we've got a number of things that we're kind of immediately getting to with our operating teams that we will what we're doing is we're trying to address that near term. And then the plan is that our operator conference, which is in February to really reinforce those opportunities and those behaviors at that operator conference. So, then we can really drive it home in that F'23 year.\n\nSo, that's kind of where we're focused right now. Banquets, as you said, so banquets is the near-term priority. That's a big sales driver in the fourth quarter. We feel like that we're going to have we're -- there's already -- we're already seeing signs that we're going to -- there's a very strong chance that we're going to be at or above pre-pandemic levels, this banquet season.\n\nAnd so, we're spending time to capitalize on that opportunity. So, we've got our entire sales team out, completely focused on making this a banner year. Those bookings start to occur in early October. And so, it's really important that we get our teams dialed into that at this point in time.\n\nSo, we can start signing up those bookings and then getting our operating teams staffed and ready to go to be able to execute those bookings in the fourth quarter.\n\nAndy Barish -- Jefferies -- Analyst\n\nExcellent. Thank you very much.\n\nChris Morris -- President and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nThe next question comes from Jeff Farmer of Gordon Haskett. Please go ahead.\n\nJeff Farmer -- Gordon Haskett Research Advisors -- Analyst\n\nThank you. Appreciate it. Really, just sort of a collection of a follow-up here. So, you guys did touch on both wage rate and commodity inflation in the Q2.\n\nThe question is, what are your expectations for inflation over the balance of the year? Do you think we've sort of moved to the peak level of inflation? Or is this going to get a little bit worse before it gets better?\n\nMike Quartieri -- Chief Financial Officer\n\nWell, I hope we've hit the peak at this point. It seems that would be the case. However, when we look at Q1 versus Q2, the inflation impact was only a couple of additional percentage points. So, it seems like it's slowed to a point where maybe we're at the peak.\n\nBut one of the good things that we have going for us is with the combination with Main Event and our combined purchasing power and what we're seeing the opportunities are on the supply chain aspects of combining the purchase power to go back to suppliers, we feel that we'll be able to offset some of that in the coming quarter, especially within Q3 and as we go into Q4.\n\nJeff Farmer -- Gordon Haskett Research Advisors -- Analyst\n\nOK. So, I appreciate that. But are you able to provide the absolute level of inflation just for context relative to what we've been hearing from the rest of the segment in terms of the level of inflation you saw in the Q2?\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. Well, in Q2, from a commodity perspective, our inflation rate was about 25% and 26% between the two brands. And just to give you perspective versus Q2 of '21, that was only about 8% at that point in time. From a labor perspective, we're still seeing that inflationary percentage being around 22% to 23% on a blended basis between both brands.\n\nJeff Farmer -- Gordon Haskett Research Advisors -- Analyst\n\nOK. And then the last question, again, something you sort of touched on, but -- as it relates to your ability to really adjust pricing, you're a unique model, obviously, there's the food and beverage side of it. But in terms of the amusement, could you just give us a little bit more color on some of your efforts to use pricing as a way to offset some of that inflation?\n\nMike Quartieri -- Chief Financial Officer\n\nWe really haven't done anything additionally from the amusement side. As you know, back in October of last year, we increased the buy-in -- low end of the buy-in at the kiosk, which allowed us to get about 11% increase in Power Card purchase on the per-transaction basis. We did take some on the game, which is basically the cost of the number of coins in order to operate the game. We didn't see much of any real impact on that.\n\nIt's really that just allowed people to utilize their cards more quickly, but it didn't really translate into anyone coming in and -- or at least a meaningful number of people going for recharges at that point. What we've looked at from a food and beverage perspective, we did take price up 5% on the D&B side in mid-July, and we've seen that hold throughout the period for the last two weeks of July and into August.\n\nJeff Farmer -- Gordon Haskett Research Advisors -- Analyst\n\nOK. Appreciate it. Thank you.\n\nMike Quartieri -- Chief Financial Officer\n\nYou got it.\n\nOperator\n\nThe next question comes from Andrew Strelzik of BMO Capital Markets. Please go ahead.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nHey, good afternoon. Thanks for taking the questions. I wanted to start, maybe if you could reflect on some of the initiatives that you guys have put in place over the last couple of quarters. Late night, I know you've talked about date night, but other things like trivia, etc.\n\nI mean, is there any color or kind of data points you can put around that last quarter, you provided some late night, I think, plus 9%, you said? Just curious, any updates to any of those initiatives?\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. From a late-night perspective, that's the one that's probably the most meaningful of all of those initiatives. As a percentage of overall sales in Q1, late-night was about 8.8%. It's improved at 9.7% of our overall sales.\n\nSo, it's a little bit of an improvement, but we are pleased with that. The rest of the items such as like date night really hasn't had a material impact on the operations because we're just seeing overall traffic up in total. From another perspective, trying to think of anything else. We did launch on open table.\n\nBut that just gives us an opportunity to reach out to additional people. At this point in time, we found about 56,000 people have booked on open table that booked directly through the app without typing in David & Buster's. So, we figured that that's 56,000 more visitors that come in that maybe not as considered Dave & Buster's. So, we are pleased to see that type of incremental growth in the visitation for us.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nGot it. OK. That's helpful. And then I guess on the unit growth side, 15 to 17 for '23, and I believe that the kind of Main Event piece is a touch below what you had talked about on the business update call you said something like six over the next 12 to 18 months.\n\nSo, I just -- is that a function of timing? And is the 15 to 17 the way that you're thinking about kind of a medium-term run rate around unit openings beyond '23?\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. I would say the 15% to 17% seems to make sense of what we would have on a near-term basis on a year-over-year basis as we look further out beyond '23. The Main Event stores of 4% to 5% is really around timing as to when we want to execute on those versus Dave & Buster's openings.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nOK. And then I guess just the last piece with what you talked about -- talked about with ESPN and maybe some of the other initiatives that you have going on? Any directional commentary on the marketing spend expectations over the balance of the year would be helpful. Thank you.\n\nMike Quartieri -- Chief Financial Officer\n\nWe would anticipate the marketing spend to be fairly consistent with what we had in the first half of the year. It's really going to be centered around two campaigns, one of which being the football watch with Travis Kelce, who happens to be Chris' most favorite player since he is from Kansas City and a big Chiefs' fan. But beyond that, it also -- we were looking at another promotion around the Eat & Play Combo, which was very successful in Q1. We are looking to do that again in November, we'd have an advertising campaign around that.\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nGot it. Perfect. Thank you very much.\n\nMike Quartieri -- Chief Financial Officer\n\nYou're welcome.\n\nOperator\n\nThe next question comes from Chris O'Cull of Stifel. Please go ahead.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nThanks. Good afternoon, guys. Michael, I wanted to see if you could clarify your comments about the impact of seasonality -- how do you -- how the average weekly sales maybe trend last year in the third quarter by period? And do you expect to see a similar impact this year? Or were you indicating that you expect it to be more pronounced? I'm just -- I'm trying to understand how -- what we should expect for the third?\n\nMike Quartieri -- Chief Financial Officer\n\nWell, I'll kind of think of it this way. When you look at overall history from Q2 to Q3, Q3 has always been about 85% of Q2 sales. And so, we would -- and that's pretty consistent not only with Dave & Buster's but also with Main Event. So, I wouldn't expect that to materially change.\n\nAs you look at the results from Q2 going forward, we think that that percentage would probably stay the same on a go-forward basis.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nOK. And then the consolidated store margin was lower than we would have expected this quarter. And I know you talked -- you called out inflation factors. But was there any one-time factors that may have been related to the transaction or integration that was not indicative of kind of the underlying cost pressure you're seeing?\n\nMike Quartieri -- Chief Financial Officer\n\nNot really. I mean, most of anything that was related to the transaction would have been treated as an add-back to EBITDA, which is what I talked about in the prepared remarks. But the one thing I will say is that as you remember back in the first five weeks of Q2, we said we were running at about 12% up on a comp store basis, and we finished the quarter at 9.6%. So, the back seven weeks were slightly lower than the first five.\n\nAt the same time, we had launched the great indoors, which was our summer ad campaign, which did perform reasonably well, but when you have the increased costs associated with that marketing spend and we made a conscious decision to lean in a little bit heavier on our labor at the store level to support those comp store sales we were seeing, these combined factors had -- did have a negative impact on our margin this quarter. But since then, we've taken the course -- corrective action on what we've seen from a comp perspective for Q3 to date, and we've seen that in our August results where we're back on track to that 200-plus basis point improvement over 2019 that we've discussed previously.\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nGreat. Thanks, guys.\n\nMike Quartieri -- Chief Financial Officer\n\nYou're welcome. Thank you.\n\nOperator\n\nThe next question comes from Brian Mullan of Deutsche Bank. Please go ahead.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nOK. Thank you. Just a question on the plan to refresh or remodel the fleet of stores at the core, Dave & Buster's brand. Can you just remind us what the plans are in terms of how many stores you want to touch, over what time frame, anything on the cost per remodel there? And then just related, what are the characteristics of the store touching first? Is it simply the older stores? Or are there other factors in terms of size or anything like that?\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. So, in general, we're looking at about 90 stores to touch and it will probably take us the better part of about two to two and a half years to do so because we want to be very cautious about how we do and go about these. From a cost perspective, depending on the level of the refresh, it could be anywhere between $1 million to $3 million in total. I think for this year, we've got 11 stores planned and each one of those 11 stores represent a different type of prototype of the construction of the stores that are out there.\n\nThat gives us the opportunity to walk the store and see what we agreed to, what we like, what we don't like, what we want to change. And so, we're able to do that before we then launch on that series of prototypes over the next couple of years. At the same time, as we're doing additional work about really truly deep diving into our customer base and what they're looking for, we can make adjustments into that refresh program and build that in over the course of the next couple of years.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nOK. Thanks. And then a follow-up, Chris, just a question on the loyalty. Your thoughts on what that means in the category.\n\nYou gave some stats in the prepared remarks that the D&B Program is growing when we compare it to some -- the size of it to some pure-play restaurant concepts, it's still pretty new, pretty small. So, how do you see that evolving? And can this be an actual driver of transaction counts at some point for the core brand? And then anything in Main Event you were doing that would be helpful or informative of how you think about it at D&B?\n\nChris Morris -- President and Chief Executive Officer\n\nYeah, sure. So, I absolutely believe that this could be a sales driver for us in many different ways. The fact that we just launched this in November and the loyalty program already represents 5% of our sales. We think that that is a very good sign.\n\nBuilding an effective loyalty program, the way we think about it is more of an engagement platform, building an effective engagement platform and entertainment-driven businesses is not -- it has its own set of challenges just because we're a low-frequency occasion. Our average frequency is less than two times a year. But to the extent that we're able to stay engaged with our guests and maintain a dialogue and gather insights into their particular behaviors, their pattern or behavior just gives us an enormous opportunity to segment our messages and retarget them in different ways and ideally, get them to stay more engaged with the brand to increase frequency over time and grow check in the process. So, we see it as a way of growing growth frequency and the average guest check.\n\nSo, I think the early signs are very encouraging, and we will be spending more and more time on this and see it as a big driver going forward. On the Main Event side, Main Event is lagging D&B on this particular platform. And so, I think this is an area where, strategically, we will be able to get Main Event where we want to be faster as a result of this merger integration. I also think that what -- it's still early, but I also believe that there could be power and having a loyalty platform to where you can retarget guests across both brands.\n\nSo, I think there's quite a bit of strategic upside here.\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nThank you.\n\nOperator\n\nOur next question comes from Nicole Miller of Piper Sandler. Please go ahead.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nThank you. Good afternoon. Could you please translate the quarter-to-date comps on D&B and Main Event versus the prior-year comp?\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. That's the information -- well, I should say that information is in the release itself.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nOh, it is. OK. Then I missed it. I'm still trying to get through.\n\nSo, the 18 and the 42, I think I wrote down versus 2019, but the versus 2021 numbers are in there?\n\nMike Quartieri -- Chief Financial Officer\n\nOh, no. We only have it versus the '19 numbers. Versus 2021 is a little, I'd say, misleading because you had some unusual items that were taking place in that period of '21 as we were still dealing with coming out of the coronavirus recovery, and then we were entering into the potential for omicron. So, from our perspective, we're still only comparing everything publicly back to 2019 for now.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nCan you translate it to average weekly sales? I mean, I guess it's 85% of what 2Q was. But I guess is that the right ZIP code if that's the math we do? Like, take the quarter to date, well, I mean, the models are built off of a prior year. So, if we can't do that, then what we can do is take that 85% convention in that. I guess I'll ask it this way.\n\nIs that where average weekly sales are now? Is that comp higher or lower --\n\nMike Quartieri -- Chief Financial Officer\n\nIt's comp versus the 2019 period -- because the 2021 period is just all over the board.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nSo, are the average weekly sales in that go with that comp? You had just said that in 3Q seasonally adjusted, right, like sequentially would be about 85% of 2Q. So, right now, are the current trends higher or lower than that? Or are they kind of right in line with that?\n\nMike Quartieri -- Chief Financial Officer\n\nThey're pretty much in line with that.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nAnd then the numbers are one month of Main Event, and I think there's a reconciliation, again, going through all the information of what the top and bottom line would have been for three months total. My second question is, is there -- would store level margins have been materially different if Main Event had been folded in first three months versus one month? Or can we go off of this one month and kind of be informed from there?\n\nMike Quartieri -- Chief Financial Officer\n\nI think you can go off with the one month and be informed from there. There's not a significant difference between the first two periods of the quarter for Main Event versus the third period that we picked up in our post-acquisition results.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nAnd then just a big-picture question. Can you talk about the Dave & Buster's demographic profile today versus maybe what it was previously? And then I know you've discussed, for example, Main Event, seeming different, maybe by age, for example, but could you go a little deeper on that demographic profile? And then how important is it for it to be, you know, different or the same? Like what aspects are most important to be similar and what aspects are really important that they're different?\n\nChris Morris -- President and Chief Executive Officer\n\nYeah. Nicole, this is Chris. I think what I'm going to ask you to do is just hit pause on that question and attend our Analyst and Investor Day in Q1 because I think that will be the point in time where we're able to not only answer that question but put it in the context of where we see the big strategic opportunities for both brands as we move forward over a long period of time. With all that said, both brands cast a very wide net.\n\nI think both brands move appeals to a very wide audience. We sell experiences in different ways, but both brands have a personality. And I think Main Event, the personality of Main Event is it's typically viewed as a place that's a little more family friendly and the personality of Dave & Buster's is the place that's kind of viewed a little more friendly for young adult males. But Dave & Buster's gets plenty of family occasions and management gets plenty of adult occasions.\n\nSo, we see opportunities for sure. Both of these brands have been in the same markets for many years, and both of them have thrived in those markets. And so, we see a lot of growth opportunity for both of these brands. But when -- and at the Investor and Analyst Day, we'll walk you through all the findings from our research.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nThat's super fair. I understand that. Is it fair to say then -- I mean, there's things that you can move forward with, and then there's things that will be informed by the work that you're doing to inform a longer-term strategic plan. So, maybe so we're just all on the same page from that perspective.\n\nYou know, there are certain comp driver strategies, I suppose, and certainly, development, right? But absent kind of that, should we think about really the bigger fully formed strategy coming, and then, you know, I guess it's, what, six months and then taking course taking place over the next one-, three-, and five-year period, something like that?\n\nChris Morris -- President and Chief Executive Officer\n\nYeah. Well, you know, what I'll tell you is our near-term focus is just executing the business plan on both brands and we're having incredible success at both brands. We just reported a record-breaking quarter for Dave & Buster's. When you look at the comp store sales performance for D&B and Main Event individually, there's a lot of momentum in both of these brands.\n\nAnd so, the business plan is working, and the momentum is improved here in the quarter that we're currently sitting in. And so, our immediate priority is just to continue to execute the plan. And so, I think we're in a perfect position to build upon the momentum that's already been created in both of these businesses but do it in a way to where we're more focused on maximizing shareholder value over a five-year period of time. And as I think through over a five-year period of time, how do we effectively grow both of these businesses to the point where they're able to reach their potential in a way where we complement each other, that's where we just need a little bit more time to fine-tune our strategies.\n\nNicole Miller -- Piper Sandler -- Analyst\n\nThank you very much.\n\nChris Morris -- President and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nThe next question comes from Brian Vaccaro of Raymond James. Please go ahead.\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nHi. Thanks, and good evening. Just to clarify the quarter-to-date, I'm still a little confused. Mike, can you just tell us what AWS dollars are for each brand in the first five weeks to make sure we're all on the same page?\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. Look, unfortunately, we don't have that piece of data with us in front of us on this call. So, what we would do is just point you guys back to the comp store sales increase. We also commented, if you read the 10-Q, about what constitutes noncomp sales for both brands.\n\nSo, that should be able to give you some help in getting to what you're looking for.\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nOK. The sales over the last few months and even into the quarter to date, I'm curious to what degree the customer mix continues to evolve, perhaps, normalize. I guess are you seeing more families come back? And are you starting to see F&B attachment move more positively? Or is that kind of holding more stable in the last few months? Any changes there to note?\n\nMike Quartieri -- Chief Financial Officer\n\nNo, really it happens to be that it's very stable across the board. As Chris mentioned before, it's not really any one particular initiative that we have that's driving the increase in sales. It is pretty much radically across the board. We haven't seen any real increase in attachment or check size.\n\nSo, from that perspective, it's just an overall lift in the business.\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nOK. And back to store margins if I could. And sorry if I missed it, -- but what was marketing spend in your second quarter? And then could you also just drill down a little further in that other opex line? I know it's not apples-to-apples, but was up nearly 300 bps, I guess, sequentially. Just trying to understand that more clearly.\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. I would say marketing spend was probably around $15-plus million for total during the quarter. And as far as the other operating expense, so probably the biggest component of that would include security because, as you know, as you get further into late-night happy hours and the like, cities will or local authorities will require more security at that point. So, we do have a number of off-duty police officers that are included in that number, as well as some outside services as it relates to janitorial and cleaning aspects as we reopen from a pandemic perspective, we use outside services to handle that portion of the business because it was difficult in hiring individuals back at that point in time.\n\nBut those are primarily the two key drivers within that other line item.\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nOK. Thank you. And last one for me. You talked about raising the synergy target, I think, by $5 million.\n\nJust a little more color on the incremental savings that you've identified. Thank you.\n\nMike Quartieri -- Chief Financial Officer\n\nTo date, that extra $5 million is really coming through on the cost of goods sold side, whether that's in the food or the beverage aspect of it. That's the piece that I think we're most pleased with. In regards to my comments earlier about the increase in inflation, we see the ability to having our two combined companies in that combined purchasing power, being able to help offset that more so than what we would have been able to achieve on our own.\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nAll right. Great. I'll pass along. Thank you.\n\nMike Quartieri -- Chief Financial Officer\n\nThank you.\n\nOperator\n\nThe next question comes from Sharon Zackfia of William Blair. Please go ahead.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nHi. Good afternoon. I was hoping we could kind of get a read on what underlying G&A looks like. I know you had the Main Event's acquisition and integration costs that you detailed in the release, but I'm not sure how much of that was actually in the G&A bucket.\n\nSo, could you give us an idea of what kind of core G&A for lack of a better way of phrasing it might have been in the second quarter and what a good run rate would be for the second half of the year?\n\nMike Quartieri -- Chief Financial Officer\n\nYeah. If you look at our G&A costs overall, combined with roughly -- we were about $36 million for the combined entity, of which the transaction costs, which you can see in the EBITDA reconciliation would have been included in G&A, as well as that impairment charge of $1.8 million was included in G&A. The other items called out like stock-based comp and preopening or separate line items. And so, we would look at something like G&A being somewhere around that $30 million mark is probably a fair number on a go-forward quarterly basis, which also I'd say for that $30 million, that would also include the stock-based compensation amount.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nThanks for that. And then just a follow-up on some prior questions about unit level margins. I mean, obviously, your comps are very, very good so far in the third quarter. And it sounds like you're not seeing a lot of price elasticity of demand.\n\nSo, as we think about the unit level margins, I mean, I know the third quarter is just a seasonally low quarter, but are you targeting getting back to kind of a 30% plus unit level margin by the holiday quarter? Or would you rather not price as high and go for volume? I guess I'm trying to figure out your philosophy around the pricing dynamic of the equation.\n\nMike Quartieri -- Chief Financial Officer\n\nWell, look, I'll speak to it. If you look at the 30% margin we experienced in Q1 is due to it being the seasonally high quarter that has a tremendous amount of flow through, especially when you get to that period around the spring break period. When you think about Q4, your regular seasonal low, it really takes place in that October, November time frame. So, there is -- we won't see that 35-plus percent EBITDA margin in those periods.\n\nI think what you'll see is something closer to more normalized run rate has been historically around the mid-20% for EBITDA during those periods.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nYeah. Sorry, I was talking about unit level, store level, not EBITDA.\n\nMike Quartieri -- Chief Financial Officer\n\nTypically, what we see between those two is probably about a, call it, maybe about a 5% mark between the EBITDA at the consolidated level versus the store level. So, you'd assume that the store level would be closer to that 28% mark versus what you typically see if your overall margin is going to be around the 23%, 24% mark.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nOK. Last question for me is just -- I appreciate the color on the 200 basis points EBITDA margin improvement relative to 2019 and expecting to get that back in the back half of this year. The company has been running ahead of that for quite a while -- above the 200 basis points that you're mentioning. Was that just a function of really staffing not being up to where you wanted it to be? So, you were kind of, I guess, \"over-earning\" a bit, you know, during the last year.\n\nMike Quartieri -- Chief Financial Officer\n\nThere's a little bit of that. But at the same time, as I said earlier, when you look at a year ago Q2, our commodity inflation was 8%, and it's now over 25%. So, although the prior management team back right after the, call it, the relaunch after the pandemic had put out the 200 basis points. So, it's been a real effort on all of our parts to continue to keep that 200 basis points improvement despite the fact that you have increasing commodity inflation, as well as inflation within labor, and that all triggers through the rest of the P&L, whether that's higher utility costs, higher outside services, overall just cost increase that we all have to face.\n\nAnd so, the company has done a fantastic job prior to the Main Event acquisition, and we're going to continue it afterwards of just digging into every line item and making sure that we've got the best possible cost structure we can in order to keep the margins of where we're at without over-increasing the pricing on the -- at the top level because we do realize that you can only take price up to a certain point before you start hurting the overall growth and health of the company.\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nThank you.\n\nOperator\n\nThis concludes our question-and-answer session. The conference has now also concluded. [Operator signoff]\n\nDuration: 0 minutes\n\nMike Quartieri -- Chief Financial Officer\n\nChris Morris -- President and Chief Executive Officer\n\nJake Bartlett -- Truist Securities -- Analyst\n\nAndy Barish -- Jefferies -- Analyst\n\nJeff Farmer -- Gordon Haskett Research Advisors -- Analyst\n\nAndrew Strelzik -- BMO Capital Markets -- Analyst\n\nChris O'Cull -- Stifel Financial Corp. -- Analyst\n\nBrian Mullan -- Deutsche Bank -- Analyst\n\nNicole Miller -- Piper Sandler -- Analyst\n\nBrian Vaccaro -- Raymond James -- Analyst\n\nSharon Zackfia -- William Blair and Company -- Analyst\n\nMore PLAY analysis\n\nAll earnings call transcripts"
}