{
  "companyName": "UnitedHealth Group",
  "companyTicker": "UNH",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/14/unitedhealth-group-unh-q3-2022-earnings-call-trans/",
  "content": "UnitedHealth Group (UNH 0.06%)\nQ3 2022 Earnings Call\nOct 14, 2022, 8:45 a.m. ET\n\nOperator\n\nPlease stand by. Good day, everyone, and welcome to the UnitedHealth Group third quarter 2022 earnings conference call. A question-and-answer session will follow UnitedHealth Group's prepared remarks. As a reminder, this call is being recorded.\n\nHere are some important introductory information. This call contains forward-looking statements under U.S. federal securities laws. These statements are subject to risks and uncertainties that could cause actual results to differ materially from historical experience or present expectations.\n\nA decision is -- I'm sorry, a description of some of these risks and uncertainties can be followed in the reports that we filed with the Securities and Exchange Commission, including the cautionary statements included in our current and periodic filings. This call will also reference non-GAAP amounts. And reconciliation of the non-GAAP to GAAP amounts is available on the financial and earnings reports section of the company's investor relations page at www.unitedhealthgroup.com. Information presented on this call is contained in the earnings release we issued this morning and in our Form 8-K dated October 14, 2022, which may be accessed from the investor relations page of the company's website.\n\nI will now turn the call over to the chief executive officer of UnitedHealth Group, Andrew Witty. Please go ahead.\n\nAndrew Witty -- Chief Executive Officer\n\nThank you. Good morning. And thank you, all, for joining us today. As we approach the final stretch of 2022, let me start by recognizing our colleagues, the people of Optum and UnitedHealthcare, who continue to work diligently day in and day out for those we serve.\n\nTheir efforts allow us to deliver durable and balanced growth and to increase our 2022 adjusted earnings outlook to a range of $21.85 to $22.05 per share. As an enterprise, we remain focused on our mission and on advancing our growth strategies. Our aim is to serve more people through value-based care and expanded health benefits offerings, a robust foundation on which we consistently drive strong growth into 2023 and beyond. Consumers want value, especially in the current economic environment.\n\nAnd that means high-quality care that is more accessible, more affordable, and more responsive to their individual needs. In the past quarter, we've accelerated efforts to deliver on this critical consumer proposition by launching several initiatives to reach more people in more communities while deepening relationships with those we already serve. For example, in September, we announced a long-term collaboration with Walmart to provide Optum technology and expertise that will enable America's largest retailer to provide value-based care to consumers in its clinics. Starting in 2023, we will jointly develop 15 Walmart health clinics in Florida and Georgia and will extend into additional geographies over time.\n\nAs we expand the collaboration, there will be broad opportunities to address social determinants of health by improving access to benefits, such as healthy foods, medications, dental and vision services, and more. We also launched a distinctive partnership with Red Ventures, a digital media company connecting tens of millions of consumers each month to its clients, products and services through a broad portfolio of proprietary digital content platforms. This partnership, called ObvioHealth, combines Red Ventures' popular health and wellness platforms, including Healthline and Healthgrades, with Optum's consumer marketplace, the Optum Store and the Optum Perks prescription discount card. ObvioHealth will enable us to engage with more than 100 million active monthly visitors seeking the health advice and insights they need, introducing them to relevant products and services through a customized and digital platform.\n\nAffordability is an essential component of value in healthcare, especially when it determines access to the life-saving medicines people need for themselves and their families. In July, we announced zero consumer cost share on drugs for diabetes, severe allergic reactions, and other emergency situations starting in January for those we serve with commercial insured benefits. Now, we are working with self-funded employers who are exploring how they can provide these vital medications for zero co-pay. So far, this benefit will be available to more than 1 million additional people, and we are actively engaging with many additional employers.\n\nWe are also improving access to essential medicines for those even without health benefits coverage. For example, Optum Store launched a new partnership with Sanofi to help consumers without insurance obtain insulin for $35 a month. And they will be able to have it delivered to their home. Turning to health benefits, today, nearly half of American seniors are enrolled in Medicare Advantage plans compared to about 25% a decade ago.\n\nAnd MA plays a vital role in serving those consumers who are significantly more diverse, have lower incomes, and more complex care needs than the average senior. There are compelling reasons why seniors increasingly choose MA. Through Medicare Advantage, people are experiencing better health outcomes than in traditional fee-for-service Medicare across a wide spectrum of measures. For example, MA members with diabetes have over 50% lower rates of any category of complication and over 70% lower rates of serious complication.\n\nThis is due to our ability to provide deeper, more coordinated levels of care. And this is accomplished at lower cost. People served by MA spend as much as 40% less compared to those in Medicare fee-for-service. And this high value for people is delivered at a lower net cost to the government.\n\nWe are confident our differentiated offerings will once again this year resonate with consumers who are even more focused on affordability, value, and simplicity, given the rising cost of daily life. Today, in the United States, more people than ever have access to health benefits, an important milestone on the path toward universal coverage, an objective we have long supported. Much of this expanded coverage has occurred in Medicaid. Looking to 2023 and given the potential resumption of eligibility redeterminations next year, a high priority for our team is assuring continuity of access and care for those we serve.\n\nThe initiatives our team is pursuing to help assure continuous coverage include: launching direct outreach and partnering with states and community organizations to identify those at risk and help them retain their benefit coverage, partnering with national retailers and pharmacies to educate consumers about available coverage options and assistance while they are shopping in store, and engaging with employers to extend annual enrollment periods and drive education efforts to employees who are eligible for coverage. Underpinning our growing consumer agenda is an ambitious multiyear effort to deepen and expand our enterprise technology capabilities. The recent combination of OptumInsight and Change Healthcare reflects our accelerating efforts to help create more effective and simple experiences for consumers, payers, and care providers, while lowering costs across the health system. I want to formally welcome our newest colleagues, the talented and compassionate team at Change Healthcare, with whom we have just started working to build upon our shared vision for a more effective and adaptive health system for all participants.\n\nWith that, I will turn it over to president and chief operating officer, Dirk McMahon.\n\nDirk McMahon -- President and Chief Executive Officer\n\nThank you, Andrew. As Andrew just mentioned, we are very excited about the recent combination of Change Healthcare and OptumInsight. With a grand total of 11 days of integration work behind us, I thought I would provide a bit more commentary on how together we can make the health system simpler and more efficient. Overall, Change brings a robust transaction network built on strong payer and provider connectivity.\n\nTogether, our focus areas include: first, improving the quality of healthcare delivery by offering critical point-of-care insights aligned to evidence-based medical standards within the workflow of physicians; second, simplifying administration by fully automating claims transactions, including editing in the EDI stream, improving claim accuracy; lastly, we are reducing friction in the payment process by providing patient benefits and payment obligations at point of service and applying payment integrity at its upfront. Our teams have started out of the gate working intensively together to make these visions a reality and to create the next era of growth for OptumInsight. We are very confident that our combined capabilities will enable us to better serve all healthcare constituents. Beyond OptumInsight, as you might imagine, I spend a lot of time engaging customers of all sizes, operating in almost every sector and representing diverse employee populations.\n\nAcross these customers, no matter the person or the industry, I hear the same consistent message: the need for deeper levels of support and more resources to comprehensively meet health needs in both the traditional, but also increasingly focused on behavioral health. Companies want to provide a broader range of resources and deeper levels of support for their employees and their families. And the groundwork we have been building is resonating in this rapidly evolving area. Here is what we are doing about it.\n\nFirst, we are tackling access. We have expanded our behavioral health network by 25% over the last couple of years, including a growing complement of behavioral clinical practices owned and operated by Optum. And as many of you know, behavioral health is a 24/7 challenge. So, we are continuing to expand our portfolio of digital offerings supporting a range of needs, allowing patients to get resources when they need them.\n\nWe have also made significant improvements to help consumers access vital information more easily through improved navigation tools, guiding consumers to the appropriate condition-specific level of behavioral health is a challenge we are prioritizing. These new experiences have improved customer satisfaction, and we are getting people to the right care more quickly. Behavioral health plays an integral role of the overall health and well-being of the people we serve. So, you will all continue to -- so you will continue to see us increasing access, quality, and affordability in this clinically important and sensitive area.\n\nAnother tenet of our consumer focus is meeting people where they are, which includes expanding our clinical capabilities to care for people more holistically in their homes. We know that at home care settings, especially for people with mobility challenges and highly complex health needs, can improve outcomes, elevate patient experience, and result in better care. So, we bring together teams with medical, behavioral, and palliative experience in addition to our home infusion capabilities of OptumRx. By doing so, we help patients and their families keep multiple chronic conditions in check while significantly reducing the need for care in acute and post-acute settings, a real positive for them.\n\nThe expanding clinical breadth and deepening integration of our value-based care offerings are moving us beyond the confiance of traditional clinical settings, creating an opportunity for us to serve more people more effectively. With that, now, I will turn it over to chief financial officer, John Rex.\n\nJohn Rex -- Executive Vice President and Chief Financial Officer\n\nThank you, Dirk. As those of you listening know well, numbers can tell a story. And the story our numbers tell is one of broad-based growth and substantial near and long-term potential. So, let me walk through some of those numbers with you.\n\nIn the third quarter, UnitedHealth Group revenues of 81 billion grew 12% or 8.6 billion, highlighted by broad-based double-digit growth at both Optum and UnitedHealthcare. Care patterns in the quarter remained similar to those of the second quarter. And our planning for next year anticipates care patterns continue to normalize. We are encouraged to see people obtaining preventive screenings at levels broadly consistent with longer-term norms, and we are maintaining our focus on getting people the care they need.\n\nAnd acuity patterns remain stable, but as always, we are highly respectful of and watchful for evolving medical cost trends. Looking now at the performance of our specific businesses. OptumHealth's third quarter revenue increased 34% year over year, as revenue per consumer grew 31%. Growth continues to be led by the increasing number of patients served under value-based care relationships and the expanding types of care settings offered by Optum, from meeting behavioral needs to comprehensively serving people in their homes, to higher acuity ambulatory surgery.\n\nOptumInsight's revenue grew 18% in the quarter, led by continued market growth across payer and provider services. And the revenue backlog increased by 1.8 billion year over year to 24.1 billion. OptumRx revenue grew 8%, reflecting growth in people served and continued expansion of the pharmacy care businesses, including specialty, home delivery, and community pharmacies. Pharmacy care services revenue growth continues to show momentum, growing double digits in the quarter compared to the prior year.\n\nAnd new customer sales and retention have been strong. Turning to UnitedHealthcare, revenue grew by 11% with all businesses contributing. The number of people served domestically by our commercial insured offerings increased by more than 100,000 over the past half year, as we continue to experience strong growth in our newer, more affordable, consumer-centric offerings. Products such as Surest, which provides consumers with greater certainty and choice over their health benefits and also our virtual first health offerings.\n\nPeople served by our Medicare Advantage offerings continue to grow strongly, increasing 800,000 so far this year. The recently released 2024 plan year star ratings were consistent with our long-term planning expectations, with 81% of our members in four star or better plans, a level we expect will rise as planned refinements are finalized. UnitedHealthcare enters 2023 serving more people in four and five-star plans than any other health plan. The number of people we serve through our Medicaid offerings has grown by 350,000 year to date.\n\nMost recently, we were awarded the opportunity to continue to serve the people of Nebraska in TANF, CHIP, and long-term care programs. UnitedHealthcare achieved the highest score both overall and in each of the individual categories, reflecting our ability to deliver differentiated solutions aligned to our state customers' needs. And we continue to see strength in our dual special needs offerings with exceptional consumer satisfaction, demonstrated by a net promoter score of 80. Our capital capacities remain strong.\n\nYear to date, adjusted cash flows from operations were 21 billion or 1.3x net income. We ended the quarter with a debt-to-capital ratio of 38%, providing ample ability to continue to further build upon vital capabilities, which benefit both the people we serve and the broader health system. And we have returned 10.5 billion to shareholders in the first nine months of the year through dividends and share repurchases. As noted earlier, given the strength of our business performance, this morning, we updated our 2022 adjusted earnings outlook to a range of 21.85 to 22.05 per share.\n\nSo, we think these numbers are telling the story of an enterprise striving to conclude a strong 2022, a year broadly featuring diversified growth today and making foundational investments for our long-term future. Now I'll turn it back to Andrew.\n\nAndrew Witty -- Chief Executive Officer\n\nThanks, John. As is customary with the close of a third quarter, we will offer early observations about next year, while reserving most of this conversation for our November 29 investor conference. Our businesses are growing and operating well, with strong momentum and a keen enterprise focus on executing on our strategic growth priorities. Among a few highlights.\n\nThe OptumHealth Care delivery businesses are rapidly advancing their value-based capacities, expanding the scope and settings of care offered, and creating a long runway for growth. And we see our innovative and consistently highly valued Medicare Advantage plans as well positioned to grow strongly again next year. At this distance, we view a majority of the 2023 analyst estimates as reasonably reflecting performance levels we would expect to offer in November, with the current consensus at the top end of our likely initial earnings outlook range. And as you have come to expect, we continue to strive toward our long-term 13% to 16% earnings-per-share growth goal.\n\nWe look forward to discussing this with you in much greater detail in person at our investor conference in New York. I hope you're getting a sense of an organization that has long been the case is focused sharply on executing with excellence in all we do so that we can meet and exceed our commitments to our customers, clinicians, consumers, and the communities we serve, and, of course, to our employees and to you, our shareholders. With that, operator, let's open it up for questions, one per caller, please.\n\nOperator\n\n[Operator instructions] And we will first hear from A.J. Rice of Credit Suisse.\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nThanks. Hi, everybody. Thanks for the comments. As you think about '23 and you're going through the process of pricing discussions with your commercial employer groups and so forth, is the basic concept -- I know, John, you said continue to return to normal utilization.\n\nIs the basic view is that we would project a medical cost trend off of this year that's more in that traditional 4% or 5% range mid-single digits? And we've heard some discussion about maybe there being an unusual bump-up in addition to the medical -- traditional medical cost trend to allocate something for providers dealing with their labor issues. Is your discussion with employers -- is that something you're seeing getting put in place?\n\nAndrew Witty -- Chief Executive Officer\n\nSo, A.J., thanks so much for the question and, obviously, a key aspect of planning for next year that you're focused on. Just let me make a couple of broader comments, and I might just ask Brian Thompson to reflect a little bit more detail on that as well from the UnitedHealthcare perspective. Obviously, for the last couple of years, there is been a lot of focus on the effect of COVID as you think about impacts on medical cost trend. I think as we've rolled through this year, honestly, I think it's become much less about COVID.\n\nThere is now -- I think there is a blend of possibly a little bit of COVID effect in the system, but cost of living effects, things like inflation, things like capacity constraints in the system as the labor market tightness has affected different parts of the system at different moments. So, I think this whole issue has become actually more complicated in some ways because there is more influences on what you need to think through going forward. With that maybe sort of high-level perspective, maybe, Brian, you might just go a little deeper in terms of how you've been translating some of that as you've been thoughtful about pricing going forward.\n\nBrian Thompson -- Chief Executive Officer, UnitedHealthcare\n\nSure, Andrew. Thank you. And thank you for the question, A.J. Brian Thompson here.\n\nAs we do look forward, I would say that we have planned and price for our cost trend a little higher than historical norms. And I think to some of the points that Andrew made, some of them are pretty obvious and inevitable. The first just being the reality that 2022 is a lower starting point. In addition to that, contributing is labor and inflationary costs.\n\nAnd just being respectful of what we don't know, again, probably the pacing of care patterns and how they return to normal, certainly included in that. I would certainly suggest, though, at the same time, we're working really hard to manage down the impact of these trends on both our consumers and employers alike. And you mentioned how we're negotiating with our provider partners. I would say we've really seen emergence of value-based arrangements at a faster pace than, perhaps, historically.\n\nSo, we're not just seeing unit costs accelerate at a higher rate. And in addition, just more product designs that are meaningfully lowering those price points for end consumers, whether it's virtually enriched products, we mentioned that a little bit. We've talked a lot about Surest and how that consumer choice model is really driving not only a lower price point, but first dollar coverage is really emerging as a priority for those folks that we support and serve every day. So, those are some elements and dynamics not only in the product side, but how we're looking to our forward view of costs.\n\nAndrew Witty -- Chief Executive Officer\n\nYeah. Brian, thanks so much. And I think, A.J., you know, one of the key points, I'm sure you'll have taken away from what Brian is saying there is -- look, there is a degree of -- there is some unavoidable pressures in the macro environment that, you know, everybody is well aware of but we're really doing something about that on behalf of our members and our clients and our customers. Our focus is to bring innovation into the marketplace, whether that's through the way we design plans like Surest in UnitedHealthcare, the way we develop the value-based platform in OptumCare.\n\nAll of which are designed develop to deliver high-quality care at more affordable levels for folks and then to ensure that that is something that can rely on year after year after year. So, a stability of confidence in the healthcare that they can come to expect. So, that's how we're really viewing this. It's obviously a dynamic environment, but we're extremely focused, as you can tell, on making sure we have strong responses to it.\n\nThanks, A.J. And next question, please.\n\nOperator\n\nNext, we will hear from Josh Raskin of Nephron Research.\n\nJosh Raskin -- Nephron Research -- Analyst\n\nHi, thanks. Good morning. Can you refresh us on the components of OptumHealth and sort of how much of that revenue is now coming from OptumCare, and then how many of those consumers are within OptumHealth or actually OptumCare consumers, and maybe how many are in some form of risk arrangement and then how many are full capitation? I think you've given some of those numbers, just looking for a refresh.\n\nAndrew Witty -- Chief Executive Officer\n\nYeah, Josh, good to hear your voice, and thanks so much for the question. So, a very good, very strong quarter, continued strong performance from OptumHealth overall. I'll pass in a second to Dr. Wyatt Decker to give you a little more flavor on that.\n\nJust let me pick out one of those aspects, which is a question you asked about the fully capitated lives within there. So, if you think about OptumCare, obviously, a subset of OptumHealth has about 20 million or so folks who we look after through that platform. Probably, you're still a little under 15% of that number in fully capitation arrangements. So, that really tells you -- you know, despite the very strong impact that's having, you can see the way that's reflected through this sustained 34% growth in average revenue per consumer served in OptumHealth.\n\nA lot of that is influenced by the capitation shift. But it's still a really small fraction of the total number of lives that we look after in that part of our organization. So, a lot of runway there. And that's what really underpins our long-term confidence in sustained growth, particularly in OptumCare, which is a key piece of OptumHealth.\n\nAnd maybe I now pass to Wyatt to give you a little bit more context of how it all fits together. John -- Wyatt?\n\nWyatt Decker -- Chief Executive Officer, OptumHealth\n\nYes. Thanks, Andrew, and thank you, Josh, for the question. Absolutely correct is the importance of capitated and value-based care to both our strategic business model to continue to offer comprehensive healthcare solutions to our nation citizens, as well as to our optimistic outlook on growth. Today, over two-thirds of our revenue are derived from value-based care constructs, and that will continue to grow.\n\nAs Andrew pointed out, we have ample pathways for growth. You'll see us going deeper and broader in the markets that we serve today, as well as going into new markets like the Pacific Northwest and the Northeast. And what I am excited about is, increasingly, we're bringing together the platforms that we have talked about historically and that Dirk touched on today. So, think of home and community is helping us bring value-based constructs to a broader set of populations and servicing more comprehensively those we serve in OptumCare.\n\nSo, you'll hear me talking a lot about OptumHealth and our capitated and value-based risk labs because increasingly, we're bringing all of the services, behavioral, virtual, financial, as well as clinics to bear to grow our value-based population. Thank you.\n\nAndrew Witty -- Chief Executive Officer\n\nThanks, Wyatt. Josh, thanks so much. Next question please, April.\n\nOperator\n\nNext, we will hear from Nathan Rich of Goldman Sachs.\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nHi, good morning. Thanks for the question. You know, I think non-COVID utilization has been running a bit below baseline this year, but you mentioned kind of care pattern is continuing to normalize. How are you thinking about that concept of normalization for both the fourth quarter? And can you maybe just talk about the factors that you think could have the biggest impact on the recovery in non-COVID utilization volumes as we get into next year?\n\nAndrew Witty -- Chief Executive Officer\n\nYeah. Listen, Nathan, thanks for the question. As I said a little bit earlier, I think a good way to think about this is, you know, what has historically been a COVID narrative becomes much more a blended narrative around things like capacity constraints in the system, you know, the cost of living folks' ability to -- or desire to access the system right now, which is an area we are working super hard to try and ensure is sustained. Plus, of course, volatility in things like COVID and flu, particularly as you go through Q4, Q1 over the next few months.\n\nSo, I think all of that is essentially in the mix. You know, we're taking, I think, a reasonably balanced view of how this is going to play out. We've seen now for the bulk of this year, you know, reasonably stable pattern-of-care utilization across the portfolio. We are taking a normal-year view for flu.\n\nSo, you know, we're not particularly staking ourselves out to say flu is either going to be very low as we've seen in the last couple of years, all very high. We just don't know. There is really no evidence to support any decision at this point in time. So, we've taken a very balanced view as we look forward into the flu, which, as you well know, can affect Q4s or Q1s differentially year to year.\n\nAnd that's essentially how we're tackling all of this. We feel very confident about the way we're planning for the next quarter and particularly as we roll into next year. And obviously, we will course correct as things like flu reveal themselves to us. Thanks for the question.\n\nNext question.\n\nOperator\n\nJustin Lake, Wolfe Research.\n\nJustin Lake -- Wolfe Research -- Analyst\n\nThanks. Good morning. A couple of membership questions. First, you know, I would love to hear your thoughts on the potential for what happens with Medicaid membership in your mind post redeterminations, you know, kind of starting? And then, any kind of early view on Medicare Advantage, you know, given the open enrollment kicked in here, what do you think for 2023 in terms of the market? Thanks.\n\nAndrew Witty -- Chief Executive Officer\n\nThanks, Justin. So, I'll ask Tim Spilker and then Tim Noel to comment in a second. Just a couple of kind of introductory thoughts really on your questions, as I said in my prepared comments at the beginning of the call, Justin, redeterminations is a really important potential issue for next year and is something that, as an organization, we are going to -- we are really leaning into. We're very focused on, and that's because we're concerned that through a redetermination cycle during '23 and '24, depending on when the public health emergency comes to an end.\n\nIt could lead to a situation where folks get dislodged from their coverage. And that would be a huge setback in terms of the progress that's been made over the last many years to extend cover. So, we are really focused on how we can ensure that people are retained coverage. Tim will talk in a second around some of the ways in which we feel confident we can help.\n\nBut it is a really important area, and it's an area where we hope the entire industry and its participants all lean in to make sure that people don't get lost in the system as things go through a redetermination cycle. So, that's going to be a super important area. Let me ask Tim Spilker to go a little deeper on that, and then pass straight to Tim Noel to talk about open enrollment. Go ahead.\n\nTim Spilker -- Chief Executive Officer, UnitedHealthcare Community and State\n\nYeah. Thanks for the question. So, first, maybe just some of the numbers. So, we're assuming the PHE will end in January, and redeterminations will resume in Q1.\n\nAnd we will share more detail in November around the specifics. But we're very respectful of a variety of factors that are in play. Certainly, the pacing that will vary by state and then, of course, how consumers respond and behave in terms of the change. So, as Andrew mentioned, we're working hard with our customers.\n\nThis will be a big lift for states, a really long-term effort over the course of 12 to 14 months. So, we're trying to do our part through data sharing, through outreach to consumers, engaging communities, engaging providers, and then really connecting with individuals where they access care, so places like pharmacies. So, we're proud of that work, and we're proud of our ability to be able to support members as they go through this change. With that, I'll hand it over to Tim.\n\nTim Noel -- Chief Executive Officer, Medicare and Retirement\n\nYeah, good morning, Justin. Thanks for the question. Tim Noel here. So, first, if I may start just with kind of an end cap on 2022.\n\nJohn mentioned in the opening remarks that, right now, we've grown about 800,000 Medicare lives and that's consistent with the guidance we gave at our investor conference last year. And we are on pace to end this year '22 with full year growth of 900,000 lives. So, feel good about the way our value proposition has resonated in '22 and feel like that momentum will head into 2023. So, great feedback from the broker community around our product positioning, how we're investing, our emphasis on investments in the most utilized benefits, like drugs and like dental benefits.\n\nSo, feel very good heading into AEP tomorrow. With respect to the industry, you know, over the long-term basis, we have kind of guided to 8% to 9% Medicare Advantage industry growth. I don't have any reason to see it differently from this vantage point for 2023. And once again, I like my chances to outperform the industry in '23 and have share gaining growth.\n\nAndrew Witty -- Chief Executive Officer\n\nThanks, Tim. Next question, please.\n\nOperator\n\nStephen Baxter of Wells Fargo.\n\nStephen Baxter -- Wells Fargo Securities -- Analyst\n\nYeah. Hi. Thanks. Wanted to ask about OptumInsight.\n\nAs you work to grow this business and add new anchor partners, I would love to hear what you are hearing from your health system customers given the challenges they are facing. How is the pipeline developing? Can you remind us, I guess, how much revenue coverage you have for next year at this point? And then just lastly, any update on expectations for change accretion post the divestiture of claims expense? Thank you.\n\nAndrew Witty -- Chief Executive Officer\n\nHey, Stephen. Thanks so much for the question. I am going to ask Dan Schumacher to respond to the first part of that question, and then John Rex will pick up the point on the change accretion piece. So, Dan, go ahead.\n\nDan Schumacher -- Chief Strategy and Growth Officer\n\nSure. Thank you, Stephen. Appreciate the question. Obviously, health system partners are under a lot of pressure.\n\nAnd we talked about some of them from the macroeconomic backdrop in terms of shifting side of care and labor shortages, wage inflation, things like that. So, you know, as we engage with the market, we find that health systems are very responsive because we present an opportunity to be able to address some of those short-term needs. But then really, importantly, on the mid to long-term, we become a key accelerant in some of their transformation initiatives, things like their preparedness for value-based care as an example, or how they engage digitally with patients. And so, those are some of the areas that we have been expanding our reach.\n\nWe have a robust pipeline, and that pipeline has been growing, and conversations have been advancing. And what's been really encouraging is from our existing relationships, we have been able to drive really strong outcomes, and that gives us confidence around the performance. And so, we are excited to see how that develops over time and that will continue to be a contributor. In terms of our backlog, it represents about a quarter of our backlog and not surprisingly less in terms of current revenue contribution.\n\nAnd as it relates to coverage into next year, we have, you know, well north of half coverage on revenue as we look into next year.\n\nAndrew Witty -- Chief Executive Officer\n\nThanks, Dan. John?\n\nJohn Rex -- Executive Vice President and Chief Financial Officer\n\nYeah. On accretion for change, so, yes, it will be accretive next year. In terms of the magnitude of that, really, the important factors and considerations are when it closes within the year, certain expectations in terms of the integration costs that we will -- and investments we will like to make in the business, and when we get that done earlier in the year versus later in the year for a close, and then what it has in terms of impact on the out year an important consideration as we bring that in, I think, a full-out year view. Also, as I am sure you are very aware, the divestiture that occurred in terms of -- with the closing also having an impact on the magnitude of that.\n\nSo, two important things there. Maybe just actually, you know, knowing that you have got models to do here also and as you think about 4Q and how that might play in the 4Q. So, we wouldn't expect a change to be additive to OptumInsight's operating earnings in the fourth quarter. A few elements on that.\n\nOne, the second half for changes. As I know you understand well is it's lower half seasonally in terms of earnings. First half, typically, considerably stronger than the second half. So, the impact there and how that comes in.\n\nClearly, there will be transaction costs that we will be incurring here. So, really, as you think about your modeling purposes, roughly in the zone of 800 million of revenue coming in to the OptumInsight segment without any impact on operating earnings. And, of course, coming back on my comments is how we think about impact going forward. We will look to the point -- to the extent possible, do any acceleration on other important integration activities, so we can bring the potential benefits of the combination of OptumInsight and change to the health system more quickly, could see that potentially in the over $100 million in terms of incremental cost that we might look to do and pull that ahead.\n\nBut all of that is incorporated in the 2020 -- in the outlook that we provided this morning, the '22 outlook and our '23 observations also. Thanks.\n\nAndrew Witty -- Chief Executive Officer\n\nThanks, John. And I think John tees up a really important point that I just want to reemphasize, which is, you know, within the guidance we have given you today for the closeout of '22 and '23, you know, not only are we anticipating obviously continued very strong growth in revenues and the consequential flow through the business, but you are also seeing us create the space to make sure we can make the right investments. So, whether that's in making sure we get the integration of change done as promptly as we can, whether it's how we invest in our consumer capabilities, which really started to get going in Q3 and will continue through Q4 and beyond, or whether it's increasing our investment in our employees to make sure that we are responsive to the cost of living pressures. So, really important that you see that and very much taken into consideration as we thought through our work going forward.\n\nThe other thing I would just also add is that I don't want to -- I think you all understand how important the change integration is for OptumInsight. This is -- it's a great moment to bring together tremendous complementary skills, capabilities, technologies, perspectives on the marketplace. And so, as we roll through the next two quarters or three quarters, we really anticipate a kind of new OptumInsight emerging from this integration. And we are very excited to have Neil de Crescenzo, as well as Dan Schumacher working together to lead these two organizations as this work goes on.\n\nSo, a lot of energy potentially being released in this space. And as John said, we've incorporated into our guidance points the space to potentially make the right investments going forward. Next question?\n\nOperator\n\nScott Fidel of Stephens.\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nHi. Thanks. Good morning. I know that continuity of care has been a big focus here, especially with redeterminations coming back.\n\nAnd just interested in that context how you are thinking about potential footprint expansions in the ACA exchanges for 2023 and beyond. It looks like also there has been some favorable policy developments and then some competitive changes to that could be positive for the market. So, just interested in your thinking on, you know, exchange strategy for both next year and longer term. Thanks.\n\nAndrew Witty -- Chief Executive Officer\n\nI really appreciate that question. As you know, this is an area where we have been building up very substantially over the last couple or three years, and maybe ask Brian to give you a little bit more detail on that.\n\nBrian Thompson -- Chief Executive Officer, UnitedHealthcare\n\nSure, Andrew. Thanks for the question, Scott. And we agree totally. We see the exchanges is really emerging as a meaningful place and a broader coverage criteria across this country.\n\nAnd it's certainly important to us to be more relevant each and every year. In fact, while we are expanding into four new states in 2023, our footprint is expanding meaningfully. I think we're going from around 40% of the addressable market here, leaving 2022 to nearly two-thirds by the end of next year and again -- or by the start of next year, I should suggest. So, again, reasons aligned with yours.\n\nIt's important that we are where folks are. And as we manage through this redetermination process working not only with our employer partners or distribution partners in our states, but making sure we have product ourselves to make sure that these folks can get enrolled in. And we are encouraged by our progress. We like how we are positioned here, leaving 2022 both from a footprint and receptivity and growth and a performance perspective, and looking forward to expanding again in '23.\n\nAndrew Witty -- Chief Executive Officer\n\nGreat. Thanks so much, Brian. Thank you for that question. Next question, please.\n\nOperator\n\nKevin Fischbeck of Bank of America.\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nGreat. Thanks. I want to go back to trend, again, if I can. You know, can you give a little more color in the quarter about how trends looked across the three different payers? And when you talk about normalization in 2023, should we expect all three of them to be kind of back to normal? Or do you have a view that the government, which has been lagging a little bit, will still kind of take a little bit longer to get back to normal.\n\nThanks.\n\nAndrew Witty -- Chief Executive Officer\n\nKevin, thanks so much for the question. Maybe I will ask Brian to make a couple of comments on that.\n\nBrian Thompson -- Chief Executive Officer, UnitedHealthcare\n\nSure. Hey, thanks for the question, Kevin. Maybe I will start with service type. And it's really a focus on inpatient.\n\nThat has been the driver, and it really was the driver last quarter as well. So, when I look at third quarter, it's largely a repeat of what we saw in the second quarter. Beyond inpatient, some variation, I would say, all other service types to largely near at or even slightly above normal levels. To your question, though, on lines of business, I might just suggest other than inpatient commercial, pretty much at normal care patterns.\n\nMedicare is seeing some interesting developments. I would say maybe signs of more durable shifts inside of service, particularly urgent care is a little lower -- excuse me, a little higher, but ER is a little lower. And that's certainly a good trade for the system overall. Outpatient surgeries in Medicare seem to be back to normal.\n\nBut again, as I had mentioned, inpatient, a little bit lower. And again, Medicaid, consistent with the other lines of business, lower in inpatient and physicians starting to trend back. So, again, that's largely a repeat of what I had suggested last quarter inpatient really being the most notable element inside it.\n\nAndrew Witty -- Chief Executive Officer\n\nBrian, thanks so much. And thank you for the question, Kevin. Next question, please, April.\n\nOperator\n\nNext, we have from Lisa Gill of J.P. Morgan.\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nThanks very much for taking my question. When we think about membership in the commercial market, I am just curious how employers are currently talking to you about that trend going into '23. And if you can just give us an update on your thoughts around if we move into a recessionary type of environment what that could mean for the health plan business.\n\nAndrew Witty -- Chief Executive Officer\n\nLisa, thanks so much for the question. And I will pass that actually to our new Head of E&I, our commercial insurance business, Dan Keuter. Dan, would you like to answer that?\n\nDan Keuter -- Chief Executive Officer, UnitedHealthcare Employer and Individual\n\nYeah. Thanks, Andrew, for the introduction. And, Lisa, thanks for the question. As you know, at this point in the year, our national accounts business for 2023 is largely resolved, but the other segments of our business are not resolved.\n\nAs we look at that national accounts performance, we are very pleased with what we have seen in terms of a very strong renewal year and also a strong sales year, which leaves us I am confident in a growth year for national accounts for 2023. The other lines of the business are yet to resolve. Specifically related to your question about recessionary impacts, we are certainly well aware of those. However, I would note at this point, based on our Q3 performance, we have seen net hiring among our customers.\n\nSo, we have not yet seen an emergence of recessionary impact in our commercial book of business. Looking forward to 2023, we will assess the continued evolving economic situation and provide additional guidance as that becomes more clear.\n\nAndrew Witty -- Chief Executive Officer\n\nGreat.\n\nDan Keuter -- Chief Executive Officer, UnitedHealthcare Employer and Individual\n\nThanks for your question, Lisa.\n\nAndrew Witty -- Chief Executive Officer\n\nDan, thanks so very much for that. And, Lisa, thank you for the question. So, last question, please, operator.\n\nOperator\n\nAbsolutely. Our final question for today will come from Gary Taylor of Cowen.\n\nGary Taylor -- Cowen and Company -- Analyst\n\nHi. Good morning. I just want to come back to '23 for a moment. I think the current Street consensus is about 13% earnings growth off your updated '22 guidance.\n\nAnd I was hoping maybe this would be a year where you wouldn't have to say initially that look to be at the high end of the initial range. And, obviously, I understand, you know, guidance has often come up over the course of the year. But when I think about '23, I just want to make sure I am capturing what you're saying. You talked about redeterminations.\n\nYou talked about some incremental investments in consumer and employees. And you also talked about, I think, just sort of healthy respect, as you might call it, for maybe utilization continuing to normalize. Could you rank those for us in terms of how you are thinking those headwinds weigh on '23 a little bit? Is there anything else you would say is material enough to add to that list?\n\nAndrew Witty -- Chief Executive Officer\n\nGary, thanks so much for the questions. I mean if you kind of just think about the blend of headwinds, tailwinds for 2023, in terms of headwinds, I would probably say the external environment, the inflationary pressures, obviously, in among that mix. Question on whether or not we see any kind of economic slowdown, as you just heard, we are not really seeing that yet in terms of our marketplace. But, you know, we have got to be thoughtful about that, and we want to make sure that we go into the year, not assuming anything overly optimistic.\n\nIt would be great to have pleasant surprises on that dimension, of course. Utilization levels, I spent a lot of time on this call talking about that as we start to see that, you know, continue to normalize. And then the investments, I mean those are really the four areas of investments in our business and you recited those very nicely. Now, on the other side, you think about the tailwinds for the business, very strong income and momentum for the organization, OptumHealth's growth in patients served.\n\nThe evolution of the at-home platform, which has gotten over the last 2.5 years, three years, has moved to a very significant scale, complementing our clinic platform. Strong capabilities that we are demonstrating in Medicare Advantage, you look at those, really driving tailwinds for the organization, very substantial. The scale of those organizations and what we are able to do very material. And then I would also say our ability to continue to deploy capital effectively in the marketplace is another one of the things to really think about.\n\nAnd it's interesting, actually, just to pause for a second today and contrast where we are today versus where we were a year ago. So, year-to-date 2021, we have deployed about $5 billion of capital in M&A, which was about the full year number in the end. As of today, we have spent $20 billion in 2022. So, in terms of our ramp-up of capital deployment, and you heard from John Rex earlier, we have very substantial continued capacity.\n\nAnd obviously, the marketplace is getting interesting around that space. We have talked several times to you in the past about the diverse pipeline of opportunities that we see probably as diverse as we have ever seen. Very much opportunities we see across a number of our key growth platforms. And as we all know, the market is beginning to be very discriminating in terms of value.\n\nSo, we will see how that plays out for us, but I think you have to expect that to be a tailwind for us as well going into next year. With that, Gary, thanks so much for the question. And thanks, everybody, for your time and questions today. We do hope you're taking away the impression of a company confident in its opportunities and ability to grow.\n\nDeeply aware of where and how we need to continue to build and improve, and fully committed to our mission of helping people live healthier lives and helping make the health system work better for everyone. I want to thank you for your attention, and we look forward to meeting many of you in person in New York later in the quarter. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAndrew Witty -- Chief Executive Officer\n\nDirk McMahon -- President and Chief Executive Officer\n\nJohn Rex -- Executive Vice President and Chief Financial Officer\n\nA.J. Rice -- Credit Suisse -- Analyst\n\nBrian Thompson -- Chief Executive Officer, UnitedHealthcare\n\nJosh Raskin -- Nephron Research -- Analyst\n\nWyatt Decker -- Chief Executive Officer, OptumHealth\n\nNathan Rich -- Goldman Sachs -- Analyst\n\nJustin Lake -- Wolfe Research -- Analyst\n\nTim Spilker -- Chief Executive Officer, UnitedHealthcare Community and State\n\nTim Noel -- Chief Executive Officer, Medicare and Retirement\n\nStephen Baxter -- Wells Fargo Securities -- Analyst\n\nDan Schumacher -- Chief Strategy and Growth Officer\n\nScott Fidel -- Stephens, Inc. -- Analyst\n\nKevin Fischbeck -- Bank of America Merrill Lynch -- Analyst\n\nLisa Gill -- JPMorgan Chase and Company -- Analyst\n\nDan Keuter -- Chief Executive Officer, UnitedHealthcare Employer and Individual\n\nGary Taylor -- Cowen and Company -- Analyst\n\nMore UNH analysis\n\nAll earnings call transcripts"
}