{
  "companyName": "Netflix",
  "companyTicker": "NFLX",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/18/netflix-nflx-q3-2022-earnings-call-transcript/",
  "content": "Netflix (NFLX 1.29%)\nQ3 2022 Earnings Call\nOct 18, 2022, 6:00 p.m. ET\n\nSpencer Wang\n\nGood afternoon, and welcome to the Netflix Q3 2022 earnings interview. I'm Spencer Wang, VP of finance, IR, and corporate development. Joining me today are Co-CEO Reed Hastings, Co-CEO and Chief Content Officer Ted Sarandos, COO and Chief Product Officer Greg Peters, and CFO Spence Neumann. Our interviewer this quarter is Doug Anmuth from J.P.\n\nMorgan. As a reminder, we will be making forward-looking statements, and actual results may vary. With that, let's jump into it. Doug, over to you for your first question.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nGreat. Thanks, Spencer. And great to see all of you, and thanks for having me join you again today. So, let's jump in with advertising.\n\nObviously, a lot of discussion here heading into the launch. You announced details for the new basic with ads tier last week launching in the U.S. and 11 other markets. Can you help us understand how you arrived at the price point and the product features for basic with ads?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nYeah, Doug. So, you know, a lot of what we're thinking in terms of setting pricing for basic with ads and how we think about pricing, in general, anchors on, you know, what's the value that we're delivering consumers. We're trying to work very hard to translate the dollars that they give us and do incredible shows. And you can see, sort of, in Q3 some great examples of the series that we're delivering there, the films we're delivering there under the Q4 slate looks incredible as well.\n\nAnd then specifically, with regard to ads, we modeled out essentially what we think the expected revenue is on a variety of different countries that we're launching in to make sure that, you know, in a combination of the subscription price that we're charging for basic with ads plus that anticipated monetization, we'd be roughly, call it, unit economics-wise, revenue positive to neutral And then when we look at them, the fact that we think that this lower price will -- consumer-facing price will bring in a lot more members, then we're quite confident in the long term that this will lead to a significant incremental revenue and profit stream.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. And I guess just to clarify there when you talk about kind of getting neutral and perhaps more accretive over time, you know, what are you comparing that to on a unit economic basis that's essentially more to the basic tier?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nYeah. It may be relevant to note that we don't see a lot of members switching plans. So oftentimes, when they, you know, come in and they select the plan for a given feature, let's say, that's the 4K resolution, you know, we see that to be a pretty sticky choice. And so, when we're thinking about unit economics being neutral to positive, we're really comparing to the like feature set in the basic without ads.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. OK. Great. So, maybe you could talk a little bit about what gives you confidence in that advertising arm? And how would you frame advertiser demand thus far? I know Jeremy, last week talked about having hundreds of advertisers on board and ad inventory almost sold out.\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nYeah. We started with a bunch of models that were informed by obviously the ad activities in those different countries around the world. But, you know, now we're at the point where we get to take those models and we get to bring them actually to advertisers and sort of see what's working in practice. And it's been great to see both our partner in Microsoft and their sales team, as well as our small but crack ad sales team in actual action with brands and with agencies, working through that.\n\nAnd I would say that the initial demand that we're seeing is very strong. So, people are very excited about the proposition of bringing their brands and their ads to a bunch of consumers around the world that are watching our shows. They're excited about the positioning against the incredible content and the titles that we have. And so that demand has been very, very strong.\n\nAnd so, we're seeing sort of a lot of the expectations that we built into our models come through in that actual sales process. So, that's great. I think it's also worth noting, though, that we're very much in the walk -- a crawl-walk-run kind of model that we talked about before. We're sort of iteratively improving.\n\nAnd so, we're building in a lot of capabilities over the next couple of quarters that we think are important to advertisers to make that advertising offering increasingly attractive and sort of check a bunch of boxes that they have. You might have seen the verification partners that we announced. That's a pretty good example of that. But we've got a lot more on that road map to go do that we're excited about delivering for brands.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. So, in terms of those capabilities targeting, obviously, very important here as well. I think you've talked about having broad targeting by country and genre and I think within the top 10 shows. And I believe you also asked for age and gender at the time of sign-up as well.\n\nEarly feedback from marketers and agencies has been that the targeting options at launch are fairly limited. What's your view on that? And how will that targeting evolve over time?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nYeah. Again, I think we're starting -- part of what we want to do is actually get this out to market quickly. And you could see we went from basically the point we announced it to delivering it in about six months, which has been a testament to a lot of hard work on internal teams and to Microsoft. But we do have relatively basic targeting capabilities in terms of contextual targeting, genre, etc.\n\nBut that's sort of consistent with what we see with television as well, right? And obviously, now our job is to move from that into more of what we expect from a digital world where we have 100% signed-in audience, fully addressable, fully targetable, and so we can start to layer in additional targeting capabilities over time. I think it's also worth noting when we talk about that that we're very cognizant of privacy, and we want to make that paramount and how we would think about this offering and all of the data that we use will just be used to basically deliver more relevant ads offering on Netflix, and we're not using that data in any way, shape, or form for a profile building off Netflix or anything like that.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. There's been a lot of discussion in the press about CPMs that are really two to three times those of CTV or other AVOD players. Is that accurate? And what justifies the much higher pricing for Netflix?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nI'm not going to comment on any specific pricing, but I would just say that I think we've got a very attractive offering, and that's a combination of the audience that we have, that we're delivering to, that oftentimes it's hard to access in other ways, certainly harder to access in traditional TV in many cases. And it's a result of the incredible content that we've got. So, Ted's team is doing an amazing job at producing titles that advertisers want to be next to. And so that's, I think, what you see is driving the demand and the pricing that we can get.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. You've talked in the past about wanting the ad offering to be innovative and somewhat different over time. If we think about the range of four to five minutes of ads per hour, it's certainly lower. You've talked about tight-frequency capping.\n\nWhat else do you think is innovative at least in the initial offering? And then how does that evolve more over time?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nYeah. As you noted, we want to start with an experience that's very pro-consumer, you know, consumer-centric. And so, that's definitely informed both our ad load and thinking about the frequency capping. What I love about those things is the more we talk to brands and advertisers, there's actually a high degree of alignment between sort of what their desires are and we think is great for consumers.\n\nSo, they're enthusiastic about not having high-frequency caps and having sort of more unique offering there. And also, limited ad loads sets their ads apart more distinctly. So, I think I love that alignment to begin with. And then over time, we're going to access a bunch of the capabilities that you've seen us leverage over the last 10 years to think about innovation in the space.\n\nSo, personalization, I think, is a great example where we don't need to think about the ads experience as being uniform across all of our members. And we think about we can leverage the personalization capability that we've built in terms of titles and how we present titles and also in terms of how we present ads. So, I think that's an exciting dimension that we're going to work on as well. And additionally, we're also excited to work with sort of partners and our advertisers to think about what is that ad experience, the ad format that is really best suited for premium connected TV.\n\nAnd we're starting with meeting the market where it's at today. That's important to access sort of all the capabilities they've got, but we don't need to stay there. And I think we're looking forward to, over a couple of years, understanding what is the right native format for premium connected TV and figuring out what that looks like.\n\nSpence Neumann -- Chief Financial Officer\n\nHey, Doug, I might just add also just part of the innovation was just, for us, the business innovation of speed to market. As Greg said, getting from announced to launch within six months and to doing so in every region in which we operate, so 12 markets that represent well over half of our revenue today, so part of it is just that nimbleness and speed which hopefully will bring to our innovation path going forward as well.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. In terms of subscribers, how do you think about just this concept of kind of new net adds versus trade-down from existing subs on the basic with ads tier? It's obviously a pretty frequent discussion with investors.\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nYeah. Again, I think it's important just to reiterate that we don't see a lot of plan switching on the existing plan set. So that's, I think, a worthwhile point to note. And then obviously, as we stated before, we're not really trying to steer our members to one plan or another.\n\nWe're trying to take a pro-consumer approach and sort of let them find and land on the right plan for them. And as we stated, we modeled out that expected performance on ad monetization and factor that into our thinking around price point for the basic with ads. And so, we really anticipate that this is going to be a pro-consumer model that will be more attractive, bring more members in because the consumer pricing price is low. But then again, the economics and the revenue will be fine as a result even if some of those consumers switch plans.\n\nAnd again, just to restate this, when you factor in those extra members, we expect this leads to a significant and incremental revenue and profit stream.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nAnd how do you think about the impact in terms of reducing churn and perhaps how that plays out across some of the different markets, given different characteristics and levels of penetration?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nYeah. I think generally, what we've seen is that, obviously, lower price helps with churn. And so, I think that there'll be some positive dynamics there. But again, we really -- we're in early days now, and we've got to launch this thing and we'll learn so much more over the months to come.\n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nDoug, and so much of that is tied to engagement. I mean the best way to reduce churn is to keep them entertained.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nRight, right, which you've clearly done in this past quarter, and we'll talk more about that in a minute, Ted. At the Code Conference last month, Sundar said that the Netflix-Microsoft ad deal is one of the biggest ad deals ever. Are there any particular components of the deal that give you confidence in the advertising revenue outlook here and how it compares to subscription over time?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nWell, one of the big factors for us in picking Microsoft is that we felt like we were highly strategically aligned. They had an approach that was similar to ours, which is that we want to launch and then learn quickly and iterate quickly and that there was a lot of flexibility both in terms of innovation around the formats and approaches that we just talked about. Partly, it was a lot of flexibility in thinking about how do we leverage the combined go-to-market capability that Microsoft has a lot of right now and that we have very little, but we're going to build over time. And frankly, when I see the demand that we're in right now, we're stretched between the two teams to really support all that.\n\nSo, I'm actually excited about our ability to grow that capacity on the Microsoft side that I think they're going to do some hiring and building, and we're going to do some hiring and building and then through that joint capacity growth, be able to better serve more advertisers, which we can't even actually returning some folks away right now because we just don't have the go-to-market capacity to serve everyone.\n\nReed Hastings -- Co-Chief Executive Officer\n\nAnd Doug, at that same conference, Bob Iger said that linear TV was going off a cliff.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nHe did.\n\nReed Hastings -- Co-Chief Executive Officer\n\nAnd what we -- or what I underappreciated was just the impact on advertisers. They're just being able to reach fewer people. And then the 18 to 49 demographic is even faster than the decline in pay TV. So, this is what is really fueling the cycle is that really collapsed linear TV as an advertising vehicle outside of a few properties like sports.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nSo, Reed, maybe that just brings up the question -- and for you as well, Greg. I mean when you're going out to agencies and marketers, do you feel like you're going after linear TV dollars? Or are you going after digital dollars right now?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nI'd say when you look at the capabilities of our -- the current offering that we have as a publisher, I think we're mostly competitive with linear right now. Obviously, I think that we'll build into that over time. And a lot of what makes digital attractive will be part of our offering as we go. Obviously, I think when you think about sort of demand capture and those direct response ads versus sort of the more brand side, we're probably going to be leading for some time more into that brand side of things where we can be more competitive.\n\nBut I think those worlds are going to blur over time realistically. And our job is to be highly competitive with the components, the technical components that we can add in, in terms of targeting, etc., but also then be very competitive because we have really incredible content and an incredible audience that advertisers want to connect with.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. And Spence, in terms of ad revenue, it feels like it should be very high margin. Maybe you can just talk about some of the key costs or investments in running the ad business given that Microsoft is responsible for the bulk of that sales for now?\n\nSpence Neumann -- Chief Financial Officer\n\nYeah, I'd agree with you, Doug. Again, we need to build this out over time. As Greg said, on a unit economic basis, we feel good that this will be kind of net neutral to positive out of the gates. And then when you add in the incrementality on subscribers, we think we can build a big incremental revenue and profit streams.\n\nSo, there are some costs. Obviously, there's some cost to our partnership with Microsoft. There's some cost of building out our side of the internal team to kind of build out our capabilities with Jeremy and Peter, and then obviously, some other costs here and there. But overall, I'm not going to get into specifics, but we believe this can be margin accretive over -- certainly margin accretive over time.\n\nIt's going to be pretty small out of the gates. It's kind of reflected in our Q4 guidance. As you can see, don't -- it's an intra-quarter launch. We're not expecting any material financial impact in this first kind of partial quarter, but we'll build over time, and it will be additive to the business.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. All right. So, for the record, we're not hitting subscriber numbers until about 15 minutes in here.\n\nSo -- but you added 2.4 million subs in the third quarter. You're expecting 4.5 million in 4Q. Maybe you can just kind of walk us through how you're feeling about core subscriber growth before you kind of get into the dynamics in '23 around advertising and paid sharing.\n\nReed Hastings -- Co-Chief Executive Officer\n\nWell, thank God, we're done with shrinking quarters. So that's a big feeling of -- we're back to the positivity. Obviously, this quarter in the guidance for Q4 are reasonable, not fantastic but reasonable. And then we got to pick up the momentum.\n\nEverything the company is focused on, whether that's on the content side, on marketing, lowering prices to the ad supported, the paid sharing, the thoughtful approach we're doing there lines us up for a good next year. We still got FX. So that's a huge hit, as we've explained. So that's not going to go away.\n\nBut other than that, all the stars are lining up very well for us. Spence, do you want to add to that?\n\nSpence Neumann -- Chief Financial Officer\n\nYeah, Reed, now you're doing my job for me, which is great. I appreciate that. But yes, we're -- as Reed said, we're not -- we're still not growing as fast as we'd like. So, we're building momentum.\n\nWe're pleased with our progress, but we know we've got a lot more work to do. We're pleased with Q3. We saw acquisition growth a bit more than we had in the past few quarters, which is great across every region. Churn remained, yes, slightly elevated, kind of similar to where we were at the end of Q2.\n\nBut overall, when you combine those two things, we delivered paid net adds of 2.4 million, which is a little bit above our guide. So, we kind of under forecast there, obviously. And then for Q4, as we talked about -- and as we talked about -- you mentioned, we're guiding to 4.5 million paid net adds. Reflected in that guide is what we talked about.\n\nWe're off to a nice start. I'm sure Ted will talk about the strength of the content slate. We started with \"Monster: The Jeffrey Dahmer Story\" and into \"The Watcher\" and others that are building. So it's a strong seasonal quarter.\n\nBut some of those revenue accelerators that we know we're focused on in the near term, whether it's ads, we just talked a bunch about that. There's not going to be -- we don't expect at least a big financial impact in this first launch quarter. And we also -- as we talked about in the letter, we have a solution that we'll be rolling out in '23 for paid sharing and monetizing all that unpaid viewing we've been talking about. But again, that doesn't even start rolling out until early '23.\n\nAnd there's some other near-term limiters to our growth. There's -- on the take currency out, we still have -- penetrating the connected TV market and the sales cycle there. We've got competition. We've got some macro strain, whether it's higher inflation, energy prices, and some of the geopolitical strain around the world.\n\nSo, all those things are factored into our guide. It's a little bit less visibility than we typically would see. But overall, we feel really good that we're building that momentum. We've set a path to the growth.\n\nYou're seeing growth in paid net adds both in actuals for Q3 and into the guide to Q4 and most importantly, a path to accelerate revenue growth and hit the ground running in '23.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. You had your two biggest English language series ever, I think, in the span of three to four months with \"Stranger Things 4\" and \"Dahmer.\" Do you believe the content cadence is becoming more normalized to your post-pandemic? And how much of a factor were those titles in driving 3Q subs and now more momentum into the fourth quarter?\n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nLook, big shows that folks engage with and talk about drives a lot of growth. I do think it's the -- people come to value that. And for us, our goal is we've got to get them to come to expect it. So, right after they finish something great that they love that there's an expectation that there's something right behind it.\n\nSo, you described it pretty nicely. You come out of \"Stranger Things\" season four. You roll right into a big movie like \"Gray Man\" or a movie that you fall move with like \"Purple Hearts\" or a great animated feature like \"Sea Beast,\" then you do with that, and you roll right into \"Monster: The Jeffrey Dahmer Story.\" And then right out of that, I mean, back-to-back hits from Ryan, going right into \"The Watcher.\" So, I think it's -- that cadence is something I do think we're getting better at as we get more and more mature in our creation of original content. Remember, Doug, we've only been at it for 10 years.\n\nSpence Neumann -- Chief Financial Officer\n\nAnd the other thing is --\n\nReed Hastings -- Co-Chief Executive Officer\n\nYeah. Just --\n\nSpence Neumann -- Chief Financial Officer\n\nGo ahead, Reed, sorry.\n\nReed Hastings -- Co-Chief Executive Officer\n\nTed, maybe just talk a little about the smoothing of content monthly, kind of what state we're at this year, what you think we can get to next year sort of easing out of that COVID concentration. \n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nYeah, COVID got a lot of content jammed up in the later parts of the year, and then that impact rolls out and rolls out because even when people are getting back to normal work, they were all working on those projects during COVID. So, it takes -- it will take several years to completely unwind the COVID logjam. And historically, Q4 tends to be a little heavier than Q1 and Q2, mostly because of the historical legacy of the fall TV series and the fall film cycles with film festivals and award cycles, and all those things that are kind of unnatural to viewers watching. So, we're trying to be more and more aggressive about smoothing that out to make sure that the content is available when people are ready to watch it. \n\nSpence Neumann -- Chief Financial Officer\n\nAnd just to add to that, it's really kind of smoothing it out across all of our content categories. So, there's always something great to watch whatever your mood or taste. And even just to build on Ted's point, it's not just kind of the English language titles. And I'm sorry if I missed some of what he said.\n\nBut even if you think of the last -- in this last quarter, whether it's every region, \"Sintonia\" in Brazil, it's \"The Empress\" in Germany, \"High Water\" in Poland, \"Narco-Saints\" in Korea, more and more of those big local titles with big local impact as well that can -- that also have the ability to travel. So, it's really kind of getting that cadence in every country and region around the world. \n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nAnd probably none was a better example of this go around than \"Extraordinary Attorney Wu\" from Korea, 400 million hours of watching around the world. Just a real phenomenon that we can take a show that other folks would view as being extraordinarily Korean and make it work around the world. \n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Ted, there's a lot of discussion just around the philosophy around content. And I guess the question is, is there a process or selectivity changing at all in terms of the greenlighting of content? Does it need to? \n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nLook, the -- let me go back to what I was saying earlier. We started this about 10 years ago. We had no IP. We had no library.\n\nWe moved as quickly as we could to build a library of our own IP and to build our own library. And in those 10 years, that library now gets more viewing, more revenue, and more profit than all of our competitors who've been at it for over 100. So, when I look at that and think, \"OK, along the way, we probably made a lot of mistakes.\" And we learned a lot. So, today, when I think about what we learned today, we've kind of developed a lot stronger skill sets and partnerships and processes to ensure quality of delivery and working with our creators and to give them the tools to deliver for the audience, some things that are fairly proprietary and some things that just benefit from the scale of our business so that they can really do what we want to do, which is please audiences.\n\nAnd you've got to remember as we go, to do that, it isn't just making prestige shows in English. It's also making a very kind of pop culture television across every genre across every format imaginable. And in doing that, that's the thing that I think we can bring scale and creativity and audience connectivity that others can't compete with. So for me, that's the biggest thing that when you say, are we sharpening our tools, are we getting better, we're definitely getting more mature about the process.\n\nAnd then if you go all the way back to the beginning of time, we didn't have any staff who'd had any experience in creating original anything on Netflix. So, we build that up to where we're at today, which is in the last quarter, we've released seven of our most popular releases of all time just in this last quarter. \n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Great. You talked last quarter about content, Spence, staying kind of flattish around $17 billion or so number in annual cash spending. So, I realize that that's up this year when you kind of take out the incremental COVID costs from last year.\n\nBut does the discipline around content spending push you to do anything differently? And I guess, what's your confidence that you can deliver both the quantity and also the quality of content that you want within that number across all regions?\n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nLook, I think what we're seeing, Doug, is that both the scope and scale, as well as the range and the cadence of hits is improving. So that -- I feel better and better about that $17 billion of content spend because what we have to do is be better and better at getting more impact per $1 billion spend than anybody else. And that's how we're focusing on it. So, I think we're about the right -- we're spending at about the right level.\n\nAnd as we reaccelerate revenue, we'll revisit that number, of course, but we're a pretty disciplined bunch about that.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. The \"Knives Out\" sequel, \"Glass Onion,\" so pretty highly anticipated. You're going to release it in a limited number of theaters, I think, for a week around Thanksgiving before hitting Netflix, I believe, on December 23. But there also seems to have been a push to perhaps run it for a longer period of time in theaters.\n\nSo, maybe you can just talk about some of the debate there, what the rationale is to just do it for one week. And how do you think that that kind of release will drive viewership on Netflix? \n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nWell, first, I'll tell you, we're in the business of entertaining our members with Netflix movies on Netflix. So, that's where we focus all of our energy and most of our spend. Our films are always heavily featured in film festivals around the world because they're in demand, made by the greatest filmmakers on the planet. And for all those folks who can't get to a city where a festival is, this one-week release on 600 screens is a way of creating access to the film and building buzz, the same thing we're doing in those festivals.\n\nSo, I would look at this as just another way to build anticipation for the film and build buzz and reputation for the film ahead of its Netflix release. There's all kinds of debates all the time back and forth, but there is no question internally that we make our movies for our members, and we really want them to watch my Netflix. And of course, with one week of release in theaters, most people will see them on Netflix, just like they see all movies. Most people watch most movies at home.\n\nSo, we think that there's a plenty of -- and I think this particular release sits somewhere between that week, we have to run movies to qualify for awards and the time that we run them in a film festival and the time that we travel them around, but it's a way of condensing that into a louder event.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nGot it. OK. Pretty clear. Let's shift gears a little bit, talk about paid sharing.\n\nYou announced profile transfer yesterday, which facilitates nonpaying members shifting their recommendations and history and other settings to a new account. Maybe you can talk about how this is a potential precursor to having borrowers kind of become either having their own accounts or adding to an existing member. And just how we should think about timing of the rollout there?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nSure. The profile transfer, I mean, supports a couple of different use cases, right? I mean there's obviously situations where you can imagine like you have a kid at home who is going to go off and become an adult and get their own account and it supports those ones. But it does enable a key thing that we learned around how we think about paid sharing. And we've been working really hard to try and find essentially a balanced position and approach toward this one that supports customer choice and, frankly, a long history of customer centricity that we think is informed how we think about establishing our service but balancing that with making sure that as a business, we're sort of getting paid when we're delivering entertainment value to consumers.\n\nAnd as we try to deal with pretty much all of our product changes where we can, we try and try different approaches and listen to our members and use their reactions to help us understand what's working and what's not working. So, we've tried a couple of different approaches in different countries. You saw that. And based on the customer feedback that we're getting, we sort of landed on an approach toward paid sharing that we think strikes that balance.\n\nAnd a key component of that is the ability for borrowers, people that are using somebody else's account right now to access Netflix, to be able to create their own separate account. And part of that is transferring their profile and their viewing history and all the great information that basically informs hopefully great recommendations for them. And we think that that sort of separate account path will be especially attractive in countries where we're launching that lower-priced basic with ads plan, that lower price obviously makes that more attractive. Another component of this, though, is allowing account owners to be able to pay for Netflix for some friends or family, something they want to share the service with.\n\nAnd so they're able to create a sub account, which we're calling extra member to enable that model, too. So, we're trying to come up with a range of options that supports customer choice, balances those considerations, but also ensures that we've got a sustainable business model that allows us to invest in more of that great entertainment that Ted's team has always focused on for all of our members. So, we're looking forward to getting that out in early '23.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nAnd do you think extra member and kind of new accounts, could that be bigger than advertising in 2023 for Netflix?\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nI don't -- I won't say which is to be bigger or better. I think they're complementary in many ways. And what we're seeing is that there's a number of different consumer needs, right? And paying for Netflix for somebody that you want to share that service with, that's a legitimate need. Creating a lower price that balances out for us as a business with monetization from ads, that's a legitimate need to get to all the great content that we're making.\n\nSo, I just think of this as a range of options that try to speak to a range of different consumer needs, the right price points, the right feature set. And we're really just trying to do a better job at expanding that range so that we can serve more consumers on the planet in the right way.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Spence, maybe you could talk a little bit just about the decision to no longer provide guidance on subscribers starting next quarter.\n\nSpence Neumann -- Chief Financial Officer\n\nSure. Spencer, do you want to take that one? Or -- sure.\n\nSpencer Wang\n\nSure. Happy to take it. I appreciate the question, Doug. So, maybe just to start, focusing on subscribers in our early days was helpful.\n\nBut now that we have such a wide range of price points, different partnerships all over the world, economic impact of any given subscriber can be quite different. And that's particularly true if you're trying to compare our business with other streaming services. So that's why we've been increasingly focused on revenue as our primary top-line metric, as you've heard us talk about the last several years. And this is going to be, I think, even more important as we head into 2023 and we develop new revenue streams like advertising and paid sharing where membership growth is only one aspect of the revenue picture.\n\nSo, just to be clear, we will continue to report our global membership every quarter when we release earnings, as well as the paid net adds. We'll also continue to disclose our regional membership, as we do today. And in terms of our revenue guidance, you should expect that we'll give you some color on the underlying drivers of the revenue forecast, but we just won't provide a pinpoint paid net adds figure per se. And then lastly, we'll continue to provide guidance for all the other metrics, Doug, that we do today, namely: revenue, operating income, operating margin, net income, EPS, and share count.\n\nSo, in the grand scheme of things, pretty minor change. \n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. That's great. That's helpful. If we look at the 4Q guide, 4% operating margin.\n\nIt's heavily impacted by FX pressures. I think it's 10% ex FX and I guess, on a year-over-year basis, kind of up from 8%. Maybe you can just talk about some of the factors there. Is there anything fundamental in terms of the business that's kind of perhaps weighing there a little bit more on 4Q margins? Or is it kind of all FX?\n\nSpence Neumann -- Chief Financial Officer\n\nIt's really all FX, Doug, as you said. I mean, year over year, FX neutral constant currency, we're actually up at a -- we'd be a 10% margin versus 8% prior 4Q. So, it's -- the FX drag is significant. We mentioned in the letter if we -- if we look at, you know, our -- you can do the math on our four quarters now and you kind of roll it out to a full year number, we're still holding to what we're calling FX neutral to the beginning of the year, January 1 of this year to that 19% to 20% margin range, FX neutral.\n\nYou can -- you'll see it's -- it actually is in the mid to higher end of that range. But on a reported basis, it's just a little over 17%. So, there's about 2.5 points of FX drag in our margin. That equates to about -- it's about $1 billion of revenue drag, about $800 million of margin drag.\n\nAnd the bulk of that is being felt in the fourth quarter as it's built up through the year.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. And then I guess maybe you can just talk about cash content spending. Just to confirm, it sounds like you're kind of reiterating the same thing around the $17 billion type of level going forward. What does that mean for free cash flow generation over these next few years?\n\nSpence Neumann -- Chief Financial Officer\n\nYeah. So as you said, it's -- we're kind of maintaining the guidance that we had. We think the $17 billion is about the right ZIP code, plus or minus, to spend as we're -- based on our current revenue trajectory. As Ted said, as we hope and expect to reaccelerate revenue, we'll revisit those spend levels.\n\nBut for now, given all of those learnings that Ted mentioned, we think we can deliver more member value per dollar of content spend than we have in the past. So, we expect our content slate to get better and better each quarter and each year over the next couple of years. And the way that then translates to cash flow for this year, we're maintaining our roughly $1 billion of free cash flow guide, plus or minus a couple of hundred million. There's always movement at the end of the year for timing and then next year for that free cash flow to substantially improve beyond that.\n\nSo, we expect it to be materially above the roughly $1 billion this year. We won't put a specific guide out now, but it will be significantly larger.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK, great.\n\nSpencer Wang\n\nDoug, we have time for about two last questions, please.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Reed, so you talked about -- according to Nielsen, right, streaming time now surpasses both broadcast and cable. And, of course, Netflix has played a major role here in driving that transition. What is this next period of streaming look like, in your view, clearly more competitive, more ad supported, but how else do you think it evolves?\n\nReed Hastings -- Co-Chief Executive Officer\n\nThat's a great question, Doug. I mean, clearly, us and Disney are investing heavily and will be two big brands in the premium space. YouTube is very strong on connected TVs, so they will continue to grow. I think depending on how \"SUNDAY TICKET\" lands at some -- Apple, Amazon, somewhere else, you'll start to see a bunch of people focus on sports and bringing that over to on-demand.\n\nAnd then think of how mobile telephony just slowly replaced fixed-line telephony. And that was even before smartphones, right, just on the convenience. And you're just going to see it grow every year for many years ahead and makes TV a lot more convenient, more enjoyable. And a smart TV now costs less than a mobile phone.\n\nIt doesn't have a battery. It's got a smaller processor. It's easier to manufacture. So, you know, smart TVs are getting ubiquitous and lower cost.\n\nThere was the supply chain slowdowns. But generally, I think you'll see around the world, smart TV is continuing to get to every home in the world that has a TV. So that's all very positive vector. So again, think of it on basically pretty steady every year climbing share.\n\nAnd then you know a lot of us battling it out for do we have the best content in the world, do we have the best suggestions in the world, the lowest prices, all the classic competitive dynamics. So, we're pretty excited about this next phase, which is competitive excellence. And it's straight-ahead execution. If we can just be better than everybody else, and we're pretty driven at that.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. So, to close out, I'm not going to ask you about 4Q content, but I'd like to ask each of you the single most important thing for you and your teams to accomplish in your respective roles over the next 12 to 24 months. And I'll leave it to you guys to -- for whatever order you'd like.\n\nReed Hastings -- Co-Chief Executive Officer\n\nI'll go first. I mean, for me, it's the overall direction of what we're doing and that there's kind of clear context for everyone that if we execute down this particular path well, then we're going to win. So, that's very exciting, and we're on target for that.\n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nAnd Doug, we have to continue to deliver enormous quality and scale. The volume of releasing that we're doing, it's not that we're putting out so much content, just dumping the content into the world, we're trying to super serve hundreds of millions of people with individual tastes and individual relationships with content. And to do that at scale, something that's never been done before, and we continue to kind of sharpen the tools to deliver on that every -- not just for the next 12, 24 months, but for the foreseeable future. And -- but I think this time right now is just as important as it ever has been.\n\nSpencer Wang\n\nDoug, for me, I'll have two suggestions. So one is, as you've heard us say, we want to build a really big but also a very profitable business. So, in our role in the corporate strategy and planning, we want to help the company build and refine the muscle around big profits over time. And then secondly, we've been doing more M&A over the last year or so.\n\nSo, again, just getting better and better at that in terms of integration and making sure those deals live up to the expectation.\n\nSpence Neumann -- Chief Financial Officer\n\nYeah. And I'll -- I can just add to Spencer's point, we're really in kind of that support role and in finance and operations across the company, so helping to really scale and mature the combination of creative excellence and operational excellence in our support roles and support our ability to become a truly an increasingly global company around the world with increasing kind of financial discipline to get more and more of that dollar of spend on to the screen for the enjoyment of our members.\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nAnd, Doug, I'll cheat and give you two. I mean, tactically, we are sprinting at ads and it's been super fun to see teams engaged and doing incredible work to make that happen in such a short time. But behind the scenes, we're doing amazing stuff on improving the -- what we call the choosing experience, which is the content discovery and recommendations, and all the things that essentially I think takes all the work that Ted's teams do and tries to magnify the value of that for the users we have around the world. And sometimes those things are subtle because they sort of happen behind the covers, if you will.\n\nBut every quarter that we see improvements there, I know we're doing a good job for our members around the world.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Great.\n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nThanks, Doug. And since you didn't ask, I'm going to take another couple of seconds to tell you about Q4 anyway.\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nOK. Go for it.\n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\n\"The Watcher\" is already turning out to be enormous. We have returning season of \"The Crown,\" \"Emily in Paris,\" \"Manifest,\" \"Dead to Me,\" \"Firefly Lane,\" \"Ginny and Georgia,\" an origin story from the \"World of Witcher.\" We have an incredible new action series starring Noah Centineo called \"The Recruit.\" We have Tim Burton's television directorial debut with \"Wednesday.\" We have a new series from Guillermo Del Toro called \"Cabinet of Curiosities.\" And from around the world are some of our most successful shows like \"Alice in Borderland\" and \"Barbarians\" and \"Halita\" are back for new seasons two, all of just in Q4. So, let me say, first and foremost, we have a lot of work to do to continue to reaccelerate revenue. We're really happy with our levels of engagement, the number of hit series and films that we're able to put to our members at prices that they think are a phenomenal value in these strained economic times, and we're growing even in those strained economic times and with the extraordinary levels of competition out there for streaming dollars and for hours of viewing.\n\nWe stood up an ad product in six months with this -- and with the tremendous demand on that product and with a great partnership with Microsoft and with Greg Peters and his phenomenal team that runs that effort, our basic with ads tier is going to help us open up Netflix to a whole new audience of folks who are attracted to all that great content at an even lower price point. In Q4, we look forward to bringing this incredible slate to everybody and as we continue to grow in this world of film and television games, which we believe that the future of television of films and the games is streaming. And we're working hard to continue to grow our lead in this area, while we continue to bring healthy returns. And we can only do that by bringing the shows, the films, and games that people love.\n\nSo, wait till you see \"Glass Onion: A Knives Out Mystery,\" and wait till you see the new season of \"The Crown,\" and you'll know just what I'm talking about. Thanks, Doug.\n\nDuration: 0 minutes\n\nSpencer Wang\n\nDoug Anmuth -- JPMorgan Chase and Company -- Analyst\n\nGreg Peters -- Chief Operating Officer and Chief Product Officer\n\nSpence Neumann -- Chief Financial Officer\n\nTed Sarandos -- Co-Chief Executive Officer and Chief Content Officer\n\nReed Hastings -- Co-Chief Executive Officer\n\nMore NFLX analysis\n\nAll earnings call transcripts"
}