{
  "companyName": "Geospace Technologies",
  "companyTicker": "GEOS",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/10/geospace-technologies-geos-q3-2022-earnings-call-t/",
  "content": "Geospace Technologies (GEOS 2.93%)\nQ3 2022 Earnings Call\nAug 10, 2022, 10:00 a.m. ET\n\nOperator\n\nWelcome to the Geospace Technologies third quarter 2022 earnings conference call. Hosting the call today from Geospace is Mr. Rick Wheeler, president and chief executive officer. He is joined by Robert Curda, the company's chief financial officer, and Mark Tinker, CEO of Geospace subsidiary, Quantum Technology Sciences.\n\nToday's call is being recorded and will be available on the Geospace Technologies investor relations website following the call. [Operator instructions] It is now my pleasure to turn the floor over to Rick Wheeler. Sir, you may begin.\n\nRick Wheeler -- President and Chief Executive Officer\n\nAll right. Thank you. Good morning, and welcome to Geospace Technologies conference call for the third quarter of fiscal year 2022. As mentioned, I'm Rick Wheeler, the company's president and chief executive officer, and I'm joined by Robert Curda, the company's chief financial officer.\n\nAnd also with us this morning is Dr. Mark Tinker, CEO of our subsidiary, Quantum Technology Sciences. I'll initially provide an overview of the third quarter, which Robert will follow up with in-depth commentary on our financial performance. After that, we'll open the line for questions, then we'll try to answer.\n\nSome of today's statements may be forward-looking as defined in the Private Securities Litigation Reform Act of 1995. This includes comments about markets revenue recognition, planned operations and capital expenditures. Such statements are based on our present awareness, while actual outcomes are affected by factors and uncertainties, we cannot predict or control. Both known and unknown risks can lead to performance and results that differ from what we say or imply today, these risks and uncertainties include those discussed in our SEC Form 10-K and 10-Q filings.\n\nFor convenience, we will link a recording of this call on the investor relations page of our geospace.com website. And I very much encourage everyone to browse the site to learn more about Geospace and its products. Note that the information we record this morning is time sensitive and may not be accurate at the time one listens to the replay. Yesterday, after the market closed, we released our financial results for the third quarter of fiscal year 2022, which ended June 30, 2022.\n\nAlthough the three and six-month periods that ended on that date, experienced decreases in oil and gas segment revenue from earlier periods, we are nonetheless pleased that demand for our OBX ocean bottom marine recording nodes continue to climb. As such, this led to the highest quarterly figure for rental revenue so far this fiscal year. Evidence of this growing OBX demand was earlier demonstrated in our two recent news announcements of signed OBX rental contracts, valued separately at $4 million and $12 million, respectively. Moreover, the base value of OBX rental contracts signed so far in fiscal year 2022 now exceeds $24 million compared to just $8.2 million in fiscal year 2021.\n\nThe discussions and quoting activities currently underway with our valued customers gives us increased confidence that demand for the OBX will remain strong. Another important highlight of the quarter is the strong performance of our Adjacent Markets segment. Quarterly revenue from this collection of products reached an all-time high in the third quarter, setting a new company record for this segment. Contributing to this revenue growth is increasing demand for our U.S.\n\nmanufactured water meter cables and connectors, driven by greater domestic infrastructure spending on smart city projects. Our presence in this market is poised to penetrate even deeper with the rollout to customers of our Aquana smart water valves and cloud control software, which is expected to occur before the end of the fiscal year. Other factors contributing to solid third quarter Adjacent Markets revenues include our Exile electronic pre-press printing solutions. These computer-to-screen printers bring added automation and time savings to the graphic arts screen printing industry, helping these customers to reduce labor and increase efficiency.\n\nIn addition, our specialty contract manufacturing business is also seeing positive results, as more and more customers want to increase the domestic content and control of their product manufacturing. With that, now I'll turn the call over to Robert to provide more financial details on the third quarter.\n\nRobert Curda -- Chief Financial Officer\n\nThanks, Rick. Good morning. Before I begin, I'd like to remind everyone that we will not provide any specific revenue or earnings guidance during our call this morning. In yesterday's press release for our third quarter ended June 30, 2022, we reported revenue of $20.7 million compared to last year's revenue of $23.1 million.\n\nThe net loss for the quarter was $6.6 million or $0.51 per diluted share compared to last year's net loss of $800,000 or $0.06 per diluted share. For the nine months ended June 30, 2022, we reported revenue of $63.4 million compared to revenue of $75.4 million last year. Our net loss for the nine-month period was $14.8 million or $1.14 per diluted share compared to last year's net loss of $9 million or $0.67 per diluted share. Our Adjacent Markets segment revenue is as follows: our industrial product revenue for the third quarter of fiscal year 2022 was $7.5 million, an increase of 16% over the third quarter of 2021.\n\nIndustrial products nine-month revenue for fiscal year 2022 is $18.5 million, an increase over the same period in 2021 of 17%. Both periods revenue increases are due to higher sales of our water meter cable and connector products, industrial sensor products and contract manufacturing services. Imaging product revenue for the third quarter was $3.5 million, an increase of 19% compared to last year's revenue of $2.9 million. The nine-month revenue for imaging products for fiscal year 2022 is $9.8 million, a 23% increase when compared to the same period in 2021.\n\nThe increase in revenue for both periods is due to higher demand for our thermal imaging equipment and consumable film products. Now our oil and gas market segment revenue. The oil and gas market segment produced revenue of $9.5 million for the three months ended June 30, 2022. This compares with revenue of $12.6 million for the same period of the prior fiscal year, a decrease of 26%.\n\nFor the nine-month period ended June 30, 2022, the segment contributed revenue of $34.3 million versus $41.5 million, a decrease of 17%. The decrease in revenue for the three-month and nine-month periods are due to lower demand for our land wireless equipment and marine wireless equipment. Fiscal year 2021 revenue included $12.5 million from a sale of GCL land wireless equipment delivered to a customer in fiscal year 2020. The decrease in revenue was partially offset by higher rental revenue due to increased utilization of the company's OBX rental fleet.\n\nFinally, revenue from our Emerging Markets segment for the third quarter was $135,000 compared to $1.1 million for the same period in 2021. The nine-month revenue for the segment for fiscal year 2022 was $571,000 compared to $10 million for the same prior year period. Our third quarter of fiscal year 2022 operating expenses increased by $2.1 million, a 21 -- excuse me, 26% compared to the third quarter of 2021. The increased operating expenses for the three months period was due to increases in personnel costs, incremental operating costs associated with our recent acquisition of Aquana, increased sales, marketing and other general expenses and a decrease in a favorable non-cash adjustment to the contingent consideration related to our Quantum and OptoSeis acquisitions.\n\nThe nine-month operating expenses increased by $2 million or 8% when compared with the same prior year period. An increase in operating expenses for the nine-month period is due to higher engineering project costs, increased personnel costs, incremental operating costs associated with recent acquisition of Aquana and increased sales, marketing and other general expenses. The increase was partially offset by an increase in a favorable non-cash adjustment to the contingent consideration related to our Aquana and OptoSeis acquisitions. Our nine-month cash investment into our rental fleet is $4.1 million and cash investments into our property, plant and equipment is $900,000.\n\nOur balance sheet at the end of the third quarter reflected $9.1 million cash in short terms and investments, and we have $8.5 million of additional liquidity from our credit facility. In addition, we own numerous real estate holdings in Houston and around the world that are owned free and clear without any leverage. That completes my discussion, and I'll turn the call back to Rick.\n\nRick Wheeler -- President and Chief Executive Officer\n\nThank you, Robert. The past two years have been plagued by COVID-19, supply chain issues and geopolitical turmoil. And there are many derivative challenges stemming from these issues that remain. However, we are encouraged by the improved market conditions we are experiencing in both our Oil and Gas and Adjacent Markets segments.\n\nThe continued improvements in each of these divisions should lead to better performance in future quarters, as well as overall improved liquidity. In addition, our ongoing discussions with potential clients for future permanent reservoir monitoring, or PRM systems, continue to be very productive. In fact, in coordination with the potential client, we recently concluded a very successful demonstration of our OptoSeis fiber optic PRM technology in real-world field conditions. In closing, I'd like to thank all of our hard working employees, valued clients and trusted shareholders for their continued support.\n\nSo this concludes our prepared commentary, and I'll now turn the call back over to Chelsea for any questions from our listeners.\n\nOperator\n\nThank you, sir. [Operator instructions] And our first question will come from Scott Bundy with Moors & Cabot.\n\nScott Bundy -- Moors and Cabot\n\nGood morning, guys. So there's no question your industry has been in a depression for eight years. Recently, both Schlumberger and Transocean believe that the upcoming cycle will outpace the 2016, 2019 cycle of investment and FID activity. So Rick, when you think about where we are versus the trough of prior cycles, where do you think we are?\n\nRick Wheeler -- President and Chief Executive Officer\n\nWell, some of the examples you just mentioned are definitely earlier signs of things. The seismic instrumentation side of the business always lags a bit from these improvements. But you're absolutely right. We too are following those aspects of their business and how they're improving.\n\nWe're seeing that, in fact, and sort of a people or situation as this demand is increasing and contracts being signed for use of our OBX equipment. So it certainly has every indication that things are moving in the right direction and improving from what would have been considered a trough.\n\nScott Bundy -- Moors and Cabot\n\nOK. And this prior -- this recent real-life test using a PRM -- using the PRM system, is this a prior customer or new customer?\n\nRick Wheeler -- President and Chief Executive Officer\n\nWell, this is a customer we have not sold a system to in the past. So I guess in that sense, it's a new customer. We have certainly been in discussions with them going over the technology for some time, and they are definitely one of the more interested parties.\n\nScott Bundy -- Moors and Cabot\n\nOK. Great. Thanks, guys.\n\nOperator\n\nThank you. Our next question comes from Bill Dezellem with Tieton Capital.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nGreat. Thank you. Following up on that last question. Would you explain when you talk about a trial, it's been so long since you've won PRM business.\n\nI'm not sure that I understand really what a real-world trial would be or if you have actually done that for prior customers in the past?\n\nRick Wheeler -- President and Chief Executive Officer\n\nWe've always done that in some sense with prior customers, both for fiber optic and electrical type systems. Certainly, both of those systems are in actual full exploitation of use by various customers. This particular customer has not had a PRM system in the same respect. To that end, when I say real-world conditions, I mean exactly that.\n\nI mean, a complete deployment efforts with respect to how the equipment is laid into the water, examination of the data as it's coming back in real time and processing of data, which is still being examined even today. So in saying a real-world circumstance, what I'm really getting to there is, it's not just on a lab bench or laid out somewhere, it's actually deployed and executed operation.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nIs that deployed and executed on a field that they are evaluating?\n\nRick Wheeler -- President and Chief Executive Officer\n\nNo. This was a test setup that we had access to in conjunction with them. It was not performed on the field of interests that are being examined for the PRM system. But all the circumstances with respect to what one's interested in and how these sorts of systems coupled to the earth, underwater, how they're deployed, that sort of thing.\n\nAnd then examining that data in a real-time fashion as it's coming back and recorded. That was all accomplished.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nThat's helpful, Rick. And then earlier this fiscal year, you did have a PRM tender that you all chose not to participate in. And I was curious, did that prospective customer ultimately award that? Or did others also choose not to participate? Where does that PRM stand?\n\nRick Wheeler -- President and Chief Executive Officer\n\nI actually don't have a factual knowledge, but we have not heard of any award that was provided for that particular tender. We don't anticipate that others did not provide an offer, but we don't know, not really having pretty information there.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nAnd has that customer come back to you with questions and...\n\nRick Wheeler -- President and Chief Executive Officer\n\nWell, we are still in discussion with that customer for sure. But I mean, the tender is over. And so there aren't any really directly related questions as it would typically apply in that process. But certainly, we still have active conversations with that customer, but they're not ones that they're going to reveal to us what -- if there were a competitor involved in the prior attempt, that's not part of what would be the conversation there.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nUnderstood. And then lastly, changing subjects entirely. Mark, when you look out at the various opportunities that Quantum has, what would you characterize as the most likely near-term opportunity for Quantum?\n\nRick Wheeler -- President and Chief Executive Officer\n\nWell, Mark was on the line earlier, Bill. So I'm not sure -- it sounds like he's been disconnected for some reason.\n\nOperator\n\nI'm showing he is connected. He may be muted. Mr. Tinker, are you muted by chance?\n\nRick Wheeler -- President and Chief Executive Officer\n\nWell, in answer to your question, Bill, from a near-term point of view, there are several opportunities as it relates to the SEDAR system deployment. Certainly, the highest opportunities there of near term would be with the government. There are a couple of particular use cases that has not yet been deployed in, but there are active discussions now going on about such a deployment, not necessarily border related in this particular case. There are some other opportunities where the analytics package, not particularly as it relates to SEDAR, which is an architectural component of the way that the perimeter system and these other sensing systems that I'm talking about for government are put together.\n\nBut nonetheless, an analytics package, very similar that uses algorithms that's in the oil and gas side of things, and those discussions have been rather recent in their development.\n\nMark Tinker -- Chief Executive Officer, Quantum Technology Sciences\n\nHi, Rick.\n\nRick Wheeler -- President and Chief Executive Officer\n\nOh, there you go.\n\nMark Tinker -- Chief Executive Officer, Quantum Technology Sciences\n\nI'm sorry, Bill, and I'm sorry to all of our participants. We had two different numbers to dial-in and only one works for me, and I don't know if that was the glitch, but she just did an audio check with me. So Bill, I'll say what I said already. And again, my apologies to everyone on the call for that.\n\nOur strategy of now taking our SADAR line into both federal and energy is well underway. And in the federal space, we're very focused on those next adjacent agencies. So in addition to Department of Homeland Security, we're now across the spectrum of the Department of Defense. As everyone might imagine, we have a number of applications there.\n\nSo you asked the question of what might be or who might be the next specific customer. It spans a large set. So it's not a particular singular customer that we're responding to right now. So we are responding to a number of RFPs.\n\nWe're excited about that. It's good to be back in the queue. But they span from Navy, to the Office of Secretary of Defense, and other organizations. So things are moving along and I'm very pleased by that.\n\nOn the energy side, since I think you're aware as well, Bill, the effort that we've done up in Canada has led to not only publications, but now invited presentations and so we're having to socialize the power of using phased arrays for passive seismic monitoring across the energy space. And again, I'm very pleased with the traction there. Another paper we anticipate will be published soon. And for those who might not be aware, we're giving three presentations at the end of this month at the International Meeting for Applied Geoscience and Energy, which is the large industry meeting for our interest that incurs in Houston.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nThat is helpful. Thank you. And then I have -- I have read that BP is drilling a carbon sequestration well in Texas. Is that something that you all are involved with?\n\nMark Tinker -- Chief Executive Officer, Quantum Technology Sciences\n\nBack to back right now.\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nGreat. Thank you, both. All right.\n\nOperator\n\n[Operator instructions] Our next question will come from Michael Cox, private investor.\n\nUnknown speaker\n\nHey, guys. So just a couple of questions. And I recognize that there's like a lot of momentum on the OBX side which is wonderful. Good to hear.\n\nBut I want to just focus for a second on the most recent quarter and sort of just specifics on the financial situation. You talked about the increase in operating expenses. And maybe you could just unpack that a little bit to understand why? Obviously, in terms of matching, we had a pretty significant decrease in overall revenues, pretty significant deterioration in the overall balance sheet quality in the quarter. And for the first time since I've been following you guys below $10 million of cash on the balance sheet.\n\nAnd so that's troubling. And so I'd just like to understand better -- what is exactly driving the operating expense increase quarter -- year-over-year? And to what extent that is containable as we move forward? And obviously, so many of these things are still TBD in terms of when the revenues show up.\n\nRobert Curda -- Chief Financial Officer\n\nYes. So many of those higher costs, employee-related costs, we have higher employee benefit-related costs like medical benefits and things of that nature, slightly higher salary expenses, primarily things related to increases we've incurred due to inflationary pressures with our employee base. Other than that, our general expenses, the increase has generally come from a higher level of activity, mostly because we're coming out of this COVID period where things like business, travel and conferences and trade shows and things of that nature could happen. We're also had, during this year, an increased level of engineering-related projects, part of it associated with this PRM test that we did for a customer.\n\nSo some of these particular like the engineering expense, project expense, I don't expect to continue to grow over time.\n\nRick Wheeler -- President and Chief Executive Officer\n\nI think too the fact if you're comparing to the third quarter of a year ago, we wouldn't have any bearing of costs for Aquana. So the recent acquisition we did of Aquana is a part of our diversification strategy, which is what is actually causing the Adjacent Markets to expand or it's providing other opportunities for it to span for sure. So there are efforts there and rolling out that new product, which has every expectation of generating revenue that increased opex in some of that endeavor. That included some R&D efforts.\n\nThere were supply chain issues that really everyone in the world is having to contend with, and that certainly impacted the rollout of that particular product where there were certain chips and ICs that just were not available. You couldn't get them in any kind of reasonable time frame. So our engineers actually were challenged to go and do some redesign on that to more available parts and they did that. So that is also an element that increase those expenses somewhat.\n\nLike Robert said, I don't think all of those are going to be recurring though.\n\nUnknown speaker\n\nOK. Well -- and I respect all that, I just -- we are approaching something much more alarming in terms of cash, right? I mean, it's great to have all that going on. But now you've got $9 million of cash. And so that -- are there efforts underway not only just not incurred the one timers, but really think about this environment, which continues to baffle about how do you pull that back down? I mean because the burn rates you've had for the first six months of calendar 2022 is not sustainable.\n\nSo how do you get that under control?\n\nRobert Curda -- Chief Financial Officer\n\nWe examined that every day. We're working through that constantly. One of the things that related to cash flow that we're seeing on the horizon is this uptick in our OBS rental activity, and we expect that to help us generate more cash and help us get into a better position from a liquidity point of view. We don't expect to continue to consume cash at the same rate we have been through the rest of this fiscal year.\n\nUnknown speaker\n\nOK. So the cost of this trial for the PRM system, which certainly is exciting and you bore 100% of that cost, that's not something you get reimbursed to provide?\n\nRick Wheeler -- President and Chief Executive Officer\n\nNo. We did not bear entire costs, but then again, we're not going reveal what the relationship is there. But certainly, some of these costs that were alluded to, as it relates to that are the construction of the prototype system, building of the cables, the sensors and putting all that together. That certainly was something that we took the responsibility for doing.\n\nUnknown speaker\n\nOK. OK. Well, it's exciting to be here. And obviously, PRM is a huge -- I mean it's important.\n\nSo I'm excited to hear that, that test took place. Do you have any update on what you think of their timing? This particular customer just over -- what horizon are they considering this project?\n\nRick Wheeler -- President and Chief Executive Officer\n\nYes. That's always the important question, Michael.\n\nUnknown speaker\n\nRight.\n\nRick Wheeler -- President and Chief Executive Officer\n\nThere's still an expectation that a tender could come out before the end of this calendar year. It would be toward the end of it, though, from the conversations that we're having. But that is a possibility. Other than that, you would be looking at that tender coming out in early 2023 calendar year.\n\nThe facts are that -- with these systems, there is a considerable amount of manufacturing time that's necessary. And these various customers each have high ambitions of getting these things, producing and these fields going by certain dates that they can't miss. I mean there's lots of money at stake from a revenue [Inaudible] in production. So that being said, I think that there's certainly an attempt on their part to try to accelerate as much as they can when a tender would be out because they know there's a lead time to getting all this stuff in place.\n\nUnknown speaker\n\nGood. Good. Well, that's exciting. That's really wonderful.\n\nThis was a -- and maybe I'm just missing it, but it is like one of the first times in a while that a press release hasn't talked about Quantum and the opening comments didn't really talk about Quantum so much. But your comments about where you are in terms of your own sort of bidding a project side, much more encouraging. I mean, last time we talked one-on-one, you were saying that you sort of agreed that this was a big year for Quantum to sort of prove its market viability and the other new verticals. Just maybe could you update a little bit on the timing of real revenues on the sort of next wave after the border project of getting -- developing something that has a significant impact on the financials of the company or at least a meaningful one?\n\nRobert Curda -- Chief Financial Officer\n\nYes. I won't comment in an absolute sense in the timing, but I will say that pursuing into two major markets of energy and federal with the same product line, that's key to our strategy. Controls costs, common messaging, the difference is the sources of energy that we're monitoring. And that strategy is working.\n\nIt's allowed us to remain focused. It's allowed us to test the market and through these talks on the energy side, get constructive feedback and enthusiasm for the potential that we bring for the carbon markets, as well as talking to those who need passive seismic monitoring for other applications, whether it's something like geothermal or hydraulic fracturing. So there appears to be some market attachment there that SADAR may be able to fill the niche for because of its unique value that it offers. It's not a traditional monitoring system.\n\nAnd those conversations again are going well. It doesn't mean we're going to [Inaudible] yet, but they're going very well. On the federal side, where we come from for over 20 years, I had a high degree of confidence there, and that confidence is very much sustaining right now. So the momentum into the federal space is occurring.\n\nBut again, it's the federal space. It's not much different than energy when you're dealing with a massive organization like the United States government, but two, has volatility every two years with an election. The budgets continue to flow, requirements remain the same, and we've been aware of those and have targeted certain agencies, and those conversations are proving to be very fruitful right now.\n\nUnknown speaker\n\nGot it. I recognize your reluctance to comment on the timing side, but sort of again, thinking about calendar '22, do you think at least on the federal side, where your degree of confidence is high that there is potentially an announcement of some meaningful thing coming before Christmas this year? Or are we looking at 2023 before there's something that is material that we could point to?\n\nRobert Curda -- Chief Financial Officer\n\nI have too much experience working with the government to make any promises right now. We can have an end user who says, \"This is great, let's get it done.\" And then all the challenge always the contract, and what that contract be able to provide. So being able to have some error bars on the magnitude of a quarter here or a quarter there, gets a little too uncomfortable for me to make a promise by the end of this calendar year.\n\nUnknown speaker\n\nGot it. Any -- and so you said it's pretty similar in some respects working with the energy side of it, is that timeframe then sort of apply for them as well?\n\nRobert Curda -- Chief Financial Officer\n\nAnything on energy, I think, is -- that is much more of a -- we're unseating the status quo. I think that's an important thing for everybody to realize. Anytime you unseat the status quo, you got to take your lumps if people start to realize, wow, this is effective. And so to beat that horse again, what we're doing in Canada in publishing these papers and giving these presentations to show its effectiveness for a reduced footprint of sensors for real-time monitoring and better results.\n\nWhen we think about trying to monitor like gigaton of carbon that is a big field. That's something the size of Houston. How are you going to do that? Additional methods will not be economically viable. So we're getting that message out there and then looking to do something similar to what we just did on the PRM side, we just start to prove it out with these studies from an industry standpoint past where we are in Canada.\n\nUnknown speaker\n\nGot it. OK. One more question and then I'll sit up. This most recent quarter, it was sort of interesting and again, relative to past patterns.\n\nBut on a gross profit side, on products, just looking quarter-over-quarter in particular, just as an example, basically, the same cost of revenue on a, call it, 70% the revenues. Is there a reason why -- I mean is this a product mix issue, etc.? Just what's going on, why basically you sold all your products since last quarter almost for no gross profit?\n\nRobert Curda -- Chief Financial Officer\n\nCertainly, product mix has an effect on that. But I think the bigger reason for the phenomenon you're noticing is because we have excess manufacturing capacity here in our factory in Houston that's predominantly focused on the effort of manufacturing oil and gas-related products. And when we don't have activity to absorb those fixed manufacturing costs then they flow straight through to the income statement, right? I don't get into manufacturing equipment go into our inventory.\n\nUnknown speaker\n\nGot it. So this is maybe a little bit more of a fixed amortization and depreciation side of that speaking through then the actual products themselves in terms of their cash cost?\n\nRobert Curda -- Chief Financial Officer\n\nYes.\n\nUnknown speaker\n\nGot it. OK. Thank you, guys. Appreciate it.\n\nRobert Curda -- Chief Financial Officer\n\nYou bet. Thanks, Michael.\n\nOperator\n\nThank you. Our next question will come from Michael Melby with Gate City Capital.\n\nMichael Melby -- Gate City Capital -- Analyst\n\nThanks. Thanks, gentlemen. I was hoping you could provide your comments on the TGS Magseis Fairfield deal that was announced. It looks like it was over $230 million and involves one of your customers and then your largest OBX competitor.\n\nAny thoughts on the price paid or the competitive impact it might have on you would be appreciated?\n\nRick Wheeler -- President and Chief Executive Officer\n\nNo. Mike, I really don't know what went into coming up with that number. There's certainly some assets involved with that because there's vessels and things of that nature that go into that number. But value of those things are something I don't have any information about.\n\nWith respect to the actual acquisition itself, I mean, I completely understand why TGS would pursue that. A lot of this has to do with the very thing we're reporting, which is the increased activity in this ocean bottom survey actions that are taking place here. TGS is a premier seismic library house, is certainly going to want to, in a domain of type capacity with respect to the contractors and equipment available, going to want to try to maximize their share of that as it were. There is enough work out there going on to where the Magseis themselves is just a piece of the entire industry action that's taking place.\n\nOur customers certainly still have plenty of work to do and a lot of the tenders coming up. That is a very much escalating activity and changes on a regular basis, somewhat represented by the fact that the amount of signed contracts that we have now compared to last year has gotten to the number that it has. I think in many respects, the supply limitation of this type of equipment, of which we're a big piece of the market share out there, is definitely going to be beneficial to us. There's going to be plenty of work with these contractors.\n\nThere's even new contractors coming out in this acquisition area.\n\nMichael Melby -- Gate City Capital -- Analyst\n\nGot it. And maybe to the prior caller's question, the environment has certainly gone a lot better, but thus far, it has not led to dramatic improvements or improvements in your profitability or free cash flow. And maybe it's not the first focus of the Board or the management team right now in terms of getting to that level. But I was hoping you could, without providing guidance, provide a path to how you see the improving environment translating into the company being free cash flow positive and profitable with the asset base you have?\n\nRick Wheeler -- President and Chief Executive Officer\n\nWell, we think that in many respects, we're doing that now. I mean, certainly, to the extent that we're ramping up in this business side, there's always going to be cost concerns that we will address and size ourself appropriately. But in this particular case, as the market is increasing and with respect to demand for our products, we think that's going to be a big component of it. Certainly, PRM opportunities out there would be major events for our company and the organization.\n\nSo we can't let those go by the wayside either in our attempts to sort of size ourselves appropriately for what's coming. Looking at the forecasts and discussions with our customers is a major part of how we go about making those decisions.\n\nMichael Melby -- Gate City Capital -- Analyst\n\nYes. I guess the additional color. The environment has gotten better, but kind of the path that you see forward to being free cash flow positive as -- and the current environment is a path that I think if you can provide more information on getting the endpoint and the revenue number needed to cover the current expenses.\n\nRick Wheeler -- President and Chief Executive Officer\n\nYes. A lot of that depends on the product mix as it were, and the services performed. But certainly, within the Adjacent Markets, those things are progressing well. The Oil and Gas side has been the one that has been the most affected by these recent depressions that particularly got exacerbated throughout COVID.\n\nI think fundamentally, it's just -- it's an adaptation to what's going on, and there will be cost reductions that we have to consider and go through as we adapt the -- our capabilities for what we see coming.\n\nMichael Melby -- Gate City Capital -- Analyst\n\nYes, yes. And from the outside, it appears that kind of a strategy has been to cover your fixed cost by acquiring adjacent businesses. And just given the premium on the mix, so it's Fairfield deal that's proposed. It feels like it could be advantageous in this environment to have someone bigger that has the ability to cover all the fixed costs, utilize excess capacity and technology and things like that.\n\nIt look like that -- they were able to at least carve out in this deal and maybe something that could be beneficial for Geospace and shareholders if that opportunity present itself.\n\nRick Wheeler -- President and Chief Executive Officer\n\nYes. I think in this case, you need to examine that business a little more closely because what you are looking at is a service industry component there with respect to where those costs really lie, as it relates to TGS, which is not the same as in a manufacturing organization.\n\nMichael Melby -- Gate City Capital -- Analyst\n\nYes. I agree with that. It's just we're not fully utilized on capacity, and if someone else can utilize that capacity without...\n\nRick Wheeler -- President and Chief Executive Officer\n\nOh, you bet. And that's exactly the private contract manufacturing -- you're absolutely right, and that's why the contract manufacturing component has expanded in the way it has. And actually, we see growth in that activity, too. And to your point, it definitely provides better utilization of the capacity or manufacturing capacity.\n\nMichael Melby -- Gate City Capital -- Analyst\n\nYes. Understood. It just feels like that business is going to have to grow a whole lot to utilize our capacity and then pulling back our profitability at the current time.\n\nRick Wheeler -- President and Chief Executive Officer\n\nRight. No, it definitely needs to grow and the two need to meet in the middle.\n\nMichael Melby -- Gate City Capital -- Analyst\n\nGot it. Thanks.\n\nOperator\n\nThank you. Our next question will come from Scott Bundy with Moors & Cabot.\n\nScott Bundy -- Moors and Cabot\n\nTwo other quick questions. Am I correct that you have spent or are going to spend roughly $4 million on additional OBX equipment?\n\nRobert Curda -- Chief Financial Officer\n\nWe have spent this year $4 million on additional OBX equipment, primarily in deepwater models.\n\nScott Bundy -- Moors and Cabot\n\nAnd then lastly, Rick, if -- just to provide some sort of guidelines. With the current potential PRM customers, dollar revenue be in the same range that we've seen in the past, and I'm going to throw out $30 million to $100 million, is that sort of the range that we're talking about?\n\nRick Wheeler -- President and Chief Executive Officer\n\nYes. That's definitely a good window of what we see these opportunities to represent.\n\nScott Bundy -- Moors and Cabot\n\nThanks a lot, guys.\n\nOperator\n\n[Operator instructions] All right. We have no further questions at this time. So I would like to turn the floor back over to Mr. Rick Wheeler for any additional or closing remarks.\n\nRick Wheeler -- President and Chief Executive Officer\n\nAll right. Well, thank you, Chelsea, and thanks to everybody who joined us here for the call today. We look forward to speaking to you again at our next conference call for the fourth quarter of fiscal year '22 -- 2022, which will occur in November. So thanks again, and goodbye.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRick Wheeler -- President and Chief Executive Officer\n\nRobert Curda -- Chief Financial Officer\n\nScott Bundy -- Moors and Cabot\n\nBill Dezellem -- Tieton Capital -- Analyst\n\nMark Tinker -- Chief Executive Officer, Quantum Technology Sciences\n\nUnknown speaker\n\nMichael Melby -- Gate City Capital -- Analyst\n\nMore GEOS analysis\n\nAll earnings call transcripts"
}