{
  "companyName": "ZipRecruiter, Inc.",
  "companyTicker": "ZIP",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/15/ziprecruiter-inc-zip-q2-2022-earnings-call-transcr/",
  "content": "ZipRecruiter, Inc. (ZIP 0.30%)\nQ2 2022 Earnings Call\nAug 15, 2022, 5:00 p.m. ET\n\nOperator\n\nGood day, and welcome to the ZipRecruiter, Inc. second quarter 2022 earnings call. Today's call is being recorded. [Operator Instructions] I would now like to turn the conference over to Amy Garefis, chief accounting officer.\n\nPlease go ahead.\n\nAmy Garefis -- Chief Accounting Officer\n\nThank you, operator, and good afternoon. Thank you for joining us in our earnings conference call, during which we will discuss ZipRecruiter's performance for the quarter ended June 30, 2022, and guidance for the third quarter and full year 2022. Joining me on the call today are Ian Siegel, co-founder and CEO, David Travers, president, and Tim Yarbrough, CFO. Before we begin, please be reminded that forward-looking statements made today are subject to risks and uncertainties relating to future events and/or the future financial performance of ZipRecruiter.\n\nActual results could differ materially from those anticipated in these forward-looking statements. A discussion of some of the risk factors that could cause actual results to differ materially from any forward-looking statements can be found in ZipRecruiter's quarterly report on Form 10-Q for the three months ended June 30, 2022, which is available on our investor website and the SEC's website. The forward-looking statements in this conference call are based on the current expectations as of today, and ZipRecruiter assumes no obligation to update or revise them, whether as a result of new developments or otherwise. In addition, during today's call, we will discuss non-GAAP financial measures.\n\nThese non-GAAP financial measures should be considered in addition to, not as a substitute for or in isolation from, GAAP results. Reconciliations of the non-GAAP metrics to the nearest GAAP metrics are included in ZipRecruiter's shareholder letter and in our Form 10-Q. And now I will turn the call over to Ian.\n\nIan Siegel -- Co-Founder and Chief Executive Officer\n\nThank you, Amy, and good afternoon to everyone joining us today. Q2 2022 was another exceptionally strong quarter for ZipRecruiter. We generated a record $240 million in revenue, up 31% over the second quarter of 2021. We posted adjusted EBITDA of $45 million or an adjusted EBITDA margin of 19%.\n\nThese results are once again above the guidance provided for both revenue and adjusted EBITDA and demonstrate strong profitability even as we continue to make significant investments in our marketplace. In a few minutes, Dave will detail the progress we've made against our strategic growth pillars. Later, Tim will walk you through our results for Q2, as well as guidance for Q3 and the full year of 2022. First, I'd like to provide an update on the macroeconomic environment we are currently experiencing.\n\nThe U.S. labor market added over 350,000 jobs each month in Q2, continuing its record-setting pace. These jobs were broad-based across multiple industries. The labor market also remained tight, with approximately one unemployed person for every two job openings in Q2 '22.\n\nHowever, in spite of the strength of the quarter as a whole and the shortage of talent for currently open job postings, we began to see employers pulling back on job postings during the final weeks of June. We see our marketplace as a leading indicator for job activity, and as has now been widely reported, U.S. job openings fell by over 5% to 10.7 million in June of 2022. As we see signs of a cooling hiring environment, we are revising our 2022 revenue guidance to $890 million at the midpoint.\n\nA strategic advantage we enjoy is the ability to quickly respond to a changing operating environment. We are raising full year adjusted EBITDA guidance to $170 million at the midpoint. This represents an adjusted EBITDA margin of 19%, a 3 percentage point increase versus the annual guidance we provided in May and demonstrates the resiliency of our business and our commitment to profitable growth. We remain confident in our strategic priorities and focused on the long-term opportunity.\n\nWith over 4 million workers still quitting their jobs every month for the past 13 months, it's clear that job seekers are demanding more from where they work and need the right tools to help them find the right jobs. Employers, in turn, need the best technology to surface the right job seekers in the market. ZipRecruiter helps both sides of the marketplace achieve their goals. Before I turn the call over to Dave, I also want to mention the appointment of two new additions to our board of directors, Yvonne Hao and Emily McEvilly.\n\nYvonne is co-founder and advisor to Cove Hill Partners, a private equity firm, which focuses on building market-leading consumer and technology companies. She also held the roles of COO and CFO at PillPack. During which time, she helped lead PillPack's successful sale to Amazon. Emily McEvilly currently serves as the chief customer officer at OneTrust, LLC.\n\nPrior to that, Emily spent many years as the chief customer officer at Workday, Inc., one of the premier human capital management software companies in the world. I'm excited about how these appointments will strengthen our company as we continue to build a category-defining marketplace that redefines how people find work. We also announced that Brian Lee and Emilie Choi have stepped down from the board after serving faithfully since 2015 and 2018, respectively. I'd like to personally thank Brian and Emilie for their valuable contributions to ZipRecruiter over the past several years.\n\nWe wish them well in their future endeavors. Now, I'll turn it over to our president, David Travers, to talk through some of the progress we've made against the three pillars of our marketplace strategy.\n\nDavid Travers -- President\n\nThank you, Ian, and good afternoon, everyone. ZipRecruiter's continued execution against our three strategic pillars keeps us well positioned to win. We made great progress in the second quarter, and I'm excited to share some highlights with you. We will start with our first strategic pillar, which is increasing the number of employers in our marketplace.\n\nZipRecruiter works for all employers, no matter their size or industry. In 2010, we started by focusing on helping small and medium-sized businesses hire the talent they need. Over time, we've continued to win and grow business among the larger enterprise employers. These employers traditionally use a separate applicant tracking system and prefer to pay for candidates on a performance basis.\n\nIn Q2, performance-based revenue grew 66% year over year. This represents 22% of total revenue compared to 17% in Q2 of '21. We continue to win with employers of all sizes, including the largest and most sophisticated enterprises. During the quarter, we made a number of improvements to one of our employers' favorite features, Invite to Apply.\n\nThis feature allows employers to identify strong fit job seekers and invite them to apply to their job. We introduced a number of onboarding and engagement improvements, which resulted in a 10% increase in the number of invitations sent and a 10% increase in responses. In Q2, employers sent more than 1 million invitations to apply. We believe this novel experience of employers going first is at the core of how ZipRecruiter is disrupting the traditional labor market.\n\nNow, I'll discuss our second pillar, increasing the number of job seekers in our marketplace. Over the last several quarters, we have been weaving our AI-enabled personal recruiter, Meet Phil, through specific parts of our job seekers' journeys. In Q2, we introduced the world to our first end-to-end job search experience, featuring Phil. Phil now walks job seekers through their entire job search journey.\n\nHe greets the job seeker at the start and provides a unique experience based on the job seeker's goals. Phil provides a curated list of Great Match jobs based on the job seeker's inputs, resume, feedback on or interaction with other jobs and even data from other job seekers with similar goals and backgrounds. Phil now also gives job seekers useful data such as market salary ranges and the number of job opportunities in their area to encourage them on their journey, providing a more personal experience during an otherwise daunting process. Since our founding, we focused our marketing efforts on attracting employers into our marketplace.\n\nWith hundreds of millions of dollars invested, we enjoy over 80% aided brand recognition among U.S. employers. In 2021, we began applying this disciplined marketing approach toward adding job seekers to our marketplace. As with employers, we market across multiple channels with multiple media assets.\n\nWe are early in our journey but are excited by what we see already. Aided brand awareness among U.S. job seekers is now over 70%, an all-time high for ZipRecruiter. I'll conclude with our progress around our third pillar, making our matching technology smarter over time.\n\nOur matching algorithms are constantly learning and improving from the actions taken by employers and job seekers over time. Put simply, the longer an employer uses ZipRecruiter, the better our matching algorithms work. In fact, during Q2, the average paid employer who joined over a year ago received four times more great matches than those joining within the past year. Superior matching means surfacing the right jobs to the right job seekers.\n\nWe do this in many ways, including through email and in-app notifications. In Q2, we introduced an algorithmic improvement, which can better predict the job seeker's interest in a given job. With this algorithm now powering our email alerts, our job seekers enjoy a more individually curated set of results. This resulted in a 6% increase in engagement while significantly streamlining the presentation of job ads to the job seeker.\n\nThe progress we made in Q2 gives us greater confidence in our ability to execute going forward. We look forward to reporting future successes over the course of 2022 and beyond. Now, I'll turn it over to our chief financial officer, Tim Yarbrough, to talk through the second quarter results, as well as updated guidance for the third quarter and full year for 2022. Tim?\n\nTim Yarbrough -- Chief Financial Officer\n\nThank you, Dave, and good afternoon, everyone. Our second quarter revenue of $239.9 million represented another record quarter, exceeding the high end of the guidance we provided in May. This represents 31% growth year over year, and a 6% growth over the first quarter of 2022. Paid employers were 157,000, representing a 7% decrease versus Q2 '21 and a 4% increase versus Q1 '22.\n\nThe year-over-year decrease reflects heightened hiring demand last year as employers. And particularly, small and medium-sized employers rushed to keep pace with the reopening of the American economy. The sequential increase from Q1 to Q2 is consistent with what we've seen during pre-COVID years. Revenue per paid employer was $1,533, another record for ZipRecruiter.\n\nThis is a 42% increase versus Q2 '21 and a 1% increase sequentially. Employers' willingness to pay continued to grow in Q2 '22 as demand for talent remained high, and the ZipRecruiter product continues to improve, offering more value for employers of all sizes. GAAP net income was $13.1 million in the second quarter of 2022 compared to net income of $8.4 million in Q1 of the current year. Q2 '22 adjusted EBITDA was $45.4 million, equating to a margin of 19% compared to $37.2 million, a margin of 16% in Q1 '22.\n\nAs we increase revenue, we also increased R&D activities as we continue to invest in improving and growing our marketplace. Cash and cash equivalents decreased to $699.9 million as of June 30, 2022, compared to $745.4 million as of March 31, 2022. The decrease in cash and cash equivalents quarter over quarter was primarily due to the repurchase of Class A common stock at an aggregate cost of approximately $82.9 million, inclusive of the $50 million accelerated share repurchase program we announced in June. With a strong April and May and a much weaker June, it is increasingly apparent that the record-setting labor market is moderating.\n\nWe expect $220 million of revenue in Q3 '22 at the midpoint, which translates to 3% year-over-year growth. We now estimate revenue for the full year of 2022 to be $890 million at the midpoint, representing 20% growth versus 2021. We expect the macroeconomic environment of increasing inflation, rising labor costs and interest rates to have a more pronounced impact on the hiring environment in the second half of 2022. At all stages of the macroeconomic cycle, however, our mission remains our guiding star.\n\nAs hiring demand moderates, the need to help job seekers will only become more pronounced and ZipRecruiter helps job seekers find great jobs and respond quickly and stand out. We expect adjusted EBITDA of $46 million at the midpoint in Q3 '22 and $170 million at the midpoint for the full year 2022. The full year guidance equates to an adjusted EBITDA margin of 19%, which is higher both in dollars and as a percentage of revenue than both our prior guidance and our margin in 2021. The increase in adjusted EBITDA reflects our dedication to investment discipline in all economic cycles while still allowing us to maintain significant investments in growing and improving our marketplace.\n\nWe're delighted to finish our second quarter in 2022 with such strong results. We remain more excited than ever before that ZipRecruiter is at the center of transforming how people find work as we will continue to actively connect people to their next great opportunity. With that, we can now open the line for questions. Operator?\n\nOperator\n\n[Operator instructions] We'll take our first question from Aaron Kessler with Raymond James.\n\nAaron Kessler -- Raymond James -- Analyst\n\nGreat. Thanks, guys. A couple of questions. A couple of questions.\n\nMaybe first, just on the guidance for maybe the second half. I know you kind of talked about before kind of the guidance for the year implying more of a normalized hiring environment as the year went along. Just curious if kind of the recent increased macro uncertainty and kind of recession concerns has -- was kind of worse than expected and resulted in the change in the guidance. Second, just any commentary on maybe vertical performance for SMBs versus enterprise that you're seeing as well.\n\nIan Siegel -- Co-Founder and Chief Executive Officer\n\nYes, this is Ian. I will take the second question first and address the verticals, which is in the back half of June, we saw a broad-based across all job categories and all seniority levels pull back in the amount of open jobs that -- new jobs that were being posted. And we have always said that we are data-driven in our approach to how we manage our business. And that has really been evinced, if you look over our history, you can go back to 2020 when COVID first hit and you saw us pull down expenses.\n\nIn that year, we actually generated $71 million more in adjusted EBITDA than we did in 2019 in spite of revenue going backwards 3%. And then, you can go to 2021 when the economy reopened and you could see us aggressively invest into the ever-growing number of employers that we're recruiting and the ever-growing number of new jobs that we saw being posted. And that year, we actually generated a 77% increase in top line revenue while still maintaining 15% EBITDA margins. This year, we long foreshadowed and expected that we'd see some sort of a pullback in the economy in the back half of the year.\n\nObviously, this stuff is very difficult to predict, but what's very true is that our business is durable and adaptable to these moments. And once again, we're going to show that. Yes, we modestly took down top line guidance. But you saw that at the same time, we were able to meaningfully increase the adjusted EBITDA guidance, moving it from 16% to 19%, and that just represents our philosophy, which is we are committed to growth but also growing while staying profitable.\n\nAnd so, we're doing it once again, highlighting again the durability of our business model. And honestly, it's been a great quarter and this has long been expected and this is -- we were well prepared for this moment. And so, I think that as we look at the receding economy or the slowing job market, we think of ourselves as in a great position because we're able to make so many investments in our long-term objectives, specifically around our matching technology and improving our brand awareness, both of which we had real strides in during the quarter.\n\nAaron Kessler -- Raymond James -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe'll take our next question from Eric Sheridan with Goldman Sachs.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for taking the questions. Maybe a two-parter. Coming back to some of the initiatives you've talked around marketing over the last couple of quarters, is that a key variable you think about toggling up or down, given some of the volatility we're seeing in this environment? And maybe following up on Aaron's question and your answer. Just give us a better sense of how real-time and maybe applied to what percentage of your cost base, you think, remains relatively variable.\n\nSo if the environment were to improve or if the environment were to worsen, how are you thinking about the ability to react over certain time periods to the broader environment and tie it back to some of the broader marketing messages we've heard before?\n\nTim Yarbrough -- Chief Financial Officer\n\nEric, this is Tim. Thanks for the question. So one thing that's always been true for us is that we're very ROI-focused when it comes to making capital allocation decisions. And so, when we see macroeconomic changes like this impact the business, we're able to flex our spend up or down accordingly.\n\nAnd so, in situations like this, we're showing that adjusted EBITDA is going to come up in the back end of the year as we make prudent allocation decisions and harvest some capital. And so, the largest area of savings for the balance of the year will come from the sales and marketing line items. That's because we're also benefiting from all the investments that we've made to date, building job seeker and employer brand as well. And so, that's -- in general, that's where we see the vast majority of savings come from.\n\nDavid Travers -- President\n\nThis is Dave. Just to add on there, exactly to Tim's point, we maintain a ton of flexibility in our investments so that we can make, in some cases, minute-to-minute, in some cases, week-to-week decisions about how we deploy those dollars toward further growth. So really, the vast majority of those dollars remain very flexible until a handful of weeks, in some cases, days or minutes before we deploy the dollars. And so, the reason we have not only increasing confidence in the amount of EBITDA this year but also in our ability to hit that level as compared to the sort of more variable and hard-to-forecast revenue part of the equation is because of that flexibility.\n\nSo regardless of which step or shape the macroeconomic environment twists and turns over the course of the year, we feel very confident in our ability to hit that new raised guidance on the EBITDA side.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThank you so much.\n\nOperator\n\n[Operator instructions] We'll take our next question from Doug Anmuth with J.P. Morgan.\n\nWesley Sanford -- J.P. Morgan -- Analyst\n\nHi. This is Wesley on for Doug. I thought the comment on the matching algorithm getting smarter over time was interesting with older cohorts getting four times more greater matches. I guess, just how does that type of cohort trend really translate into like revenue per employer? Are you seeing the older cohorts spending a lot more than the newer ones? And then I guess just kind of a follow-up on the guide and the macro.\n\nWhere are you really kind of forecasting the softness to come from, like more on the number of employers or more on the spend side or kind of both?\n\nIan Siegel -- Co-Founder and Chief Executive Officer\n\nWesley, this is Ian. So as it relates to the first part of your question, the great thing about the type of algorithms we have deployed into the job category is everybody talks about the wisdom of the crowd. And so, assuming we see someone new who comes in and posts a job and is looking for a specific kind of talent, instead of just matching keywords from job descriptions to resumes, like job search engines always used to work, we're able to benefit from looking at the patterns across lots of other companies that look like this company that just came in to intuit which candidates they're most likely to like and try to drive those candidates to them. But the other cool thing about our service is it doesn't just learn from the wisdom of the crowd.\n\nIt learns the specific preferences that you as an employer possess. And a big part of the reason why we're able to so significantly drive up the number of Great Matches that we drive to your specific job postings is that we learn about you as you both post jobs and engage with candidates. We use those signals to specifically classify what you like so that we can send you more of that. And then, the broader answer to your first question, does getting more Great Matches translate to more revenue? Indisputably, customers who are having success on the platform are customers who both stay on the platform, assuming they have ongoing hiring needs, as well as invest more into the platform and use more of our features and functions.\n\nSo definitely, success breeds -- hiring success breeds revenue success. And we've talked about that in our cohorts before. And I don't know if you want to add anything to that, Dave.\n\nDavid Travers -- President\n\nYes. So on that point, exactly what Ian was saying, there's a virtuous cycle in our business, where as our software learns and gets smarter about you as an employer, we deliver more Great Matches. That creates more confidence in the employer's part to give us more jobs and to put more budget behind those jobs so that we deliver even more Great Matches. And you can see it in our revenue cohorts over time that we've talked about many times in our S-1, in our investor presentation about every single cohort, every single year, what the trend lines are in terms of how we monetize better over time.\n\nAnd the way our technology gets smarter and smarter over time is a huge driver behind that. And then, parlaying that into the second part of your question about the guidance for paid employers and for average revenue. Exactly that phenomenon gives us tremendous confidence on the average revenue per paid employer because in the SMB part of our business is what is the bigger driver of the paid employer number. I would expect to see some softness in paid employers over the back half of the year, but the strength of that average revenue per paid employer is going to be driven by our pricing power across customers but especially in the fact that you're seeing among the largest, most sophisticated enterprises in the world, they are increasingly turning to ZipRecruiter.\n\nAnd you can see that most of those sophisticated customers are in the performance-based pricing part of our business, which has grown to 22% of total revenue in the quarter, growing 66% year over year, and you see real momentum there. And that, among many other things, will drive the average revenue per employer continually up.\n\nOperator\n\nAnd our final question will come from Ralph Schackart with William Blair.\n\nRalph Schackart -- William Blair -- Analyst\n\nGood afternoon. Thanks for taking my question. Just in terms of the softness you saw in, I guess, the end of June, just curious what that trend line looked like in July and August? First question. And then, a follow-up is, are you seeing any differences that you'd call out between private versus public companies? And I have one more follow-up.\n\nTim Yarbrough -- Chief Financial Officer\n\nYes. Thanks, Ralph. So this is Tim. As far as the softness that we saw in June, we saw that same softness continue after the fact as well, so going into July, as well as August.\n\nIan Siegel -- Co-Founder and Chief Executive Officer\n\nPrivate versus public. You want to take that?\n\nDavid Travers -- President\n\nYes. So in terms of our customer base, private versus public, we definitely see that by size of company, some difference in the performance in the last part of June, where the larger companies who do tend to be more public companies still have, with some notable exceptions but broadly based, still tremendous strength in the enterprise part of the business where those public companies tend to lie. These smaller tends-to-be-private companies were the ones that were more impacted by the slowdown we saw toward the end of the quarter. So there was certainly a difference there.\n\nRalph Schackart -- William Blair -- Analyst\n\nGreat. And just maybe one more. As performance base continues to grow very rapidly, I think you said 22% of your revenue, how does that impact the model going forward, either from a profitability standpoint or just more broadly?\n\nDavid Travers -- President\n\nYes. So great question. There's a couple of different ways that impacts the model. From a margin standpoint, all sizes of customers are incredibly profitable from a gross margin standpoint.\n\nSo it shouldn't have a major impact there. Obviously, we're at 90% and north on gross margins. No plans to see that change. Where the difference is, is in the visibility that that larger enterprise revenue stream provides because those customers have very consistent hiring needs.\n\nSo unlike our smaller businesses, where success for a customer and, therefore, success for us is getting them through their hiring process so they can get back to running their business and so that we remain top of mind the next time they have a hiring need, the largest, most sophisticated enterprises in the world have very consistent hiring needs that provide tremendous revenue visibility over time so it becomes easier to plan around. And as you can imagine, over the long term, the lifetime value of those customers is incredibly high, given the gross margins and the visibility they provide year after year after year in the data we have observed thus far. So that's really the difference that we see. And as we think about our investments in building brands and our go-to-market functions overall, one of the reasons we are so confident in our ability to get from the 20% at the midpoint of our guidance for adjusted EBITDA this year to our long-term adjusted EBITDA target of 30% that we've talked about so many times is that long-term revenue visibility as we scale from existing large enterprise customers, in combination with the fact we're already with significant investments already as we scale in marketing gives us the confidence that we're already reaching a very high percentage of customers and potential customers throughout the United States.\n\nBut that marketing and sales and marketing line, in particular, will drive scale, and as we scale, will drive greater margin improvement so that we can get from the 20% at the midpoint this year to our long-term target of 30%.\n\nRalph Schackart -- William Blair -- Analyst\n\nOK. That's very helpful. Thank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAmy Garefis -- Chief Accounting Officer\n\nIan Siegel -- Co-Founder and Chief Executive Officer\n\nDavid Travers -- President\n\nTim Yarbrough -- Chief Financial Officer\n\nAaron Kessler -- Raymond James -- Analyst\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nWesley Sanford -- J.P. Morgan -- Analyst\n\nRalph Schackart -- William Blair -- Analyst\n\nMore ZIP analysis\n\nAll earnings call transcripts"
}