{
  "companyName": "Affirm Holdings, Inc.",
  "companyTicker": "AFRM",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/26/affirm-holdings-inc-afrm-q4-2022-earnings-call-tra/",
  "content": "Affirm Holdings, Inc. (AFRM 0.10%)\nQ4 2022 Earnings Call\nAug 25, 2022, 5:00 p.m. ET\n\nOperator\n\nGood afternoon, ladies and gentlemen. Thank you for standing by. Welcome to the Affirm Holdings' fiscal year 2022 fourth quarter earnings conference call. At this time all lines have been placed on mute to prevent any background noise.\n\nFollowing the speakers' remarks, we will open the lines for questions. As a reminder, this conference call is being recorded, and a replay of the call will be available on our investor relations website for a reasonable period of time after the call. I'd now like to turn the call over to Rob O'Hare, senior vice president of finance to begin. Please go ahead, sir.\n\nRob O'Hare -- Senior Vice President, Finance\n\nThanks, operator. Before we begin, I would like to remind everyone listening that today's call may contain forward-looking statements. These forward-looking statements are subject to numerous risks and uncertainties, including those set forth in our filings with the SEC, which are available on our Investor Relations website. Actual results may differ materially from any forward-looking statements we make today.\n\nThese forward-looking statements speak only as of today, and the company does not assume any obligation or intend to update them, except as required by law. In addition, today's call may include non-GAAP financial measures. These measures should be considered as a supplement to and not a substitute for GAAP financial measures. For historical non-GAAP financial measures, reconciliations to the most directly comparable GAAP measures can be found in today's earnings press release, which is available on our investor relations website.\n\nHosting today's call are Max Levchin, Affirm's founder and chief executive officer; and Michael Linford, Affirm's chief financial officer. With that, I'd like to turn the call over to Max to begin.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nThank you for joining us on this call. The fourth quarter capped off an exceptionally strong fiscal 2022 for Affirm. We have once again posted a very healthy set of numbers, beating our own financial targets. We executed well throughout the quarter, meeting U.S.\n\nconsumer spend where it was. With COVID restrictions nearly gone, getting out of the house and out of town became a huge draw. While homewares and fashion experienced something of a retreat to more normal levels of growth, we were able to help our longtime partners and online travel agencies have a banner quarter, posting triple-digit year-on-year growth in some cases. We had anticipated this shift a little while ago and recently announced some timely new partnerships in the space like Agoda and SeatGeek.\n\nDespite what you may have heard elsewhere, people are still buying things online, a lot of them. Last month featured our very first Prime Day, which was as much a test of our product as it was of our systems and scalability, and we were quite pleased with the results. Running up to and during the event, we introduced zero APR programs on numerous SKUs. We also expanded our partnership with WooCommerce, which includes extending our reach to support their merchants in Canada.\n\nMore recently, Affirm became WooCommerce's preferred pay-over-time partner, replacing a provider that specialized in the six-week loan variety, underscoring merchant demand for complete solutions. And we significantly broadened our relationship with Stripe, unlocking streamlined distribution to more merchants and more consumers. We often talk about Affirm as a two-sided network of consumers and merchants. The last obvious but all important third side is our capital partners.\n\nMaintaining a diverse set of funding sources is critical in this economic environment. And from our earliest days, we knew there was no winging it with capital markets. Today, we are proud to call some of the most sophisticated investors in the world our long-term partners. Thanks to our excellent capital team, we added just over $1.6 billion of net new committed capital.\n\nApproximately 70% of this capacity came from existing and new warehouse and forward flow agreements, including a new $0.5 billion multi-year forward flow commitment. In addition, our capital team executed two new asset-backed securitizations during this quarter. As proud as we are of our results this year and quarter, we know that many people are thinking about how the economic picture may unfold and so are we. The economy is more than likely in the beginning stages of a downturn.\n\nIt's too early to tell how deep it will be and how long it will last. So how do we continue building the strongest Affirm amid uncertainty? In a sentence, we are going to be cautious in our management of risk while investing aggressively in the expansion of our total addressable market. The former means our credit posture will remain conservative until we have a clearer view of the real economy. The latter is that we expect significant growth from new partnerships, new products and new geographies.\n\nIn the language of the 1990s Internet, we're widening the top of our funnel while keeping a watchful eye on its bottom. Let me spend some time on both of these topics. As we have said numerous times in the past, credit performance is a non-negotiable guardrail for Affirm. This is true because we see guarding our consumers' financial health as a part of our mission and because we remain obsessively focused on delivering exceptional results to our capital partners.\n\nWe have both the underwriting technology and the control systems to deliver on this goal. We covered this in our May earnings call, but for a quick refresher, relatively short terms and individual loan approvals give us enormous flexibility when it comes to managing our back and front books, respectively. Being able to request a transaction-specific down payment or additional income information and offer risk appropriate term selection are just some of the powerful tools we have built over the years. This part probably does not need to be said, but just because there still seems to be some confusion, unlike the folks in the marketplace lending businesses, we are not dealing with the decaying performance of loans made years ago in pursuit of growth at all costs.\n\nRoughly half of our outstanding loan book is expected to pay down within four months or so at about 80% within eight months. Our mission and our business model compel us to keep our consumers' long-term financial interest in mind alongside our partners and our own. But while we expect to have a conservative mindset with respect to credit during this period, we intend to use our advantaged position to grow and to continue taking market share by expanding our total addressable market aggressively. Here are just some of the growth initiatives I'm excited about.\n\nInclusive credit, we have worked relentlessly over the last several years to evolve our approach to identifying and underwriting creditworthy applicants left outside the traditional credit reporting infrastructure. By some estimates, this is almost 45 million Americans and we are excited to begin deploying some of these features in time for the upcoming holiday season. Scaling brand-sponsored promotions. We continue to leverage unique features of the Affirm network, most importantly, SKU awareness.\n\nThrough our brand-sponsored promotions product, manufacturers have the ability to sponsor low and zero APR deals at specific retailers on an item-by-item basis. Taking this concept a step further, we are delivering a full self-service console to participating brands and manufacturers to enable them to deploy promotions on the Affirm network seamlessly. International expansion. PayBright, now known as Affirm Canada, continues to deliver very good results, and I'm pleased to announce that this past quarter, I asked Wayne Pommen, formerly the CEO of PayBright, to step up to lead all of our international efforts.\n\nUnder his leadership, we are investing in the United Kingdom market this fiscal year and plan to continue from there. Debit+. We have spent significant time fine-tuning Debit+ this quarter, focusing on the usability and profitability of the card. The transactions per active consumer are at a healthy 2.7 times per week, and the online/offline usage breakdown is split nearly evenly.\n\nIt's still quite early, so as usual, a warning about reading too deeply into the fine grain metrics. That said, GMV per active Debit+ consumer is over 40% higher than a non-Debit+ one. And after the first two weeks from consumer onboarding, we see near-perfect cohort retention. As you will hear in a second, we're still adding significant features to Debit+, and its at-scale contribution to our top and bottom lines is difficult to forecast.\n\nAs a result, we have excluded all Debit+-related metrics from our forecast today. We are excited by what we see in the usage so far and are committed to making Debit+ a massive long-term success, expanding our reach, frequency and profitability. Rewards. One of the key preference driving features of modern consumer payments is rewards.\n\nIt is the most common theoretical objection to BNPL versus credit cards. We can stop the debate. Our plan is to launch Affirm Rewards in beta this September with a number of participating retailers. As we roll the program out, Affirm consumers will begin to earn points on eligible point-of-sale, Affirm Anywhere and Debit+ transactions, with redemptions in the Affirm app.\n\nWe're very excited about the possibilities here and expect to scale the program in time for the holidays. I'll stop here, but there are numerous other initiatives we're plowing away on while keeping credit performance top of mind. Last year, we hosted an event where we discussed our product road map in detail and plan to do one again late this year. We'll give you a much more detailed overview of what's getting built then.\n\nBefore I hand it off to Michael, one more comment on growth. For quite some time, we've expected consolidation to begin in this space. Our exciting mission, market leadership and a strong cash position make Affirm an exit of choice for teams with great talent now that the prices and the parlance of our times have corrected a bit. We have no specific M&A targets to report today, but are keeping a very keen eye on the market.\n\nWe continue to see strong demand for the simple idea of paying overtime and, in particular, for our take on it, supporting many transaction types and sizes and keeping away from gimmicks and hidden fees. Our strategy remains exactly the same as before, to continue building our network, more partners, more active consumers and more transaction volume. As always, I want to thank the ever-growing worldwide band of Affirmers united by our shared sense of mission and to send a special shout-out to the veterans, still going strong through the shared ups and downs of our first decade together. It's amazing to contemplate that just a few years ago we imagined that supporting $50 million of transactional volume would be quite the achievement, even as we now plan our march to $50 billion of GMV just a few years from now.\n\nAnd now on to Michael for the numbers.\n\nMichael Linford -- Chief Financial Officer\n\nThanks, Max, and good afternoon, everyone. I'd like to start by echoing Max and acknowledging all Affirmers for their contributions and dedication to our mission. We are proud of the progress we made this fiscal year as we introduced nearly 7 million more people to on a finance, expanded and diversified our merchant base to cover more than 60% of U.S. e-commerce and delivered very strong unit economics at 4.3% revenue less transaction costs as a percentage of GMV, well above our long-term range of 3% to 4%.\n\nWith our team's solid execution, we exceeded all of our guidance for fiscal 2022 despite increasingly volatile market conditions in the second half of the fiscal year. I'll cover three topics before we open the line for questions: first, a more detailed review of our fourth quarter results; second, an update on what we are seeing in terms of consumer credit performance; and third, some perspectives on what we expect and how we plan to operate in fiscal 2023, given the macro environment, the growth opportunities ahead of us and the profitability targets we plan to achieve. Now to the quarter. Unless stated otherwise, all comparisons refer to our fourth quarter of fiscal 2022 versus Q4 of fiscal 2021.\n\nOur Q4 earnings supplement is also posted on our IR website. We continue to scale our network. Active consumers increased 96% year over year to 14 million and active merchants increased to nearly 235,000. This help to drive 139% growth in transactions, 85% of which came from repeat consumers.\n\nAs you have heard us say before, driving greater frequency is a key priority as it not only fuels our flywheel but helps us drive efficiencies. Annual transactions per user increased for the fourth consecutive quarter to three transactions per year, which was up 31% year over year. We grew GMV 77% and 89%, excluding Peloton. Our strong traction across our enterprise partnerships continued throughout the quarter with our three largest partners making up roughly 30% of our total Q4 volume.\n\nOur volume with our two largest partners grew 27% sequentially from Q3 and are still in the beginning stages of their integration. On Slide 9 of the supplement, you can see just how diversified our network is across industries. This represents a key area of strength and resilience for Affirm, particularly as consumers shift spending patterns like they did in Q4. That said, given how underpenetrated we are today, our growth is not limited by the growth of our merchants or even broadly to e-commerce.\n\nFor example, e-commerce penetration retreated to its pre-COVID trend line this quarter, and our growth still outpaced the broader market by an order of magnitude. Travel and ticketing increased to $545 million, up 87% from last year and a staggering 443% compared to pre-pandemic levels of Q4 in 2019, highlighting the success of our investments in partnerships in the category. American Airlines, Expedia, Priceline and Vrbo were all top 10 merchants for Affirm this quarter. General merchandise grew to over $881 million, 477% above last year, driven by our deepening relationships with Amazon, Walmart, Target, also top 10 merchants for Affirm in fiscal Q4.\n\nPayBright more than doubled, posting year-over-year GMV growth of 116%. PayBright bright continues to hold a market leadership position in Canada that includes merchant relationships with Apple, Samsung and Hudson's Bay Company. Turning to the financials. Total net revenue grew 39% to $364.1 million, above our outlook of $345 million to $355 million and grew 49%, excluding Peloton.\n\nNetwork revenue grew 39% and interest income increased 33%. Gain on sale increased 30%. Revenue as a percentage of GMV contracted by 226 basis points to 8.3%, driven by a mix shift away from longer-duration 0% loans and toward short-term Split Pay loans. Split Pay GMV grew over 193% year on year and accounted for roughly 23% of GMV in the fourth quarter compared to 14% last year, as you can see on Slide 8 of our earnings supplement.\n\nSplit Pay has a different economic profile compared to our core 0% APR program, and the composition of these two products effectively reversed year over year as we have expanded into higher frequency transactions. This resulted in a year-over-year decline in revenue take rates, which we express as a percentage of GMV. However, you can see on Slide 14 that take rates within each of our product offerings continue to remain relatively stable. Our strong top line growth, combined with the leverage we achieved on nonprovision transaction costs, drove a 25% increase in revenue less transaction costs to $184.3 million or 4.2% of GMV.\n\nTotal transaction costs of $179.8 million grew 58% year over year. Excluding provision expense, transaction costs grew 21% compared to revenue growth of 39%. Loss on loan purchase commitments declined 21%, primarily driven by the mix shift I just mentioned. As a reminder, loss on loan purchase commitment mainly occurs with the core long-term 0% APR loans.\n\nOur funding costs increased 24% year-over-year, in line with the 24% growth in loans held for investment despite the higher rate environment and significantly below the 53% growth in our total platform portfolio. On our February call, we estimated that a 100 basis point rate increase beyond the forward curve at the time would result in an approximate 10 to 20 basis point impact to RLTC as a percentage of GMV for the second half of fiscal 2022 based on our mix at the time. Since February, peak rate expectations within the forward curve increased by more than 150 basis points. Despite this, we delivered 4.4% RLTC as a percentage of GMV for the second half of fiscal 2022, well above our implied 3.9% in our outlook at the time.\n\nWe have the ability to manage the short-term impacts in the forward curve with the tools inherent in our product, which Max shared moments ago, and staggered renewal periods on our funding facilities. We continue to estimate that a 100 basis point rate increase beyond the current forward curve may translate to an approximate 10 to 20 basis point impact to RLTC as a percentage of GMV in fiscal 2023. In comparison to a more normalized fiscal third quarter of 2022, provision for credit losses grew just 10%, and provision expense as a percentage of GMV declined by 4 basis points sequentially to 1.65%. Our allowance for losses as a percentage of loans held for investment declined for the third consecutive quarter to 6.2% as we continued to drive strong credit performance.\n\nExcluding transaction costs, non-GAAP operating expense grew 60% to $215.2 million or 59% of total revenue. On a non-GAAP basis, sales and marketing expense declined 1% year over year. Adjusted operating loss was $29.3 million in the quarter or 8% of revenue, which was significantly better than our outlook for adjusted operating loss of 15% to 11% in the period, driven by better-than-expected RLTC and lower-than-expected operating expenses. GAAP total operating expenses, excluding transaction costs, grew by 76% to $461.6 million, driven by year-over-year growth in enterprise warrant and share-based expense of $102.7 million.\n\nGAAP operating loss was $277.2 million, which compares to a loss of $114.3 million in the prior year period. Now to move on to my second topic, consumer credit performance. We believe we managed this to a great outcome despite the environment. As we have shared in the past, we are, first and foremost, focused on managing risk.\n\nWe constantly monitor the credit performance of our portfolio, as well as the broader environment. Given inflationary pressures, we began to see the signs of stress during the quarter within certain low credit segment consumers. This stress without mitigation would flow through to charge-offs. However, the inherent advantages of our underwriting every application at the transaction level and the high turnover nature of our book provides natural agility.\n\nAccordingly, we ever so subtly turned our dials and gave up a couple of points of growth this past quarter through small optimizations, and we still grew GMV by 77%. When we say we have the ability to manage credit outcomes, this is exactly what we mean. Our delinquency levels are healthy for our business, and we have demonstrated our ability to grow while controlling them. We've said it before and we'll say it again.\n\nWe are different from our competitors who had to dramatically slow their growth rates because this is the only lever they have for managing risk. We are confident that these differences will only become more apparent over time. With that, let me turn now to our outlook for fiscal 2023. When we reported our fiscal 2021 results a year ago, we had just posted $8.3 billion in GMV.\n\nWe closed fiscal 2022 well ahead of our plan at nearly $15.5 billion in GMV, representing 87% growth in GMV and 114%, excluding Peloton. Our team's outperformance this year means we are ahead of where we expected to be in terms of market share. We believe that we are well-positioned to continue growing our network while expanding our product offerings and geographic reach. That said, we think it is important to acknowledge the current macroeconomic backdrop as we give our initial guidance for fiscal 2023 and attempt to estimate these factors through June of next year.\n\nWhile we cannot precisely predict the macroeconomic conditions, our outlook assumes the current forward interest rate curve. It also assumes that the current macroeconomic conditions do not fundamentally change for the better, with early signs of consumer stress persisting through the fiscal year. If we do see signs of significantly more stress or if rates were to increase much more than expected, we expect to utilize the various levers at our disposal to protect our unit economics. Among others, these include merchant and consumer pricing, duration shortening, approval rate changes and downpayment rates.\n\nOur outlook is also informed by the following: first, we made significant progress within our Shopify and Amazon programs, which reached general availability in June and November of 2021, respectively. As we enter the second year of availability for each of these programs, we expect continued growth in fiscal 2023 albeit from a much bigger base. Similar to fiscal 2022, we expect holiday-driven seasonal GMV strength in the second quarter of fiscal 2023. However, we are forecasting the second quarter to be the low point for the year-over-year GMV growth, given the nearly 370% growth in general merchandise GMV that we are comping against.\n\nFurther, given timing within the quarter and the product mix, we expect to see a seasonal decline in both revenue and revenue less transaction cost as a percentage of GMV in the period due to how revenue is earned on these loans, similar to last year. While we continue to make progress with Debit+, we are still in the early innings. As such, our outlook for fiscal year 2023 does not include any material GMV or revenue impact from this product. While the funding markets remain volatile, we enjoy a strong position without any current concerns on funding our growth.\n\nWe would expect to continue to execute across all of our funding strategies and keep equity capital required below 5% of total platform portfolio. At that level, this would reflect marginally less ABS execution proportionately this year. With that context in mind, for our fiscal year ending June 30, 2023, we expect gross merchandise volume to increase between 32% and 42% from fiscal year 2022 to between $20.5 billion to $22 billion. This would imply a two-year compound annual growth rate of between 57% and 63% versus fiscal 2021.\n\nAccordingly, we expect revenue of $1.625 billion to $1.725 billion, representing year-over-year growth of 20% to 28% and a two-year compound annual growth rate of between 37% and 41%. The forecasted contraction in total revenue as a percentage of GMV in fiscal 2023 is partially driven by our aforementioned interest rate expectations and the continued mix shift to expand into higher frequency purchases. Turning to expenses. We expect transaction costs of $865 million to $915 million, reflecting a modest year-over-year reduction in transaction costs as a percentage of GMV.\n\nThis improvement is expected to be driven primarily with the loss on loan purchase commitment line. As a result, we expect revenue less transaction costs of $760 million to $810 million. Revenue less transaction cost as a percentage of GMV is expected to be roughly 3.7%, in line with our long-term model of 3% to 4% GMV. Moving down the P&L.\n\nWhile we will be prudent with expenses to be reflective of the current environment, we will continue to invest in engineering and product talent to support the robust product road map that has been and will continue to be a key differentiator for Affirm. We expect our sales and marketing and G&A expense lines to grow on a dollar basis in the year. However, these lines should demonstrate operating leverage as a percentage of revenue when measured on an adjusted non-GAAP basis. Accordingly, we expect adjusted operating loss as a percentage of revenue of 6.5% to 4.5% for the full year.\n\nAs we shared in our May earnings call, we expect to achieve a sustained profitability run rate on an adjusted operating income basis by the end of this fiscal year. As we said previously, we do not expect to compromise our long-term growth opportunities as we progress toward sustained profitability. Finally, we expect weighted average shares of approximately 298 million for the year. For our first quarter ending September 30, 2022, we expect GMV to grow 55% to 62% to $4.2 billion to $4.4 billion.\n\nWe expect that growth to drive total revenue of $345 million to $365 million. Our outlook for the first quarter also contemplates transaction costs of $176 million to $188 million; revenue less transaction cost of $169 million to $177 million; adjusted operating loss as a percentage of revenue of 12% to 10%; and weighted average shares outstanding of 292 million. While the uncertain macro picture over the next 10 months to 11 months, as well as us lapping some staggering year-over-year comps are leading us to be prudent in the short-term, we remain very bullish about our opportunities. We are confident in our ability to execute and we continue to see strong underlying trends that position Affirm for further growth and success.\n\nWith that, we'll open it up for questions. Operator?\n\nOperator\n\nThank you. We'll now be conducting a question-and-answer session. [Operator instructions] Our first question is coming from Ramsey El-Assal from Barclays. Your line is now live.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nHi, thanks for taking my questions this afternoon. I wanted to first ask about the July and August delinquencies. Should we think about an ongoing increase as we move forward sort of a similar magnitude this year? Or can you adjust your credit box, as you kind of mentioned, to sort of engineer more of a plateau there? I guess, an easier way to ask the question is what provisions and losses are baked into the full year guide? Maybe that's the way I should have characterized it.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nThanks for the question, and I'll start and Michael can help quantify it. So probably the most important headline is that we are in full control. You should start seeing what we mean by that relatively quickly. One good metric or [Inaudible] anecdote to offer, so we have been taking a fairly conservative posture, as you've probably heard on the call, or in the prerecorded part of the call, we have been keeping an extremely careful eye on the credit performance.\n\nAll the while, our approval rates have actually gone up. So what we've been doing in the background -- and not a lot of, it sounds like we've opened up significantly. I think the three points of incredible approvals have been added. What that means though is that we've been optimizing credit very, very actively.\n\nThis implies things like tightening in durations, asking for a more down payment, in some cases, asking for incremental income information. So yes, I don't think you should expect us to increase our provision. In fact, we intend to, if anything, be quite conservative. I know Michael want to quantify for us.\n\nMichael Linford -- Chief Financial Officer\n\nNo. Just look, I think what you're seeing very recently in terms of the sequential build is what we consider to be a pretty normal seasonal pattern. That seasonal pattern should begin to abate and go down. As you know, there's two things to think about.\n\nThere's the numerator and the denominator. The one thing to keep in mind is that, obviously, is the base that you divide it by, both in terms of the impact that we have on total term lengths, as well as what we have, just in terms of the actual change in the total portfolio. We'll change the measure that we report publicly, but when we look at the business and think about the state of credit, we feel very optimistic that we have it well in hand. And the ultimate proof is how that shows up in our confidence around our margins in the business, which we continue to believe are quite strong and on the higher end of our long-term range that we've given everybody.\n\nRamsey El-Assal -- Barclays -- Analyst\n\nGot it. OK. Thank you. One follow-up for me.\n\nCould you progress report on the Amazon ramp and maybe focusing particularly on Prime Day? How did that go for you? I think it's a new input into the model this year. Did the 0% loans gain traction? And could you see a scenario where those become a more permanent fixture at Amazon?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nSo probably the most important thing to know about Amazon is that it's still very, very early relative to the potential of the –- just the sheer scale they have and the many different ways for us to work together. We were very pleased with our Prime Day performance, frankly, as much technically and ability to approve and ability to scale all the thing from underwriting to the web systems. All that went really, really well and our partners have given us high marks on that front. We have a lot of work to do.\n\nYou're right, that the 0% is always an extreme crowd-pleaser when it comes to consumer buying. And I think both of us in a partnership have noticed that it is, in fact, a very successful way of offering consumers a reason to buy now. And so we expect more of that. As it happens, we'll certainly report on it.\n\nBut the current state of partnership is nothing but excellence.\n\nOperator\n\nThank you. Our next question is coming from Dan Perlin from RBC Capital Markets. Your line is now live.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nThanks. Good evening, everyone. I wanted to just touch base on the transaction cost ramp. It looks like –- you gave us the first quarter and the full year.\n\nSo it looks like it's going to pretty materially ramp as you go out into the back half of the year, especially with your commentary around some leverage on loss on loan purchase commitments, which totally makes sense. So I'm just trying to understand, I guess, a couple of the major drivers. You just mentioned that your provisioning didn't sound like it was going to be off the charts, although I suspect that has to be higher and then your funding costs obviously have to be up based on yield curve. So maybe you could just help us walk through the cadence a little bit of that and maybe some of the line items that we need to make sure we're really focused on there.\n\nMichael Linford -- Chief Financial Officer\n\nYeah. I think one of maybe the most important thing to think about is the seasonality that we would expect around both the revenue and transaction costs. Q2 is going to see, we think, a valley, both in terms of the growth rate of the business, the revenue take rates and the revenue less transaction cost. And that has a lot more to do with the timing and type of loans that we originated, much like it did last year.\n\nIn the back half of the year, we would –- truly, the back half of the year, we would not expect any material changes with respect to the efficiency, except we actually would assume it improves on a margin basis from Q2 onward.\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nOK. And then I mean, you sound decidedly more conservative and may be concerned about the macro and the consumer on this call relative to maybe previous calls, rightfully so. But how do we think about how big maybe that cohort is when you're talking about lower credit quality, seeing signs of stress? Is there any way you can size that for us or just give us some context about what that looks like inside of your overall portfolio? Thank you.\n\nMichael Linford -- Chief Financial Officer\n\nYeah. The answer that we've been giving folks up until this quarter is that we saw no signs of stress and that was something that was the first quarter we saw any signs. I think what you saw, though, in the quarter was all of our tools to manage that on full display. The reality is we solved the stress and we began to have to react to it.\n\nSo I don't know that we're making a statement about things into the future beyond that. What we saw today is extremely manageable. And that's just not the case for other lenders out there right now. In these credit segments, we're trying to differentiate us is that we actually have the levers to control it and we did.\n\nAnd we continue to feel very good about being able to do that into the future. The statement around macro environment really should be heard as uncertainty. I would politely tell anybody who thinks they can predict where the economy is going to be in 10 months or 11 months, and I think that gives us reason to be prudent in how we operate the business, given the lead that we've built, where we have the ability to be very careful and thoughtful about how we run the business. And it doesn't show up in, as Max said, doesn't show up enough throttling approval rate substantially.\n\nIt shows up maybe in the timing and type of products that we want to launch and being careful about introducing a lot of net new because we don't feel like we need to right now. We can be very careful and thoughtful about the state of the consumer and play with the lead that we have right now.\n\nOperator\n\nThank you. Next question is coming from James Faucette from Morgan Stanley. Your line is now live.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nThank you. I wanted to just ask a clarifying question on the rising delinquencies. I mean, it seems like they're kind of, at least in the last month or six weeks or a little outside of where you've historically targeted. Are you saying that through the incremental changes in the way that you're managing that, we should expect those to come back toward that 2%? Or what's kind of the right range for us to think about where those should be at? And are the –- and I guess along with that, are there adjustments you need to be making to your provisioning? And then I have a follow-up question on funding.\n\nMichael Linford -- Chief Financial Officer\n\nYeah. So let me start with the second question first. Our allowance that we have on the balance sheet, which determines the provision and the income statement is that for the third quarter declined. So we have –- I can't find any other words to describe how comfortable we are with the current state of credit other than we provided for a full expectation of credit losses at the time of origination, and that outlook has been improving for the third consecutive quarter.\n\nSo we feel very strong about the state of the portfolio. The delinquency data that we show publicly is the portion of the total platform portfolio that's 30 days delinquent or more. And as I was probably mumbling through a little bit earlier, there's a numerator and denominator effect there. And it's a little bit difficult for us to want to be prescriptive on where that number needs to be.\n\nObviously, we have a guardrail. We're way away from the guardrail. The guardrail, as we talked about earlier this year, is many points above anything that we've ever operated the business at. The real thing we would like to do is make sure that the unit economics or revenue less transaction costs are still printing at really high levels with the provisions that we are –- we would need to be taking.\n\nAnd those are the numbers that we feel really, really strong about. And on top of all that, we are hitting the seasonal peak for delinquencies and therefore would expect the seasonality trend to work into our favor from here.\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nGot it. And then on funding capacity, I appreciate the update there. Can you help characterize for us the –- what the nature of those commitments are from a capacity standpoint? And anything that we should be aware of either in terms of upcoming renewals or where the way terms of those commitments could change, etc.? Thanks.\n\nMichael Linford -- Chief Financial Officer\n\nYeah. Thank you for the question. So first, just overall, the way to think about the market, we have really strong demand or supply for –- on balance sheet where health capacity, I would characterize it as us having to say no and the banks are plenty willing to lend money right now. I think the forward flow market also remains very attractive with a robust pipeline of forward flow buyers who are interested in partnering with us.\n\nI think the ABS market is obviously quite volatile, and you're going to see us be a little bit more careful and thoughtful about where and when we execute there this year. However, with respect to forward flow, that capital is very committed. And we have about $200 million out of $4.3 billion of forward flow capacity that's even up for renewal in the entire fiscal year. That is to say, 95% of our capacity is mostly locked into the entirety of fiscal 2023 on the forward flow side.\n\nWhat that does for us is it serves as one of the many tools that we have to mitigate any impact of rates. So the ways that could impact us are, first and foremost, access to credit. We enjoy a large amount of capacity where it will not constrain growth. And the second way it impacts us is obviously in higher cost of funds or lower yields that we're able to get when we sell loans.\n\nIn both those cases, those impacts are delayed. What you saw in the back half of fiscal 2022 was a huge shock in rates. When we talked in February until the end of the year, peak rates moved to the head of my note, over 150 bps. And the impact to us was frankly impossible for anybody to see as we crushed our revenue less transaction cost numbers in that period.\n\nSo we look at next year as being a very secure and safe level of funding, with the upside being our team is still out executing deals because the markets are still very constructive on the forward flow side. I think the one thing that you're going to see less of this year, though, is ABS execution with the big caveat being that we just don't know. I mean, if the market does find a new stable footing, you'll see us be active in the back half of the year. But as we sit here today, we do think that there's a lot more volatility in that market.\n\nWe're going to be –- and that's showing you up how we're talking about the funding mix for the next year.\n\nOperator\n\nThank you. Our next question is coming from Jason Kupferberg from Bank of America. Your line is now live.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nHey, thanks, guys. I just wanted to start with a two-part question on GMV. Can you tell us the fiscal 2023, the GMV growth guidance ex-Peloton? And then just the second piece there is if we reflect back on fiscal 2022, I think you had started the year guiding to 50% to 54%. You ended up at 87% Amazon helped.\n\nAnd so I'm just trying to get a sense of how much services you guys might be trying to bake in just as you've had multiple times, there's a lot of uncertainty out there. And then I have a follow-up. Thank you.\n\nMichael Linford -- Chief Financial Officer\n\nYeah. So the first question, in terms of Peloton, we're very proud that we've expanded our merchant and category mix where Peloton continues to deconcentrate in our business. It was low-single digits percent of our business in Q4, for example, and yet, we still haven't lapped all of the contribution. So we would continue to expect that to be a declining business.\n\nOur current expectations are that it's something on the order of 4 points of GMV growth and 7 to 8 points of revenue growth that we are not getting this year or at least that we expect all come to drag against. And that's part of the reason why we're so confident in the long-term here is that we do have to grow out of this a little bit of a drag associated with a partner who's trying to write a troubled ship. The second question was how much concerns are we having? Look, our guide is our guide. We are not going to caveat it or characterize it in any way, except it's our guidance.\n\nHowever, we do take it very seriously. We like to put numbers out there that we can achieve. You'll notice that the ranges are wider this year. The width of the range reflects the fact that we do have a lot more factors at play that we can't control.\n\nBut our guide is the guide and yet we take it very seriously, and I don't think we've missed one yet.\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nThat is true. Just a follow-up, I guess, on the credit side. I mean, as we talked about, the delinquencies are up a little bit. I think charge-offs were up as well, but it looks like there was actually a little bit of reserve release in the quarter.\n\nAs you mentioned, the allowance ratio was down again. So can you just help us reconcile all of that, I guess, just given what's going on in the macro?\n\nMichael Linford -- Chief Financial Officer\n\nYeah. So maybe a little bit of a brief description of how the allowance and provisioning works mechanically. So at the time of origination, we make an estimate of the likelihood, the likely allowance needed for that loan. And then every month, we update what we would consider to be the back book's drift or improvement.\n\nAnd so for example, we might estimate a loan or pooled loans will have a 5% total loss content to origination. And a month later, depending upon actual repayment information or the flow rates from one delinquency bucket to the other, we update that view. And it is the case that we're outperforming our own expectations. And just generally speaking are we like to try to be pretty thoughtful in ensuring that we're never under provided for potential losses.\n\nThat's still the right side of the ledger to be on –- sorry, we're concerned. And I think that's a factor that's probably very difficult for you to read through. And it's why we keep pointing people back to look at our current allowance rate, and that is our current estimate of all of the future losses of the loans better than our balance sheet. I think that drawing a straight line between data like the DQ 30 chart to eventual charge-offs is a pretty big step and probably not something that I would do.\n\nI would look to the current allowance rate as the total losses for the book that's on the balance sheet and then think about that number as being increasing or decreasing, consistent with the future expectation of losses.\n\nOperator\n\nThank you. Our next question today is coming from Moshe Orenbuch from Credit Suisse. Your line is now live.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGreat. Thanks. Michael, I think you partially answered this in one of your earlier comments, but could you talk a little more about the credit tightening steps that you took and what impacts they have on the GMV in fiscal 2023?\n\nMichael Linford -- Chief Financial Officer\n\nYeah. So I think the – let me speak to what happened in the prior quarter first because I think that's pretty illustrative of what we think will happen. We might look at a particular merchant or a set of consumers or products. We're very –- we're able to be very surgical.\n\nAnd we'll find a pocket of risk that, say, is currently experiencing signs of stress. The leverage then that we have at our disposal or everything from actually just increasing the credit bar to lower approval rates because you have less of the capacity to approve to changing the term lengths, if you change from a 24 months to 18 months, your risk posture changes or requiring more down payments. Max mentioned this at the very top. We made all of those moves to manage the early signs of stress.\n\nThose are signs of stress, I think you've seen reported in a lot of other contexts. We were able to fully mitigate those and still be very growthful and actually increased our approval rates. And that's because approval rate, yes or no, isn't the only lever that we have. We have a lot more tools at our disposal.\n\nAnd we could be very growthful, because we were still launching and scaling these very large platform relationships like with Amazon and Shopify. And so these –- I would characterize them as truly like we're talking about low single-digit percentages of GMV on a net basis, because while we're doing those tightenings, we're also doing optimizations that open up and find opportunities to underwrite really good risk. If you think about how that informs the plan going forward, I think it's maybe a tertiary factor. I don't even think of it as a primary factor.\n\nAnd it's definitely true that we have a more conservative posture today than we did a year ago. But the impact of lapping the explosive growth in the first half of last fiscal year and the aforementioned Peloton categorical headwind, combined with the things like the shift in e-commerce and the discretionary spend, those probably matter more than the things that we're seeing directly on credit as we sit here today. The truth is, as we said in the call, as we see deterioration, we will pull extra levers, they may not show up as substantially less growth, but they will, nonetheless, show up with protecting our unit economics.\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nGot it. Thank you. And as a follow-up, at the beginning of the call, Max had mentioned the rewards program. I was hoping you could kind of maybe flesh out a little bit how you think that will impact both sides of revenue less transaction costs, how it will impact kind of volume and costs as we go forward.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nSo first of all, we're launching a beta. And as we do everything here, it's a slow start, very careful optimization. We're not going to compromise our unit economics. We're not going to compromise any other metric that we care a lot about.\n\nThe goal is, first and foremost, is to compel consumers to transact with Affirm more. I think when we took this company public, the conversation in the investor community and the analyst community was, well, you guys are great, but will people transact more than just 1.5 times a year or whatever the number was? We've shown that we can continue to move that number up and up and up. One of the preference drivers is how rewarding are these transactions. And typically, that means miles or points or something like that.\n\nOf course, we'll put our own spin on it, and we are different and we like our differences. But it will be a way to give consumers one more reason to choose Affirm when they have all the choices. Rewards also tends to attract higher credit quality consumers. Just as a general statement, you will see that folks that need credit to improve their buying capacity don't care as much of our rewards.\n\nFolks that have lots of choices tend to select their paying instrument in part based on how rewarding it is. Therefore, consciously, and we're being very careful in the forecast here, with at least with that piece of mind, we don't expect to make these cost us more in unit economics. The goal is to keep the unit economics, but they are protecting we quite like our LTC rate and we'll keep targeting that. That hopefully makes it clear that these are predominantly merchant-funded.\n\nWe'll launch with a handful of early merchant partners in just a little while from now, and we'll see how it goes and how well it drives incrementality to GMV. So the simple answer is we expect more GMV, hopefully, more transactions per active user should not expect deterioration in unit economics.\n\nOperator\n\nThanks. Our next question is coming from Rob Wildhack from Autonomous. Your line is now live.\n\nRob Wildhack -- Autonomous Research -- Analyst\n\nHi, guys.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nHi.\n\nRob Wildhack -- Autonomous Research -- Analyst\n\nI wanted to drill down a bit on the revenue outlook. As a percentage of volume, revenue this year was 8.7% and the midpoint of the guidance is for 7.9%. So what else besides Peloton, if anything, is moving around in there?\n\nMichael Linford -- Chief Financial Officer\n\nYeah. Peloton and, in general, the mix shift toward lower take rate products. And if you think about $1 of low-teens MDR, high -- long-term 0% being swapped in for $1 of 4% to 5% Split Pay-type MDRs, you're giving up a lot on a GMV basis in terms of total revenue. Now some of that's offset by the strong revenue profile of our interest-bearing product, although there's obviously a timing element to that as well.\n\nBut the biggest driver is just the growth in our low AOV business, which has a lower revenue take rate.\n\nRob Wildhack -- Autonomous Research -- Analyst\n\nOK. Thanks. And then on Debit+, I appreciate that it's still early but now that that's generally available, how do the unit economics there compare to the 3% to 4% revenue less transaction cost yield that you're always talking about and emphasizing? And would growth in that product have any material effect on the target for adjusted operating profit to be positive by year-end?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nThat's a great question. The short answer is too early to tell. The reason we excluded the forecast is because that's literally what I've been spending a lot of my personal time on. And I'm not prepared to declare it to be ready to be given to everyone.\n\nWe have 14 million active users that are very excited about this product. It's clear that they're transacting a lot more. If you drill down in that, you'll see the metrics that there's quite a lot of pay now transactions. Those obviously have a very different revenue profile.\n\nThere's not a lot of risk in there at all. And that's obviously a natural drag on probably less transaction cost, if you start to think of it that way. On the flip side, we see quite a lot more loan volume, which is great, and we're excited about the incremental usage that we get in the credit that we provide there. Again, our goals are very clear.\n\nWe very much like our unit economics. We intend to protect them. We are not going to compromise them. The risk associated with these transactions is new to us.\n\nWe're still optimizing exactly, for example, what sort of insufficient funds rate we'll see as the transactions flow through to checking accounts? That's why we haven't pushed it all the way through to the general population. It is available but we have really not promoted very hard. So I think I've given just enough data before --\n\nMichael Linford -- Chief Financial Officer\n\nYeah. And the thing I would -- maybe to put it in context, the revenue models for the Debit+ product will be unregulated today – unregulated debit interchange, which obviously you're not making 3% to 4% when your gross is down there. And then interest-bearing, I'll just note that some of our strongest and most profitable programs are direct-to-consumer interest-bearing products. We feel really good about that side of the house.\n\nAnd obviously, you'll see some lower total growth and net take rates, revenue take rates and RLTC take rates on the pay now or debit transactions that happen on the card. We've not given any guidance because as Max said, it's a bit too early, but you would expect it to be lower. That being said, our direct-to-consumer product is much higher than that. And so we haven't given guidance and not going to today, but we feel really good about where we're getting to once we are at scale.\n\nOperator\n\nThank you. Next question is coming from Reggie Smith from J.P. Morgan. Your line is now live.\n\nReggie Smith -- JPMorgan Chase and Company -- Analyst\n\nThank you for taking the questions guys. Two quick ones. The first, I guess you kind of signaled that you saw some deterioration. And I was curious if that was something that you saw in the calendar second quarter.\n\nOr is it more something that you were seeing in this particular quarter? Recognize that you're almost two months into the quarter. And the second part of that question. Just curious what some of the, I guess, leading indicators you guys are looking at. I can certainly appreciate you have more insight than maybe the traditional credit card guys.\n\nIs it slower payment? Is it the balances and the associated checking accounts? Like what kind of data are you guys pulling from? Obviously recognize that you don't want to give away your secret sauce. So whatever you could share there would be helpful.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nWe'll give away a little bit of the secret sauce, and hopefully, it does not help my competitors too much. So one really interesting -- actually, to answer the -- probably the more kind of a relevant part of the question, we've been anticipating some form of stress since as early as January. So we have been keeping our eyes very, very open and have been optimizing credit and credit performance all throughout the calendar year. So this is not a new thing at all.\n\nThe, call it, April and May is when we started taking a harder look at things just on a sort of –- it's basically spending more time on the analytics. So I think the overall behavior of our credit and risk teams has really not changed in the last, what, our months were in nine. But just the level of intensity we've been applying to the research side of it has increased and increased and increased. And the more we look, the more we find, and we have been finding pockets of interesting things that we care to correct before they metastasize to something greater.\n\nSo one anecdote that I was going to share is there's a really interesting -- as much as Michael just pointed out, growing a straight line from DQ 30 into the ultimate charge-off is a bad idea, in my opinion, because there's a lot of opportunities to cure, there's a lot of tools we have. There's everything from loan modifications to collection strategies. That said, when you look at early delinquencies and how the flow rates change is a really good predictor of at least one kind of behavior. Consumers who basically say, look, I'm kind of short right now, but I'll make good on it a little bit later than I was supposed to.\n\nAnd that's enough of a canary in a coal mine where if you look at it everywhere, you probably won't nice it because most consumers are still just fine. But if you look in the pocket, you might expect that sort of thing, you can start spotting these sort of things. And at scale, it typically means job losses. We're obviously not there yet, and hopefully, it won't get too far.\n\nBut before that that's actually a reflection of consumer sentiment about their potential for job loss, which is a second-order metric but we care a lot of those.\n\nReggie Smith -- JPMorgan Chase and Company -- Analyst\n\nGot it. And then if I can get one more follow-up. And you have the slide where you show delinquency trends by, I think, cohort. I believe that's for your held portfolio.\n\nCan you talk to, I guess, what the trends look like for the entire platform portfolio? Is it consistent with that or any differences worth calling out between the two?\n\nMichael Linford -- Chief Financial Officer\n\nYeah. If you're referring to the churn we have in our earnings supplement that's titled Delinquency Performance, that's total portfolio excluding Split Pay. We exclude that because there's a bunch of goofy stuff that happens with the denominator. And that's a target we've been chatting through today, but that takes a look at the total platform portfolio.\n\nAnd we manage credit and look at credit metrics. We never distinguish between on and off except for when we go to the financial statements. The actual credit measures are always on portfolio-wise. And there, you can see the trend we were talking about earlier where you saw the seasonal growth.\n\nIt's a pretty normal thing to see sequential increases going to late summer months as you have seasonally low period coming off of the tax season. And so that's what it looks like overall. Again, I think we feel very strong about where credit sits today. We feel very good about our ability to manage the small levels of stress that we have seen and are very optimistic and confident in our ability to do so through the rest of the fiscal year.\n\nOperator\n\nThank you. Our next question is coming from Michael Ng from Goldman Sachs. Your line is now live.\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nGreat. Good afternoon. Thank you very much for the question. I was just wondering if you could provide a little bit more color around the 32% to 42% year-over-year origination volume outlook.\n\nIs there anything you can talk about as it relates to how each of the segments or products will grow relative to that consolidated growth rate? And is there anything that you could potentially talk about as it relates to categories, whether it's faster or slower than that consolidated growth rate? Thanks.\n\nMichael Linford -- Chief Financial Officer\n\nYeah. Just to recap again, I do think we would expect our sporting good nature of business to show some headwind. It was the only category that declined last quarter. We would continue to expect that to be a drag.\n\nWe estimate that single partner to be 4% June be a headwind alone. The second thing I'd say is in Q2 of last year, we launched to general availability with Amazon. And we also went GA in late Q1, early Q2 for Shopify. And as you start to lap those, you are going to see, for the category that they're over indexed in, some compression.\n\nSo for example, general merchandise will have lower growth rates. However, it's from a very, very, very high growth rate base because the base gets bigger but the dollars of growth are still very impressive there. And just for a second, to be really clear on what it's not, the guidance for GMV is not reflective of the view that we have around consumer demand for our product. We're still seeing healthy application levels.\n\nAs I mentioned before, our approval rates are actually up, so both the demand and our ability to underwrite. It's also not a function of any shift away from or falling out of favor of the category. We continue to see our payment method as being more important to merchants than it was in a prior period. And lastly, it's not a function of capital constraints.\n\nAnd so our outlook really is about the one or two pieces of acute headwind. And then we're lapping some really gotti numbers. We feel really good about the underlying absolute value of the business and feel really good about our path to continue to build a really big network at scale.\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nGreat. Thank you, Michael. And just as a follow-up. Sorry, I know this came up earlier on the call, but could you just talk a little bit more about the trajectory of revenue less transaction margins throughout the year? I know you said there was going to be a valley in the fiscal second quarter.\n\nIs that a function of the holiday and mix? Is that more Split Pay? Any color there would be helpful. Thank you.\n\nMichael Linford -- Chief Financial Officer\n\nYeah. So you have our guide for Q1 and then what you'll expect to see in Q2 is originations spiking, lots of originations later in the quarter. And when that happens, it's just the way things flow through the P&L is that you end up with lower revenue and RLTC rates in the quarter. And then the back half of the year, you kind of realize some of the benefit of originations that happened earlier in the year.\n\nAnd we just had the same trend to play out, albeit slightly more muted because, again, I think the explosive growth that we had in Q2 won't be repeated but the shape should look very similarly. And so you have our guide for Q1. Think about Q2 as being lower on a vertical basis, although again, we feel really good about the economic content that we'll be originating in that quarter such that the back half of the year will be improving from there.\n\nOperator\n\nThank you. Our next question is coming from Andrew Jeffrey from Truist Securities. Your line is now live.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nHi, I appreciate you taking the question here. Max, when I look at the very impressive customer and merchant growth metrics you put up, and I juxtapose those with the very high recurring transactions you're getting, the recurring rate from your existing customers, 85%, I think, how do we think about monetizing all this new potential, both merchants and customers, that you brought on? It strikes me that for Affirm to be really successful in the long run, you've got to really spread out monetization. So how do we think about that in the long run?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nGreat question. So thematically, the way I've been thinking about overall strategy for this fiscal year and the strategy set a little bit earlier than in the year. So we think about it for a while but this is the year we're going to execute on it. This is really the year of the consumer.\n\nLast year, we were lucky, proud, successful enough to bring on over half of e-commerce volumes onto the platform. We launched to general availability on a whole bunch of platforms and having able to scale with them. And it's showing up in the network effects. You see transaction usage growing, transaction per consumers.\n\nIt's also the year, we brought on a whole lot of new consumers so the denominator has grown and the numerator outpaced it. And so it's all goodness in terms of bringing on new users on to the network. And this year, we're really going to invest in just making this the very best product for the end consumer in every imaginable way. And I'll definitely spend lots of time on talking about this at our product road map event sometime toward the end of the calendar year.\n\nBut just if you scan the things that we bragged about in the -- in my recorded section, rewards, I think, is going to really move the needle not just in terms of consumer satisfaction but also will make it a very compelling promotional platform for merchants. And we expect to find good monetization there. Brand-sponsored promotions is something that we've proven to work almost manually, if you will, in some of our largest big-box partners. We're really going to put it on a conveyor belt by creating a self-service console for that and integrating in a bunch of places.\n\nWe have, obviously, Debit+ is something that I am personally very passionate about. I have fantastic customer stories. Now, when I say customer here I mean consumer, but I literally had to chat with a person who went to Colombia, the country on vacation with a –- exactly one card in his wallet, Debit+. And in the early beta, it did not work internationally.\n\nSo we had to scramble a solution for him. But it's something that I really think is just a fantastic way of increasing transactions. Obviously, 2.7 transactions per week is a massive, massive opportunity to create more value for consumers. Every one of these transactions is two sided.\n\nThere's always a merchant on the other side, and they are excited about the incremental conversion, incremental volume that we're bringing on. Frankly, there are huge opportunities in demand discovery and demand generation, which we're just scratching the surface if you go into the Affirm app, you'll find we've made a lot of really interesting improvements in item level search. There's some really clever promotions around specific items. One really good metric north of 50% of our own and operated service originated transactions basically Affirm Anywhere.\n\nAnd now Debit+ transactions begin in a search box, which is kind of an interesting stats that should tell you opportunities there to monetize are pretty enormous. There's a small company in Mountain View, that's figured out how to make money on capture consumer demand from search. So we have lots of really, really exciting things planned for the consumer for this year. And I hope to brag about them on the next call, but I'll stop now because I'm taking up your time because Michael's gotten so many really good questions, but yes, we have a lot planned on the consumer side for sure.\n\nAnd every one of these things is an opportunity to increase our margins.\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nOK. And then just as a follow-up, can you just speak to Affirm's competitive position? You've had some new entrances in the market that have grown really fast. What convinces you that Affirm is the long-term winner?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nI think on at least the unit basis, we're seeing more competitors, if not exit the market, then fall away in terms of their competitive position. I think the – if you look at the North American footprint, I would argue we've established our dominance over the last fiscal year, quite decisively. Presumably, you're talking about my baby number one relative to the current baby. PayPal entering the business generally did not have an impact that we could discern in our ability to close merchants or our ability to convince consumers that we have a great product.\n\nI think the audience that PayPal serves is a little bit like me, kind of an aging Gen X are a couple of kids and a dog and Affirm serves predominantly Gen Z and Millennials audience, and the two are quite different. And it's good that there are products available to everyone and we're excited to overall see the shift from credit cards and cash to buy now, pay later. So for the moment, because the segment is so under penetrated, we're not really feeling any competitive pressures. I'm sure eventually it'll come to an end, but for the moment we're still single digit of U.S.\n\ne-commerce. And my point of view, the single most exciting thing, not single, there's a lot of exciting things is actually unfair. But one of the most exciting things that we're seeing right now is Debit+ being 50-50 online/offline, there's just a complete greenfield of offline transactions that no one's really figured out. And we think we have something really special there.\n\nOperator\n\nThank you. Our next question is coming from Chris Brendler from D.A. Davidson. Your line is now live.\n\nChris Brendler -- D.A. Davidson -- Analyst\n\nAll right. Thanks for taking the question. I'd love to hear –- I appreciate your guidance didn't include sort of a deceleration and consumer activity in this space. But I'd love to hear if you have any sort of recent color on consumer demand for buy now, pay later even in the inflationary environment.\n\nAre we seeing more folks shift to this product because to make ends meet? Are we seeing more folks shift to the Split Pay product to avoid some of the longer term, the bigger purchases? Any color there would be great on just consumer behavior recently?\n\nMax Levchin -- Founder and Chief Executive Officer\n\nI'll start and Michael has a kind of it's sort of a different. So short answer is no, we are seeing if anything increase demand on the consumer side, which is exactly as we expected it primarily because inflation takes away spending capacity and you borrow to increase it. So I think in terms of need more credit that has been pointing north as inflation became more and more of a thing. We do see secondary effects of inflation.\n\nSome folks choose not to buy because the prices relative to their earning capacity are higher. And so they are thinking longer, they are buying a little bit less, but I don't think that impacts buy now, pay later if anything, that accretes to buy now, pay later in other forms of credit too. In terms of shift to shorter and longer term, that's a really, really good and important question. There's a lot of that that we control in the sense that the consumer sees at least three, sometimes four different term lengths that we offer for every transaction, depending on what the consumer looks for.\n\nAnd we've now gotten quite good with it, have to check out optimizing for the right collection of offerings that consumer can decide quite differently. Folks that are buying something that is pretty short term or sorry, pretty low AOV tend to select short term because those transactions we can generally speaking do on no interest at all. And so it really is a free loan, and it's pretty great if you can get it because just for use of money. It flips pretty dramatically when you are looking at an item that is factually outside of your personal cash position or personal cash flow, it then becomes a matter of monthly cash flow impact.\n\nAnd so at that point, consumers tend to choose the longest term possible because that lowers their overall cash exposure on a monthly basis that obviously increases our risk, increases the number of opportunities that consumer has to go delinquent or default. And as a result, we manage our risk by being judicious about just how long we're willing to take this term out to for a transaction. So we have as much to say about these terms as the consumer does, if not more, but there's definitely some differentiated behavior. The one thing that I can tell you we're quite right about, 0% APR transactions are that much more exciting in an inflationary environment because borrowing money is becoming expensive things to the Fed and buying things is more expensive things to inflation.\n\nSo if you can figure a transaction that has no interest at all, it's pretty great.\n\nMichael Linford -- Chief Financial Officer\n\nYeah. The only thing to add to that, if you look at the transaction counts, it's a really good measure for what's going on our consumers wanting to use this product more, because so many of the other things are functions of puts and takes on merchant relationships, product types and everything else. But the actual transaction count growth is huge. We grew transactions last quarter 139%, but the biggest piece of growth in the business is hitting more transactions in the platform.\n\nAnd yes, we're proud that 85% came from repeat users, but the total gross number of transactions is a really good measure of just how much there. And it's sequentially up a lot too. It wasn't just up year-over-year. We were up sequentially from Q3 quite a bit and across a really wide set of categories.\n\nThis past quarter saw our travel ticketing business really dominate the –- I think with people a little over 12% of GMV that quarter and that just shows you that this is not a single use product. They're not for us anyway. It's not about beauty or t-shirts on Shopify. It's about everything that they're buying and you saw that last quarter.\n\nChris Brendler -- D.A. Davidson -- Analyst\n\nI hope the transactions per active customer also ticked up pretty meaningfully sequentially as well. Last one real quick, your Australian listed or formerly Australian listed competitors may not have seen such strong results recently. And you mentioned M&A, I imagine there's a lot of concern of the smaller players and I think setting capital and seeing growth slow. Maybe just talk a little bit, if you can give a little color on your M&A appetite? Thanks so much.\n\nMax Levchin -- Founder and Chief Executive Officer\n\n[Inaudible] but I got a fantastic piece of advice when I asked a friendly investor, how to think about M&A to ask yourself, would this be asset best off if it's owned by a firm? And obviously, there's some limit to sort of, we think we can manage anything, but there are definitely things that are very accretive to the business. If we can find something in the space or near the space that is better off owned by us and operated by us, I think we will take it very seriously now that the prices have normalized. And we do have a very clear road to profitability and have a – quite a significant cash position. Maybe slightly more technical way of thinking about what we're looking for.\n\nThere's a bunch of really good ideas in this space, buy now, pay later is this really wide surface. I call it honest finance because I'm an idealist. I think you can think of it as a non-revolving credit. There's 10 different ways of calling it, but this idea that it's too confusing to borrow money, and yet credit is really important, is it, you know is a simple idea, but it seems that its time has finally come.\n\nIt's actually really, really hard to do. And the hard part comes from all sorts of things like underwriting is really, really difficult. We have a lot of exceedingly smart people like, I think I'm surrounded by pretty clever people. And then I feel like I'm more on every time I talk to a credit team because they're really, really smart and good at what they do.\n\nAnd it's hard to hire that team and it's really hard to scale it and it's hard to get it to be functioning. And so there are plenty of smart entrepreneurs with really good ideas that built a really cool mouse trap, but they're just not that good at underwriting and scale really allows you to hire even more of those people and train them on real data. And a decade of operating gives you a lot of really interesting use cases that you just wouldn't have seen if you're small. And so we're looking for businesses that had amazing entrepreneurs, amazing ideas, amazing first signs of traction that would really benefit from being put on a platform that has exceptional underwriting, exceptional capital markets reach at this point, very, very large user base, very large merchant base.\n\nSo there's –- we think lots of opportunity will be very judicious will be extremely good stewards of shareholder capital, not a thing we're going to execute imminently. But we're looking just because the market has now reduced some of the inflated violations.\n\nOperator\n\nThank you. We reached end of our question-and-answer session. I'd like to turn the floor back over to management for any further or closing comment.\n\nMax Levchin -- Founder and Chief Executive Officer\n\nThank you everybody for joining the call. We'll see you next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nRob O'Hare -- Senior Vice President, Finance\n\nMax Levchin -- Founder and Chief Executive Officer\n\nMichael Linford -- Chief Financial Officer\n\nRamsey El-Assal -- Barclays -- Analyst\n\nDan Perlin -- RBC Capital Markets -- Analyst\n\nJames Faucette -- Morgan Stanley -- Analyst\n\nJason Kupferberg -- Bank of America Merrill Lynch -- Analyst\n\nMoshe Orenbuch -- Credit Suisse -- Analyst\n\nRob Wildhack -- Autonomous Research -- Analyst\n\nReggie Smith -- JPMorgan Chase and Company -- Analyst\n\nMichael Ng -- Goldman Sachs -- Analyst\n\nAndrew Jeffrey -- Truist Securities -- Analyst\n\nChris Brendler -- D.A. Davidson -- Analyst\n\nMore AFRM analysis\n\nAll earnings call transcripts"
}