{
  "companyName": "Amazon",
  "companyTicker": "AMZN",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/27/amazon-amzn-q3-2022-earnings-call-transcript/",
  "content": "Amazon (AMZN -0.21%)\nQ3 2022 Earnings Call\nOct 27, 2022, 5:30 p.m. ET\n\nOperator\n\nThank you for standing by. Good day, everyone, and welcome to the Amazon.com Q3 2022 financial results teleconference. [Operator instructions] Today's call is being recorded. For opening remarks, I will be turning the call over to the vice president of investor relations, Dave Fildes.\n\nThank you, sir. Please go ahead.\n\nDave Fildes -- Vice President, Investor Relations\n\nHello, and welcome to our Q3 2022 financial results conference call. Joining us today to answer your questions is Brian Olsavsky, our CFO. As you listen to today's conference call, we encourage you to have our press release in front of you, which includes our financial results, as well as metrics and commentary on the quarter. Please note, unless otherwise stated, all comparisons in this call will be against our results for the comparable period of 2021.\n\nOur comments and responses to your questions reflect management's view as of today, October 27, 2022, only and will include forward-looking statements. Actual results may differ materially. Additional information about factors that could potentially impact our financial results is included in today's press release and our filings with the SEC, including our most recent annual report on Form 10-K and subsequent filings. During this call, we may discuss certain non-GAAP financial measures in our press release, slides accompanying this webcast and our filings with the SEC, each of which is posted on our IR website.\n\nYou will find additional disclosures regarding these non-GAAP measures, including reconciliations of these measures with comparable GAAP measures. Our guidance incorporates the order trends that we've seen to date and what we believe today to be appropriate assumptions. Our results are inherently unpredictable and may be materially affected by many factors, including uncertainty regarding the impacts of the COVID-19 pandemic, fluctuations in foreign exchange rates, changes in global economic and geopolitical conditions, and customer demand and spending, including the impact of recessionary fears, inflation, interest rates, regional labor market, and global supply chain constraints, world events, the rate of growth of the Internet, online commerce and cloud services and the various factors detailed in our filings with the SEC. This guidance also reflects our estimates to date regarding the impact of the COVID-19 pandemic on our operations, including those discussed in our filings with the SEC.\n\nOur guidance also assumes, among other things, that we don't conclude any additional business acquisitions, restructurings or legal settlements. It's not possible to accurately predict demand for our goods and services, and therefore, our actual results could differ materially from our guidance. And now I'll turn the call over to Brian.\n\nBrian Olsavsky -- Chief Financial Officer\n\nThank you for joining today's call. Before we move to questions, I will make some comments about our Q3 performance and the outlook for Q4. For the third quarter, worldwide net sales were $127.1 billion, representing an increase of 19% year over year, excluding approximately 460 basis points of unfavorable impact from changes in foreign exchange rates. As the dollar continued to strengthen during the quarter, the foreign exchange impact was higher than the 390 basis point impact we had incorporated into our Q3 guidance.\n\nThis represents a headwind of approximately $900 million, more than we initially guided to. Throughout the quarter, our worldwide stores business continued to stay highly focused on our customers and driving the inputs that matter most, which helped to accelerate sales growth in the quarter. We now offer our widest selection ever. We've taken actions that have driven strong recovery of in-stock rates, and we continue to work on improving delivery speeds, all while ensuring our pricing remains sharp for our customers.\n\nThird-party sellers and the products they offer remain an important strength of our offering for consumers, representing 58% of total paid units sold in Q3, the highest percentage ever. It's up from 56% in Q3 of last year. And we're working with these partners, most of whom are small- and medium-sized businesses, to build an even stronger offering. We recently hosted Amazon Accelerate, our U.S.\n\nconference for selling partners, where we introduced new tools, including new email marketing capabilities, free-to-use shipping software that offers discounted shipping rates and new features and analytics to help sellers better understand and act on conversion-driving content. This was a big quarter for Prime members. We celebrated our eighth Prime Day in July, which contributed approximately 400 basis points to our Q3 year-over-year sales growth rate. Prime members purchased more than 300 million items worldwide, making it the biggest Prime Day net sales event in Amazon's history.\n\nAs a reminder, Prime Day occurred in the second quarter of 2021. We also debuted the two largest Prime Video releases ever. The Lord of the Rings: The Rings of Power attracted more than 25 million global viewers on its first day. And in the first two months since its launch, Rings of Power has driven more Prime sign-ups globally than any other Amazon Original.\n\nNFL Thursday Night Football also premiered in September, averaging more than 15 million viewers during its first broadcast, and driving the three biggest hours of U.S. Prime sign-ups in the history of Amazon. Our next broadcast, the seventh of the 15-game schedule, kicks off in a few hours, with the Ravens visiting the Buccaneers. We also saw good growth in our advertising offerings where sales grew 30% year over year, excluding the impact of foreign exchange as vendors and sellers have embraced our portfolio of products, which allow advertisers to build general awareness and/or drive sales of a specific product.\n\nIn AWS, net sales increased to $20.5 billion in Q3, up 28% year over year, excluding the impact of foreign exchange, and now representing an annualized sales run rate of $82 billion. With the ongoing macroeconomic uncertainties, we've seen an uptick in AWS customers focused on controlling costs. And we're proactively working to help customers cost optimize, just as we've done throughout AWS' history, especially in periods of economic uncertainty. The breadth and depth of our service offerings enable us to help them do things like move storage to lower-priced tiers options and shift workloads to our Graviton chips.\n\nGraviton3 processors delivered 40% better price performance than comparable x86-based instances. And our teams across AWS continue to work relentlessly to expand that breadth and depth, including recent launches of new EC2 machine learning training instances in AWS IoT fleet-wise. And we continue to expand the AWS infrastructure footprint to support customers with the launch of the AWS Middle East region in August and the recent announcement to launch AWS Asia Pacific region in Thailand. Now let's shift to operating income.\n\nDuring the quarter, we reported $2.5 billion in operating income. Turning first to our North America and international segments, during the quarter, we generated over $1 billion in operations cost improvements driven by higher leverage of our fixed cost base and continued productivity improvements in our fulfillment and transportation networks. This represents a solid improvement in productivity quarter over quarter, though not quite as much as we had planned. We are encouraged by the progress made during the quarter, but we recognize there's still a lot of opportunity to continue to improve productivity and drive cost efficiencies throughout our networks.\n\nWe have identified initiatives that the teams continue to work hard on, and we expect to see further improvement in the quarters ahead. Another impact to operating income was the step-up in Prime Video content and marketing costs in Q3, primarily driven by the global premiere of the Rings of Power and the launch of the NFL Thursday Night Football package in the United States. Our results were also negatively impacted by nonrecurring charges related to the closure of certain businesses and products such as Amazon Care, Fabric.com and Amazon Explore. We continue to ramp up our investments in AWS, adding product builders and sales and professional services headcount to help customers save money, invent more quickly in their businesses and transition to the cloud.\n\nWe're also continuing to invest in new infrastructure to meet capacity needs, expanding to new geographic regions, developing new services and iterating quickly to enhance existing services. Overall stock-based compensation expense was $5.6 billion in Q3, up from $5.2 billion in the second quarter. This increase was primarily driven by a reduction in the estimated forfeiture rate on certain unvested stock awards. We reported overall net income of $2.9 billion in the third quarter.\n\nWhile we primarily focus our comments on operating income, I'd point out that this net income includes a pre-tax valuation gain of $1.1 billion included in nonoperating income from the common stock investment in Rivian Automotive. As we've noted in recent quarters, the impact of this investment to our income statement is driven by quarter-to-quarter fluctuations in Rivian's stock price. Now let's discuss capital investments, which is the combination of capex plus equipment finance leases. For the full year 2022, we expect to incur approximately $60 billion in capital investments, which is broadly in line with what we spent in 2021.\n\nThis represents an estimated reduction in fulfillment and transportation capital investments of approximately $10 billion compared to last year as we've continued to moderate our build expectations to better align with demand. And this is offset by an approximately $10 billion year-over-year increase in technology infrastructure, primarily to support the rapid growth, innovation and continued expansion of our AWS footprint. We also provided our fourth quarter financial guidance as part of our earnings release. While we are encouraged by our progress across the business, macroeconomic environment remains challenging worldwide.\n\nThe continuing impacts of broad-scale inflation, heightened fuel prices and rising energy costs have impacted our sales growth as consumers assess their purchasing power and organizations of all sizes evaluate their technology and advertising spend. As the third quarter progressed, we saw moderating sales growth across many of our businesses, as well as the increased foreign currency headwinds I mentioned earlier, and we expect these impacts to persist throughout the fourth quarter. As we've done at similar times in our history, we're also taking actions to tighten our belt, including pausing hiring in certain businesses and winding down products and services where we believe our resources are better spent elsewhere. We aim to strike the right balance between investing for our customers for the long term while driving operational efficiency improvements and accomplishing more with less.\n\nWhen faced with an uncertain economy or some kind of discontinuous event, customers tend to double-down on companies that they believe have the best customer experience and that take care of them the best. And that is where our efforts remain focused. As we head into the fourth quarter, we are ready to make this a great holiday season for our customers. We kicked off the season a few weeks ago with our first-ever Prime Early Access sales event where tens of millions of Prime members shopped and ordered more than 100 million items from Amazon's selling partners.\n\nWe remain heads-down focused on driving a fantastic customer experience, and we believe putting customers first is the only reliable way to create lasting value for shareholders. Thanks. And with that, let's move on to your questions.\n\nOperator\n\n[Operator instructions] Our first question comes from the line of Eric Sheridan with Goldman Sachs. Please proceed with your question.\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nThanks for taking the question. Brian, maybe I'll just ask a two-parter with respect to the revenue guide for Q4. Can you help us better understand some of the comments you made around the exit velocity, specifically with respect to the U.S. e-commerce business or the AWS business and how that might inform some of the lower-than-seasonal trends that seem to be implied in the Q4 guide, specifically with respect to either optimizations on the AWS side or changes in consumption behavior on the U.S.\n\ne-commerce side?\n\nBrian Olsavsky -- Chief Financial Officer\n\nSure thing, Eric. Thanks for your question. As I look ahead to guidance for Q4, I think the biggest individual factor is still going to be foreign exchange. This guidance includes 460 basis points of unfavorable impact year over year.\n\nFX is a bigger issue for us on our revenue growth in dollars than it is on our income. It actually has a slight favorability due to the investments we're making internationally. But put that aside for a moment. What we saw in Q3 was a really strong July with a great reaction to Prime Day globally.\n\nAnd the resumption of things like in-stock rates are starting to come back, and delivery speed was coming back. And that continued through the quarter, but growth rates started to slow a bit. And primarily in the consumer stores business, it was in international. North America, obviously, it was strong, but it started to slow a bit.\n\nBut it was mostly in international where we saw the biggest impact, and we think that is tied to a tougher recessionary environment there. Compared to the U.S., it's worse in Europe right now. The Ukraine war and the energy crisis issues have really compounded in that geography. But when I talk about enterprise customers in AWS, yes, we've been working with customers to lower their bills.\n\nJust like all companies, they want to lower their spend when they're faced with uncertainty in the market. I would say one that's real valuable points about cloud computing is that it's turning fixed cost into variable for many of our customers, and we help them save money either through alternative services or Graviton3 chips. There's many ways that we have to help them lower their spending and still get great cost performance ratios. So what we're really excited about the business, both in the long term and even in the short run, you noticed we've added $4.5 billion to the $16 billion base we had of revenue last Q3, so the business is growing in absolute dollars at a really good clip.\n\nWe do see some of the consumers are cutting their budgets and trying to save money in the short run. I would say that although we had a 28% growth rate for the quarter for AWS, the back end of the quarter, we were more in the mid-20% growth rate. So we've carried that forecast through to the fourth quarter. We're not sure how it's going to play out, but that's generally our assumption.\n\nWe're excited about the re:Invent conference that's coming up in late November. We expect to have over 40,000 people in Las Vegas and many more tuning in virtually. So continue to drive value for customers with new products, new services and, lately also, additional ways for them to manage their budgets and optimize in what is shaping up as a tough economy.\n\nOperator\n\nThank you. Our next question is from Doug Anmuth with J.P. Morgan. Please proceed with your question.\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nGreat. Thanks for taking the question. Brian, free cash flow generation has always been Amazon's focus in the past, but that went negative last year and likely this year as well. Can you just talk about the path to restoring meaningful free cash flow? And do you think that capex tied to data centers and the AWS ramp can ultimately step back, similar to what we've seen recently with fulfillment and transport?\n\nBrian Olsavsky -- Chief Financial Officer\n\nYes. I think if you look at our free cash flow, there's multiple factors here. One is the drop-off in income for the trailing 12 months versus the 12 months before it, and a lot of that is driven to things that we've talked about on these calls. Ops cost, our network doubled over the last two and a half years.\n\nWhile we're making strides in productivity and network optimization, we still have work to do there. So we have to get our cost structure back to pre-pandemic levels in a lot of areas of the company and mostly in operations. There's a unique thing going on with inventory right now because we have a lot of weeks of cover mainly due to supply chain issues coming out of Asia primarily and we're seeing with our sellers, too. We just have additional weeks of cover.\n\nWe think our model reacts quickly to customer demand. This is more about the other side of the equation, the supply chain and having more in stock. So what the issue there is that we generally have a favorable working capital impact from accounts payable that is more days than our inventory. That's been flipping the last year, and we expect that to normalize as we move into 2023.\n\nAnd then, capex is a big driver. We had, again, a doubling of the network, had very high capex the last two years. You'll see that we've lowered capex year over year. We probably cut about one-third of our budget from what we originally thought for 2022 while still focusing our capital dollars really on the AWS business and increasing customer demand or capacity for increasing customer demand in our stores business.\n\nSo we're working hard on all those dimensions. And we expect, as we see a recovery in income generation, normalization of the inventory versus accounts payable cycle and efficiency in our capex spend, we intend to flip those numbers around.\n\nOperator\n\nAnd our next question comes from the line of Mark Mahaney with Evercore. Please proceed with your question.\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nLet me ask two profit questions. AWS margins were a little lower than we would have thought. Is that just a reflection of the full quarter impact of that kind of stock-based compensation granted to those employees earlier in the year? Is that the new normal for AWS margins? And then international losses also were a little bit heavier than we thought, just talk about what drove those losses. And is that also the new normal for that segment?\n\nBrian Olsavsky -- Chief Financial Officer\n\nSure. Let me start with AWS. So we did see a deceleration or a drop in op margin sequentially quarter over quarter. The broad disclaimer on AWS margins is that they will fluctuate over time as we balance investments versus renegotiating pricing with the long-term customer commitments, all as headwinds to the business, offset by increasing productivity and efficiencies in our data centers, which drive profitability.\n\nSo there's moving parts there. I'd say what's happening lately is, yes, the stock-based comp. We have seen inflation in our wages this year and particularly on our Czech employees is heavily concentrated in AWS. So that's one element of it.\n\nWe're also seeing energy costs that are materially higher than they had in pre-pandemic, electricity and the impact of natural gas pricing. So those prices have up more than two times over the last couple of years and contribute to about 200 basis point degradation versus two years ago. So we're fighting through some of that as well, which is a new thing for the AWS business. But we'll continue to look for ways to optimize our operations to use less energy.\n\nAnd as we scale, we'll outrun that growth trajectory. On international, international is always a mix of profitability in more established countries of Europe and Japan, offset by emerging countries and investments in Prime benefits. I think the biggest issue quarter over quarter, the increase in losses versus Q2 was tied to some additional operating costs in Europe. We've seen higher fuel costs there, even more certainly in the United States.\n\nAnd Prime Day always has lesser profitability because there's just a lot of deals. And it's a bit of margin from Prime Day in both North America and international. A big part of that is device sales. And again, we sell a lot of devices during our Prime Day events.\n\nWe don't make money on the device. We make money on the use of the device. So that always can end up hurting profitability in the quarter. So there are some contributing things.\n\nAs far as new normal, we're working very hard to make sure that current profitability is not the new normal, and we'll see how quickly we can make improvements. A lot of the improvements that I talked about on a macro level, capital efficiency, operations improvements are as important internationally as they are in North America.\n\nOperator\n\nAnd our next question comes from the line of Brent Thill with Jefferies. Please proceed with your question.\n\nBrent Thill -- Jefferies -- Analyst\n\nBrian, on AWS, I'm just curious when you talk about optimizing and efficiency, can you talk to what you're seeing from your customers why perhaps you're seeing such a big pullback in terms of near-term demand? How would you characterize those conversations? And I think the other question is related to backlog. Backlog has been running 60-plus percent, so the divergence between revenue and backlog is pretty large. Everyone's asking, how do you describe that divergence?\n\nBrian Olsavsky -- Chief Financial Officer\n\nLet me have David answer the backlog question first.\n\nDave Fildes -- Vice President, Investor Relations\n\nYes. It's Dave here. So I think our current backlog balance for Q3 is $104 billion. So it's about a little less than 60%, I think about 57% up year over year.\n\nAnd the new customer pipeline is healthy. I think with a lot of enterprises and customers, they're continuing to put plans in place. I think Brian will talk a little bit about some of the cost optimization in a second. Backlog growth, this figure, it can fluctuate quarter-to-quarter because it is, dependent on the commitments that you sign in the period and how those adjust but, yes, $104.3 billion for the end of Q3.\n\nBrian Olsavsky -- Chief Financial Officer\n\nYes. And your first question about cost optimization, first, there are some industries that have lower demand that's showing up in our volumes as probably like other companies as well, things like financial services, the mortgage business being down, cryptocurrencies being down. We're very strong in some of those industries, and that's part of it. But basically, what we see is customers are looking to save money versus their committed spend.\n\nWe have options for them to do that. They can manage workloads better. They can switch to lower-cost products that have different performance profiles. They can switch to Graviton chips that have higher cost performance ratios.\n\nSo all really good things for the customer and for Amazon long term. Again, we think the benefit of cloud computing is really showing up right now because we allow customers to turn what can normally be a fixed expense into a variable expense, and they can let us manage the highs and lows of inflation and other cost of electricity and everything else. And they can get about to do their business using our services in a very highly secure way. So I think just like in 2020, these time periods are good for long-term adoption on cloud computing.\n\nBut the offset in the short run is that some companies have demand that drops. I think what was different in 2020 was there were companies that went down and there's companies that went up quite a bit that were servicing high volumes during the pandemic. So that dynamic is not in place right now, and I think everyone is just cautious and they want to, again, watch their spend. And as CFO, I appreciate that, and we're doing the same thing here at Amazon.\n\nOperator\n\nAnd our next question comes from the line of John Blackledge with Cowen. Please proceed with your question.\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nOK, thanks. Two questions. First, could you provide some more details on the cost structure initiatives and when we could see those initiatives hitting the P&L? And then second, on the holiday season. It's a bit implicit in your guide and remarks thus far, but just curious of your expectations for consumer demand this holiday season versus last year.\n\nThank you.\n\nBrian Olsavsky -- Chief Financial Officer\n\nSure. Let me start with the holiday. So we're ready to roll. We've got the best selection we've ever had.\n\nIn-stock levels are really high. Delivery speeds are getting very close to where we want them to be. And we're ready to have a really good holiday season with our consumers this year. And the Prime Early Access sale, I think, created great value for consumers.\n\nIt allowed them to get a jump on some of their purchases for the holiday and also just find some great deals. So we're happy with that effort. And the teams that put that together worked very hard this year to hold two large Prime events within four months. So we're very optimistic about the holiday.\n\nBut we're realistic that there's various factors weighing on people's wallets, and we're not quite sure how strong holiday spending will be versus last year. And we're ready for a variety of outcomes. But we know the consumers when they're looking for good deals, and that positions us well. Advertisers are looking for effective advertising.\n\nAnd our advertising is at the point where consumers are ready to spend. So we have a lot of advantages that we feel that will help both consumers and also our partners like sellers and advertisers. So the seller in-stock is very high. We've had great in stocks from our FBA sellers.\n\nAnd so, we're ready to go. And we're very optimistic about the fourth quarter, just realistic about whether we may have a range of outcomes that we just have to be ready for when we are. On the cost structure initiatives, I think you're primarily talking about the operations world. There's three large buckets there, as I've said in the past, productivity, fixed cost leverage and inflation.\n\nOn productivity, made good strides, but there's still a lot of work to do there and we know the job ahead of us. It's hard to improve productivity much in the fourth quarter because it's just a period of like maximum stress on the operations, and we're trying to fulfill every order in a very quick way. But our goal is to leave ourselves in a really good, strong condition for a fast start on a lot of initiatives in Q1 of next year. On fixed cost leverage, we've taken steps to alter our forward plan and take capex out.\n\nA lot of the capex we spend in any given year is feeding future years' capability. And we've tightened that up. We feel good about the arc of demand versus supply that we have in our fulfillment and transportation area. Inflation is a wildcard.\n\nWe do as much as we can to save money in an inflationary environment. We've looked to make sure that our trucks are fully utilized as best we can, preventing long-zone shipments, things that like use a lot of fuel or use a lot of trucking or use a lot of shipments from other parts of the world. So we're working under the umbrella of not having it impact the customer. We're working very hard to save that.\n\nThose challenges will be there through the end of the year, and we'll be working on them definitely in the first half of next year as well. So we'll keep you posted as we have these quarterly calls on our progress and where we see opportunities.\n\nOperator\n\nAnd our final question will come from the line of Ross Sandler with Barclays. Please proceed with your question.\n\nRoss Sandler -- Barclays -- Analyst\n\nHey, guys. Just two clarifications on what you just said. So first, on retail, you did see some good efficiency gains in 3Q, and you talked about $1.5 billion. As we look forward, if those three areas you just mentioned do turn favorable, how quickly do you think you could get back to kind of historical North America retail operating margins? Is that one year, two years? Any time frame on that? And then on AWS, you said the back half of 3Q was a mid-20s run rate.\n\nOne of your prominent peers was talking about incremental macro weakness in 4Q. So could you just talk about, are you expecting the same thing in 4Q? Or are some of the price concessions you already made in 3Q kind of getting in front of that?\n\nBrian Olsavsky -- Chief Financial Officer\n\nWas that second question on AWS, Ross?\n\nRoss Sandler -- Barclays -- Analyst\n\nYes, AWS trajectory. Exactly.\n\nBrian Olsavsky -- Chief Financial Officer\n\nOK. Let me start with the efficiency. I just outlined a lot of it in the prior answer. But just to clarify, we were aiming for about $1.5 billion improvements sequentially versus Q2 and Q3.\n\nWe feel like we came up about $0.5 billion short on that. Mostly in our productivity, with the Prime Day and the preparations for the Prime Early Access event, we have been running with very high inventory levels in our warehouses. But our inventory and our sellers, as we get ready for those events, paid off in the events themselves. In-stocks have been at really high levels.\n\nBut in that environment, it's a little harder to work on. There's blockages to making improvement in productivity. There's a lot of extra work when you have space constraints. But we will continue that fight.\n\nAnd while I can't forecast into 2023 yet, and I'm not really only talking about Q4, my message is that we have work to do in 2023 that we are aware of and working on today. Dave, do you want to take that question on AWS?\n\nDave Fildes -- Vice President, Investor Relations\n\nYes, this is Dave. Ross, you were just asking around AWS. There's nothing really I'd add to what Brian had already said other than he's spoken about. We've seen the year-over-year growth rate come down as the third quarter progressed and exited in sort of the mid-20s growth rate.\n\nAnd so, that's informed how we're thinking about the guidance ranges heading into the fourth quarter, but nothing else to add on that. Thanks for joining us on the call today and for your questions. A replay will be available on our investor relations website for at least three months. We appreciate your interest in Amazon, and we look forward to talking with you again next quarter.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nDave Fildes -- Vice President, Investor Relations\n\nBrian Olsavsky -- Chief Financial Officer\n\nEric Sheridan -- Goldman Sachs -- Analyst\n\nDoug Anmuth -- J.P. Morgan -- Analyst\n\nMark Mahaney -- Evercore ISI -- Analyst\n\nBrent Thill -- Jefferies -- Analyst\n\nJohn Blackledge -- Cowen and Company -- Analyst\n\nRoss Sandler -- Barclays -- Analyst\n\nMore AMZN analysis\n\nAll earnings call transcripts"
}