{
  "companyName": "ExxonMobil",
  "companyTicker": "XOM",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/10/28/exxonmobil-xom-q3-2022-earnings-call-transcript/",
  "content": "ExxonMobil (XOM 1.01%)\nQ3 2022 Earnings Call\nOct 28, 2022, 8:30 a.m. ET\n\nOperator\n\nGood day, everyone, and welcome to this ExxonMobil Corporation third quarter 2020 earnings call. Today's call is being recorded. At this time, I'd like to turn the call over to vice president of investor relations, Ms. Jennifer Driscoll.\n\nPlease go ahead, ma'am.\n\nJennifer Driscoll -- Vice President, Investor Relations\n\nGood morning, everyone. Thanks for joining our third quarter earnings call today at our new time of 7:30 a.m. Central. I'm Jennifer Driscoll, vice president, investor relations.\n\nJoining me are Darren Woods, chairman and chief executive officer; and Kathy Mikells, senior vice president and chief financial officer.  This live presentation, our prerecorded remarks and the news release are available on the investor relations section of our website. Shortly, Darren will provide brief opening comments and reference a few slides from the prerecorded presentation. This allows us more time for questions before we conclude at 8:30 a.m. Central Time.\n\nDuring the presentation, we'll make forward-looking statements, which are subject to risks and uncertainties. We encourage you to read our cautionary statement on Slide 2. For additional information on the risks and uncertainties that apply to these comments, please refer to our most recent Form 10-Ks and 10-Qs. Please note, we also provided supplemental information at the end of our earnings slides.\n\nNow please turn to Slide 3, and I'll turn it over to Darren. \n\nDarren Woods -- Chairman and Chief Executive Officer\n\nThanks, Jennifer. Good morning, everyone. Before covering our earnings highlights, I want to begin by recognizing the men and women of ExxonMobil. While this quarter's results were clearly helped by a favorable market.\n\nFact is, we're in this position because of the hard work and commitment of our people over the past few years. Where others pulled back in the face of uncertainty and a historic slowdown, retreating and retrenching, this company moved forward, continuing to invest and build to help meet the demands we see today and position the company for long-term success in each of our businesses. We understand how important our role is in providing the energy and products the world needs. And while the market has clearly been a factor, results we report today reflect that deep commitment.\n\nI mentioned this because it is at the heart of our company and its culture. We know the role we play and are incredibly proud of it. We work together as a team, confident in our mission and determined to do our part in meeting the world's energy needs and leading the way in a thoughtful energy transition. Overall, I'm pleased with our third quarter operational and financial results.\n\nHigher natural gas realizations, strong refinery throughput, robust refining margins and rigorous cost control drove our earnings improvement. We continue to increase production to address the needs of consumers, which contributed to earnings and cash flow growth, a stronger balance sheet and significant value creation. Our results also reflected the outstanding work of our teams across the world who operate our facilities reliably at high utilization rates. Let me highlight a few examples of our progress.\n\nFirst, energy products. We boosted overall refinery throughput to its highest quarterly level since 2008, responding to tight market conditions. And we continue to make progress on the Beaumont refinery expansion, which will increase capacity by about 250,000 barrels per day in the first quarter of 2023. We also increased production from our high-return assets in the Permian and Guyana.\n\nOur production in the Permian Basin reached nearly 560,000 oil equivalent barrels per day, building on our strong growth from last year. We grew our production in Guyana to 360,000 barrels per day during the third quarter. Liza Phase 1 and 2, both exceeding design capacity. We also had continued exploration success with two additional discoveries in the quarter.\n\nEarlier this month, first LNG production was achieved from Mozambique's Coral South floating LNG development, contributing new supply amid growing demand for LNG globally. We continue to expect total upstream production of 3.7 million oil equivalent barrels per day for the year. Looking longer term, we remain on track to grow low-cost production and meet our 2027 plan, with more than 90% of our upstream investments, generating over 10% returns at $35 per barrel. Our ability to increase production while reducing cost, improves our competitive position, benefits consumers and generates capital to fund meaningful investments.\n\nDemonstrated by one of our recent press releases, announcing that our low carbon solutions business signed its first and the largest of its kind, customer contract to capture and store up to two million metric tons per year of CO2. This marks an important milestone in developing our newest business. It's also a good example of how we're supporting other companies in reducing their greenhouse gas emissions. We look forward to sharing more about our progress in developing attractive low-carbon solutions business in December as part of our corporate plan discussions.\n\nWe continue to actively manage our portfolio, announcing the sale of our interest in Aera oil production operations in California and our refinery in Billings, Montana. Proceeds from divestments completed year-to-date totaled $4 billion as we captured incremental value for these noncore assets in today's higher price environment. These sales enable us to concentrate on our higher-value advantaged assets. Finally, you may have heard earlier this month that with two decrees, the Russian government has unilaterally terminated ExxonMobil's interest in Sakhalin-1 and transferred the project to a Russian operator.\n\nIn March, we stated our intention to exit the Sakhalin-1 project and discontinue our role as operator and took an impairment of approximately $3.4 billion at the time. While our affiliate was in force majeure due to the unprecedented impact of global sanctions, we continue to make every attempt to engage in good faith discussions with the Russian government and all Sakhalin-1 partners to effect a smooth exit to the benefit of all parties. Our priority all along has been to protect employees, the environment and the integrity of operations at the facility. While the recent decrees violate our rights in Russia established by our production sharing agreement and interrupted the exit process we were working, it did not prevent us from safely winding down our operations.\n\nWe're proud of our employees and the many significant achievements they led since 1996, including the most recent challenge of the government takeover. we do not anticipate any new material costs associated with the exit. This next slide illustrates the variability the industry is experiencing across the markets most relevant to our business. In the third quarter, crude prices moved back within the upper end of the 10-year range as higher supply slightly exceeded demand.\n\nNatural gas prices rose to record levels in the third quarter, reflecting concerns in Europe about the withdrawal of Russian supply as well as efforts to build inventory ahead of winter. While natural gas prices recently moderated, they remain well above the 10-year historical range. In the U.S., prices increased by about 15%, driven by higher summer cooling demand and inventory concerns. Refining margins remained well above the 10-year range due to inflated diesel crack spreads, resulting from expensive natural gas and high demand for diesel.\n\nHigher refinery runs and flat demand for gasoline in the U.S. resulted in refining margins declining from the second quarter. In contrast, global chemical margins fell below the bottom of the 10-year range, reflecting weakening global demand. Margins in North America and Europe have softened with regional pricing moving closer to global parity as demand and logistics constraints relaxed.\n\nAsia Pacific remained in bottom-of-cycle conditions as COVID restrictions continue to suppress demand in China. Despite these challenges, our Chemical Products business delivered another solid quarter on improved product mix, strong reliability and good cost control. Before leaving this chart, I want to make one other very important point, the value of a diversified portfolio. With just the three quarters shown, you can see how the value has shifted across our different businesses.\n\nOur diversified portfolio has served us well during the volatile swings in prices and margins across the various businesses. As the energy system evolves along an uncertain path, the investments in our broad portfolio of advantaged businesses, including our Low Carbon Solutions business will play an even more important role in capturing value in outperforming competition in the very near term, and across a much longer time horizon. Before I turn it over to Jennifer, let me recap our key takeaways on the quarter. We continue to progress our advantaged investments, drove additional structural efficiencies and created sustainable solutions that deliver the energy and products everyone needs.\n\nThis has resulted in strong earnings growth, bolstered by higher refining throughput and cost control which more than offset margin declines. We've continued to strengthen our industry-leading portfolio and increased production from our high-return assets in Guyana and the Permian. In addition, earlier this month, our low carbon solutions business signed the largest of its kind customer contract to capture and store up to two million metric tons per year of CO2. This is a strong indication of the growth opportunity we have in this new business.\n\nWe've also continued to actively manage our portfolio, announcing the Aera upstream and Billings refinery divestments and closing the sales of our Romanian upstream affiliate and XTO Energy Canada. Our diversified portfolio of advantaged businesses and robust balance sheet provide a strong foundation to invest in value-accretive projects and drive attractive shareholder returns through the cycle. In aggregate, the work we are doing today is delivering critical products in a very short market. Longer term, it's delivering improvements that strengthen our structural advantages, meet society's growing needs for energy and modern products, reduce greenhouse gas emissions and double earnings and cash flow by 2027 versus 2019.\n\nIn short, profitably leading our industry toward a net zero future. Thank you.\n\nJennifer Driscoll -- Vice President, Investor Relations\n\nThank you, Darren. Before we start our Q&A session, I have two important announcements to share with you all. Please mark your calendar for our annual corporate plan update scheduled for Thursday, December 8 at 8:30 a.m. Central Standard Time, where I'll be joined by Kathy Mikells to share the details of our corporate plan.\n\nAdditionally, please keep an eye out for our 2022 advancing climate solutions report. We expect to publish it online in mid-December. With that, we'll begin our Q&A session. Please note that we will continue to ask analysts on the call to limit themselves to a single question as a courtesy to the others, so that we can take more questions from our people.\n\nHowever, please remain on the line in case we need to ask for any clarifying questions. I'll turn it back to you, Katie.\n\nOperator\n\nThank you, Ms. Driscoll. [Operator instructions] We will take our first question from Devin McDermott with Morgan Stanley.\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nGood morning. Thanks for taking my question.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nGood morning.\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nGood morning.\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nSo they're very strong results this quarter in the downstream business, and you called out throughput, volume and mix as some of the factors there. But I was wondering if you could talk a little bit more detail about some of the drivers here. And then just more broadly, there's a lot of moving pieces in the macro picture at the moment of demand, SPR draws, China reopening, the EU embargo and Russian crew, just to name a few. I was wondering if you could talk a little bit more about your outlook for refining as we head into next year as well?\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nSure. Why don't I take the first question and maybe give you the macro. So if you look overall at our energy products business, obviously, it was a really strong quarter. That was really, from our perspective, led by the volume increases we saw.\n\nSo we had record North American throughput. We had across the globe, the best results on throughput that we had seen since in 2008. And so if you look at the earnings bridge in terms of what happened quarter to quarter, that was worth almost $1 billion kind of improvement. It's a big driver in the results for energy products.\n\nIf you then look at what's going on in margins, obviously, margins softened in the quarter. They still remain well above what the 10-year average would be. If we look at those softer margins, they were really driven by downward pressure in gasoline margins due to lower-than-usual summer demand, specifically in the U.S. Diesel demand is continuing to be strong.\n\nWe then had some offsets to that pressure that we saw on margin. And specifically, if you look at some of the positive offsets we saw, we saw some favorable timing driven impacts. We try to separate this, so you can kind of see it separate it. Part of that was just mark-to-market on our open derivative portfolio, that was worth about $250 million favorable impact in the quarter.\n\nOther price timing impacts were worth about $600 million favorable impact in the quarter. That was really driven by derivatives that we use to ensure ratable pricing of refinery crude runs. So if you put that to the side, we delivered about $5 billion in earnings outside of those price timing benefits in the quarter. And in addition to the other offsets for softening refining margins, we saw very strong aromatics margins.\n\nWe did a good job on revenue management. So we saw positive benefits there. And then overall, I would say, end-to-end, supply chain optimization, right, both through procurement and logistics and trading benefits on top of that. That's really embedded in the base business.\n\nAnd so we expect to see benefits out of those areas. They're not always ratable every quarter. But if you look over time, those benefits clearly accrue to the business.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah. And I'd just add, Devin, maybe a couple of points on top of what Kathy just explained. If you step back, you'll recall that we -- in 2018, came up with a value chain concept that we're using in the downstream and really looking to optimize from crude coming in the gate all the way to products being delivered at our customer's doorstep. And the work the organization has been doing to optimize that value chain has resulted in additional value, and I think continues to make that business much more robust than what I would say the industry average is.\n\nKathy mentioned the trading, which has become an integral part of that value chain optimization step and then I would add finally that a lot of work has been going into making sure that we are positioning those facilities and our downstream in our refineries to be robust to an evolving demand landscape. And so if you look at where we are investing in refining it, it's for sites that have integrated chemicals, lubricants and fast-growing clean fuels business. And we think that gives us a structural advantage versus broader industry. This has been and always has been a thin margin business.\n\nAnd so you typically scratch through the thin low periods, which lasts for a very long time and then take advantage of some of the highs. And as a result of that thin margin business, if you look over time, certainly in the West, refining capacity has been on the decline. We actually showed a chart last quarter and again this quarter that shows that drop in refining capacity. If you look at some of the windfall taxes that are being talked about within Europe, that's going to put additional pressure on refining margins.\n\nSo there is certainly a scenario out there that says we continue to see under investment refining. We continue to see that capacity coming out of the market. And then depending on the build side of the equation and how much capacity gets built out in the Middle East, we could see tight markets for some time to come. Of course, we don't plan for that.\n\nWe plan for thin margins and very tough conditions and then hope for the best. \n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe will take our next question from Jeanine Wai with Barclays. \n\nJeanine Wai -- Barclays -- Analyst\n\nHi. Good morning, everyone. Thanks for taking our questions. \n\nDarren Woods -- Chairman and Chief Executive Officer\n\nGood morning, Jeanine. \n\nJeanine Wai -- Barclays -- Analyst\n\nGood morning, Darren. Our question and only question, that had to hear, is on the balance sheet and cash returns. So I guess gross debt to cap now is just below the target range. Cash is now at $30 billion, which is at the top end of, I believe, the $20 billion to $30 billion level that you cited before that you want to maintain over time.\n\nSo I guess what are the implications on the trajectory of the buyback? And how are you really viewing the trade-off between potentially accelerating buyback sooner rather than later, given just the mechanical synergies of the dividend and then just being more aggressive on dividend increases and there was a nice bump announced this morning to the dividend. Thank you.\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nSure. So first of all, I'd say our capital allocation priorities continue to be consistent and we're executing well against that. We've got to continue to make sure we're investing in the business. It's a long-cycle business and that consistency is really critical.\n\nWe look for accretive acquisition opportunities. We're pretty disciplined in that area. And you've obviously seen us more recently looking to execute a number of divestitures and what's been a pretty good market for that activity. We are really focused on ensuring that we've got a fortress balance sheet that gives us all the firepower and flexibility that we need to operate through the cycles and be really prepared for the next downturn.\n\nAnd then we're also really focused on ensuring that we're sharing our success with shareholders. We're trying to get that balance right. You obviously referenced the fact that we increased our quarterly dividend by $0.03, so that will be reflected in the fourth quarter dividend coming up here shortly. We're in the process of executing a $30 billion -- up to $30 billion share repurchase program through 2023.\n\nWe are on track to get $15 billion of that program done by the end of the year. We did about $10.5 billion in share repurchases through the third quarter. And if you look across the year, that would put us at $15 billion in dividends and about $15 billion in share repurchases. So I'd say both a pretty balanced return to our shareholders.\n\nAnd I think that puts us pretty well ahead of peers in terms of returning excess cash to shareholders. So we are mindful of our cash balance. We ended the quarter at about $30 billion. It is possible that our cash balance is going to float up a little bit from there depending on what the market environment continues to look like.\n\nAnd we will continue conversations with our board about the share repurchase program. But right now, we're just continuing to execute our plan.\n\nJeanine Wai -- Barclays -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nWe will take our next question from Doug Leggate with Bank of America.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Good morning, everybody. Darren, I wonder if I could just ask you and paint on kind of big picture issue. You, I think, and a number of your peers met recently with the administration relating to a number of things.\n\nI mean, I think the only folks are probably not happy with your results this morning might be well be the administration. Can you share any thoughts you had about some of the risks presented by legislators around things like export bans on products, things of that nature, not least given how strong your downstream profitability was this morning.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah. Good morning, Doug. I'm going to probably pass on trying to predict where different governments or administrations here in the U.S. are going to go with respect to policy.\n\nWe've been very explicit. I think, me, along with many of the peers in the industry around what I would say are the mechanics and the fundamentals of our industry and how it works and the implications for some of the policies being considered. And I would say that in the short term, it may solve a political problem, but it will carry all the policies that I've heard people talking about the export bans in particular, windfall profit tax. Those will carry significant long-term negative consequences.\n\nAnd it's just a question of, I think, how they balance out the political equation versus what I would say are some of those fundamentals. For me, personally, for the company, what I would say is I feel like we're well positioned. Obviously, it would be a disadvantage to the industry. But I think within that disadvantage, we would find, because of our footprint, because of our diversification, and ability to position ourselves competitively with whatever policy comes down the road.\n\nAnd so our focus is really making sure people understand what the potential consequences of some of these policies are being considered. And then in parallel with that, obviously, staying very focused on where I think the root cause or the root issue here is making sure that people all around the world and here in the U.S. get affordable and reliable energy. We recognize the pain that high prices case.\n\nUnfortunately, the market that we're in today is a function of many of the policies and some of the narrative that's floated around in the past. And we basically have been working to make sure that when needed, when the products were required, which we anticipated -- you'll recall back in 2020, we made the point that the industry is under-investing. We continue to lean in into the investments to spend at a rate higher than the rest of industry. So that when the call came, we would be there to answer.\n\nAnd I think the results you've seen here in the third quarter is exactly that. Those investments are paying off. We've grown our production, both in the upstream and are growing our production in downstream and Refining business with the expansion in Beaumont and then a real focus on reliability and high throughput. And so we keep trying to reiterate that, that we're doing what we can within the boundaries of what's available to us today.\n\nAnd then longer term, we are making the investments that's good for the administration's constituents and good for our business.\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nAppreciate your answer, Darren. Thank you.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nWe'll take our next question from Neil Mehta with Goldman Sachs.\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nThank you very much and good morning. Darren, I would love your perspective on M&A and just how you see that fitting into the go-forward framework. And specifically, around upstream consolidation but also low carbon consolidation as you've said that you want to grow that business over time to be the size of the Refining and chemicals business. Thank you.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nSure. Yeah. Good morning, Neil. As you know, we've talked about this over the years quite a bit.\n\nAnd I would tell you that the whole M&A space and divestment space is something that we are constantly working. Obviously, our strategy, which you've seen us execute here over the last several years is buy low, sell high. That's kind of what we're doing. We laid out a divestment program, but we took our time and we're patient, waiting for market conditions to develop that would favor us, as sellers.\n\nAnd that's what you've seen transacting here. Likewise, as we look at acquisitions and opportunities constantly in the market, thinking about that and looking for it. But we've got to find opportunities where we can see a clear synergy and develop a clear competitive advantage so that we bring some unique value to the transaction. And we're evaluating and looking at that in our traditional business so I think with time, those will show up, but we'll be very selective and strategic around that.\n\nAnd I would say, we'll do it when the market conditions are favorable for doing that. On the low carbon solutions, I think longer term, the concept sounds good in terms of M&A. But I would just put that in the context of this is a very immature market. And so there aren't a lot of established businesses out there today that are -- have what it takes to be successful in this space.\n\nIf you think about starting an industry from scratch and what's required in terms of policy regulation, investment, connecting all the different pieces of a brand-new value chain. That's a complicated equation and fortunately, one that we think plays to our strengths. And the recent deal that we announced with CF Industry, for us really demonstrated that in terms of the complexity of putting together each element of that value chain to successfully come up with a deal that's value accretive and it generates profits. And it's good for the planet and it's good for our shareholders.\n\nAnd so I don't know how much we'll see how that develops. I would think in the M&A space, we may, over time, see opportunities that we can uniquely leverage and then we'll bring those into the portfolio when they make sense to do that. \n\nOperator\n\nWe'll take our next question from Stephen Richardson with Evercore ISI.\n\nStephen Richardson -- Evercore ISI -- Analyst\n\nGood morning. Darren, I appreciate all the disclosure around the CF Industries project. I was wondering if you could talk about -- it probably comes as no surprise to anybody that you announced this shortly after the IRA was passed. But also, could you talk about what needs to happen on the policy side to kind of improve that abatement curve and kind of move more projects along.\n\nAnd then also I think in the prepared remarks, you mentioned that there's still some hurdles with permitting and do you see that at the local level, state level and where those might be? And then finally, if you could just address returns. How should investors think about the returns available on these projects, considering kind of policy and some of the risks around that versus some of the more conventional upstream or downstream projects? Thank you.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nSure, Justin. Yeah, I may start with the first point you made around the timing of that. While certainly, the IRA contributed to the value proposition there. I would say that, that project and that deal was being worked well before that and would work with the existing policy.\n\nIt's been enhanced with the new policy, obviously. And what I would just say with respect to what that IRA does essentially opens the aperture in terms of the CO2 that can be cost effectively captured or avoided. And if you think about the challenges associated with economic projects to capture and sequester CO2, really important variables in that would be the concentration of the CO2. The more dilute the CO2 stream, the more expensive the capturing step.\n\nAnd so you need greater incentives to catch more -- to capture more diluted streams. And so the IRA allows you more to economically pursue more diluted stream, so that opens up the opportunity space there. Another really important variable is the distance to sequestration. And the transportation cost of moving CO2 to that.\n\nAnd so the further away you are from those the sources are from the storage side, the higher the cost. And again, the IRA helps with that space. And then obviously, there's some incentives for hydrogen and additional incentives for direct air capture. So I think directionally, those things are going to help.\n\nBut I would also say that to achieve the ultimate objective in driving emissions down to net zero, you're going to need to capture a lot of diluted streams and the cost will be a lot higher. And so we're going to have to find additional incentives for that, whether it be through market forces and markets developing for CO2 or additional policy. With respect to what else has to happen, obviously, we're at the very early stages of this project where we've got the economic incentives laid out. We have a path forward but there's a lot to be done.\n\nWe've got to get permits for storing the CO2. We've got some extensions to put on the pipeline. So there's other regulatory permitting steps that we have to take and the government -- we're working with the government to make sure that we can do that effectively so that we can expedite the project to get it online and start reducing those emissions. It's the equivalent of taking 700,000 cars off the road.\n\nSo it's a fairly significant project in and of itself. From a return standpoint, what I would say is -- and we've talked about this before. We're insisting that the work we do here that we had positioned ourselves competitively versus the rest of industry and the thinking being that whatever incentives required for the marginal player out there to capture and store CO2 or develop biofuels or hydrogen that we will leverage our advantages to drive a higher return. And to make sure that the projects that we bring into the portfolio are competitive in our portfolio.\n\nAnd that's exactly what we're doing and CF Industries is an example of that, an accretive project that's competitive in our portfolio that makes us money while reducing CO2. And I would say there are more opportunities like that out there. And the thing that Dan is doing in this low carbon solutions business is looking for the opportunities where we can bring something unique to bear. And therefore, drive above-industry average returns.\n\nAnd we feel pretty good about the size of that opportunity set.\n\nStephen Richardson -- Evercore ISI -- Analyst\n\nThanks.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nWe'll take our next question from Sam Margolin with Wolfe Research.\n\nSam Margolin -- Wolfe Research -- Analyst\n\nGood morning, everyone. Thank you.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nGood morning, Sam.\n\nSam Margolin -- Wolfe Research -- Analyst\n\nMy question is about your gas realizations, which are a huge driver on the quarter. Would you characterize those as contractual or more optimization-driven? And then this is an addendum, but I think the seasonality of the gas market has changed a little bit because Europe has very high demand in the summer now because of a storage imperative. And so I wonder if you see that as a structural change to the global gas market and if it means anything for your investment prerogatives on the LNG chain or even in the U.S. within gas because we're going to be exporting a lot.\n\nSo that's the question. Thanks.\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nYeah, that's fine. I'll jump in, and Darren can add if he has anything. Overall, if you look at our results, we saw strong gas realizations, but we have an overall portfolio that's 60% gas, 40% LNG. The LNG tends to be tied to crude-related prices with a three to six-month lag.\n\nSo we're seeing the benefit of that lag now kind of coming through our results, and that really came through in the quarter. Overall, from a demand perspective, you're obviously seeing a really tight market. We saw in Europe, the building of inventory and how that has driven prices in Europe, building of inventory ahead of the winter. And so structurally, we would say there's going to continue to be a tight market until supply and demand comes into equilibrium, right, in that there's only two ways that happen, either more supply or reduced demand and supply, especially supply of LNG does take time to bring online.\n\nIt isn't something that is just a spigot that can be turned on overnight. The market is obviously responding to that. We obviously have projects that are bringing more LNG online. Darren mentioned Mozambique, the Coral project reaching first gas production.\n\nRecently, we've got Golden Pass, which is going to be coming online in 2024. So we have investments that will bring more capacity online in the industry, obviously, is responding to this, but it is going to take some time. So I'd say as we look at that seasonality, we're always mindful of what's happening in terms of inventories. And when inventories are being built or being drawn and what that means in terms of near-term market conditions.\n\nAnd so it's something we always keep an eye on.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah. I would just add, Sam. So once we get through this period where we're building inventories, we're short in supply and therefore, you've kind of lost some of that seasonality. That once we get to more of a balanced position, which I think is a couple of three years out, frankly, we'll start to see that seasonality show back up again when we're back in more stable markets.\n\nLonger term, our view on gas has always been that's going to play a critical role and world economies for quite some time. And initially, it will go into power generation and back out coal. That's one of the big benefits of gas today. But longer term, as we continue to address emissions and the energy system transitions, gas can be used for ammonia and hydrogen along with carbon capture.\n\nAnd so you can find -- you can move into what I would say, low emissions -- even lower emissions fuels and address the CO2, and I think gas is going to play an important role in that. So I think our view hasn't really changed that there's going to be a fundamental need for gas for quite some time. And we're positioning ourselves to make sure that the portfolio of projects that we developed bring on natural gas on the left-hand side of the cost of supply curve. We're going to continue to be focused on making sure that we're competitive under any scenario, price scenario that we can envision out there.\n\nSo that's how we're thinking about -- that hasn't really changed, frankly.\n\nSam Margolin -- Wolfe Research -- Analyst\n\nThanks so much.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nWe'll take our next question from Jason Gabelman with Cowen.\n\nJason Gabelman -- Cowen and Company -- Analyst\n\nThanks for taking my questions. Maybe just one quick clarification before I ask my question, which is the dividend raise you used to do, I think, with 1Q earnings the past couple of years, you've done with 3Q earnings. So is that a shift of timing or just any comments on that? And then my question is just on the chemicals outlook. As you mentioned, there has been some weakening in the market.\n\nJust wondering broadly how you see that market evolving in the next six to 12 months? Supply -- additional supply coming online, additional demand weakness or will things get tighter? Thanks.\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nYeah, I'll take the quick question on the dividend. We would have raised the dividend at the same time last year. One of the things I would mention is this is the 40th consecutive year where we've had an annual dividend increase. But we don't have a specific timing determined in any given point of the year in terms of when we make this decision.\n\nWe look at it over time. We're obviously focused on having a competitive, sustainable, growing dividend over time. We know how important it is to shareholders and roughly 40% of our shareholders are consumers, and we know those people are very much focused on the dividend.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah. On chemicals, just as you mentioned, third quarter, we talked about softer demand. I really saw that as a consequence of the COVID lockdowns in China. We're very aware of some of the impacts that COVID is continuing to have in China.\n\nNow that's going to be a big determinant of what we see happening in margins and kind of supply demand balance going out in time. It's just how well China recovers from that and how quickly they can move out of these periods of lockdown and get their current economic activity moving back again. I think as you move outside of China, which is obviously dominates demand out in Asia and move more west into the U.S. and Europe.\n\nI think Europe, obviously, with some of the energy challenges that they're facing are going to have much slower economic activity than would be historical. So I expect to see some demand impacts coming from there. And then in the U.S., I would just say it's kind of -- I would just characterize it more as uncertainty. I think some of the softness that we saw in the third quarter was driven by inventory draw for so many of our customers.\n\nAnd we typically see that when there's uncertainty about where future is going, positioning themselves for eventualities and making sure that they are covering themselves potential downside. So I think it's tough to tell. We'll have to see how the fourth quarter plays out. But in the short term, certainly, we see inventories coming down quite a bit.\n\nAnd then longer term, it will be a function of economic activity, obviously.\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nAnd then just one other thing I'd mention, we certainly see some industry supply that's coming on in the fourth quarter, and we commented on that just in terms of our look forward expectations.\n\nJason Gabelman -- Cowen and Company -- Analyst\n\nI like that.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nThanks, Jason.\n\nOperator\n\nWe'll take our next question from Biraj Borkhataria with RBC Capital Markets.\n\nBiraj Borkhataria -- RBC Capital Markets -- Analyst\n\nHi. Thanks for taking my question. I just wanted to ask about the LNG portfolio again. Could you clarify what proportion of your LNG sales are under long-term contracts and what proportion are sold on a spot basis? The reason I asked is because your assets are performing extremely well in Qatar, Papua New Guinea and Gorgon also.\n\nSo I just wondered if that has allowed you to sell some incremental spot cargo. So what proportion is under long-term contract? And if I could sneak a second one in, has there been a change to the 2022 Permian production kind of guidance in terms of growth? It looks slightly light relative to lease we had in. So I was wondering if anything has changed there. Thank you.\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nSo the commentary I had made is in our LNG portfolio, about 80% of our volumes would be under long-term contract and we're seeing the benefit of the timing lag because those contracts are typically -- the pricing is tied to crude, but it's lagged kind of three to six months. So we're seeing that benefit now coming through our realizations.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah. I would say on the Permian, one of the challenges there is over the years, what we've been doing is working really hard to make sure we're maximizing the recovery of that resource. And I think we've talked before about some of the technology that we're bringing to bear to make sure that we are doing that in the most cost-advantaged way. Obviously, as we go through that, we're optimizing and adjusting our development plans.\n\nThat continues to be the case. So I expect this year, we'll probably come in at about 20% up on last year's growth, which was up 25% from the year before. So still very solid growth in the Permian. And if you look more broadly, we expect basically to meet the objectives that we talked about at the beginning of the year on overall production.\n\nIf you look at what we had talked about at the beginning of the year for total production this year and where we'll end up, the delta there of about 100,000 barrels a day is really all driven by price entitlements and the fact that we're in much higher price environment. So we feel pretty good about the production growth that we're seeing across the portfolio. We've talked about the record production in the Permian and Guyana is obviously performing very, very well with both of those boats running at above capacity.\n\nBiraj Borkhataria -- RBC Capital Markets -- Analyst\n\nThank you.\n\nOperator\n\nWe'll take our next question from Alastair Syme with Citi.\n\nAlastair Syme -- Citi -- Analyst\n\nThank you. Kathy, can I come back to the, I think, the very first question on energy products. And if we go back to the 8-K at the close of the quarter, you sort of suggested that industry margins would be a headwind of almost $3 billion. And today, your waterfall suggests that you've only really seen half of that.\n\nSo I just want to understand, I mean, I don't recall that being ever as a big difference between new industry margins and the indicator margins and your realized market. So what does it do you think about the portfolio that's allowing you to exceed that at such a degree?\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nYeah. And our impact from, I'd say, straight up refining margins came in kind of right in the middle of the range that we provided for the 8-K. And so beyond that, I mentioned we're seeing a positive beyond refining margins and aromatics margins, overall revenue management. And then end-to-end supply chain optimization and efficiency, which would include trading profit benefits.\n\nAnd so I'd say, if you look at quarter to quarter, what we've seen in energy products. During the year, there's been a lot of volatility that's been basically tagged to the moving price environment. If you look at that over a longer period of time, say, year-to-date, it looks, I would say, pretty normalized. And then we try to give you information on things that were price timing stuff that occurred in the quarter, but over time, we would expect to be pretty neutral.\n\nAnd so I mentioned specifically the program that we have that we use derivatives to basically ensure ratable pricing of refinery crude run. Over time, we'd expect that to be neutral. You would have seen in the price timing impact that, that was about a $600 million favorable impact for the quarter. So I would say what goes on in terms of overall supply chain optimization and how we're trading around our physical footprint, doesn't come through our results ratably every quarter.\n\nThis quarter, it was obviously a lot stronger. But if you look at it over a long period of time, that benefit that's embedded in the business clearly shows through.\n\nAlastair Syme -- Citi -- Analyst\n\nDo you think going forward, in the 8-K, you would expect to be closer to that industry margin?\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nIt's really going to depend what the price environment is, what comes out of our trading portfolio the fourth quarter. Obviously, I'd say, as you also looked at the overall benefits from the business, I'd say the big positive volume factor that we had was something that wouldn't get reflected in our 8-K because we had incredibly high throughput and utilization. So what I try to tell you is if you put the price timing impacts to the side, we would start at about $5 billion in profit in energy products, and then it's going to be about what the -- how the market unfolds in the fourth quarter.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah, I would just add to that. The 8-K was really looking at what the market factors are. And then to the extent that within the business, we're working hard to improve upon that through the optimization that Kathy mentioned through revenue management across that entire value chain and then trading and trading moves and with the accounting rules as that booking happens with time, that comes in less than ratable. We saw that in this margin bucket this quarter and that will move around as we move forward depending on the price environment that we're in.\n\nAlastair Syme -- Citi -- Analyst\n\nThank you, both for the clarification.\n\nOperator\n\nWe'll take our next question from John Royall with J.P. Morgan.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nHey, guys. Good morning. Thanks for taking my question. Most of mine were asked.\n\nBut if you could just maybe talk about the status of the refinery strikes in France. I know you had a couple of facilities that were impacted there that I believe are ramping back up. Where are we now with those facilities? And when do you expect them back in full? And do you think it actually has a meaningful impact on your 4Q results for downstream?\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah. The -- so we reached an agreement with the workers some time ago and those refineries are basically going back through the start-up process. When those refineries strike, we've got to bring those units down and free them of hydrocarbon. And so that's a fairly thorough process of cleaning up the hydrocarbon -- clearing the hydrocarbon.\n\nSo in order to bring those back up, it's a fairly rigorous process of starting those back up to make sure we do that safely. So it takes some time to ramp things back up again. That's what the organization is working on. I wouldn't expect it to have a meaningful impact.\n\nI mean, obviously, in a market that's short, any capacity that comes offline raises the overall prices within the industry. And so I think net-net, that will probably -- there's some mitigation there with respect to our other refineries that are up and running. So I don't think we'll see that in the results, frankly.\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nOK. Thank you.\n\nOperator\n\nWe'll take our next question from Ryan Todd with Piper Sandler.\n\nRyan Todd -- Piper Sandler -- Analyst\n\nThanks. Maybe if I could follow up on the Permian and your activity levels there. Expectations for U.S. supply growth in 2023, I would say probably been following a little bit across the board, at least partially because of constraints across service providers.\n\nAs you look toward your 2023 program, how much do you anticipate stepping up activity levels in the Permian to achieve that program? And if the market supports it, is there appetite or interest or even ability on your part to accelerate further? So how much activity increase is based into the program? And how tight do you see the market there in terms of your ability to kind of move around that?\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah, sure. Well, I think the point you make are good ones. The market is tight. And I think generally, the industry -- there's not a lot of capacity as you look across the different steps required to bring on additional production.\n\nSo I think that is tight. That will, obviously, with time loosen up a little bit. But I think, generally speaking, for the industry is constrained. Obviously, every company will have different degrees of freedom in that space.\n\nWe have some degrees of freedom there, but I would just say we're staying very firmly grounded in our philosophy of making sure that the investments that we make generate high returns at low prices. And so the capital discipline -- my definition of capital discipline is making sure that you spend money that's advantaged and has generated good returns even in the down cycle. We're going to stay grounded in that. And so anything that we do on the margin has to, first and foremost, meet that criteria, that it's robust to a wide range of price environments, and that we'd be happy irrespective of what prices we're seeing out the window.\n\nWe've got capacity to do that, frankly, in some space. So we will -- on the margin spend money to where we can see an opportunity to bring that on. But I wouldn't say -- if you look at kind of the range of capex that we've provided over the years, we gave ourselves that range, obviously, anticipated movement not only within the year, but across from one year to the next. And so we feel pretty good that -- in terms of the ranges that we've provided.\n\nOur plans going forward are still very consistent with those ranges. And Kathy will spend more time talking about that in December when she takes you through the plan that we will get endorsed with the board next month.\n\nRyan Todd -- Piper Sandler -- Analyst\n\nThanks, Darren.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYou bet.\n\nOperator\n\nWe'll take our next question from Paul Cheng with Scotiabank.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nHi. Good morning. Thank you for having me.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nGood morning, Paul.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nI've been just curious that I don't actually recall in the product, Exxon talked about trading. It's a major contributor to the result. Historically, I think the U.S. companies, such as you and Chevron tends take a more conservative approach in trading comparing to your European customers.\n\nSo just curious that how we see the company having a somewhat changing the trading strategy going forward? Or that this is just a unique circumstance and that when we're talking about trading, what kind of trading are we referring to that is making a big contribution this quarter? Thank you.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah. Good morning Paul, I'll touch on that, and if Kathy's got anything to add, I'll let her jump in on the back. But what I would say is, and I think we talked about this some years ago that we were -- when we moved to the value chain constructs when we combined our fuels marketing organization with our refining organization and start looking at optimizing value all along the value chain, the trading organization became a much more relevant channel with respect to optimization. And so at that time, so back in 2018, we made the decision to invest more in trading and to change the approach there to optimize, to act as an optimization tool along all of our assets.\n\nAnd you may recall we talked about asset-backed trading. And that continues to be an important part of the product solutions business, and more specifically, the downstream element of the business as well as our upstream crude. And so that organization has grown with time and continues to perform that optimization function. I think what you're seeing this quarter, in particular, is the point that Kathy made, which is with the way you account for trading, that can be kind of noisy quarter on quarter.\n\nAnd that if you look longer term, you can see the value kind of embedded within the businesses. And it is, I would say, very embedded within those businesses. So we don't break it out just because it is an asset-backed trading strategy. And therefore, the value derived through that, obviously, is through trading, but obviously also through running our refineries reliably, having the product and having the assets to support the arbitrages and the trade activities that under -- that create that value.\n\nAnd this quarter, we saw with the way that the prices moved, a bigger chunk of it booked in the quarter. But I would just say, as you look at that over time, it is a meaningful contributor to the value equation in our downstream value chain.\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nYes. And then the only thing I would add to that is we are trying to also tell you that there's some impacts that over time, we expect to be neutral. So the fact that we use derivatives to ensure ratable pricing of our refinery crude runs sometimes that's going to give us a positive in a quarter. Sometimes that's going to give us a negative in the quarter.\n\nOver time, it should be neutral.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nThat's why we've tried to break that out with the price timing category.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nThat's great. And Kathy, just curious that the trading also contributed to the strong natural gas price utilization that you recall? Or that had nothing to do with that?\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nWe also have trading that we would be doing within our upstream business. And so you can see that, some of those impacts reported in our results, but that we have spot, I would say, exposure, and we do trade around that as well, very embedded in the business. It's not really as big a factor as what we would have seen, obviously, in energy products.\n\nPaul Cheng -- Scotiabank -- Analyst\n\nThank you.\n\nOperator\n\nWe'll take our next question from Neal Dingmann with Truist Securities.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGood morning. Thanks for the time. My quick question is just on costs. Specifically, could you all speak to your thoughts for 2023 on OFS inflation and other rising costs particularly in your two highest return areas, the Permian and Guyana.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah. I'll touch on that, Neal. I mean, obviously, we're subject to the same broad market forces that everyone is seeing out there. And so inflationary pressures across a number of our sectors and activities.\n\nI think a couple of things. One is, as you will recall, as we went through the pandemic in the downturn, we were very -- took a very concerted effort to work with our contracting partners and the recognition that we would be back that we would longer term be running rigs and putting pipe in the ground. And so try to enter into contracts that reflected that longer term objective, and that has helped manage some of the inflationary impacts and that we kind of set some contracts back in the downturn with a commitment to continue to spend money going forward. And so that's been an offset.\n\nAnd then, of course, the organization with all the changes that we've been making. Remember, we took our upstream organization from seven plus businesses down to one and organize very, very differently. We've centralized a lot of the functions really trying to harness our scale and leverage the purchasing power that we have and then cut our costs out. So all those efforts to become more efficient and more effective in the marketplace and reduce costs are having a significant impact.\n\nWe mentioned in the earnings release that to date, we have $6.4 billion of structural savings versus 2019 and we're well on our way to meeting the objective we set by end 2023 of $9 billion in structural savings. So that's helping to offset some of those inflationary pressures. And then on top of that, with centralized organizations and more effectively leveraging the scale, we're getting what I would call -- what we term as kind of short-term efficiencies, purchasing power, however you want to think about that, that we don't put in the structural bucket, but actually helps us to offset costs. And so we've challenged ourselves to deliver on our expense budget for the year and to offset inflation.\n\nThe organization is doing a pretty good job at that. I think we'll be within rounding with respect to that. And then next year, the organization is very focused on using the opportunities that have been created through the restructuring of our business to offset those inflationary pressures. And we're going to stretch ourselves to see how much that we can do.\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nGreat details. Thank you, all.\n\nJennifer Driscoll -- Vice President, Investor Relations\n\nOK. We have time for one more question.\n\nOperator\n\nThank you. We'll take our last question from Roger Read with Wells Fargo.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nYeah, good morning. Maybe just to follow up on the capacity question that was asked earlier, but rather than just focus on services capacity in a particular region or something like that. Darren, I was curious, if you look at tightness, be it LNG, refining, etc., what do you think it takes? Or do you believe that the capacity exists for the world to move forward and do what it needs to do over the next, say, two to three years to add capacity? Or do you see it as a situation where there probably is a no other option but to curtail demand for some period of time? It's kind of a macro question, but you brought it up in the intro, and it's kind of picking at me here as to what's the way out of this maze.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nYeah. Thanks, Roger. I think the industry has been historically pretty good at flexing on capacity to meet the demand. And so I'm optimistic that with time, the market -- and we've proven this, I think, over the years that the markets will come back into balance, but it is a function of time.\n\nI think in the short term, everyone will squeeze what they can. Certainly, you've seen us pushing as hard as we can to make sure that we're running reliably, and we're getting product to the marketplace to meet that need in the market. I know everyone else is trying to do the same. So I think that piece of it is sweating all the existing assets as hard as you can.\n\nIt's going to help in the short term, but longer -- but more structurally, it's just a function of getting these projects developed and on track. I mean, fortunately for us, we've had a very healthy pipeline of projects that have been in work. And so it's not -- we're not out trying to find something to work on. We're basically focused on delivering the pipeline that we've got.\n\nAnd we're bringing on -- as we talked about, we brought in Coral floating LNG out of Mozambique this quarter. That's additional capacity. We're progressing investments in Papua New Guinea. We've got Golden Pass here in the U.S.\n\nthat's progressing very large LNG export terminal that should come online in 2024. That's going to probably increase the exports out of the Gulf Coast by 20%. So I think the capacity is there. It's just a function of the time it takes to build these very significant projects.\n\nAnd I would also tell you that if you look at on the crude side of the equation, we're making very good progress with the next boat in Guyana. We continue to believe we're going to bring that in a little bit early and we're progressing the ones after that. So I think the capacity is there. It's the challenges -- executing efficiently so that you're getting -- you're spending your capital efficiently and then doing it in a way that brings it on an expedited fashion, which is what we're focused on doing.\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nAnd then just the one thing I'd add is on the demand side, I think all companies that can are looking to conserve especially LNG, so that it can be there for other use. So across our footprint in Europe, we've already kind of switched over 65% of our use of LNG to other fuel sources so that it can be there for other use. And I expect that other industry players are doing the same.\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nGreat. Thank you.\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nThank you.\n\nJennifer Driscoll -- Vice President, Investor Relations\n\nThanks, Roger. Thanks, everybody, for your questions today. We will post the transcript of the Q&A session on our investor website early next week. Have a nice weekend, everyone, and let me turn it back to Katie to conclude our call, please.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nJennifer Driscoll -- Vice President, Investor Relations\n\nDarren Woods -- Chairman and Chief Executive Officer\n\nDevin McDermott -- Morgan Stanley -- Analyst\n\nKathy Mikells -- Senior Vice President, Chief Financial Officer\n\nJeanine Wai -- Barclays -- Analyst\n\nDoug Leggate -- Bank of America Merrill Lynch -- Analyst\n\nNeil Mehta -- Goldman Sachs -- Analyst\n\nStephen Richardson -- Evercore ISI -- Analyst\n\nSam Margolin -- Wolfe Research -- Analyst\n\nJason Gabelman -- Cowen and Company -- Analyst\n\nBiraj Borkhataria -- RBC Capital Markets -- Analyst\n\nAlastair Syme -- Citi -- Analyst\n\nJohn Royall -- JPMorgan Chase and Company -- Analyst\n\nRyan Todd -- Piper Sandler -- Analyst\n\nPaul Cheng -- Scotiabank -- Analyst\n\nNeal Dingmann -- Truist Securities -- Analyst\n\nRoger Read -- Wells Fargo Securities -- Analyst\n\nMore XOM analysis\n\nAll earnings call transcripts"
}