{
  "companyName": "Prudential Financial",
  "companyTicker": "PRU",
  "quarter": 3,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/11/02/prudential-financial-pru-q3-2022-earnings-call-tra/",
  "content": "Prudential Financial (PRU -0.42%)\nQ3 2022 Earnings Call\nNov 02, 2022, 11:00 a.m. ET\n\nOperator\n\nLadies and gentlemen, thank you for standing by, and welcome to Prudential's quarterly earnings conference call. [Operator instructions] I will now turn the call over to Mr. Bob McLaughlin. Please, go ahead.\n\nBob McLaughlin -- Vice President, Investor Relations\n\nGood morning, and thank you for joining our call. Representing Prudential on today's call are Charlie Lowrey, chairman and CEO; Rob Falzon, vice chairman; Andy Sullivan, head of U.S. businesses; Scott Sleyster, head of international businesses; Ken Tanji, chief financial officer; and Rob Axel, controller and principal accounting officer. We will start with prepared comments by Charlie, Rob, and Ken, and then we will take your questions.\n\nToday's presentation may include forward-looking statements. It is possible that actual results may differ materially from the predictions that we make today. In addition, this presentation may include references to non-GAAP measures. For a reconciliation of such measures to the comparable GAAP measures and the discussion of factors that could cause actual results to differ materially from those in the forward-looking statements, please see the slide titled Forward-Looking Statements and non-GAAP Measures in the appendix to today's presentation and the quarterly financial supplement, both of which can be found on our website at investor.prudential.com.\n\nAnd now, I'll turn it over to Charlie.\n\nCharlie Lowrey -- Chairman and Chief Executive Officer\n\nThank you, Bob, and thanks to everyone for joining us today. Our third quarter financial results reflect the impact of market conditions, including the variability in alternative investment returns and lower fee income, as well as an elevated level of COVID-19 hospitalization claims in Japan, partially offset by underlying business growth, including the benefit from rising interest rates. We continue to transform our businesses to be less market-sensitive and better positioned to deliver sustainable long-term growth. This includes investing in products and solutions that meet the evolving needs of our customers and achieving our $750 million cost savings target one year ahead of schedule.\n\nOur rock-solid balance sheet provides the financial strength to navigate the current macroeconomic environment and support our customers, shareholders, employees, and other stakeholders. Turning to Slide 3. I'll start off today with an update on how we are investing in long-term growth opportunities that meet the evolving needs of our customers and support our vision to be a global leader in expanding access to investing, insurance, and retirement security. In September, Prudential was selected by IBM for a 50% participation in the second largest pension risk transfer transaction in U.S.\n\nmarket history, with a total value of over $16 billion. This transaction builds upon our leadership role in this market, where we have helped employers safeguard their workers' retirements since pioneering the first jumbo PRT transaction a decade ago. We are well-positioned to continue to benefit from the growing PRT market, which is expected to have over $50 billion of total industry transactions in 2022. In the individual retirement market, our FlexGuard suite continues to grow in both sales volume and product scope, with an additional $1 billion in sales, bringing the total to nearly $12 billion since its launch in 2020.\n\nBuilding upon FlexGuard's tremendous success, we plan to introduce FlexGuard Life, an index variable universal life product later this month. We expect our businesses will benefit from the increased demand for retirement decumulation products over the next decade, as we strengthen our role as a leader in the $300 billion annuities market. We're making similar growth investments on behalf of our international customers as well. During the third quarter, we expanded into Argentina, our partnership with Mercado Libre, Latin America's largest e-commerce platform with approximately 200 million users.\n\nOur expanded partnership follows our initial launch with Mercado Libre in Brazil earlier this year, which delivers life insurance and accident and health products tailored to the platform's mass market customer base. Moving to Slide 4. As I noted earlier, we have now achieved $765 million of annual run rate cost savings, exceeding our target of $750 million, and completed this one year ahead of schedule. This includes $180 million realized in the third quarter.\n\nTo achieve these cost savings, we carefully assessed all aspects of our business and operations from our physical office space, to how we leverage technology to deliver more efficient customer experiences. For example, by embracing a hybrid work model, we reduced our office space footprint in the U.S. by approximately 50%, which results in an annual run rate savings of about $50 million. On the customer experience front, our use of artificial intelligence accelerated our individual life underwriting from 22 days to 22 seconds.\n\nAnd our new digital claims processing capability can now deliver funds to most customers in six hours as opposed to six days. We also automated and reduced the timing of fund verification and processing on about one-third of new annuity sales from what was two to three weeks to now two to three days. And our group insurance claims processing is now three times faster, thanks to new data systems we have installed. Turning now to Slide 5.\n\nOur rock-solid balance sheet and disciplined approach to capital deployment has helped Prudential navigate financial and macroeconomic challenges for nearly 150 years. Consistent with our AA financial strength rating, we have a strong capital position, a high-quality, well-diversified investment portfolio and approximately $5 billion in highly liquid assets at the end of the third quarter. We continue to balance investing in our businesses for long-term growth with shareholder distributions. In addition to the investments in our businesses that I previously mentioned, we also returned over $800 million to shareholders during the third quarter through dividends and share repurchases for a total of $7 billion since the beginning of 2021.\n\nLooking ahead, we expect higher interest rates will economically benefit our business over time. We have the financial strength to continue to navigate the current economic and market environment. As we monitor developments, we will maintain our disciplined approach to capital management and redeployment, and our board will review our 2023 capital plan early next year. Before turning it over to Rob, I'd like to touch upon the leadership transition we announced last week as part of our thoughtful approach to creating a sustainable, long-term leadership structure.\n\nBeginning early next year, Andy Sullivan will move from his current role as head of our U.S. businesses, including PGIM, to lead our international businesses and PGIM. Caroline Feeney, who currently leads our U.S. retirement and insurance businesses, will take on an expanded role as head of our business portfolio in the U.S.\n\nand will join our executive leadership team. Scott Sleyster, who currently leads our international businesses, will retire in the first quarter of 2023. We thank Scott for his tremendous contributions to Prudential over the course of his 35-year career with the company, and look forward to working closely with Andy and Caroline in their new roles. I'll now turn it over to Rob for an update on our business performance.\n\nRob Falzon -- Vice Chairman\n\nThank you, Charlie. I'll provide an overview of our financial results and business performance for our PGIM, U.S., and international businesses. I'll begin on Slide 6 with our financial results for the third quarter of 2022. Pretax adjusted operating income was $1 billion, or $2.13 per share on an after-tax basis, and reflected lower variable investment income driven by market conditions and an elevated level of Japan COVID-19 hospitalization claims, partially offset by underlying business growth, including a benefit from rising interest rates.\n\nOur GAAP net loss per share was $0.78 on an after-tax basis, primarily reflecting realized investment losses largely driven by higher interest rates. Turning to the operating results from our businesses compared to the year-ago quarter. PGIM, our global investment manager, reported lower asset management fees resulting from a reduction in assets under management, reflecting higher interest rates, widening credit spreads, and declines in equity markets. Results of our U.S.\n\nbusinesses were lower than the year-ago quarter, reflecting lower spread income due to less favorable variable investment income and lower fee income resulting from the sale of a portion of the legacy variable annuities business, the decline in equity markets, and net outflows, partially offset by more favorable underwriting as COVID-19 transitions to an endemic level in the U.S. The decrease in earnings in our international businesses reflected elevated COVID-19 hospitalization claims in Japan and lower spread income driven by less favorable variable investment income. Turning to Slide 7. PGIM, our global active investment manager, has diversified capabilities in both public and private asset classes across fixed income, alternatives, real estate, and equities.\n\nPGIM's long-term investment performance remains attractive with more than 80% of assets under management outperforming their benchmarks over the last five- and 10-year periods. PGIM experienced retail outflows, primarily in fixed income, consistent with industry trends, due to the rising rate environment, while institutional net flows continue to be positive. As the investment engine of Prudential, the success and growth of PGIM and of our U.S. and international insurance and retirement businesses are mutually enhancing.\n\nPGIM's asset origination capabilities, investment management expertise, and access to institutional and other sources of private capital are our competitive advantage. This helps our businesses bring enhanced solutions and create more value for our customers. Our insurance and retirement businesses, in turn, provide a source of growth for PGIM through affiliated flows and unique access to insurance liabilities that complement its track record of third-party growth. PGIM's annual fee rate increased due to the continued shift toward higher fee strategies, including our alternatives and private credit business.\n\nWe continue to grow our alternatives in private credit business, which has assets under management of nearly $230 billion across private credit, real estate equity and debt, and private equity secondaries, and benefits from our global scale and market-leading positions. Across PGIM's private platform, we deployed $9.6 billion of capital this quarter. As we continue to invest in growth areas that are aligned with the needs of our clients, we also remain disciplined in finding opportunities to protect operating margins by managing the business more efficiently. Turning to Slide 8.\n\nOur U.S. businesses produced diversified earnings from fees, net investment spread, and underwriting income, and benefit from our complementary mix of longevity and mortality businesses. We continue to shift our business mix toward higher growth and less market-sensitive products in markets, transform our capabilities and cost structure, and further expand our addressable markets. Retirement strategies achieved robust sales in the third quarter across its institutional and individual lines of business.\n\nInstitutional retirement closed nearly $10 billion of pension risk transfer transactions in the third quarter, including being selected by IBM for a 50% participation in a $16 billion pension risk transfer transaction. Our focus on superior execution, supported by the experience of our high-quality PRT team, and our continued market leadership in the U.S. pension risk transfer market contributed to IBM selecting us. We continue to see a significant opportunity in the growing PRT market.\n\nIn individual retirement, product pivots have resulted in continued strong sales of more simplified solutions with $1 billion of FlexGuard and FlexGuard income sales in the third quarter, as well as increased fixed annuity sales. Our individual life sales also reflect our earlier product pivot strategy, with variable life products representing approximately 70% of sales for the quarter. Group insurance experienced a 50% increase in sales compared to the year-ago quarter, reflecting higher national account life and disability sales and execution of our product growth strategy to drive supplemental health. Turning to Slide 9.\n\nOur international businesses include our Japanese life insurance companies, where we have a differentiated multichannel distribution model, as well as other businesses aimed at expanding our presence in high-growth emerging markets. In Japan, we are focused on providing high-quality service and expanding our geographic coverage and product offerings. Our needs-based approach and protection product focus continue to provide important value to our customers as we expand our product offerings to meet their evolving needs. For example, we launched a yen-denominated investment product with a joint survivorship feature in the bank channel in the third quarter.\n\nIn emerging markets, we are focused on creating a carefully selected portfolio of businesses and regions where customer needs are growing, where there are compelling opportunities to build market-leading businesses and where the Prudential enterprise can add value. In the third quarter, we continued to focus on expanding product and business capabilities to meet the evolving needs of customers. In Brazil, we expanded our digital sales application and achieved record sales for the second consecutive quarter, driven by strong performance across all distribution channels. We further expanded our product offerings on the Mercado Libre platform in Brazil and successfully launched the sales platform in Argentina, as Charlie mentioned.\n\nIn addition, we completed our tender offer for Alex Forbes, expanding our ownership to 33% of a leading provider of integrated retirement, investment, and wealth management services in South Africa. As we look ahead, we're well-positioned across our businesses to be a global leader in expanding access to investing, insurance, and retirement security. We continue to invest in growth businesses and markets, deliver industry-leading customer experiences, and create the next generation of financial solutions to better serve the diverse needs of a broad range of customers. And now, with that, I'll hand it over to Ken.\n\nKen Tanji -- Chief Financial Officer\n\nThanks, Rob. I'll begin on Slide 10, which provides insight into earnings for the fourth quarter of 2022 relative to our third quarter results. As noted, pre-tax adjusted operating income in the third quarter was $1 billion and resulted in earnings per share of $2.13 on an after-tax basis. To get a sense for how our fourth quarter results might develop, we suggest adjustments for the following items.\n\nFirst, variable investment income was below expectations in the third quarter by 295 million. Next, we adjust underwriting experience by a net 165 million. This adjustment includes a placeholder for COVID-19 claims experience in the fourth quarter of $20 million for our international insurance businesses. We expect a lower level of hospitalization claims due to the recent government supported industry revision of eligible benefits for policyholders recovering from COVID-19 at home in Japan.\n\nAnd last, we expect seasonal and other items to reduce adjusted operating income by 166 million, primarily driven by the seasonally elevated expenses expected in the fourth quarter. These items combined get us to a baseline of $2.71 per share for the fourth quarter. I'll note that if you exclude items specific to the fourth quarter, earnings per share would be $2.96. The key takeaway is that our underlying earnings power improved due to business growth, including the benefit of higher interest rates that more than offset equity market depreciation.\n\nWhile we have provided these items to consider, please note that there may be other factors that affect earnings per share in the fourth quarter. Turning to Slide 11. Our capital position supports our AA financial strength rating. Our cash and liquid assets were $5 billion at the high end of our liquidity target range after investing in our businesses to support long-term growth, including the capital to support our IBM pension risk transfer transaction.\n\nWe have substantial off-balance sheet resources, including contingent capital and liquidity facilities. Over the long term, a higher interest rate environment is economically beneficial. In the near term, the current market environment and the annual assumption update reduce our regulatory capital and excess liquidity. We will remain prudent in our capital deployment, balancing the preservation of financial strength, investment in our businesses for sustainable long-term growth, and shareholder distributions.\n\nTurning to Slide 12 and in summary. We are executing our plans to reposition our businesses, we achieved our targeted cost savings one year ahead of plan, and we are navigating the current macro environment with the financial strength of our rock-solid balance sheet. Now, I'll turn it over to the operator for your questions.\n\nOperator\n\n[Operator instructions] Our first question today is coming from Tom Gallagher from Evercore ISI. Your line is now live.\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nGood morning. The -- my first question is just on the decline in the holding company cash balance that dropped 2 billion sequentially despite the increase in net debt by 500 million. Ken, can you comment on whether there were any contributions to subs. I assume there were no dividends taking out, but a little bit of color for what happened there.\n\nKen Tanji -- Chief Financial Officer\n\nYeah. Hey, Tom, sure. I'll cover that. We did make a capital contribution of $1 billion to PICA, our main U.S.\n\nlife insurance company. And that is to support a high volume of business growth, including the, you know, IBM and other pension risk transfer transactions that we did. We also made a $200 million of contributions to fund a few international joint venture investments that's part of our programmatic M&A into emerging markets. And then, as we mentioned and highlighted that we funded shareholder distributions of 800 million.\n\nThe 500 million of net debt increase that we had, as we refinance our debt profile, was essentially offset by holding company costs, including interest. We did not have dividends from our subs in this quarter. You know, the timing of dividends from our subs to the holdco tend to vary and tend to be greater in the fourth quarter and first quarter. Putting that all together, we ended with highly liquid assets, 5.1 billion, still above our target range.\n\nSo, you know, in sum, the primary reason our holdco HLA decline, highlight liquid assets decline, was due to the 1.2 billion of business growth. You know, I also -- I just thought it would be helpful to remind people what I said on our last call is that we expect the statutory funding needs for our U.S. life insurance business, including our assumption updates, to be comparable to our GAAP -- the GAAP impact that we recorded in 2Q. The reserve strengthening will be higher, stat is more conservative, and that's going to be fully reflected in our stat results in the fourth quarter.\n\nAs I also mentioned on our last call,, you know, we have excess capacity already in PICA available to meet that need. So, you know, the combination of the capital that we contributed to support business growth this quarter and the excess capacity we had in PICA -- within PICA will remain with RBC ratios consistent with our AA financial strength target. You know, in terms of shareholder distributions, we will complete our shareholder distributions for this year in the fourth quarter with both dividends and share [Audio gap] they'll consider our capital position, opportunities to invest in our businesses and now, increasingly so, the volatility uncertainty of the economy and markets looking ahead. So, we'll factor that all in.\n\nBut we'll, you know, continue with our philosophy of being thoughtful and disciplined with our capital and balance investment in our businesses with long-term growth and maintaining financial strength and returning capital to shareholders.\n\nCharlie Lowrey -- Chairman and Chief Executive Officer\n\nHey, Tom, it's Charlie. Let me just add one thing because I think part of your question is about can we execute on a long-term plan. And I'll just take it up a level and say, we have additional levers we can pull and resources that we can use to do just that, to execute on our long-term plan.\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nThanks a lot guys. That was very comprehensive. And, Charlie, just -- so, you'd still -- I think it was the $10 billion three-year total capital return plan. You still feel good about that given the levers that you have to work from?\n\nCharlie Lowrey -- Chairman and Chief Executive Officer\n\nYeah. Ken, do you want to comment on that?\n\nKen Tanji -- Chief Financial Officer\n\nYeah. Yeah. Again, we're -- you know, we will complete -- we've already returned 7 billion through the third quarter. We'll complete our plans for this year.\n\nAnd again, you know, our board will factor in all the considerations that I mentioned into their decisions in early part of next year.\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nOK. Thanks a lot, guys.\n\nOperator\n\nThank you. Next question is coming from Tracy Benguigui from Barclays. Your line is now live.\n\nTracy Benguigui -- Barclays -- Analyst\n\nThank you. First, congratulations to Scott, your retirement; Andy, Caroline, in your new role. I'm wondering, given your progress to date and thinking about market opportunities, do you feel like you need to elongate the three-year timetable of reallocating 5 billion to 10 billion of capital to higher growth, less market-sensitive business.\n\nCharlie Lowrey -- Chairman and Chief Executive Officer\n\nSure, Tracy. It's Charlie. Let me take that one. So, let me start by saying we remain totally focused on executing on our transformation strategy to become a less market-sensitive and higher-growth company.\n\nAs you've seen, we've made a number of programmatic acquisitions in PGIM and emerging markets. And in the second quarter, we completed two key divestitures that reduced our overall market sensitivity by 20%. So, we're well on our way. Now, our path may not be linear as different growth opportunities present themselves at different times.\n\nAnd I would note that our diverse set of businesses provides opportunities to grow in different market environments as we've seen with this market environment. And we're well-positioned to benefit from this diversification. For instance, in the third quarter, our retirement strategies business did nearly $15 billion of sales, including a significant PRT transaction, that demonstrate our leadership position in this market where we believe there's just tremendous growth potential going forward. But our business system is also self-reinforcing.\n\nAnd as an example, the recent IBM PRT -- with the recent IBM PRT transaction, which is in the institutional retirement business, that also brought in over $8 billion in AUM to PGIM. So, by saying we're focused on our high-growth businesses, naming PGIM and emerging markets, doesn't mean we're not looking to grow our other businesses as well. So, you know, in summary, what I'd say is we're definitely committed to becoming a higher growth, less market-sensitive company. But our progress will depend upon a couple of things.\n\nOne is the opportunities that arise, and the second is the macroeconomic conditions.\n\nTracy Benguigui -- Barclays -- Analyst\n\nOK. That's very helpful. So, it sounds like you have organic growth opportunities. You're not only relying on programmatic acquisition.\n\nSo, speaking of organic and you mentioned PRT, I'm just wondering if we should expect to see more coinsurance in the future for these large deals. And also, if you could comment on, you know, funded status these days and, you know, what you've seen in the pipeline would that prohibit some deals getting done.\n\nAndy Sullivan -- Executive Vice President and Head of U.S. Businesses\n\nSo, Tracy, good morning. It's Andy. And first, let me thanks for -- I appreciate the congratulations. You know, you probably could tell we're exceptionally proud of our team and of our capabilities in our pension risk transfer business.\n\nYou know, the fact that we conducted the second largest transaction in history is second only to the ground breakage transaction we did with General Motors about a decade ago for $29 billion. You know, this transaction, we did split 50-50 between us and another provider. And for clarity, the decision to split a deal is made by the plan sponsor versus carriers bidding together. As we look forward, we don't think deal splitting will be atypical, and we will always be open to that type of situation depending on the deal's characteristics.\n\nYou know, overall, the market in pension risk transfer remains very robust. The industry experienced a third successive record-breaking quarter. Third quarter came in at 28 billion, which was a 60% increase from last year. Funded status remains near record levels at 106%.\n\nSo, we now expect this year, as you heard in Charlie's remarks, to come in above $50 billion for the industry. And we believe that we'll consistently see about $40 billion going forward. You know, given the size of that market, despite that it's a competitive market, we expect, given our industry-leading track record and our capabilities, we're going to continue to find success at picking our spots. And net-net, this will be a nice organic growth area for us over time.\n\nTracy Benguigui -- Barclays -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Next question is coming from Ryan Krueger from KBW. Your line is now live.\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nHey, thanks. Morning. I had a question on individual retirement earnings. I think on a core basis, they were up about 60 million sequentially.\n\nCan you help us think through the key drivers of that and, you know, if you'd expect that to be sustainable longer term?\n\nAndy Sullivan -- Executive Vice President and Head of U.S. Businesses\n\nYes. So, Ryan, it's Andy again. Good morning. Thanks for your question on the individual retirement business.\n\nWe're very pleased with the momentum that we're seeing this quarter. Let me speak first about our core earnings progress, and then I'll talk about our continued success at FlexGuard. We saw a material lift in our core earnings, thanks primarily to the change in the interest rate environment. And that's both on the short and long end of the curve.\n\nWe get lift from interest rates on our collateral on the short end, and we're getting lift on the long-term side in our portfolio as well. And we're seeing the FlexGuard block grow. That's why you saw the step-up in our core earnings. And I would just kind of go back to what Ken said earlier, higher rates are a good thing overall for Prudential.\n\nAdditionally, we're very pleased with the continued progress at building a very healthy FlexGuard block of business. Quarter in and quarter out, we remain a top share player in the market. We've achieved 11 billion in sales life to date. We very much like the profitability of the block that we've brought into the organization.\n\nAnd at the end of the day, you know, kind of back to the organic growth discussion, we see the retirement decumulation opportunity in the country as a very good growth opportunity. And we have all the right stuff to capture it.\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. And then just wanted -- I had one quick capital follow-up. Charlie, you had mentioned that you have other levers that you can pull to execute on your long-term capital deployment plan. Seeing if you could expand on that at all.\n\nAnd I guess, probably related to that, just, you know, you contributed capital earlier this year to Bermuda. At what point in time do you think you might see more business there to then release capital in the U.S.? Thanks.\n\nCharlie Lowrey -- Chairman and Chief Executive Officer\n\nSure. Let me take the first part of that and then turn it over to Ken. I'll just give you a couple of quick examples. One would be sort of ongoing reinsurance transactions that we continue to review.\n\nAnd the other would be, we have levers, both on and off balance sheet that we can pull. So, we have lots of different levers and resources that we can use and regularly look at them in order to access additional capital. And, Ken, do you want to talk about Bermuda?\n\nKen Tanji -- Chief Financial Officer\n\nYes, Ryan. Yeah, the Bermuda sub that we launched earlier in the year is a good example of the levers that Charlie referenced. We have a new reinsurer in Bermuda. It's called Lotus Re.\n\nWe did capitalize it with $800 million earlier this year, and we've reinsured a block of variable life business to it. So, it will create capital efficiency. And it's a reinsurance capability that's sort of another tool in our toolbox going forward.\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nGreat. Thank you.\n\nOperator\n\nThank you. Next question today is coming from Suneet Kamath from Jefferies. Your line is now live.\n\nSuneet Kamath -- AllianceBernstein -- Analyst\n\nHi. Thanks. Good morning. Just wanted to circle back on capital.\n\nYou made comments about 2023 a couple of times. But just to level set, I mean, we're used to thinking about, you know, kind of the 65% free cash flow conversion as sort of, you know, the level of capital return that you guys would do on an annual basis, ex any specific special transactions. Should we be thinking about that as a baseline for next year? Or are you signaling that, you know, the operating environment is a little bit more challenging, so maybe you'd guide to something a little bit lower than that?\n\nKen Tanji -- Chief Financial Officer\n\nYeah. Hey, Suneet. Yeah, 65%, if you looked at our -- what we've generated in free cash flow from our businesses over time, that's been the average. It's been, in some years, higher than that; and in some years, lower than that.\n\nCash flow from our businesses this year is below our historical average. That's both as, you know, we continue to invest in our businesses for long-term growth, but also work through the statutory reserve increases in our life insurance businesses that we updated this year. So, it will vary over time, but, you know, we think given our growth rates and our business profile, that's, you know, what our historical average has been.\n\nSuneet Kamath -- AllianceBernstein -- Analyst\n\nOK. Got it. And then just if I could come back to that $1 billion infusion into PICA, I mean, my rough math would suggest maybe half of that was related to, you know, the IBM PRT deal. So, that leaves another $400 million, $500 million left.\n\nAnd I hear you on FlexGuard funding that growth, but, you know, individual retirement is still in outflows. And I would have thought the capital release from withdrawals would have sort of supported the new business. I guess, I'm just trying to understand what the other piece of it is into PICA apart from the PRT transaction. Thanks.\n\nKen Tanji -- Chief Financial Officer\n\nYeah. I don't know what rule of thumb you're using on specific business lines, but it was -- for us, it was primarily related to not just the IBM transaction but the other deals that we did as well. And the growth in our FlexGuard business. And, you know, we continue to see good profitability and cash flows from our existing VA business as well.\n\nSuneet Kamath -- AllianceBernstein -- Analyst\n\nWas there any impact from interest rate hedges? You had a GAAP loss, but just wondering if there's any impact from that on the statutory results.\n\nKen Tanji -- Chief Financial Officer\n\nYeah. There is, Suneet, is the rise in interest rates has been very swift. And over time, that will allow us to invest our insurance reserves at higher yields and improving profitability and cash flows. But in the near term, our statutory surplus in the U.S.\n\nbusiness -- for our U.S. business is reduced by what we consider a noneconomic statutory reserve method that tends to manifest itself when rates rise, and we experienced unrealized and realized losses on our fixed income and derivatives. This is not unique to us. We believe it's an issue for the broader industry, and it's uneconomic in nature and should be addressed.\n\nAnd there's a lot of discussions going on with regulators in the industry about this. So, we'll manage the change in the rate environment, and we'll maintain regulatory capital is consistent with our AA financial strength objectives. But, you know, there is a short-term impact on our statutory capital.\n\nSuneet Kamath -- AllianceBernstein -- Analyst\n\nCan you size that at all?\n\nKen Tanji -- Chief Financial Officer\n\nYou know, it's still -- it's going to be subject to, you know, where the rates move. And so, you know, that's still dynamic.\n\nSuneet Kamath -- AllianceBernstein -- Analyst\n\nOK. Thanks, Ken.\n\nOperator\n\n[Operator instructions] Our next question is coming from John Barnidge from Piper Sandler. Your line is now live.\n\nJohn Barnidge -- Piper Sandler -- Analyst\n\nThank you very much. Seasonally, 3Qs had typically been the best, more talented quarter in any given year. This is a pre-pandemic world, of course. With COVID now clearly endemic, did that typical mortality seasonality return this year?\n\nAndy Sullivan -- Executive Vice President and Head of U.S. Businesses\n\nHey, John. Good morning. It's Andy. I'll talk about our COVID.\n\nWe intentionally, as we've talked about many times in the past, manage our business mix to have a good balance between longevity and mortality. That absolutely paid us dividends all throughout the pandemic. During 3Q, the U.S. experienced 42,000 deaths, which was, you know, 17,000 more than our estimate.\n\nBut the fact is, we continue to see a declining impact from COVID in the U.S. Let me just hit a little bit about each business. In group insurance, our life benefit ratio was 91.4%. It did reflect pre-pandemic mortality.\n\nThat was slightly elevated due to accidental death and dismemberment claims that we very much see just as a natural quarter-to-quarter variability, nothing more. We're very pleased that we continue to see working age guests and its impact on working as continuing to decline. In individual life, we saw our mortality actual to expect it at the low end of our range, 97%. And we saw particularly good performance in the smaller face amount bands, and that is typically where we would see the COVID experience show up.\n\nIn institutional retirement, we did see underwriting gains above our seasonalized expectations, particularly in pension risk transfer, but again, not surprising given the average age of that block of business. So, you know, the bottom line is, given the balanced mix of businesses that we have, we very much expect this will be very manageable as COVID continues to shift into an endemic state.\n\nJohn Barnidge -- Piper Sandler -- Analyst\n\nGreat. And then, my follow-up question. Institutional flow is positive but material deceleration in PGIM. Retail improved in outflow.\n\nCan you maybe talk about how FX impact is changing where you're seeing demand, either a geographic perspective or from an asset perspective? Thank you.\n\nAndy Sullivan -- Executive Vice President and Head of U.S. Businesses\n\nYeah, John. It's Andy. I'll take your question on flows. You know, as we've always talked about, flows will vary quarter to quarter, so we stay very focused on our long-term track record.\n\nIn Q3, we experienced third-party net outflows of 4 billion, driven on the retail side. Institutional net flows remained positive with strong positive flows into both Jennison equity and real estate debt. So, showing the benefit of our diversified portfolio. We're very pleased with our positive $9 billion in institutional flows year to date.\n\nI would also note that we experienced good affiliated flows. So, from our insurance transactions, like the IBM transaction, we saw 7 billion in affiliated flows in Q3 and 14 billion year to date. You know, that is a very important part of our strategy. And it reflects the synergies between our liability generation capability, as well as our asset management capability.\n\nYou know, to your specific question about retail outflows were 4.6 billion, that was a marked improvement from the 8.3 billion last quarter. Much like the rest of the industry, we continue to be impacted by headwinds in both active fixed income and growth equity. You know, as far as where are the flows going, the flows are tending to go into passive. And in the short-duration strategies, we're obviously not a passive player.\n\nAs far as FX impacts, we really haven't seen anything material to speak of. You know, at the end of the day, we're highly confident that our diversified product portfolio has us well-positioned that, as the environment settles down and stabilize and flows start to shift back in, we have the experience to succeed and we'll be a net winner as we always have been. As we've talked about before, we've experienced 18 out of 19 years of positive inflows.\n\nJohn Barnidge -- Piper Sandler -- Analyst\n\nThank you.\n\nOperator\n\nThank you. Your next question is coming from Elyse Greenspan from Wells Fargo. Your line is now live.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nHi. Thanks. Good morning. My first question is on the Japan COVID losses.\n\nYou had guided last quarter to maybe seeing, you know, about 50 million of unfavorable underwriting impact. And that came in at 200 million this quarter. So, are you concerned that some of that leads into the fourth quarter? And do you think that there could be any movement around your reserves?\n\nScott Sleyster -- Head of International Business\n\nThanks, Elyse. This is Scott. During the quarter, Japan experienced the largest surge of COVID cases since the beginning of the pandemic. Japan sort of did a really good job upfront, but omicron hit them hard much later.\n\nThe new infections were mainly concentrated in younger ages. And they peaked in August, I think, at like over 240,000. They have since declined quite significantly. I think they're running around 40,000 today.\n\nSo, they're down to about a sixth to where they were. From the beginning of the pandemic and consistent with regulatory guidance, A&H claims provided for a policyholder payments related to hospitalizations irrespective of whether the patient actually checked into the hospital. So, with the large sets of COVID cases, we did, in fact, see a big spike in A&H claims, which is what you were seeing. Starting September 26, the industry in agreement or with support from the government determined that hospitalization benefits will no longer be paid if the insured individuals are not actually in the hospital with very few exceptions, things for people over 65, or pregnant women, and certain serious comorbidities.\n\nSo, we expect the change here to be pretty dramatic in the fourth quarter. First of all, the infection levels are down a great deal, and then the qualification levels have been substantially restricted. I think Ken already mentioned that we've got a placeholder for 20 million versus the 180 million for the fourth quarter. So, we'll continue to closely monitor the situation.\n\nAnd, you know, as in the past, we remain focused on really taking care of our customers, but also looking out for our employees and maintaining the strength of our distribution channels.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nThanks. And then, my second question, what are you guys seeing in terms of the base spreads within institutional retirement? How quickly are those accelerating? And how should we think about the earnings growth potential in that segment from rising rates?\n\nKen Tanji -- Chief Financial Officer\n\nElyse, it's Ken. I'll start. And, you know, we have seen, as the rise in rates and the rising yields have played, out a better opportunity to invest at more attractive terms. And you see that leading to earnings improvement.\n\nBut probably more importantly will be the business growth, particularly with the with the pension risk transfer business that we just put on the books at the end of the third quarter.\n\nAndy Sullivan -- Executive Vice President and Head of U.S. Businesses\n\nYeah. And, Elyse, it's Andy. I would just add, we have a lot of momentum in our institutional retirement business. We have exceptional people, great capabilities, great brand and distribution systems, that's really second to none.\n\nAnd obviously, you've heard about that from a pension risk transfer perspective. But we had 13.5 billion in sales and institutional retirement. So, it goes well beyond just pension risk transfer. We also had 1.5 billion in investment-only stable value and 1.2 billion in longevity reinsurance.\n\nSo, we have very good momentum, and it was a banner quarter for us in institutional retirement.\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Next question is coming from Erik Bass from Autonomous Research. Your line is now live.\n\nErik Bass -- Autonomous Research -- Analyst\n\nHi. Thank you. Your outlook implies higher seasonal expenses of, I think, 115 million in the fourth quarter, which is less than the 125 million to 175 million range that you typically expect. Is this a function of just being disciplined on expenses given the environment? Or should we think of this as a more permanent trend, given the cost-saving actions that you've highlighted?\n\nKen Tanji -- Chief Financial Officer\n\nHey, Erik. It's Ken. We are being more disciplined, but it's really timing. You know, we see a lot of that coming into the fourth quarter as usual.\n\nAnd I wouldn't read too much into that. It's -- yes, we are being disciplined, but there's also timing considerations.\n\nErik Bass -- Autonomous Research -- Analyst\n\nGot it. Thank you. And then, can you talk about how the yen movements are affecting demand for U.S. dollar-denominated products in Japan? Does this materially change the consumer value proposition and the outlook for demand or persistency?\n\nScott Sleyster -- Head of International Business\n\nThanks, Erik. This is Scott. I'll go ahead and take that. There are several things that go on from the strength of the U.S.\n\ndollar. On the one hand, you will have a cohort of customers who have bought, you know, kind of investment products, and they may want to terminate to take a gain if it's a net positive versus any surrender charge. And for people that have permanent life, they may be thinking about reducing coverage because a certain dollar amount will provide more yen coverage, which is ultimately typically what they're looking for. I think your question focused more on the sales side.\n\nWith the dollar being this strong, we think people that will be looking for U.S. dollar products will be sizing down their purchase again because, in general, they are looking back to the coverage of the -- of ultimately how it covers them in yen. That being said, two other good things, I think, are going on with higher rates, U.S. dollar investment products do look more attractive, and ultimately, overtime, while we have some short-term headwinds because we use swaps to hedge.\n\nIn the long fall, this will add to our net investment income, which we view is a tailwind in that market.\n\nErik Bass -- Autonomous Research -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nYour next question is coming from Wilma Burdis from Raymond James. Your line is now live.\n\nWilma Burdis -- Raymond James -- Analyst\n\nHey. Good morning. Could you clarify how the Lotus Re Bermuda entity works to create capital efficiencies? And is there a plan to bring in third-party capital in Bermuda?\n\nKen Tanji -- Chief Financial Officer\n\nYeah. The Lotus Re is an internal reinsurance capability that's based in Bermuda. And we find that certain products in our initial use of it was with variable life that we find that the regime there, which is a very robust, you know, reserving standard is more principle-based and is better aligned with the economics of that business. And as a result, by transferring that to reinsuring that to that regime, we get releases of reserves and capital in PICA.\n\nAnd again, it's our efforts to really align the economics of our businesses with reserve and capital standards that are robust and risk-sensitive, recognize the nature of the business and are a better fit for that type of business.\n\nRob Falzon -- Vice Chairman\n\nWilma, it's Rob. Just sort of following on the second part of your question. So, in that particular entity, no, our intent is not to bring in third-party capital. As Ken alluded to, it's a kind of a captive vehicle.\n\nHaving said that, we are keenly aware of the increased institutional appetite coming into this sector. And as we've said before, we don't think that there's a firm who's better positioned to figure out how to satisfy the intersection of demand for our customers on the liability origination side with appetite for funding into those sorts of investments from the institutional side. So, nothing to talk about near term there, but we think we're particularly well-positioned in order to be able to exploit that.\n\nWilma Burdis -- Raymond James -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Next question is coming from Alex Scott from Goldman Sachs. Your line is now live.\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nHi. I had a follow-up on some of the questions on capital and the holdco cash balance. When I think about growth, you know, I appreciate that there's the PRT. Ex maybe some heightened PRT growth, I would think PICA, you know, would be a bit more self-funding.\n\nAnd I'm just trying to understand if maybe some of the need-to-fund growth from the holdco balance has to do with the expectation of what's going to happen in 4Q around this UL review. And the reason I ask is just, you know, if that is part of the contemplation, that's fine. And it's actually good because, you know, it means maybe you don't need to contribute anymore in 4Q. And that's really what I'm trying to figure out is, you know, when you go through that review in 4Q, would this need to occur again? Like, will there need to be more cash from the holdco that goes down into PICA to help fund, you know, that impact?\n\nKen Tanji -- Chief Financial Officer\n\nYes. So, Alex, the -- PICA is generating statutory capital with its business profile. But the size of the business growth that we experienced this quarter was pretty high and unique. And that's why -- we thought it was a very attractive use of capital and deployed capital for that purpose.\n\nWe acknowledged that the assumption update would require funding needs, and that was a use of capital as well. But we had -- at the time of the second quarter, we had -- we're well-positioned to absorb that capital requirement within PICA, including the -- using the cash flow and statutory surplus that's being generated by our businesses. We'll be looking at the fourth quarter and evaluating again -- well, and I should mention, as I also described, we have had some short-term capital that is being held in reserves potentially for what we consider noneconomic reserving, given the rise in rates. And then, we'll, again, as we always do, in the fourth quarter, look at our capital position, our opportunities to deploy capital attractively, and make sure we're maintaining PICA at our AA financial strength standards.\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nGot it. That's helpful. And then, maybe a little bit of a more broad question on Japan. Could you talk about how a weaker yen impacts your business, and, you know, if that should be something we contemplate as we think about cash flow in 2023, either positive or negative?\n\nScott Sleyster -- Head of International Business\n\nThanks, Alex. This is Scott. You know, we've been operating in Japan for a long time. And, you know, in my many years here, I've seen the yen as low as in the high 70s to as high as it is, you know, today.\n\nSo, as that happens, customer preferences will shift. And so we'll see more, you know, yen sales, for example, if dollar products get, you know, priced too high. On the other hand, we may see more dollar deposit type products that will be more attractive in the bank or other parts of the GIB channel, you know, related to where the dollar is. So, I'd say, fundamentally, we have the ability to adapt, and we've demonstrated that we've done that over time.\n\nI guess, what I would come back to is, I would say, we're very disciplined in how we price our business in Japan. Part of the reason you've seen the bank channel down is we are -- we've maintained our discipline around profitability. We haven't been chasing deposit products when the margins, you know, were really tight. So, I feel very good about the franchise we have there.\n\nWe see less price sensitivity in channels where we have a preferred position like life planners and some of the affinity groups. And, you know, we'll adapt the product mix based on customer demand, but we're always going to keep our pricing discipline front and center.\n\nKen Tanji -- Chief Financial Officer\n\nAnd, Alex, I'll just add. You know, we also have a very established hedging program with our Japanese business that hedges both earnings and net equity position. And, you know, given the strength of the dollar, that has a $1.8 billion gain at the end of the third quarter.\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nGot it. Thank you.\n\nOperator\n\nThank you. Next question is coming from Mike Ward from Citi. Your line is now live.\n\nMike Ward -- Citi -- Analyst\n\nThank you, guys. So, you mentioned potentially reinsurance as one lever for a source of capital. Just wondering if that means we should sort of be expecting, you know, annuities reinsurance deal? Or could it be life or anywhere else? Any color there?\n\nCharlie Lowrey -- Chairman and Chief Executive Officer\n\nSure. Let me take that. This is Charlie. You know, first, I'll deal with both annuities and then talk a little bit about life.\n\nYou know, we're really pleased with the valuation for the block of traditional variable annuities with guaranteed living benefits that we sold as evidenced by the gain on sale we reported. And we'll continue to explore possible additional opportunities to derisk in-force blocks of traditional VA business. We expect to reach our goal of reducing market sensitivity through the pallet transaction we just completed and through the natural runoff of traditional variable annuities business over time and as we're not in a position of having to do another transaction. But having said this, we'll continue to explore possible additional opportunities.\n\nBut we'll only do something, as we've said before, if it's in the best interest of stakeholders. So, that's on the annuity side. On the life block side, you know, as we've noted in the past, we've dedicated resources to looking at various opportunities aligned with our strategy of becoming a higher growth and less market-sensitive company. And as a result, we'd certainly consider opportunities for a life sub-block if they came our way, but with the caveat that it has to make sense for shareholders.\n\nSo, we're going to be disciplined in our approach as the individual life business continues to be core to our purpose.\n\nMike Ward -- Citi -- Analyst\n\nGreat. Thank you. That's very helpful. And then, maybe on PRT, just wondering if there's kind of a benchmark that maybe you could give in terms of how you think about earnings per $1 billion of PRT business or something like that.\n\nI guess one of your, you know, larger peers has given this in the past, I think it's around $7 million, $8 million of earnings per $1 billion of PRT. Wondering if that sounds ballpark accurate?\n\nKen Tanji -- Chief Financial Officer\n\nYeah. Hey, Mike, this is Ken. You know, all the deals are a little different. I don't think putting out a benchmark is -- you know, would be appropriate.\n\nMike Ward -- Citi -- Analyst\n\nOK. Thanks.\n\nOperator\n\nThank you. Our next question today is a follow-up from Tracy Benguigui from Barclays. Your line is now live.\n\nTracy Benguigui -- Barclays -- Analyst\n\nThank you. I just wanted to revisit the statutory reserve charge you'll be taking in the fourth quarter. Just help me understand better why it would be comparable in size on the GAAP side. Because as you mentioned, you know, statutory reserves are more conservative.\n\nI mean, I would imagine there'd be some cushion there. If you could elaborate on the compatibility.\n\nKen Tanji -- Chief Financial Officer\n\nYeah. Tracy, it will be higher. But again -- and because -- generally, because the stat is more conservative. And it's also -- it's just different.\n\nBut again, we have capacity to absorb that, and, you know, we still hold that view.\n\nTracy Benguigui -- Barclays -- Analyst\n\nOK. When you say higher, you mean on absolute terms, or the contribution will be higher? I'm a little bit confused.\n\nKen Tanji -- Chief Financial Officer\n\nNo, I'm sorry. When we took the charge, we believe that we had and we continue to believe we have capacity to absorb that within PICA's excess capital position as a result.\n\nTracy Benguigui -- Barclays -- Analyst\n\nOK. But I think last quarter, I think it was something like 1.4 billion pre-tax. So, are we talking the same dollar amount for stat?\n\nKen Tanji -- Chief Financial Officer\n\nIt would be higher again. We're still finalizing those. That will be finalized in our fourth quarter results. But again, we have the capacity to absorb that within PICA, and we'll continue to maintain RBC ratios consistent with our AA standards.\n\nTracy Benguigui -- Barclays -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question is a follow-up from Ryan Krueger. Your line is now live from KBW.\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nThanks. I figured I just asked this since it wasn't asked last quarter. Would you be able to say what your ULSG stat reserve total is and what you moved to the ultimate lapse rate assumption to when you did the review last quarter?\n\nKen Tanji -- Chief Financial Officer\n\nI think we need to follow up on both of those. They're pretty specific, if that's all right.\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nYeah, no problem. I just figured I'd give it a shot. Thank you.\n\nOperator\n\nThank you. Next question is a follow-up from Tom Gallagher from Evercore ISI. Your line is now live.\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nThanks. Just one question on the holding company cash, again, to come back to the -- the 5.1 billion, I believe, includes 1.5 billion that we should think about for prefunding a debt maturity in the middle part of 2023. I just wanted to confirm that that's the intention. And should we think about the holding company cash really as 3.6 billion on a net basis? Thanks.\n\nKen Tanji -- Chief Financial Officer\n\nYeah, Tom. In our holding company, cash position will vary depending upon the timing of when we issue debt or debt matures or we call it. We've consistently made it a good practice to prefund maturing and callable debt 12 to 18 months in advance. And, you know, this -- what this does is it reduces our refinancing risk and enables us to be selective in the timing of debt funding relative to particular market conditions.\n\nIn August, we issued 1.5 billion of debt, and we've earmarked that for debt that's callable next year. The timing was good. We're happy with the outcome. And we're going to continue to prefund debt as a good practice.\n\nAnd overall, though, if you looked at our level of debt over the last three years, it's been at a fairly consistent level. It will vary depending on timing of maturities and issuance. But overall, it hasn't changed that much. We also have -- as we continue to highlight contingent sources of debt.\n\nSo, overall, we feel very good about the level of our debt that's consistent with our AA financial strength rating and how we manage refinancings of our debt very well as well.\n\nCharlie Lowrey -- Chairman and Chief Executive Officer\n\nHey, Tom. It's Charlie. I'd just reiterate what I said in the beginning as well. You know, we believe we have other levers and resources by which to execute on our plan.\n\nSo, there are -- you can look at it in the one way you did. But on the other hand, as Ken said, and as we've reiterated throughout the call, we have other means by which to execute on our plan as well.\n\nOperator\n\nThank you. We've reached the end of our question-and-answer session. I'd like to turn the floor back over to Mr. Lowrey for any further closing comments.\n\nCharlie Lowrey -- Chairman and Chief Executive Officer\n\nOK. Thank you, operator. And thank you for joining us today. Before I conclude, I want to acknowledge the unexpected passing of George Paz last week, a member of Prudential's board of directors for the past six years.\n\nGeorge was an integral member of our board, with a unique perspective and deep business experience that helped us shape our thinking on a multitude of issues. He will be greatly missed and remembered as both a trusted advisor and as a friend. I hope we demonstrated during this call the progress we're making to transform Prudential to deliver sustainable, long-term growth and meet the evolving needs of our customers. Looking ahead, we remain confident in our strategy and the strength of our company.\n\nFor nearly 150 years, Prudential has been there for its customers and other stakeholders, who we will continue to serve as we strive to be a global leader in expanding access to investing insurance and retirement security. Thank you again for joining us today.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nBob McLaughlin -- Vice President, Investor Relations\n\nCharlie Lowrey -- Chairman and Chief Executive Officer\n\nRob Falzon -- Vice Chairman\n\nKen Tanji -- Chief Financial Officer\n\nTom Gallagher -- Evercore ISI -- Analyst\n\nTracy Benguigui -- Barclays -- Analyst\n\nAndy Sullivan -- Executive Vice President and Head of U.S. Businesses\n\nRyan Krueger -- Keefe, Bruyette and Woods -- Analyst\n\nSuneet Kamath -- AllianceBernstein -- Analyst\n\nJohn Barnidge -- Piper Sandler -- Analyst\n\nElyse Greenspan -- Wells Fargo Securities -- Analyst\n\nScott Sleyster -- Head of International Business\n\nErik Bass -- Autonomous Research -- Analyst\n\nWilma Burdis -- Raymond James -- Analyst\n\nAlex Scott -- Goldman Sachs -- Analyst\n\nMike Ward -- Citi -- Analyst\n\nMore PRU analysis\n\nAll earnings call transcripts"
}