{
  "companyName": "Veritiv",
  "companyTicker": "VRTV",
  "quarter": 2,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/08/09/veritiv-vrtv-q2-2022-earnings-call-transcript/",
  "content": "Veritiv (VRTV -0.34%)\nQ2 2022 Earnings Call\nAug 09, 2022, 9:00 a.m. ET\n\nOperator\n\nGood morning, and welcome to Veritiv Corporation's second quarter 2022 financial results conference call. As a reminder, today's call is being recorded. We will begin with opening remarks and introductions. At this time, I would like to turn the call over to Scott Palfreeman, vice president of finance and investor relations.\n\nMr. Palfreeman, you may begin.\n\nScott Palfreeman -- Director of Finance and Investor Relations\n\nThank you, Julie, and good morning, everyone. I'm joined on today's call by our CEO, Sal Abbate; and our CFO, Steve Smith. After my remarks, Sal will share an update on second quarter business performance followed by Steve, who will provide more details on our financials. After Steve's comments, Sal will conclude by providing an update on our revised outlook.\n\nWe will then open the call for your questions. Before we begin, please note that some of the statements made in today's presentation regarding the intentions, beliefs, expectations and/or predictions of the future are forward-looking. Actual results could differ in a material manner. Additional information on factors that could cause results to differ from those in the forward-looking statements is contained in the company's SEC filings.\n\nThis includes the risks and other factors described in our 2021 Form 10-K and the company's other publicly available reports and exhibits filed with the SEC. Today's call and presentation slides will contain non-GAAP financial measures. The reconciliation of these non-GAAP measures to comparable U.S. GAAP measures are included at the end of the presentation slides and can also be found in the investor relations section of our website.\n\nAt this time, I will turn the call over to Sal.\n\nSal Abbate -- Chief Executive Officer\n\nThank you, Scott. Good morning, everyone, and thank you for joining us. Today, we are proud to report another quarter of strong financial performance, highlighted by double-digit organic revenue growth and the highest levels of adjusted EBITDA and net income for any quarter in the company's history. Adjusted EBITDA in the second quarter was a record $136 million, representing an 85% increase compared to the prior year.\n\nThe second quarter marked the 8th consecutive quarter of year-over-year adjusted EBITDA dollar growth. Second quarter adjusted EBITDA margin was 7.5%, which was more than a 300-basis-point improvement compared to the prior year. For the first half of 2022, adjusted EBITDA was $256 million, a 92% increase compared to the first half of 2021. Net income in the second quarter was $91 million, reflecting growth of more than 3x that of the second quarter of 2021.\n\nThe resulting diluted earnings per share in the second quarter were $6.12 compared to $1.62 in the second quarter of 2021. It's worth noting that net income for the first half of 2022 was approximately $170 million, which was greater than the full year 2021. We believe that two straight years of consistent improvement in earnings growth and nearly three years of adjusted EBITDA margin growth demonstrates the sustainability of our performance. Despite the challenging supply chain environment, we achieved year-over-year top-line revenue growth in each of the past five quarters driven by both volume and price.\n\nAdditional factors behind our consistent financial performance include the continued execution of our commercial, operational and back-office strategic initiatives. Over the past few years, we worked diligently to streamline our operating model and to reduce our expense base, which helped enable sustainable and profitable sales growth. In the second quarter, we continued to see strong revenue growth in our packaging segment. Packaging revenue grew nearly 10% compared to the prior year, and adjusted EBITDA increased 14% to $108 million.\n\nThis marked the 10th consecutive quarter of year-over-year adjusted EBITDA dollar growth for this segment, highlighting the ongoing impact of our commercial excellence and supply chain initiatives on our segments. Packaging's adjusted EBITDA margin was 10.8% in the second quarter. After removing the impact of our divestiture of Canada, organic packaging revenue in the second quarter increased 15% compared to prior year. The segment's above-market revenue growth was driven by specialized and customized solutions provided to customers in the manufacturing, food and beverage and healthcare industry verticals.\n\nOur sustainable solutions, along with our front-end design, custom kitting and inventory management value-added solutions also contributed to our strong revenue growth during the second quarter. Today, approximately 50% of our packaging segment's revenues are generated by solutions customized to meet the specific needs of our customers. We are especially well equipped with product and industry vertical focused specialists who navigate the complex needs of each customer. While not immune from the effects of supplier price and wage inflation, we have made significant process enhancements over the last several years to offset a portion of their impact.\n\nWe have strategically exited certain businesses with lower growth and return profiles, such as previously announced divestiture of our Canada business. These types of actions have positioned the company to perform well in both volatile and challenging environments like the COVID-19 pandemic. We believe these strategic actions will continue to allow Veritiv to outperform many competitors in the event of an economic slowdown. I'll now turn it over to Steve to provide more details on our financial performance for the second quarter.\n\nAfter Steve's remarks, I'll provide an updated outlook for the remainder of the year. Steve?\n\nSteve Smith -- Chief Financial Officer\n\nThank you, Sal, and good morning, everyone. I will provide more details on our segment performance as well as updates related to cash flow, leverage and our share repurchase program. As we review these results, please note that when we speak to organic results, we are referring to the reported results, excluding the impact of the sale of our Canada in Rollsource businesses. Additionally, our second quarter of 2022 had the same number of selling days as the last year.\n\nStarting with the packaging segment. On a reported basis, second quarter revenue increased 9.5% compared to the prior year, while organic revenue increased 15.2%. Second quarter organic revenue growth was primarily driven by higher market prices and to a lesser extent, volume. Revenue in the second quarter increased across all product category and industry verticals.\n\nWe saw double-digit revenue growth in key industrial verticals such as manufacturing, food and beverage and healthcare. We reported double-digit sales growth in nearly all of our broad range product categories led by corrugated, cushioning, kitting and specialty items. Strength in the U.S. market of mid-single-digit volume growth was somewhat mitigated by softness in Asia due to COVID-19-related economic shutdowns.\n\nFor the second quarter, the packaging segment reported adjusted EBITDA of $108.4 million, which was an improvement of 13.6% compared to the prior year and the 10th consecutive quarter of year-over-year adjusted EBITDA dollar growth. packaging's adjusted EBITDA margin was 10.8%, a record for the second quarter and 40 basis points higher than the last year. Shifting to the solutions segment. Reported revenue for the second quarter declined 12.9% compared to the prior year to $195.8 million.\n\nWhen adjusted for the Canada business sales, organic revenue increased 8.4% versus last year. As a reminder, the Canada business was primarily within the facility solutions and print solutions segments and highly concentrated across lower-margin products, customers and industry verticals. Our facility solutions segment benefited from the strong return of away-from-home activity within the entertainment and hospitality verticals. Robust sales performance and away-from-home products such as tiles, tissues, food service and can liners was partially offset by the expected lower sales in COVID-19 related personal protective equipment.\n\nSecond quarter adjusted EBITDA for facility solutions was $16 million, an improvement of 53.8% over the prior year. The resulting adjusted EBITDA margin for the second quarter was a record 8.2%, which was a 360-basis-point improvement over the prior year. For print solutions segment, second quarter reported revenue increased 21.3% while organic revenue increased 28.5% compared to the prior year. Although second quarter print volume declined in the mid-single-digit range versus the prior year, price remains strong as supply chain disruptions continue.\n\nIn the second quarter, print solutions generated record adjusted EBITDA of $60.5 million and an adjusted EBITDA margin of 10.2%. Over the last several years, we have fundamentally changed the operating model of this segment to anticipate market changes and proactively lower risk and improve profitability. These foundational changes to our operating model, in addition to favorable market conditions, have enabled us to sustain our performance at higher than historic levels. Moving now to cash flow.\n\nFor the quarter ended June 30, 2022, cash flow from operations was $68.2 million. Subtracting capital expenditures of $2.2 million from cash flow from operations, we generated free cash flow of $66 million in the second quarter. Our net debt to adjusted EBITDA leverage ratio based on our trailing 12-month results was a record low 0.7 times, well below our long-term target of three times. Our historically low leverage profile and strong free cash flow generation continues to provide financial and strategic optionality to support our long-term organic and inorganic growth objectives.\n\nI'll conclude with a share repurchase update. We are pleased with the progress we've made with our $200 million 2022 share repurchase program. Through the end of the second quarter, we have repurchased approximately 780,000 shares or roughly 5% for our fully diluted shares and have $95 million remaining under the program. I'll now turn the call back to Sal to provide an updated outlook for the rest of the year.\n\nSal?\n\nSal Abbate -- Chief Executive Officer\n\nThanks, Steve. In summary, we are pleased with our second quarter performance collectively and across each of our business segments. We have meaningfully improved the fundamentals of the business through relentless execution of our multiyear strategic initiatives, which further enhanced our ability to solve our customers' complex problems while driving efficiencies within our business and reducing our leverage. One key strategic initiative was our 2020 restructuring plan where we rebalanced our warehouse footprint to better align with the long-term needs of our packaging customers.\n\nFrom the summer of 2020 when we announced the plan, through the end of the second quarter of 2022, we have exited approximately 45 warehouses across our network. Another initiative was the reduction of our distribution and back office expenses to align with the ongoing needs of the business. Finally, we have also strategically exited certain lower-margin businesses such as the recent sale of our Canada business. The benefits from these strategic initiatives are not onetime in nature and we expect residual benefits from these actions going forward.\n\nThese multiyear efforts have allowed us to continue to improve adjusted EBITDA margins despite the volatility in the supply chain. Our financial discipline has also prepared us to effectively manage our business through future market volatility. As the market anticipates a broader economic slowdown, I would note our strategic actions have put us in an exceptionally strong financial position. While we have not seen an economic slowdown yet as evident by our results, we are prepared with a fortified balance sheet to not only weather a potential economic slowdown but also to capture value for our shareholders.\n\nAs I've mentioned before, our diverse portfolio of products, industry verticals and customers provides a degree of earnings stability as we are not overweighted in any one industry vertical or a customer. Additionally, unlike some competitors, our performance is not heavily correlated to the commodity markets. We also have the advantage as a distributor to have low capital needs and a highly flexible operating model, which allows us to adjust to changing market conditions faster than a manufacturer. Additionally, our customer base spans from small businesses to more than half of the Fortune 500 with no customer representing greater than 5% of total revenue.\n\nWe are also growing in industries such as healthcare and consumer staples, which are historically more resilient in economic downturns. I would now like to talk about our outlook for the rest of the year. Given our strong performance through the first half of the year, and despite the divestiture of our Canada business, we are increasing our full year 2020 adjusted EBITDA guidance from a range of $445 million to $485 million to a range of $475 million to $505 million. This reflects a $25 million increase to the midpoint of our prior adjusted EBITDA guidance to $490 million.\n\nWe expect full year 2020 net income to be in the range of $285 million to $315 million, which is more than double 2021 net income. We expect full year diluted earnings per share to be in the range of $19.50 to $21.50, again, more than double 2021. Diluted shares outstanding are expected to be approximately 14.7 million shares. Finally, we continue to expect estimated free cash flow of approximately $250 million and capital expenditures of approximately $30 million for the full year 2022.\n\nTo provide some visibility at the segment level, starting with the packaging segment, we expect market demand to remain stable and supplier lead times to continue to improve. While our outlook does not reflect any meaningful price changes for the remainder of the year, we will continue to manage through any future changes efficiently and with proper notice to our customers. In facility solutions, we believe we will continue to see strength in away-from-home verticals. Traditional industry verticals such as travel, entertainment, restaurants and hospitality are trending toward their pre-pandemic levels, helping to partially offset declines from COVID-19-related personal protective equipment.\n\nWe have fundamentally changed this business to our commercial excellence and supply chain initiatives as well as the recent divestiture of our Canada business. We believe these actions will continue to improve our margins throughout the rest of the year. Switching to our print solutions segment outlook. Domestic demand continues to significantly outpace supply due to the systemic shift of mill capacity away from traditional paper grades.\n\nWe expect the current print market dynamics to continue for the balance of 2022 and well into 2023. As such, we believe our print business will continue to produce adjusted EBITDA margins well above historical levels. As a leading provider of comprehensive business-to-business packaging solutions, we will continue to stay relentlessly focused on the execution of our next wave of long-term strategic initiatives and providing a best-in-class experience for our customers. This concludes the prepared remarks.\n\nJulie, we are now ready to take questions.\n\nOperator\n\nThank you. [Operator instructions] Your first question comes from John Babcock from Bank of America. Please go ahead.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nHey. Good morning, and thanks for taking my questions. Just starting out, I was wondering if you might be able to provide some clarity on the drivers of the guidance increase. I assume part of this comes from the strong 2Q results also potentially the paper price increases, but any other color there would be helpful.\n\nSal Abbate -- Chief Executive Officer\n\nSure, John. Good morning. This is Sal. Yes, well, let me clarify one thing for the remainder of the year, it does not include any unannounced price increases.\n\nSo the second half of the year, we have no price increases for any of the businesses in the numbers we provided. Each segment will be greater than last year despite the Canada divestiture. If I break it down by business line or by segment, packaging will continue to see growth. We expect a healthy holiday season this year.\n\nAnd I know while the market had taken a step back in Q2 in terms of box shipments. We do expect, and I think the market does expect a little bit of strength going into the back half of the third quarter and into the fourth quarter and margins holding with still supply and demand imbalances and packaging, although greatly improving. Lastly, we expect to see a steady increase in sales approaching pre-pandemic levels in most verticals with the exception of office, and that's consistent with what we've seen in Q2 and carrying into Q3. And in the Print segment, we continue to see a significant imbalance between supply and demand.\n\nAnd we basically have our third and fourth quarters estimated to be our allocation as we don't see any influx of imports from either -- from Asia to help the situation. And so we expect a strong Q3 and Q4, and frankly, would be stronger had we had more access to product for print. So those are the drivers of the strength in the second half of the year. Steve, anything to add to that?\n\nSteve Smith -- Chief Financial Officer\n\nNothing at this time, Sal.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nOK, that's helpful. And then just next on packaging. I wanted to kind of get a sense for what you're seeing from a demand perspective there. I mean any color you could provide on how growth trended from month-to-month in the quarter.\n\nAnd then also, if you could just comment if you're seeing any sort of slowing. I know we've heard that from a number of producers during the quarter. So is there any additional points on that would be useful.\n\nSal Abbate -- Chief Executive Officer\n\nSure, John. I'll separate it between kind of our domestic and core traditional business and then the International business. So in the U.S. business, particularly in corrugated and flexibles, we actually saw what I would call a healthy volume number for the second quarter compared to what we're seeing in the market, particularly on box shipments.\n\nSo our second quarter volume in packaging U.S. was about 3%. And then combining price, it takes you up to 15% or so organically that Steve mentioned. So we are seeing above-market performance in volume.\n\nIt wasn't as strong as the first quarter, but we definitely saw volume growth in the second quarter versus the market. As we both mentioned, driven by our diversity across all product lines, customers, but in particular, food and beverage, healthcare and heavy manufacturing. The areas where we saw maybe less strength were International, and that's mainly hampered by the Chinese COVID-19 shutdowns. And so our International supply chain and our international business is heavily weighted toward Asia, and so that business actually did see volume declines in the second quarter, but we believe them to be artificially suppressed from the COVID-19 pandemic.\n\nAnd then in our origin business, not as strong as the first quarter, again, driven by some challenges on the international supply chain. But all in all, for packaging, we did see above-market growth in volume, particularly here in the U.S.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nOK. And I recognize it's probably still too early to provide 2023 guidance, but I was wondering if you could kind of talk about different scenarios that might play out for the business over the next couple of quarters, and particularly, you should the macro environment continue to soften?\n\nSal Abbate -- Chief Executive Officer\n\nYeah. So first, I'll comment, John, that we don't have a recession built-in to the back half of 2022. While we're not prepared to give a 2023 guidance yet, I will provide maybe some general color overall. We do expect -- and maybe I'll break that down by segment because there's more clarity in some than others.\n\nWe do expect the imbalance of supply and demand in Print to carry through the end of 2022 into 2023. So the probability of that supply chain rebalancing and becoming healthy again in the next six to nine months isn't clear to us. And so we see elevated demand and shortened supply and that going into 2023. It's hard to say in packaging, what's going to happen in 2023.\n\nAnd so I'll refrain from those comments until most likely our November call, but we do again see continued improvement on the FS side as businesses are getting back to a healthy return to pre-pandemic level. So we see that continuing into the balance of the year with a relatively strong demand into the holiday season. What I can comment on is maybe some of our margin sustainability going into 2023 and the back half of 2022. And those are those four initiatives that we continue to mention, first is our cost and price discipline.\n\nAnd we do have future waves of improvements inside the company with respect to cost and price discipline that is excluding anything that might happen from a market price increase. We have our 2020 restructuring plan that will continue to drive improved margins in the back half of 2022 and into 2023, and that's primarily coming from our supply chain operations and back-office initiatives. We'll have the segment mix improvement, and that is higher-margin customized packaging solutions driving the fourth -- the third and fourth quarter and into next year. And then lastly, the divestiture of our lower-margin ROIC businesses like Canada, Rollsource, Saalfeld, they continue to have margin accretion going into the second half of the year and into next year.\n\nI might also mention just in our packaging business that recall that we are less -- we are less to hold into the commodity markets, commodity markets being kind of resin-based and corrugated, which are less than 35% of our portfolio and the other 65% come from the ancillary packaging products where we have highly customized solutions and things like kitting and automation. And so that will help continue to drive margins north in the second half of the year and tailing into 2023. Steve, anything to add to that?\n\nSteve Smith -- Chief Financial Officer\n\nSo just taking a look at the balance sheet as we look at the different scenarios for '23, as we commented in our prepared remarks, John, as you well know, the balance sheet net leverage is down to 0.7. So should there be a macro-driven softness in '23, we feel pretty well prepared from that perspective.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nGot you. And actually, just on that point on the balance sheet. It did look like long -- your long-term debt declined. I just wanted to clarify, did you pay down a meaningful amount of debt or was there -- is there some timing at stake there?\n\nSal Abbate -- Chief Executive Officer\n\nSteve, you want to take that?\n\nSteve Smith -- Chief Financial Officer\n\nYeah. Sure, Sal. So the -- we did pay down debt. The proceeds from the Canadian asset sale came in during the quarter.\n\nWe used some of those proceeds for the ongoing share repurchase program and that -- both the increased income statement performance, the LTM EBITDA as well as the reduction of debt is what led to that lower leverage, John.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nOK. Yeah, I wasn't just talking about the ratio, but also the absolute amount, it looks like that declined about, I think, $100 million or so.\n\nSteve Smith -- Chief Financial Officer\n\nYes.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nOK. All right. Out of curiosity, is there like an absolute level of debt you guys are comfortable at, I mean, you're already pretty low overall from a leverage standpoint. But I mean, is there kind of a level where you'll bottom out here or how should we think about that?\n\nSal Abbate -- Chief Executive Officer\n\nWell, John, we have signaled that historically, we look for to be under three times leverage. As you pointed out, we're significantly below that. So we do have some optionality. And our long-term goal is to remain around three times plus or minus.\n\nSo that does give us some capital allocation decisions to make here over the next six to nine months, things that we've mentioned before, our M&A pipeline is active, and we're actively looking for attractive, both the scale and scope opportunities with that regard. Steve, anything you want to add to that?\n\nSteve Smith -- Chief Financial Officer\n\nNo, Sal.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nAll right. Thanks. And then just my last question. I was wondering if you could kind of walk through the typical free cash flow bridge and then I'll turn it over.\n\nSal Abbate -- Chief Executive Officer\n\nAbsolutely. Sure.\n\nSteve Smith -- Chief Financial Officer\n\nSo John, the -- let's do it in two steps as we think about it. Let's take adjusted EBITDA down to net income and then from net income to free cash flow, so we can give you the whole walk. The -- as Sal mentioned, the midpoint of the range now and adjusted EBITDA is $490 million. And to get to the midpoint of the net income range of $300 million, the reduction of $190 million has four elements to it.\n\nWe have D&A that's in the neighborhood of $50 million, interest expense that's now running only $15 million. Other expenses, mostly LIFO, are about $25 million. And then taxes will be approximately $100 million. So those four items are $190 million, and that takes us from the $490 million, midpoint of EBITDA to approximately $300 million of net income.\n\nFrom net income to free cash flow then, we'll go from $300 million to approximately $250 million. That happens also to have four items that are the larger items. And the sum total of those items, it's about $40 million net reduction. First, you have the add backs of D&A of $50 million, the subtraction of noncash items like bad debt and deferred taxes of about $20 million.\n\nWe guided again to the capex of approximately $30 million use and then the use of working capital, given the revenue increase of about $40 million. So net of those four items, it's about a $40 million use, which takes us from the $300 million to about $260 million. So we guided to approximately $250 million.\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nOK, perfect. Thank you.\n\nSteve Smith -- Chief Financial Officer\n\nSure.\n\nOperator\n\nYour next question comes from George Staphos from Bank of America. Please go ahead.\n\nGeorge Staphos -- Bank of America Merrill Lynch -- Analyst\n\nHi, everyone. Good morning. Thanks for taking my question. I guess first question I had, guys, and I know it's very difficult to be able to look out this far with any kind of precision.\n\nBut what gives you comfort in when the supply chains might open up in print or said differently, why it will be very tight and you'll be on allocation through the end of the year. Any thoughts on that? And then I had a couple of quick follow-ons.\n\nSal Abbate -- Chief Executive Officer\n\nYeah. Good morning, George. Thanks for the question. With respect to say, the balance of the year in print and just in dialogue with our domestic suppliers and our key European suppliers and given the fact that capacity continues to come out, at least of the U.S.\n\nsupply chain, that gives us the predictability and visibility that says the supply chain isn't going to improve before the end of the year. As we think about what might change that, obviously, a demand slowdown would create that in a macroeconomic way. But the additional imports from Asia would really be the tipping point to, I would say, dramatically change the current imbalance and that supply chain takes a good six months to fill and there's still challenges with containers and product on the water. And so that's what's giving us, I guess, I would say, comfort or angst that the supply chain will remain tight, at least for the next, call it, six to nine months.\n\nGeorge Staphos -- Bank of America Merrill Lynch -- Analyst\n\nOK. Sal, on that point, have you been in touch with some of the Asian paper producers to have that view? And also, are your folks talking to cargo vessel companies and so on to get a triangulation relative to what your print customers are saying in North America and Europe?\n\nSal Abbate -- Chief Executive Officer\n\nYeah, I mean we are absolutely reaching out to all outlets to try to understand the situation. We're doing a comprehensive study actually over the next several months that will really help us inform our 2023 through 2025 guidance and what that long-term capacity demand and supply balance look like. And so we'll be in better shape, George, to comment on that in the November timeframe.\n\nGeorge Staphos -- Bank of America Merrill Lynch -- Analyst\n\nOK. Appreciate that. Switching gears and forgive the elemental question. So there have been some recently announced price increases in boxboard, I think like in the last 24, 48 hours, recognizing that corrugated is going to be more important.\n\nDoes that affect your business at all in terms of what might be happening in the folding carton business or not really? And then could you remind me what is left on the process improvement, what's left on the benefits from the restructuring that could benefit results in '22, the rest of the year and really more importantly, from our venture in '23 and beyond?\n\nSal Abbate -- Chief Executive Officer\n\nSure, George. I'll take the first half of the question regarding packaging and specifically price increases. Maybe I'll comment on all the segments. And then, Steve, I'll turn it over to you to give some color on the process improvement benefits at least for the balance of the year.\n\nWe do -- as I mentioned earlier, George, we do not have any further price increases in the numbers we've provided today for guidance and packaging, frankly, or print or facility solutions, but I would tell you that because of this imbalance that we continue to see in the supply chain, particularly in packaging and print solutions, we would be on the higher end of the guidance and that we would expect increases more than we would expect decreases in the next five months, four or five months. So while we didn't bake it necessarily into our guidance range, we do believe that it would be on the higher end of the range if those price increases continue to come through and we would appropriately pass those on like we have over the last several years.\n\nGeorge Staphos -- Bank of America Merrill Lynch -- Analyst\n\nRight. But just one quickie. I mean what happens in boxboard have a significant effect in your business relative to corrugated or not so much?\n\nSal Abbate -- Chief Executive Officer\n\nNot as much as corrugated, No. No, we're much more heavily weighted corrugated for sure.\n\nGeorge Staphos -- Bank of America Merrill Lynch -- Analyst\n\nThank you. Thank you. And on process?\n\nSal Abbate -- Chief Executive Officer\n\nYeah. You bet.\n\nSteve Smith -- Chief Financial Officer\n\nSo there's several elements to that. Sal mentioned the restructuring plan of 2020 that trickled into this year. So there's a small tear of benefit, George, to '23 and beyond. We also have the segment mix helping the consolidated margins.\n\nAs you know, we divested of a lower margin, lower ROIC business in Canada that will carry forward into future years. And we also are seeing that the cost and price discipline that we've put in place as there's been volatility in prices in the market is also being carried over into future years. So while not an operational efficiency, but a back office efficiency that we didn't enjoy three to four years ago that we do enjoy now.\n\nOperator\n\nAnd there are no further questions at this time. I will turn the call back over to Sal Abbate for closing remarks.\n\nSal Abbate -- Chief Executive Officer\n\nThank you, Julie. Well, we are on track for another record year of financial performance, thanks to our talented and customer-focused employees that are helping lead the way. I would like to thank all of our employees for their dedication to delighting our customers and delivering an outstanding quarter. Julie, that concludes our call.\n\nThank you.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nScott Palfreeman -- Director of Finance and Investor Relations\n\nSal Abbate -- Chief Executive Officer\n\nSteve Smith -- Chief Financial Officer\n\nJohn Babcock -- Bank of America Merrill Lynch -- Analyst\n\nGeorge Staphos -- Bank of America Merrill Lynch -- Analyst\n\nMore VRTV analysis\n\nAll earnings call transcripts"
}