{
  "companyName": "Jabil Inc.",
  "companyTicker": "JBL",
  "quarter": 4,
  "fiscalYear": 2022,
  "sourceUrl": "https://www.fool.com/earnings/call-transcripts/2022/09/27/jabil-inc-jbl-q4-2022-earnings-call-transcript/",
  "content": "Jabil Inc. (JBL -0.36%)\nQ4 2022 Earnings Call\nSep 27, 2022, 8:30 a.m. ET\n\nAdam Berry\n\nGood morning, and welcome to Jabil's fourth quarter of fiscal 2022 earnings call and fifth annual investor briefing. My name is Adam Berry, I'm head of investor relations at Jabil. And I represent a team here that's pretty excited to share our 2022 results with you today while also providing additional detail around our focus and outlook as typical for our September call. In terms of agenda over the next 60 minutes or so, we aim to accomplish the following: discuss the trends underway within the end markets we serve, review our fourth quarter and fiscal year '22 results, provide first quarter guidance, offer a fiscal '23 outlook that includes enterprise-level growth while also remaining sensible and grounded given the realities of the dynamic global macro environment surrounding us today.\n\nAnd finally, we'll refresh our capital allocation and shareholder return policies. And most importantly, as our session unfolds, I hope that we're able to provide you with further perspective on Jabil, which I believe is uniquely positioned to grow and win in an environment where supply chain and global manufacturing capabilities have never been so important. Joining me on today's call is Mike Dastoor, our chief financial officer; and Mark Mondello, our chairman and CEO, who together account for over 50 years of Jabil experience. And importantly, when you think about their respective tenures, you can't help but also think about how they have guided Jabil through periods of economic expansion and times where macro conditions were a bit more challenged, a tenure that gives me great confidence as we move into fiscal '23.\n\nSo with that, there's just one more housekeeping item before we begin. Please note the following. During today's presentation, we will be making forward-looking statements, including, among other things, those regarding the anticipated outlook for our business such as our currently expected first quarter and fiscal year net revenue, earnings, and cash flow. These statements are based on current expectations, forecasts, and assumptions involving risks and uncertainties that could cause actual outcomes and results to differ materially.\n\nAn extensive list of these risks and uncertainties are identified in our annual report on Form 10-K for the fiscal year ended August 31, 2021, and other filings. Jabil disclaims any intention or obligation to update or revise forward-looking statements, whether as a result of new information, future events, or otherwise. As you can see on Slide 4, Jabil has vastly improved since we began these investor briefing sessions in 2018. Today, Jabil is a $33.5 billion enterprise with over 50 million square feet of manufacturing space across 100-plus sites.\n\nOur cash flow generation is strong, allowing us to invest in key end market growth while also returning considerable cash to shareholders, which in fiscal '22 was $744 million. And our roughly 260,000 people move with purpose and agility to meet customer needs within a wide-ranging composition of the end markets you see here. Moving to our next slide. You can't help but notice the global nature of our manufacturing footprint, which enables us to manufacture on a local level for a global set of customers.\n\nNo matter whether it's mobility products in Asia, healthcare products in North America, or 5G infrastructure in Europe, we work with our customers to design and develop the most impactful manufacturing solutions irrespective of region with a focus on speed and urgency and a crisp sense of consistency from plant to plant. This is critical because in today's geopolitical climate, the ability to adjust and move with urgency has never been more important as we help customers react to changes in tariffs, the rise of pandemics and natural disasters, energy shortages, conflict, and many other unforeseen events. The Jabil of 2022 is also diversified and robust, thereby allowing us to meet challenges head-on in one part of the business while outperforming in others. So just exactly how did we get here? Well, I'm here to tell you, it was very purposeful.\n\nIn the 2016 time frame, our management team concluded that our model was missing an important characteristic if we were going to deliver upon our financial priorities consistently and sustainably. This important characteristic was diversification. So, beginning in roughly 2017, we embarked on a journey to grow and diversify our business in areas such as 5G, cloud, healthcare, packaging, connected devices, semi-capital equipment, and electric vehicles. Our intentional and deliberate focus on these emerging end markets, combined with our already robust traditional businesses in print and retail, networking and storage, and mobility, resulted in considerable enterprise-level growth over the past four to five years, as you can see here.\n\nAnd as a result, today, no product or product family represents more than 5% of our business, creating an added level of comfort as demand fluctuates up and down, global tastes change and technology constantly evolves. Given our intentional focus on diversification, over the next couple of minutes, I'd like to take a moment and review some of the end markets that have fueled our growth leading to the portfolio mix you see today. In automotive, we're supporting a rapid shift in technology to electric vehicles as evidenced by our 121% revenue growth since fiscal '18. The growth has been driven by our best-in-class portfolio of customers in an addressable market that is growing by the day.\n\nIn EV, our manufacturing processes support the industrialization and production of complex technology for electric vehicles, including battery management systems, inverters, converters, cables, off-board, and onboard charging. And importantly, all of this increased complexity translates to increased content per vehicle for Jabil. Since fiscal '18, our 5G wireless and cloud business has nearly tripled in spite of the asset-light nature of the cloud model as our design-to-dust value proposition resonates with existing and new customers. From secure supply chain design and manufacturing to rack integration and ultimately recycling, Jabil is winning in an expanding market.\n\nIn healthcare, our business has doubled since fiscal '18 as the industry is experiencing tremendous change due to rising costs, aging populations, and the demand for better healthcare in emerging markets. To address these trends, doctors, hospitals, and patients are adopting new and more innovative ways to deliver better, more personalized treatment. Consequently, healthcare OEMs are partnering with Jabil to navigate these changes. Today, we support customers in the development of solutions across medical devices, diagnostics, pharmaceutical delivery, and orthopedics.\n\nFrom rapid prototyping using additive manufacturing to high-volume production, tooling, injection molding, robotics, and rigorous test procedures for regulatory compliance, Jabil healthcare offers an unmatched suite of capabilities, all of which uniquely positions us to offer technology-enabled solutions to our customers. In industrial and semi-cap, our business has grown 43% since fiscal '18, driven mainly by the increasing need for green energy and with incredibly strong global demand for semiconductors. Within our industrial business, alternative energy generation and consumption are driving increased need for power conversion, power optimization, line balancing, and storage at the endpoints of generation and consumption, including accelerated adoption of EVs, as well as on the grid. Jabil has been investing in this space with reference designs and scaled manufacturing partnerships globally.\n\nOn the semi-cap side of our business, semiconductor equipment has become increasingly complex and precise, driving new generations of equipment at large scale. And when you take a step back, you'll again notice an incredibly well-diversed set of business sectors in support of some of the largest, most innovative, and successful brands in the world today. In each of these end markets, we're incredibly focused on delivering consistent and reliable value from early in the product life cycle like product innovation and design to more mature products where we offer planning, automation, supply chain management, and, of course, manufacturing. At the end of the day, we build stuff here at Jabil, and we do it really, really well.\n\nIn summary, so far today, I've discussed the benefits of our global footprint, our focused and intentional growth in key end markets and the high level of consistency brought forth through diversification. Before turning the call over to Mike, I'll try to tie this together through the use of real-life examples within the business to demonstrate the importance of diversification while also walking through our Q4 results. For the quarter, revenue was approximately $9 billion, ahead of our forecast, driven by much better-than-expected revenue in 5G wireless and cloud and networking and storage as our ability to secure critical parts on higher-end demand created meaningful revenue upside during the quarter. At the same time, healthcare and packaging, connected devices, mobility, digital print and retail, and industrial and semi-cap all performed really well and consistent to our expectations.\n\nAll of this growth was slightly offset by component shortages in automotive where supply chain challenges remain the most pronounced. Altogether, at the enterprise level, revenue grew by 22% year over year and 8% sequentially, reflecting continued strong demand. In Q4, our GAAP operating income was $409 million, and our GAAP diluted earnings per share was $2.25. Core operating income during the quarter was $447 million, an increase of 42% year over year, representing a core operating margin of 5%, up 80 basis points over the prior year driven by the aforementioned strength in certain end markets, slightly offset by unanticipated costs associated with the power shortages in Chengdu during the month of August.\n\nNet interest expense in the quarter came in higher than expectations at $53 million primarily associated with rising interest rates, while our tax rate came in better than expected by approximately 70 basis points, resulting in core diluted earnings per share of $2.34, a 63% improvement over the prior-year quarter and at the higher end of our range. Revenue for the DMS segment was $4.4 billion, an increase of 13% on a year-over-year basis, while core operating margin for the segment came in at 5.1%, slightly lower due to the temporary power shutdowns in China. Revenue for our EMS segment came in at $4.6 billion, an increase of 32% on a year-over-year basis and well ahead of our plan from June. Core margins for the segment was 4.8%, up 50 basis points year over year, reflecting good operating leverage on strong growth.\n\nI believe the fourth quarter is the perfect illustration of our global network of factories adjusting, adapting, and ultimately, delivering for our customers and shareholders alike. It feels as though the days of single end markets creating outsized issues for the company seem well off in the rearview mirror. And if you're buying Jabil today, it's not for a single product but rather a tenured leadership team, strong manufacturing capabilities, and the general assumption that technology is converging with our day-to-day lives. Thanks for your time today.\n\nIt's now my pleasure to turn the call over to Mike.\n\nMike Dastoor -- Chief Financial Officer\n\nThanks, Adam. Good morning, everyone. Thank you for joining us today and for your interest in Jabil. Our business model has been intentionally structured with the aim of delivering core operating margin expansion, sustainable earnings growth, and strong predictable cash flows.\n\nOn top of this, our capital structure has been optimized to maximize our flexibility. This flexibility has enabled us to reshape our end market portfolio over the last several years, which has performed extremely well evidenced by a very strong FY '22 results. I'm extremely pleased with the resiliency of our business, particularly considering the numerous challenges throughout the year with ongoing COVID waves, war in the Ukraine, global inflation, supply chain challenges, and multiple energy shortages. Despite these challenges, we delivered year-on-year growth in revenue of 14%, core operating income of 24%, and core EPS of 36%, all while increasing core operating margin by 40 basis points over FY '21.\n\nAt a segment level for the year, our DMS revenue was $16.7 billion, an increase of 9% over the prior year, while core operating income for the segment was up 12% year over year. This resulted in core margin expanding 10 basis points to 4.9%. In EMS for the year, core operating income growth was incredibly strong, up 43% over the prior year. This resulted in core margin expanding an impressive 60 basis points over '21 on revenue of $16.7 billion.\n\nThe strength in our EMS margins is reflective of our improving mix and strong leverage on 20% year-over-year revenue growth. Turning now to our cash flows and balance sheet. In FY '22, fourth quarter cash flow from operations was $1.65 billion. For the quarter, inventory days came in at 79, down six days sequentially on improved working capital management by the team.\n\nIt's worth noting that we offset a portion of our higher inventory levels with inventory deposits from our customers, which reside within the accrued expenses line item on the balance sheet. Net of inventory deposits, inventory days was 62 in Q4, down eight days from Q3. While I am pleased with the sequential decline in inventory days, the team continues to be fully focused on bringing this metric down further in FY '23 as some of the supply chain constraints continue to ease. Net capital expenditures for the fiscal year were $841 million or 2.5% of net revenue.\n\nAs a result of the strong Q4 cash flow generation, adjusted free cash flow for fiscal year came in higher than expected at approximately $810 million. And finally, we exited the quarter with total debt to core EBITDA levels of approximately 1.2 times and cash balances of $1.5 billion. Next, I would like to provide some clarity on our capex as shown in our cash flow statement. As a reminder, our customers routinely co-invest in plant, property, and equipment with us as part of our ongoing business model.\n\nWe often pay for these co-investments upfront, which is then later reimbursed to us by customers. Due to the high dollar value, these co-investments from our customers, and how they are reflected on our cash flow statement, it is important that the two line items shown on the slide to reflect the true capex number and what we refer to as net capital expenditures. Our net capital expenditures for the fiscal year amounted to $841 million. Moving now to our capital returns to shareholders on the next slide.\n\nDuring the fourth quarter, we repurchased 3.8 million shares, bringing total shares repurchased in FY '22 to 11.8 million shares of $696 million. To date, we have utilized $737 million of our $1 billion authorization granted in July of last year This brings our cumulative shares repurchased since FY '13 to approximately 102 million shares at an average price of $30, bringing our total returns to shareholders, including repurchases and dividends to approximately $3.6 billion, reflective of our ongoing commitment to return capital to shareholders. In summary, I'm extremely pleased with the resiliency of our portfolio and the sustainable momentum underway across the business, which has allowed us to deliver exceptionally strong results in fiscal '22. Moving to the next slide, where I'll offer some insight about how we're thinking about the business this year by end market.\n\nAcross most of our end markets, demand has been extremely resilient, particularly in end markets that continue to benefit from strong secular tailwinds, many of which Adam highlighted a moment ago. We continue to expect these secular markets to expand in FY '23. We also expect some consumer-centric end markets to underperform compared to the robust growth for the past 18 months. Unlike in past economic slowdowns where Jabil was highly concentrated in a particular product or end market, today, it is critical to think of Jabil not as one company, but as a well-diversified accumulation of many end markets, a number of which we expect will continue to benefit from long-term secular tailwinds.\n\nThis product and end market diversification, coupled with our global network of connected factories, global best-in-class supply chain management, and deep domain expertise, makes Jabil today markedly more resilient than we were five to 10 years ago as evidenced by our strong results in the last few years in the face of multiple significant global challenges. Our FY '23 guidance assumes a moderate economic slowdown and some moderation in growth, which will impact certain end markets more than others. I'd now like to walk you through each end market and describe how we're thinking about our business in the coming year. In our automotive and transportation end market, we expect the global transition to EVs to continue to drive robust growth within our automotive business despite choppy overall demand in global automotive purchases.\n\nOur view is that EV adoption will continue to accelerate and gain a larger share of the auto market in FY '23 regardless of the near-term global growth dynamics. Jabil's content per vehicle, which can be as high as $3,000 or more dollars for a fully electric vehicle, continues to increase, which provides further confidence in future growth. It's also worth pointing out that project life cycles in this end market run as high as seven or more years, providing a high level of stability and stickiness. In healthcare today, the industries are undergoing tremendous change due to rising costs, aging populations, and the demand for better healthcare in emerging markets.\n\nOEMs are seeking to address these dynamics by shifting the focus away from manufacturing to a state of improving patient outcomes. Jabil's credibility in the healthcare space has positioned us well to take advantage of the outsourcing of manufacturing trends. Should we enter an economic slowdown, it is our view that OEMs would in fact look to accelerate this outsourcing trend. A recession-resistant end market with long product life cycles and accretive margins and stable cash flows is why healthcare continues to be such an important component of our diversified portfolio.\n\nWithin connected devices, which I remind you is made up of a number of different customers, demand generally remains resilient. But given the consumer-centric nature of this end market, as we move from the pandemic-fueled consumer spending to a more normalized environment, we feel it's appropriate to take a conservative outlook and expect some moderation in growth. And in mobility, demand signals continue to be strong as we navigate through our Q1 quarter. This quarter, which has historically been associated with channel fill during the seasonal product launch, is our highest revenue quarter.\n\nIt's worth noting we have a long track record of operating successfully in this end market, which is being uniquely positioned within the portfolio as we partner with the most innovative brand and market leader in the space to supply key capabilities that are critical and hard to replicate. In summary, for DMS to me, the key takeaway this year is the considerable mix shift underway. In FY '23, automotive and transportation and healthcare and packaging are expected to be more than half of our DMS business with estimated revenue growth of approximately $1.2 billion combined in FY '23. Putting it all together for DMS in FY '23, we're expecting 20 basis points of margin expansion on a low to mid-single-digit revenue growth.\n\nTurning now to EMS. In digital print and retail, we expect some moderation in consumer print as people return to office to slightly offset growth in industrial print and e-commerce and warehouse automation systems. Within retail, both in customer-facing stores and in the warehouse, technology is shifting rapidly. As a result, we're building and ramping some of the most complex e-commerce and warehouse automation systems in the industry, which gives us confidence in our FY '23 outlook.\n\nWithin our industrial business, we expect clean and smart energy infrastructure to drive growth for FY '23. There are a few major trends which drive growth in this space, but the overarching one is the green energy revolution. Government legislation such as the recently enacted Inflation Reduction Act in the U.S. with the sizable subsidies and incentives is already beginning to increase investment in this space.\n\nAs a reminder, we play across the entire energy value chain from energy generation and solar panels, power conversion, transmission, storage, and metering to the management of power inside of homes and buildings. These projects have multiyear investment timelines independent of underlying short-term economic growth forecast, so we feel comfortable with the visibility we have in this space. Within semi-cap, so far, customers continue to march ahead with capex investments executing to their investment road maps with the recently introduced CHIP Act providing an additional catalyst in this space. I remind you our strategy in this end market has been very thoughtful due to the high cyclicality of the semi-cap market.\n\nAnd we have been very conservative around how we have invested in this business and our forecast for FY '23. On the 5G side, infrastructure rollouts are going extremely well, and demand remains high in the U.S. and Europe. Rollouts are accelerating, and our localized manufacturing capabilities are leading to market share gains in other geos such as India.\n\nWe expect these rollouts to play out over the next several years regardless of near-term economic conditions. Therefore, we anticipate the 5G end market to continue to be resilient even in the face of a moderate global slowdown. And in the cloud space, our expectation is that the ongoing shift away from on-prem will continue to accelerate, driving long-term growth in the space. If economic conditions weaken, our views of the cloud space should be a beneficiary as companies look to reduce costs in a moderating growth environment.\n\nIt's worth reminding everyone we have deliberately structured our cloud business as a geo-centric, asset-light service offering with very low levels of capex and working capital. To ensure this business remains asset-light, we routinely look for mutually beneficial arrangements with our customers to optimize our asset-light model. With this in mind, in FY '23, approximately $500 million in components we procure and integrate will shift from the current purchase and resale model to a customer control consignment service model. This is in addition to the consignment of certain components we had announced in earlier years.\n\nThis change will allow us to use our assets more efficiently in addition to improving margins. Adjusting for this shift, we expect continued robust unit growth in the cloud space in FY '23. And then finally, within legacy networking and storage end markets, the value proposition that Jabil provides, the best-in-class supply chain management, deep domain expertise, and engineering capabilities and manufacturing in multiple geo is resonating with our customers. And we expect market share already gained in the second half FY '22 to drive growth in FY '23 with higher margins and robust cash flows.\n\nWith the current mix of business in EMS, we expect 20 basis points of core margin expansion in fiscal '23 on low single-digit revenue growth. In summary, Jabil is not only well-diversified but also markedly more resilient due to our multiyear proactive alerts to diversify our business and align to tomorrow's trends. As a result, we feel the outlook for our business is solid and expect demand to be resilient with year-over-year revenue growth at an enterprise level to be approximately 3% for FY '23 in spite of an economic slowdown. Moving to the next slide.\n\nFor FY '23, we expect core operating margins to improve by a conservative 20 basis points over the prior year mainly driven by end market growth and improved mix of business. We also expect the investments we've made in areas such as IT, automation, and factory digitization will drive improved optimization across our footprint, which will translate to higher margins in the future. Turning now to our capex guidance for FY '23. Net capital expenditures are expected to be in the range of $875 million or 2.5% of net revenue.\n\nThis will come through a combination of both maintenance and strategic investments for future growth and efficiency gains. In FY '23, we expect to continue to invest in targeted areas of our business with the bulk of our strategic growth capex aimed at the automotive EV space, along with the healthcare, 5G wireless, power generation, and industrial end markets, generating multiyear returns in FY '23 and beyond. Our improved profitability, strong operational performance and disciplined investment has yielded significant cash flow over the last few years, which has allowed the company to strategically invest in higher return areas of our business. Moving forward, we expect to continue generating strong cash flows.\n\nThis is possible as a result of earnings expansion, along with our team's disciplined approach and ability to execute. In FY '23, we expect to generate adjusted free cash flow of more than $900 million. It is important to note that this estimate is based on our current expectations of a moderation in growth and continuing supply chain constraints in certain secular end markets. Paradoxically, a more severe recession is likely to improve cash flows due to the working capital nature of our business.\n\nMoving to the next slide. A key aspect of delivering high returns and delivering long-term value to shareholders is ensuring our capital structure is appropriately balanced and optimized. Over the last year, the team has done an outstanding job of building a solid and flexible debt and liquidity profile with current maturities appropriately staggered at an attractive interest rate. We ended FY '22 with committed capacity on global credit facilities of $3.8 billion.\n\nWith this available capacity, along with our year-end cash balance, Jabil ended the year with access to more than $5.3 billion of available liquidity, which we believe affords us ample flexibility. And importantly, we're fully committed to maintaining our investment-grade credit profile. Turning now to our capital allocation framework. In fiscal '23 and beyond, we expect to generate significant free cash flow.\n\nGiven this dynamic, it's an appropriate time to reiterate our capital allocation priorities and at a high level, how we plan to deploy our capital over the next two years. This morning, included in our earnings filing, we announced a $1 billion share repurchase program authorization from our Board of Directors. With this incremental authorization, we have approximately $1.3 billion in total share repurchase authorization, reflecting our belief and confidence in Jabil's ability to generate strong earnings and free cash flows. Turning now to our first quarter guidance on the next slide.\n\nEMS segment revenue is expected to increase 2% on a year-over-year basis to $4.8 billion. And EMS segment revenue is expected to be $4.5 billion, an increase of approximately 15% over the prior year. We expect total company revenue in the first quarter of fiscal '23 to be in the range of $9 billion to $9.6 billion. Core operating income is estimated to be in the range of $415 million to $475 million.\n\nGAAP operating income is expected to be in the range of $367 million to $427 million. Core diluted earnings per share is estimated to be in the range of $2 to $2.40. GAAP diluted earnings per share is expected to be in the range of $1.65 to $2.05. Interest expense in the first quarter is estimated to be in the range of $56 million to $60 million and for FY '23 to be approximately $230 million.\n\nOn fiscal '23, we will adopt an annual normalized tax rate for the computation for our core income tax provision to provide better consistency across reporting periods. As a result, the tax rate on core earnings in the first quarter and for the fiscal year is estimated to be 19%. As we transition to our final slide, we expect the momentum underway across our business to continue even in a subdued economic environment. Today, our business serves a diverse plan of end markets and areas that provide confidence in future earnings and cash flows.\n\nWe have deep domain expertise complemented by investments we made in capabilities, all of which gives us confidence in our ability to deliver 4.8% in core margins in FY '23 along with $8.15 in core EPS and more than $900 million in free cash flow. And importantly, our balanced capital allocation framework approach is aligned and focused on driving long-term value creation to shareholders. I'd like to thank you for your time today and thank you for your interest in Jabil. I'll now turn the call over to Mark. \n\nMark Mondello -- Chairman and Chief Executive Officer\n\nThanks, Mike. Good morning. I appreciate everyone taking time to join our call today. I'll begin by saying thanks to our team here at Jabil.\n\nI applaud the terrific care you give our customers while also keeping our people safe. Your attitude is amazing, and your stamina is incredible. Again, thank you. Today marks our fifth annual investor session, a day where we share insights and lay out the groundwork for our business.\n\nAdam and Mike discussed our progress, which largely stems from the construct and pedigree of the company. I'll expand on this and offer more thoughts, starting with our approach. At Jabil, each employee is critical to our success, and everyone deserves to be treated with dignity and respect. As you know, we operate our business across a broad range of geographies with team members that don't look the same, don't talk the same, that have physical limitations and neurodiversities, team members that practice different religions, and team members that have different sexual orientations.\n\nThe diversity we have throughout the company simply makes us better, better as a team, and better for our customers. Second element of our approach pertains to ESG and sustainability. At Jabil, we aim to always do what's right. This includes doing right for our planet and doing right for our communities.\n\nOur focus when it comes to ESG is grounded by our actions. An example is our goal of a 50% reduction in our greenhouse gas emissions by 2030. Another example that we have underway is directed toward mental health, a topic that impacts all of us either directly or indirectly. Lastly, another action worth mentioning is our commitment to giving back.\n\nOur employees collectively are donating 1 million hours of their time during calendar 2022. Although it isn't the 1 million hours per se, it's the positive difference our Jabil team is making around the world. Their efforts are extraordinary and life changing. Next, I'd like to talk about our solutions and how they're enabled by our structure, our investments, and our customers.\n\nYou see, our structure enables our collaboration, which allows us to act with precision and speed. Our investments enable our execution, which allows us to take the ordinary and apply the extraordinary. And our customers enable our obsession. It allows us to solve the complex.\n\nMoving to Slide 41. You'll see a pie chart, which reflects our end markets, a portfolio which provides the foundation from which we run our business today, a foundation that offers a high degree of resiliency for the corporation, resiliency during times of macro and geopolitical disruptions, and doing more typical times when we're faced with the demands put forth by our customers. A real strength of our portfolio is the presence we have in essential end markets that include 5G, electric vehicles, personalized healthcare, cloud computing, and clean energy, markets that we believe will stimulate continued growth in earnings, especially when combined with ongoing refinement and improvement of our more traditional businesses. Let's now take a look at how our business has performed over the last four to five years.\n\nThe eight sectors shown here exhibit the diversified nature of our revenue with each sector having a meaningful contribution to our overall financial results. What's also captured on this slide are the end markets where we've seen good growth, growth that we think will continue on a relative basis as we benefit from secular trends. Please turn to Slide 43, where we'll review our outlook. As Mike alluded to, for FY '23, we plan to deliver revenue of $34.5 billion with a core operating margin of 4.8%, a 20-basis-point expansion when compared to FY '22.\n\nThis translates to $8.15 in core earnings per share, a growth of 7% year on year. In addition, we believe our free cash flow for FY '23 will be in excess of $900 million. Next, if we take our FY '22 results and our FY '23 guidance, step back a bit and look at the past few years, the data would suggest that what we're doing is working. And as I've said previously, being well-diversified in our business is a significant catalyst.\n\nBut diversification for the sake of being diversified isn't all that special. What is special is the composition of our diversification. And if we expand on the current composition of our business, we don't anticipate any single product or any single product family to contribute more than 5% to 6% to our overall earnings in FY '23. And that's a good thing.\n\nMoving on from our financials, I'd like to talk a bit about our purpose. At Jabil, we have a purpose that serves as our ultimate guidepost. And this guidepost places an emphasis on caring, perspective, proper intentions, and truthfulness. These characteristics drive our behaviors in all we do.\n\nI'm proud of our team as they embrace our purpose, and with their firm embrace comes exceptional conduct. If we could now move to Slide 46, where we can go over our path forward. As we think about fiscal '23, we'll certainly measure our success based on financial performance. But we'll also grade ourselves on keeping our people safe, exceptional customer care, and how we interact with our suppliers, suppliers who stood by us and supported us during these most recent difficult times.\n\nBy the way, thanks to everyone listening today who partners with Jabil on the supply side of our business. We're grateful. As our path forward, it's clear that our journey is based on our unique combination of approach, structure, and experience, our confidence in our ability to execute combined with our engineering expertise, our financial outlook which was formed with rational assumptions, and our continued commitment to returning capital to shareholders. In closing, we believe Jabil is making the world just a little bit better, a little bit healthier, and a little bit safer.\n\nTo our entire Jabil team, thank you for making Jabil, Jabil. And in doing what you do each day, I want all of you to be your true self without fear or recourse. I'm honored to serve such a reliable team. With that, I'll now turn the call back to Adam.\n\nAdam Berry\n\nThanks, Mark. There's clearly a lot to like about Jabil today. To summarize, we began by describing how Jabil has undergone deep and sustainable improvements to its business model. And we highlighted the solid foundation upon which the company sits today.\n\nThen Mike walked you through our financial playbook, highlighted by the strength of our portfolio, fueled by long-term secular tailwinds. And importantly, Mike talked about our financial outlook against a challenged macroeconomic background. To reiterate, today, demand still remains strong and well ahead of supply. But as Mike noted, conservatism has been baked into today's model, which anticipates good revenue growth, expanding margins, and strong cash flows.\n\nAnd finally, to wrap up our session today, Mark offered insight into our unique approach, solutions, portfolio, and purpose. I want to thank you for your time today, and we appreciate your interest in Jabil. Operator, we're now ready for Q&A.\n\nOperator\n\nThank you. And I'll be conducting a question-and-answer session. [Operator instructions] One moment please while we pause for questions. Our first question today is coming from Jim Suva from Citi.\n\nYour line is now live.\n\nJim Suva -- Citi -- Analyst\n\nThank you and congratulations on the results and very strong outlook for both the quarter and the year. Our thoughts, of course, go out to you and your loved ones and families as the weather looks like it's getting quite negative there with the hurricane. In lieu of that, just wanted to know your outlook for the first quarter and full year. Does it build in a little bit for hurricane? I know it's hard to predict, and I'm sure you've got a playbook for closing up factories and making sure, importantly, employees are safe and communicating with customers.\n\nBut I assume that there's something built in there. Is that true? And I assume you're probably going through procedures for the negative weather situation. Thank you so much.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nThanks for the comments, Jim. Yeah, we are. You know, if I think about the last number of years, starting with COVID and indexing all the way through today, we've dealt with a lot of challenges, which, by the way, to me, as I said in my prepared remarks, makes our team, I don't know, even more reliable and more terrific when we think about power outages and COVID and COVID lingering and COVID shutdowns and geopolitical issues and the unfortunate continued war in Ukraine and inflation and rising costs. And now we've -- we're dealing with what looks to be a fairly nasty storm in the Tampa Bay area.\n\nSpecific to the storm, these things ebb and flow by the hour. Right now, the outlook doesn't look so good. To put that in context, we've got about 250,000-plus people in the company around the world. We've got around 3,000 in the Tampa Bay area.\n\nSo first and foremost, right after we get off the call, we'll go around again and check to be sure everybody is doing the right things. And after the storm passes, we'll be sure everybody is OK, much like we do in any geography. So -- and we do have our defense and aerospace factory here, and we'll use standard Jabil protocols. We've closed the campus starting this afternoon, and the campus will be closed through the end of the week.\n\nThere'll be no material impact whatsoever to Q1 or our guide for '23. And again, Jim, appreciate the kind words.\n\nJim Suva -- Citi -- Analyst\n\nGreat. And then as my quick follow-up, it sounds like your consignment model and cloud business is actually progressing to be a more deeper relationship than, say, a couple of years ago. Is that true? And does this lead to kind of increasingly more opportunities both on maybe less so revenues because it's a net model, but more so profitability and more potential improvement in margins?\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nMaybe I could break that into two. First, on the depth of the relationship. The depth of the relationship we have with our largest customer in the cloud business is substantial. And we really appreciate that, and we work really hard to earn that, but that relationship is in great shape.\n\nWhen I think about all of our relationships in the cloud, 5G wireless area, we're really pleased with the areas in which we get to participate and feel pretty bullish about that through '23 and hopefully going into '24. Specific to the cloud business, Jim, you alluded to the fact that I think we first started talking about our strategy that we had around a geo-centric configuration type of solution in the cloud space, largely around enhanced flexibility, agility, and taking a lot of inventory and slack out of the supply chain. That's proven to be a good assumption. I think we started talking about this back in 2018, '19 time frame.\n\nWe also, at that same point in time early on, we crafted this business to be -- and Mike talked about this a bit, what we kind of talk about is asset light. So lots of agility, lots of speed in the configuration, moving very quickly, low count of fixed assets on a relative basis to other parts of our business and then very efficient working capital management. As part of that, we use this term consignment, and I don't want people to be confused about what consignment is. Consignment isn't any type of financial tool or anything we do to juice up margins per se.\n\nConsignment is simply around -- when we take a look at what we do in the supply chain, what values we add, there's simply some materials based with our relationship with the suppliers, as well as our customers where we add very little value. And so based on that, we continue to evolve and craft the supply chain in our cloud business, where we're spending most of our time adding great value. The impact of that, and again, Mike talked about this in his prepared remarks, is that for fiscal '23, roughly, give or take a bit, about $500 million of material content will come out of the natural cloud business for '23. And so, the impact of that is if you look at the slides we presented, our cloud business going from FY '22 to FY '23 on a dollar basis, I think, shows a $200 million decline, '22 to '23.\n\nI don't remember the exact slides, but we've been through the numbers enough. So, cloud, 5G wireless was about a $6.5 billion business in '22. Cloud, 5G wireless in '23 will be a bit lower than that in the $6.3 billion, $6.4 billion range. But on a unit volume basis, volumes are up.\n\nAnd growth is exactly where we thought it would be for '23. So again, the dollars can appear a little bit distorted, but that is all about the fact that it's a continuation of running the cloud business in an asset-light manner.\n\nJim Suva -- Citi -- Analyst\n\nThank you and congratulations once again.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nThanks, Jim. \n\nOperator\n\nThank you. Our next question is coming from Ruplu Bhattacharya from Bank of America. Your line is now live. Perhaps your line is on mute.\n\nPlease pickup your handset.\n\nRuplu Bhattacharya -- Bank of America Merrill Lynch -- Analyst\n\nIt's Ruplu, and I hope you guys are staying safe over there in Florida. Mark, I have a couple of questions for you. First, on the EMS business. Can you talk a little bit about the seasonality of that business? I mean, there's so many different end markets there.\n\nYou're guiding for strong growth. But just as we think about fiscal '23, how should we think about seasonality in that business?\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nHow should you think about seasonality? I just don't -- Ruplu, I know where you're getting at, right? I don't -- I just don't think seasonality -- I don't think of seasonality in the EMS space. It's really about the evolving construct of the business. So what might appear on the surface as seasonality is just a continuance of reshaping that business again as we focus on a good blend of margins and cash flows. I guess for modeling purposes, I don't want to be too prescript here, but I think with the guide that Mike provided for Q1 of '23, I think our margins on the EMS side year on year, I would guess we'll be up 20, 30 basis points.\n\nSo, if you take a look at EMS by -- and in and of itself, if you take a look at Q1 '22, you match that to Q1 '23, I would think the EMS margins will be up again 20, 30 basis points. And then if you kind of extrapolate out Q2, Q3, Q4, I would guess margins will be similar as they were in '22. And I think the best part of the overall story with EMS is in FY '21, I think our EMS margins were sub 4%. I think in FY '22, our EMS margins were 4.3%.\n\nAnd I think in FY '23, the EMS margins will be closer to 4.5% to 4.6%, somewhere in that range.\n\nOperator\n\nThank you. Our next question today is coming from Matt Sheerin from Stifel. Your line is now live.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nHi, yes, thanks, and good morning. And thanks for all the good information so far. A couple of questions for me. One, just in your outlook.\n\nYou're guiding networking and storage up roughly 6% for next year. A little surprising and strong, given concerns about IT spending slowdown. Is there -- are you getting a positive forecast from customers of the supply constraints easing? And is that giving you some more confidence in your guide? Any color there would be great.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nSure, Matt. I don't think it's -- I think we would agree with you on the demand side. In overall general terms, I would say the 5, 6 points of upside is two things. A, there is still a decent amount of backlog that needs to be replenished.\n\nAnd supply chain is getting better, albeit slowly, but moving in the right direction. And number two is a lot of that is what I would kind of consider wonderful customers but legacy customers, nonetheless. And we continue to pick up small pockets of share in the business. So, I would say those are the main two components driving the growth from '22 to '23.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nOK. And then just a couple of smaller questions. One, just on your outlook. I don't think you provided a share count guide for Q1 or for '23.\n\nDoes your '23 guide contemplate lower shares with the buyback?\n\nMike Dastoor -- Chief Financial Officer\n\nHey, Matt. Yeah, it does. I would use so for the year were about 138 million to 140 million and for Q1 in the 141, 142 range.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nOK. And just lastly, on the consignment shift with the cloud business, that 500 million, does that begin this quarter so that's reflected in the year-over-year growth rates in Q1?\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nI would say the -- our best estimate is if you notice, as you guys build out your models, I think you'll see what could appear to be maybe a little bit of distortion first half to second half if you compare '22 to '23, specifically on the EMS side. That would suggest that the -- most of the consignment impact for the year will be toward the back half.\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nOK, great. Thanks so much again.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nYes. Thank you.\n\nOperator\n\nThank you. Your next question is coming from Steven Fox from Fox Advisors. Your line is now live.\n\nSteven Fox -- Fox Advisors -- Analyst\n\nHi. Good morning, everyone. Two questions from me if I could. First of all, Mark, can you give us a sense of how your manufacturing footprint has changed over, say, the past year and into -- how you're planning to change it next year, not so much like where things are located but maybe capabilities in different regions.\n\nAnd if you could just maybe dial in a little bit on India and Southeast Asia ex China. And then as a follow-up, Mark -- Mike, can you talk about the cash flows a little bit more? So, the buybacks are -- now you have a pretty huge percentage relative to your market cap sort of earmarked for buybacks. You're saying 80% of cash flows. And obviously, there's a range of cash flow outcomes depending on what you do with inventories.\n\nCan we assume that, that 80% is solid no matter what cash flows turn out? Or if you wind up with a lot more free cash flow because of inventories that maybe you would dial down the buybacks? Thanks.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nLet me comment on the last comment first. And I know Mike will add to it and correct me -- he'll correct me where I'm wrong for sure. But I think the 80%, I think, is firm. And I think that will include the buybacks plus our dividend over the next couple of years, and Mike can expand on that.\n\nIn terms of the footprint, Steve, there's no big changes to our footprint anticipated '22 to '23. We really like the footprint that we have. We think that our current footprint with the number of factories you have in the U.S. and our ability to expand those factories might serve us well to the extent there's some reshoring with clean energy.\n\nWe'll see what happens with the CHIPS Act. We've been staying very close to that directly with our friends in D.C. There's a lot of details that need to be worked out there. But that's one thing I could think about.\n\nBut as we often say, the nice thing about Jabil is if you take a look at our capabilities, you take a look at our scale, almost independent of geopolitical issues, there's going to be some bumpiness for sure on the macro. But over the next three to five years, there's a lot of things that still need to be built. And we build stuff, and we do it awfully well. And we can accommodate the needs of nearly any geography either on the supply side or the demand side.\n\nI would -- I think you asked about Southeast Asia and India. Over the last number of years, we've expanded into and continue to grow in Malaysia. We've ramped up a wonderful campus in Vietnam. We'll continue -- Southeast Asia will certainly continue to be of interest to us.\n\nBy the way, we also have a wonderful footprint in Mainland China that we're pleased with. And then lastly, for India, I think India, we've done what I would consider moderate, maybe even modest on a relative-basis investments in India around the Mumbai area in Pune. And that campus continues to scale. If I had to wave a magic wand and kind of guess what things might look like in India, say, in FY '24 or '25, my guess would be our footprint in India will be greater in fiscal '24 and '25 than it is today.\n\nMike Dastoor -- Chief Financial Officer\n\nAnd Steve, on your buyback question, if you look at what we've done in FY '22, we repurchased almost $700 million of our shares. We'll continue to be well-balanced in our approach and opportunistic at the same time. But we have an additional authorization of another $1 billion, bringing our total authorized almost $1.3 billion. If you look at the end markets that we play in, the secular tailwinds that we continue to see, our margin accretion, our EPS accretion, cash flow accretion, all leads me to think that we're highly undervalued.\n\nAnd we feel buybacks is the best way to tackle that issue.\n\nSteven Fox -- Fox Advisors -- Analyst\n\nGreat. All of that's super helpful. Of course, positioned the best regarding the area. Thank you.\n\nOperator\n\nThank you. Your next question is coming from Mark Delaney from Goldman Sachs. Your line is now live.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nYes. Good morning. Thank you for taking the question and let me add my thoughts for everyone in Florida. The company's fiscal '23 guidance assumes a slowdown in certain end markets, even though, as I understand it, demand is generally strong.\n\nSo double-click on that a bit, better understand. Are there end markets where the company has seen signs of macro-related slowness as you start fiscal '23? Or is it really related to your assumptions about what may materialize based on your history with the business?\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nWell, this is ever-changing. And we'll see what the next 60, 90, 120 days hold between monetary policy and everything else. I would say, as we sit today, Mark, the only area that we're seeing distinct decline in demand is around connected devices and consumers. Other than that, everything is either flat to up.\n\nI spoke about the 5G cloud. Again, unit volumes are up. So, of the eight sectors that we talk about in our business, the one that's down based on demand or our belief of what's going to happen in demand is in the area of consumer products and connected devices.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nThat's helpful. On supply chain, you said it's getting somewhat better but still issues. Are the issues semiconductor supply demand? Or are there other supply chain constraints that the company is dealing with? And can you just elaborate a little bit more on how you see that playing out over the course of fiscal '23? \n\nMark Mondello -- Chairman and Chief Executive Officer\n\nI'd say if we go back one year ago, say, nine to 12 months ago, we had tremendous challenges more broad-based across the supply chain. As we sit today, we still have pockets of challenges. I'd say the biggest challenges we have are around legacy semiconductors, and probably the biggest friction points continue to be around the EV space and the healthcare space. But on a relative basis, what we said the last number of calls is our Jabil team is doing a wonderful job in securing parts relative to others.\n\nSo we'll continue to secure the parts. Our -- the nice thing about how we look to forecast the business, whether it's on an annual basis like today where we go a degree deeper, it's on our quarterly calls, with our systems, our IT systems, how everything is linked together in terms of our factories, it really allows us real time to understand the puts and the takes of the business from the bottoms up. So, we start every single session with input and data from the factories, as well as the customers. So, I think we've contemplated all of the supply chain issues that are at hand at the moment as we've offered the outlook for '23.\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nIf I could sneak one last question in. The company mentioned electricity costs going higher in China, although I think, unfortunately, they're also higher in Europe. Maybe you could remind us to what extent those are typically part of the cost-plus structure? And are you expecting you can pass on higher electricity costs in fiscal '23? Or is that maybe a headwind you baked into the guidance? Thank you and congratulations on the good results.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nSo I think things are very -- are different. Maybe they're both going to be rising. You talked about China. Again, we saw some power outages there in the fourth quarter.\n\nWe baked in some conservatism there for '23, although it's modest. In terms of Europe, our two big revenue generators are Poland and Hungary. We've taken a hard look at and kind of done a deep dive in the construct of Poland and Hungary to generate their power. We think the impact to us through the winter months in Europe will be modest as well.\n\nAnd I would just say that if I just kind of wrap that up into Jabil's more global footprint, we have seen and we'll continue to see rising costs in various areas of our business. And we handle that differently with every single customer depending on the relationship, the terms, and the overall economics. The good news is I think we've given appropriate if not deep consideration to all of that. And we're still bringing forward an outlook for '23 that takes margins up 20 basis points to 4.8%.\n\nOperator\n\nThank you. Your next question is coming from Shannon Cross from Credit Suisse. Your line is now live.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you very much. I was wondering sort of big picture, as you talk to your customers, industry 4.0 with robotics, 3D printing, AI, ML, all of the technology that people are bringing to bear with regard to manufacturing, I'm wondering how much of that is part of a discussion with your customers, both from sort of a competitive advantage standpoint, as well as the ability to increase margins over time? And as I look at your margin profile, obviously, it's improving, but I'm wondering how much of this is increased automation and things you can do yourself versus mix? And then I have a follow-up. Thank you.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nI like your question because whether it's industry 3.0 or 4.0, I'm not quite sure. But at Jabil, it's kind of 1.0. It's right at the heart of what we do. Our business is complicated at times.\n\nOur strategy is really straightforward. Our strategy gets driven by each of the individual sectors because that's where all the domain expertise lies. And then at an enterprise level, we build stuff. And the better we build stuff, the more flexible we are in building stuff, the better our geography is in serving customers, the better engineering is, the more market share gains we'll continue to capture as we move forward.\n\nAnd Shannon, a big part of that is, again, I think if we're not the largest, we're one of the largest large-scale manufacturing services company in the world. And a huge, huge amount of that is always our opex and our capex investments. And we just believe deeply in investing in the business because, again, we don't want to be making decisions for today that aren't great decisions long term. And those investments are great decisions long term.\n\nSo whether it's AR, VR, whether it's artificial intelligence, whether it's additional data analytics, whether it's robotics, automation, by the way, we make significant investments in those areas. I would guess that independent of our customers between our overall advancement in IT, data analytics, robotics, all of that stuff, our opex investments are probably $400 million to $500 million a year. And we think those are terrific investments for the company and will be very material as we move forward and run this company north of 5% at a very large scale.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nThank you. And this is kind of a derivative question but currency. I'm wondering how that comes into the conversations with customers in terms of where you're manufacturing versus some of the currency moves or if it's a topic of discussion at all, given where everything has moved in the last, say, six months, there have been some pretty aggressive currency swings. So, I'm just wondering if that comes up in any of your discussions.\n\nThanks.\n\nMike Dastoor -- Chief Financial Officer\n\nSure. So, I'll answer that. I think if you look at how we structure our pricing, etc., the revenue is mainly predominantly U.S. dollar-based bill of material that we buy from suppliers is mainly predominantly U.S.\n\ndollar-based. The value add that you get, the local labor, the local cost, yes, those fluctuate. We do have true-up mechanisms with our customers to reprice if there's a significant move. And we also hedge our FX on the value-add portion as well.\n\nSo overall, FX is not something I lose sleep over.\n\nShannon Cross -- Credit Suisse -- Analyst\n\nOK. Thank you.\n\nOperator\n\nThank you. Our next question today is coming from Paul Chung from J.P. Morgan. Your line is now live.\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nHi. Thanks for taking my question. So just some follow-ups on cap allocation. Very strong free cash flow here at the end of the year and pretty nice outlook here kind of approaching $1 billion annually.\n\nSo why not increase the authorization higher? And then secondly, on the kind of acquisitions front, where should we expect the firm to be a little bit more active here? Should we expect kind of this continued in-house investments for customers and reimbursement? Or where can the firm be a little bit more active given some depressed private valuations here?\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nHi. Thanks for the questions, Paul. Just on the buybacks, I think your comment was, why not be more aggressive? I think we're being very aggressive. If we just take a look at cash flows we dealt -- we delivered in '22 and the level of buyback, the level of buybacks, and Mike talked about this level of buybacks in '22 was north of $700 million on free cash flows of $800 million.\n\nI consider that extremely aggressive. By the way, that doesn't include our dividend. If I think about '23 and '24, Mike talked about the fact that we got authorization for an extra $1 billion. We add that to the unused portion of the prior authorization, that puts in play about $1.3 billion.\n\nIf I think about our free cash flow this year being $900 million, and we're saying nothing about fiscal '24, but hypothetically, let's say it was around $1 billion, you got $1.9 billion in free cash flow. And now you're talking about a total authorization of $1.3 billion plus another $100 million plus for dividend, you're talking about us returning $1.4 billion or give or take against free cash flows of $1.9 billion. So, I think that's appropriate, and we could debate whether or not it's aggressive enough. But I think it's a very nice returning capital directly to shareholders in terms of M&A, we think -- so again, I think one of the charm, the real charming part of being in our business with all the complexities is it's a big world out there.\n\nAnd I said earlier, there's lots and lots and lots of things that need to be built. And the world is not going to become virtual completely, and the world is not going to become kind of holographic. It's like there's hard things. We talk internally sometimes, a big part of the way we run the business is digital with 1s and 0s.\n\nBut the output of that is based in atoms. I mean, they're hard, tangible things we build. And again, the market is massive. So I just -- we will continue to do small acquisitions, largely around acquiring engineering talent and technical capabilities.\n\nBut the best use of our capital, A, is exactly what you alluded to is at these valuations, returning capital to shareholders via dividends and buyback. And then also the best use of our cash is both capex and opex investments, again, with an eye on continuing to pick up share, continuing to position us in a very dominant portion of the overall supply chain, and also with an eye on getting the margins for the company over 5% on a sustainable basis.\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nThank you. And then just a quick follow-up on component inflation. Are you starting to see kind of more normalized prices in the market today? And then if we start to see more kind of deflationary environment on components, how do we think about the impact on margins and cash flows? Thank you.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nI would say to your -- the first part of your question is the overall -- if I take a look at all of our bill of materials, which are in the tens of thousands and extrapolate this comment over all of it, the supply chain is very mixed. There's some part of the supply chain that's already more normalized, and there's some part of the supply chain remaining that's inflationary. I think that continues to move in the direction of -- over time of being more normalized. And in terms of the bill of materials becoming deflationary, I don't think we have to worry about that so much in '23.\n\nWe'll see what happens in the first half of '24. But we've been doing this a long time. And if you just kind of think about the 55 years that Jabil has been in business and maybe focus on the last 30, it's just been a continuous sine wave of up, down, up, down, up, down in terms of our variable costs or fixed costs and cost of bill of material. I think we'll continue to navigate.\n\nWe'll continue to navigate that quite well with customers. And I don't envision -- I certainly don't envision -- we wouldn't have guided the 4.8% this year if we thought there was a risk to that. And I think this morning alone, I've mentioned the idea of running the company at 5% with, I think, a purposeful consideration of what might happen to the materials market, the component market, and our bill of materials, we feel pretty confident of driving the margins to 5%.\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nGreat. Thank you.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nYes. You're welcome.\n\nOperator\n\nThank you. Next question today is coming from Melissa Fairbanks from Raymond James. Your line is now live.\n\nMelissa Fairbanks -- Raymond James -- Analyst\n\nGreat. Thanks very much, guys. I'm hunkering down just south of you. It looks like they're calling for a direct hit here now.\n\nSo quite an eventful day for all of us, I guess. You mentioned supply is starting to ease. Can you share if that's more due to just Jabil sourcing, just improved efficiency on your part? Or are you seeing it free up more generally? And then I've got a follow-up to that.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nWell, Melissa, first off, keep yourself safe. And I don't think today is going to be all that exciting, but certainly, starting at noon tomorrow, I think things will get interesting. So please keep safe. In terms of the overall bill of material, I think some of it is our scale and our leverage.\n\nAnd I mentioned in my prepared remarks, we just have a wonderful network of suppliers. So, I think that's part of it. I think the other part of it is with the current monetary policies and things going on around the world, I think in general, and this is now becoming maybe a little bit more, and I used the word a little bit, a little bit more of the rule versus the exception. But I think demand in general on a macro basis will start to soften a bit.\n\nI mentioned earlier that we're seeing it largely around consumer product, connected devices. But I think demand will start to soften a bit. And I think that's going to help with overall supply chain, both continuity and supply as we move forward in the next nine, 12, 18 months.\n\nMelissa Fairbanks -- Raymond James -- Analyst\n\nOK. Great. And then you mentioned inventories would be worked down over time. What would be your ideal inventory target? Is there excess inventory that you're holding that you're specifically looking to destock?\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nSo, there's inventories we're holding today that -- yes, I love your term. We would like to destock those, and we're going to work very hard to destock some of these things in FY '23. They were put there with purpose. They're there to support the customers.\n\nThe old adage of the golden Screw deal. We've been dealing with that for a long, long time. We think that starts to normalize the back half of '23. And so, I would guess we're very pleased, by the way, with the progress that we've made in terms of days of inventory reduction as we got to the back half of fiscal '22.\n\nAnd I would guess we'll see a similar trajectory as we move through '23 on a relative basis. So, I'd be really disappointed if we're sitting here, let's say, in the second half of '23 and our overall inventory levels are not down in a material way.\n\nMike Dastoor -- Chief Financial Officer\n\nAnd Melissa, just as a reminder, most of our inventory is actually raw materials and WIP. There is very little finished goods. So, we don't have a finished good problem or any such lag. It's the raw materials and WIP.\n\nAs Mark said, we bring it in for our customers after they place a piece. So, they're legally contractually obligated with that inventory as well. So, it's just a matter of the golden screw coming through and our manufacturing churning our products. It's a relatively different inventory situation than perhaps retailers or any other type of market.\n\nMelissa Fairbanks -- Raymond James -- Analyst\n\nSure. Perfect. Thanks very much. That's all for me.\n\nStay safe, guys.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nYou, too, Melissa. Thank you.\n\nOperator\n\nThank you. Your next question is a follow-up from Ruplu Bhattacharya from Bank of America. Your line is now live.\n\nRuplu Bhattacharya -- Bank of America Merrill Lynch -- Analyst\n\nHi. Thanks for taking the follow-up, and Mark thanks for all the details you gave so far. I wanted to ask you a question on risk management in the DMS segment. If we look at mobility revenues, right, so fiscal '22 came in a little bit lower than what you had expected $100 million, and you're guiding another $100 million lower for fiscal '23.\n\nBut now connected devices, as you said, is a consumer-facing end market, and you're guiding that down 9%. So, when I look at these two things, mobility and connected devices, they're about 47% of the fiscal '23 guide for DMS. In case these markets are weaker than what you expect, how would your playbook change? Are there areas of investment that you would switch to other areas? And overall, do you think that there's enough strength in the automotive and healthcare segments that, that strength can balance any weakness in these other two segments? So just your thoughts on if there's incremental weakness in these two end markets, mobility, and connected devices, how your playbook changes. Thanks.\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nJust a general comment that I don't think has much to do with your question. I think the one area I'd look at is in overall DMS, we continue to see awfully good growth in EVs, automotive, and transport. And we see a good, stable, growing business in healthcare and packaging. So I'm not sure on your math on connected devices and mobility being 47% other than -- and then we give it to you on the chart.\n\nI'm just thinking about as we move into '24, '25 from an overall risk standpoint, I would -- I think we're going to continue to see good trajectory of growth in the automotive, transport, healthcare, packaging as we move beyond '23. That's point number one. Point number two is I think trying to put together at least in regards to Jabil-specific, trying to put together connected devices with mobility, I wouldn't do that because there's different elements of those businesses beyond just raw demand that are material to Jabil in terms of our realized demand versus the overall marketplace. And last point to your question, I think on connected devices and mobility in general, as we sit today, the way in which we run both of those businesses and the way in which we have agreed commercial terms with the customers puts us in a situation where we feel pretty good in terms of risk management to both areas of the business.\n\nYes, sorry, I think you got cut off earlier. I apologize for that.\n\nYes. And sorry, I think you got cut off earlier. I apologize for that.\n\nOperator\n\nThank you. We have reached the end of our question-and-answer session. I'd like to turn the floor back over for any further closing comments.\n\nAdam Berry\n\nOur call has concluded. Thank you for your interest in Jabil.\n\nOperator\n\n[Operator signoff]\n\nDuration: 0 minutes\n\nAdam Berry\n\nMike Dastoor -- Chief Financial Officer\n\nMark Mondello -- Chairman and Chief Executive Officer\n\nJim Suva -- Citi -- Analyst\n\nRuplu Bhattacharya -- Bank of America Merrill Lynch -- Analyst\n\nMatt Sheerin -- Stifel Financial Corp. -- Analyst\n\nSteven Fox -- Fox Advisors -- Analyst\n\nMark Delaney -- Goldman Sachs -- Analyst\n\nShannon Cross -- Credit Suisse -- Analyst\n\nPaul Chung -- J.P. Morgan -- Analyst\n\nMelissa Fairbanks -- Raymond James -- Analyst\n\nMore JBL analysis\n\nAll earnings call transcripts"
}